{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-5507-refundable-nfts/10451",
            "title": "EIP-5507: Refundable NFTs ",
            "index": 10451,
            "category": [
                "Tokens"
            ],
            "tags": [
                "nft"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "1",
                    "likes": "1",
                    "time": "19/08/2022-16:44:00",
                    "content": "  github.com/ethereum/EIPs         Add EIP-5507: Refundable NFTs   ethereum:master ← Pandapip1:patch-13              opened 04:41PM - 19 Aug 22 UTC                 Pandapip1               +121 -0       CC @elie222  Based off of (but incompatible with) ERC721R: https://github.com/…exo-digital-labs/ERC721R/issues/37#issuecomment-1197571685       ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pull/5507",
                        "https://github.com/Pandapip1",
                        "https://github.com/ethereum/EIPs/pull/5507/files",
                        "https://github.com/ethereum/EIPs/pull/5507"
                    ],
                    "GPT-summary": "The post is a proposal for EIP-5507: Refundable NFTs. The author is explaining the proposal and providing a link to the GitHub page. The post also mentions that the proposal is based off of ERC721R but is incompatible with it. The author is not asking for feedback, but a third party is mentioned in the post. The third party is not giving entirely positive or negative feedback, but rather constructive criticism.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SamWilsn",
                    "index": "2",
                    "likes": "0",
                    "time": "02/09/2022-21:18:32",
                    "content": "Bit of bikeshedding on the function names. The base interfaces you’re extending don’t use a get prefix for getters.   refundOf, or maybe compensationOf.  refundableUntil?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 0.9999999999999998
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "3",
                    "likes": "0",
                    "time": "03/09/2022-02:03:48",
                    "content": "refundOf and refundDeadlineOf seem like sensible names. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/5cent-AI",
                    "index": "4",
                    "likes": "0",
                    "time": "18/01/2023-02:11:41",
                    "content": "Have to say, this is an amazing idea. I had a similar idea before and paid attention to its early version 721R. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/5cent-AI",
                    "index": "5",
                    "likes": "0",
                    "time": "18/01/2023-02:18:52",
                    "content": "For EIP-721 Refund Extension and EIP-1155 Refund Extension, it is recommended to support batch refunds to improve efficiency. EIP-721 Refund Extension : function refund(uint256[] tokenId) external;  EIP-1155 Refund Extension:  function refund(uint256[] tokenId, uint256[] amount) external;  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "6",
                    "likes": "0",
                    "time": "18/01/2023-03:57:04",
                    "content": "How does this increase efficiency? Generic multicalls make this entirely redundant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/5cent-AI",
                    "index": "8",
                    "likes": "0",
                    "time": "18/01/2023-05:09:53",
                    "content": "Refunds for multiple NFTs can be combined into 1 transaction. For example, NFT#1:1ETH;nft#2:2ETH;nft#3:3ETH This method can directly transfer 6ETH to the refunder. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "9",
                    "likes": "0",
                    "time": "18/01/2023-14:22:50",
                    "content": "This is fair enough, but with EIP-5920: PAY opcode (CFI Cancun), this would take effectively the same amount of gas. This does remind me: multicall hasn’t been standardized yet. I’ll go ahead and do that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/william1293",
                    "index": "10",
                    "likes": "2",
                    "time": "18/02/2023-15:32:25",
                    "content": "In fact, in the UK and other EU countries, consumers are legally entitled to a 14-day cooling-off period when purchasing goods or services online, under what is known as the “Distance Selling Regulations”, which also cover digital goods and downloads, such as books, in-game purchases, and NFTs. So, perhaps in the sale of NFTs, eip5507 is not optional but mandatory. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SamWilsn",
                    "index": "11",
                    "likes": "0",
                    "time": "24/02/2023-02:38:13",
                    "content": "I’d like to discuss the motivation for this proposal, in the context of whether or not it should be an ERC. I want to make it very clear that I do see a non-zero value in having refundable tokens, but I don’t believe the idea is general enough to be put in an EIP.  Greater Compliance with EU “Distance Selling Regulations,” which require a 14-day refund period for goods (such as tokens) purchased online  Presumably any token sale in the EU—and not just the initial purchase—needs to have the 14 day return policy?   NFT marketplaces could place a badge indicating that the NFT is still refundable on listings, and offer to refund NFTs instead of listing them on the marketplace   I fear this will cause more trouble than its worth. If the badge is automated, a malicious contract could claim to support ERC-5507, but not actually allow users to refund. If the badge is manual, only high profile (or high paying) tokens will get the verification on marketplaces.  DExes could offer to refund tokens if doing so would give a higher yield  If possible, this one seems like a point in favour of standardizing. I’d like to see some comments from an exchange developer to see what their thoughts on this are.  Better wallet confirmation dialogs  I’m not sure I understand this one. Would this just be a notice on the transaction signing screen that says “this token might be refundable”? If so, how would a wallet decide to show it? Heuristics on mint functions?  All of that aside, I have a few more technical-ish questions:  What differentiates a refund from a collateral-backed loan with an expiry date? Are there existing standards/libraries that handle these loans we could take inspiration from? Why does this need to be an extension on the token itself, and not in a separate escrow contract? Could an attacker mint large amounts of the token, dump it on the market while the token is hot, buy it back once the token price drops and refund it?   Further:  in terms of the smallest divisible unit  Should that be “indivisible” unit? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6226708074534155
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "12",
                    "likes": "2",
                    "time": "24/02/2023-14:09:14",
                    "content": "    SamWilsn:  Presumably any token sale in the EU—and not just the initial purchase—needs to have the 14 day return policy?   Yes. But this helps specifically for ITOs, which would definitely require greater legal scrutiny. This is mentioned in the abstract (emphasis added):  This ERC adds refund functionality for initial token offerings to ERC-20, ERC-721, and ERC-1155.      SamWilsn:  I’m not sure I understand this one. Would this just be a notice on the transaction signing screen that says “this token might be refundable”? If so, how would a wallet decide to show it? Heuristics on mint functions?   I meant special prompts, for example with ERC-20/721/1155 transfer. Instead of an ugly prompt showing the ABI-decoded transaction data, the wallets could instead display a more human-readable prompt.     SamWilsn:  Should that be “indivisible” unit?   Yes. Thanks for catching that typo! ",
                    "links": [
                        "https://eips.ethereum.org/eip-721.md",
                        "https://eips.ethereum.org/eip-1155.md"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.707792207792208
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "13",
                    "likes": "0",
                    "time": "24/02/2023-14:13:26",
                    "content": "    SamWilsn:   What differentiates a refund from a collateral-backed loan with an expiry date? Are there existing standards/libraries that handle these loans we could take inspiration from?    I don’t think there’s any functional difference here. But “collateral-backed loan with an expiry date” is harder to understand than “tokens are refundable until X date.”     SamWilsn:   Why does this need to be an extension on the token itself, and not in a separate escrow contract?    Easier introspection by DApps, and avoiding extra gas fees through unnecessary CALLs.     SamWilsn:   Could an attacker mint large amounts of the token, dump it on the market while the token is hot, buy it back once the token price drops and refund it?    Yes. This is a feature, not a bug. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.970238095238095
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "14",
                    "likes": "0",
                    "time": "24/02/2023-14:13:48",
                    "content": "    SamWilsn:  Are there existing standards/libraries that handle these loans we could take inspiration from?   Not that I’m aware of. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dievardump",
                    "index": "15",
                    "likes": "0",
                    "time": "28/02/2023-07:47:41",
                    "content": "I think this should be in the metadata, not in the contract. 0.1eth on day of purchase will not be 0.1eth on day of asking refund. So this can not be directly automated on-chain. Needs to go through projects’ management contact. So an EIP, maybe, but not to standardize the behavior on-chain, only its representation in the meta: until when it can be refunded, and who to contact/how to contact them to get this refund. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/5cent-AI",
                    "index": "16",
                    "likes": "1",
                    "time": "28/02/2023-09:37:14",
                    "content": "I have learned about some projects that promised refunds, but their verbal or written promises were not trusted by community members, even if these projects had a strong background. Community members accept that code is law, and on-chain automated execution is a more trusted mechanism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.333333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dievardump",
                    "index": "17",
                    "likes": "0",
                    "time": "28/02/2023-10:26:23",
                    "content": "That people are trusting the companies or not should definitely not be the concern of the EIP. I do think it’s good to add refund policy and contact somewhere, but I don’t think it can work on-chain, for various reasons:  Not everyone buys using a wallet. You can buy using credit card and expect refunds to happen to your bank account. Any company doing off-ramp will redirect you to the seller’s websit if you ask them about refund policy. calling refund has a tx cost. There is nothing to stop a company to make fees to ask the refund so expensive that people will just never call it. ETH price varies way too much. It will require an oracle to do the refund (to store $/€ price at buy time or to retrieve it at refund time), which again will be very expensive both in term of fees for the buyer/refund asker & the seller. People are (righlty) using more and more hot wallet to buy stuff and then send to cold wallet. This would void the policy since there is no way to know if this was a sale or not.  I would like to add: European refund policy has exceptions. Concert Tickets, digital content considered “open” after start of use etc… NFTs are still young, but I have little to no doubts the ones with high speculative values will enter these exceptions. Especially because NFTs do not have the same status everywhere in Europe. So for sure we need these for the future, when NFTs will be more than just jpegs, but on-chain is not sustainable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.368125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "18",
                    "likes": "0",
                    "time": "28/02/2023-13:40:27",
                    "content": "    dievardump:  People are (righlty) using more and more hot wallet to buy stuff and then send to cold wallet. This would void the policy since there is no way to know if this was a sale or not.   This EIP does not specify whether the refund should be voided on transfer, and the most common implementation of it doesn’t void it on transfer (a good thing, IMO).     dievardump:  ETH price varies way too much. It will require an oracle to do the refund (to store $/€ price at buy time or to retrieve it at refund time), which again will be very expensive both in term of fees for the buyer/refund asker & the seller.   The approve/refundFrom pattern allows refunds with stablecoins.     dievardump:  calling refund has a tx cost. There is nothing to stop a company to make fees to ask the refund so expensive that people will just never call it.   This is a good point, but it is partially mitigated by AA.     dievardump:  Not everyone buys using a wallet. You can buy using credit card and expect refunds to happen to your bank account. Any company doing off-ramp will redirect you to the seller’s website if you ask them about refund policy.   Again, this can be done using the approve/refundFrom flow.  Side note: do we want to add refundTo/safeRefundTo methods? I’m actually leaning towards yes on this one.     Keep as-is Add refundTo and safeRefundTo Add refundTo and safeRefundTo and REMOVE the old refund     0 voters     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.4642857142857135
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/5cent-AI",
                    "index": "19",
                    "likes": "0",
                    "time": "28/02/2023-23:46:31",
                    "content": "Even if a person buys with a credit card, he still actually owns the wallet. And we can’t implement a direct refund to his credit card, so it doesn’t have to be too complicated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dievardump",
                    "index": "20",
                    "likes": "0",
                    "time": "01/03/2023-00:07:52",
                    "content": "    Pandapip1:  This EIP does not specify whether the refund should be voided on transfer, and the most common implementation of it doesn’t void it on transfer (a good thing, IMO).   Yep my bad. I was actually thinking companies wouldn’t refund something that might have been resold, but thinking about it, as long as you own the receipt, it should be ok.     Pandapip1:  The approve/refundFrom pattern allows refunds with stablecoins.   Good luck saving for each buy the current price in stable. Let’s make those mints way more expensive than they should.     5cent-AI:  Even if a person buys with a credit card, he still actually owns the wallet. And we can’t implement a direct refund to his credit card, so it doesn’t have to be too complicated.   No, lots of places are actually doing custodial stuff. There is a bigger picture to look at here for something supposed to target laws. And if as a consumer I buy with a CC, I want my refund to my CC. Each tx cost. An on-chain refund system will have a hard time to work at scale. Both because of tokens volatility and cost of tx. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.349537037037038
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/5cent-AI",
                    "index": "21",
                    "likes": "0",
                    "time": "01/03/2023-00:54:08",
                    "content": "    dievardump:  lots of places are actually doing custodial stuff.   As of now, I have not seen statistical data to support this conclusion. It does exist, but it is not widespread. Each EIP has its own scope and standards. We may not overcomplicate things and make it inconvenient to adopt, while also considering the importance of its general applicability. If you want to pay with a credit card and the project can also accept credit card payments, then the refund process becomes simpler for you. However, this situation may not be among the issues that this EIP aims to address. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SamWilsn",
                    "index": "22",
                    "likes": "0",
                    "time": "03/03/2023-18:48:33",
                    "content": "    Pandapip1:  I don’t think there’s any functional difference here. But “collateral-backed loan with an expiry date” is harder to understand than “tokens are refundable until X date.”   You’re absolutely right. My point was that this functionality is a subset of a more general primitive, and probably shouldn’t exist on its own.     Pandapip1:      SamWilsn:   Why does this need to be an extension on the token itself, and not in a separate escrow contract?    Easier introspection by DApps, and avoiding extra gas fees through unnecessary CALLs.   On the other hand: this proposal wouldn’t work for existing tokens, and would require re-implementing the same logic in every new compatible token. Since there’s no shared implementation, every token would have to be vetted independently.     Pandapip1:      SamWilsn:   Could an attacker mint large amounts of the token, dump it on the market while the token is hot, buy it back once the token price drops and refund it?    Yes. This is a feature, not a bug.   Doesn’t this unfairly create a scalper market then? Where it becomes common for bots to buy up tokens and resell them, keeping the refund rights to themselves, which kinda invalidates the whole point of this proposal? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.238636363636363
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/5cent-AI",
                    "index": "23",
                    "likes": "0",
                    "time": "07/03/2023-09:11:37",
                    "content": "    SamWilsn:  Doesn’t this unfairly create a scalper market then? Where it becomes common for bots to buy up tokens and resell them, keeping the refund rights to themselves, which kinda invalidates the whole point of this proposal?   This might be a Sybil Attack.  In fact, before this proposal came into being, that is, before it became impossible to refund, many projects were designing various schemes to prevent such things from happening. So in practice, we don’t need to worry about the lack of mature solutions to prevent more robots. In addition, the interface is flexible. For example, it can be set to refund at a certain discount, or there can be no sales activity before the refund, etc. This proposal is  effective in protecting consumers. The problem that consumers face is project teams running away or making excessive promises, or consumers making impulsive purchases due to artificially created FOMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.883078231292517
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SamWilsn",
                    "index": "24",
                    "likes": "0",
                    "time": "08/03/2023-16:22:14",
                    "content": "    5cent-AI:  This might be a Sybil Attack.   I guess it could be considered a Sybil attack if there are some limits on mints-per-person, but in the general sense of a free-for-all anyone can mint, there’s still a new abuse here: the first buyer of the token gets a privilege that later buyers do not.     5cent-AI:  This proposal is effective in protecting consumers.   This is exactly what I’m arguing against. I don’t believe this proposal is effective:  Tokens can pretend to be refundable, but not actually allow refunds. If refunds only belong to the first buyer, then it encourages reselling, and provides little benefit to “actual users”. An escrow contract could accomplish the same thing, for any transaction, not just for the first buyers. This would work for older NFTs too!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.859713203463204
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/5cent-AI",
                    "index": "25",
                    "likes": "0",
                    "time": "09/03/2023-01:25:51",
                    "content": "    SamWilsn:  If refunds only belong to the first buyer, then it encourages reselling, and provides little benefit to “actual users”.       Pandapip1:  This is a feature, not a bug.   I agree with this viewpoint. This is a two-way selection process, where developers can formulate different refund policies, and potential consumers or users can vote with their feet by choosing not to accept refund policies that do not protect their interests. The best refund policy is determined by the theory of free market.     5cent-AI:  This proposal is effective in protecting consumers.   Personally, all other things being equal, I would choose to support a project that has a refund policy rather than one that doesn’t.     SamWilsn:  An escrow contract could accomplish the same thing, for any transaction, not just for the first buyers. This would work for older NFTs too!   It is indeed a good approach. It seems that it could also be achieved through EIP-5507? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.031944444444445
                }
            ]
        }
    ],
    "group_index": "60"
}