{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eth-station-upcoming-event-in-berlin-call-for-action/10415",
            "title": "ETH Station upcoming event in Berlin [call for action] ",
            "index": 10415,
            "category": [
                "Happenings",
                "Council Sessions"
            ],
            "tags": [
                "ethstation"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "1",
                    "likes": "8",
                    "time": "17/08/2022-15:16:43",
                    "content": "We are going to host another event in Berlin during ETH Berlin and Blockchain week!  When, Where Kicking off whole blockchain week, we will host our event on September 11 at 12pm and will end around 6pm at the most cyberpunk friendly venue c-base where we hosted our event back in Summer 2018! Thank you to @ligi for helping us get the most amazing venue   Topics For topics we are keeping it pretty open and would love to get you involved in this process! So far on the agenda is Soulbound token session with @TimDaub and @ra-phael Please let us know which topics you would like to talk about, join discussions, fishbowls by leaving comment under this thread!  Tickets Are live! Make sure to RSVP here  Devcon Ticket Giveaway We are going to give away one free ticket to Devcon, the biggest Ethereum Conference happening October 11th → 14th in Bogotá, Columbia! This is general admission ticket, which will allow you to attend the conference. Terms and Conditions:  To enter Devcon ticket giveaway you must be present at the event in person You must enter your email address and nick name to dedicated place at the event (this will most likely be physical) Devcon ticket winner will be picked randomly by our staff and announced during the event The ticket winner will be contacted via email afterwards and will receive Devcon ticket in digital way via email Devcon ticket is non transferable  We highly encourage to support this community effort by donating to the Ethereum Magicians ✨ | Grants | Gitcoin  image1464×824 60.5 KB  We will edit this post with more updates over time. Yours Ops Team ",
                    "links": [
                        "https://blockchainweek.berlin/#events",
                        "https://c-base.org/",
                        "https://ethereum-magicians.github.io/berlin-council/",
                        "https://ethereum-magicians.org/t/eip-4973-account-bound-tokens/8825",
                        "https://www.eventbrite.com/e/eth-station-tickets-406839867997",
                        "https://devcon.org/",
                        "https://gitcoin.co/grants/223/ethereum-magicians",
                        "https://ethereum-magicians.org/uploads/default/original/2X/5/567024a9605f7b34b4143cc86e3199bc1cd147a6.jpeg"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1489669421487605
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chaser",
                    "index": "2",
                    "likes": "2",
                    "time": "17/08/2022-23:49:30",
                    "content": "I’d gladly join discussions about these topics:  the EL’s relationship with Flashbots in a world of zealous over-compliance the Scourge – how the burning of centralized stake (liquid staking derivative protocols, staking providers, etc.) would look like  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/0xpApaSmURf",
                    "index": "3",
                    "likes": "3",
                    "time": "24/08/2022-10:28:02",
                    "content": "I’m open to chat about smart contract modularity! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.669642857142857
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dominic",
                    "index": "4",
                    "likes": "1",
                    "time": "24/08/2022-13:59:38",
                    "content": "I’m happy to come and move forward light client EIPs and other general EVM improvement proposals. Two I’ve got stake in myself are: Gather for an EIP: Useful Bit manipulation instructions @chfast     EIP-2330: EXTSLOAD and ABI for lower gas cost and off-chain apps EIPs       External clients can already arbitrarily read contract storage slots.  Further, there is a big difference between “giving access to private members of another object is considered bad design” and “accessing private members of another object is considered bad design”.  In other words, giving software developers more tools/functionality is not bad, just because some might shoot themselves in the foot. However, shooting yourself in the foot is almost always a bad idea.     @zemse @spalladino If one of you guys is there we could actually do make some progress in person there. ",
                    "links": [
                        "https://ethereum-magicians.org/t/eip-2330-extsload-and-abi-for-lower-gas-cost-and-off-chain-apps/3733/13"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.986111111111111
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "5",
                    "likes": "1",
                    "time": "25/08/2022-11:37:04",
                    "content": "tagging @tjayrush if he would like to join / collaborate on the Gather for an EIP: Useful Bit manipulation instructions  session ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Waltchain",
                    "index": "6",
                    "likes": "3",
                    "time": "25/08/2022-19:33:47",
                    "content": "I’m happy to talk about the scaling of node infrastructure to meet high speed chain requirements and the coming millions of new users (hopefully) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.827272727272727
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/xoxd",
                    "index": "7",
                    "likes": "0",
                    "time": "10/09/2022-01:58:36",
                    "content": "some kinda very useful token standard this is ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9750000000000005
                }
            ]
        }
    ],
    "group_index": "50"
}