{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/the-lisinski-tesnet-is-live/2763",
            "title": "The Lisinski Tesnet is live ",
            "index": 2763,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "testnet"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Swader",
                    "index": "1",
                    "likes": "2",
                    "time": "27/02/2019-17:17:47",
                    "content": "Hi all, I’d like to formally announce the launch of the Lisinski Testnet. Inspired by Goerli and with Constantinople and Istanbul activated, Lisinski is a PoA Clique chain focused on Croatia (all validators are from here) because we want to grow and support the local ecosystem of eth devs with a good playground and hackathon support. In spite of this, we’ve opened the testnet globally along with a faucet, rudimentary explorer and more, so you can just as well join in via RPC or even power up a node of your own and start hacking. It works perfectly fine on something as weak as a raspberry pi while the chain is this small, so please join us and break things. We also support whisper, and will soon open up IPFS and Swarm nodes. More information on why, how, etc. available at https://lisinski.online/en and you can come chat to us via Gitter and on our forum. ",
                    "links": [
                        "https://forum.lisinski.online"
                    ],
                    "GPT-summary": "The author of the post is announcing the launch of the Lisinski Testnet, a PoA Clique chain focused on Croatia, with Constantinople and Istanbul activated. The author invites people to join the testnet and provides information on how to do so. The post also mentions that the testnet supports whisper and will soon open up IPFS and Swarm nodes. The post is an announcement and advertisement of the Lisinski Testnet, with positive feedback from third parties and an invitation to extend to the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.095012626262626
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "2",
                    "likes": "0",
                    "time": "27/02/2019-17:22:54",
                    "content": "    Swader:  PoA Clique chain focused on Croatia (all validators are from here) because we want to grow and support the local ecosystem of eth devs with a good playground and hackathon support.   Super cool! Really fun to hear about this, thanks for sharing! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.684027777777778
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Swader",
                    "index": "3",
                    "likes": "1",
                    "time": "27/02/2019-17:37:45",
                    "content": "Thanks for the support! Note that while validators are from Croatia and all our servers are (or will be) in Croatia (we don’t like cloud hosting and think it should be effectively blacklisted in the context of public blockchains), the testnet is intended to be used by all - we want “outsiders” because we want a rich ecosystem of smart contracts that can interact with each other, we want to test latency, etc. etc. All our documentation (forum posts, tutorials, website, etc.) will be bi-lingual, so there’s always going to be an English language version of everything, for practicality’s sake. Next week we’re also launching an IBFT2.0 testnet, driven by Pantheon (the recently released Java client), so we can experiment with larger numbers of validators (20+ hopefully). Lots of developments pending, so be sure to follow along! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.881493506493507
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Alchemist33",
                    "index": "4",
                    "likes": "0",
                    "time": "28/02/2019-10:51:09",
                    "content": "CRO ETH Community growing strong!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.708333333333332
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "5",
                    "likes": "0",
                    "time": "28/02/2019-11:47:40",
                    "content": "great! Please add your chain here: https://github.com/ethereum-lists/chains ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "6",
                    "likes": "0",
                    "time": "28/02/2019-11:54:32",
                    "content": "does lisinski have a subway station? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Swader",
                    "index": "7",
                    "likes": "1",
                    "time": "28/02/2019-11:59:45",
                    "content": "Croatia is a 2.5th world country so no subways here at all, but we did name it Lisinski because it was formalized next to a public transit station (tram) that’s called Lisinski  Adding to chains ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "721"
}