{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/cryptocurrency-development-and-research-discord-and-knowledge-base/3016",
            "title": "Cryptocurrency Development and Research Discord and knowledge base ",
            "index": 3016,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/pr0toshi",
                    "index": "1",
                    "likes": "1",
                    "time": "27/03/2019-20:47:26",
                    "content": "Hey honestly not sure if this is alright to post but I looked through the rules and thought part of the community would find it useful. If it’s not apologies and just remove it. Hey, I’m making a project called Branch. We’ve set up a cryptocurrency development and research oriented space and would like to invite anyone with the same goals to join if interested. We will be focusing purely on development and research and building the space and research towards a decentralised future. The intent is to help unify the space and allow for collaborative efforts in growing the cryptocurrency ecosystem in a collaborative environment from all projects working and communicating in one organized spot since the community is highly fragmented. If you would like a channel for your project please just let us know and we will get it up ready for you. Including if you want it to be public or if you want private channels too. You can also integrate with Github.   YOU'VE BEEN INVITED TO JOIN A SERVER    Branch Welcome to the official Branch Discord!  We are a community for the collaboration of cryptocurrency projects in order to further the space and progress into a future where we collectively move into a more decentralised and open future.  ⬤ 7 Online  ⭘...      About Branch The knowledge base built on one tree. All nodes on the tree have a topic for information such as solidity tools where information is created and altered by anyone who wishes to contribute, these are the leaves. Leaves branch down to other leaves and make a higherarchy becoming more specialized the deeper you go into the branches. Moderation is done the same way, mods on higher branches have authority on lower branches branches to always be accountable and limit power abuse. Join us in growing the best resource for all of our benefit. ",
                    "links": [
                        "https://invite.gg/branch"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6987460317460314
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "2",
                    "likes": "0",
                    "time": "29/03/2019-01:48:04",
                    "content": "Hey, thanks for sharing! We generally don’t have a dedicated “space” for introductions of new things, in part because we don’t want to have to moderate / decide which links are good or not. This looks like fine and valuable info, thanks for sharing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2521645021645025
                }
            ]
        }
    ],
    "group_index": "773"
}