{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/summary-create2-immutability-assumed-by-social-contract/2671",
            "title": "[Summary] CREATE2: immutability assumed by social contract ",
            "index": 2671,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "1",
                    "likes": "1",
                    "time": "17/02/2019-14:09:38",
                    "content": "As a preparation for discussion about Social Contract and Immutability that will hopefully take place at Paris Council, would you please explicitly collect here a changes of Social Contract and Immutability Assumptions that the CREATE2 will create? It will help us to have more focused and prepared discussion. This thread is aimed to be an implication summary discussed in Potential security implications of CREATE2? (EIP-1014). I am starting the list: Our Social Contract on Immutability:   Immutable References: In our communication we consider contract address as a sufficient and immutable reference to immutable object. We don’t use contract revisions or block ranges additionally to contract address to refer to particular contract mutation.   We follow “Audit once - Trust many” paradigm. Regular contract audits are not necessary because of assumed immutability of deployed contract. There are two exceptions: Hard Forks and Declared mutability of dependencies.   Hard Forks are considered to be impossible to fulfill in hidden without a publicly well-known announcement. This announcement allows to re-audit implication of the hard fork for particular contract in advance.   A Declared mutability of dependencies is a ability to replace a particular contract in the bundle. “Upgradable proxied Contracts” is a good example. This kind of mutability should be recognized by first audit. Anyway, a particular contract assumed to remain immutable. It is assumed to be impossible to introduce any unexpected mutability later.   ///please continue///   @jpitts: can I make this post to Wiki? ",
                    "links": [
                        "https://ethereum-magicians.org/t/potential-security-implications-of-create2-eip-1014/2614"
                    ],
                    "GPT-summary": "The author of the post is asking for feedback and suggestions regarding the changes in Social Contract and Immutability Assumptions that the CREATE2 will create. The post also includes a list of assumptions and paradigms that the author believes should be followed. The post ends with a question asking if the post can be made into a Wiki.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "Law and regulations",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.060185185185185
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pereztechseattle",
                    "index": "2",
                    "likes": "1",
                    "time": "18/02/2019-19:00:23",
                    "content": " Under CREATE2 , any “audit” of a qualifying contract’s bytecode is rendered useless since the contract could theoretically be replaced at any time by the owner.  Further, because we can’t be certain of transaction ordering, there’s no way to check-then-proceed-if-ok.  In addition, only those with a fully synced node would have any hope of “knowing” what the target contract actually consists of.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.761904761904762
                }
            ]
        }
    ],
    "group_index": "697"
}