{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/this-forum-should-merge-with-ethresear-ch/2302",
            "title": "This forum should merge with ethresear.ch ",
            "index": 2302,
            "category": [
                "Site Feedback"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/panekkkk",
                    "index": "1",
                    "likes": "0",
                    "time": "31/12/2018-00:03:14",
                    "content": "This forum is starting to compete with ethresear.ch and covers similar topics. This unnecessarily dilutes attention and mental potential and social scalability. I would suggest merging if at all possible. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "2",
                    "likes": "2",
                    "time": "31/12/2018-00:23:32",
                    "content": "Thanks for the feedback! Definitely some overlap, but a lot broader, non-research topics here too. I think part of the reason that EthMagicians started was precisely because of the desire to discuss non-research topics, often more closely related to implementation and “production” code. As well, this past year has seen a growth into broader non technical topics, from education to event planning. So, I’m not personally in favour of EthResearch merging into EthMagicians — but happy to consider it if others are interested! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.00625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/panekkkk",
                    "index": "3",
                    "likes": "0",
                    "time": "31/12/2018-00:38:55",
                    "content": "Hey Boris! My post stemmed from some confusion among friends around where a particular thread (in relation to staking economics) should be posted to get more attention. Friend was concerned that Magicians forum was taking brains and eyeballs away from ethresear.ch. Totally understand the need for unique forums that deal with other topics but important discussion items that overlap can lead to some brain drain/dilution. Not sure what the solution is! Double post with one post linking to the other? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.488425925925926
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "4",
                    "likes": "2",
                    "time": "31/12/2018-01:10:23",
                    "content": "I would say EthMagicians is adding eyeballs and brains  I would suggestion actually gathering the people interested and either forming a working group and/or agreeing on a tag for anything that is long term important. And having group participants choose the main channel. So, something like an “announce” post — “hey we plan on discussing staking economics, please use tag YYY on group XXX if you want to get involved”. Feel free to ask for a #working-groups to be created if that’s useful. So if you want to have the discussion live on EthResearch but think there are useful stakeholders here — announcing it here seems like a good solution. Probably would be good as well to explain notifications for categories and tags, too. Not too hard to follow many Discourse based forums if you choose to just watch / get notifications for some tags. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.350524475524475
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/PhABC",
                    "index": "5",
                    "likes": "2",
                    "time": "02/01/2019-00:43:23",
                    "content": "It’s a bit hard to properly draw a line between what goes where and definitely not rigid, but my mental model of both is as follow : ethresear.ch: Research related topics, such as cryptography, math, consensus protocols, data availability, scalability, L2, etc. ethereum-magicians.org: Engineering and politics related topics, such as client optimization, systems and networks, governance, forks, ethereum related events, ERCs, EIPs, etc. Looking at the latest posts is another way to see which topics is better suited for which of the two communities:  image.png2031×997 431 KB  I personally disagree that both websites should merge as they serve different communities, which will indeed overlap on some occasions. ",
                    "links": [
                        "https://ethereum-magicians.org/uploads/default/original/2X/5/5177a6242911371a47c4cbd16d68c1d399c5bda9.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2339743589743595
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/virgil",
                    "index": "6",
                    "likes": "2",
                    "time": "06/01/2019-08:55:50",
                    "content": "ethresear.ch and magicians are unlikely to merge. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                }
            ]
        }
    ],
    "group_index": "614"
}