{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/stable-magicians-poll-exchange-vs-cdp/2377",
            "title": "Stable Magicians (POLL: exchange vs. CDP) ",
            "index": 2377,
            "category": [
                "Happenings"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "1",
                    "likes": "1",
                    "time": "10/01/2019-00:05:38",
                    "content": "I want to have some more eye-balls on this emerging discussion on github. Really like the movement from ETH->DAI for covering costs of events. (Stable Magicians FTW) - now there are 2 main ways to convert ETH to DAI  direct exchange ETH->DAI (e.g. via oasis) a CDP  I would prefer #1 - wonder what the rest of the magicians think.     direct exchange CDP     0 voters     ",
                    "links": [
                        "https://oasis.direct"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.066666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "2",
                    "likes": "2",
                    "time": "10/01/2019-00:45:19",
                    "content": "Hey @ligi as I said in the Github issue – that thread is about finding a volunteer. I don’t think we need a vote here. The “what we are trying to solve” context is:  we are asking for people to pay ETH for tickets to next Council  there will be expenses in fiat for catering someone will need to pay fiat, and get re-imbursed in crypto turning ETH into DAI (edited!) as it is accepted means that we can be sure we have the right amount to cover the catering expenses at the same time, the ECF sponsorship of 2KEU (that we have listed in the budget) should also get turned into DAI now any other sponsors that pay in crypto should also be converted to cover hard fiat costs  A longer term issue is what to do with the rest of the (very small) EthMagicians treasury. I think keeping portions of it in DAI makes sense – but I personally would like to find more people who will accept ETH directly. This process – of turning ETH into DAI and helping to manage the treasury – is what I want to see a volunteer help with. How to do it? I don’t care either way – someone with more experience can advise us. I hope that helps scope what is needed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520021645021646
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "3",
                    "likes": "2",
                    "time": "10/01/2019-00:58:52",
                    "content": "    boris:  This process – of turning ETH into DAI and helping to manage the treasury – is what I want to see a volunteer help with. How to do it? I don’t care either way – someone with more experience can advise us.   I would love to help with this as I mentioned on github. I think it is extremely important not to speculate with funds that have specific needs.     boris:  but I personally would like to find more people who will accept ETH directly.   I think this moving forward is the most important step to take so that we are able to avoid off ramps from ETH or DAI donations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.699999999999999
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "4",
                    "likes": "1",
                    "time": "10/01/2019-01:37:38",
                    "content": "Great to see we are on the same page here. My reason to start this poll was that CDP was mentioned in the initial issue text and one potential volunteer mentioned he has experiences with CDP’s. So I thought it might go in this direction and hence I wanted to signal soon that I think CDP’s are the wrong tool for this job and also get a feeling how the rest is thinking about this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "5",
                    "likes": "1",
                    "time": "10/01/2019-02:00:13",
                    "content": "    boris:   turning DAI into ETH as it is accepted means that we can be sure we have the right amount to cover the catering expenses    I think you mean ETH => DAI here for the allocated catering funds to be fixed. I’m not on the same page as the previous two posters. A CDP allows us to generate DAI on the fly without worrying about fees, slippage or managing multiple transactions. Personally I think it makes sense to generate them directly rather than have to rely on someone else to stabilise the funds. The other benefit would be that anyone can see and repay the CDP’s debt or add collateral as a way to support whatever the funds are being used for (you could theoretically use this model to allow the community to vote on which part of an event they want their money to go to). I like the simplicity, transparency and security that come with using a CDP, but honestly, it won’t make a huge difference either way. EDIT: I should probably note that we would need to safely collateralize the CDP until it is payed back, you can’t simply convert everything into DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.788690476190476
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "6",
                    "likes": "1",
                    "time": "10/01/2019-03:04:19",
                    "content": "Awesome! Learning so much here, thank you @Flash! And yes, ETH to DAI – I edited my comment. So, feels like the two options are: (1) Convert ETH to DAI On a weekly basis / when some amount of ETH from ticket sales have accumulated, do a direct exchange using Oasis[^multisig]. Exchange fees are paid, 2-of-3 wallet holders must schedule and do these transactions weekly (say, 4 or 5 times). [^multisig]: Can a multisig wallet use Oasis or do we need to trust eg. me or @jpitts to transfer into our own wallets and then back? DAI is held in the EthMagicians wallet. Expenses are paid back from the DAI held in the EthMagicians wallet. (2) Create a CDP A CDP is created, presumably requiring some minimum amount funds from the EthMagicians wallet. It can be topped up with ticket sales over time. @Flash – can you point us to and/or explain what creating a CDP means? Is there a minimum? Are there costs? Can it be done from a multisig wallet? Do we get interest? When expenses are submitted, the CDP generates DAI as needed. New sponsorships in ETH (for example) could be sent to this CDP in the future. Convert projected costs now Since we do have a treasury, we could choose to do (1) or (2) soon – essentially lock in that we need 3KEU for catering, and 2KEU from previous ECF sponsorship.  Closer to the event (basically, as people submit expenses), most of which would occur around the time of the event or shortly after, DAI would be transferred to the people who paid (who would be responsible for converting to fiat or holding DAI). Right now, who will pay the caterers is an open question. I think we can ask Jerome if he / Asseth might do this. I can do this if need be as long as they will take EU with an IBAN transfer. Tomo might be able to as well. I’ll follow up on this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.723725348725348
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "7",
                    "likes": "2",
                    "time": "10/01/2019-03:58:11",
                    "content": "The MakerDao CDP is a decentralised loaning system, you lock up as much Eth as you want, minimum being around 0.005 Eth and in return you can create DAI. At any time you can deposit and withdraw your Eth as long as you keep the DAI collateralize at over 150%. It charges 2.5% of the created DAI per year(0.0068% per day) as its fee. I’m not sure how we would go about creating one as I haven’t done it from a multisig before but it should be straightforward. Call the MakerDao contract that creates it, deposit Eth as collateral, and then create DAI as required. The debt is public, those that want to buy tickets in DAI could pay it back directly and watch the number shrink. After the event, once everything has been payed for, we can close the CDP by paying back the remaining debt (in DAI) or set a goal for the next one(donations to the CDP effectively lowering the ticket prices for next time.) Some DAI will need to be bought if we want to close the CDP by paying the remainder of the debt in full. The advantage being that there is no rush for this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.552083333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "8",
                    "likes": "0",
                    "time": "10/01/2019-06:08:56",
                    "content": "Awesome! Thanks for the explanation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "9",
                    "likes": "1",
                    "time": "10/01/2019-13:28:13",
                    "content": "    Flash:  Personally I think it makes sense to generate them directly rather than have to rely on someone else to stabilise the funds.   I think this is where we disagree. I strongly believe in the unix philosophy: “Do one thing, and do it well” - and I think managing CDPs should not be what we do. Also - I do not think we really “rely” on someone there - we just “use” a service someone offers. My main issue is (apart from the added complexity) that you get less DAI for your ETH when using a CDP. Sure the upside is you can get your ETH back and so maybe gain value in the long term. But is this what we should do? I do not think so. The funds from participants are as far as I see intended to be used to cover the costs in short term and not to gain value in the long term. Also we might not need much exchanging at all. IMHO we should just request DAI from participants instead of ETH. Perhaps we should even make it more expensive if people really want to use ETH to encourage using a stablecoin which makes planning more easy and is less risky. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "10",
                    "likes": "0",
                    "time": "10/01/2019-16:02:48",
                    "content": "My idea for the CDP was to create a clear separation of funds. We can guarantee that DAI can be pulled from it at short notice to cover expenses as they arise. I like that this is transparent and community facing.     ligi:      Flash:  Personally I think it makes sense to generate them directly rather than have to rely on someone else to stabilise the funds.   My main issue is (apart from the added complexity) that you get less DAI for your Eth when using a CDP.   You only get “less DAI” if you are looking to draw out a large sum at one time, obviously if the collateral we have is insufficient then I wouldn’t recommend doing this.     ligi:  Sure the upside is you can get your Eth back and so maybe gain value in the long term. But is this what we should do? I do not think so. The funds from participants are as far as I see intended to be used to cover the costs in short term and not to gain value in the long term.   This is false, we are not buying Eth with the DAI so this does not apply, the DAI used to close the CDP can be bought at any time. If we want a part of the wallet’s funds to be in DAI long term (as I believe @boris has hinted at) then we would buy them separately. I believe I’ve made my reasoning clear so I’ll leave it at that. I think the CDP idea is neater but if people would rather things be done more traditionally, the end result will be the same. EDIT: The biggest downside is that a significant amount of Eth could be locked up at one time(even if it’s easily released) to secure it. If the funds need to be on hand for something else or if it makes people uncomfortable to move a large amount then I would advise going with another solution. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.337081128747796
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "11",
                    "likes": "0",
                    "time": "10/01/2019-16:15:44",
                    "content": "    Flash:  This is false   What exactly do you think is “false” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.083333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "12",
                    "likes": "0",
                    "time": "10/01/2019-16:28:36",
                    "content": "    ligi:   This is false  What exactly do you think is “false”   We are not buying Eth with the DAI so there is no value to be gained or lost, there is no speculation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.083333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "13",
                    "likes": "0",
                    "time": "10/01/2019-16:47:37",
                    "content": "I disagree as you then still are attached to the ETH in the form of the collateral - so you still are speculating with ETH. It might look like a detail - but I think it is quite important as it is also shapes this non-organisation. I strongly think the non-organisation should hold no long-term assets apart from a buffer for like 1-2 events to protect organizers from losses. As soon as you aggregate assets you become more and more of an organisation and I think it is very important the magicians stay a “non-organisation” as much as possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.961111111111111
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "14",
                    "likes": "0",
                    "time": "10/01/2019-17:21:24",
                    "content": "With CDP: => Eth is stored in CDP leaving DAI to be freely generated => DAI is used to pay for expenses (leaving debt in its place) => Ticket sales are used to pay off CDP debt (if in Eth, this necessitates a conversion to DAI) Without CDP: => Eth is converted to DAI through an exchange in multiple steps (to try and avoid slippage costs) => DAI is used to pay for expenses I don’t see the speculation but maybe I’m missing something. I don’t feel like I’m adding anything new to this thread anymore so I’m going to let other people chime in. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.211363636363636
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "15",
                    "likes": "0",
                    "time": "10/01/2019-18:57:47",
                    "content": "    boris:  Hey @ligi as I said in the Github issue – that thread is about finding a volunteer. I don’t think we need a vote here.   Agree. Even I have voted “no”, the poll results should have no decision power. This decision should not be made by voting. This decision is up to the guy responsible for events finances. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "16",
                    "likes": "0",
                    "time": "10/01/2019-19:12:58",
                    "content": "true - the vote has no decision power or is even intended for this. Just wanted to get a feeling how others think about it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "17",
                    "likes": "2",
                    "time": "10/01/2019-20:41:17",
                    "content": "That’s a really excellent summary of the flows and how it would work as one liners – thank you! Ligi – no speculation, the in/out is all in DAI, and the CDP is per event. Both ticket sales and sponsorships are used to pay down the debt (or, in the case of early sponsorships, top up the CDP). We understand the “risk” of holding the event with committed funds. So sounds like there would be an “event CDP” for about 3 months or so (usual timeframe of organizing councils from last year). I’m willing to experiment either way. And we’re looking to @Flash for expertise in how this works  I have asked Megan from Veriledger to do a treasury management best practices call with us (andy any other company or organization), I hope anyone interested in this topic will join. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.284722222222222
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "18",
                    "likes": "0",
                    "time": "10/01/2019-20:59:36",
                    "content": "I would love to hear what Megan has to say! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "19",
                    "likes": "0",
                    "time": "10/01/2019-22:53:46",
                    "content": "RE: Opening a CDP This would require some monitoring and ongoing work as “we” the operators are exposed to having to put up more collateral should the value of the deposited ETHl fall under a threshold. Super-helpful overview of CDP and DAI RE: Converting ETH to DAI, and vice-versa Ok, so I also started elaborating on a process (and that was out of topic). What we should do instead is brainstorm on complete processes and then review later, after we hear from Megan and other experts.    HackMD    Procedure Brainstorming: Converting ETH to DAI when you have funds in a Multisig... # Procedure Brainstorming: Converting ETH to DAI when you have funds in a Multisig    ## Jamie's Pro      ",
                    "links": [
                        "https://hackmd.io/s/H1ZWRSrz4",
                        "https://hackmd.io/s/H1ZWRSrz4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AdamDossa",
                    "index": "20",
                    "likes": "1",
                    "time": "11/01/2019-18:09:15",
                    "content": "I may be missing something, but there is a real difference between using a CDP to generate DAI, and converting ETH to DAI using an exchange. The former retains your exposure to ETH whereas the latter removes your exposure. Given that EMs costs are going to be in USD (DAI) and not ETH, unless you want to take a “trading position” on the future value of ETH (which IMO is not something EM should be doing as it has no expertise in this area), a CDP doesn’t make any real sense. Note that if you open a CDP, and the value of ETH falls, you will end up losing materially more value than if you had turned your ETH into DAI (due to the collateralisation ratio and liquidation fees). If EM is looking to prudently manage its finances, and not speculate on the value of ETH the only rational option IMO is to turn received ETH into DAI on a regular basis (and accept that between the point where you receive the ETH and turn it into DAI you have an open risk position to ETH / USD so try and keep this period reasonably short). Surprised this seems so controversial in the above discussion ;-). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4338235294117645
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "21",
                    "likes": "1",
                    "time": "11/01/2019-18:20:03",
                    "content": "Most people come from zero trading / finance background, so none of this comes naturally. Your post was – again! – well articulated and is super useful to other people reading. I’m looking forward to our treasury management education session! P.S. @ligi and I both have German backgrounds. Regular conversation may be perceived as “controversial” when it is, in fact, just strong willed discussion   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.158564814814815
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "22",
                    "likes": "0",
                    "time": "11/01/2019-19:33:49",
                    "content": "I’m sorry but I’m going to repeat myself again here.     AdamDossa:  Given that EMs costs are going to be in USD (DAI) and not ETH, unless you want to take a “trading position” on the future value of ETH (which IMO is not something EM should be doing as it has no expertise in this area), a CDP doesn’t make any real sense.  If EM is looking to prudently manage its finances, and not speculate on the value of ETH the only rational option IMO is to turn received ETH into DAI on a regular basis   This simply doesn’t apply if the DAI isn’t used to buy ETH. There is no extra exposure from using a CDP.     AdamDossa:  accept that between the point where you receive the ETH and turn it into DAI you have an open risk position to ETH / USD so try and keep this period reasonably short).   This logic should put you in favour of a CDP as this is exactly what it allows, a short, calculated move away from Eth. Using a CDP means you are in fact taking less of a “trading position”. The debt created in DAI will be payed back in DAI. Both through donations and through exchange based conversions. The difference is in the timing. if you are skipping the CDP, you are converting vague large portions of your Eth into DAI (aka taking a relatively long term position against Eth for the purpose of stability) so that it is on hand to pay for expenses. If you are using the CDP, you have as much DAI as your collateral safely allows, you are effectively paying for expenses in Eth (with DAI) until you are ready to pay back the debt. Then and only then are you converting the exact amount of Eth necessary into DAI. If I am missing something, I’d really appreciate it if someone could help me out here.      jpitts:  RE: Opening a CDP This would require some monitoring and ongoing work as “we” the operators are exposed to having to put up more collateral should the value of the deposited ETHl fall under a threshold.   Thanks, yeah, this is valid but keep in mind that if the value of Eth drops and we are forced to close the CDP, the value “lost” will be equivalent to what it would have been if we had initially bought DAI. It might also be worth pointing out that the same is true for holding Eth, if its value drops too low, we can’t pay for anything. If coming up with the collateral is a problem for any reason then I’d happily advocate for something else. I’m only trying to clear up misunderstandings, apologies if I ever came off as aggressive. We’re all trying our best here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.545739348370927
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AdamDossa",
                    "index": "23",
                    "likes": "1",
                    "time": "11/01/2019-20:18:54",
                    "content": " This simply doesn’t apply if the DAI isn’t used to buy ETH. There is no extra exposure from using a CDP.  I agree that you don’t get extra exposure from opening up a CDP, but you still have exposure to the price of ETH in USD. If the value of ETH (in USD) increases then you profit, if it goes down, then you lose (potentially more than the value decreases if the CDP is liquidated and you pay a liquidation fee of 13%). If instead you turn any ETH received immediately into DAI (or as soon as is practical) then you have no exposure to the price of ETH in USD. So, IMO, it really comes down to whether EM wants to maintain exposure to the value of ETH in USD or not. If it wants to maintain exposure then using a CDP is a reasonable option (although so would only converting ETH into USD at the point it is needed and / or retaining some portion of the treasury in ETH, and some in DAI). If EM doesn’t want any exposure to the value of ETH in USD then it should not hold ETH, and instead hold USD (or DAI). It is a reasonable view for an organisation like EM to want to maintain exposure (given its place in the ecosystem) but if you want to be able to plan longer term in a very prudent fashion it should convert at least ~6 months operating costs into DAI so that if the price of ETH plummets it can still operate for this time. I came in to this conversation a bit late, so if the above decision (that EM wants to retain exposure to ETH/USD) has already taken place I wasn’t aware. Possibly an analogy would be:   suppose you own a house, and you want to start a business that is going to cost $100,000. You could either sell the house for $150,000 (convert ETH => USD) and use that as operating capital (leaving you with no exposure to the housing market), or take out a mortgage against your house for $100,000 (CDP) and use that (leaving you exposed to the housing market). The more prudent approach (in a volatile housing market) is the former, but if you’re an expert on housing and convinced the price is going to increase, the better approach is the latter.   by analogy selling 66% of your house for $100,000 would be a compromise leaving you some exposure to house prices, but also guaranteeing you your first year of operating capital regardless of what the housing market does.   NB - I should add that I love makerDAO and the concept of CDPs - just not sure it makes sense in this context  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.685515873015873
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AdamDossa",
                    "index": "24",
                    "likes": "0",
                    "time": "11/01/2019-20:23:33",
                    "content": "What is critical either way from a governance perspective, is that a strategy is decided upfront, and stuck to religiously. No one should (or be able to) make “trading decisions” (e.g. I’ll just re-collateralise my CDP a bit because I’m sure the market is about to recover; or I’ll hold off converting my ETH into USD for a couple of weeks cause I think we’re in a dip). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "25",
                    "likes": "1",
                    "time": "11/01/2019-20:26:33",
                    "content": "    AdamDossa:  I came in to this conversation a bit late, so if the above decision (that EM wants to retain exposure to ETH/USD) has already taken place I wasn’t aware.   I am also not aware there was such a decision and I would be really surprised about it     AdamDossa:  NB - I should add that I love makerDAO and the concept of CDPs - just not sure it makes sense in this context   same here - I love makerDAO and the concept of CDP’s - just think the magicians should not have a CDP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.397727272727273
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "26",
                    "likes": "0",
                    "time": "11/01/2019-21:26:25",
                    "content": "    AdamDossa:  turn received ETH into DAI on a regular basis (and accept that between the point where you receive the ETH and turn it into DAI you have an open risk position to ETH / USD so try and keep this period reasonably short).   Your argument has done a 180 since I explained that what you wanted is accomplished with a CDP.     AdamDossa:  So, IMO, it really comes down to whether EM wants to maintain exposure to the value of ETH in USD or not. If it wants to maintain exposure then using a CDP is a reasonable option (although so would only converting ETH into USD at the point it is needed and / or retaining some portion of the treasury in ETH, and some in DAI).   I’m not opposed to having a portion of the Eth in DAI but that is off topic, we’re discussing how the funds for this event should be managed. My logic was very straight forward, we currently have Eth (or as you’ve put it we’re “exposed to Eth” ), but we need to pay for expenses in DAI, therefor we should keep the Eth and create the DAI (minimising exposure to DAI). I also liked that CDPs are community facing, the community can see our costs (as debt) and ticket sales could be payed directly into it. Whether or not we want to turn a portion of the wallet’s Eth into DAI is a separate discussion entirely.     AdamDossa:  What is critical either way from a governance perspective, is that a strategy is decided upfront, and stuck to religiously. No one should (or be able to) make “trading decisions” (e.g. I’ll just re-collateralise my CDP a bit because I’m sure the market is about to recover; or I’ll hold off converting my ETH into USD for a couple of weeks cause I think we’re in a dip).   This was never an option, if the value drops, we pay off the CDP with DAI bought at market price, leaving things in the same position they would have been in sans CDP. No value will have been lost compared to buying the DAI up front. I believe we’re leaning towards buying the DAI from a dex. To that regard, I believe we can use the multisig but I like @jpitts’s  way around it if we can’t. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7011111111111115
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "27",
                    "likes": "0",
                    "time": "11/01/2019-21:31:54",
                    "content": "    Flash:  the community can see our costs (as debt) and ticket sales could be payed directly into it.   The indirection over a CDP does not any of these properties any more than the contract wallet is already doing.     Flash:  This was never an option, if the value drops, we pay off the CDP with DAI bought at market price, leaving things in the same position they would have been in sans CDP. No value will have been lost compared to buying the DAI up front.   This is simply false as dai_from_dex(amount) > dai_via_cdp(amount) I think your scope is blurring your vision ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "28",
                    "likes": "0",
                    "time": "11/01/2019-21:40:13",
                    "content": "    ligi:  The indirection over a CDP does not any of these properties any more than the contract wallet is already doing.   Sure it does. You estimate your costs, create the matching amount of DAI in a project specific CDP and publish it publicly. There is already an explorer for this.     ligi:  This is simply false as dai_from_dex(amount) > dai_via_cdp(amount) I think your scope is blurring your vision   This only matter if you’re trying to extract the maximum amount of DAI for your Eth, as we’re not selling all our Eth, this a total non sequitur. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.428571428571428
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "29",
                    "likes": "1",
                    "time": "11/01/2019-21:44:08",
                    "content": "@ligi Creating a CDP does an interesting thing where it absolutely shows the amount that EthMagicians has committed to pay for an event. I totally get it. It’s an interesting way to do this. I like it, now that I understand it. There are several “over my dead body” objections in the thread, and no one else is vehemently opposed to the buy DAI as we go version, so we’ll go with that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "30",
                    "likes": "1",
                    "time": "11/01/2019-21:46:25",
                    "content": "Brilliant, glad to hear it. I hope this thread was at last somewhat educational! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.140625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "31",
                    "likes": "0",
                    "time": "11/01/2019-21:52:53",
                    "content": "@Flash I try one last angle to show you why it is speculation - but will stop then as I think we do not really go forward here. Let’s say we got 1ETH in ticket sales now a) we exchange with a CDP and got 200$ b) we exchange via some exchange and get 250$ all ballpark numbers of course - only the relations are important. so wit a we can buy 200 apples with a) and 250 apples with b) 250 apples are better than 200 apples so now the price of eth drops to 10$ see how you speculated with 50 apples? @boris why not use a contract/multisig wallet per event then? A CDP sounds like wrong tool for the job. Sure you can use a screw-driver to hammer in a nail - but this does not say that you should …-) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.571428571428571
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "32",
                    "likes": "0",
                    "time": "11/01/2019-22:03:17",
                    "content": "    ligi:  Let’s say we got 1ETH in ticket sales now a) we exchange with a CDP and got 200$ b) we exchange via some exchange and get 250$   I have no idea what you’re arguing against, these are not the options we are discussing in this thread. You do not “exchange” Eth for DAI with a CDP, we are not trying to maximise the DAI to hand (what good would this do?) and we were always going to use the wallet’s Eth as collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "33",
                    "likes": "0",
                    "time": "11/01/2019-22:27:12",
                    "content": "    Flash:  these are not the options we are discussing in this thread.   I think these are exactly the options we are discussing     Flash:  we are not trying to maximise the DAI to hand (what good would this do?   it would decouple us from ETH and make us speculate less. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.305555555555555
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AdamDossa",
                    "index": "34",
                    "likes": "1",
                    "time": "11/01/2019-23:06:47",
                    "content": "    Flash:  Your argument has done a 180 since I explained that what you wanted is accomplished with a CDP.   My argument has remained entirely consistent. You are also making the dangerous assumption that if the value of ETH falls, EM will be liquid enough to purchase enough DAI to free its locked ETH. In a falling market with an organisation like EM this may well not be true resulting in punitive charges vs. pretty much any other option. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Flash",
                    "index": "35",
                    "likes": "0",
                    "time": "12/01/2019-07:45:34",
                    "content": "I’m running out of ways to explain this so I drew a little thing for you!  Mag CDP.png588×544 41 KB  The key thing to notice here is that a CDP does not make any decisions as to (or have any impact on) the composition of the wallet. What is 100% Eth will stay 100% Eth, what is 40% Eth stays 40% Eth. The DAI available to be created with said Eth is NOT bought. Only one market transaction needs to be made, it is exact, has no urgency whatsoever and serves to close the CDP. The wallet and its funds will only be changed for the duration of time it takes for this transaction to execute (whether it is made up of 10% or 100% Eth). None of the above applies to buying DAI, quite the opposite, as that is an explicit decision on the wallet’s composition and involves holding a position against Eth (nothing is wrong with this, that same decision can be made in tandem to the CDP’s creation). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9578125
                }
            ]
        }
    ],
    "group_index": "630"
}