{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-831-uri-format-for-ethereum/10105",
            "title": "EIP-831 - URI Format for Ethereum ",
            "index": 10105,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "1",
                    "likes": "2",
                    "time": "25/07/2022-11:57:17",
                    "content": "This thread acts mainly as the discussions-to thread for EIP-831. Currently resurrecting it on the request of @3esmit and now this field is required by the EIP bot. Also we should discuss the “eth” shortcut for the schema that is suggested. Here the link to the EIP: https://eips.ethereum.org/EIPS/eip-831 Here the PR for resurrecting the EIP from it’s current stagnant state:  github.com/ethereum/EIPs         Resurrect EIP-831 and add \"eth\" shorhand   ethereum:master ← ligi:resurrect_eip831            opened 10:59AM - 25 Jul 22 UTC               ligi             +4 -3       This EIP was stagnant but used - was contacted by @3esmit to resurrect it and ad…d a eth shorthand as alternative to the verbose \"ethereum\" scheme. Resurrecting is a no-brainer - the shortcut could use some discussion as it might be problematic e.g. when registering the scheme - so this might need a check. Let's discuss it here when there is time: https://github.com/ethereum-cat-herders/EIPIP/issues/159       ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pull/5335",
                        "https://github.com/ethereum/EIPs/pull/5335",
                        "https://github.com/ligi",
                        "https://github.com/ethereum/EIPs/pull/5335/files",
                        "https://github.com/ethereum/EIPs/pull/5335"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/qizhou",
                    "index": "2",
                    "likes": "1",
                    "time": "25/08/2022-21:50:39",
                    "content": "I would suggest adding an alternative way to present a request as request_alt                 = \"eth\" [ \"ereum\" ] [ \"-\" prefix ] \":\" payload  The motivation is that mixing the payload with the prefix can be confusing, especially if “-” is accepted in the payload.  For example, in EIP-4804, using the old format for “app-uniswap-org.eth” dweb will be ethereum://web3-app-uniswap-org.eth/  Using the alternative request format, then the request is ethereum-web3://app-uniswap-org.eth/  which is much clearer. BTW: I also found Microsoft is using similar way to format their request (see attached image from iana website)  image2962×584 195 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "3",
                    "likes": "0",
                    "time": "28/08/2022-02:53:02",
                    "content": "Thanks for chiming in. The disadvantage is that you then need to go through the IANA registration for every prefix. Also it makes the intent-filters on android suboptimal (all in manifest not in code). Lastly it is also breaking compatibility with already rolled out stuff. So not really thinking we should change it. But would also love to hear what others think. Are you in Berlin on the 15th by any chance? We will discuss IANA registrations for URIs there very likely at the CASA gathering. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/qizhou",
                    "index": "4",
                    "likes": "0",
                    "time": "05/09/2022-05:45:54",
                    "content": "Thanks for the response.  I understand there are a couple of concerns about the change such as IANA registration and backward compatibility. I am thinking if we could make some non-compatible changes such as adding an optional alternative prefix? Thanks for the invitation. I am afraid that I am not able to be in Berlin on the 15th, but I am be definitively to join online if possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.678571428571429
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/TimDaub",
                    "index": "5",
                    "likes": "1",
                    "time": "05/09/2022-11:28:44",
                    "content": "How will EIP-831 and EIP-3770: Chain-specific addresses interact? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "6",
                    "likes": "1",
                    "time": "10/02/2023-02:47:30",
                    "content": "@TimDaub I think we should not add EIP-3770 support to 831. Even though it is still in review IMHO we should not change it to not break assumptions. Also I think it is out of scope for this EIP. That said: there can be another EIP - inheriting from 831 (like EIP-5094) does having support @qizhou would really love to not make breaking changes to this EIP - I think this would do more damage than good. Maybe another EIP with these ideas in mind could be the better solution and then try to move over - but breaking this EIP is bad IMHO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                }
            ]
        }
    ],
    "group_index": "10"
}