{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-2025-a-proposal-to-fund-eth1-x-through-18-months-of-a-0-044eth-developer-block-reward/3282",
            "title": "EIP-2025 : A proposal to Fund Eth1.x through 18 months of a 0.044ETH Developer Block Reward ",
            "index": 3282,
            "category": [
                "EIPs",
                "Core EIPs"
            ],
            "tags": [
                "block-reward",
                "funding"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/MadeofTin",
                    "index": "1",
                    "likes": "0",
                    "time": "15/05/2019-18:22:59",
                    "content": "I created an EIP   github.com   MadeofTin/EIPs/blob/ETH1.X/EIPS/eip-2025.md --- eip: 2025 title: Block Rewards Proposal for funding Eth1.x author: James Hancock (@madeoftin) discussions-to: https://github.com/MadeofTin/EIPs/issues status: Draft type: Standards Track category: Core created: 2019-04-20 requires: 1890 ---  ## Simple Summary Add  `0.0055 ETH` per block for 18 months as a developer block reward reserved for funding Ethereum1.X development.  Currently, EIP 1890 is a proposal for a mechanism to capture a portion of block rewards for sustainably funding ongoing network development. That EIP sets values and addresses to zero and so does not actually collect any rewards. This proposal is to set those values to non-zero for 18 months in order to fund Ethereum 1.X working groups and organization efforts. The block reward will go towards paying back a loan with a small amount of interest to organizations in the Ethereum community. After 18 months the block reward would again reduce to zero.  <!--\"If you can't explain it simply, you don't understand it well enough.\" Provide a simplified and layman-accessible explanation of the EIP.-->  ## Abstract     This file has been truncated. show original       and submitted a PR for its inclusion in istanbul.   github.com/ethereum/EIPs       Funding ETH1.X through a Developer Block Reward for 18 Months     by MadeofTin   on 11:30PM - 13 May 19 UTC   17 commits   changed 2 files   with 203 additions   and 0 deletions.        Issues can be filed here    GitHub    MadeofTin/EIPs The Ethereum Improvement Proposal repository. Contribute to MadeofTin/EIPs development by creating an account on GitHub.       as well as Feedback on this thread is appreciated. Summary Add  0.044 ETH  per block for 18 months as a developer block reward reserved for funding Ethereum1.X development. Currently, EIP 1890 is a proposal for a mechanism to capture Block Rewards for funding Development. That EIP has values and addresses set to zero. This proposal is to set those values to non-zero for 18 months focused on funding Ethereum 1.X working groups and organization efforts. The block reward will go towards paying back a loan with a small amount of interest to organizations in the Ethereum Community. After 18 months the block reward would again be set to zero Funds would be managed by the Eth1.X Devs. They are currently developing a mechanism for this already. ",
                    "links": [
                        "https://github.com/MadeofTin/EIPs/blob/ETH1.X/EIPS/eip-2025.md",
                        "https://github.com/MadeofTin/EIPs/blob/ETH1.X/EIPS/eip-2025.md",
                        "https://github.com/ethereum/EIPs/pull/2025",
                        "https://github.com/MadeofTin",
                        "https://github.com/ethereum/EIPs/pull/2025",
                        "https://github.com/MadeofTin",
                        "https://github.com/ethereum/EIPs/pull/2025",
                        "https://github.com/MadeofTin/EIPs/issues/",
                        "https://github.com/MadeofTin/EIPs/issues/"
                    ],
                    "GPT-summary": "The post is a proposal by James Hancock to fund Eth1.x through 18 months of a 0.044ETH developer block reward. The proposal suggests adding 0.044 ETH per block for 18 months as a developer block reward reserved for funding Ethereum1.X development. The post explains the proposal and its purpose, and the author is asking for feedback. The post also mentions that the funds would be managed by the Eth1.X Devs, who are currently developing a mechanism for this already.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Change to proposal pipeline",
                        "Smart contract updates",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0048076923076925
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/CryptoHokie",
                    "index": "2",
                    "likes": "3",
                    "time": "21/06/2019-09:20:23",
                    "content": "I don’t believe this proposal provides a clear path for fair distribution of funds allocated to the 1.x developers, nor do I believe the developers, with vested interest in how the funds are allocated, should be the overseers of the management of the funds. This presents potential issues of accountability, and fair access to the pool of funds secured. Since I do not believe there is an inherently fair mechanism for distribution I do not believe a pooled fund collected intraprotocol is the right approach for funding 1.x development Beyond that, there is the continued question of the burden imposed on other stakeholder groups for the sake of developers who stand to benefit most. Asking users and miners to essentially pay the cost of inflation (even temporarily) breaks multiple social contracts Ethereum has committed to. The most basic of which is “do not debase the currency.” Further, the proposed numbers are not backed by particularly strong research in the total cost and need to fund 1.x in totality. As others have stated, funding is not the primary roadblock. We are asking users to a) effectively subsidize a loan with no guarantees of accountability or without key metrics to identify progress and effective use of funds, b) trust that the proposed figures will result in the completion of the overall effort without the risk of additional requests for added funding, c) trust that the governance surrounding fund allocation and disbursement will be effective, transparent, and not capturable by interested parties. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.364648033126294
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "3",
                    "likes": "3",
                    "time": "22/07/2019-14:25:51",
                    "content": "For archival’s sake, here’s a big twitter thread about the issue that blew up today:   twitter.com          Eric Conner (econoar)     Reading through the latest Ethereum Core Dev call notes and it appears that EIP-2025 is being seriously considered as an EIP for Istanbul.  EIP-2025 adds 0.044 ETH per block for 3,100,000 blocks to go to a dev fund. That’s 136,400 ETH.   Absolutely absurd! This cannot happen.       Eric Conner @econoar           Follow up on this. Apparently the EIP has a typo and it's 0.0055 ETH per block, not 0.044.  However, to me anything >0 is a non starter. https://twitter.com/econoar/status/1153097014449565696 …           5:18 PM - 21 Jul 2019     183          30             And a few related ones:   twitter.com          Spencer Noon (spencernoon)     This is not me shooting from the hip but from careful observation over many months:  @ameensol gets Ethereum better than almost anyone.  - Engineering - Mimetic Theory - Credibility - Legitimacy - Censorship Resistance - Community  I agree with him on EIP 2025. https://t.co/CfhyBgKfI5       Ameen Soleimani  👹 @ameensol           I oppose EIP 2025 to fund Eth 1.x from new block rewards.   https://github.com/ethereum/EIPs/blob/master/EIPS/eip-2025.md … https://twitter.com/ameensol/status/1153173908817772544 …           6:47 AM - 22 Jul 2019     16          3               twitter.com          Aftab 'DCinvestor' Hossain (iamDCinvestor)     The hubbub over EIP 2025 boils down to a request for ~$2M to fund Eth 1.x dev; however, alternatives to block funding haven't been exhausted.  So here's my challenge to the 1.x teams- develop detailed budgets justifying these amounts, and let's discuss alt funding mechanisms.   5:57 AM - 22 Jul 2019     16          1             ",
                    "links": [
                        "https://twitter.com/econoar/status/1153097014449565696",
                        "https://twitter.com/econoar/status/1153147010679054336",
                        "https://twitter.com/econoar/status/1153097014449565696",
                        "https://twitter.com/spencernoon/status/1153300532808888320",
                        "https://twitter.com/spencernoon/status/1153300532808888320",
                        "https://twitter.com/ameensol/status/1153180222826487808",
                        "https://twitter.com/spencernoon/status/1153300532808888320",
                        "https://twitter.com/iamDCinvestor/status/1153288047540211712",
                        "https://twitter.com/iamDCinvestor/status/1153288047540211712",
                        "https://twitter.com/iamDCinvestor/status/1153288047540211712"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.09731240981241
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Swader",
                    "index": "4",
                    "likes": "1",
                    "time": "22/07/2019-18:01:58",
                    "content": "I whipped up a small smart contract that lets all people registered in HumanityDAO vote on this. It won’t affect a single thing, it’s just my curiosity. Vote here: https://oneclickdapp.com/chant-castro/ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.821428571428571
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/CL20",
                    "index": "5",
                    "likes": "4",
                    "time": "22/07/2019-18:28:43",
                    "content": "Made an account just to reply to this. Crypto is about returning the issuing power of a decentralized currency back to the people. Not for a group of developers to insert a paycheck for themselves every new block. What you’re proposing sounds more like something fiat money would do. I am not against helping development, but you have to be aware that you’re proposing a change to the monetary policy of the second biggest cryptocurrency at the moment. Do you have any idea what kind of impact a change like this will have? What about long term impact of this change on the confidence in the monetary properties of ETH? You’re trying to build the future of money, and focus on the monetary properties of ETH should be the utmost important. Why should anyone buy ETH in the future when the devs can just print few millions of $ for themselves? Miner have no incentive to support this either. If this proposal gets passed, ETH will look like an absolute joke. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.765151515151516
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/postables",
                    "index": "6",
                    "likes": "2",
                    "time": "22/07/2019-19:12:21",
                    "content": "As someone who is both a developer building on ethereum, and a large scale miner of Ethereum I can’t help but be shocked as to the seriousness of this proposal. Ethereum as a platform is massively behind schedule. There have been delays left right and centre. Some delays are just due to unforeseen technical issues, and then we also have delays like the previous hard fork being delayed due to a security issue that was barely noticed before it was too late. I don’t think the core Ethereum developers have shown that they deserve a development fund. Maybe if we weren’t so behind schedule it would be deserved. But it isn’t, a developer fund could be considered similar to a bonus you get in the corporate world. Bonuses are only given to employees who Excel at their jobs and go above and beyond the call of duty.  With the massive amount of delays, I absolutely do not think a bonus is deserved. Now speaking as a miner (a large scale miner with a facility worth multiple millions of dollars) I’m getting shafted by this EIP. First you reduce my block rewards down to 3ETH from 5. Okay fine whatever I wasn’t too upset and I can manage. But now you want to take from my rewards even more, and distribute them to a group of people who are dropping the ball on their one job which is timely development of the ethereum ecosystem? What an absolute joke. It’s miners people like me and others that have an extremely high amount of skin in the game that are responsible for producing blocks. Where does this end? Does the ethereum community not give a shit about the people responsible for providing the hash power that secures the network? If this is really about developers needing funding to work on ethereum, maybe y’all shouldn’t have been giving grants worth 400k to companies that did ICOs and raised MILLIONS of dollars (status for example). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.089580498866213
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/maxlaumeister",
                    "index": "7",
                    "likes": "3",
                    "time": "22/07/2019-21:39:26",
                    "content": "Hey all, software dev chiming in. I don’t often speak up about Ethereum’s governance because I usually find myself in agreement with EIPs. But I feel the need to address this specific EIP, because I believe that if it were ratified it could put the Ethereum network at risk of a hard-fork and governance schism in the near future, and I don’t think that is an overstatement. Monetary policy is one of the most sensitive and critical aspects of Ethereum protocol governance, and there is a strong expectation in the community that the core developers will be impartial with regards to Ether issuance. If this EIP were to be ratified by the core dev team and thus more money printed for the 1.X working group, my expectation is that a significant portion of the Ethereum community would come together and create a hard-fork where the Ether supply is not debased. This would split developer mindshare, weaken the network’s security by fragmenting miners, and create uncertainty and hesitance among potential adopters of the Ethereum network, including individuals, DeFi companies, and large tech companies. Even more critically - unless I am mistaken, additional funding for Ethereum working groups is not even necessary. As far as I know, the Ethereum Foundation already has enough funding from the 2014/2015 crowdsale to fund all Ethereum working groups necessary to see Ethereum through the end of the Serenity network phase at the current price of Ether. Since adequate layer-2 funding sources already exist and have proven to be functional, printing additional money is not required. I fully expect the majority of Ethereum core developers to come out publicly against this proposal to print more money for the 1.X working group. But to anyone who believes it may be a good idea, I urge them to consider the real dangers of debasing Ethereum’s currency so far along in the network’s life. We are no longer in the network’s infancy trying to bootstrap development - we already have a well-funded foundation, and companies are building real products on the Ethereum network, expecting it to be stable with a predictable monetary policy. Ethereum’s issuance model is already on very tenuous ground compared to, say, Bitcoin’s, due to the monetary policy still being up to interpretation rather than being permanently enshrined in the definition of the currency. Printing more money for the 1.X working group would cause the market to re-price Ether based on new knowledge that there could potentially be an unlimited amount of new issuance in the future to fund additional working groups. Firstly, this price drop could significantly devalue the Ethereum Foundation’s financial reserves, putting the Ethereum developer community in a worse-off state financially than if the EIP had not been accepted. Secondly, this price drop could cause the economic incentives of the Ethereum blockchain to degenerate, thus causing irreparable economic harm to the Ethereum network itself. In short, I believe that this EIP and EIP 1890 pose significant systemic risk to the Ethereum network if they are ratified. I urge the Ethereum core developers to consider the social implications of attempting to debase the Ether supply at this point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.759887839433294
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "9",
                    "likes": "0",
                    "time": "24/07/2019-01:26:40",
                    "content": "I agree fully and oppose the eip-2025.md in current form.     CryptoHokie:  We are asking users to a) effectively subsidize a loan with no guarantees of accountability or without key metrics to identify progress and effective use of funds, b) trust that the proposed figures will result in the completion of the overall effort without the risk of additional requests for added funding, c) trust that the governance surrounding fund allocation and disbursement will be effective, transparent, and not capturable by interested parties.   Nevertheless, let me try to improve the @MadeofTin’s proposal. We could promise to infrastructure investors an ROI funded by community money (fund, inflation or tax) ONLY after the project gets released and merged into the mainnet. No release - no ROI/profit. Additional mechanism may tune payout after release depending on usage and utility (ToBe defined) ",
                    "links": [
                        "https://ethereum-magicians.org/u/MadeofTin"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.28125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/econoar",
                    "index": "10",
                    "likes": "1",
                    "time": "25/07/2019-17:57:19",
                    "content": "I strongly oppose this EIP. To me, the only thing that block rewards (on ETH or BTC) should be used for is securing the chain. From there, it should be a neutral and secure protocol for anyone to build applications on and it should not play favorites. People invest in ETH for many reasons but one of the reasons is the assumption that it has strong economic principles of a known and low issuance schedule. This means that your holdings cannot be easily diluted by inflation. By allowing random increases in block rewards, we are taking away a large reason that some people invest in ETH. If at any point, the issuance schedule can be altered UP outside of a reason for security, that confidence is shaken. All of these assumptions and investment theses are important because as ETH price rises, the chain becomes more costly to attack. The most dangerous part to me is the fact we’d be embarking on a giant slippery slope of where do we stop? If we set a precedent that one team can get funding via block rewards, where does it end? Why is it just this team? This is not something we want to open. It’s not meant to be a honeypot for funding. The EIP process states that the author must gather community consensus and I do not see that in this case. I’m confident it would cause a contentious fork. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.948412698412699
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/whyrusleeping",
                    "index": "11",
                    "likes": "0",
                    "time": "26/07/2019-07:08:18",
                    "content": "Just curious, if the core devs have to stop and get other jobs because they don’t have any income, what happens then? Obviously there are other solutions, but I’m not seeing any alternatives discussed in the thread ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.5625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "13",
                    "likes": "0",
                    "time": "29/07/2019-13:25:50",
                    "content": "    whyrusleeping:  Obviously there are other solutions, but I’m not seeing any alternatives discussed in the thread   Do you know any other threads or forums, where such ideas get discussed? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MadeofTin",
                    "index": "14",
                    "likes": "0",
                    "time": "01/08/2019-14:08:33",
                    "content": "But 0 progress on Eth would destroy Eths monetary properties.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/rumkin",
                    "index": "16",
                    "likes": "0",
                    "time": "07/08/2019-17:18:32",
                    "content": "This is just a new feudalism. Developers of Ethereum should provide services to community to earn money, not casting them and not bringing taxes. Decentralization means that any group of developers could produce features for Ethereum independently, would core developers allow other groups to add new tax for funding their development processes? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.184659090909091
                }
            ]
        }
    ],
    "group_index": "837"
}