{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/erc-1400-and-erc-1410-security-token-and-partially-fungible-token/1314",
            "title": "ERC-1400 and ERC-1410 - Security Token and Partially Fungible Token ",
            "index": 1314,
            "category": [
                "EIPs"
            ],
            "tags": [
                "finance",
                "erc-1400",
                "security-token"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "3",
                    "time": "12/09/2018-02:02:32",
                    "content": "Important update: after feedback, ERC-1400 (Security Token Standard) was split, so that now there is a related proposal ERC-1410 (Partially Fungible Token Standard).  From Adam Dossa, Pablo Ruiz @pabloruiz55, Fabian Vogelsteller @frozeman, Stephane Gosselin @thegostep:  Motivation Accelerate the issuance and management of securities on the Ethereum blockchain by specifying a standard interface through which security tokens can be operated on and interrogated by all relevant parties. Security tokens differ materially from other token use-cases, with more complex interactions between off-chain and on-chain actors, and considerable regulatory scrutiny. Security tokens should be able to represent any asset class, be issued and managed across any jurisdiction, and comply with the associated regulatory restrictions.    github.com/ethereum/EIPs      Issue: ERC 1400: Security Token Standard  \t \topened by adamdossa \ton 2018-09-13 \t \t \t  eip: ERC-1400 title: Security Token Standards author: Adam Dossa (@adamdossa), Pablo Ruiz (@pabloruiz55), Fabian Vogelsteller (@frozeman), Stephane Gosselin (@thegostep) discussions-to: #1411 status: Draft type: Standards Track category:...          github.com/ethereum/EIPs      Issue: ERC 1410: Partially Fungible Token Standard  \t \topened by adamdossa \ton 2018-09-13 \t \t \t  eip: ERC-1410 title: Partially Fungible Token Standard (part of the ERC-1400 Security Token Standards) author: Adam Dossa (@adamdossa), Pablo Ruiz (@pabloruiz55), Fabian Vogelsteller...        ",
                    "links": [
                        "https://github.com/adamdossa",
                        "https://github.com/ethereum/EIPs/issues/1411",
                        "https://github.com/adamdossa",
                        "https://github.com/ethereum/EIPs/issues/1411",
                        "https://github.com/ethereum/EIPs/issues/1410",
                        "https://github.com/adamdossa",
                        "https://github.com/ethereum/EIPs/issues/1410",
                        "https://github.com/adamdossa",
                        "https://github.com/ethereum/EIPs/issues/1410",
                        "https://ethereum-magicians.org/t/community-call-erc1400-feedback-discussion-questions/1475",
                        "https://ethereum-magicians.org/t/community-call-erc1400-introductions-feedback-questions/1333",
                        "https://ethereum-magicians.org/t/update-on-erc-1066-status-codes-project/1334"
                    ],
                    "GPT-summary": "The post is an update on the ERC-1400 Security Token Standard proposal, which has been split into two proposals, including the new ERC-1410 Partially Fungible Token Standard. The authors explain the motivation behind the proposals and their goals. The post also includes links to the proposals on GitHub. A 3rd party could ask questions about the proposals or provide constructive criticism.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Law and regulations",
                        "Smart contract updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.298611111111111
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "2",
                    "likes": "1",
                    "time": "12/09/2018-12:39:34",
                    "content": "Very well written, I see no technical (read: software) problems with the proposal. However, this is definitely a case of a proposal with the need for strong legal technicalities. I am sure the proposer has done due diligence as the proposal is well written, but I am curious from which jurisdictions this has been evaluated from a legal standpoint. SEC is a big one, ESMA for Europe, Hong Kong SFC, etc. I think adoption of this proposal is likely to hinge on the answers to various legal questions, so I think this should be determined first.  Also, another nitpicky thing: I think semi-fungible tokens (the denomination of a user’s balance by tranches, and the possibility of restriction of transferrability by tranches) should be a separate standard. There is a lot being proposed here, and I think the separation of this functionality from security- and custodian-specific functionality would make this proposal better off. It’s funny, because I was making a similar suggestion for reputation tokens (to be semi-fungible) just the other day. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.570833333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ben-kaufman",
                    "index": "3",
                    "likes": "0",
                    "time": "12/09/2018-14:32:47",
                    "content": "I agree this standard should be separated into a partially fungible token and security token. I think the partially fungible standard can be very useful in a lot of cases. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.19
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "4",
                    "likes": "4",
                    "time": "13/09/2018-06:42:37",
                    "content": "I’ve reached out to the team to schedule a community call. They’re requiring #erc-1066 as a dependency – which is great! @expede came up with it because we were trying to solve issues around security tokens and messages around whitelisting. Looks like one of the authors @thegostep joined us here. Welcome! Legal should be considered a SEPARATE layer. I know everyone is freaked out about this, but we need technical interoperability as a foundation to tweak the legal bits. So far, lawyers have tweaked implementation of security tokens on a one off basis (no joke), which is not the way to make for interoperability. Yes the work needs to be done to review, but I have found that I’m the one suggesting technically how things can be done to meet legal needs, not the other way around. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.430555555555556
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AdamDossa",
                    "index": "5",
                    "likes": "0",
                    "time": "13/09/2018-08:18:15",
                    "content": "Thanks for the feedback (this is Adam, one of the EIP authors from Polymath). re. splitting the proposal into a partially fungible token standard (e.g. tranches) & security token standard (checkSecurityTokenSend etc.) - this is something we debated internally and in fact was the original way we structured the EIP (as two separate related standards). In the end we decided we didn’t want to fracture the conversation across two EIPs so combined. The PFT standard has some interesting non-securities applications (e.g. token provenance, in-game bonus mechanics) which we are putting together as a fun medium article right now. A community call would be great - very interested in more discussion around #1066 which we’ve discussed a lot internally (and which led to the return argument specification for checkSecurityTokenSend). One question I have for more experienced forum members - currently we see the conversation being split between Ethereum Magicians and the GitHub Issue - is there prior art on the best way to manage this to keep the conversation in one place? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.371428571428571
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pabloruiz55",
                    "index": "6",
                    "likes": "0",
                    "time": "13/09/2018-11:21:57",
                    "content": "Hey @Boris, Pablo here, one of the authors as well. I have been lurking this forum for long now and joined the Token Ring a while ago. I know there will be some action going on prior to Devcon, at the Council of Prague and I was wondering how we could bring up this EIP over there to get even more discussion around it. What would be the process for organizing this up? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "7",
                    "likes": "2",
                    "time": "13/09/2018-13:42:48",
                    "content": "    AdamDossa:  One question I have for more experienced forum members - currently we see the conversation being split between Ethereum Magicians and the GitHub Issue - is there prior art on the best way to manage this to keep the conversation in one place?   No, sorry, people will use both  There is the discussion-to in the head of the EIP so you can create a forum thread here if you like. You can request technical points in GitHub and choose eg this thread for broader points. Re: community call. Great — it’s something I’ve been thinking of for a while so can help schedule / get the word out. Basically a live call, get people to share questions in advance, and then authors answer questions. Just like Core Dev calls, I think this can be a useful pattern to follow. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.893181818181818
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "8",
                    "likes": "0",
                    "time": "13/09/2018-13:49:40",
                    "content": "Add it to the agenda! There is some discussion here, I think this is a broad topic of interest so you can have space set aside to gather people. Also: EIPs & Interoperability track at the Status Hackathon the days before council. I submitted a talk to Devcon around the broad security token topic but didn’t get approved. We’ll have to see if there is anything in the schedule when it goes live, and encourage people to come earlier if they really want to dig in. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.461363636363636
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pabloruiz55",
                    "index": "9",
                    "likes": "2",
                    "time": "13/09/2018-18:06:52",
                    "content": "Thanks @boris I added the topic under the Token Ring on @ChainSafe 's doc. Is that the right place, though? Pre Council Call For Rings We submitted a bunch of Security Token related talks for Devcon. Sadly none of them were approved. No love for STs over there  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.735714285714286
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "10",
                    "likes": "2",
                    "time": "13/09/2018-18:09:16",
                    "content": "Huh. OK, good to know on Devcon. But, that’s why we have EthMagicians. I’ll dig a bit more. Yeah, that pre-council call is a good start. Need to find out who the Token Ring organizers are. Gathering signaling that there are groups that want to talk about this is a good start – we can point people there for now and mention it in the community call. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 8.1
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AdamDossa",
                    "index": "11",
                    "likes": "2",
                    "time": "14/09/2018-14:08:43",
                    "content": "Based on feedback here and on GitHub, we’ve split the EIP into two separate standards - the Partially Fungible Token Standard and Security Token Standard. There was a further discussion as to whether other parts (forced transfers, document management, verified transfers) should be further split out, but this seems to have more trade-offs in terms of adoption and consistency for security tokens, so leaving this as a possible future change rather than including it in this change. ",
                    "links": [
                        "https://github.com/ethereum/EIPs/issues/1411"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.987500000000001
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AdamDossa",
                    "index": "12",
                    "likes": "0",
                    "time": "14/09/2018-14:09:36",
                    "content": "@ jpitts if you’re able to update the reference in the title post to reference the new link above that would be very useful (and hopefully stop the conversation from forking). We are going to close the original issue shortly to move the conversation over to this new one https://github.com/ethereum/EIPs/issues/1411 and of course we hope it will continue here as well! ",
                    "links": [
                        "https://github.com/ethereum/EIPs/issues/1411"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.122727272727273
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "13",
                    "likes": "0",
                    "time": "14/09/2018-23:07:57",
                    "content": "@AdamDossa, thanks for the heads-up. I have updated the title and my topic intro. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AdamDossa",
                    "index": "14",
                    "likes": "0",
                    "time": "29/09/2018-13:37:50",
                    "content": "We have a second community call scheduled for this Tuesday (4th October). Details at:     2nd Community Call: ERC1400 Feedback, Discussion & Questions Token Ring       We would like to have a second community call related to ERC1400 following on from the previous call documented at:     When: Tuesday, October 2nd, 11AM EST world time check  Call Details: Zoom  Join from PC, Mac, Linux, iOS or Android: https://zoom.us/j/963516600  Or iPhone one-tap :  US: +16465588656,963516600#  or +16699006833,963516600#  Or Telephone:  Dial(for higher quality, dial a number based on your current location):  US: +1 646 558 8656  or +1 669 900 6833  Meeting ID: 963 516 600  In…      When: Tuesday, October 2nd, 11AM EST world time check  Call Details: Zoom Join from PC, Mac, Linux, iOS or Android: https://zoom.us/j/963516600 Or iPhone one-tap : US: +16465588656,963516600# or +16699006833,963516600# Or Telephone: Dial(for higher quality, dial a number based on your current location): US: +1 646 558 8656 or +1 669 900 6833 Meeting ID: 963 516 600 International numbers available: https://zoom.us/u/acB6ZYvJ6 ",
                    "links": [
                        "https://www.timeanddate.com/worldclock/fixedtime.html?msg=ETHMagicians+Community+Call+ERC1400&iso=20181002T08&p1=224&ah=1&am=30",
                        "https://zoom.us/j/963516600",
                        "https://www.timeanddate.com/worldclock/fixedtime.html?msg=ETHMagicians+Community+Call+ERC1400&iso=20181002T08&p1=224&ah=1&am=30",
                        "https://zoom.us/j/963516600",
                        "https://zoom.us/u/acB6ZYvJ6"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.261904761904762
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pkrasam",
                    "index": "15",
                    "likes": "0",
                    "time": "03/08/2019-12:22:01",
                    "content": "Where can I find the latest update on ERC-1400 and ERC-1410 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "381"
}