{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/thoughts-on-eips-and-interoperability/1689",
            "title": "Thoughts on EIPs and interoperability ",
            "index": 1689,
            "category": [
                "Process Improvement"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "1",
                    "likes": "1",
                    "time": "28/10/2018-12:41:11",
                    "content": "@boris, Here is the short collection of my thoughts on EIP process for that sad case if I am not able to take part personally. Would be great if it could be discussed in “EIPs and Interoperability” session. Thoughts are:   Ethereum is not only the Core any more. Now it is the whole ecosystem around it. Thus, it makes sense to extend the goal of the EIP process from serving the Core Development to serve the whole ecosystem.   It is not sufficient to tag all not-Core EIPs as ERC - they are too different in their meaning and their processing.   It is not sufficient to include only CoreDevs into the EIP process . Application dev communities should be involved into the EIP workflow too.   Call for Action (CfA): It should be possible to call community attention to some global problem without proposing an improvement. CfA will become an EIP if anybody proposes a solution.   Editors should classify incoming EIP proposals as one of additional kinds of:  CfA - Call for Action (see above) Design Pattern - nice to have, voluntary to use, mutable in the future, no global consensus needed, no danger of hard fork. Standards (like ERC20): once adopted - then immutable, comprehensive review needed, no global consensus needed, no danger of hard fork, but danger of multiple different standards.  other kinds of EIP?    EIPs should be routed (signaled) between different communities in order to collect comprehensive reviews.   There should be simple standardized review states like (OK / INWORK / REJECTED ) to signal the review result between Communities and Editors.   More implementation details you will find in Decentralizing EIP Workflow Proposal. I am currently working on software implementation of it, so I am glad to discuss all the details in depth and interested on any specification input. ",
                    "links": [
                        "https://ethereum-magicians.org/t/joint-session-on-interoperability-with-ring13/1687/3"
                    ],
                    "GPT-summary": "The author of the post shares their thoughts on the Ethereum Improvement Proposal (EIP) process and suggests extending it to serve the whole ecosystem, not just the Core Development. They propose a Call for Action (CfA) to address global problems and suggest different types of EIPs, including Design Patterns and Standards. The author also suggests routing EIPs between different communities and implementing standardized review states. The post invites discussion and collaboration on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.436197916666666
                }
            ]
        }
    ],
    "group_index": "474"
}