{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/solidity-optimizer-and-abiencoderv2-bug/3055",
            "title": "Solidity Optimizer and ABIEncoderV2 Bug ",
            "index": 3055,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "solidity",
                "solidity-bugs"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "1",
                    "time": "01/04/2019-07:01:04",
                    "content": " Through the Ethereum bug bounty program, we received a report about a flaw within the new experimental ABI encoder (referred to as ABIEncoderV2). Upon investigation, it was found that the component suffers from a few different variations of the same type. The first part of this announcement explains this bug in detail. Additionally, two low-impact bugs in the optimizer have been identified over the past two weeks, one of which was fixed with Solidity v0.5.6. Both were introduced with version 0.5.5. See the second part of this announcement for details.  From the Ethereum Foundation blog:   blog.ethereum.org    Solidity Optimizer and ABIEncoderV2 Bug Solidity Optimizer and ABIEncoderV2 Bug Announcement Through the Ethereum bug bounty program, we received a report about a flaw within the new experimental ABI encoder (referred to as ABIEncoderV2). Upon investigation, it was found that the component...      ",
                    "links": [
                        "https://blog.ethereum.org/2019/03/26/solidity-optimizer-and-abiencoderv2-bug/"
                    ],
                    "GPT-summary": "The Ethereum Foundation has received a report about a flaw in the new experimental ABI encoder and two low-impact bugs in the optimizer. The post explains the details of the bugs and how they were identified.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.90530303030303
                }
            ]
        }
    ],
    "group_index": "784"
}