{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/on-the-progpow-audit/2594",
            "title": "On the progpow audit ",
            "index": 2594,
            "category": [
                "Announcements"
            ],
            "tags": [
                "progpow",
                "audit",
                "ethcatherders"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/lrettig",
                    "index": "1",
                    "likes": "2",
                    "time": "05/02/2019-15:23:37",
                    "content": "Opening this thread as a general purpose place for the community to discuss the upcoming progpow audit being handled by the Ethereum Cat Herders at the request of the All Core Devs. Please post questions or comments and we’ll do our best to make sure that all parties weigh in. ",
                    "links": [
                        "https://ethereum-magicians.org/t/eip-progpow-a-programmatic-proof-of-work/272/36",
                        "https://ethereum-magicians.org/t/progpow-a-compilation-of-reference-material/3040/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.583333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/sneg55",
                    "index": "2",
                    "likes": "0",
                    "time": "07/02/2019-18:21:48",
                    "content": "Could you clarify little bit what’s the purpose of this audit? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/sneg55",
                    "index": "4",
                    "likes": "0",
                    "time": "19/02/2019-22:51:59",
                    "content": "I’ve another question, I was wondering why EF struggling with funding ProgPow audit.  Is it really necessary to fund security audit with bounties? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lrettig",
                    "index": "5",
                    "likes": "0",
                    "time": "25/02/2019-23:48:32",
                    "content": "I don’t think it’s a lack of funds, I think it has more to do with political sensitivity: trying to remain neutral and not favor one side or the other, concerns around sending signals, etc. EF is hypersensitive to this sort of thing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/sneg55",
                    "index": "6",
                    "likes": "0",
                    "time": "26/02/2019-00:03:42",
                    "content": "It’ll be great if you could mention it on upcoming Progpow audit bounty page, since it’s not 100% clear for everyone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lrettig",
                    "index": "7",
                    "likes": "0",
                    "time": "26/02/2019-00:15:22",
                    "content": "I don’t think I can, that’s not my bounty ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "8",
                    "likes": "2",
                    "time": "27/02/2019-04:21:19",
                    "content": "There are now two bounties: Fund WhiteBlock Analysis Fund Andrea and teams past and future development Both are extremely important to get funded in order to get ProgPoW to mainnet. At this point, development has stopped as Andrea has run out of his own personal funds to continue. Without 3rd party analysis, nobody can recommend to the CoreDevs that this is a safe solution. If WhiteBlock finds any issues, then those will need to get resolved and the Andrea funding is also to help with that. ",
                    "links": [
                        "https://gitcoin.co/grants/54/progpow-full-stack-integration"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "9",
                    "likes": "2",
                    "time": "27/02/2019-04:26:28",
                    "content": "The whole argument that the EF cannot get involved in funding ProgPoW is weak sauce. If ethereum is ever 51% attacked, the EF is going to have a huge mess on their hands. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "10",
                    "likes": "1",
                    "time": "27/02/2019-04:32:22",
                    "content": "I’m not sure the audit is a security audit? (@souptacular can maybe clarify) From what I remember from the council of Denver, the audit was to ensure the claims of ASIC resistance had a solid underpinning, and to obtain an independent review of the code for the hardware claims being made. We don’t know the right people to contact for that who are sufficiently “neutral” on this issue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.044642857142857
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "11",
                    "likes": "2",
                    "time": "27/02/2019-04:40:05",
                    "content": "My expectation is that WB will do all of the above. Is WhiteBlock not neutral enough? I can’t think of a single motivation they would have to produce results that favored ProgPoW such that they would have any benefit. In fact, it would be a risk to their entire business model to ‘approve’ ProgPoW. For the sake of the security of Ethereum, I deeply hope they find issues and they get resolved as quickly as possible. Thirdening is coming literally tomorrow, which reduces profitability even further and we have Linzhi coming out with claimed 7x ASIC’s in June/July… who’s going to be left to secure the network? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.512987012987013
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "12",
                    "likes": "0",
                    "time": "27/02/2019-04:52:02",
                    "content": "Saying that there is nobody “neutral” enough to evaluate and ensure the security of a ~$14b (today) network, is a grand failure of the EF. A fund should be created just to make sure that this doesn’t happen again and the EF should be the #1 contributor. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.854166666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "13",
                    "likes": "0",
                    "time": "27/02/2019-04:53:42",
                    "content": "I would say Whiteblock is neutral enough actually. I think they have the expertise to evaluate, so I am happy they got this effort started. This happened after the council though, so the sentiments have probably changed since the council. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "14",
                    "likes": "1",
                    "time": "27/02/2019-04:56:46",
                    "content": "We’re all on the same side. I was working on a post to try to call out all my potential issues with ProgPoW to shake out the last of the skeptics and move this forward. This is a highly contentious and political upgrade, it’s been very difficult to find all the facts amidst all the noise and outrage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.591666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "15",
                    "likes": "0",
                    "time": "27/02/2019-04:59:39",
                    "content": "Maybe your visibility into the matter is new. I just need to point out that this has been discussed at many levels (private and public), for months now. I’m just glad it is moving forward. Agreed on the noise, which is why the idea came about to get WB involved. This will allow us to get past the contention and personal drama and focus on the technology. If it is sound, all the better. If it has issues, let’s get them fixed. Next step is to get the word out to fund it all. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.857438016528925
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "16",
                    "likes": "2",
                    "time": "27/02/2019-05:08:59",
                    "content": "I am like most people who have had familiarity with the proposal for months. From the outside looking in, there is a mess of different incentives at play, it is very difficult from a macro level to determine if it is a “necessary” change to make, even after you dig through the tough technical points of whether it is sound (and it appears sound to me from my limited knowledge in hardware engineering). My points as a skeptic were much broader and more philosophical about whether it was a distraction, but I am with you now that this has a marginal enough boost to network security that it is worth the funding to move forward and protect the diversification of the mining ecosystem. Every time someone calls a skeptic like myself “uninformed”, “stupid”, or claims that the proposal is “obvious”, it trips alarm bells in my head that lead me further away from the path to understanding why it is necessary, especially as someone who admittedly has very little hardware design experience to evaluate the proposal. What we need now is more facts and less “professional opinions”. I think that’s what gets this across the finish line.  I’m sorry if that is terse or rude, but it has been my experience that people who are for the proposal are getting exasperated instead of being patient and guiding people through it. I think many people involved are underestimating the political-ness of this proposal. It is a hard battle to fight! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.95511767925561
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "17",
                    "likes": "0",
                    "time": "27/02/2019-05:48:07",
                    "content": "Seems weird to call anyone names or make assumptions. I don’t know how to respond to that, but I’d say it takes thick skin to be here. Just discounting something because you’ve been called a name doesn’t seem like a good solution either. Maybe people are yelling because they feel strongly about the security of the network and care about their investment in this technology. They see the train rolling down the tracks towards the bridge that has explosives on it. Agreed that it is hard to evaluate. My first reaction to it all was: “We need to make sure it is 110% necessary” and “Why is Kristy such a drama queen?” Once I got past that and decided to focus on the tech, it became clear that due to the focus on PoS and a distaste for PoW, a ball had been dropped. That ball is the understanding of the importance of PoW on the current network. Ethash has served well for so long that all the people supporting it are gone now. The deep understanding of the importance of mining and securing the network against 51% attacks, is gone. Miners have been relegated to a necessary evil, which is really the wrong way to look at the people who are securing the network today. At the same time, this has given ASIC manufacturers a chance to catch up with their solutions. The threat of losing the original mission statement of being GPU centric is real, especially now with the crypto winter and thirdening. Profitability is gone and GPU’s are being turned off. Look at the difficulty levels (subtract out the time bomb increase), we are back at 2018 levels… a whole years worth of added compute power has been shut off. Everyone has had their eye on the PoS ball… even with the assumption that it’ll just replace PoW. But, fact is that PoW isn’t going away anytime soon. It will be around for years more. It will overlap with PoS for years after that is first released. PoW is not a distraction, a 51% attack is a distraction. It turns out that whatever personal motivations Kristy (or whomever) had to originally work on ProgPoW are not relevant now. The thirdening, crypto winter and Linzhi hastened things to the point of making these the relevant issues. Agreed. More facts. Less opinions. Let’s get WB funded and working ASAP. I’d argue that the EF should reverse their decision and fund these grants. It is embarrassing to effectively have to beg the community to fund this stuff. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.323573573573573
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "18",
                    "likes": "2",
                    "time": "27/02/2019-05:59:13",
                    "content": "Calling people names is a tactic to attempt to force someone into making a decision a certain way. It usually has the opposite effect on me, hence why my initial reaction to ProgPoW was to move against it, because it raised those types of flags. I agree that there seems to be the best alignment to move forward with it, but only after a personal accounting with my larger concerns that lead to this being a marginal enough benefit to be valuable (instead of an overwhelmingly obvious result).  “ASIC resistance” as a concept is disputable, but we don’t have the luxury of disputing it anymore because we can’t guarantee a robust and fair marketplace for development of machines against an “ASIC friendly algo”. We also have to be sure we are the top GPU mining coin, and that the value of other GPU coins is not comparable to our own so we remain untouchable by mercenary hash power. There are tons of macro level analysis that trades whether it is worth it to move forward with now, the eventual move to PoS is also something to consider as even though the Phase 3 (final) network is years away, the Phase 0 chain should hopefully launch within the year and we can use it to help secure the chain if we are smart! We have to evaluate all options here to ensure security, not just ones we know about. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.120535714285714
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "19",
                    "likes": "0",
                    "time": "27/02/2019-06:13:29",
                    "content": "Agreed 100% with everything you said.     fubuloubu:  We have to evaluate all options here to ensure security, not just ones we know about.   The issue is that there is no funding, or motivation, to do that evaluation. =( Hence this discussion. =) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/shemnon",
                    "index": "20",
                    "likes": "4",
                    "time": "27/02/2019-06:25:06",
                    "content": "At the council of Denver I thought that the audit needed to cover 3 areas:  performance benchmarking a professional opinion as to the claim that there will only be 1.1x/1.2x/1.5x theoretical asic advantage (based on tech) a professional opinion that the algorithm is cryptographically sound, i.e. there are no known calculation shortcuts and the crypto primitives (like keccak-f800) are used correctly or at least are used in a way that will provide what we want it to do.  The benchmarking will provide insight as to wether the 0.9.2 version of the spec or 0.9.3 version provides a not-too-unbalanced amd/nvidia performance difference, and also help us plan for what to expect on a block transition when the hashes/sec goes down 2x-3x.  (how long to get back to 15s blocks and how much sooner will the ice age be felt). What I want and likely won’t get is some validation that this design will provide the desired limited upside to ASIC implementation.  As someone not trained in hardware the explanation sounds legit, but a corroborating opinion from a qualified neutral party would be better.  It sounds like all the qualified experts will all have conflicts of interest and won’t be considered neutral, or are otherwise unavailable to comment.  I hope I’m wrong on that mark. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.079648526077097
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Anlan",
                    "index": "21",
                    "likes": "3",
                    "time": "27/02/2019-12:03:18",
                    "content": "I agree with all positions expressed above. Nevertheless let me point out some facts.  The whole point of ProgPoW on Eth is to slow down incoming wave of ASICs and to prepare a more levelled field for any mining device; All this delays only give room to ASIC manufactures to organize a counteroffensive move and prepare for a contentious hf; ProgPoW specs are publicly available since a year now Heavy lifting has already been done implementing both verification on major nodes (geth and parity) and an open-source miner; If anyone is thinking that audit/testnet/implementations can go ahead without proper funding … then better we dismiss the whole project.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.502893518518519
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "22",
                    "likes": "2",
                    "time": "27/02/2019-13:30:12",
                    "content": "    Anlan:  ProgPoW specs are publicly available since a year now   This is probably the biggest risk. “ASIC resistance” ultimately relies on information asymmetry, which inherently gives any solution a shelf life. Ask the Monero folks, the community can’t move as fast as a well-organized hardware company. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "23",
                    "likes": "1",
                    "time": "27/02/2019-16:53:10",
                    "content": "One benefit of ProgPoW is effectively giving a set of knobs to twist on Ethash. Every time you twist the knobs, the ASICs have to go back to the drawing board. Obviously this requires a fork each time, but this could be integrated into the ~6 month normal fork release cycle of ETH. It would be pretty hard (financially) to get ahead of that. But all of this effort is moot if some funding can’t be found soon. Andrea and the rest will move onto other things and it isn’t fair to them to ask them to work on this further, without some sort of financing from the ETH community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6416666666666675
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/souptacular",
                    "index": "24",
                    "likes": "2",
                    "time": "28/02/2019-05:51:45",
                    "content": "Hey all! Wanted to quickly clarify where the cat herders are with the audit. There are multiple things going on and some of them are directly initiated by the cat herders and some are “supported” as in “we support what they decided to do”. So as far as the audit goes there are 2 components: benchmarking and examination of how long/efficient a ProgPoW ASIC would be. Benchmarking is done to make sure that there isn’t discrepancy between AMD and Nvidia cards performance. The other examination is to make sure it is even worth it to implement progpow or if ASICs can be made super quickly (like less than 9 months) and with more speed increase. Whiteblock wants to do the benchmarking part, but idk who will pay for it. They are equipped to do that piece of the audit imo. They have both a Bounties Network and Gitcoin bounty for their work. The more difficult part is the 2nd part which deals with figuring out the details of how an asic would be built, how long, and the effeciency increases compared to GPUs. I very recently got in touch with another group that isn’t Whiteblock who wants to do the 2nd part of the audit. Once they have a solid proposal we will likely try to help them set up a Gitcoin or find sources of funding if they are legit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.695075757575758
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/sneg55",
                    "index": "25",
                    "likes": "1",
                    "time": "28/02/2019-06:45:45",
                    "content": "I’m trying to understand what’s the roadmap for completing ProgPoW consideration process by The Ethereum Cat Herders. I.e., something like:  miners, pools, community should help with founding next bounties #1 - we need $xxx for something by xx/xx/2019 #2 - we need $xxx for something by xx/xx/2019 #3 - we need $xxx for something by xx/xx/2019 If everything goes well with bounties funding and with results, The Ethereum Cat Herders will recommend ProgPoW to Core Devs as a possible way of reducing ASICs at Ethereum Network.  Right now it’s not clear at all. The Ethereum Cat Herders announced yesterday that crucial step for ProgPow is to fund those bounties: Bounty #1    Whiteblock Testing    Whiteblock Testing Gitcoin is the easiest way to monetize or incentivize work in Open Source Software.       Where ProgPow not even mentioned in the description. Bounty #2 https://explorer.bounties.network/bounty/2424 Here is something that looks like audit, but the total required amount not mentioned. So if you calling for community funding, can we have clear communication on this?  ",
                    "links": [
                        "https://gitcoin.co/grants/15/whiteblock-testing-2",
                        "https://gitcoin.co/grants/15/whiteblock-testing-2",
                        "https://explorer.bounties.network/bounty/2424"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.209821428571429
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/xazax310",
                    "index": "26",
                    "likes": "2",
                    "time": "28/02/2019-14:36:28",
                    "content": "@souptacular @lrettig @ethcatherders I believe I can help with the audit, at least on the benchmarking side. How can I apply for this grant for this audit? I’ve already benchmarked a few GPUs and if you’re interested to see my work(I posted it around quite a bit already). Obviously, I can expand on it with a full range of GPUs, AMD/Nvidia and provide a more thorough and in-depth review, assumptions, and things I found. I hope I can help in this regard. I am testing 0.9.3 spec right now. I’m more than happy to provide myself for an interview. Let me know what you think. Article I wrote as an example of my work.    Medium – 17 Feb 19    The Miners Benchmark ProgPoW – Theodor Ghannam – Medium End of Era, beginning of another. Reading time: 8 min read        ",
                    "links": [
                        "https://medium.com/@infantry1337/the-miners-benchmark-progpow-e79cab6eabc3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chfast",
                    "index": "27",
                    "likes": "2",
                    "time": "28/02/2019-15:18:24",
                    "content": "    souptacular:  if ASICs can be made super quickly (like less than 9 months)   I believe this is irrelevant (for audit). ProgPoW never claimed that it is ASIC resistant and ASICs cannot be built so it does not matter if they are going to be built on day 0 or never. The only claim was ASICs are not going to be more than 20% more efficient than GPUs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "28",
                    "likes": "1",
                    "time": "28/02/2019-15:36:42",
                    "content": "From the github page: The design goal of ProgPoW is to have the algorithm’s requirements match what is available on commodity GPUs: If the algorithm were to be implemented on a custom ASIC there should be little opportunity for efficiency gains compared to a commodity GPU. … While the goal of “ASIC resistance” is valuable, the entire concept of “ASIC resistance” is a bit of a fallacy. CPUs and GPUs are themselves ASICs. Any algorithm that can run on a commodity ASIC (a CPU or GPU) by definition can have a customized ASIC created for it with slightly less functionality. Some algorithms are intentionally made to be “ASIC friendly” - where an ASIC implementation is drastically more efficient than the same algorithm running on general purpose hardware. The protection that this offers when the coin is unknown also makes it an attractive target for a dedicate mining ASIC company as soon as it becomes useful. Therefore, ASIC resistance is: the efficiency difference of specilized hardware versus hardware that has a wider adoption and applicability. A smaller efficiency difference between custom vs general hardware mean higher resistance and a better algorithm. This efficiency difference is the proper metric to use when comparing the quality of PoW algorithms. Efficiency could mean absolute performance, performance per watt, or performance per dollar - they are all highly correlated. If a single entity creates and controls an ASIC that is drastically more efficient, they can gain 51% of the network hashrate and possibly stage an attack. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.632167658730158
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "29",
                    "likes": "3",
                    "time": "18/03/2019-15:11:59",
                    "content": "I’ve been closely following everything ProgPoW for months now. I am in almost every chat room and discussion out there. I just wrote this up to hopefully help clarify a few things as I see them about ProgPoW. Just thinking that this group (or if you came here from another link) might be interested… https://medium.com/@lookfirst/13-questions-about-ethereums-movement-to-progpow-e17e0a6d88b8 ",
                    "links": [
                        "https://ethereum-magicians.org/t/motion-to-not-include-progpow-without-audit/3027"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "30",
                    "likes": "3",
                    "time": "25/03/2019-14:30:23",
                    "content": "Update from @souptacular    Medium – 25 Mar 19    ProgPoW Audit: Goals & Expectations Why are the Ethereum Cat Herders reviewing ProgPoW? Reading time: 4 min read       ",
                    "links": [
                        "https://medium.com/ethereum-cat-herders/progpow-audit-goals-expectations-75bb902a1f01"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "31",
                    "likes": "0",
                    "time": "29/03/2019-17:10:36",
                    "content": "@boris Yes, my post was a comment appended to the bottom of that one. I have questions on it. Sorry, the medium interface is a bit wonky in that respect.    Medium – 25 Mar 19   What is the total amount necessary to fund the audit? What organizations and others are you relying on? Reading time: 1 min read       ",
                    "links": [
                        "https://medium.com/@lookfirst/what-is-the-total-amount-necessary-to-fund-the-audit-c2451efbcce5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "32",
                    "likes": "1",
                    "time": "29/03/2019-19:35:35",
                    "content": "I’m just highlighting relevant links for people to suck in the content to try and bring material together in one place on here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                }
            ]
        }
    ],
    "group_index": "679"
}