{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eips-and-dependence-on-external-standards/797",
            "title": "EIPs and dependence on external standards ",
            "index": 797,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Recmo",
                    "index": "1",
                    "likes": "5",
                    "time": "18/07/2018-16:01:13",
                    "content": "Now that EIPs seem to be moving from proposing improvements to becoming a repository of standards, maybe we should be clear about which external (i.e. non-EIP) standards we build on. Example: The many EIPs that specify contract interfaces all depend on the smart contract ABI. AFAIK the authoritative source for that is the Solidity documentation. This often goes unmentioned in the EIPs. Here’s a list of external authoritative sources that EIPs depend on:  The Yellow Paper JSON-RPC specification on the wiki Web3 specification on the wiki ABI specification in Solidity documentation Wherever the wire format of the Ethereum p2p protocol is defined. Various cryptographic primitives. (Please add any others you are aware of)  While it is not feasible to include everything, I think we can establish some goals here. Personally, I would like to see specifications like ABIv2, JSON-RPC, web3 and wire formats be included as an EIP.  Ideally the crypto primitives should also each have a short EIP containing literature references, test vectors and a (link to a) reference implementation. Getting the EIP repo to fully specify Ethereum would be nice, but the Yellow Paper already covers most of this well (although it could be a bit more concrete and verbose in places). At a minimum I would like to have a definite list of all the relevant Ethereum specific standards. ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing that external standards that Ethereum Improvement Proposals (EIPs) depend on should be clearly identified and included in the EIP repository. The author suggests that specifications like ABIv2, JSON-RPC, web3, and wire formats should be included as EIPs, and that crypto primitives should have their own EIPs containing literature references, test vectors, and a reference implementation. The post also suggests that a definite list of all relevant Ethereum-specific standards should be established.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.122670807453416
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "2",
                    "likes": "0",
                    "time": "23/07/2018-06:15:14",
                    "content": "A few months ago I started documenting some of these here: https://ethereum-magicians.org/t/standards-work-throughout-the-community/98 I agree, all standards that comprise the Ethereum system need to be called out, and formally brought through the improvement process.     Recmo:  I would like to see specifications like ABIv2, JSON-RPC, web3 and wire formats be included as an EIP.  Ideally the crypto primitives should also each have a short EIP containing literature references, test vectors and a (link to a) reference implementation.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                }
            ]
        }
    ],
    "group_index": "1562"
}