{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-3782-multi-vanilla-nft-standard-for-unicode-based-logographic-representation-deprecated/6976",
            "title": "EIP-3782: Multi vanilla NFT standard for unicode-based logographic representation (deprecated) ",
            "index": 6976,
            "category": [
                "Tokens"
            ],
            "tags": [
                "nft"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/maxareo",
                    "index": "1",
                    "likes": "0",
                    "time": "30/08/2021-06:07:40",
                    "content": " Abstract A vanilla non-fungible token standard proposed by EIP-3754 combined with the established unicode system can create an on-chain logographic system for representing language characters that are logographs. Examples include hanzi in Mandarin, kanji in Japanese, hanja in Korean, and etc.  Motivation A logograph is a written character that represents a word or morpheme, whereas a unicode is an information technology standard for the consistent encoding, representation, and handling of texts. A vanilla NFT by EIP-3754 can naturally combine the two into a new system that is ideal for on-chain representation of the logograpic language systems.  Applications On-chain chatting, blogs, micro-blogs systems can be built for communities using these languages with this new standard. ",
                    "links": [
                        "https://home.unicode.org/"
                    ],
                    "GPT-summary": "The post proposes a new standard for non-fungible tokens that combines the established unicode system with a vanilla NFT standard proposed by EIP-3754. This new system can be used for on-chain representation of logographic language systems such as hanzi, kanji, and hanja. The post suggests that this new standard can be used to build on-chain chatting, blogs, and micro-blogs systems for communities using these languages. The post explains the motivation behind the proposal and its potential applications.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.761363636363637
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/maxareo",
                    "index": "3",
                    "likes": "0",
                    "time": "30/08/2021-06:25:53",
                    "content": "  github.com/ethereum/EIPs     \t      [EIP-3782] Multi token standard for unicode-based logographic representation            opened 06:08AM - 30 Aug 21 UTC               simontianx                 ## Abstract A vanilla non-fungible token standard proposed by EIP-3754 combined… with the established unicode system can create an on-chain logographic system for representing language characters that are logographs. Examples include _hanzi_ in Mandarin, _kanji_ in Japanese, _hanja_ in Korean, and etc.  ## Motivation A logograph is a written character that represents a word or morpheme, whereas a unicode is an information technology standard for the consistent encoding, representation, and handling of texts. A vanilla NFT by EIP-3754 can naturally combine the two into a new system that is ideal for on-chain representation of logograpic language systems.  ## Examples Instead of sending the Chinese letters of the Great Wall 长城, two EIP-3754 tokens with ID#38271 and ID#22478 are sent in order to represent the two letters. The receiving end decodes the IDs and retrieves the original logographic characters.  ## Applicability On-chain chatting, blogs, micro-blogs systems can be built for communities using these languages.       ",
                    "links": [
                        "https://github.com/ethereum/EIPs/issues/3782",
                        "https://github.com/simontianx",
                        "https://ethereum-magicians.org/t/eip-eip-3722-poster-a-ridiculously-simple-general-purpose-social-media-smart-contract/6751/63"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.164256198347108
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/maxareo",
                    "index": "4",
                    "likes": "0",
                    "time": "02/10/2021-04:38:26",
                    "content": "This one has been renamed as EIP-4341. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1431"
}