{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/discussion-can-ethereum-be-a-linked-data-web/10932",
            "title": "Discussion - Can Ethereum be a linked data web? ",
            "index": 10932,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "nft",
                "metadata",
                "sbt",
                "semantic"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/JessicaC",
                    "index": "1",
                    "likes": "4",
                    "time": "19/09/2022-16:47:21",
                    "content": "After the long awaited merge shipped on 15 Sept 2022, the stage is set for further scalability, security, and sustainability. Now we can start to think of building something novel if the txs are 100x cheaper. The SBTs proposed by the paper Decentralized Society: Finding Web3’s Soul is inspiring. To build something centred around the Ethereum Identity Ecosystem, the way to prove something about your account, or you can call it wallets or souls, is really important. There are some early movers already building in this field, like POAPs to prove the attendance. What if we can go one step beyond them by making the proof of something NFTs public goods? The current NFT standard writes only the tokenID, name and URI in metadata. The URI usually points to somewhere on a centralized server like AWS. Although the data is open, the machine reading of the data causes high friction. The friction is even worse if we try to build something that requires more intelligence. Not to mention the centralized storage is in the contract to data sovereignty. The numerous tokens become meaningless once the server is down. A more decentralized way to issue the SBTs is that we write the meaning directly in the metadata. The open availability makes the reading of the meaning independent of any servers. And if we want to make it easier for the developers, we can write the meaning in some structure format, or even in some standard format like using RDF. For example, if the SBT represents someone who is a member of a DAO. When you read the on-chain data, you only know the account is holding an SBT, that’s all. But if we add the meaning in an RDF format, the machine can easily know the account is a member of a DAO. And this is a directed graph link, linking the account and the DAO. Consider each account is a data source that holds many SBTs, each SBT describes the relationship meaning in standard format and pointing to another data source.  Ethereum is now a linked data web! With more and more people creating their data in the format, the data web has increasing returns to all that can be easily shared and reused across community boundaries. ",
                    "links": [],
                    "GPT-summary": "The post discusses the possibility of building a linked data web centered around the Ethereum Identity Ecosystem. The author proposes a more decentralized way to issue SBTs by writing the meaning directly in the metadata, making the reading of the meaning independent of any servers. The post also suggests using RDF format to easily describe the relationship between accounts and DAOs. The post explains the proposal and invites constructive criticism and questions from third parties, while also extending the proposal to the wider community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.563984674329502
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "2",
                    "likes": "0",
                    "time": "20/09/2022-20:52:15",
                    "content": "This is already possible with data: URIs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/DonMartin3z",
                    "index": "3",
                    "likes": "0",
                    "time": "21/09/2022-05:46:55",
                    "content": "Please. Contact me . i got a deep project that will soon be posted in here , it 's all about ethereum’s future and the SBT’s interface / objective. Zaeondao@gmail.com ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/JessicaC",
                    "index": "4",
                    "likes": "1",
                    "time": "25/09/2022-13:37:06",
                    "content": "The URI is the way to identify the resources stored else where like AWS. The semantic NFTs will create a chain native data layer that is easy to query, to share and reuse with lower friction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/TimDaub",
                    "index": "5",
                    "likes": "2",
                    "time": "27/09/2022-15:07:02",
                    "content": "I’ve been working actively on this idea since 2016 when we proposed an IP rights management on blockchains with COALA IP: GitHub - COALAIP/specs: COALA IP is a blockchain-ready, community-driven protocol for intellectual property licensing.. Way more recently, with https://neume.network we’re building a socially scalable data extraction crawler geared towards derivative data published on Ethereum. The biggest challenge we currently face is that many in the space consider block tag “latest” as the de-facto manifestation of a blockchain object: But honestly, working more closely on the use case, what seems to be most important is the idempotency of calls and block tag “latest” doesn’t allow it. So I’ve been actively trying to influence identity groups to add a block tag descriptor to identity formats - I see them as precursors to properly linked data. Here are two examples where I’ve yet to succeed having influence and adding idempotency: CAIP-19: CAIP-19: Add block number tag in query by qizhou · Pull Request #125 · ChainAgnostic/CAIPs · GitHub EIP-4804: EIP-4804: Web3 URL to EVM Call Message Translation - #27 by TimDaub ",
                    "links": [
                        "https://neume.network",
                        "https://github.com/ChainAgnostic/CAIPs/pull/125",
                        "https://ethereum-magicians.org/t/eip-4804-web3-url-to-evm-call-message-translation/8300/27"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.17948717948718
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gbdt",
                    "index": "6",
                    "likes": "0",
                    "time": "12/10/2022-03:02:55",
                    "content": "The idea is practical. The current metadata lacks standards, resulting in fragmented data. We need pre-defined data models for metadata. I’m not sure it’s a good idea to put metadata on-chain. Possibly we can put RDF on-chain? or RDF attached to the metadata on IPFS? Ceramic and Textile teams are working on IPFS in this similar area. Ceramic ComposeDB Textilt TableLand ",
                    "links": [
                        "https://tableland.xyz/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.45
                }
            ]
        }
    ],
    "group_index": "126"
}