{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/use-sim-card-as-hardware-wallet/10744",
            "title": "Use SIM card as hardware wallet ",
            "index": 10744,
            "category": [
                "EIPs"
            ],
            "tags": [
                "hardware-wallet"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Evonne",
                    "index": "1",
                    "likes": "12",
                    "time": "08/09/2022-07:57:29",
                    "content": "Hi Magicians, The SIM card can be used to store wallet keys; it would be like metamask through the SIM card, a SIMgap solution to utilize SIM hardware chip to secure the private keys. PoC A SIM card with a custom Java SIMgap applet that uses the STK (SIM Tool Kit) menu to ask for user PIN to confirm signature requests Android APP using Android built-in APIs to construct requests to the SIMgap applet iOS APP using BIP (Bearer Independent Protocal) to request the SIMgap applet for performing transactions. Motivation On mobile phones, software wallets are convenient to use but potentially insecure and cumbersome to move to a new device; hardware wallets, while secure, are expensive or requires additional cables or hardware if not unsupported at all. The SIM card seems like a perfect solution: a piece of secure hardware controlled by the user that is always in the phone and can be moved between devices. Next Steps Try for an EIP to define the standard between the SIM and APP. ",
                    "links": [],
                    "GPT-summary": "The author proposes using a SIM card as a hardware wallet to store wallet keys, which would be a secure and convenient solution for mobile phones. The post explains the technical details of the proposal and suggests next steps for defining a standard between the SIM and APP. A 3rd party gives constructive criticism by asking questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.607438016528926
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/denglinlu",
                    "index": "2",
                    "likes": "0",
                    "time": "15/09/2022-14:15:32",
                    "content": "Hey, it’s great, I like to hear you would implement secure hardware wallet solution and you have done PoC. Including you will try to propose EIP to define the standard between the SIM and APP and I would like to hope coming soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.000000000000001
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/cjpais",
                    "index": "3",
                    "likes": "1",
                    "time": "03/10/2022-17:32:32",
                    "content": "Have you considered using something like a TPM or Secure Enclave as well? This is something that a considerable amount of modern devices have built into the hardware and extend outside of the phone compute environment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lanlan3322",
                    "index": "4",
                    "likes": "1",
                    "time": "04/10/2022-04:10:49",
                    "content": "Great idea. Just wondering why there is no giant like Apple, or Samsung doing this. it should be super easy for them to integrate this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.958333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/high_byte",
                    "index": "5",
                    "likes": "1",
                    "time": "04/10/2022-16:00:28",
                    "content": "funny, some months ago I thought about this exact thing. I wouldn’t go as far as saying it’s perfect, but it is a nice to have option. it was a bit difficult researching the subject, it also seems that information like IMSI is encoded by the manufacturer and is kept in a database. other information like contacts is readable from the mobile device, so that’s no good. I’m not sure if there’s a trivial way to encode a key securely on a SIM. the other option mentioned here is secure enclaves, Trusted Execution Environment (TEE), etc. I wonder if existing wallets already implement this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.529761904761905
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Evonne",
                    "index": "6",
                    "likes": "1",
                    "time": "06/10/2022-06:48:09",
                    "content": "The key advantage of using SIM as hardware wallet is the removable feature from the mobile devices. Dependencies on the phone manufacturers would involve complications about compatibility, portability and universal certification for security. SIM wallet can be open souce with its applet design, which shares different security domain with other SIM functions by firewalls implemented by javacard framework. SIM can be an “open device wallet” which is compatible with mobile phones, as well as cold wallet and airgap devices which can provide a standard SIM slot. When SIM were introduced in the mobile network while motorola was still dominating the mobile phone supply, the phone devices started to diversify with so many popolar branded manufacturers. We are looking forward to seeing the same advancements in web3 with more hardware wallet suppliers other than Ledger and Trezor for more advances use cases. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.270833333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lanlan3322",
                    "index": "7",
                    "likes": "0",
                    "time": "26/10/2022-06:14:08",
                    "content": "SIMs are also controlled by telecom giants and providers which vary from country to country. We need open-source SIM standards adopted by telecom providers. They are able to block SIMs to enter the network that is not authorized by them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "103"
}