{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/proposal-how-about-having-an-erc-authors-meetup/8610",
            "title": "Proposal: How about having an ERC Author's Meetup? ",
            "index": 8610,
            "category": [
                "EIPs"
            ],
            "tags": [
                "erc"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/xinbenlv",
                    "index": "1",
                    "likes": "1",
                    "time": "15/03/2022-02:08:18",
                    "content": "  github.com/ethereum/EIPs     \t      Proposal: How about having an ERC Meetup?            opened 02:07AM - 15 Mar 22 UTC             closed 06:13AM - 16 Jul 22 UTC               xinbenlv                 Hi wise authors who work on ERC drafting.  As per the progress of merge and la…yer 2 in the space, we seem to be increasingly close to the explosion of applications / dapps. Many of these future applications will benefit from ERC standards for interoperability. That explains why we see an increasingly active community of ERC standards being proposed.    I also seem to see a gap for a live discussion regarding ERCs. Compared to the regular [AllCoreDevs Meetings](https://github.com/ethereum/pm/blob/master/README.md#all-core-devs-meetings) or [The Merge](https://github.com/ethereum/pm/blob/master/Merge/merge.md#merge-meetings) which are live and synchronized, ERCs are often asynchronized and offline. It took a while for one to get feedback or understand what to do next.   Here is a few things I think we could talk about  1. For ERC authors to come to present their ERC drafts and solicit feedback  2. For perspective contributors to give feedback or signup to collaborate. 3. For third-party to give feedback to ERCs or present their problems of interoperability 4. For newbee authors to meet Editors and other experienced authors of the community and learn. 5. For CoreDev / Merge / Fees workgroups to have a place to share lower level proposals with ERC authors and solicit feedback  6. Review upcoming ERC last-calls, review stale EIPs and see if anyone is interested to takeover for reviving.  I checked the [ETH PM repo](https://github.com/ethereum/pm) and it seems we don't have such a meeting yet.  I wonder if this community have previously considered starting a regular online meeting ERC side of the contributors of this repo?  Your feedback is greatly appreciated. If you are interested in participating, please comment here and share your timezones so we can gauge the interest and find a good time.  xinbenlv@       Hi wise authors who work on ERC drafting. As per the progress of merge and layer 2 in the space, we seem to be increasingly close to the explosion of applications / dapps. Many of these future applications will benefit from ERC standards for interoperability. That explains why we see an increasingly active community of ERC standards being proposed. I also seem to see a gap for a live discussion regarding ERCs. Compared to the regular AllCoreDevs Meetings or The Merge which are live and synchronized, ERCs are often asynchronized and offline. It took a while for one to get feedback or understand what to do next. Here is a few things I think we could talk about  For ERC authors to come to present their ERC drafts and solicit feedback For perspective contributors to give feedback or signup to collaborate. For third-party to give feedback to ERCs or present their problems of interoperability For newbee authors to meet Editors and other experienced authors of the community and learn. For CoreDev / Merge / Fees workgroups to have a place to share lower level proposals with ERC authors and solicit feedback Review upcoming ERC last-calls, review stale EIPs and see if anyone is interested to takeover for reviving.  I checked the ETH PM repo and it seems we don’t have such a meeting yet. I wonder if this community have previously considered starting a regular online meeting ERC side of the contributors of this repo? Your feedback is greatly appreciated. If you are interested in participating, please comment here and share your timezones so we can gauge the interest and find a good time. xinbenlv@ ",
                    "links": [
                        "https://github.com/ethereum/EIPs/issues/4917",
                        "https://github.com/xinbenlv",
                        "https://github.com/ethereum/pm/blob/master/README.md#all-core-devs-meetings",
                        "https://github.com/ethereum/pm/blob/master/Merge/merge.md#merge-meetings",
                        "https://github.com/ethereum/pm"
                    ],
                    "GPT-summary": "The author proposes having an ERC Meetup to discuss ERC standards for interoperability. The author asks for feedback and suggestions on the proposed meeting and invites interested parties to participate. The post also suggests various topics for discussion, including presenting ERC drafts, giving feedback, collaborating, and reviewing upcoming ERC last-calls.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Community and Engagement",
                        "Smart Contract Updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.555050505050505
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jhfnetboy",
                    "index": "2",
                    "likes": "0",
                    "time": "30/04/2022-03:21:00",
                    "content": "I think we need some online meetup to discuss your advice, I am interested in the communications of EIPS and draft. Also, future infrastructures depend on the ERC protocols. We need feedback and some real application scenarios suggestions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Joe",
                    "index": "3",
                    "likes": "1",
                    "time": "30/11/2022-21:31:20",
                    "content": "Agreed! Newbee authors. The feedback here doesn’t always seem to be timely, how can newbee authors get feedback faster to correct and improve  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1651"
}