{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/forming-a-ring-product-management-ring-ethproduct/2066",
            "title": "Forming a Ring: Product Management Ring (ETHProduct) ",
            "index": 2066,
            "category": [
                "Working Groups",
                "Product Management Ring"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "1",
                    "likes": "5",
                    "time": "29/11/2018-20:03:58",
                    "content": "Hi all, we are announcing the Ethereum Product Management Ring (Short: ETHProduct) Recently this past year, there as been a consistent need for better product and project management across the whole ecosystem whether it is in a internal distributed team context or an inter-team open source one. We agreed we should begin conversations around such matters and provide an forum for meaningful discussion. Hence the creation of ETHProduct. Topics:  Distributed product management Open source web3 product management Attitudes towards PM roles within the community Organisational structures  We have had two video calls so far: Community call #0 (Aidan, Pet3rpan) Community call #1 (Aidan, Pet3rpan, Tim Beiko, Yalor Mewn, Chris Remus, Cem F, Chris Seifert, Greg Wong)     Ways of Self Organization in Decentralized Development Cycles Product Management Ring       Thank you everyone for today’s conversation, excited to see where this all goes.  Please add your notes and comments here        #1 ETHProduct Community Call (Video + Notes) Product Management Ring       Nice!  I am planning to do this myself too! Calls already scheduled for next week - looking forward to what you learn as well   Will create some sort of repo to collect this…     ",
                    "links": [
                        "https://ethereum-magicians.org/t/1-ethproduct-community-call-video-notes/2060/4",
                        "https://ethereum-magicians.org/t/about-the-product-management-ring-category/2072"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.870833333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "2",
                    "likes": "1",
                    "time": "30/11/2018-17:02:55",
                    "content": "Thanks for pushing all of this forward @pet3rpan! During the council of Prague when @cosmosys suggested creating a PM ring, I was very critical of using that as the name of the ring and I still feel that way. I really want to avoid using a term with such weight to it, I believe that the word management does not help articulate what my day to day looks like. Would love to hear what other people think of this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/cosmosys",
                    "index": "3",
                    "likes": "0",
                    "time": "30/11/2018-18:42:54",
                    "content": "I wouldn’t get too caught up on the title. A product owner/leader/manager/agent is a proxy to the business/users of said system. I believe bringing in tools such as COD formulas (cost of delay), timeboxes, and inspect & adapt ceremonies would bring greater awareness and cohesiveness amongst contributors to Ethereum ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "4",
                    "likes": "2",
                    "time": "30/11/2018-20:46:26",
                    "content": "I absolutely agree, but at the end of the day it all starts with the language we use. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chris-remus",
                    "index": "6",
                    "likes": "3",
                    "time": "01/12/2018-14:55:40",
                    "content": "I’m feeling excited to see this ring. My gratitude for organizing it @pet3rpan  I began recognizing the need for more crypto PMs in early 2017. Here’s my first post on the topic. Knowing then what I know now, I’d change the perspective from consultant/client to developer/user. It was really early then, perhaps a bit too early even. Crypto’s matured to a point where execution will emerge as a key differentiator. A white paper and prototype aren’t enough any longer. Crypto projects that execute will make a difference in our world Those that don’t, won’t. An effective PM guides that execution and increases the chances that it happens. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.012500000000001
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chris-remus",
                    "index": "7",
                    "likes": "1",
                    "time": "01/12/2018-14:59:21",
                    "content": "I personally don’t care about the language used. Yet, the reality we’re dealing with is it matters to those we’re hoping to help. There’s a strong aversion to words like “manager”, “leader” and “owner” in the decentralized and open source world. That’s why I’ve been thinking about terms like “coordinator” and “orchestrator”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.722222222222221
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "8",
                    "likes": "1",
                    "time": "01/12/2018-18:18:13",
                    "content": "@noot @cosmosys, @ricmoo, @yuetloo and I spoke about this last night after our meetup. The fact that there is such clear aversion to the terms that you mentioned means that we have to care about our language. We can say semantics don’t matter but because people care about them I will go along with it. Yet this does not actually change our actions even if we call ourselves coordinators. I have never managed one of our projects, I have worked with people to make sure they are able to manage themselves. Human beings are perfectly capable of self organization, we just need to make sure that entrenched systems, processes and language does not stop them from being able to achieve their defined goals. That is why I think this ring should be more focused on studying development cycles as I voiced at the council of Prague when @cosmosys organized the ring.  However if I am the only one that feels this way, I am not looking to cause any trouble. Just reflecting on lessons learned during my brief stint in university about how important semiotics are within the context of communication. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "9",
                    "likes": "1",
                    "time": "01/12/2018-20:01:23",
                    "content": "    pet3rpan:  Ethereum Product Management Ring   Who are Product Manager and what kind of product do they manage? How are you going to fulfill their decisions in decentralized community? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "10",
                    "likes": "0",
                    "time": "02/12/2018-21:48:58",
                    "content": "    Ethernian:   Ethereum Product Management Ring  Who are Product Manager and what kind of product do they manage? How are you going to fulfill their decisions in decentralized community?   Sorry, can you elaborate on your question here, I am not sure by what you are trying to ask.     ChainSafe:  I absolutely agree, but at the end of the day it all starts with the language we use.   While I agree that on a practical note, it doesn’t matter. However with Aidan’s point on language, I definitely agree that language matters a lot, especially with dealing with all sorts of backgrounds, esp. with those who may not understand the role of product managers and don’t understand how PMs don’t really ‘manage’ people. (well product managers do and they don’t in MANY ways.) But on the other hand, I personally think people need to be managed/guided and a lot of people also WANT to be managed/guided (if you have experienced great management, you know what I am talking about ~ great product leadership makes the whole team happy and productive - and most importantly WIN together as a team) We shouldn’t shy away from calling it product management just because there are aversions to not wanting to feel to be ‘managed’. (In many cases, my hypothesis is that these aversions are the result of extremely poor management and sometimes complete lack of product management in some cases). But yes, happy to put this aside for the great good so we can share more of the PM love.  I think such aversions can be remedied and also part of our effort to improve the coordination of various teams in the space (which potentially starts with the conversation of “So… What is product management? What is it not?” my guess is that many are not aware, PMship can be arcane at times). For those reasons, I can see both sides to why we should keep and also change the name. I lean towards keeping the name but I also agree that a different name could provide significant social advantages. Happy to keep the name but also happy to align with a new one if there is rough consensus. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.441627816627817
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "11",
                    "likes": "1",
                    "time": "03/12/2018-01:03:52",
                    "content": "    pet3rpan:   Who are Product Manager and what kind of product do they manage? How are you going to fulfill their decisions in decentralized community?  Sorry, can you elaborate on your question here, I am not sure by what you are trying to ask.   Will you manage independent teams in ethereum space? How will you do it if they do not like to be managed? I don’t see how it could work in our anarchistic space…     pet3rpan:  I personally think people need to be managed/guided and a lot of people also WANT to be managed/guided   Unsure if it is true in our space by itself. I see our community as quite leadership resistant  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "12",
                    "likes": "1",
                    "time": "03/12/2018-01:29:41",
                    "content": "    pet3rpan:  esp. with those who may not understand the role of product managers and don’t understand how PMs don’t really ‘manage’ people. (well product managers do and they don’t in MANY ways.)   It is this lack of clear distinction of what a PM does that creates barriers when trying to coordinate development cycles IMO. We have the opportunity to take the lessons learned from principles, frameworks and processes of the traditional PM role and define it more accurately for web3.0. Let’s take this as a positive opportunity to do things better and never create an image of management!     Ethernian:   I personally think people need to be managed/guided and a lot of people also WANT to be managed/guided  Unsure if it is true in our space by itself. I see our community as quite leadership resistant    I agree with @Ethernian, some people may want principles, frameworks and or processes but if there is a need for management in the development cycle than IMO our principles, frameworks and or processes are not good enough. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.06344696969697
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "13",
                    "likes": "1",
                    "time": "03/12/2018-01:38:58",
                    "content": "    ChainSafe:  Let’s take this as a positive opportunity to do things better and never create an image of management!   Yes. Great point. We should be cautious with management patterns.     ChainSafe:  our principles, frameworks and or processes are not good enough.   If we take it seriously, we could find people who is able manage communities and then create “guidelined and best practices” based on their experience. Leadership is not easy to formalize, but I don’t know another way to go. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.251262626262626
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "14",
                    "likes": "1",
                    "time": "03/12/2018-02:28:51",
                    "content": "    ChainSafe:  It is this lack of clear distinction of what a PM does that creates barriers when trying to coordinate development cycles IMO. We have the opportunity to take the lessons learned from principles, frameworks and processes of the traditional PM role and define it more accurately for web3.0. Let’s take this as a positive opportunity to do things better and never create an image of management!   +1 Agreed, we can make it much better      Ethernian:  Unsure if it is true in our space by itself. I see our community as quite leadership resistant    Leadership isn’t about just one individual in a team. It is about everyone! This comment maybe be from my own experience with other engineers and my own preference back when I was a designer. I really enjoy great product management - allowed me to focus on what I am good at. I believe our definitions of management differ! But happy to agree that we disagree  But nonetheless, I do see where you are coming from and agree your comment on the the anarchistic sentiment of the community.     Ethernian:  If we take it seriously, we could find people who is able manage communities and then create “guidelined and best practices” based on their experience. Leadership is not easy to formalize, but I don’t know another way to go.   +1 Bingo  I guess this is where the magicians and our group comes in. I really want to drive more conversation on how we can better coordinate and conduct product management in this space. First step is sharing and learning from each other ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7167832167832175
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chad",
                    "index": "15",
                    "likes": "1",
                    "time": "03/12/2018-10:13:53",
                    "content": "Hey y’all!  I’m a product manager at Status and would love to join and talk product. Kudos for bringing us all together. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "16",
                    "likes": "1",
                    "time": "03/12/2018-12:38:02",
                    "content": "Hey sent you a message! more deets there ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/JoshAFairhead",
                    "index": "17",
                    "likes": "2",
                    "time": "03/12/2018-18:04:19",
                    "content": "Hola, I’d like to join in on this one. Have you a cal link? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "18",
                    "likes": "0",
                    "time": "03/12/2018-23:55:03",
                    "content": "hey! just PM me your telegram handle  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tschubotz",
                    "index": "19",
                    "likes": "2",
                    "time": "05/12/2018-10:48:34",
                    "content": "Hey, I just caught up on all this - super exciting and I’d like to join as well. Thanks a lot for pushing it @pet3rpan! Interviews on product management in the web3 open source ecosystem is super insightful. I’m happy to provide some info on how we work at Gnosis. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.680555555555555
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "20",
                    "likes": "0",
                    "time": "05/12/2018-20:53:04",
                    "content": "Threw you a message on telegram. Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Eric",
                    "index": "21",
                    "likes": "1",
                    "time": "05/12/2018-21:09:45",
                    "content": "Hey just reading up on the thread and this is very exciting. I’ve been working on project management with the Whiteblock team and am actively learning more day by day. Would love to be involved in the discussion. Thanks for organizing @pet3rpan ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.456666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/adamschmideg",
                    "index": "22",
                    "likes": "1",
                    "time": "06/12/2018-12:29:12",
                    "content": "I just joined the Geth and Swarm teams at the EF as a PM and I’m experiencing new types of challenges, resistance. So I find this ring really exciting and potentially helpful. I’d like to join the call too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7272727272727275
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/JamesZaki",
                    "index": "23",
                    "likes": "1",
                    "time": "07/12/2018-19:45:17",
                    "content": "Great discussion in this thread, thanks for kicking things off here. Recent history - In Feb 2013 the Swedish pirate party shared it’s “swarm” organisation method, there was a ted talk on this too. Some links…  https://falkvinge.net/2013/02/14/swarmwise-the-tactical-manual-to-changing-the-world-chapter-one/  http://wiki.p2pfoundation.net/Swarm_Organization I hope people will find it very insightful.  A few points mentioned in the thread that I’d like to further:   Naming is important Starting by clarifying PM is product management (not project management). Both are important, but starting with defining terms like: product, management, and users. Then defining what problem PMs would like to solve   Decentralised management Can come across as an oxymoron, so roles like motivator/coordination-assistant might work better. In this space I feel that managers can serve projects well with “management suggestions” that are backed by data/experience, and then it is up to the developers to opt-in to one   Coming from several angles here (Engineer, educator, and PM) my 2c cents with points of value: leadership through doing, encouraging an open-environment with autonomy, and creating a roadmap that is backed with experience and data. Lastly, is the Telegram group intentionally hidden, or can a link be shared? ",
                    "links": [
                        "http://wiki.p2pfoundation.net/Swarm_Organization"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.761904761904761
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "24",
                    "likes": "0",
                    "time": "07/12/2018-20:19:14",
                    "content": "    JamesZaki:  Naming is important Starting by clarifying PM is product management (not project management). Both are important, but starting with defining terms like: product, management, and users. Then defining what problem PMs would like to solve   Thank for the clarification. The reason why we use product management is because there is much more to it than just project management - it’s important to make that distinction - it’s not just development cycles, it’s not just coordination And yes, I am intentionally not sharing the link out into the public because public join links kill telegram groups (seen too many groups go down this path + admin a few other telegram groups). Rather have it stay high quality and grow organically. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.722863247863248
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/JamesZaki",
                    "index": "25",
                    "likes": "1",
                    "time": "07/12/2018-21:38:59",
                    "content": "Caught up on some reading and there were some great points in a few places. Meta-Magicians thread  \" while  actions  can be carried out in an ad-hoc swarm-like manner,  funding allocations  don’t quite lend themselves to the same ad-hoc treatment (the latter is zero-sum, while the former is not).\"  But primarily from the original SODC thread, Self Organised Development Cycles. and thought this was well summarised:    Ways of Self Organization in Decentralized Development Cycles   If parts should fit together and this is our goal, so may be we are missing some role like Product Manager (or Program Manager - for bigger cases)? Then we should try to adopt this classical role to our reality without reinventing the wheel. From other side: there are bigger projects in opensource community releasing products based on work of many SODCs. For example, there are linux distributors, like Canonical with Ubuntu. Do we missing that part in our ecosystem? I would prefer to find and adopt existing experience instead of reinventing the wheel.   Would love to hear from long-established open-source projects and how they guide products, and thoughts on possible differences with web3 products. Also making the distinction between consumer products (user = layman), vs protocol “products” (user = developer). ",
                    "links": [
                        "https://ethereum-magicians.org/t/ways-of-self-organization-in-decentralized-development-cycles/1713/46",
                        "https://ethereum-magicians.org/t/ways-of-self-organization-in-decentralized-development-cycles/1713/46"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.661764705882353
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "26",
                    "likes": "0",
                    "time": "07/12/2018-21:58:01",
                    "content": "    JamesZaki:  But primarily from the original SODC thread, Self Organised Development Cycles. and thought this was well summarised:   Absolutely agree. Its definitely on the list of things to do ~ but I am only one person doing this on the side  Currently I am exploring the problem more, gaining greater understanding our own problems before looking at possible solutions. I foresee a bigger focus on such frameworks maybe later when we begin moving into the realm of trying to solve things. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.990384615384615
                }
            ]
        }
    ],
    "group_index": "562"
}