{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/idea-licensing-token-standard-specially-for-licensing-relationshp/7924",
            "title": "Idea: Licensing token standard specially for \"licensing\" relationshp ",
            "index": 7924,
            "category": [
                "EIPs"
            ],
            "tags": [
                "nft",
                "sft",
                "licensing"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/linvictor88",
                    "index": "1",
                    "likes": "0",
                    "time": "07/01/2022-03:25:27",
                    "content": "Hi All, It’s appreciated for your comments on our licensing token standard \" Create a new licensing non-fungible token standard\" request to managing “licensing” relationship. NFT grants proof-of-owning to any asset owner and bring great potential to Ethereum. While apart from ownerhsip, there are more relationship referring to “licensing” in common life. For example, software company issues licenses for their software use. NFT owner sells licensing tokens for their NFT use permission. DApp provides types of VIPs licenses as incentives to their regular customers. Metaverse GameFi[5] producer creates licensing service contract so that players are able to rent their powerful game equipment. We think licensing token is more like a semi-fungible token in which it starts out from multiple types of fungible token and finally ends at non-fungible token, so here we first proposes semi-fungible token standard. Then we extended SFT to licensing token (LNFT) standard for variety of “licensing” relationship use. LNFT grants proof-of-licensing to asset owner which is a supplement of  present NFT. Please refer details to the pull request and welcome for your replies and suggestions. ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pull/4635"
                    ],
                    "GPT-summary": "The author of the post is proposing a new licensing token standard for managing licensing relationships. They explain the concept of semi-fungible tokens and how they can be extended to create licensing tokens. The author is asking for feedback and suggestions on their proposal. A 3rd party could provide constructive criticism, extend the proposal, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.828069657615113
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/rayzhudev",
                    "index": "2",
                    "likes": "0",
                    "time": "19/04/2022-01:21:26",
                    "content": "Hi Victor, My opinion is that rather than making this a new token standard, we can create an interface such as in EIP-2981. The license can be represented as an ERC-721 belonging to the 0x0…0 address with the interface referencing the license contract. Here are my initial thoughts around what the standard should contain. interface IERCLICENSE is IERC165 {     function licenseInfo(         uint256 _tokenId     ) external view returns (         address license     ); }  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.113636363636363
                }
            ]
        }
    ],
    "group_index": "1558"
}