{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/welcome-please-readme-first/8",
            "title": "Welcome! Please README first! ",
            "index": 8,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/system",
                    "index": "1",
                    "likes": "16",
                    "time": "16/02/2018-08:44:58",
                    "content": " Hello  Welcome to the Ethereum Magicians forum    Ethereum Magicians is a forum for the crypto community to have a place where anyone can join, create topic and discuss mainly about EIPs and technical difficulties of Ethereum ecosystem. Or in another words “Ethereum Magicians forum is a place on the internet where your voice will be heard and your contributions to the Ethereum will matter”. Ethereum Magicians is a group of individuals working and contributing to the Ethereum.  What to do on a forum?  Read and discuss about Ethereum Create topic Form a working group Share prototype, code, graph and ask for feedback Attend discussions and in-person meetings   First time on Ethereum Magicians forum? If you’re the first time on the Ethereum Magicians forum, please check out our New Member Guide where are explained terms that we are using on this forum and will give you a lot of answers to questions regarding this forum and Ethereum Magicians in general.  History of Ethereum Magicians Fellowship of Ethereum Magicians (FEM) was founded to solve problem of offline and online coordination in Ethereum. We started an open forum with a focus on improving Ethereum without unwanted noise (that social media like Twitter and Reddit provides). FEM is Fellowship of individuals with a common goal - Improve Ethereum. If you’re interested in reading more of the history of FEM, read this Medium article from @pet3rpan Feel free to introduce yourself in the Introduction thread Read more about Ethereum Magicians Ethereum Core Maintainers Medium article - explaining the difference between Ethereum Magicians, Ethereum Cat Herders and AllCore Devs  Feel free to share Ethereum Magicians posts on social media and tag us @EthMagicians  ",
                    "links": [
                        "https://medium.com/ethereum-magicians/fellowship-of-the-ethereum-magicians-8711d4d781a6",
                        "https://ethereum-magicians.org/t/the-big-introduce-yourself-thread/75",
                        "https://medium.com/ethereum-magicians/ethereum-core-maintainers-%EF%B8%8F-3e0cd90d3172",
                        "https://ethereum-magicians.org/t/ethereum-magicians-2-0-updates-roadmap/3758"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.084280303030303
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fulldecent",
                    "index": "2",
                    "likes": "1",
                    "time": "12/03/2018-20:40:10",
                    "content": "Who are the magicians? the EIP authors? What is the full scope of our mission here? Does our mission involve solving a specific problem at this time? If we are successful at that, will the fellowship be disbanded? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "3",
                    "likes": "4",
                    "time": "13/03/2018-04:19:24",
                    "content": "@fulldecent, the proposed mission is described in this document: https://docs.google.com/document/d/1xzBymEOGdcpc7kwVGXECFReKmnAZ1WDj6KI81X4Exf0/edit The scope is as big as it needs to be. The Fellowship is not solving one problem in particular; rather, it serves as a communication and decision-making process in order to produce better EIPs. See “EIP Types” in EIP-1 for what might be discussed in Fellowship councils: https://github.com/ethereum/EIPs/blob/master/EIPS/eip-1.md#eip-types ",
                    "links": [
                        "https://github.com/ethereum/EIPs/blob/master/EIPS/eip-1.md#eip-types"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "4",
                    "likes": "0",
                    "time": "08/11/2019-11:27:45",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "5",
                    "likes": "0",
                    "time": "08/11/2019-11:28:43",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "6",
                    "likes": "0",
                    "time": "08/11/2019-11:29:09",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dtedesco1",
                    "index": "11",
                    "likes": "2",
                    "time": "04/04/2022-04:45:46",
                    "content": "Many organizations of this nature are forming as DAOs. Others are committing to progressive decentralization over time, such as Sky Mavis and Forte. Several recently discussed EIPs (ERC-4671 Non-Tradable Tokens, ERC-4824 DAOs, and perhaps my proposed EXP) may allow groups to decentralize decision-making and incentivize efforts without becoming financially-driven. Doing so with Ethereum Magicians could serve as a test case for future community governance structures in the Ethereum ecosystem and beyond. Since Ethereum is creating the ecosystem for new organizations to work this way, should the group that manages Ethereum contributions “dogfood” our efforts? Is that something worth aspiring towards in the governing documents? I’m not sure, and generally curious how others think about this. ",
                    "links": [
                        "https://axie.substack.com/p/community?s=r",
                        "https://forte.io/#company",
                        "https://ethereum-magicians.org/t/eip-4671-non-tradable-token/7976",
                        "https://ethereum-magicians.org/t/erc-4824-decentralized-autonomous-organizations/8362",
                        "https://ethereum-magicians.org/t/eip-exp-fungible-non-tradable-tokens/8805"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.518181818181818
                }
            ]
        }
    ],
    "group_index": "1568"
}