{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/a-diamond-is-a-set-of-contracts-that-can-access-the-same-storage-variables-and-share-the-same-ethereum-address/4350",
            "title": "A diamond is a set of contracts that can access the same storage variables and share the same Ethereum address ",
            "index": 4350,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "proxy-contract",
                "smart-contracts",
                "upgradeable-contract"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/mudgen",
                    "index": "1",
                    "likes": "0",
                    "time": "09/06/2020-14:44:46",
                    "content": " Why use a diamond on Ethereum? Multiple small contracts calling each other increases complexity. A diamond handling its storage and functionality is simpler.   It provides a cohesive way to organize and structure complex contract interaction. By cohesive I mean that code that is associated with each other should be easy to use together. At the same time the Diamond Standard provides a degree of modularity. It provides this balance that is very useful.   The Diamond Standard also solves a huge technical problem which is the 24KB maximum contract size limit. This limit becomes a problem when you need contract code to access the same storage variables but can’t anymore because the contract size has gotten too big. The Diamond Standard enables multiple contracts to access the same storage variables in the same/similar way one large contract could.   A contract architecture that makes upgradeable contracts flexible, unlimited in size, and transparent.  Diamond Standard: https://github.com/ethereum/EIPs/issues/2535 The Diamond Standard is hot on Reddit right now: https://www.reddit.com/r/ethereum/comments/gze6k3/a_diamond_is_a_set_of_contracts_that_can_access/ Looking for someone to champion the Diamond Standard for OpenZeppelin: https://forum.openzeppelin.com/t/looking-for-someone-to-champion-the-diamond-standard-for-openzeppelin/3058 ",
                    "links": [
                        "https://www.reddit.com/r/ethereum/comments/gze6k3/a_diamond_is_a_set_of_contracts_that_can_access/",
                        "https://forum.openzeppelin.com/t/looking-for-someone-to-champion-the-diamond-standard-for-openzeppelin/3058"
                    ],
                    "GPT-summary": "The post explains the benefits of using a diamond on Ethereum, which is a set of contracts that can access the same storage variables and share the same Ethereum address. It provides a cohesive way to organize and structure complex contract interaction while also providing a degree of modularity. The Diamond Standard solves the problem of the 24KB maximum contract size limit and enables multiple contracts to access the same storage variables. The post also includes links to the Diamond Standard on GitHub and a Reddit thread discussing it, as well as a call for someone to champion the Diamond Standard for OpenZeppelin.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.1655448717948715
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Amxx",
                    "index": "2",
                    "likes": "0",
                    "time": "11/06/2020-20:38:54",
                    "content": "shameless self promotion: If you are looking for an implementation, maybe consider my implementation of ERC1538 (which is covered by this audit report) ",
                    "links": [
                        "https://github.com/iExecBlockchainComputing/PoCo/blob/v5/audit/v5/iexec-poco-audit-2020-03.pdf"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party advertising proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mudgen",
                    "index": "3",
                    "likes": "0",
                    "time": "11/06/2020-21:11:23",
                    "content": "@Amxx Your implementation is welcome.  Glad to see it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                }
            ]
        }
    ],
    "group_index": "1077"
}