{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-add-memo-to-transaction-requires-hard-fork/4982",
            "title": "EIP: Add memo to Transaction (Requires hard fork) ",
            "index": 4982,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/junderw",
                    "index": "1",
                    "likes": "0",
                    "time": "01/12/2020-07:35:12",
                    "content": "This is related to EIP-2876 The following idea is an alternative to the above EIP for deposit systems (centralized exchanges and merchants being major use cases) to differentiate funds moving toward a single account. By adding a memo space (it can be small and very limited, 8 bytes etc.) all deposits can be sent to one single cold wallet account, and the deposit watching system could just check the memo for an identifier. This would allow for apps like BTCPay to easily support ETH deposits, ERC20 deposits, and much more by just checking the memo in all received transactions and matching it with the invoice in the local database. Any thoughts? ",
                    "links": [
                        "https://ethereum-magicians.org/t/simple-way-to-decrease-network-gas-usage/5524"
                    ],
                    "GPT-summary": "The author of the post is proposing an alternative to EIP-2876, suggesting the addition of a memo space to differentiate funds moving towards a single account. The author is asking for feedback and thoughts on the proposal. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.853250915750916
                }
            ]
        }
    ],
    "group_index": "1192"
}