{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/nft-leader-follower-protocol/10263",
            "title": "NFT \"leader-follower\" Protocol ",
            "index": 10263,
            "category": [
                "EIPs"
            ],
            "tags": [
                "nft",
                "erc-721",
                "multi-chain"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/SpiderAres",
                    "index": "1",
                    "likes": "0",
                    "time": "05/08/2022-16:39:00",
                    "content": " Abstract  This proposal can be regarded as an UPGRADED VERSION of the ERC-721 protocol, which aims to realize the convenient and continuous infinite synthesis and iteration of multi-chain NFT assets. This NFT protocol will empower cross-chain NFT assets to combine arbitrarily, combine transactions, and publish on multiple chains.  Motivation  Now, an important factor that restricts the diversification of the gamefi track and NFT marketplace is the “ecological fragmentation”. It is true that the existence of cross-chain bridges has played a certain positive incentive for NFT cross-chain transactions and the interoperability of various public chain ecosystems, but at present, it can only do some transaction optimization for a single NFT asset. With the goal of promoting interoperability across the blockchain industry and the concept of multi-chain coexistence, we have pioneered the EIP-xxxx protocol proposal. This proposal allows NFTs to be combined and traded across chains, and allows NFTs to be upgraded and iterated, which we also refer to figuratively as a “leader-follower” protocol relationship (as explained in ‘feature 1)’ below). This protocol will primarily apply to the further development of the Gamefi project.  Features Introduction  1) Cross-chain combination This proposal makes it possible to combine NFT assets across different chains. That is, on the basis of ensuring that the original chain of each NFT is not transferred, the cross-chain combination is carried out. By abstracting the core parameters of the NFT, we will release a unified standard protocol interface so that each cross-chain NFT asset can be successfully combined across different chains.  Example A multi-chain gamefi project released the same game version on the Ethereum main network and the Avalanche network respectively. The project chose to release its limited 10,000 NFT hero characters (called NFT-A) on Ethereum, while releasing NFT accessories that can be assembled on NFT-A on the Avalanche network, such as clothing (called NFT-B), weapons (called NFT-C), ornaments (called NFT-D), etc. If user Mora buys heroes and accessories on two public chains, she can freely combine and assemble without swapping NFTs across two different chains.   2) NFT Portfolio Trading With the combination of cross-chain (or same-chain) NFTs, the proposal allows the combination of integrated NFTs (i.e., NFT Portfolio) to be traded and transferred in “packages” in a combined and convenient manner, which will greatly improve the ease of trading and save on transaction Gas fees.  Example Following the Example in (1) above, when user Mora assembles the NFT integration package (NFT pro) according to his preference and then shelves it on the NFT market, user Bob finds NFT pro very rare and wants to buy it. User Mora can then directly trade NFT pro with user Bob, without the need to split NFT pro and then each NFT group block for separate transactions.   3) Programmable NFT Based on the above-mentioned cross-chain combination and packaged transactions, we will also provide an open NFT free writing interface. Chain Games project parties can customize this protocol according to the actual situation of their own projects.  Example A MOBA chain game project party plans to release different special activity tasks on the two public chains, players can complete the game tasks on the two public chains and obtain NFT rewards, and all the obtained NFT rewards can realize the function of cross-chain combination and packaged trading.   4) Continuous Iteration of NFT We will give NFT further room for creation & improvement. This protocol can allow NFTs to be adjusted and modified by parameter factors as external conditions change. Not only can it be adjusted on the basis of the original parameters, but also new parameter designs can be supplemented for NFT.  Example A MOBA chain game project side has released an unevolved initial NFT hero. Players Mora in the purchase of the NFT hero, and continue to train the NFT hero and let it participate in the competition to quickly upgrade, the NFT hero can be accumulated with the experience value to continue to improve the level of evolution. At this time the NFT hero’s values (such as: force value, defense value, blast rate, etc.) will be increased. In addition, if players Mora want to design their own new NFT hero skin, you can create your own on top of this NFT and define the relevant parameters to achieve personalized customization of the NFT.   Discussion points   ERC is an improved protocol for Ethereum. The realization of cross-chain functions with high probability requires the help of a centralized system. After the user combines and assembles the NFTs on each public chain, if the main NFT-A is upgraded, can the secondary NFT-B, NFT-C, etc. be upgraded together (that is, will the secondary NFT parameters change due to changes in the primary NFT parameters? )  ",
                    "links": [],
                    "GPT-summary": "The post introduces a new NFT protocol that allows for cross-chain combination and trading of NFT assets. The proposal aims to promote interoperability across the blockchain industry and the concept of multi-chain coexistence. The post explains the features of the protocol and provides examples of how it can be used. The post also raises a discussion point about the possibility of upgrading secondary NFTs when the main NFT is upgraded.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Token economics",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.587331201137172
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/abcoathup",
                    "index": "2",
                    "likes": "1",
                    "time": "05/08/2022-23:28:56",
                    "content": "You may want to consider alternative naming such as parent/child; see: Master/slave (technology) - Wikipedia ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/riksucks",
                    "index": "3",
                    "likes": "1",
                    "time": "06/08/2022-12:48:32",
                    "content": "So, from what I understand, some sort of representation is needed in this said protocol, to denote NFTs from multiple chain into one “combination” So I believe that each smart contract in each chain will maintain the same set of combinations and when transfers or upgrades happen, each smart contract from each chain does the necessary upgrade/transfer ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.428571428571428
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SpiderAres",
                    "index": "4",
                    "likes": "0",
                    "time": "07/08/2022-13:33:19",
                    "content": "Great, thx a lot sir  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SpiderAres",
                    "index": "5",
                    "likes": "0",
                    "time": "08/08/2022-14:01:09",
                    "content": "Several problems and supplements to the protocol layer: Q1: Which chain will this cross-chain combined NFT contract be deployed on? An NFT contract always needs to be deployed on a certain chain.  Idea: Can be the chain where the main NFT of this combined NFT was created.   Q2. How can this cross-chain combined NFT transaction be realized?  Idea: Via sidechain/relay technology.   Q3. How to realize cross-chain combination?  Idea: Can be split into 2 protocols:  Protocol 1: Programmable NFT combination protocol of the same chain Protocol 2: NFT protocol for cross-chain combination In this way, each protocol only considers and solves a separate problem. Protocol 1 solves the problem of combinatorial programming between NFTs; Protocol 2 solves the problem of combination of cross-chain NFTs.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.3809523809523805
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "6",
                    "likes": "2",
                    "time": "09/08/2022-10:17:38",
                    "content": "Trying to understand your idea, so you want to build cross-chain protocol layer. So something like OpenSea but support more chains or something like NFT game with cross chain support, maybe like Enjin whom founders co-authored ERC-1155. Maybe peak into NFT projects on different chains and you may find a way how to combine more NFT projects into one and create perfect solution for your ideas  Edit: I think this proposal extends your ideas data-wise Minimalistic on-chain cross-game NFT attributes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SpiderAres",
                    "index": "7",
                    "likes": "0",
                    "time": "16/08/2022-07:54:29",
                    "content": "With the help of community partners, this proposal idea can be solved by ERC-998 combined with cross-chain protocol. Next, our team will focus more on the implementation of the front-end, and realize the ideas into applications, so that everyone can produce NFT collections across different chains, and trade the NFT collections package.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.833333333333334
                }
            ]
        },
        {
            "thread_link": "https://ethereum-magicians.org/t/nft-authentication-protocol/10743",
            "title": "NFT Authentication protocol ",
            "index": 10743,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "nft",
                "authentication"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/ankitshubham97",
                    "index": "1",
                    "likes": "1",
                    "time": "08/09/2022-07:28:04",
                    "content": "GM! I have been working on setting up a NFT-based auth protocol. I aim to make it a standard, just like OAuth 1.0/2.0 but I am not sure how/where to start with. I have written a draft documenting what the protocol is. I have also written an SDK which adheres to the protocol to achieve NFT-based auth. Is this the correct place to seek advice? If yes, could folks guide me how to go about it? Link to protocol whitepaper: Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. SDK link: authnft - npm ",
                    "links": [
                        "https://www.npmjs.com/package/authnft"
                    ],
                    "GPT-summary": "The author of the post is seeking advice on a NFT-based authentication protocol that they have been working on. They have written a draft documenting the protocol and an SDK that adheres to it. The author is asking for guidance on how to proceed and if this is the correct place to seek advice.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.375
                }
            ]
        }
    ],
    "group_index": "27"
}