{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/a-idea-for-identify-contracts-in-the-private-chain/6129",
            "title": "A idea for identify contracts in the private chain ",
            "index": 6129,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/xieyi1393",
                    "index": "1",
                    "likes": "0",
                    "time": "01/05/2021-06:45:38",
                    "content": "When I was using the private chain, I have a idea that we can identify some contracts for special usage. Such as identifying the ENS as “Private ENS”. Then we can use the ENS without special configure it in wallet. But for security,they can only use in the chain which using Proof-of-Authority.And the request should sent by the administrator of the chain. I think we can allocate a pre-build contract.It did’t do anything in EVM but costs some ETH for gas to preventing attack.When we want to send a request to  identify a contract,we can send a transaction which  contains the address of the contract and its name to the pre-build contract.Then all nodes checks the permission of the sender of the transaction.If the check passed,then the node record the name of the contract. What do you think? ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing a way to identify contracts in a private chain for special usage. They suggest allocating a pre-built contract that checks the permission of the sender before recording the name of the contract. The author is asking for feedback on their proposal, and a 3rd party could provide constructive criticism.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.5102040816326525
                }
            ]
        }
    ],
    "group_index": "1327"
}