{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-6596-historical-asset-metadata-json-schema/13090",
            "title": "EIP-6596: Historical Asset Metadata JSON Schema ",
            "index": 13090,
            "category": [
                "EIPs"
            ],
            "tags": [
                "nft"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/dhl",
                    "index": "1",
                    "likes": "0",
                    "time": "28/02/2023-21:09:17",
                    "content": "EIP-6596: Historical Asset Metadata JSON Schema establishes a metadata standard for Historical Asset Tokens (HATs). HATs are tokens that represent a specific historical asset, such as a collectible or a rare item, and provide comprehensive context and provenance needed to establish historical significance and value, with the goal to enhance the discoverability, connectivity, and collectability of historically significant HATs. Based on our experience tokenizing historical artifacts, and we have curated and defined dozens of metadata attributes, captured in the EIP. The proposed attributes had been shared with organizations working in NFTs and preserving historical artifacts such as Aniomca Brands, British Museum and Christie’s. By extending the Metadata JSON Schema defined in ERC-721 and ERC-1155, we aim to create a ubiquitous language on top of widely accepted NFT standards, that would historical NFTs to flow between applications and conversations. ",
                    "links": [],
                    "GPT-summary": "The post introduces EIP-6596, which proposes a metadata standard for Historical Asset Tokens (HATs) to establish historical significance and value. The author explains that the proposed attributes have been shared with organizations working in NFTs and preserving historical artifacts. The proposal aims to create a ubiquitous language on top of widely accepted NFT standards to allow historical NFTs to flow between applications and conversations. The post also mentions that the proposal is based on the author's experience tokenizing historical artifacts.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Smart contract updates",
                        "Interoperability and scalability",
                        "Privacy, security and risk management",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.159722222222223
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/stoicdev0",
                    "index": "2",
                    "likes": "0",
                    "time": "03/03/2023-14:16:14",
                    "content": "This seems highly specific which kind of defeats the purpose of an standard IMO, you’re even making most fields required. Have checked ERC-5773? It allows you to add multiple assets, each with it’s own metadata so you can use it to keep a historical record. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.214285714285714
                }
            ]
        }
    ],
    "group_index": "372"
}