{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/asking-for-a-bit-of-guidance/1591",
            "title": "Asking for a bit of guidance ",
            "index": 1591,
            "category": [
                "Happenings"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/wschwab",
                    "index": "1",
                    "likes": "0",
                    "time": "16/10/2018-06:14:12",
                    "content": "Hello all. I apologize if this has been covered before, but I didn’t find a relevant thread. I’ve been following the Magicians since the creation of the group. I’m interested in governance topics, and have participated online in various conversations around it. When I saw there would be a gathering before Devcon, I jumped on the bandwagon. My main question now, is now what? I see that there are subdivisions by different interestes (the rings), but I’m sort of lost about what to expect, or what I can do/participate in. Should I necessarily be looking for a ring to join? Should I just be showing up and winging it? Thanks! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "2",
                    "likes": "1",
                    "time": "16/10/2018-13:27:18",
                    "content": "No worries, we’re all (mostly) winging it! Coming to the event is a good starter. Participating in the forum is also great. Congratulations, you are a Magician! We will be going over what the Rings mean at the Gathering. It’s still a very fluid process, so it will by no means be “the law”, but it will be good guidance to move forward and Do The Thing™ You can be a member of any amount of rings (including zero!) and still be a “Magician”. It’s more a signaling sub-group related to your interests. Some (like Tokens) may be more technically focused on EIPs than others (like Governance). You can get involved as little or as much as you want. We only ask that you contribute positively towards the goals the groups set. If you are interested in volunteering at the Gathering, we have a recurring call on Wednesdays. I’m not sure where the post is, @boris can give you those details if you wish to join. We’d love to have ya! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3977272727272725
                }
            ]
        }
    ],
    "group_index": "459"
}