{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/soulbound-donations-a-call-to-help-people-that-suffered-from-a-disaster/13008",
            "title": "SoulBound Donations - A Call to help people that suffered from a disaster ",
            "index": 13008,
            "category": [
                "Happenings"
            ],
            "tags": [
                "nft",
                "evm",
                "ethdenver",
                "sbt",
                "ethdenver2023"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/DonMartin3z",
                    "index": "1",
                    "likes": "1",
                    "time": "22/02/2023-08:20:06",
                    "content": "Dear Magicians As you may have seen in the news, the world is deeply chaotic, and while the globe turns its attention to Turkey or Ukraine, bad things are also happening to the people of Brazil > Brazil: flooding and landslides kill dozens in São Paulo state | Brazil | The Guardian My name is Don Martinez, I am an Ethereum developer, currently responsible for research in the area of zero knowledge proofs and the SoulBound token. You can follow all my social media here ( don_martinez.eth | Twitter, Instagram, Facebook | Linktree ) I come to ask for everyone’s help to assist several families affected by the floods and landslides caused by the heavy rains that have hit the state of São Paulo in recent weeks and have been devastating. Many people have lost their homes and belongings, as well as suffering emotional and physical traumas. At this moment, it is crucial that we come together in solidarity with the people affected by this catastrophe. That is why we are asking for your help. Any donation, no matter how small, can make a difference in the life of someone who is going through difficulties at this time. I will conduct a Mint using EIP4973 for non-transferable tokens to register donations in our Ethereum ecosystem in Brazil, and all donor addresses, photos, or any data that they wish to share, can be exposed at our Ethereum Rio 2023 event, next month.  please check > https://www.ethereumbrasil.com/ . I will film the receipt of donations and post the results for all donors who interact on this topic. Donations can be made to these addresses: $BTC : 3EJUusuPEm52GbxpEbDz3ncr6HUV58KgHv $ETH :  0xDCF6104179E1fA730c3f7D1871832CA264fE7305 Some of the organizations that are working in this region include the Brazilian Red Cross, the Archdiocesan Caritas of São Paulo, and the Movement of People Affected by Dams. All these organizations are receiving few donations and still working tirelessly to provide assistance to victims. Donations will be converted and sent to these organizations, generating a receipt that I will share with you. We ask that everyone who can contribute does so to help alleviate the suffering of the people who have been affected by this catastrophe. Together, we can make a difference. We are Ethereum. Thank you in advance for any help you can offer. Sincerely, The entire Ethereum Nordeste team. ",
                    "links": [
                        "https://linktr.ee/don_martinez.eth",
                        "https://www.ethereumbrasil.com/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7061403508771935
                }
            ]
        }
    ],
    "group_index": "359"
}