{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-4834-hierarchical-domains-standard/8388",
            "title": "EIP-4834: Hierarchical Domains Standard ",
            "index": 8388,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "1",
                    "likes": "0",
                    "time": "22/02/2022-16:35:01",
                    "content": " GitHub Issue   github.com/ethereum/EIPs         Add EIP-4834: Hierarchical Domains Standard   ethereum:master ← Pandapip1:patch-1            opened 04:53PM - 22 Feb 22 UTC               Pandapip1             +809 -0       When opening a pull request to submit a new EIP, please use the suggested templa…te: https://github.com/ethereum/EIPs/blob/master/eip-template.md  We have a GitHub bot that automatically merges some PRs. It will merge yours immediately if certain criteria are met:   - The PR edits only existing draft PRs.  - The build passes.  - Your GitHub username or email address is listed in the 'author' header of all affected PRs, inside <triangular brackets>.  - If matching on email address, the email address is the one publicly listed on your GitHub profile.  Link to @eth-bot comment (there were technical difficulties): https://github.com/ethereum/EIPs/pull/4835#issuecomment-1048458202       ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pull/4835",
                        "https://github.com/Pandapip1",
                        "https://github.com/ethereum/EIPs/pull/4835/files",
                        "https://github.com/ethereum/EIPs/pull/4835"
                    ],
                    "GPT-summary": "The post is about a proposal for a new standard called \"Hierarchical Domains Standard\" submitted to the Ethereum Improvement Proposals (EIPs) repository on GitHub. The author provides instructions on how to submit a pull request and mentions a bot that automatically merges some PRs. A third party commented on the proposal, asking questions and providing constructive criticism.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.250463821892394
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SamWilsn",
                    "index": "2",
                    "likes": "0",
                    "time": "14/03/2022-19:15:05",
                    "content": "Would you mind removing the EIP text from this discussion thread? It’s unnecessary pain for you to have to keep it in sync with the PR.  Would it make sense to split the resolver interface from the management interface? I can imagine some use cases that would use a completely different management system but could still benefit from the resolver interface. For example, 4553.some-nft could always resolve to the owner of Some NFT #4553.  In canPointSubdomain, is the point to prevent yourself being added as a subdomain to a parent you don’t want? If so, what’s to stop a malicious parent just skipping this check? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "3",
                    "likes": "0",
                    "time": "14/03/2022-22:04:38",
                    "content": " The EIP text is removed. I guess that’s certainly an option. I might do that. That’s a good question. I once thought of a use-case, but  I can’t remember what it is. You’re absolutely right that a malicious parent can circumvent that – maybe I should replace it with an isValidSubdomain that when returns false reverts the name resolution.  ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SamWilsn",
                    "index": "4",
                    "likes": "0",
                    "time": "14/03/2022-22:32:59",
                    "content": "    Pandapip1:  maybe I should replace it with an isValidSubdomain that when returns false reverts the name resolution   Could maybe have the querier pass in the parent address to getDomain? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 2.999999999999999
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "5",
                    "likes": "0",
                    "time": "15/03/2022-14:56:16",
                    "content": "    SamWilsn:  Could maybe have the querier pass in the parent address to getDomain?   If I were to go that route, I would much prefer it to be in hasDomain. However, I don’t really see any point in canPointSubdomain anymore – I might just remove it. I don’t see any issues with people pointing other peoples’ domains to their own. After all, would the owner of a token care if I set myfavoritetoken.pandapip1.sometld to their token? Even if it was theworldsworsttoken.pandapip1.sometld, I’m not sure the extra complexity in the spec is worth it. I’m just going to remove it, and maybe add it as an optional extension. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.660714285714286
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/xinbenlv",
                    "index": "6",
                    "likes": "0",
                    "time": "16/08/2022-14:28:14",
                    "content": "@Pandapip1  This ERC is going to be greatly useful, kudos! Two pieces of feedback for its last call  Shall we move the “Here is a solidity function that resolves a name:” to the reference implementation instead of spec section? Shall we change all the “must”, “shall” to their upper-case counter part (MUST, SHALL) so to follow RFC 8174: Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words which suggest using uppercase to reduce ambiguity  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "7",
                    "likes": "0",
                    "time": "16/08/2022-19:05:36",
                    "content": "Definitely #2. I also mostly support #1. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/frangio",
                    "index": "8",
                    "likes": "0",
                    "time": "29/09/2022-22:02:54",
                    "content": "I don’t think this EIP has had sufficient discussion around it to become Final (seeing that the Last Call deadline is tomorrow). Although to be frank I am personally not interested in alternatives to ENS at the moment, here are two concerns that I have with this EIP:  What is the root domain? How do I find it? Without it, no resolution is possible. Without a globally accepted root, a name has no meaning. There are no frontrunning mitigations for domain creation.  I’ve seen another alternative to ENS being developed, dmap, which notably does not have an EIP. This is fine and in my opinion a better approach: standardizing before the system is further developed ossifies a version that has not been tested enough. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.621527777777777
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "9",
                    "likes": "0",
                    "time": "03/10/2022-13:25:32",
                    "content": " What is the root domain? How do I find it? Without it, no resolution is possible. Without a globally accepted root, a name has no meaning.  This would be user-provided. The nice thing is that anyone can deploy their own domain and have it work as a root domain. I didn’t notice this wasn’t provided in the EIP, so I will add that.  There are no frontrunning mitigations for domain creation.  Thank you for pointing that out – I hadn’t considered it. Most of the time, this won’t be an issue. Perhaps a commit/reveal scheme could be recommended when it would be useful.  Although to be frank I am personally not interested in alternatives to ENS at the moment  The nice thing about this is that this isn’t necessarily an alternative to ENS. It would be perfectly possible to make a “domain” that resolves ENS domains.  Standardizing before the system is further developed ossifies a version that has not been tested enough  I can be convinced to move this back into review. Do you have any normative suggestions? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.919642857142858
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/frangio",
                    "index": "10",
                    "likes": "0",
                    "time": "05/10/2022-22:13:49",
                    "content": "    Pandapip1:  Do you have any normative suggestions?   Nothing in particular, my point is rather that I think the interface should be tried “in the field” quite a bit before settling on a final specification, because that could surface issues in it. I mean things like starting to build the various applications, tooling, and libraries around it. I don’t know if that has been done in this case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.854166666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "11",
                    "likes": "0",
                    "time": "12/10/2022-11:41:38",
                    "content": "After considering your points I’ve moved it back into review. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1616"
}