{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/market-watchdog-group-for-consumer-protection/558",
            "title": "Market Watchdog Group for Consumer Protection ",
            "index": 558,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Kames",
                    "index": "1",
                    "likes": "1",
                    "time": "17/06/2018-12:24:24",
                    "content": "Background Information: As recently summarized in the latest report from John M. Griffin and Amin Shams of University of Texas at Austin, the cryptocurrency market can be highly influenced by outside forces and bad actors. As many already know in the Ethereum Magician Community, the Tether “stabletoken” shenanigans can be correlated to the current price increase in the Bitcoin, which also has a ripple effect on the Ethereum ecosystem. TL;DR The absurd amounts Tether being minted in late 2017 can be correlated with the recent artificial price increase seen across all cryptocurrencies in the market. Paper: https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3195066 I assume many small/medium investors were negatively impacted by this behaviour. Probably leading to many undesired long-term consequences in the ecosystem i.e. slower real world adoption and investment in the wrong projects and infrastructure. It’s probably fair to say many in the community want to limit price manipulations, illegitimate market making and general bad behaviour in the cryptocurrency (Ethereum) ecosystem, because of the potential negative impact on everyday users. Proposal: I would like to propose over the next 1-2 years a Consumer Watchdog Group, comprised of Engineers and Financial Analysts be organized and funded, to provide unbiased information via conducting cross-chain research regarding potential market manipulations, as to prevent and deincentivize similar situations from occurring again in the future. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9125000000000005
                }
            ]
        }
    ],
    "group_index": "1265"
}