{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/fiat-money-and-coins-you-play-17-th-century-game-in-21-th-century-without-a-true-credit-in-the-ecosystem/5871",
            "title": "Fiat money and coins - you play 17-th century game in 21-th century without a true credit in the ecosystem ",
            "index": 5871,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/gribuser",
                    "index": "1",
                    "likes": "0",
                    "time": "02/04/2021-13:35:07",
                    "content": "I am just keep wondering, how all these claims on the “new financial infrastructure”, “banking replacement”, etс, etc - keep up with the fact that all cryptocurrencies, ETH included, do not possess the key feature of modern finance: emission through the credit? Credit is the primary way modern currencies are created, that’s the instrument that allows the finances to follow the economics, the system creates more money where (and when) the need arises, and sterilizes when (and where) the time for the shrinking comes. While all this coin infrastructure is at best a castrated version of the gold-powered currency systems from the middle ages. That could be just fine for speculations and could even work for some weird investments, like NFT, perfect match. But my oh my, normal banking, rly? Financial infrastructure, for real? None of the current cryptocurrencies, ETH included, are capable of being the basement for any more or less normal economy, breathing credit in and out every second. The payment system that has no flexible credit emission mechanics is simply incapable to perform as a currency, no matter how flexible the “payment” infrastructure is. You can play as a payment infrastructure replacement with stablecoin, no problems, but is that it? Money is credit. The payment is only the (easiest) half of the currency lifecycle. In reality even 400 years back the gold currencies did not work the way ETH works, they had powerful credit instruments too. Yet still that was really close to what we have in crypto now, ok. Half a millennium back. But fixed-base currency in 2021? It’s just a stone hatchet (with a cool frontal digital camera, all right). And the volatility is only a tip of the iceberg of this approach’s failures (because when the system wants to breathe it can’t). The problems will not go away if you wait long enough (as some of you may hope). It’s a design flaw, it’s to be fixed, not waited out. What am I missing here? Does Etherium community realise, that modern finance must have either credit emission or something other, with similar functionality? Or all this “new world” is just yet another speculation playground with real world economy left for other guys? Or do you truly believe that ALL the monetary instruments humanity had invented in the 19/20/21-th century are just crap and you are about to create a new shiny bicycle from the ages-old parts? This does not work, haven’t you noticed yet? You create payment infrastructure, not a financial system. You create VISA concurrent, not a new currency. If Etherium is to become a true foundation of the economy it must have some features to replace credit emission. Then all this story may end up as a currency. ",
                    "links": [],
                    "GPT-summary": "The author questions the ability of cryptocurrencies, including Ethereum, to replace modern finance due to their lack of credit emission. The author argues that credit is the primary way modern currencies are created and that a payment system without flexible credit emission mechanics is incapable of performing as a currency. The author suggests that Ethereum must have features to replace credit emission to become a true foundation of the economy.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Law and regulations",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.527668872008494
                }
            ]
        }
    ],
    "group_index": "1292"
}