{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/ethereum-network-upgrade-process/4932",
            "title": "Ethereum Network Upgrade Process ",
            "index": 4932,
            "category": [
                "Process Improvement"
            ],
            "tags": [
                "eipip",
                "network-upgrade"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/poojaranjan",
                    "index": "1",
                    "likes": "5",
                    "time": "12/11/2020-20:46:25",
                    "content": "After spending a few months collecting feedbacks, questions/concerns, and evaluating the current process of the Ethereum mainnet upgrade, the EIPIP group recommended some changes to improve the Network Upgrade Process. I’ve drafted a blog explaining the new process. This will be shared on the Ethereum Cat Herders Medium to make it more accessible. @MadeofTin and I will be joining the All Core Devs meeting #100 to give a walkthrough (if time permits) and answer any questions. ",
                    "links": [
                        "https://docs.google.com/document/d/12ZLOg0mWH8vzXX_3KbWCoHZHuPOfyZR8dA9BcE5z4nk/edit#",
                        "https://medium.com/ethereum-cat-herders",
                        "https://github.com/ethereum/pm/issues/221"
                    ],
                    "GPT-summary": "The author of the post is explaining the changes recommended by the EIPIP group to improve the Ethereum Network Upgrade Process. The author also mentions that they will be sharing a blog on the new process and joining a meeting to give a walkthrough and answer questions. A 3rd party may ask questions or give constructive criticism, and there is a possibility of collaboration.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.8113636363636365
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ryanschneider",
                    "index": "2",
                    "likes": "2",
                    "time": "19/11/2020-22:25:44",
                    "content": "This looks awesome, thanks @poojaranjan!  I really like that the mainnet block number isn’t set until after the successful fork on the testnets, it makes the mainnet fork less a “fait accompli” and more something everyone can actually feel confident in. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.895833333333333
                }
            ]
        }
    ],
    "group_index": "1184"
}