{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/social-scalability-and-wealth-distribution-session/743",
            "title": "Social Scalability and Wealth Distribution Session ",
            "index": 743,
            "category": [
                "Happenings",
                "Council Sessions"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/aogunwole",
                    "index": "1",
                    "likes": "2",
                    "time": "16/07/2018-00:56:32",
                    "content": "My half bake notes from the session: Moderator: Lane Social Scalability: These are people problems Wealth Distribution - GINI Coefficient of Ethereum is worse than North Korea What are measures of success to improve social scalability? Bring more ideas/use cases of the technology when different types of people are included in the community. Need to think about DAOs paying social taxes for supportive adoption Stages of Financial Capital Management Stage 1: Using money/capital to use individually satisfying basic needs - Strive for everyone to reach this level of attainment Does this come down to fiscal policy - how can this happen on chain (with logic) vs. how this can be addressed off chain/IRL? Stage 2: Using capital as a an influence, what do we want to influence? Tim mentioned should the adoption focus on access to identity and banking (need for a greater portion of the world to be included in current social systems such as refugees) Adapt and build alongside with local currencies, bundle with currencies for stability. MP introduced lobbying a necessary tool - introducing a technology into a broken system will be stifled by the local (broken) system. How do you build bridges with governments on common areas that governments do not want to see (riots, war, famine, etc.) instead of killing ties with local governments Zack mentioned Ethereum will develop much like bitcoin - for the people by the people.   Will citizens see the rules that they build on the blockchain supercede the local laws of government?   Create more digital identities with government - digital identifications   Need funding to support this adoption Recreate alipay and Wechat by paying by app   Need to balance the influence of financial capital and human capital for distributed governance model. We keep moving closer to financial capital Hierarchical networks are more efficient but become leverage of power and less assumed by human capital Influence networks causes the reallocation of capital but cannot coerce those (use power) to make that capital reallocation. Identity systems cannot be nested in national systems - a flaw that will oppose these issues between current hierarchical structures Process Discussion EIP 0 initiative - more for philosophical discussions (and the rest of these discussions) Is identity a necessary process for voting How do we get ETH into the hands of more people. EWasm - Ethereum Web Assembly protocol, to replace EVM Web assembly is designed to run a node in a browser can you run a node in a browser to mine enough ETH to support Should we start an EIP bounty system, decentralized for withdrawing funds, another for supporting projects Scalability governance example: Ethereum Classic moves some ETH  into a treasury for use to support new projects Proposal: A taxation method for proof of stake Boris shared how do we find service providers that will accept (create a token curated registry) ETH natively by geography? Scalability governance example: Zcash foundation proposals (research) - direct awards to a pool to fund another pool (create inflation) or taxation How do you combat large holders of ETH who would not want to pay these taxations. Financially you are incentivised to ICO or hold currency or something less useful vs. staying and working on the protocol. How do you align these two systems - aligning financial value for you and reputational value (working on the protocol) - to contribute to the growing of Ethereum. Where do investors fit into this discussion - how do you incentive them? Moving to proof of stake, do you create a distributed governed bounty system? Also, do you change the reward system for larger investors/ETH owners to get lower rewards than smaller projects (less influence for whales). ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.359113623002512
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mariapaulafn",
                    "index": "2",
                    "likes": "3",
                    "time": "16/07/2018-07:47:06",
                    "content": "Notes, again in dialogue form. Please contribute as i was not able to type all the stuff I wanted! https://docs.google.com/document/d/1JuohpdpkwnmBqATsc4RBVXbaM35X8LUhz0yhMENe3Ag/edit?usp=sharing ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/GriffGreen",
                    "index": "3",
                    "likes": "3",
                    "time": "16/07/2018-16:40:10",
                    "content": "Great Discussion! I would love to see Giveth become a foundation for the DAO that might one day receive a small % of the mining rewards. We will see if we can get DAOs on Ethereum (specifically Aragon style DAOs) integrated into the platform and practice with some of the grant orgs first and then we can see if it works well… then maybe the Proof of Stake validator nodes can vote to allocate the resources to various projects. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/yalu",
                    "index": "4",
                    "likes": "1",
                    "time": "18/07/2018-19:24:28",
                    "content": "I would love to help complete it. Where’s the recording? or there isn’t? I watched the session live and enjoyed it very much but didn’t take notes. Lady with Nigerian background made some great points iirc as well as the rest of the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.913636363636364
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mariapaulafn",
                    "index": "5",
                    "likes": "1",
                    "time": "19/07/2018-09:21:07",
                    "content": "Lovely to see you here! Will find you the video as soon as I have time, thank you for joining! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.90625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mariapaulafn",
                    "index": "6",
                    "likes": "1",
                    "time": "23/07/2018-20:38:16",
                    "content": "See here Feedback & help wanted: Council of Berlin - raw video, Viewly descriptions and titles, still photos, licensing to find the video of this session and feel free to complement notes <3 Nigerian Lady is miss @aogunwole ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.948717948717949
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "7",
                    "likes": "1",
                    "time": "23/07/2018-21:32:59",
                    "content": "Thanks MP - direct link to list of videos on Viewly channel https://view.ly/c/2e49c34e9de9bfa2 Just paste the link of the video and then I can label it appropriately. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/yalu",
                    "index": "8",
                    "likes": "0",
                    "time": "24/07/2018-03:13:51",
                    "content": "wonderful! I will start transcribing the video right away. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.214285714285714
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "9",
                    "likes": "1",
                    "time": "25/07/2018-09:14:32",
                    "content": "This is the video for this session:    view.ly    Social Scalability and Wealth Distribution  - FEM Council of Berlin - Day One Hosted by Lane. Forum thread here: https://ethereum-magicians.org/t/social-scalability-and-wealth-distribution-session/743 Thank you to for sponsoring the video crew & streaming      ",
                    "links": [
                        "https://view.ly/v/MOc2hze3iIyQ"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                }
            ]
        }
    ],
    "group_index": "1501"
}