{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/vlad-zamfirs-dilemma-autonomous-software-vs-crypto-law/2538",
            "title": "Vlad Zamfir's Dilemma: Autonomous Software vs. Crypto Law ",
            "index": 2538,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "1",
                    "likes": "1",
                    "time": "29/01/2019-00:24:38",
                    "content": "Vlad Zamfir has started a new discussion about Crypto Law as opposite to “autonomous software” and  “wiling to die on that hill”. Despite of that fact that Vlad is well known troll and uses too much ad hominem argumentation (for my taste), the topic he started is important. Vlad’s central message is: \"Our shared reality that we need fully autonomous software to escape state control is insecure and aggressive And it 100% isn’t true\" and should be replaced by Crypto Law (whatever he means by that). Otherwise crypto will become illegal. I disagree with Vlad, because …   On sovereign Crypto Law  Any off-chain law needs a law enforcement officers. Law enforcement officers will need a sovereign space where they can operate. Otherwise they will enforce third party’s law (the legacy state law). Sovereign territory and sovereign law need to be defended. Declaration of sovereign Crypto Law means Declaration of Independence. This (if taken seriously) will provoke the state powers and lead to war (or some kind of). Neither I see any reason to provoke a war against state’s legal systems (it is just unnecessary - now we can still work perfectly legal), nor I see how Crypto can win it. May be Vlad is “willing to die on this hill” - I am not. Any radicalization of Crypto will make the space evil because majority becomes smaller but radicalized. 1-5: Declaration of Sovereign Crypto Law will create more damage. Nevertheless it makes sense to talk about rules we a trying to follow.    On autonomous software execution  I agree with Vlad, that autonomous (and anonymous) software execution can’t shield actors in crypto space fully. Nevertheless it shields us enough to make a political process more feasible than blind law enforcement. If we give up our shields, the will be no need for political process at all.    Synthesis: Autonomous software meets Crypto Law  Modern society is a construct of “checks and balances” of different kinds of power. An institution can only sustain as one of these “checks and balances” if it is strong enough to resist a pressure of other institutions, but at the same time flexible enough to cooperate with them. Crypto should try to become a new institution among existing “checks and balances”. It will be only possible if it keeps both its \"automation and anonymity\" for sustainability and creates a new “Crypto Law” interface for cooperation with other institutions. It is only the way how it can keep self-sovereign features in long term, like anonymity, self-sovereign money and settlement. Otherwise either Crypto will lose its “crypto” or it will become illegal.    Any thoughts? ",
                    "links": [],
                    "GPT-summary": "The post discusses the concept of \"Crypto Law\" as an alternative to fully autonomous software in the crypto space. The author of the post disagrees with the idea of declaring sovereign Crypto Law, as it may provoke state powers and lead to war. However, the author agrees that autonomous software execution can shield actors in the crypto space to some extent. The post suggests that Crypto should become a new institution among existing \"checks and balances\" by keeping both its automation and anonymity while creating a new \"Crypto Law\" interface for cooperation with other institutions.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.370553359683794
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "2",
                    "likes": "0",
                    "time": "29/01/2019-20:01:36",
                    "content": "X-Posting this to the Etherians Forum:    Etherean.org – 29 Jan 19    Vlad Zamfir’s Dilemma: Autonomous Software vs. Crypto Law - X-Post from FEM The following topic was posted by ethernian on FEM, I am copying it below.  https://ethereum-magicians.org/t/vlad-zamfirs-dilemma-autonomous-software-vs-crypto-law/2538/1   Vlad Zamfir has started a new discussion about Crypto Law as opposite to...      ",
                    "links": [
                        "https://forum.etherean.org/t/vlad-zamfir-s-dilemma-autonomous-software-vs-crypto-law-x-post-from-fem/217"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.670454545454545
                }
            ]
        }
    ],
    "group_index": "664"
}