{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/sharing-common-data-between-solidity-smart-contracts/4574",
            "title": "Sharing Common Data between Solidity Smart Contracts ",
            "index": 4574,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Jules",
                    "index": "1",
                    "likes": "1",
                    "time": "04/09/2020-12:59:03",
                    "content": "I’m aiming to create an Informational EIP about Sharing Common Data between Solidity Smart Contracts. It’s similar to the Diamond Storage part of the Diamond Standard (EIP-2535). I would like to check whether that will adversely affect anything that anyone else is working on. Any comments gratefully received. ",
                    "links": [],
                    "GPT-summary": "The author is proposing an EIP about sharing common data between Solidity Smart Contracts, similar to the Diamond Storage part of the Diamond Standard. The author is asking for feedback and comments on the proposal, to ensure it does not adversely affect anyone else's work.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.857142857142857
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "2",
                    "likes": "0",
                    "time": "04/09/2020-21:11:57",
                    "content": "It is great to have more Informational EIPs coming in! This thread would be a good place to start collecting needs and impacts, and explore the general idea (this is why I labeled it primordial soup for now). Definitely expand on the basic idea here, and when you’re close to writing up an EIP more formally you can create a new thread within the category EIPs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.7571022727272725
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Jules",
                    "index": "3",
                    "likes": "1",
                    "time": "05/09/2020-08:47:25",
                    "content": "I am working on a Medium article about Smart Contracts Sharing Common Data. Here is an illustration from that article, for a hypothetical example multi-contract solution, with a Router contract, a Producer contract and a Consumer contract: 800×450 65.2 KB The Router must contain the data for all smart contracts. The subordinate contract functions are invoked by Router using delegateCall. Each data struct is located in the Router contract, but is located at a random slot along these lines: contract QueueDataLocation {     function queueData() internal pure returns (QueueData storage qds) {         uint location = uint(keccak256(\"queue.data.location\"));         assembly { qds.slot := location }     } }  This contract may be used as a base contract by all the contracts which need to access the data. In the example, that is the Producer and the Consumer. I think that this pattern for sharing common data will be very useful for many multi-contract types. That certainly includes EIP-2535: Diamond Standard which specifies this way of sharing data amongst the facets of a Diamond. But I think that this technique is more general than that and deserves its own EIP. Any comments gratefully received. ",
                    "links": [
                        "https://eips.ethereum.org/EIPS/eip-2535"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.332380952380953
                }
            ]
        }
    ],
    "group_index": "1135"
}