{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/council-of-osaka-date-and-place-look-for-ethereum-roadmap-2020/3367",
            "title": "Council of Osaka Date and place? - Look for \"Ethereum Roadmap 2020\" ",
            "index": 3367,
            "category": [
                "Happenings",
                "Council Sessions"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Amxx",
                    "index": "1",
                    "likes": "2",
                    "time": "10/06/2019-09:06:42",
                    "content": "Hello, My understanding is that the next council of the Ethereum Magicians should be held in Osaka close to Devcon V. I, unfortunately, missed the council of Prague due to timing incompatibility and I think the risk is even greater for Osaka. Travelling to Japan is really expensive, both for transportation and accommodation. We are starting to book hotels and flights, and I’m sure we are not the only one. It would be a shame if potential participants realize afterwards that their travel dates don’t allow them to attend this fall’s council. So my question is, has the organisation started? If not what is the process to initiate that? Finding a venue is important but I believe deciding on a date even more so. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3522727272727275
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "2",
                    "likes": "0",
                    "time": "10/06/2019-15:31:13",
                    "content": "Agreed. It seems like the Monday (Oct. 7th) would be sensible, given that the rest of the conference is from Tues-Fri. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "3",
                    "likes": "4",
                    "time": "13/06/2019-23:36:35",
                    "content": "Monday makes sense. We may also be able to work with the organizers of Devcon itself to make use of space there. Is there anyone here in Osaka or nearby cities? Count me in to help with the early planning. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/nrryuya",
                    "index": "4",
                    "likes": "2",
                    "time": "19/06/2019-13:54:04",
                    "content": "Hi, I live in Tokyo and of course I have been to Osaka a few times. Tell me if I can help you with something. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.840909090909091
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/moontysal",
                    "index": "5",
                    "likes": "2",
                    "time": "20/06/2019-01:17:15",
                    "content": "Hi, I live in Tokyo, and I previously worked in Kyoto and Osaka for 6 month, so I can help you with finding the venues or anything. please ask me anything. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.924242424242424
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "6",
                    "likes": "0",
                    "time": "21/06/2019-05:50:31",
                    "content": "Thank you @nrryuya and @moontysal, as we get the team together we will reach out to you! One issue we need insight on is how to rent a venue / set of rooms in a building which will fit our needs. This space may not be available near the Devcon5 location around the Osaka Prefectural Government Sakishima Building (formerly the WTC Cosmos Tower). We will probably need to look in areas closer to central Osaka. We have lots of groups who will need a work room with white boards to write on (if possible), plus a larger room for meetings with more participants. Let me know here if you have any ideas or know of cases where technical standards were worked on in a setting like that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/moontysal",
                    "index": "7",
                    "likes": "2",
                    "time": "25/06/2019-07:14:00",
                    "content": "hi sorry for making a quick reply.  We will probably need to look in areas closer to central Osaka.  in this case, some co-working spaces or event venues are around Umeda station or Kitahama station (central Osaka) and I can contact some companies who have event venue in Osaka (with good internet connection & whiteboard & workspace) could I ask you to tell me how many people we would expect to come? (it would be helpful for finding some candidates of venues)  We have lots of groups who will need a work room with white boards to write on (if possible), plus a larger room for meetings with more participants.  and for this points, will you need several venues you will have several events? or just need a venue for one day? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.638888888888889
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/manhuichi",
                    "index": "8",
                    "likes": "0",
                    "time": "01/07/2019-11:26:29",
                    "content": "Hey, are you on Telegram? Would love to chat to you  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "9",
                    "likes": "1",
                    "time": "29/07/2019-19:40:40",
                    "content": "The Magicians will need a venue for one solid day, this is for the Council and certain larger sessions. The day before Devcon may be ideal for this. Devcon and related meetups / parties will take up everyone’s time once it gets started. However, perhaps we could create some sort of smaller-sized salon for conducting EIP and community business near Cosmosquare, or where outer Osaka neighborhoods start along the subway line. Devcon itself may provide this, but we should be ready to do it ourselves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0102040816326525
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "10",
                    "likes": "0",
                    "time": "30/07/2019-22:01:00",
                    "content": "    jpitts:  However, perhaps we could create some sort of smaller-sized salon for conducting EIP and community business near Cosmosquare, or where outer Osaka neighborhoods start along the subway line.   Would this be separate from the one-day event? IMO we should aim to have as little overlap between the Magicians / EIP / Community stuff and “regular programing”. FWIW, last year’s devcon had meting rooms. Do we know if this year will also have some? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.890625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "11",
                    "likes": "0",
                    "time": "31/07/2019-07:25:21",
                    "content": "I am not sure yet, it depends on what opportunities for space the Council of Osaka planners manage find. Also, I don’t have info about the availability of rooms at the Devcon event itself, but having individual areas is really important for the Rings. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/JosefJ",
                    "index": "12",
                    "likes": "2",
                    "time": "01/08/2019-15:13:06",
                    "content": "Hi, if there is a clear outline of the content and base of participants (which I’m sure there will be) there is potential to host the council on the Day 0 of Devcon inside of the venue (having one of the rooms dedicated to that). Please let me know if that makes sense - so it can be accounted for. I think there was a similar consideration happening last year, where Status offered the venue (which did allow for people without Devcon badge to attend). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "13",
                    "likes": "1",
                    "time": "01/08/2019-18:56:53",
                    "content": "If the schedule/content is the limiting factor, I’m happy to help there. A few things I can think of are:  Whatever comes out of the Berlin Blockchain Week Core Devs / 1.x initiatives EEA  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wildmolasses",
                    "index": "14",
                    "likes": "0",
                    "time": "02/08/2019-02:34:26",
                    "content": "FYI, if more help is needed, my friend Mayato Hattori suggested we fill out this form. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "15",
                    "likes": "2",
                    "time": "03/08/2019-17:10:23",
                    "content": "@JosefJ this would be wonderful to be hosted at the main venue on Day 0! @anett and I will organize a registration / call for topics and estimate how many can participate on that day. I am fairly certain that there will be considerable enthusiasm for this, and the discussions would likely last several hours. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.264136904761904
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/JosefJ",
                    "index": "16",
                    "likes": "1",
                    "time": "20/08/2019-16:28:45",
                    "content": "    jpitts:  I will organize a registration / call for topics and estimate how many can participate on that day. I am fairly certain that there will be considerable enthusiasm for this, and the discussions would likely last several hours.   Hi, It would be great to write down a proposal, so we can run it through programming (to make sure the space is kept available & registrations are aware of Magicians sneaking in for the day zero). @Jamie is that something you’ll take a lead on? (Or perhaps @timbeiko or @anett) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.185786435786436
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "17",
                    "likes": "3",
                    "time": "21/08/2019-06:25:25",
                    "content": "I can bring this up on the next Cat Herders call this week to see if anyone wants to take it on. I don’t think I have the bandwidth to do it, but someone else might. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "18",
                    "likes": "1",
                    "time": "23/08/2019-10:20:37",
                    "content": "@JosefJ, let’s assume myself and @anett for now. At some point there will be a person specifically responsible for this day at the Devcon venue, but we can look after it initially. We are meeting about this today, perhaps we can connect if you have time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "19",
                    "likes": "0",
                    "time": "26/08/2019-13:34:03",
                    "content": "Hey @Amxx @timbeiko and others who’s willing to go to Osaka. We (me x @wildmolasses) are looking for a space for Magicians where we could accommodate all Magicians together and make it more affordable and have a meeting space over there so Magicians can have ring meetings. We will (most likely) have Council on day 0 - Oct 7 and we should have Magicians tickets for day 0 for Council. Who’s would like to join this plan?  Recommend for people who doesn’t have accommodation in Osaka yet but open to everybody!  We just need to know if we should look for something for approximately 20 people or more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.964285714285714
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Amxx",
                    "index": "20",
                    "likes": "1",
                    "time": "26/08/2019-13:54:52",
                    "content": "Thanks again @anett for your dedication to this community. I will be in Osaka and I would love to be part of some rings. I have so much to discuss! I’m really sad that Oct 7 is also the date of the planned ENS workshop. Maybe we could merge the 2 events (just like Berlin’s concil was at the meta cartel demo day) ??? @makoto would you be open to the idea ? I’m don’t feel comfortable helping with the fininding a place/reserving, but if I can help doing some polls to see who would attend, what topic they want to discuss I could do that. For tickets we could use NFTs like what the metacartel did, maybe POAP could be used for that (POAP crowdsale → must have the token on the POAP app to enter the event) ??? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "21",
                    "likes": "0",
                    "time": "26/08/2019-15:12:19",
                    "content": "For sure  no prob  Also I’d like to start organise things more intensively. I saw you guys that you would like to help with organising : @wildmolasses @manhuichi @moontysal @nrryyuya @Amxx What about connecting together via Telegram Group and have a call by the end of this week / begging of next week ?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/makoto",
                    "index": "22",
                    "likes": "0",
                    "time": "26/08/2019-19:13:06",
                    "content": "@Amxx  thanks for joining our ENS mini ring in Berlin !     Amxx:  @makoto would you be open to the idea ? I’m don’t feel comfortable helping with the fininding a place/reserving, but if I can help doing some polls to see who would attend, what topic they want to discuss I could do that.   I already booked a room for ENS workshop very close from the venue (maybe 5~10 min walk) but can suggest the venue change to our team if  we can have a room for the whole day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.05
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "23",
                    "likes": "1",
                    "time": "27/08/2019-17:31:26",
                    "content": "Are people willing to have a Council on day 0 of Devcon5 or around Devcon5? ( ie before or after Devcon5) I’m more than happy to help organise Council but people need to attend  We have big plans for it, there are so many ways how to do it but we just need people to attend and discuss about EIPs ProgPoW and other big topics. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Amxx",
                    "index": "24",
                    "likes": "1",
                    "time": "29/08/2019-08:25:15",
                    "content": "After Oct 7 was spontaneously proposed I made trips arrangement to make sure I’d be in Osaka on that day … which was the whole point of this thread. If there is a good reason to change the date I will not fight it. Still, I’m convinced the best thing to do would be to find a venue large enough to host both the council and the ENS workshop on October 7. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.295918367346939
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "25",
                    "likes": "0",
                    "time": "29/08/2019-17:00:28",
                    "content": "We are planning to have Council on Oct 7th  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/makoto",
                    "index": "26",
                    "likes": "0",
                    "time": "04/09/2019-11:31:09",
                    "content": "Hi, @Amxx I am currently leaning towards sticking to our own venue just to avoid uncertainty.   Many orgs want to have their meetings at Devcon venue and I am afraid the scenario that they run out of space after we decide to ditch the space we already booked a month ahead. Also I am afraid that the Devcon venue will be noisy as they are prepping for the event. Having said that, our venue is right next to the Devcon venue so you could participate part of it (probably 10 min walk if you don’t get lost). We are currently planning to have unconf style just like Magicians, but if you can coordinate with other ENS workshop participants to propose a certain topic (I assume you want to talk about inter wallet standard such as ENS login), then I can propose ENS team to secure the discussion time of the specific topic at pre-determined time. (NOTE this proposal depends on our venue capacity. If we are over capacity, we prioritise people who can commit to our event for the whole day). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "27",
                    "likes": "1",
                    "time": "04/09/2019-12:09:34",
                    "content": "Hi @Amxx @timbeiko @makoto @moontysal @nrryuya @jpitts and @everyone who’s willing to help. I would like to get things moving and host a call probably this Friday or in the beginning of next week - probably Tuesday may fit the best. Please sign up for the call to HackMD    HackMD    Devcon Magicians Coordinations call - HackMD # Devcon Magicians Coordinations call Date & time : suggested date - Tuesday Sept 10th 7pm UTC+2  Ch       There’s agenda included, I will post Hangouts link for a call soon to this HackMD doc ",
                    "links": [
                        "https://hackmd.io/@Bnkhqf0tSbi1lX2Xc-WXYQ/ryPEQXaSS"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "28",
                    "likes": "0",
                    "time": "10/09/2019-11:47:25",
                    "content": "Coordination call for Magicians activities during Devcon in 5 hours  Hangouts link Agenda & participants -  HackMD ",
                    "links": [
                        "https://hackmd.io/@Bnkhqf0tSbi1lX2Xc-WXYQ/ryPEQXaSS"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "29",
                    "likes": "0",
                    "time": "11/09/2019-13:34:59",
                    "content": "Notes from yesterday’s call - HackMD Feel free to add more notes if you guys have any @Amxx @timbeiko @jpitts @dominic Thanks again for a great call guys  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "30",
                    "likes": "0",
                    "time": "20/09/2019-14:10:28",
                    "content": "Ok, so a date and place is emerging! Date:  Tuesday October 8th, 2019, from 9am-5pm Location:  “Where most of us will probably be on Day 1 of Devcon 5” Major Themes:  Ethereum in the Enterprise, Ethereum 1, Ethereum 2 The community has use of a large space at (or near) Devcon itself. I still can’t fully specify, LOL. With this space, we can facilitate some very interesting discussions about the protocol and development roadmaps. Note that we cannot call it a Council if it is at an event with a high ticket price, but we can still organize something great. We will need help to physically prepare the space and coordinate with the Devcon team, and of course the venue management. We need to be able to communicate what we need for facilitating discussions. This is where @nrryuya, @moontysal, and @wildmolasses can really help us. This is a layout I would like to have, but we may need to settle for something more conventional.  image.png1376×936 34.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.774617346938776
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "31",
                    "likes": "0",
                    "time": "24/09/2019-13:14:34",
                    "content": "We put up a schedule for Devcon Community Room, please share your thoughts, what would be cool to present from 9am till 10pm.  image1066×510 22.9 KB  I’m open to host another call for people who would like to present or fill out the time in a meaningful way. Share your thoughts  ",
                    "links": [
                        "https://ethereum-magicians.org/uploads/default/original/2X/2/27376b0cbd5de03494ac34cfc24003dc5c4591aa.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "32",
                    "likes": "0",
                    "time": "27/09/2019-06:42:08",
                    "content": "The organizers of Devcon5 have posted the Agenda, and the Magicians will gather at Devcon!  Check it out: https://devcon.org/agenda. The sessions we are organizing are on Day 1, labeled with “Ethereum Roadmap 2020”. Magicians will organize open, facilitated discussions with stakeholders in the community. Later in the day, we will break up into working groups. Here is the schedule:            9:00am Hello and Welcome    10:00am Enterprise Ethereum    11:30am Open Mic    1:00pm Eth1 and Eth1.x    2:00pm Eth1-Eth2 Transition    2:45pm Eth2    3:30pm Working Groups     Please begin thinking about what topics you may want to bring up! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ],
    "group_index": "860"
}