{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/erc-1900-decentralized-type-system-for-evm/3408",
            "title": "ERC-1900 Decentralized Type System for EVM ",
            "index": 3408,
            "category": [
                "EIPs"
            ],
            "tags": [
                "interop",
                "erc-1900",
                "data-types"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "0",
                    "time": "25/06/2019-22:41:22",
                    "content": "ERC-1900 proposes a decentralized Type System for Ethereum, an on-chain type registry, and using these resources in order to separate definitions & rules from data in smart contracts.    Medium – 16 Apr 19    dType — Decentralized Type System & Functional Programming on Ethereum -... In my previous article, A Vision of a System Registry for The World Computer, I talked about the vision behind dType, a Decentralized Type… Reading time: 6 min read        Aside from the type libraries and storage contracts, developers can create  contracts or libraries with pure functions , that know how to interact with the chosen types. We are separating business logic from the state. And this is the first step to a general functional programming system on Ethereum. If you register these pure functions in the  dType Registry  and tell the Registry what type of inputs and outputs the function has, you can start doing some awesome things. You can have automation in the system.  And the implications are big considering possible future inter-op with the proposed Libra network, and finding commonality with Libra’s smart contracts (known as “Move Modules”).    Medium – 25 Jun 19    Ethereum, Libra and a Unified Type System - Loredana Cirstea - Medium Libra, with its new language Move, was recently announced and some of its features are interesting. Here, we will only be covering those… Reading time: 8 min read       ",
                    "links": [
                        "https://medium.com/@loredana.cirstea/dtype-decentralized-type-system-functional-programming-on-ethereum-4f7666377c9f",
                        "https://medium.com/@loredana.cirstea/dtype-decentralized-type-system-functional-programming-on-ethereum-4f7666377c9f",
                        "https://medium.com/@loredana.cirstea/ethereum-libra-and-a-unified-type-system-7cafa6ea0bc0",
                        "https://medium.com/@loredana.cirstea/ethereum-libra-and-a-unified-type-system-7cafa6ea0bc0"
                    ],
                    "GPT-summary": "The post explains the ERC-1900 proposal, which proposes a decentralized Type System for Ethereum, an on-chain type registry, and using these resources in order to separate definitions & rules from data in smart contracts. The author also discusses the implications of the proposal for future inter-op with the proposed Libra network. A 3rd party gives constructive criticism of the proposal and extends to it, while also asking questions about it.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Token economics",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.695887445887447
                }
            ]
        }
    ],
    "group_index": "866"
}