{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-689-address-collision-of-contract-address-causes-exceptional-halt/3542",
            "title": "EIP-689: Address Collision of Contract Address Causes Exceptional Halt ",
            "index": 3542,
            "category": [
                "EIPs",
                "Core EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/axic",
                    "index": "1",
                    "likes": "0",
                    "time": "11/08/2019-16:09:28",
                    "content": "Discussion topic for:   Ethereum Improvement Proposals   Address Collision of Contract Address Causes Exceptional Halt Ethereum Improvement Proposals (EIPs) describe standards for the Ethereum platform, including core protocol specifications, client APIs, and contract standards.       This was also proposed as EIP-684 and EIP-83. (Some comments were left on the PR: https://github.com/ethereum/EIPs/pull/689) ",
                    "links": [
                        "http://eips.ethereum.org/EIPS/eip-689",
                        "https://github.com/ethereum/EIPs/issues/684",
                        "https://github.com/ethereum/EIPs/issues/83",
                        "https://github.com/ethereum/EIPs/pull/689"
                    ],
                    "GPT-summary": "The post is a discussion topic for Ethereum Improvement Proposals (EIPs) regarding the Address Collision of Contract Address Causes Exceptional Halt. The author is seeking feedback and explaining the proposal, while third parties are auditing, reviewing, and asking questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "None",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 7.222222222222222
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/axic",
                    "index": "2",
                    "likes": "0",
                    "time": "11/08/2019-16:13:41",
                    "content": "This has been discussed started ACD#60. On ACD#61  Martin : No. Long time ago we decide on 684 and 689 are roughly the same thing.  On ACD#62  Status : Completed. Exists in Clients and is in tests as it has already been accepted but is not in the yellow paper. No one available to write it into the Yellow Paper.  @holiman I think you also mentioned this was done because of EIP-86, but EIP-86 is not part of any hard fork. Can you clarify what version of this EIP is implemented and can we mark the EIP final once everything is clarified? Started to add some clarifications in this PR: https://github.com/ethereum/EIPs/pull/2238 ",
                    "links": [
                        "https://github.com/ethereum/pm/blob/master/All%20Core%20Devs%20Meetings/Meeting%2062.md",
                        "https://github.com/ethereum/EIPs/pull/2238"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.020833333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/holiman",
                    "index": "3",
                    "likes": "0",
                    "time": "12/08/2019-08:01:04",
                    "content": "    axic:  Can you clarify what version of this EIP is implemented and can we mark the EIP final once everything is clarified?   See https://eips.ethereum.org/EIPS/eip-1014 , under “Clarifications”:  The init_code is the code that, when executed, produces the runtime bytecode that will be placed into the state, and which typically is used by high level languages to implement a ‘constructor’. This EIP makes collisions possible. The behaviour at collisions is specified by EIP 684:  If a contract creation is attempted, due to either a creation transaction or the CREATE (or future CREATE2) opcode, and the destination address already has either nonzero nonce, or nonempty code, then the creation throws immediately, with exactly the same behavior as would arise if the first byte in the init code were an invalid opcode. This applies retroactively starting from genesis.   So, we decided on a call to consider #684 retroactively adopted, and code was added to clients and tests. What prompted this (EIP-684) was that we were contempling EIp-86, and needed to define how to handle collisions. However, #86 was never actually implemented, for various reasons. So #684 was not really needed (but still accepted), until eventually the next version of EIP-86, the EIP-1014 was implemented. Therefore, to make things clearer, I made sure to include the “Clarificatios” into 1014, so that the behaviour would be well defined, even if people had forgotten about EIP-684. I’m not sure where all the confusion comes from, or how we could/should improve it. ",
                    "links": [
                        "https://github.com/ethereum/EIPs/issues/684"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.161979166666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/axic",
                    "index": "4",
                    "likes": "0",
                    "time": "12/08/2019-08:39:34",
                    "content": "This clarifies it a lot. I think where confusion stems from is that a lot of these “EIPs” are not actual EIPs, just issues on the repo. Seemingly 689 and 684 are identical. I think the best solution going forward would be either:  Creating a “real EIP” out of 684 and marking it final and marking 689 as “abandoned”. Updating 689 to match reality completely (e.g. removing references to 86) and marking it final.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/holiman",
                    "index": "5",
                    "likes": "0",
                    "time": "12/08/2019-09:16:53",
                    "content": "In that case, I’d go with option 1, since that’s the one we did agree on at a call long ago. Also, back in those times the format of EIPs weren’t well-defined, and a lot of old EIPs are issues rather than md-files. So lifting it into proper form seems the right approach. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.335714285714285
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/axic",
                    "index": "6",
                    "likes": "0",
                    "time": "28/08/2020-23:48:11",
                    "content": "I think option 1 sounds good. Someone just needs to do – apparently we haven’t progressed for a year  Also two relevant issues/PRs:  [Missing] EIP-684 · Issue #2220 · ethereum/EIPs · GitHub Add EIP-684 to Byzantium Meta by soc1c · Pull Request #2252 · ethereum/EIPs · GitHub  ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pull/2252"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2
                }
            ]
        }
    ],
    "group_index": "896"
}