{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-xxx-transient-programs-using-no-destination-transactions/3328",
            "title": "EIP-XXX: Transient programs using no-destination transactions ",
            "index": 3328,
            "category": [
                "EIPs"
            ],
            "tags": [
                "draft",
                "evm",
                "transient-program",
                "eip",
                "eoa"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/veox",
                    "index": "1",
                    "likes": "0",
                    "time": "29/05/2019-10:26:28",
                    "content": "This is a draft of a draft; bear with me.   Gist No-destination transactions (with to=='') to have:   ADDRESS of the EOA (same as from field); no extra gas use.  Compare to current:   ADDRESS nonced - different on every execution; 32000 gas paid (G_txcreate), with justification in YP: “Paid by all contract-creating transactions after the Homestead transition.”   Why this change?  Allows “chaining” multiple transactions into one, with a bit of EVM bytecode as glue.  No-destination does not equate contract-creating: see “transient programs” post and lll-multisend program linked therein.   Why this post? Soliciting critique on why this is a bad idea. I’m partial and blind to the obvious flaw(s).  Provenance Publicly mentioned as OT here. Privately for a year or so. Been thinking this is how it’s going to work since PoC3.  ",
                    "links": [
                        "https://ethereum-magicians.org/t/brainstorming-the-token-standard-in-eth2/3135/7"
                    ],
                    "GPT-summary": "The author is proposing a change to the Ethereum Improvement Proposal (EIP) that would allow for \"transient programs\" using no-destination transactions. The author is seeking feedback on the proposal and explaining the reasoning behind it. The post also mentions that the proposal has been privately considered for some time and is now being publicly discussed. A 3rd party giving constructive criticism or auditing the proposal may find this post useful.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 4.409090909090909
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/veox",
                    "index": "2",
                    "likes": "0",
                    "time": "29/05/2019-10:48:34",
                    "content": "Placeholder comment for things-to-consider.  Impact on CREATE:  must still use gas (G_create in YP); must still mince the nonce to obtain target address; including multiple CREATEs within a single transient program.  Impact on SSTORE:  must not persist on exiting call frame, or revert immediately: would result in EOA with state otherwise.  No-destination call from within existing contract, or nested within another transient program:  should already be impossible: can’t place an empty item on the stack to be used as argument to call.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.9523809523809526
                }
            ]
        }
    ],
    "group_index": "853"
}