{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/improved-mechanism-for-eth-2-0-staking/4431",
            "title": "Improved Mechanism for ETH 2.0 Staking ",
            "index": 4431,
            "category": [
                "EIPs",
                "Core EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/zhous",
                    "index": "1",
                    "likes": "0",
                    "time": "17/07/2020-12:19:50",
                    "content": "This topic really needs a big discussion.   github.com   DAism2019/EIPs/blob/master/EIPS/eip-2794.md --- eip:  title: Improved Mechanism for ETH 2.0 Staking author: Derek Zhou (@zhous), Hua Zhang (@dgczhh), Yuefei Tan (@whtyfhas) discussions-to:  status: Draft type: Standards Track category: Core created: 2020-07-17 ---  ## Simple Summary We propose a new staking protocol with an honor system to replace ETH 2.0's staking mechanism in which a node must stake 32 ETHs to be a validator and thus expose ETH 2.0 to extremely high risks. This proposal will bring strong and reliable security to ETH 2.0's staking.  ## Motivation (Risk Analysis) According to the latest released specifications of ETH 2.0, phase 0 needs to be activated by at least 16,384 nodes and this will lock at least 524288 ETHs till phase 1. In additon Ethereum's outshining potentials and future will undoubtedly attract more people to do this staking and cause more ETHs to be locked. Furthermore the ***ETH 2.0 Economics*** section in the official document \"Ethereum Roadmap\" discusses Staking Rewards from one million validators to 0ne hundred million and if this comes true a large amount of ETHs will be locked. All these factors will very likely drive ETH's price dramatically up.  As a rule of thumb, if ETH's price rises by ten times or has a hike like what happened in 2017, ETH 2.0's validators will be tempted to sell ETHs for fiat currencies or stable coin and it will be a huge financial burden for people who want to join staking. When this happens, on one hand a large number of existing validators will perform an exit, and on the other hand interested people who want to stake may not be able to afford the expensive cost. The consequence will be that ETH 2.0's security and reliability will be hit hardly.  Vitalik Buterin mentioned this kind of risk in a reddit post but he emphasized that although it may happen infrequently in pratice it may still happen. However, from our perspective, even if this happens once, it will be a disaster to Ethereum.     This file has been truncated. show original         github.com/ethereum/EIPs         Improved Mechanism for ETH 2.0 Staking   ethereum:master ← DAism2019:master            opened 11:18AM - 17 Jul 20 UTC               zhous             +451 -0           Our team have done some related codes:   github.com   naturaldao/SmartContracts/blob/master/contracts/Factory.py # @dev Implementation of control contract # @author radarzhhua@gmail.com from vyper.interfaces import ERC20   # the contract of NDAO ERC20 token contract NDAO:     def mint(_to: address, _value: uint256): modifying     def decimals() -> uint256: constant   # the exchange contract contract Exchange:     def setup(token_addr: address, ndao_address: address,               token_amount: uint256): modifying   # the ICO contract contract ICO:     def setup(_name: string[64], _symbol: string[32], _decimals: uint256, _depositGoal: uint256,     This file has been truncated. show original          GitHub    naturaldao/DHonor DHonor. Contribute to naturaldao/DHonor development by creating an account on GitHub.      ",
                    "links": [
                        "https://github.com/DAism2019/EIPs/blob/master/EIPS/eip-2794.md",
                        "https://github.com/DAism2019/EIPs/blob/master/EIPS/eip-2794.md",
                        "https://github.com/ethereum/EIPs/pull/2794",
                        "https://github.com/ethereum/EIPs/pull/2794",
                        "https://github.com/zhous",
                        "https://github.com/ethereum/EIPs/pull/2794/files",
                        "https://github.com/naturaldao/SmartContracts/blob/master/contracts/Factory.py",
                        "https://github.com/naturaldao/SmartContracts/blob/master/contracts/Factory.py",
                        "https://github.com/naturaldao/SmartContracts/blob/master/contracts/Factory.py",
                        "https://github.com/naturaldao/DHonor",
                        "https://github.com/naturaldao/DHonor"
                    ],
                    "GPT-summary": "The post is an explanation of a proposal for a new staking protocol for ETH 2.0. The authors of the proposal are listed, and the post includes a simple summary, motivation, and risk analysis. The post also mentions related codes that the team has done. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.722689953724437
                }
            ]
        }
    ],
    "group_index": "1094"
}