{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/exploiting-miners-or-security-concern-0-fee-frontrunners/5942",
            "title": "Exploiting miners or security concern? 0-Fee Frontrunners ",
            "index": 5942,
            "category": [],
            "tags": [
                "defi",
                "front-running"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/merlinux",
                    "index": "1",
                    "likes": "4",
                    "time": "09/04/2021-01:52:29",
                    "content": "I’m watching the ecosystem already some time with main focus on scams and different shinanigans (I accidentally killed it. etc.) Since a few months there is a concerning increase in “0-Fee Frontrunners”. If the concept of front-running is not familiar: When a user trades an asset it is, for a short period of time, visible in the tx-pool. Within this timeframe a attacker can send a transaction with higher gas as the users trade in order to get a cheaper price on the asset. With a quite stable ~25% of gas usage by different DeFi-Platforms (Uniswap, Metamask, 1inch…) within the whole network, trading is currently the major single usecase for our ecosystem. It seems now that either miners are abusing their ability to arbitrarily include free transactions in order to enrichen themselfs or are selling such slots as feature (I’m not aware of such service) I found following addresses performing transactions targeting such trades with 0 fee: 0x0000000023152fb76626201d30577eea74f26dbe 0xa1e9adb32f9b6227d164ebc7903b469a740255ed 0xb38a9f021a3bf6bebcb7b7c4f4df3064b9143098 0xe4abcedb46e6aa2b02bfbb4bb0bc64f4009e39ae 0x4f69c5b694d5a14a0a595703175c478ec6b2a2fe 0x3b16945d161ae39e541083a5c085004816f492a0 Possible i’m missinterpreting the transactions themself and there where indeed fees, but as far as i was able to analyse those transactions (trying to capture 0x0000000023152fb76626201d30577eea74f26dbe etc.) my only conclusion is, that miners are involved. The other option would be that people found a way to manipulate the mining process within different miner pools. My major concerns about these transactions:  Transaction order is manipulated Transactions are included in blocks mined by different pools Very high activity (0x0000000023152fb76626201d30577eea74f26dbe ---- 5k tx within 1 month)  I believe in a fair ecosystem where transactions and especially the mining process can be trusted and is as free of manipulation as possible. I’m not sure if there are any countermeasures which can be taken in order to mitigate such behaviour, thats why i would like to start a discussion in this forum. Would you have any idea how the mining process can be more fair? Maybe hardened against arbitrary manipulation? One idea would be to pseudo-random sort transactions within a block (based on block-number?). The transactions to be included can still be manipulated, but order would be deterministic. ",
                    "links": [
                        "https://etherscan.io/address/0x0000000023152fb76626201d30577eea74f26dbe",
                        "https://ethereum-magicians.org/t/transactions-without-gas/6064/5"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.390640283140283
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/kladkogex",
                    "index": "2",
                    "likes": "0",
                    "time": "16/04/2021-12:51:34",
                    "content": "Vow vow - really good research! It shows that the fee auction may become non-important all together! I had very similar experiences recently - submit a transaction to uniswap with near zero gas fee and have it immediately executed because of MEV. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/merlinux",
                    "index": "3",
                    "likes": "0",
                    "time": "21/04/2021-11:18:05",
                    "content": "A very good recent analysis is also documented here: Rapid Rise of MEV in Ethereum. The Dark Forest is coming for you! | by Harith Kamarul | Etherscan Blog | Apr, 2021 | Medium As the article pointed out, most of the pools are participating actively with increasing numbers:  image700×384 73.9 KB  Also, Spark pool seems to openly commit it and even wants to share the MEV profit: https://help.sparkpool.com/hc/kb/article/1518858/?lang=en In my opinion, it is ethically questionable to abuse the power of arbitrary ordering / including transactions for individual profit. ",
                    "links": [
                        "https://ethereum-magicians.org/uploads/default/original/2X/c/c7ed75dceddacf16fecde02bb992e75156444450.png",
                        "https://help.sparkpool.com/hc/kb/article/1518858/?lang=en"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3445833333333335
                }
            ]
        }
    ],
    "group_index": "1298"
}