{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/interesting-question-idea-allowing-a-tx-to-only-lock-part-of-the-state-trie-and-pay-for-how-much-each-locks/5263",
            "title": "Interesting question / idea: \"allowing a tx to only lock part of the state trie, and pay for how much each locks\" ",
            "index": 5263,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "1",
                    "time": "31/01/2021-02:32:39",
                    "content": "Posted by @mhluongo on a Twitter thread:  Pretty sure this was discarded years ago in the annals of Ethereum L1 design, but have we totally given up on allowing a tx to only lock part of the state trie, and pay for how much each locks? It’s crazy to me that every tx gets a global lock by default. Being familiar with a UTXO model, I remember I was shocked. No wonder gas is high — you should have to pay out the nose for that privilege. Paying for the scope of a tx’s state lock would open up more parallelizable verification, etc, but it’d also be more fair to folks who are just pushing tokens around and are only touching a single contract. It’d also be satisfying to see our flash loan arb friends pay for the superpower.  @prestwich responded:  there’s some movement in this direction with eip 2930. But it’s not sufficient. Stateless eth had some shakeups lately and I wouldn’t count on it being a thing for several years  ",
                    "links": [
                        "https://twitter.com/_prestwich/status/1355682402895446020"
                    ],
                    "GPT-summary": "The post discusses the idea of allowing a transaction to only lock part of the state trie and pay for how much each lock. The author of the post questions why every transaction gets a global lock by default and suggests that paying for the scope of a transaction's state lock would open up more parallelizable verification and be more fair to those who are only touching a single contract. A third party responds by mentioning some movement in this direction with EIP 2930 but also notes that it's not sufficient and that stateless ETH has had some shakeups lately.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.698602484472049
                }
            ]
        }
    ],
    "group_index": "1219"
}