{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/new-proposed-addition-to-erc-1400-library-of-standards-custodial-ownership/3644",
            "title": "New proposed addition to ERC-1400 library of standards - Custodial Ownership ",
            "index": 3644,
            "category": [
                "EIPs"
            ],
            "tags": [
                "erc-1400"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/AdamDossa",
                    "index": "1",
                    "likes": "0",
                    "time": "10/09/2019-19:35:27",
                    "content": "One of the pain points for custodial ownership of security tokens is that currently the only way to do this (applies to all ERC-20 tokens) is to take full ownership of the tokens. This causes a bunch of problems, most noticably:  incorrect ownership tables which mix beneficial and custodial ownership inability to distribute capital (e.g. dividends) to beneficial owners inability for beneficial owners to participate in goverance  This places constraints both on organisation based custody service providers, as well as DeFi protocols that need to take custodial ownership of security tokens for e.g. collateral purposes. ERC-2258 proposes a new mechanism for custodial ownership wihich gives custodians similar guarantees, but solves the above issues. Would love any feedback and thoughts on it!   github.com/ethereum/EIPs      Issue: ERC 2258: Custodial Ownership Standard  \t \topened by adamdossa \ton 2019-09-02 \t \t \t  eip: ERC-2258 title: Custodial Ownership Standard (part of the ERC-1400 Security Token Standards) discussions-to: #2258 status: Draft type: Standards Track category: ERC created: 2019-09-01 require: ERC-20 (#20) Simple Summary This...        Thanks, Adam ",
                    "links": [
                        "https://github.com/adamdossa",
                        "https://github.com/ethereum/EIPs/issues/2258",
                        "https://github.com/adamdossa",
                        "https://github.com/ethereum/EIPs/issues/2258"
                    ],
                    "GPT-summary": "The author of the post is proposing a new mechanism for custodial ownership of security tokens, which aims to solve the issues related to the current method of taking full ownership of tokens. The author is asking for feedback and thoughts on the proposal. The post also includes a link to the proposal and its status. A 3rd party can give constructive criticism, ask questions, or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.749125874125874
                }
            ]
        }
    ],
    "group_index": "926"
}