{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/ghg-emissions-offsetting-for-ethereum-blockchain-transactions/3296",
            "title": "GHG Emissions Offsetting for Ethereum Blockchain Transactions ",
            "index": 3296,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/ensrationis",
                    "index": "1",
                    "likes": "0",
                    "time": "19/05/2019-09:06:08",
                    "content": "Simple Summary Ethereum, other crypto transactions consume substantial amount of fossil fuel combustion-based electricity. The best way to resolve the issue is to calculate transaction or address-induced consumption-based GHG emissions, to buy-out and burn relevant amount of independently verified in the Ethereum Main Net carbon credits. Abstract EIP for Ethereum requires calculation of a specific transaction-induced GHG emissions by gas consumed and conservative assumptions for energy consumption factor of the mining equipment and grid emission factor for mining the block, which processed the transaction. Once the calculation is broadcasted to the user and the miner, they are presented with an option to select, buy-out and burn relevant amount of Ethereum native tokens representing independently verified and issued in the Ethereum Main Net carbon offset credits. Motivation There are numerous examples of environmental/climate change mitigation project initiators, programs, standards and environmental/climate change community in general rejecting the use of Ethereum and other cryptocurrency ecosystems because of the GHG emissions induced by mining to process the transactions. Responses of blockchain community, Ethereum founders and developers up to date if any have been hollow, non-specific trash talk mainly referring to vague perspectives of PoS introduction. Development and implementation of the EIP resolves the issue entirely for the Ethereum transactions on the basis of the Paris Agreement (PA) principle of  “overall mitigation of global emissions” (OMGE) and should be extended to embrace other cryptocurrencies’ transactions starting with Bitcoin. Existing DAO IPCI  Dapp (http://dapp.ipci.io) provides for verification, issuance and retirement of carbon offset credits sufficient to perform carbon offsetting in “a manual mode” but does not provide for calculation of crypto transactions’ “carbon footprint” and a self-executing option to offset it. Specification Calculation Algorithm: Electricity consumed per transaction (MWh) multiplied by Grid Emission Factor (tCO2eMWh) plus carbon footprint for one Ethereum transaction to burn the carbon credits. Offsetting Algorithm: 1. the User may choose the units he would prefer out of those that are placed on the Complier contract, which means that they are born and die on the blockchain 2. carbon footprint calculated as an option might be divided by 2 to include proposal to the miner to offset half of the transaction footprint 3. once the units are paid for and burnt the User and relevant Miner receive public report, which includes the addresses of the burning transaction, of the token, of the verification report, and the amount of tCO2e burnt and left to be burnt Sources of Data Transactions data: etherscan for Ethereum Calculation based on gas consumed and conservative assumptions for energy consumption factor of the mining equipment and grid emission factor for mining the block, which processed the transaction. Existing examples of calculation results for Energy consumption per transaction: https://digiconomist.net/ethereum-energy-consumption for Ethereum Grid emission factor: assessed conservatively as equal to national grid emission factor for P.R. of China. According to “China’s electricity emission intensity…” equals to 0.861 t/MWh. Example TxHash: 0x8cb77d212b249ba3c455f405ceb07d1b05e36ccb7e59cd53ecd3311b08513a28 Block height: 6063159 Mined By: 0x829bd824b016326a401d083b33d092293333a830 (f2pool_2) Energy consumption per transaction: Calculation based on gas consumed and conservative assumptions for energy consumption factor of the mining equipment and grid emission factor for mining the block, which processed the transaction. Or as calculated by digiconomist = 0,094 MWh Grid emission factor: 0,861 t/MWh Calculation: 0,0940,861 + 0,0940,861 = 0,161868 tСО2e For offsetting purposes, the price established by the Complier is used (ex. 20 Euro) Total price to offset the transaction 0,161868 * 20 = 3,23736 Euro To include the miner, once half the units are paid for and burnt by the User relevant Miner receives public report, which includes the addresses of the burning transaction, of the token, of the verification report, and the amount of tCO2e burnt and left to be burnt (0,080934 tCO each) General design for offsetting carbon footprint of individual address Calculation Algorithm would be different: Electricity consumed per transaction (MWh) multiplied by Grid Emission Factor (tCO2eMWh) multiplied by the number of transactions. Example Address: 0x6CEc6913fF2F8802a0eaA183Fb61C0234AAB5830 Number of transactions: 327 Energy consumption per transaction: Calculation based on gas consumed and conservative assumptions for energy consumption factor of the mining equipment and grid emission factor for mining the block, which processed the transaction. Or as calculated by digiconomist = 0,094 MWh Grid emission factor: 0,861 t/MWh For offsetting purposes, number of transactions is increased by one and the result may be divided by 2 to include the miner and the price established by the Complier is used (ex. 20 Euro) Calculation: 3280,0940,861=22,242213 tСО2e Total price for 26,546352tCO2e = 530,92704 Euro To include the miner, once half the units are paid for and burnt by the User relevant Miner receives public report, which includes the addresses of the burning transaction, of the token, of the verification report, and the amount of tCO2e burnt and left to be burnt (13,273176 tCO each) To compare, Bitcoin energy consumption and carbon footprint per transaction calculated by digiconomist was not 0,094, but 0,803 MWh. Rationale The rationale for specific design is based on careful examination of all alternative options including exotic and unrealistic proposals to transfer mining to renewable sources of energy. The EIP reflects the only feasible, independently verifiable solution for the chain of GHG emission from generation to offsetting within the same semantic space with reasonable and conservative assumptions, where direct access to data required is technically impossible for  the date (energy consumption factor of the mining equipment, grid emission factors). Backwards Compatibility Test Cases Offsetting carbon footprint with Ethereum native tokens representing independently verified and issued in the Ethereum Main Net carbon offset credits has been practically and successfully tested for number of times:  0xff2ce19aaa46c8debaac2e195eb898f6dd86c0c46befb26baaf66c94cd35fad8 0xa3c60801f82f74e36c471c135d1f2eb6b92ca1c8aa05b8f58ee283ab21b3cbf7 0x517efedf6b0eadadf46759b6f9b2d9a64b12fc0bef55b8e124d2319d989d2332 etc.  ",
                    "links": [
                        "https://digiconomist.net/ethereum-energy-consumption"
                    ],
                    "GPT-summary": "The post proposes a solution to the issue of GHG emissions induced by mining to process Ethereum and other cryptocurrency transactions. The proposal involves calculating transaction-induced GHG emissions and buying out and burning independently verified carbon credits. The post explains the calculation and offsetting algorithms and provides examples of test cases. The proposal is based on the Paris Agreement principle of overall mitigation of global emissions and is designed to be the only feasible, independently verifiable solution for the chain of GHG emissions from generation to offsetting.",
                    "GPT-proposal-categories": [
                        "Privacy, Security and risk management",
                        "Token economics",
                        "Law and regulations",
                        "Interoperability and Scaleability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.234090909090909
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/virgil",
                    "index": "2",
                    "likes": "0",
                    "time": "19/05/2019-17:15:09",
                    "content": "Given the variety of sources of power for Ethereum mining, this seems very difficult.  For example, in Iceland geothermal power is free and renewable.  But it’s unclear how to prove one’s mining came from these sources. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Galenovich",
                    "index": "3",
                    "likes": "0",
                    "time": "19/05/2019-17:30:09",
                    "content": "That’s why conservative assumptions are proposed given the fact that the majority of miners are in China Grid emission factor is assessed conservatively as equal to national grid emission factor for P.R. of China. According to “China’s electricity emission intensity…” equals to 0.861 t/MWh.. Ideally, the miners should provide trustworthy verified data on energy consumption and grid emission factor, once they don’t we should take a conservative assumption ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MadeofTin",
                    "index": "4",
                    "likes": "0",
                    "time": "21/05/2019-06:55:51",
                    "content": "Have you had a chance to look at the Finality Gadget for eth1.X? The finality provided is a real opportunity to lower block rewards without sacrificing network security which would also reduce the carbon footprint. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Galenovich",
                    "index": "5",
                    "likes": "0",
                    "time": "25/05/2019-13:53:43",
                    "content": "We are trying to follow the technical developments. However, the principal task is to provide trustworthy tool to offset negative environmental impact entirely for Ethereum and other cryptocurrencies ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.46875
                }
            ]
        }
    ],
    "group_index": "843"
}