{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/breakout-session-community-governance-group-engage-for-self-management/1762",
            "title": "Breakout Session - Community Governance Group - Engage for Self-Management ",
            "index": 1762,
            "category": [
                "Happenings"
            ],
            "tags": [
                "devcon4"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/johba",
                    "index": "1",
                    "likes": "2",
                    "time": "31/10/2018-16:21:40",
                    "content": "core questions:  how to motivate people to become active in the community? how to engage with members? without loosing decentralization, without setting rules?  further topics:  how do you activate people without telling them what to do? language - can there be something that we can give a name to: kudos, tacos, tips. do we want to seduce people into activating themselves. human nature maybe doesn’t change.  hashtag: #ethcommunity raw transcript: Boris: - Leading question: can social recognition be used to incentivize people to become active? Ome: - being grateful works in small communities Michael: \t- we are conditioned for certain modes of collaboration. a mind-switch is often needed. Boris - intro to unconferences (eg. barcamp). - those are also self-organizing communities. a workshop is part of it. Matteo \t- understanding the other person’s perception of hierarchy is important. Ome \t- objection: agents have dependency over each other. what are value creation drives? - in small communities you want to destroy “power”. Matteo  - disadvantage of tokens: once there is an on-chain economy, people that don’t understand code are left out. Boris - are kudos/tacos comparable? Facilio - go back, in which ways does decentralization not work? Matteo  - tipping and appreciation. Boris - all of this are societal interactions. johann - kudos and tacos is not enough, high touch motivation is needed, how to do? Boris - commons based peer production is cool. it goes beyond just code. prevent technocratic capture. are we forcing people into a certain world? Michael - should there be a how? Facilio - decentralization not working. can we gather this? Ome - is this much different from other organizations? open source? Boris - now people don’t understand how centralized OS projects are - 2 tools available voice and exit - meta-magicians created “templates” - eg. hold a magicians event - act of making of template has some learning - legitimacy of template has to be choose. noname - egos create problems - decentralization can only work with framework, like movement - “the swarm” by Rick Falkvinge. Facilio\t- framework is needed. centralization of value in decentralized organization. Boris - vitalik lambo is funny. for people outside might not be. - altcoin is offensive. connotation to alt-right in NA Nikita \t- tipping communities are great Boris - coming up with a few words to pick from for social attribution / credit Matteo \t- seduction is different from education. Michael - education today is a bad design. Ome \t- tried to trow an illegal party. you have to run after people. only 3 of 25 were proactive. Boris - can we have people scale by themselves. Michael\t- instructions are necessary. Ome \t- looking up to heroes of our tribe. Michael\t- what about giving them instructions? tell the to be proactive. Boris - google todos sheet. - what if we use github issues for everything - “great for issue” - please contribute one thing that can be done. - getting a loop going. Michael - small tasks have helped me to become part of community. - initial direction needed. Boris - is there a way to use roles to “flip newbs into active”. Matteo  - will tipping be still fluid next week.  What do you think? what ideas work the best? what are your experiences? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.158471812740105
                }
            ]
        }
    ],
    "group_index": "492"
}