{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/how-do-u-prevent-what-could-be-considered-double-spending-in-nfts/6516",
            "title": "How do u prevent what could be considered double spending in NFTs? ",
            "index": 6516,
            "category": [
                "Tokens"
            ],
            "tags": [
                "nft"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Shymaa-Arafat",
                    "index": "1",
                    "likes": "0",
                    "time": "20/06/2021-06:19:55",
                    "content": "Let me start first by checking whether this site   blog.erratasec.com    Deconstructing that $69million NFT \"NFTs\" have hit the mainstream news with the sale of an NFT based digital artwork for $69 million. I thought I'd write up an explainer. Spec...       is a trusted source of information? Then it’s written there  IMG_20210620_011356720×1600 224 KB  So what prevent the auctioneer from resell it again? ( make a new token  pointing to the same file?)  He used the example of a receipt, if a marchant signed 2 receipts for the same item u could press charges against him, what about NFT?  -I mean other than tampering or making a slight change, does the “create” or “transfer” functions check if the hash already exists, ie have been minted before? or they just verify it? (A marchant could sign & seal 2 manual receipts to be only discovered in court, but a computerized system wouldn’t print a 2nd receipt from the beginning) In one sentence How does NFTs prevent double spending?or they just don’t? ",
                    "links": [
                        "https://blog.erratasec.com/2021/03/deconstructing-that-69million-nft.html?m=1",
                        "https://ethereum-magicians.org/uploads/default/original/2X/1/1b5ead34c8ed0cc5249fbe6babb94635a9180e8e.jpeg"
                    ],
                    "GPT-summary": "The post is a question about how NFTs prevent double spending. The author is asking for an explanation of how NFTs prevent double spending and is seeking clarification on whether the \"create\" or \"transfer\" functions check if the hash already exists. The post does not fit perfectly into any of the listed topics, but it can be categorized as a 3rd party asking questions about the proposal and giving constructive criticism of the proposal. Additionally, the post can be seen as an audit and review of the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.909248737373738
                }
            ]
        }
    ],
    "group_index": "1363"
}