{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-3322-efficient-gas-storage/5470",
            "title": "EIP-3322: Efficient Gas Storage ",
            "index": 5470,
            "category": [
                "EIPs"
            ],
            "tags": [
                "evm",
                "opcodes",
                "gas"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "1",
                    "likes": "0",
                    "time": "04/03/2021-18:55:08",
                    "content": "  github.com/ethereum/EIPs         EIP 3322: Efficient Gas Storage   ethereum:master ← wjmelements:gas-storage            opened 06:42PM - 04 Mar 21 UTC               wjmelements             +68 -0           ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pull/3322",
                        "https://github.com/wjmelements",
                        "https://github.com/ethereum/EIPs/pull/3322/files",
                        "https://ethereum-magicians.org/t/eip-3300-phase-out-refunds/5434/9"
                    ],
                    "GPT-summary": "The post is an announcement of a new proposal, EIP 3322, which aims to improve gas storage efficiency in Ethereum. The author of the proposal is explaining the details of the proposal, while a 3rd party is providing constructive criticism and auditing/reviewing the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "None",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "2",
                    "likes": "0",
                    "time": "04/03/2021-22:25:39",
                    "content": "Yet another alternative would be to create a gas token builtin contract. That would avoid overhead from adding the gas refund counter field to accounts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MicahZoltu",
                    "index": "3",
                    "likes": "2",
                    "time": "05/03/2021-07:19:14",
                    "content": "Copying my argument against this change from another discussion at https://github.com/ethereum/EIPs/issues/3291#issuecomment-785052942  Currently, block space is a resource that has a fairly even availability over time, similar to cloud servers, electricity, or space on a toll road. We do not have any way (currently) to move the supply around, just as you cannot move the supply of road space from night time to day time. Because of this, we do not want people to be able to pay off-peak prices in order to use space during on-peak hours. What we want people to do is move their usage to off-peak. There is currently a proposal floating around to remove refunds specifically because they are used predominately for paying off-peak prices for on-peak usage. What I think would be an interesting problem to solve is figuring out how we can move off-peak resources to on-peak time, so during peak season we have more resources available. One could imagine this like a battery, where you save up some off-peak space for on-peak demand. For example, if blocks are empty at night, we make up for that emptyness during the daytime. 1559 does this over very short time periods, and I’m not sure how to extend the strategy over longer periods of time other than changing the base-fee adjustment rate to be very slow (which has its own set of problems).  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.778333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chriseth",
                    "index": "4",
                    "likes": "0",
                    "time": "05/03/2021-15:43:06",
                    "content": "I second Micah’s comments. Furthermore, I think that we should try to reduce the exposure of the EVM to gas mechanics instead of extending it. I would prefer to not complicate the EVM further (this adds state and yet another stack) and instead solve the problem outside of the EVM or even at the user level. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "5",
                    "likes": "0",
                    "time": "05/03/2021-22:13:54",
                    "content": "    chriseth:  yet another stack   What do you mean? I don’t think it adds another stack. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chriseth",
                    "index": "6",
                    "likes": "1",
                    "time": "09/03/2021-13:07:36",
                    "content": "Right, I misread the EIP. It does not add another stack. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "7",
                    "likes": "1",
                    "time": "15/03/2021-22:20:12",
                    "content": "Copied from a Github issue:  Adding 3 new opcodes and a 5th item to track with every account is too much for London. If it were to target Shanghai we could discuss the merits, but the timeframe makes this a non-starter because of complexity.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.840909090909091
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "8",
                    "likes": "0",
                    "time": "15/03/2021-22:40:02",
                    "content": "@shemnon   Adding 3 new opcodes and a 5th item to track with every account is too much for London. If it were to target Shanghai we could discuss the merits, but the timeframe makes this a non-starter because of complexity.    Modifications to refunds are being considered for London due to relatively urgent concerns about 4x elasticity with EIP-1559, and gas token storage. Any of my engineers should be able to implement and test this EIP in 2-5 days. If core developers are short on resources, we can help with implementations. As aforementioned, if the nullable account gas counter is a major concern, we could instead go with a gas token ERC20 precompile, though that would reduce extensibility and limit future innovation.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.429924242424242
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "9",
                    "likes": "0",
                    "time": "15/03/2021-22:51:07",
                    "content": "    MicahZoltu:  Currently, block space is a resource that has a fairly even availability over time, similar to cloud servers, electricity, or space on a toll road. We do not have any way (currently) to move the supply around, just as you cannot move the supply of road space from night time to day time. Because of this, we do not want people to be able to pay off-peak prices in order to use space during on-peak hours. What we want people to do is move their usage to off-peak.   I disagree with this. The greatest cost component of gas is the long-term cost, which is why gas limit discussions among miners focus on state growth rather than validation time. We are not close to being bound by short-term costs, so this proposal achieves what you describe later in your argument: shifting bandwidth from low-demand to high-demand periods. This proposal achieves that while still bounding the short-term overhead via the 2x refund limit. As proof we are not bounded by short-term validation costs, as miners colluded to raise the gas limit from 10m to 12.5m, the uncle rate declined. If miners were even close to their validation limits, the uncle rate would have increased or perhaps stayed the same. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/shemnon",
                    "index": "10",
                    "likes": "2",
                    "time": "16/03/2021-00:06:50",
                    "content": "    wjmelements:   Modifications to refunds are being considered for London due to relatively urgent concerns about 4x elasticity with EIP-1559, and gas token storage.    These are not mutually exclusive proposals.  Just because phasing out gas refunds goes in for London does not preclude this from being added to Shanghai or later. If this is desirable and has net positive value it can very easily go in then.    Any of my engineers should be able to implement and test this EIP in 2-5 days. If core developers are short on resources, we can help with implementations.    I think that obscures the true cost. First the PRs would need to be reviewed by the client teams.  My experience has been that this can be 50% to 100% as much effort as simply writing a PR from a client team member.  There are many distant side effects in each client that needs to be considered.  Second, the reference tests need to be written and accepted by the EF’s testing team.  Even if provided externally they have very specific desires that are not always well documented and will also add to the gaant chart. There are also the coordination costs relating to getting this tested on a YOLO network prior to production testnets. And the slowdown that invariable happens when interpretations of sections vary slightly or are mis-read. There’s also the implicit safety concern of having one team implement a feature in all of the mainnet capable clients.  Do you have a financial interest in seeing this passed?  If so would you be willing to post a grant to allow at least one of the client teams to implement it themselves or via bounty?    As aforementioned, if the nullable account gas counter is a major concern, we could instead go with a gas token ERC20 precompile, though that would reduce extensibility and limit future innovation.    That would have a worse effect on state storage IMHO, there would need to be two reads down the account trie (but the ERC-20 trie would be smaller).  If kept it should be part of the account record. The downstream impact on other specs like Binary tries are my concern here.   They have 4 items enshrined fairly deeply in the details of the implementation (by overwriting two bits of an account hash).  This would either need to be rethought (with separate data forks down the trie) or the bit space increased to three.    However my deepest concern is that this will enshrine arbitrage as a core feature of the protocol, whereas before it was an emergent behavior.  I think some deep thought needs to go in to the follow on effects of such a movement before it is put into effect.  For one this will have a negative impact on miners and block producers (post-PoW) in that the gas fee for the tip will be reduced during spike times and replaced with lower fee gas consumption.  They may start playing MEV games like excluding accounts with high gas storage during high tip periods.  Moving it into account data rather than in the various gas tokens make it easier for the MEV miners to identify such transactions, at least for the transaction issuer. When I say “too complex for London” its this kind of secondary effect that I am referring to.  I don’t think there is nearly enough time to think out the impacts of this between now and when we have to stop adding to the EIP candidate in 2-4 weeks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.132814253647587
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "11",
                    "likes": "0",
                    "time": "16/03/2021-20:58:51",
                    "content": "    shemnon:  They may start playing MEV games like excluding accounts with high gas storage during high tip period   So-long as the refunds are not counted against the gas target, such behavior is unprofitable. The proposal is in many ways a continuation of the status quo so I do not anticipate secondary-order effects besides supplanting storage-based gas tokens.     shemnon:  That would have a worse effect on state storage IMHO, there would need to be two reads down the account trie (but the ERC-20 trie would be smaller). If kept it should be part of the account record.   This is unintuitive for me; I would expect the ERC20 approach to use less space, but I don’t work on the trie.     shemnon:  There’s also the implicit safety concern of having one team implement a feature in all of the mainnet capable clients. Do you have a financial interest in seeing this passed? If so would you be willing to post a grant to allow at least one of the client teams to implement it themselves or via bounty?   That would also be acceptable.     shemnon:  For one this will have a negative impact on miners and block producers (post-PoW) in that the gas fee for the tip will be reduced during spike times and replaced with lower fee gas consumption.   Boo-hoo. Think about the users, not the service providers. We can smooth peak congestion by amortizing its costs, and we should. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.124206349206349
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/shemnon",
                    "index": "12",
                    "likes": "0",
                    "time": "16/03/2021-21:11:53",
                    "content": "‘Boo-hoo’ to the miners is not a constructive response.  That’s what’s causing the EIP-1559 mess. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "13",
                    "likes": "0",
                    "time": "16/03/2021-21:58:30",
                    "content": "The important difference between what you are advocating and 1559 is that refunds are the status quo. From a miner’s perspective the marginal difference is that the elasticity costs less storage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/shemnon",
                    "index": "14",
                    "likes": "0",
                    "time": "16/03/2021-22:53:25",
                    "content": "But what is not different is the dismissiveness shown to miners.  There is also the consideration of block producers for Eth 2, their marginal reward will be lower so there is a greater incentive to ensure that they get the most tippable gas out of the transaction. The status quo is that gas arbitrage is an emergent behavior, not a deliberate design choice. I have concerns about regulatory capture if we make it explicit in the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "15",
                    "likes": "0",
                    "time": "16/03/2021-23:06:34",
                    "content": "    shemnon:  I have concerns about regulatory capture if we make it explicit in the protocol.   What do you mean by regulatory capture? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/bradleat",
                    "index": "16",
                    "likes": "1",
                    "time": "16/03/2021-23:40:43",
                    "content": "Your post makes me think that you’d want to enable a futures market for gas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "17",
                    "likes": "0",
                    "time": "20/03/2021-01:27:54",
                    "content": "    chriseth:  Furthermore, I think that we should try to reduce the exposure of the EVM to gas mechanics instead of extending it.   Having used the GAS and GASPRICE opcodes, and planning to use the BASEFEE opcode, I disagree. Gas is the best feature of the EVM; it’s how we meter the use of shared resources and prevent DoS. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mtefagh",
                    "index": "18",
                    "likes": "1",
                    "time": "28/03/2021-17:58:17",
                    "content": "This EIP incentivizes users to bulk purchase gas whenever the price is low. These mass buyers would benefit a lot more if we combine this with EIP-1559. The problem is that EIP-1559 does not account for slippage. I have already discussed this point two years ago in here (last paragraph). Users are paying for the burden which the previous users put on the network rather than their own. Hence, if we start hoarding gas by making an otherwise under-used block full, then the users in the next block will have to pay the extra charges while we spend the stored gas gradually. This gets even worse when we realize that EIP-1559 tells us that if we see a usage spike in the current block, then the gas price will go up sharply in the next block. Therefore, rational users are incentivized to pre-purchase gas for the next block, which in turn, makes the current spike even sharper. This is the opposite of what happens if we had considered slippage by simply replacing the gas used in the previous block with the gas used in the current block in the update rule’s formula. ",
                    "links": [
                        "https://ethereum-magicians.org/t/eip-1559-fee-market-change-for-eth-1-0-chain/2783/363"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.164351851851851
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "19",
                    "likes": "1",
                    "time": "29/03/2021-01:15:22",
                    "content": "    mtefagh:  Therefore, rational users are incentivized to pre-purchase gas for the next block, which in turn, makes the current spike even sharper   It’s cheaper for them to buy it on a DEX than to mint it themselves in this case. Available liquidity is much deeper than the current block. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pipermerriam",
                    "index": "20",
                    "likes": "0",
                    "time": "29/03/2021-16:19:16",
                    "content": " Disclaimer that I haven’t read the discussion above.  Posting this here just so that my opinion is documented in the official discussion.  I am strongly opposed to enshrining the concept of “gas tokens” into the protocol.  refunds are of questionable usefulness and have not been shown to be an effective measure to mitigate state growth. 1559 already provides elasticity for the “supply” the current plans to mitigate state growth are fully independent from the refund mechanism  These lead me to my opinion that this introduces significant complexity with minimal benefit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.505208333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "21",
                    "likes": "0",
                    "time": "29/03/2021-17:56:12",
                    "content": "    pipermerriam:    refunds are of questionable usefulness and have not been shown to be an effective measure to mitigate state growth.  Strongly refuted here  1559 already provides elasticity for the “supply”  To handle peak congestion we will need to be able to sustain >1x throughput for much longer than allowed by 1559, while still amortizing the long-term costs, which are not limited to state growth. There is no reason that bandwidth costs should surge 50x when usage increases 3x for a few hours. Grocers don’t raise their prices in the afternoon; they hire part-time workers. The elasticity of 1559 is unproven on a congested blockchain, and may not come until PoS due to increased uncle risk under PoW. Consider deferring your judgment about the elasticity provided by 1559 when it wasn’t designed to provide it, but instead to pump the ETH price.  the current plans to mitigate state growth are fully independent from the refund mechanism  If you prefer state rent, I encourage you to live with it for 10 years before forcing it on everyone else. You may find it annoying that the ENS handle you had reserved for 100 years is gone now, the few who have the info you need to prove it back into existence are charging you a fortune for the privilege, and the state size has not actually shrunk because of the stubs. It’s unreasonable to plan around a system that nobody has a good design for, never mind an implementation. State rent is a pie-in-the-sky solution to numb you until we realize state growth is not that bad when we let the miners-soon-stakers who pay for it set hard limits on its growth.  These lead me to my opinion that this introduces significant complexity with minimal benefit.  The complexity is 32 bytes per contract account that stores gas. I don’t recommend storing this attribute on every account by default. The benefit is that this uses significantly less storage for more elasticity than provided in the status quo. If you don’t care about storage you must not run a node. edit: formatting ",
                    "links": [
                        "https://medium.com/@willmorriss/block-bulimia-in-eip-1559-b4576a9bab55"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.955886504799548
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pipermerriam",
                    "index": "22",
                    "likes": "1",
                    "time": "29/03/2021-19:11:48",
                    "content": "    wjmelements:  Strongly refuted here   This refutation isn’t compelling for me.  I don’t believe that users would actually do the balance(..) - 1 approach broadly, and beyond this, refunds have not proven to be adequate to provide any meaningful mitigation to state growth.  They may slow it down some, and removing refunds might make the problem a little worse… but ultimately, to really provide a meaningful solution for state growth, a more significant change is needed, hence: https://ethresear.ch/t/resurrection-conflict-minimized-state-bounding-take-2/8739/17     wjmelements:  To handle peak congestion we will need to be able to sustain >1x throughput for much longer than allowed by 1559   I agree on this.  I now understand that 1559 doesn’t provide the type of “supply elasticity” that 3322 proposes.  I still don’t see this argument as compelling enough to justify the complexity.     wjmelements:  If you prefer state rent, I encourage you to live with it for 10 years before forcing it on everyone else.   See https://ethresear.ch/t/resurrection-conflict-minimized-state-bounding-take-2/8739/17 This is the leading model for how we intend to deal with state growth at the protocol level.     wjmelements:  The complexity is 32 bytes per contract account that stores gas.   The complexity is that it introduces more nuance to how gas is used and accounted for.  This will inherently effect many different parts of how the EVM operates.  I’m not suggesting that there is anything insurmountable.  Just that this isn’t a “small” change, and that I don’t see it being prioritized over the other significant protocol changes that are being worked on. ",
                    "links": [
                        "https://ethresear.ch/t/resurrection-conflict-minimized-state-bounding-take-2/8739/17",
                        "https://ethresear.ch/t/resurrection-conflict-minimized-state-bounding-take-2/8739/17"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.075537988581466
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/optimalbrew",
                    "index": "23",
                    "likes": "0",
                    "time": "29/03/2021-21:02:49",
                    "content": " If you prefer state rent, I encourage you to live with it for 10 years before forcing it on everyone else. You may find it annoying that the ENS handle you had reserved for 100 years is gone now, the few who have the info you need to prove it back into existence are charging you a fortune for the privilege  Hi. Could you help me understand why the “few who have info” will necessarily behave as a monopoly (and charge a fortune)? Why won’t one of them undercut the others? Disclosure: I am researching state rent!  Thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.446969696969697
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "24",
                    "likes": "0",
                    "time": "31/03/2021-03:16:53",
                    "content": "    optimalbrew:  Hi. Could you help me understand why the “few who have info” will necessarily behave as a monopoly (and charge a fortune)? Why won’t one of them undercut the others? Disclosure: I am researching state rent!  Thanks   It would be very costly to maintain a redundant system over time, and few customers willing to pay much of anything, especially at first. Costs are not restricted to hardware; the system must also be maintained by engineers. Due to the cost of maintenance I would rule out altruism after the first several years. The number of providers would be perpetually diminishing; nobody would allow anyone else to copy it cheaply lest they invite competition and ruin the very reason to have preserved the data in the first place. The resulting barrier to entry would result in collusion and monopolistic pricing. Failures to collude would harm all participants, reducing the count until equilibrium allows collusion or an outright monopoly. Mergers are likely collusion strategies in this scenario. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5859375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "25",
                    "likes": "0",
                    "time": "31/03/2021-03:22:20",
                    "content": "    pipermerriam:  I don’t believe that users would actually do the balance(..) - 1 approach broadly   It’s not so much about the users as it is about the protocols. Most end-users do what the UX tells them to, and the protocols with the most users will have earned them at least in part by minimizing their gas costs.     pipermerriam:  The complexity is that it introduces more nuance to how gas is used and accounted for. This will inherently effect many different parts of how the EVM operates   On the contrary, it uses an existing mechanism, the refund counter.     pipermerriam:  I don’t see it being prioritized over the other significant protocol changes that are being worked on.   Agreed, especially for this year. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.921875
                }
            ]
        }
    ],
    "group_index": "1250"
}