{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/what-pain-points-do-effective-pms-eliminate-reduce-for-teams/2134",
            "title": "What pain points do effective PMs eliminate/reduce for teams? ",
            "index": 2134,
            "category": [
                "Working Groups",
                "Product Management Ring"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/chris-remus",
                    "index": "1",
                    "likes": "4",
                    "time": "05/12/2018-17:26:45",
                    "content": "PMs know the benefits we bring to teams. Part of our work is communicating these benefits to crypto teams. Along these lines I’ve been looking at what we as PMs do, from the outside looking in.  How do developer-heavy crypto teams view us? What does an effective PM do?  I’ve been thinking about the first question for a while now. I recently started shifting my focus to the second. Another way to ask the second question is - Pain and Symptoms “What pain does an effective PM ease? What are the symptoms?” Asking ourselves that question, from a team’s perspective, will help project and product management gain traction in the space. Gaining traction will help more teams ship products. It’s only once those product ship that they can contribute to decentralizing our world. Here are a few initial symptoms that came to my mind - 1 - A team can’t get an idea past releasing a white paper, i.e. they don’t know how to get started or where to start. 2 - A team did start and is active, as verified by them through their Github repo activity. Yet they feel they should be further along a/k/a aren’t moving fast enough. 3 - A team is very close to releasing, yet can’t get the project across the release line. 4 - A team’s community is getting restless and antsy, starting to ask roadmap and timeline questions. 5 - A team has launched, yet very few people are using their product. Raising Awareness These symptoms aren’t unique to crypto. I mention them to raise awareness of the symptoms. This awareness is important, since many #BUIDL’ers may be working on their first project. As a result, they may not recognize the symptoms as they’re experiencing them. What other symptoms do teams that need a PM experience? Let’s discuss in the comments. (I first published this in the Blockchain PM newsletter.) ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.607051282051282
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/YalorMewn",
                    "index": "2",
                    "likes": "0",
                    "time": "07/12/2018-18:52:17",
                    "content": "I would first ask what are the “signs” that a team needs a PM ?  Are the above signs you mentioned generally accepted signs that a team is struggling with a lack of PM based structure ?  If so, then how can teams help themselves be more accountable, more vigilant to the signs and start addressing those issues earlier.  If not, then what are they or what are some we’re not seeing here ?  My thought would be how do we formulate some type of Web3 team self analysis ? For me personally Iv’e seen some of the above  effect various projects that iv’e been connected to directly or indirectly. Here are some of my own:  Lack of communication between decision makers and lower level team members. Teams might know how they get from A - B - C but lack the clarity of how they get to Z. Following leaders blindly, because they “know” better.  Leaders of a team whether from technical expertise or vision should be able to make a clear distinction for team members of how and why things are being done a certain way, \" because I said so\" simply doesn’t cut it. Decision making centralized to a few people within the team.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6535714285714285
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "3",
                    "likes": "1",
                    "time": "07/12/2018-22:51:09",
                    "content": "When coming up the description for ETHproduct’s office hours here: https://hackmd.io/0Bhmujw_SHG8DsQR7CNe1A?both Came up with symptoms of a team that needs better PMship. Catering to smaller open source projects with PMs or leads without too much formal product experience, I listed some feelings and experience as I have encountered founds and leads who couldn’t comprehend what was wrong…  When a team just feels like it is spinning its wheels When a team feels like there is a lot of ambuiguity and uncertaintiy whether the team is building the right thing, often an intuitively sinking feeling. When a team is uncomfortable and unsure about its future direction, vision and roadmap ~ it’s down on paper but you feel like there still are unspoken reservations When you feel it is hard to keep on top of what is going on with the team, what discussions are happening and overall feel like it is hard to ‘keep on top of it all’ When the work being done feels inconsiderate and often unvervalued if not ignored Other feelings of struggling to trying to keep up  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.222080498866212
                }
            ]
        }
    ],
    "group_index": "575"
}