{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/standard-for-specific-nft-owned-smart-contracts/9612",
            "title": "Standard For Specific NFT Owned Smart Contracts ",
            "index": 9612,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "nft",
                "erc"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/mnkhod",
                    "index": "1",
                    "likes": "0",
                    "time": "14/06/2022-10:34:07",
                    "content": "This idea has been formed around NFT’s having more utility. I truly believe more utility would come forth to the NFT ecosystem if Smart Contract ownerships can be enhanced with Specific NFT’s. Instead of having Address Ownership like the one we use from OpenZeppelin’s Ownable contract , i believe there should be a standard for Smart Contract NFT Ownership. Allowing smart contracts to be only accessible by certain NFT holders will bring more utility to the NFT Ecosystem. Truly bringing more innovation to Smart Contract Wallets or Business Logic related smart contracts & allowing NFT holders to have more utility rather than flipping all day long NFT holders are incentivized to hold their NFT than flipping them. Having this standard will incentivize developers to create more innovative smart contracts that utilizes NFT’s I believe this can be achieve & i will also be including an implementation soon on this thread.   github.com   OpenZeppelin/openzeppelin-contracts/blob/v4.6.0/contracts/access/Ownable.sol // SPDX-License-Identifier: MIT // OpenZeppelin Contracts v4.4.1 (access/Ownable.sol)  pragma solidity ^0.8.0;  import \"../utils/Context.sol\";  /**  * @dev Contract module which provides a basic access control mechanism, where  * there is an account (an owner) that can be granted exclusive access to  * specific functions.  *  * By default, the owner account will be the one that deploys the contract. This  * can later be changed with {transferOwnership}.  *  * This module is used through inheritance. It will make available the modifier  * `onlyOwner`, which can be applied to your functions to restrict their use to  * the owner.  */ abstract contract Ownable is Context {       This file has been truncated. show original      ",
                    "links": [
                        "https://github.com/OpenZeppelin/openzeppelin-contracts/blob/v4.6.0/contracts/access/Ownable.sol",
                        "https://github.com/OpenZeppelin/openzeppelin-contracts/blob/v4.6.0/contracts/access/Ownable.sol"
                    ],
                    "GPT-summary": "The author proposes a standard for Smart Contract NFT Ownership, which would allow smart contracts to be only accessible by certain NFT holders, bringing more utility to the NFT ecosystem. The author believes that this will incentivize developers to create more innovative smart contracts that utilize NFTs. A 3rd party could give constructive criticism of the proposal or ask questions about it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.088669950738916
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/riksucks",
                    "index": "2",
                    "likes": "0",
                    "time": "04/08/2022-21:28:19",
                    "content": "Hello @mnkhod ! I am new here, so pardon me if I do anything out of place. I think this indeed is a good idea. Right now the stuff that are being done when it comes to “membership” stuff using NFT is tokengating. Which is mostly frontend/backend. But not on chain. I believe, an upgradation of AccessControl by openzeppelin can be made that is based around owning a certain kind of NFT or any sort of FT. Maybe even generalize it and make it for ERC-1155. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.03030303030303
                }
            ]
        }
    ],
    "group_index": "1776"
}