{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-1776-erc20dao-extend-any-dao-framework-for-compliance-with-local-legal-jurisdictions/8078",
            "title": "EIP-1776 : ERC20DAO : Extend any DAO framework for compliance with local legal jurisdictions ",
            "index": 8078,
            "category": [
                "Governance"
            ],
            "tags": [
                "dao"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/j0xhn",
                    "index": "1",
                    "likes": "0",
                    "time": "23/01/2022-06:11:52",
                    "content": "Minimum viable DAOs for easy integration into various governance models that encourages a “Bring Your Own Governance” mentality.  The basic understanding being that we empower an admin to legally enact updates to token balances and NFT information as agreed upon by DAO. This can be extended in many ways across other DAO models and adopts a set of naming patterns to extend systems default functions with their admin equivalents by appending “_admin” to all functions - in essence creating a “getter/setter” pattern that any other governance standard can integrate with.   github.com   DAOhaus/EIPs/blob/master/EIPS/eip-1776.md EIP-1776: Legally Empowered Governance Tokens Author\tJohn D Storey Discussions-To\t Status\tStagnant Type\tStandards Track Category\tERC Created\t2020-09-08 Requires\t20  Table of Contents Simple Summary Abstract Motivation Specification ERC-2980 (Token Contract) Whitelist and Frozenlist Issuers Revoke and Reassign Rationale Backwards Compatibility      This file has been truncated. show original      ",
                    "links": [
                        "https://github.com/DAOhaus/EIPs/blob/master/EIPS/eip-1776.md",
                        "https://github.com/DAOhaus/EIPs/blob/master/EIPS/eip-1776.md",
                        "https://ethereum-magicians.org/t/standardizing-daos/7400/2"
                    ],
                    "GPT-summary": "The post introduces EIP-1776, which proposes a way to extend any DAO framework for compliance with local legal jurisdictions. The proposal suggests empowering an admin to legally enact updates to token balances and NFT information as agreed upon by DAO. The post also includes a link to the full proposal on GitHub. The post does not advertise the proposal, nor does it contain entirely positive or negative feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.8065476190476195
                }
            ]
        }
    ],
    "group_index": "1578"
}