{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/https-stp-data-channel-between-smart-contract-and-dapps/8620",
            "title": "HTTPs (STP) data channel between smart contract and Dapps ",
            "index": 8620,
            "category": [
                "EIPs"
            ],
            "tags": [
                "evm",
                "eip-191"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/hileamlakB",
                    "index": "1",
                    "likes": "1",
                    "time": "15/03/2022-20:07:12",
                    "content": "Down the road, there will be a growing number of DApps build on Ethereum. Some of which will probably need an encrypted communication channel between their smart contracts and their use facing UI’s. If something like this already exists correct me, but a standard protocol to establish something like HTTPs (obvious called something else for Ethereum, possibly STP for secure transfer protocol) would be very useful. For instance, if a smart contract gives out unique secrete ids to its users, to be stored offline and retrieved for future use, an encrypted channel is necessary. This EIP will build of EIP-191. Using the encryption scheme as a starting point. ",
                    "links": [],
                    "GPT-summary": "The author proposes a new standard protocol called STP for establishing an encrypted communication channel between smart contracts and user-facing UIs in DApps built on Ethereum. The proposal builds on EIP-191 and aims to address the need for encrypted channels when smart contracts give out unique secret IDs to users. The post does not advertise or seek collaboration on the proposal, but rather explains it and invites feedback and questions.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Privacy, Security and risk management",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.6355006105006105
                }
            ]
        }
    ],
    "group_index": "1652"
}