{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/erc-4000-staking-reward-pool-standard-request-for-comments/6004",
            "title": "ERC-4000 Staking-Reward Pool Standard (request for comments) ",
            "index": 6004,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/cryppadotta",
                    "index": "1",
                    "likes": "4",
                    "time": "15/04/2021-15:53:27",
                    "content": "Staking-reward pools are a common way for projects to incentivize desired behaviors like providing liquidity, bonding, token distribution, or loan origination, but nearly every project implements the interface differently. Myself, vfat, and DkNinja have drafted an EIP for an ERC Staking-Reward Pool Standard based on our experience of writing code to interact with hundreds of “Masterchef-” and \"Synthetix-\"style staking-rewards pools. Staking-reward pools are widespread and we believe that the adoption of a standard for staking-reward pools will benefit the entire ecosystem through better user interfaces and composability with smart contracts such as yield aggregators. In this EIP, we’ve tried to carve a minimal surface area that should be easy for users to understand and require minimal changes from existing pool contracts. (For example, we envision teams should be able to quickly write adapter-proxies for any existing Masterchef-style contracts.) We’d appreciate your comments here on eth-magicians (or on the hackmd directly) before we move to submitting a formal pull request. Link to the draft HackMD ",
                    "links": [
                        "https://hackmd.io/@dotta/erc4000-pool-std"
                    ],
                    "GPT-summary": "The author of the post is proposing an ERC Staking-Reward Pool Standard and is asking for feedback on the proposal. The proposal aims to create a standard for staking-reward pools to benefit the entire ecosystem through better user interfaces and composability with smart contracts such as yield aggregators. The author has provided a draft HackMD and is requesting comments before submitting a formal pull request. Some 3rd parties may provide constructive criticism or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Token economics",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.525297619047619
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/DeFi_initiate",
                    "index": "2",
                    "likes": "0",
                    "time": "15/04/2021-16:57:21",
                    "content": "I commend you for this much-needed initiative! There are four components that are missing from this proposal in my view. These are:  Locking and vesting: how much of the stakes/rewards are locked, for how long, and what is the vesting (unlocking) schedule Fees and taxes: deposit, withdrawal and performance fees, burning schedule, transaction tax, reflection Farm information: name, website, and other attributes such as contact info and social media accounts Chain information: I imagine you would like to have this standard also adopted for the Binance Smart Chain (and other compatible chains). If so, specifying the chain would be advisable.  These are very important considerations for users, and lacking an easy mechanism to collect this data will reduce the usefulness of the standard. Other than the above, the proposal seems comprehensive and well-thought-out. You may want to include an Applications section, in which you could give examples of where and how the standard would be used. This is a great start - good luck with finalizing it and having it implemented! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.720868347338936
                }
            ]
        }
    ],
    "group_index": "1309"
}