{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/el-merge-client-release-naming/7928",
            "title": "EL Merge Client Release Naming ",
            "index": 7928,
            "category": [
                "Working Groups",
                "The Merge"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "1",
                    "likes": "1",
                    "time": "07/01/2022-16:50:55",
                    "content": "“The Merge” refers to the process of moving Ethereum to proof of stake. This includes, roughly:  Releasing EL and CL clients which support this functionality; The network difficulty on Ethereum exceeding the TERMINAL TOTAL DIFFICULTY; The first post-PoW blocks being created by validators using their EL + CL node combination; Ethereum finalizing post-merge.  The CL clients have chosen the name Bellatrix for (1). I’m opening this thread to discuss the options for EL clients to name their equivalent release. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ualtinok",
                    "index": "2",
                    "likes": "1",
                    "time": "07/01/2022-17:02:40",
                    "content": "echo “Bellatrix” | rev Xirtalleb Looks good on the panda merge meme  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/shemnon",
                    "index": "3",
                    "likes": "1",
                    "time": "07/01/2022-18:30:37",
                    "content": "Malaspina Glacier. It is a composite glacier being fed mostly by Seward Glacier and Agassiz Glacier, i.e. it is the glacier that is a merger of multiple glaciers.   en.wikipedia.org    Malaspina Glacier The Malaspina Glacier (Lingít: Sít' Tlein) in southeastern Alaska is the largest piedmont glacier in the world. Situated at the head of the Alaska Panhandle, it is about 65 km (40 mi) wide and 45 km (28 mi) long, with an area of some 3,900 km2 (1,500 sq mi). It is named in honor of Alessandro Malaspina, a Tuscan explorer in the service of the Spanish Navy, who visited the region in 1791. In 1874, W.H. Dall, of what is now the U.S. National Geodetic Survey, bestowed the name \"Malaspina Plateau\" It...      ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Malaspina_Glacier"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/EvanVanNessEth",
                    "index": "4",
                    "likes": "2",
                    "time": "07/01/2022-18:36:12",
                    "content": "imho the fork should be named Paris   twitter.com    Evan Van Ness 🐬 @evan_van_ness    @TimBeiko @ethereum @vdWijden @sendmoodz @Uniswap @mhswende @EthMagicians @adietrichs @yperbasis @dannyryan I'd like to suggest Paris as the name for the EL-side fork.  Paris was the first massive non-Devcon conference, organized by @jdetychey and @Superpandia   8:36 AM - 7 Jan 2022           1            ",
                    "links": [
                        "https://twitter.com/evan_van_ness/status/1479521576404062212",
                        "https://twitter.com/evan_van_ness/status/1479521576404062212",
                        "https://twitter.com/evan_van_ness/status/1479521576404062212"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tjayrush",
                    "index": "5",
                    "likes": "2",
                    "time": "07/01/2022-18:43:17",
                    "content": "We should call it “Finally.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/matt",
                    "index": "6",
                    "likes": "4",
                    "time": "07/01/2022-18:46:35",
                    "content": "I am in favor of finally using “Serenity” for an official release. I realize that Serenity has generally referred to both the upgrade to PoS and the introduction of sharding, but I think merging the EL and CL is momentous enough to overlook that  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/taxmeifyoucan",
                    "index": "7",
                    "likes": "0",
                    "time": "07/01/2022-19:28:00",
                    "content": "Serenity was also my initial thought but I would be careful with it. It might be confusing for the public since it is widely understood as ‘Eth 2.0’, with sharding as you say. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/domothy",
                    "index": "8",
                    "likes": "1",
                    "time": "07/01/2022-19:41:58",
                    "content": "Execution layer scheme: City names Consensus layer scheme: Star names Merge is about EL and CL coming together, therefore a “merge” or “compromise” between cities and stars would be a logical choice. What’s between the earth and the stars? We got the athmosphere, planets, solar system, asteroids, etc. (the only nearby star would be our sun but I think we’d all oppose calling the update “SOL”). Continuing that train of thought maybe “Horizon” would be a cool name? “The Horizon fork”, all about going beyond the horizon. I dunno. Kinda fits with earlier fork names like Homestead and Frontier. Otherwise take the name of a fictional city from SciFi that’s settled somewhere in space? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Quez",
                    "index": "9",
                    "likes": "1",
                    "time": "07/01/2022-20:30:24",
                    "content": "What about Los Angeles as the City of Stars? Thus we combine a name of a city with a hint to the stars. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/a35u",
                    "index": "10",
                    "likes": "1",
                    "time": "08/01/2022-06:00:45",
                    "content": "Holocene, the period after glaciers. From the Greek for words for whole and new. Led to a flourishing of human civilization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.420454545454545
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/abcoathup",
                    "index": "11",
                    "likes": "0",
                    "time": "10/01/2022-01:08:48",
                    "content": "@shemnon ice age delay upgrades have been two word glacier names. Recent execution layer upgrades have used single Devcon city names:    More frequent, smaller hardforks vs. less frequent, larger ones Process Improvement       I suggest to use Devcon locations past Istanbul:   (devcon 0: berlin?) devcon 1: london devcon 2: shanghai devcon 3: cancun devcon 4: prague devcon 5: osaka  After 2.5 (?) years that would mean we need to have more devcons or switching naming convention    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.853918650793651
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/radek",
                    "index": "12",
                    "likes": "5",
                    "time": "10/01/2022-10:34:06",
                    "content": "Being a diver I suggest Halocline. This is the place where 2 different substances meet.   en.wikipedia.org    Halocline In oceanography, a halocline (from Greek hals, halos 'salt' and klinein 'to slope') is a cline, a subtype of chemocline caused by a strong, vertical salinity gradient within a body of water.  Because salinity (in concert with temperature) affects the density of seawater, it can play a role in its vertical stratification.  Increasing salinity by one kg/m3 results in an increase of seawater density of around 0.7 kg/m3.  In the midlatitudes, an excess of evaporation over precipitation leads to surfa...      ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Halocline"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.722222222222221
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jassmin",
                    "index": "13",
                    "likes": "0",
                    "time": "11/01/2022-09:05:54",
                    "content": "Either Tigris or Euphrates ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/microbecode",
                    "index": "14",
                    "likes": "1",
                    "time": "12/01/2022-20:54:15",
                    "content": "A big and important merge: the end of something and the beginning of something else. To celebrate the end:  Terminus (‘end of transportation line’, fits nicely with old testnet metro station names)  To celebrate the beginning:  Origin Sprout Inception  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/q9f",
                    "index": "15",
                    "likes": "2",
                    "time": "14/01/2022-12:18:17",
                    "content": "Best proposal of this thread so far is Serenity - just a running gag on behalf of the initial Ethereum roadmap (Frontier, Homestead, Metropolis, Serenity), super suitable for EL clients  Notably, we only named hardforks after city names because they were all part of the initial Metropolis milestone; we are leaving Metropolis now and entering Serenity.  Runner-up is “Halocline” it’s both a beautiful term and a adequate metaphor. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7592592592592595
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/cdili",
                    "index": "16",
                    "likes": "1",
                    "time": "19/01/2022-06:00:03",
                    "content": " Gaia Gaia… is the personification of the Earth. It’s short, relatively unique, and may pair well with Bellatrix. I am not an environmentalist, but I think we want a name that commemorates the significance and deeper meaning of the release.   It is not just a Merge, or where two things meet, or where something ends… we want to convey why… Uniqueness is helpful when future generations search for the details and stories about the release. A weakness of proposed names like “Paris” and “Serenity” is that when searching for “ethereum paris” or “ethereum serenity” there will be many articles unrelated to this historic release… If the other contender is Malaspina (or Halocline), it is too complicated and too many syllables: do you want to say Malaspina or Gaia? For uniqueness, I think city names were a poor choice for EL names. If city names are still desired for future EL releases, I still think this one release can and should be unique and not follow that trend.   en.wikipedia.org    Gaia In Greek mythology, Gaia (/ˈɡeɪə, ˈɡaɪə/; from Ancient Greek Γαῖα, a poetical form of Γῆ Gē, \"land\" or \"earth\"), also spelled Gaea /ˈdʒiːə/, is the personification of the Earth and one of the Greek primordial deities. Gaia is the ancestral mother—sometimes parthenogenic—of all life. She is the mother of Uranus (the sky), from whose sexual union she bore the Titans (themselves parents of many of the Olympian gods), the Cyclopes, and the Giants; as well as of Pontus (the sea), from whos The Greek n...         ethereum.org    Ethereum Energy Consumption | ethereum.org The basic information you need to understand Ethereum's energy consumption.      ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Gaia",
                        "https://ethereum.org/en/energy-consumption/#proof-of-stake",
                        "https://ethereum.org/en/energy-consumption/#proof-of-stake"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.479166666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jflo",
                    "index": "17",
                    "likes": "1",
                    "time": "08/02/2022-22:20:29",
                    "content": "I like the idea of a city with stellar connotations. Paris is the City of Lights Tuscon (Arizona, USA) is regarded as the Astronomy Capital of the World for its cloudless skies and clear nights. Atacama, Chile also has a very fair claim to that title. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.699999999999999
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "18",
                    "likes": "2",
                    "time": "03/03/2022-20:21:04",
                    "content": "We’ll be having a breakout room next Friday 14:00 UTC to settle this  if you feel strongly about the name of the upgrade, please join! Info here: EL Merge Client Release Naming Breakout Room · Issue #491 · ethereum/pm · GitHub ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.354166666666666
                }
            ]
        }
    ],
    "group_index": "1559"
}