{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-1132-time-locking-of-tokens-within-a-contract/1060",
            "title": "EIP-1132 - Time-locking of tokens within a contract ",
            "index": 1060,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/krakjack",
                    "index": "1",
                    "likes": "0",
                    "time": "14/08/2018-13:31:43",
                    "content": "My colleague at GovBlocks, Nitika, recently authored an EIP. Thought I’d share it here and get feedback from the community. For context, I’ve pasted the abstract below:  This proposal provides basic functionality to time-lock tokens within a contract for multiple utilities without the need of transferring tokens. It also allows fetching token balances of locked and unlocked tokens (tokens available for transfer). Time-locking can also be achieved via staking (#900), but that requires transfer of tokens to an escrow contract/stake manager, resulting in the following five concerns:  additional trust on escrow contract/stake manager additional approval process for token transfer increased ops costs due to gas requirements in transfers tough user experience as the user needs to claim the amount back from escrow inability for the user to track his true token balance / token activity   Link to the EIP - https://github.com/ethereum/EIPs/issues/1132 ",
                    "links": [
                        "https://ethereum-magicians.org/t/erc-4400-erc-721-consumer-extension/7371/24"
                    ],
                    "GPT-summary": "The author of the post shares an EIP proposal authored by a colleague at GovBlocks, which provides functionality to time-lock tokens within a contract for multiple utilities without the need of transferring tokens. The author seeks feedback from the community on the proposal. A 3rd party could provide constructive criticism of the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Token economics",
                        "Interoperability and Scalability",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.131172839506172
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/krakjack",
                    "index": "2",
                    "likes": "0",
                    "time": "21/08/2018-06:04:09",
                    "content": "[Update] The issue has been merged into master   github.com   nitika-goel/EIPs/blob/master/EIPS/eip-1132.md --- eip: 1132 title: Extending ERC20 with token locking capability author: nitika-goel <nitika@govblocks.io> type: Standards Track category: ERC status: Draft created: 2018-06-03 discussions-to: https://github.com/ethereum/EIPs/issues/1132 ---  ## Simple Summary  An extension to the ERC20 standard with methods for time-locking of tokens within a contract.  ## Abstract  This proposal provides basic functionality to time-lock tokens within an ERC20 smart contract for multiple utilities without the need of transferring tokens to an external escrow smart contract.  It also allows fetching balance of locked and transferable tokens.   Time-locking can also be achieved via staking (#900), but that requires transfer of tokens to an escrow contract / stake manager, resulting in the following six concerns:      This file has been truncated. show original      ",
                    "links": [
                        "https://github.com/nitika-goel/EIPs/blob/master/EIPS/eip-1132.md",
                        "https://github.com/nitika-goel/EIPs/blob/master/EIPS/eip-1132.md"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.446428571428571
                }
            ]
        }
    ],
    "group_index": "82"
}