{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/balanceof-should-be-part-of-erc721s-enumerable-extension/5533",
            "title": "`balanceOf` should be part of ERC721's enumerable extension ",
            "index": 5533,
            "category": [
                "EIPs"
            ],
            "tags": [
                "erc-721"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Arachnid",
                    "index": "1",
                    "likes": "0",
                    "time": "10/03/2021-22:23:36",
                    "content": "As far as I can tell, balanceOf on ERC721 serves almost no purpose unless the token implements the optional enumerability extensions. Without them, knowing how many tokens an account owns - but with no way to fetch what they are onchain - seems entirely pointless. It’s too late to officially move it over, since 721 is final, but I wonder if it would be practical to issue an errata that it should not be relied on, and encourage implementations to make it optional? It wastes over 20k gas when issuing a token to a new account, and 5k on each token issued to an existing account. If anyone reading relies on balanceOf for something other than enumerating tokens, I’d be keen to hear what it is, too. ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing that balanceOf on ERC721 should be part of the optional enumerability extensions. The author explains that balanceOf serves almost no purpose without the optional extensions and suggests that it should not be relied on. The author also provides information on the gas wasted when using balanceOf. The post invites feedback from readers who rely on balanceOf for something other than enumerating tokens.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Token economics",
                        "None",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.9133522727272725
                }
            ]
        }
    ],
    "group_index": "1260"
}