{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/motion-to-not-include-progpow-without-audit/3027",
            "title": "Motion to NOT include ProgPow without audit ",
            "index": 3027,
            "category": [
                "EIPs"
            ],
            "tags": [
                "progpow"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/ameensol",
                    "index": "1",
                    "likes": "14",
                    "time": "29/03/2019-15:31:04",
                    "content": "I just joined my first core devs call #58 (late bloomer I know), and I was concerned to hear that the core devs seem willing to move forward and include ProgPow, even if the audit doesn’t take place due to a lack of funding. At the risk of taking an extreme position, this strikes me as insane. I understand that many people want to just get this over with, as @gcolvin said on the call. But I don’t think it will ever make sense to switch to an un-audited hashing algorithm for a $10B+ network. Also I understand that this is a hypothetical discussion about what we do if the audit is not funded, and that imminent funding for the audit would obsolete this conversation, but I believe that if the default is that we don’t implement ProgPow without a clean audit (imo the sane thing), it makes it far more likely that miners would expediently pay for the audit. I want to add that I still don’t support ProgPow even if the audit comes back clean, but I would much more willing to accept it if it didn’t feel reckless. Links:  cat herders explaining why ProgPow audit is important gitcoin progpow audit grant fund  ",
                    "links": [
                        "https://gitcoin.co/grants/82/official-progpow-technical-audit-funding",
                        "https://ethereum-magicians.org/t/ethereum-core-devs-meeting-58/3053",
                        "https://ethereum-magicians.org/t/progpow-a-compilation-of-reference-material/3040/4"
                    ],
                    "GPT-summary": "The post is a critique of the proposal to include ProgPow without an audit due to lack of funding. The author believes that it is not sensible to switch to an un-audited hashing algorithm for a $10B+ network. The author suggests that the default should be not to implement ProgPow without a clean audit, which would make it more likely that miners would pay for the audit. The author also provides links to resources related to the ProgPow audit.",
                    "GPT-proposal-categories": [
                        "Privacy, Security and risk management",
                        "Law and regulations",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.604166666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/econoar",
                    "index": "2",
                    "likes": "4",
                    "time": "29/03/2019-15:37:23",
                    "content": "I fully agree and was surprised to hear this was a possibility as well. GPU miners are the ones set to gain financially from this change, I don’t think it’s unfair to ask them to come up with $50k to prove that it’s safe for the network to implement. I’m a no right now, strong no without an audit and could lean yes if the audit results are clean. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.540816326530612
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Anlan",
                    "index": "3",
                    "likes": "0",
                    "time": "29/03/2019-15:45:11",
                    "content": "    econoar:  GPU miners are the ones set to gain financially from this change, I don’t think it’s unfair to ask them to come up with $50k to prove that it’s safe for the network to implement.   Quite honestly what surprises me is GPU miners should pay for everything. Are miners so annoying parasites ethereum needs to get rif of quickly ? They provide a service. Without them this chain wouldn’t exist. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.111111111111111
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ameensol",
                    "index": "4",
                    "likes": "0",
                    "time": "29/03/2019-15:50:29",
                    "content": " GPU miners should pay for everything.  I don’t think they should pay for “everything”, but I think they should pay for this. They are getting $650M/y (at current prices), and the ProgPow change directly financially benefits them. Why should anyone else pay for it? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Anlan",
                    "index": "5",
                    "likes": "2",
                    "time": "29/03/2019-15:53:31",
                    "content": "    ameensol:  They are getting $650M/y (at current prices)   While spending $649.99M/y in power costs. Margins are razor thin if any. Mining reward is not a “gift” or a benevolence. And once again: forking of ASICs won’t increment GPU miner’s revenues. It will redistribute existing ones to a new break-even point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.5606060606060606
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tvanepps",
                    "index": "6",
                    "likes": "5",
                    "time": "29/03/2019-15:54:33",
                    "content": "Here is the main contention @ameensol surfaces: A completed audit is a prerequisite for hard fork inclusion. I think this is not only reasonable, but a bare minimum for due diligence! Changing a core component of the protocol should not be taken lightly and would only benefit from an external review. Setting aside who pays for it, don’t you agree there should be an audit? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.204861111111111
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "7",
                    "likes": "6",
                    "time": "29/03/2019-15:56:14",
                    "content": "One thing I will add is that there has previously been talk of having higher standards w.r.t. security in all EIPs. Not auditing ProgPow would go in the opposite direction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.138888888888888
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Anlan",
                    "index": "8",
                    "likes": "3",
                    "time": "29/03/2019-15:57:52",
                    "content": "Yes. Same thing should have been done with Constantinople. Two delays and a test-net completely messed up. I agree on the need of an audit: strongly disagree with “miners should pay for it” as this attitude opens a very dangerous path. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.691666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "9",
                    "likes": "1",
                    "time": "29/03/2019-16:00:48",
                    "content": "    Anlan:  I agree on the need of an audit: strongly disagree with “miners should pay for it”   Agreed! Why isn’t the EF funding at least some of it too? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.604166666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/salanki",
                    "index": "10",
                    "likes": "0",
                    "time": "29/03/2019-16:10:40",
                    "content": "I understand where this argument is coming from. The counter argument would be that a lot of people who have spent a lot of time understanding and implementing this algorithm (like Geth Martin) think that an audit is unnecessary since ProgPoW is an addition to ETHASH and not all that risky. No one is arguing that proper security analysis shouldn’t be done, the argument is that we might not need an expensive third party to conduct something that the client devs and community can accomplish. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gakonst",
                    "index": "11",
                    "likes": "5",
                    "time": "29/03/2019-16:12:22",
                    "content": "You do not replace a so-far battle tested algo with one that has only been deployed in non-adversarial testnets AND has not been audited. If no third party audit is performed, then it should be delayed until one is. Note: The auditors must also be vetted for any relationship to manufacturers / developers of ProgPoW itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/kvanreppelen",
                    "index": "12",
                    "likes": "4",
                    "time": "29/03/2019-16:12:25",
                    "content": "Only a few weeks ago, the hard fork was postponed because of a last-minute discovery. In the light of that event, I don’t really see how you can argue against caution (also, the cost of an audit would probable be smaller than the cost of introducing faulty updates to the current netwerk - correct me if I’m wrong). If I recall correctly, many devs were in favor of a delay to do some thorough checking. Why should this be different? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.054166666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Anlan",
                    "index": "13",
                    "likes": "2",
                    "time": "29/03/2019-16:17:59",
                    "content": "    gakonst:  You do not replace a so-far battle tested algo with one that has only been deployed in non-adversarial testnets AND has not been audited.   Two points : first one seems noone cares to take a look technically and try to understand how this is not a “replacement” rather than an “addition” to ethash. Second one : tests ! That’s what we’re begging since 7 months right now ! An official test-net, and an extensive analysis of crypto strength. But apparently we need to hire a third party auditor (which exposes the fact the internal ethereum teams have no more crypto experts) which costs should be totally on the shoulders of miners. And I can easily forsee that if an positive outcome gets out of the audit there will be still yellers asking to account the auditors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4106726606726605
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "14",
                    "likes": "6",
                    "time": "29/03/2019-16:35:25",
                    "content": "“We want an audit!” What’s in the audit? What are the audit goals? What are the inputs to the audit? What work has been done already? Answer those questions and we can get this party started! A lot of people tend to think an “audit” is somehow a magical rubber stamp that makes all of their dreams come true. In reality, a badly defined audit does barely anything, and only ensures a worse outcome because people don’t consider the value the audit provided. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lookfirst",
                    "index": "15",
                    "likes": "0",
                    "time": "29/03/2019-16:41:28",
                    "content": "After the Cat Herders announcement about Least Authority (we’ve quickly moved on from White Block), I’m still waiting for answers to the questions I asked here back on March 25th:    Medium – 25 Mar 19   What is the total amount necessary to fund the audit? What organizations and others are you relying on? Reading time: 1 min read       ",
                    "links": [
                        "https://medium.com/@lookfirst/what-is-the-total-amount-necessary-to-fund-the-audit-c2451efbcce5"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.027777777777778
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "16",
                    "likes": "1",
                    "time": "29/03/2019-16:42:59",
                    "content": "I’d also like to note that a part of what the Cat Herders are working on is in defining what the audit actually is, since most people have failed to articulate what they want out of the audit besides “security” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Anlan",
                    "index": "17",
                    "likes": "1",
                    "time": "29/03/2019-16:48:03",
                    "content": "    fubuloubu:  What’s in the audit? What are the audit goals? What are the inputs to the audit? What work has been done already?   https://github.com/ethereum-cat-herders/progpow-audit/blob/master/Least%20Authority%20-%20ProgPow%20Algorithm%20Audit%20Proposal%20(v2).pdf Work done already: NONE ! If funds not enough no one will move a finger. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "18",
                    "likes": "0",
                    "time": "29/03/2019-16:57:48",
                    "content": "The audit goals are extremely broad, and probably led to a very high cost to obtain the audit. Nonetheless, there should be enough of the discussion captured in this forum and elsewhere to construct a majority of this report as it stands right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.695267857142857
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "19",
                    "likes": "0",
                    "time": "29/03/2019-17:00:59",
                    "content": "    Anlan:  Work done already: NONE   Also, I meant in term of the test suite available. Ethereum has a very large and comprehensive test suite, so it shouldn’t be difficult to verify the updates with the client code. The work that would remain would be in verifying the miner code. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2976190476190474
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Anlan",
                    "index": "20",
                    "likes": "1",
                    "time": "29/03/2019-17:05:07",
                    "content": "There are several implementations of that. MH Swende’s work into geth Andreas Silva’s work into parity Pawel Bylica’s work on ethash library (used both in ethminer and aleth) There was also a fully functional miner supporting both ethash and progpow (with kernels for both CUDA and OpenCL/AMD) by me but I removed the work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/cheeselord1",
                    "index": "21",
                    "likes": "0",
                    "time": "29/03/2019-17:51:36",
                    "content": "Fully in support of needing a (well-defined and scoped) audit before moving forward with ProgPoW And included in that audit we should look into the ASIC-resistance claims of ProgPoW and see if they actually stand up to scrutiny. See recent detailed write-up by Linzhi:    Medium – 29 Mar 19    EIP 1057 (ProgPoW): Open Chip Design for only 1% cost/power increase EIP 1057... How to add ProgPoW to your ASIC. Reading time: 4 min read        ",
                    "links": [
                        "https://medium.com/@Linzhi/eip-1057-progpow-open-chip-design-for-only-1-cost-power-increase-eip-1057-progpow-d106d9baa6eb"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tintinweb",
                    "index": "22",
                    "likes": "2",
                    "time": "29/03/2019-17:53:32",
                    "content": "I guess most of us would like to avoid to trade our ship’s  diesel engine for that experimental new different technology diesel engine or maybe even warp drive w/o having a clear understanding of the risks associated with that. This change might have a broad effect in multiple dimensions and various groups have various incentives to either oppose or favour it. That’s to some extend also the problem and should be carried to a different battlefield (“political discussion”). I see people criticising every aspect of the ProgPoW discussion(s) for various reasons and hidden agendas, even the scoping gets its fair share of critics but unfortunately only the minority appears to be contributing or even working on an objective solution, still everyone would like to have one. If it is likely that ProgPoW happens for whatever reason that might be we should make sure to fully understand the risks, be prepared and treat them appropriately (this includes potentially agreeing on accepting risks if the community wishes to do so - given it permits others to reduce their own risk e.g. by withdrawing their stake from the system). Accepting risks w/o knowing them feels like a bold move - not sure if that would be seen as a trust building exercise. Not doing security due diligence is negligent as summarized by @tvanepps:     tvanepps:  Here is the main contention @ameensol surfaces: A completed audit is a prerequisite for hard fork inclusion. I think this is not only reasonable, but a bare minimum for due diligence! Changing a core component of the protocol should not be taken lightly and would only benefit from an external review. Setting aside who pays for it, don’t you agree there should be an audit?   Funding: The problem with peer-to-peer relationships appears to be that responsibility (e.g. in preserving the future of the ethereum ecosystem) is distributed across so many people that in the end nobody feels responsible - most people waiting for the others to make a move. It is even kicking off “why should I/groupX fund this” discussion ignoring the fact that we are in this all together. I wonder if this will work out in the end. Since we’re already discussing security here I’d like to remind people that @boris set up a security discussion slot at the Istanbul & ETH1x Roadmap Planning Meeting - April 17th & 18th in Berlin. Participate, criticise AND contribute/discuss potential solutions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.61611895986896
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "23",
                    "likes": "4",
                    "time": "29/03/2019-18:20:20",
                    "content": "We have been making risky changes to the client for years now without third-party audits.   progPoW has been in the open and under review by experts for almost 11 months now, and experts are still reviewing it.  So an audit will good to have, but I can’t see demanding one. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/shemnon",
                    "index": "24",
                    "likes": "1",
                    "time": "29/03/2019-18:22:02",
                    "content": "    cheeselord1:  Fully in support of needing a (well-defined and scoped) audit before moving forward with ProgPoW   ASIC resistance claims analysis is part of the audit proposal: https://github.com/ethereum-cat-herders/progpow-audit/blob/master/Least%20Authority%20-%20ProgPow%20Algorithm%20Audit%20Proposal%20(v2).pdf ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gakonst",
                    "index": "25",
                    "likes": "2",
                    "time": "29/03/2019-18:51:10",
                    "content": "I’d kindly like you to list all the risky changes, along with some evaluation (chance of exploitability / impact if exploited) that have been merged in the clients over the last 12 months (or more if you like). Chance of exploitation is a “?” in progpow, and impact if exploited is beyond imagination. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "26",
                    "likes": "0",
                    "time": "29/03/2019-19:28:24",
                    "content": "Copying this here for reference in the hopes that it makes the discussion a bit less fragmented. ProgPow discussed on the AllCoreDevs Gitter: https://gitter.im/ethereum/AllCoreDevs?at=5c9e6a374de4296efc201237 Ideally, let’s keep the discussion here, but I wanted to share the parallel one that happened. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.222222222222222
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "28",
                    "likes": "3",
                    "time": "29/03/2019-19:45:30",
                    "content": "Exactly. If an audit is needed for all “critical” EIPs across the board, we should explore how to ensure that happens, what “critical” means, and how to fund it on a regular basis. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Arachnid",
                    "index": "29",
                    "likes": "2",
                    "time": "29/03/2019-19:59:56",
                    "content": "Just take a look at the hard fork meta EIPs. Most of the changes affect the VM, and so have much higher risk than a change to the PoW algorithm. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.763888888888888
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "30",
                    "likes": "0",
                    "time": "29/03/2019-20:16:16",
                    "content": "Also, please define what “exploit” means. Here’s a few:  Algorithm totally breaks. Algorithm disrupts the network. Algorithm has a hole that allows certain miners to exploit for financial gain.  The Mitigation for all 3 of these is that we just fork back the old code, which is the same as any other EIP. This is hopefully caught beforehand by extensive testing. If it’s not, this is our mitigation. Yes, it incurs huge overhead costs, but so did Constantinople, and with the intense amount of eyes on this particular proposal, I expect it to have less show-stopping bugs than most other proposals in recent history (otherwise those against would’ve found something by now). If you disagree, look through the proposal and find some bugs. If you don’t feel comfortable doing that, you contribute money to the audit and we get some professionals to do that for us.  Security isn’t magic. It’s hard work. It requires money. This EIP is no different than the others in having problems with funding or security review. If it’s a showstopper for this EIP, I propose all progress on Istanbul EIPs should be stopped until we figure out a way to make sure all get the level of attention and expert review that this one is getting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4934807256235825
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/zscole",
                    "index": "31",
                    "likes": "4",
                    "time": "29/03/2019-20:28:57",
                    "content": "Most of the issues surrounding ProgPoW have been entirely political in nature. Based on our (Whiteblock) preliminary evaluation of ProgPoW, I think that basic benchmarking would likely be fairly useless. Most of the code I reviewed in ProgPoW appeared to be harmless at face value, but one thing I saw that really concerned me (not sure if this has been changed since or not) is how it handles randomization. If anything, this should be thoroughly vetted and highly scrutinized. Frankly, I’m surprised no one has brought this up yet (to my knowledge). I’ve kept out of these discussions as much as possible because I don’t want to get involved in a political war, so I’ll just leave it at that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2958333333333325
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ryanseanadams",
                    "index": "32",
                    "likes": "0",
                    "time": "29/03/2019-20:30:57",
                    "content": "It would be absolutely, positively, foolhardy to implement ProgPoW without an audit. Needless risk. Let’s not do it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.318181818181818
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AlexeyAkhunov",
                    "index": "33",
                    "likes": "6",
                    "time": "29/03/2019-20:38:09",
                    "content": "    fubuloubu:  If it’s a showstopper for this EIP, I propose all progress on Istanbul EIPs should be stopped until we figure out a way to make sure all get the level of attention and expert review that this one is getting.   Well, this is my biggest worry - that this change can dominate the next upgrade (or two, if it does not end up going to the first one, or three) for all the wrong reasons. Not because it is urgent, or something is broken, but because someone wanted it and someone else said “Yeah, OK, why not”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "34",
                    "likes": "2",
                    "time": "29/03/2019-21:11:02",
                    "content": "    AlexeyAkhunov:  someone wanted it and someone else said “Yeah, OK, why not”   Summary of the entire problem with EIPs right here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.309523809523809
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "35",
                    "likes": "2",
                    "time": "29/03/2019-21:37:33",
                    "content": "Will you fund security reviews for all EIPs? They all affect the operation of the network just as much as this one does. Why does this proposal need special treatment? We have the same mitigations in place (forking back to the original) available to us as we do for any other mistakes that get made! I definitely think an audit is necessary, but I also think audits are necessary for every EIP, not just politically contentious ones. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.534496753246754
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/CryptoHokie",
                    "index": "36",
                    "likes": "3",
                    "time": "30/03/2019-00:26:36",
                    "content": "I also believe ProgPoW should not be included in a fork until an indepdentent audit is completed. The premise of my argument against ProgPoW is irrelevant here. If the community shows support for ProgPoW I will also support it, after a proper independent audit is completed. This isnt a trivial change and certainly many changes in the past have not been as well. However, previous changes and many current EIPs are well within the realm of expertise of the core developers. ProgPoW is not. From listening to the Core Devs calls since #38 when ProgPoW was introduced for consideration, it is clear that there is a knowledge gap amongst core devs in fully understanding ProgPoW, I believes this makes them more susceptible to proponents with the requisite knowledge. An independent audit with a report in a level of detail most can understand will go a long way in determining the efficacy and benefite, as well as the shortcomings of the algo. I firmly support @lrettig’s statement in Core Devs #54 (https://github.com/ethereum/pm/blob/master/All%20Core%20Devs%20Meetings/Meeting%2054.md) in which he supported a pre-audit decision, but relying on the results of the audit for a final go / no go status. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.311111111111111
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lrettig",
                    "index": "37",
                    "likes": "0",
                    "time": "30/03/2019-00:42:23",
                    "content": "And that pre-audit decision was never made or not articulated clearly - precisely what I was afraid of! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ameensol",
                    "index": "38",
                    "likes": "0",
                    "time": "30/03/2019-08:13:08",
                    "content": "Cross post from https://gitter.im/ethereum/governance  “I care about rational arguments.” “Phil Daian’s essay is rather convincing. It would have been more useful before January.” This seems sort of comical. Sorry to single you out @gcolvin, but here you’re basically admitting to not caring about rational arguments and excusing yourself for making the decision without considering them. Much rational. Such logic.  As for @mhswende’s arguments (https://swende.se/blog/Progpow.html):  Community. As far as I’ve seen, most signals point to ‘the community’ wanting to go ahead with progpow.  This is the signaling argument you don’t like, right? Also our discussion over the last week points to more contention than I most ProgPow proponents expected. Most of us didn’t even realize that the ProgPow decision had “been made” back in January.  Known “evils”. If we switch to progpow, we will keep the ‘same’ ecosystem of miners around.  Who cares? The GPU miners will have their issuance reduced in the coming year anyways as PoS starts to provide finality for the PoW chain.  In my view, a hardfork which updates ethash-hashimoto to ethash-progpow will be the simplest fork we have ever done.  If this was really the case, then why is there so much fuss about getting an audit done? Either it’ll be trivial, and we should do it, or it won’t be trivial, and we should definitely do it.  Ethereum has historically been aimed to be ASIC-resistant… to me, this means that the ‘conservative’ route forward is to keep this model. And conversely, if we are to change this model, then the burden of proof for why we should change this model is on the progpow opponents.  Yea, we should allow ASICs temporarily because:   We’re well on our way to PoS securing the PoW chain, so the ROI on this change is negative for the community (due to coordination cost), and only positive for GPU miners. The ASICs will lose their relevancy over the next 1-2 years.   ASICs do not represent an existential risk at this time, and I don’t understand the fear that ProgPow proponents have of ASIC manufacturers trying to impede PoS. Like, let’s say we start to see more miner centralization, and then they attack the PoS transition by not going along with the fork… who in their right mind would want be on the centralized miner chain instead of the PoS chain, or at least the PoW chain secured by PoS in the meantime?     twitter.com          👹 Ameen Soleimani (ameensol)     This argument by @mhswende captures the anxiety, but with no explanation of how it might play out.   Why are we afraid?   https://t.co/SMxKqr627E  9:16 PM - 29 Mar 2019     8          3            ",
                    "links": [
                        "https://swende.se/blog/Progpow.html",
                        "https://twitter.com/ameensol/status/1111850347205672960",
                        "https://twitter.com/ameensol/status/1111850347205672960",
                        "https://twitter.com/ameensol/status/1111850347205672960"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.613269794721408
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ryanseanadams",
                    "index": "39",
                    "likes": "2",
                    "time": "30/03/2019-12:42:35",
                    "content": " audits are necessary for  every  EIP, not just politically contentious ones.  This is a change in the core algorithm (never been done on Ethereum). It seems like a full order of magnitude more risky than the typical EIP change. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.683333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "40",
                    "likes": "1",
                    "time": "30/03/2019-13:25:11",
                    "content": "    ryanseanadams:  It seems like a full order of magnitude more risky than the typical EIP change.   That’s the big point of contention I don’t think people understand. In terms of raw technical risk, it is actually fairly small. Most of the implementations have been completed in under a week, and the engineers are fairly confident in them at this point. There is huge execution risk, in that a small mistake could have a major impact. Execution risk is purely short term. If we do a good job, test it, and get it right, that risk does not carry over longer term. At this point I agree an audit would be a good part of an overall security strategy for this EIP, and a good part of reducing the potential for high impact to the network. The audit proposal, as written today, is extremely broad as far as security audits typically go, including evaluating such claims as “providing better decentralization”. I wouldn’t modify the proposal at this point, but I would say that the majority of the claims to be evaluated have largely been debated and discussed in the community at large and most have been resolved, at least to my knowledge. These claims have very little to do with the software codebase, which is a software security firm’s primary expertise. I expect the debate to continue afterwards, but at least we can all get happy with the code being as well-crafted as possible.     ryanseanadams:  This is a change in the core algorithm.   A majority of EIPs affect the core consensus algorithm through EVM execution, which is notoriously difficult to get correct, hence the massive test suite that we have. Many EIPs are way more difficult than this change. We are absolutely underfunding security review across the board for EIPs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.742679143772894
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "41",
                    "likes": "1",
                    "time": "30/03/2019-20:13:18",
                    "content": "    ameensol:  Much rational. Such logic.   So you are barking at me here too. If you had understood the discussion on ethereum/governance after your selective quoting you would gotten that I learned that I was mistaken about the date of the paper, that I had seen the same arguments in other places, that those arguments weighted some factors differently than I did, and that there were other arguments that I and others considered that Phil did not.  In the end, after over 7 months of discussion on public forums I chose to support ProgPow. Now you come along four months later questioning my rationality and intelligence. Please, stop trolling me or get out of here.  (@jpitts) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.96875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ameensol",
                    "index": "42",
                    "likes": "3",
                    "time": "30/03/2019-21:09:55",
                    "content": "Alrighty sir, I will stop trolling you and move on to rational arguments. This is what you said above:  We have been making risky changes to the client for years now without third-party audits. progPoW has been in the open and under review by experts for  almost 11 months now, and experts are still reviewing it. So an audit will good to have, but I can’t see demanding one.  I empathize with the fatigue, I’m feeling it too and I’ve only been doing this for a week. There are three main reasons why I believe an audit is important:  Safety - As is the first time we’re updating the hashing algorithm, I think we should take extra precautions to make sure it doesn’t do anything unexpected. I believe this is a fair request. The reason Constantinople was delayed was because an audit caught a bug. Why skip it for this?  As I said above, in response to @mhswende claiming the upgrade would be trivial:  If this was really the case, then why is there so much fuss about getting an audit done? Either it’ll be trivial, and we should do it, or it won’t be trivial, and we should definitely do it.    Consensus - From what I can tell, of the people who oppose ProgPow, none of them would be more fine proceeding without an audit. On the other hand, there are many people who support ProgPow that would prefer to have an audit done first. This means the anti-audit camp is a strict subset of the pro-ProgPow camp, and therefore the pro-audit group is by definition the largest group.   Legitimacy - When the “decision” was originally made, it mentioned an audit would take place, and that if any risks were discovered, they would be fixed. If you believe in the legitimacy of that decision, in order to be consistent with all of it, not just the part where we move forward with ProgPow, then you should support an audit. I said as much to @Arachnid on twitter yesterday.     twitter.com          👹 Ameen Soleimani (ameensol)     @nicksdjohnson @cyber_hokie @hudsonjameson @EthCatHerders Personally I disagree with the legitimacy of the decision and the governance process that made it, but if *you* think it was legitimate, then to be consistent you should see *all of it* as legitimate.  3:27 PM - 29 Mar 2019     4            Also here are some screenshots of the notes from the core devs calls.  1.jpeg568×1011 85.2 KB   2.png568×1011 204 KB   3.png568×1011 193 KB  All of you mention wanting to do an audit. And now your (@gcolvin) position is:  an audit will good to have, but I can’t see demanding one.  I don’t think this is a coherent position to have. I’ll repeat what I said in the OP:  I want to add that I still don’t support ProgPow even if the audit comes back clean, but I would much more willing to accept it if it didn’t feel reckless.  It seems that the fatigue over this issue is causing us to abandon the interest in the audit, but I don’t see any external pressure motivating the urgency of this decision. I maintain that we should not include ProgPow until an audit has been conducted. ",
                    "links": [
                        "https://twitter.com/ameensol/status/1111777587695501312",
                        "https://twitter.com/ameensol/status/1111777587695501312",
                        "https://ethereum-magicians.org/uploads/default/original/2X/9/9a2cabb9fe4cbade17045249d8a12eceb3771d50.jpeg",
                        "https://ethereum-magicians.org/uploads/default/original/2X/7/7346c6bc38fc155da3ba42d253b6479f64f2c1a7.png",
                        "https://ethereum-magicians.org/uploads/default/original/2X/d/d29753a0054b747d099d66d2bfcd14f98d34fd22.png"
                    ],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ajsutton",
                    "index": "43",
                    "likes": "2",
                    "time": "30/03/2019-21:54:02",
                    "content": "    ameensol:  It seems that the fatigue over this issue is causing us to abandon the interest in the audit, but I don’t see any external pressure motivating the urgency of this decision.   The main thing currently preventing an audit is a lack of funding for it. The more ProgPoW is looked into at a technical level the more people there are who are comfortable moving forward without an audit because they feel the scrutiny has been sufficient. For those wanting an audit the simplest way to get one is to contribute to funding it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.119047619047619
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/CryptoHokie",
                    "index": "44",
                    "likes": "2",
                    "time": "30/03/2019-22:14:20",
                    "content": "    ajsutton:  The more ProgPoW is looked into at a technical level the more people there are who are comfortable moving forward without an audit because they feel the scrutiny has been sufficient.   Can you point me to the available reviews by IC designers? I dont think a lot of the core devs sepcialize in this area, and we additionally want to see the the forecast or estimates into the likelihood of ProgPoW specialized hardware developing, that were supposed to be included as part of it. Additionally, the horse trade for the decision making was that implementation would occur but under the premise that an independent audit would be performed in support of a final go/no go status. This was to be coordinated by the Ethereum Cat Herders, and they have thus far done a good job organizing, but the funding problem has created delays. I don’t believe we, who were offered the audit in return for support for a decision, should be solely responsible for the funding that audit. I’ve contributed to the Gitcoin raise, however believe my money would have been more useful elsewhere such as ETH 2.0 clients, or FFG development, both of which provide mitigations for the risks associated with ASIC centralization anyway. As this proposal disproportionately benefits one interest group (GPU miners) and there has been virtually no demonstration of the pressing need for ProgPoW, I believe funding should come from the proponents or the Ethereum Foundation. As it was core devs who proposed the conditional terms of the decision to include such an audit. This is a change to the underlying PoW algorithm, and tech that many of the proponents lack expertise in, versus many other EIPs which had the luxury of many competent eyes from a large developer base on them (and still eleventh hour bugs were found). Ethereum does not have a similar electrical engineering/IC designer base. An independent audit seems like a prudent course of action to, at the very least, provide the appearance of appropriate due diligence on both the security, and the merit of the change. One of the driving rationales for the change is the commitment to ASIC resistance. One of the objectives of the audit is to demonstrate just that. Whether ProgPoW does in fact fulfill that objective or not. If it is identified in the course of the audit that it does not fulfill that objective, I believe the need for ProgPoW just be reassessed entirely. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6732718894009215
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "45",
                    "likes": "1",
                    "time": "31/03/2019-06:16:02",
                    "content": "    CryptoHokie:  Can you point me to the available reviews by IC designers   I don’t think there was any IC designers, but many people on the implementation team have sufficient hardware design expertise, especially an understanding of GPU internals, where I believe the concern on the mining algorithm side is met. The client implementations (again separate from the mining algorithm) were implemented and looked over between the client teams, core devs, implementors, etc. I believe an audit is warranted for the client code, as one small bug could cause a large disruption to the network, however I also feel as though there has been sufficient review where this may be considered largely unnecessary. But what’s $50k amongst friends? (Better than all those people missing something small I suppose).  The audit also proposes reviewing the technical credentials of the mining algorithm (the part outside of consensus that generates data for consensus to work). This would be handy, but risk is lower because this can be iterated on out-of-band and released to miners piecewise as they upgrade their rigs. They will not do this all at once therefore a risk of total network disruption is small. The audit may be beneficial to ensure code quality and obvious errors are caught, but that’s probably had a fair amount of review at this point and honestly running on a testnet is better. Run it for at least a month on Ropsten with significant enough mining occuring and that is good enough to understand how it works in practice.  Lastly, the audit will evaluate the claims that the algorithm has in terms of utilizing the whole GPU (minus FP functions and some other non-standard things), it’s suitability to the task, any inherent inefficiencies with particular devices, etc. This work has largely been done (ProgPoW Benchmarked, by a Ethereum Miner!). More benchmarking and the like couldn’t hurt, but data collection from the Ropsten testnet with the final draft software configurations is probably the best measure of fitness here. Perhaps those who already have done significant data collection can provide their findings to the auditors and reduce the scope of work there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.867243867243868
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tjayrush",
                    "index": "46",
                    "likes": "1",
                    "time": "31/03/2019-14:29:53",
                    "content": "EIP-1 should be modified to add a required section where the proposer of the EIP is asked to remark on the possible negative side-effects of his/her proposal. This won’t directly solve much, because of course, this type of analysis is nearly impossible, but it would give the Core Devs a way to easily reject EIPs. The problem with the way things currently work is that the Core Devs are put in a position of having to articulate concerns that the proposer of the EIP has neglected to address. What we want is any easy way for Core Devs to reject a proposal. Requiring a well-thought out defense of the idea in EIP-1 might provide a hook for them to do that. For example, we could add a section to the section called “What Belongs in an EIP.” We could change the words “Each EIP should have the following parts” to “Each EIP MUST have the following parts” and include “Thorough and convincing exploration of negative impacts of this EIP on the EcoSystem.” Things to be considered in this section might include ‘effect of the EIP on state size,’ ‘effect of this EIP on network propogation,’ ‘analysis of code complexity (effect on workload of core devs),’ ‘necessity of an audit or arguments in support of why it’s not required.’ We want to force people to do the security/cost analysis of their EIP themselves before they make a proposal, but mostly we need to provide an easy way for Core Devs for reject a proposal. “It’s not complete.” Unrelated: EIPs should enter ‘Rejected’ state after XXX months/weeks of inactivity or failing to become “Final”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.476190476190476
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "47",
                    "likes": "1",
                    "time": "31/03/2019-14:50:09",
                    "content": "    tjayrush:  necessity of an audit or arguments in support of why it’s not required   In general, just an assessment of the risks of implementing a proposal, how impactful to the network, etc. Audits are a part of a risk mitigation strategy where their cost may or may not be justified, and which can be mitigated through other activities (testing, peer review, demos, testnet operation). There should be an understanding of the strategy to validate the change before moving forward. Too often it’s an afterthought. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/cosminstefane",
                    "index": "48",
                    "likes": "1",
                    "time": "04/04/2019-11:04:13",
                    "content": "    ameensol:  ASICs do not represent an existential risk at this time, and I don’t understand the fear that ProgPow proponents have of ASIC manufacturers trying to impede PoS. Like, let’s say we start to see more miner centralization, and then they attack the PoS transition by not going along with the fork… who in their right mind would want be on the centralized miner chain instead of the PoS chain, or at least the PoW chain secured by PoS in the meantime?   I apologize in advance for what I am going to write, as I respect you and your opinions very much. I might not be as well informed as you are, but seems the move to POS will be done in stages. Even if POS will finalize the chain, we still need mining until full POS. POS + sharding, which even Vitalik seems to consider there might be a lot of undiscovered issues with, might experience a lot of delays, so that goal of reaching full POS, which personally I wait for a long time now, might be a few years away from us. If you think everything will go smooth, I will post how ASIC manufacturers and their customers think this should be done from gitter ProgPoW, as it seems I didn’t get an answer from Sonia and also most people maybe didn’t notice it.  image.png1216×135 19.2 KB  So, from their point of view, a decentralized network needs to negotiate with them the transition to POS, to be done “peacefully”. I am guessing, and extrapolating it using my logic, same ideas/attitude will apply to any future block reward reduction, and/or any other change that will affect their sales and their customers investment and ROI. While such radical ideas as Sonia’s can remain marginal when ASICs represent a low % of the network, and maybe even divided in the hands of many, the balance of power will change very fast when a few big entities will control most of the mining in ETH. And those entities will try to decide/interfere not only by mining, but rather they will use any mean necessary, as I feel they started to use now reg ProgPoW, to split the community over it. Wasn’t one of the goals of Ethereum and Ethash to prevent such threats and centralization from the beginning? As far as I can tell, most people supporting ProgPoW, including myself, have nothing against an audit. I actually feel this step is needed and it will help everybody who has doubts, who cannot spend all his day researching it, who cannot test or understand what this is about, to trust the result of the audit. But, I do have a problem with how everything has evolved until now, how we had 3 or 4 different grants, (I think two of them for WhiteBlock, which is not even in charge of the audit anymore), how everybody is confused (while actually being on gitter, on twitter, on discord, on github, on reddit, on whatever X is necessary to track the progress of it). And the last thing that happened, with Eric and Ewan suggesting to trade ProgPoW to miners, against a new issuance reduction for funding Ethereum developement, when the foundation has become even less transparent than before, I am starting to feel that small miners like myself, who mined for POS, who mined on loss during 80 USD, and barely can keep the rigs on now,  who spent time testing ProgPoW, who was against the chain split proposed by some trying to push for ProgPoW, who helps run nodes so people can connect to it for free (I do), are not welcomed and nobody cares about us. I also start to ask myself, big guys like you involved in Ethereum, called stakeholders lately, really any decision taken should satisfy each one of you? Plus the rest of the internet? Even ones that are not related to you at all? Miners really need to take each man out there and explain: why ASICs are bad, why we are on the verge of giving up mining ether, which will lead to centralization probably, why this is a even a threat to you, why the security of a chain is coming from the power consumption to attack it mainly, and not from hashrate. I am sorry, I feel all those are quite basic knowledge, hell, some of it are even found in ethereum white/yellow paper. And following the same logic, of satisfying everybody, who is taking our opinion into consideration? We did twitter polls (cannot even remember how many!), and it was YES, even after GPUShack tried to manipulate it,  we did coin voting, and it was YES, even after some big stake holders decided to vote with other people’s funds, we did hash voting, and it’s a YES. I also see the trend lately to consider mining and miners as being super highly dooper profitable. Please plug in a rig, or hell, at least please have a look over whattomine.com or any other source like https://www.coingecko.com/en/coins/ethereum/mining_calculator, and let’s discuss how “profitable” it is. So in the and, again, with all the respect I have for you, and using you to understand why this is needed for other people with no stake in mining or security of ETH chain,  why do we have to convince you, considering the just mentioned signals? You have a stake in mining? You have some other concern, leaving out the governance issue which seems to apply to this, but not other EIPs? Who will take OUR opinion into consideration? Who will satisfy us? So yes, we find our-self in a dead-end it seems. Same dead-end that might make POS transition harder, under current conditions, and much harder, under Linhzi’s conditions.         ",
                    "links": [
                        "http://whattomine.com",
                        "https://www.coingecko.com/en/coins/ethereum/mining_calculator"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2227918847321835
                }
            ]
        }
    ],
    "group_index": "777"
}