{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/remote-interactive-participation-at-the-council-of-berlin/667",
            "title": "Remote, interactive participation at the \"Council of Berlin\" ",
            "index": 667,
            "category": [
                "Happenings"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "2",
                    "time": "07/07/2018-10:09:50",
                    "content": "Here is what we need to decide RE: “interactive participation”:   the medium how to organize / announce the community channels the protocol for incorporating messages from the community channels into the Council discussion who can help with this at the event    The discussion has been ongoing, recently popping up in this Twitter thread (which started on a silly photo I posted): https://twitter.com/aalexis1234/status/1015491866152849408 Alison Emily tweet-replied:  Hey is it possible if the @EthMagicians is live streamed and interactive?  @jpitts tweet-replied:  There will be live streaming: https://ethereum-magicians.github.io/berlin-council/livestream/ We need to investigate how interactive will work. One approach is to make sure that working topics have a web presence, a temp chat room is created, the topic champion updates and monitors that room.  @boris tweet-replied:  I setup an EthMagicians Matrix room as listed on the livestream page so that questions can be relayed. There may be some remote presenters. Don’t have enough facilitators or infrastructure or experience for call-ins this time. Discussions will be technical in nature.  And then…  I have some ideas around ongoing live/interactive — eg a weekly or every other week “present my new EIP” video — but that will require commitment from more people volunteering. Role of @EthMagicians / needs of ETH community will evolve.  ",
                    "links": [
                        "https://ethereum-magicians.github.io/berlin-council/livestream/",
                        "https://ethereum-magicians.org/t/action-item-decide-on-the-medium-for-remote-interactive-participation/671"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2631118881118875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "2",
                    "likes": "0",
                    "time": "08/07/2018-18:11:12",
                    "content": "Pick the best options for real-time interaction. This is not for deciding, rather to see what the interest levels are in any particular solution.     Discord Rooms Google Hangouts/Chat Riot/Matrix Rooms Telegram Twitter w/ hashtag Don’t do this     0 voters     Show results   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.916666666666668
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "3",
                    "likes": "1",
                    "time": "08/07/2018-22:46:56",
                    "content": "Probably the most successful way to do this is to “ask for questions from the audience” at the points where questions are asked, and have someone watcg the chat room and ask aloud a small selection of those questions they believe to be important from the toom Otherwise, it will probably be too much to have people directly asking questions from online. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "4",
                    "likes": "0",
                    "time": "10/07/2018-17:46:53",
                    "content": "We might also consider this solution which we can integrate into our Discourse server:    GitHub    gdpelican/babble Discourse Shoutbox plugin. Contribute to gdpelican/babble development by creating an account on GitHub.       ",
                    "links": [
                        "https://github.com/gdpelican/babble"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/WithinCells",
                    "index": "5",
                    "likes": "1",
                    "time": "12/07/2018-09:28:04",
                    "content": "Are there any plans to make the community on reddit aware of the ability to follow / allow some participation in the discussion? Im conscious of the sensitivities of some topics and what may happen if part of the community dont feel informed / included. That said, Im also conscious of people who arent really looking to contribute to discussions positively. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.877272727272728
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "6",
                    "likes": "0",
                    "time": "13/07/2018-11:45:11",
                    "content": "The EIP processes happen on GitHub with informational discussion here, and I guess EthResearch too. I don’t think Reddit is part of the technical discussions around EIPs. @Arachnid is likely going to give us an overview of EIP processes first thing Saturday. Does that make sense? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                }
            ]
        }
    ],
    "group_index": "1389"
}