{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/how-to-get-community-involvement-in-your-magicians-ring/2214",
            "title": "How to get community involvement in your Magicians' Ring ",
            "index": 2214,
            "category": [
                "Process Improvement"
            ],
            "tags": [
                "participation"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "3",
                    "time": "14/12/2018-06:38:00",
                    "content": "I wanted to get some feedback on this idea I had, what do you think about having a single page on the wiki which can help volunteers find tasks and mini-projects they can work on? This list would be broken down by Ring or upcoming Gathering, and indicate who to contact, plus allow an indicator of when a task has been picked up by someone. Example:   Wonderful Things You Can Do To Help Out  Operations Ring Tasks Contact: @jpitts Mini Project: “Gather Rings and Contacts from Prague” In a HackMD, list out all Rings and other groups who gathered in Prague, see if any are not listed in the Scrolls or in the Forum under Working Groups. Reach out to those involved in unrepresented Rings from Prague and see if they want to keep it going here on the Forum or organize in upcoming events. Help these Rings get formed. Council of Paris Tasks Contact: @tomislavmamic Mini Project: “Rings In Paris” Reach out to each of the Ring contacts listed in the wiki and see who is likely to gather in Paris, and what they might need. Create a wiki topic on the Forum listing these Rings and Contacts out. See notes from a recent call: Council of Paris meeting notes - HackMD ",
                    "links": [
                        "https://ethereum-magicians.org/t/community-list-of-shit-to-do-google-doc-of-chores-tasks-things-to-be-done/535/26"
                    ],
                    "GPT-summary": "The author is seeking feedback on their proposal to create a single page on the wiki to help volunteers find tasks and mini-projects they can work on, broken down by Ring or upcoming Gathering, and indicate who to contact, plus allow an indicator of when a task has been picked up by someone. The post includes examples of tasks and mini-projects for two Rings. The author is asking for feedback on this idea, and a 3rd party could provide constructive criticism on how to improve the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.177154195011338
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AtLeastSignificant",
                    "index": "2",
                    "likes": "2",
                    "time": "14/12/2018-18:29:38",
                    "content": "Would be nice if we could integrate it with this: Community list of \"shit-to-do\" - Google doc of chores, tasks, things to be done ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "3",
                    "likes": "0",
                    "time": "14/12/2018-18:55:53",
                    "content": "Yeah I should start with updating this doc, get the Rings to update it too, then find ways to promote/position it prominently. I am finding that there is a general issue with “findability” of key resources, so also thinking about how to improve that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "4",
                    "likes": "4",
                    "time": "14/12/2018-20:08:23",
                    "content": "I still think teaching people how to use Github Issues is the right way to go. We need flow and movement on issues – not another list. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "5",
                    "likes": "1",
                    "time": "14/12/2018-20:33:39",
                    "content": "That is a good point, and we can encourage a nice feedback loop. A lot of it is visibility I think, and forming habits. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "6",
                    "likes": "0",
                    "time": "15/12/2018-10:39:39",
                    "content": "It definitely requires some pushing and poking + communications (@jpitts good to see that you have picked up the github issue on a welcoming post into the magicians) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "7",
                    "likes": "0",
                    "time": "18/12/2018-08:47:40",
                    "content": "I created a larger project for energizing the Rings. https://github.com/ethereum-magicians/scrolls/projects/5 Much of the project involve reaching out to Ring contacts, helping RIngs use the Issues, and bringing attention to “pickup tasks” with a special GH page which is promoted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.928571428571429
                }
            ]
        }
    ],
    "group_index": "596"
}