{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/sermantic-versioning-for-the-protocol-with-release-candidates/2493",
            "title": "Sermantic versioning for the protocol, with release candidates ",
            "index": 2493,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "core-devs",
                "forks",
                "consensus-protocols"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "3",
                    "time": "21/01/2019-16:48:40",
                    "content": "From my comment in the  Jello Paper discussion:    Jello Paper as Canonical EVM Spec   One notion that I arrived at is that the protocol should itself have semantic version, and that its component parts, i.e. the EVM, consensus, RLP, JSON-RPC, each should have semantic versions. Within their various contexts, the versioning changes would have different meaning. Semantic Versioning 2.0.0 Ethereum protocol would increment MAJOR when the update to any of its components leads to a fork. EVM would increment MAJOR only if the update leads to incompatibility or security vulnerability (given contract development norms). MAJOR version increments in EVM is similar to a new series in microprocessors. But MINOR version increments in the EVM would lead to a MAJOR increment at the protocol level.   And regarding “release candidates”, copying my comments from AllCoreDevs gitter here:  Protocol updates could follow the practice of “release candidate” within the semantic numbering scheme. And these clever release names, this is over-arching for the upgrade initiative and sticks once it stabilizes on mainnet. Constantinople is what you are attempting to get mainnet to. So what you attempted to release was ethereum-8.0.0-rc1, released to the testnets and prepared for mainnet. An issue was found, therefore rc1 was aborted. The main network remains at ethereum-7.x.x. Now you proceed with ethereum-8.0.0-rc2, first on ropsten, etc, and then attempt to release to mainnet. The “release candidate” approach allows you to keep attempting to get from 7.x.x to 8.0.0, by incrementing the x in 8.0.0-rcx. It allows you to not have to worry about the name, which is marketing and communication to the wider community. Once a stable rc-x happens on mainnet, well, IMO that is what becomes “Constantinople”  ",
                    "links": [
                        "https://ethereum-magicians.org/t/jello-paper-as-canonical-evm-spec/2389/23",
                        "https://semver.org/",
                        "https://gitter.im/ethereum/AllCoreDevs?at=5c45f1c19bfa375aab38ddc0",
                        "https://ethereum-magicians.org/t/eip-233-formal-process-of-hard-forks/1387/8"
                    ],
                    "GPT-summary": "The author proposes that the Ethereum protocol should have semantic versioning, and its components should have semantic versions. The post explains how versioning changes would have different meanings within their various contexts. The author also suggests that protocol updates could follow the practice of \"release candidate\" within the semantic numbering scheme. The post also includes comments from the author on the \"release candidate\" approach. The post does not advertise the proposal, nor does it contain entirely positive or negative feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.353729603729604
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "2",
                    "likes": "0",
                    "time": "21/01/2019-19:01:59",
                    "content": "Here’s a gist depicting what the versions of the protocol would look like, only a sketch. The rc1 and rc2 of Constantinople should have notes about which testnets they were released to, accurate representation of EIP changes, etc. https://gist.github.com/jpitts/4c541a4efa2f8872ce9acf63da5c4921 ",
                    "links": [
                        "https://gist.github.com/jpitts/4c541a4efa2f8872ce9acf63da5c4921"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/axic",
                    "index": "3",
                    "likes": "0",
                    "time": "21/01/2019-21:02:04",
                    "content": "A similar proposal was made back here: https://github.com/ethereum/EIPs/issues/178 It comes with some differences:  only considers EVM, because of this goes well with https://github.com/ethereum/EIPs/issues/154, only uses major/minor in order to save space  ",
                    "links": [
                        "https://github.com/ethereum/EIPs/issues/154",
                        "https://ethereum-magicians.org/t/jello-paper-as-canonical-evm-spec/2389/30"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/axic",
                    "index": "4",
                    "likes": "1",
                    "time": "21/01/2019-21:05:46",
                    "content": "Because it only considers the EVM, the versions are a bit different - as an example the “DAO fork” doesn’t have a version. Another question to consider if it is only for the EVM whether gas changes warrant a major version bump. Before gas changes (Spurious Dragon?) were added, it seemed as if gas cannot be changed. After that point though it felt like gas values cannot be relied on and are not to be considered a constant in contract development. If gas costs are not considered, the version table looks quite differently. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.052083333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "5",
                    "likes": "0",
                    "time": "21/01/2019-21:13:37",
                    "content": "Thanks for the reference! I think that this could be used for advancing the version of the EVM component in a way that dapp developers can understand. Also it can inform how other protocol components might be versioned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "6",
                    "likes": "0",
                    "time": "23/01/2019-08:51:37",
                    "content": "It should be noted that in version 0.4.21, Solidity itself began to allow for the targeting of an EVM “version”. Do developers have a difficult time knowing which EVM-related EIPs are included in these code-named releases?  you can now specify which EVM version the contract should be compiled for. Valid values are “homestead”, “tangerineWhistle”, “spuriousDragon”, “byzantium” (the default) and “constantinople”. Depending on this setting, different opcodes will be used in some cases. The only place where this is currently used by default is that all gas is forwarded with calls starting from “tangerineWhistle” (in homestead, some gas has to be retained for the  call  opcode itself). Also, the gas estimator reports different costs for the opcodes depending on the version and thus the optimizer might generate different code.     GitHub    ethereum/solidity Solidity, the Contract-Oriented Programming Language - ethereum/solidity      ",
                    "links": [
                        "https://github.com/ethereum/solidity/releases/tag/v0.4.21"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "7",
                    "likes": "0",
                    "time": "23/01/2019-08:57:33",
                    "content": "FYI, I updated the gist of the protocol releases and EIPs in each. https://gist.github.com/jpitts/4c541a4efa2f8872ce9acf63da5c4921 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "655"
}