{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/scriptable-erc721/6853",
            "title": "Scriptable ERC721 ",
            "index": 6853,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "erc-721"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/wuminzhe",
                    "index": "1",
                    "likes": "0",
                    "time": "13/08/2021-01:23:07",
                    "content": "I don’t know if there is already a similar work in progress, if so please let me know. The current erc721 is static. I think erc721 can be dynamic. This can be done by supporting script.  the creator writes the script, so the creator can control how NFT behaves. once the NFT is minted, the script can’t be modified. some parameters in the script can be modified by the NFT owner. multiple script type support, such as p5js, raphael, etc.  Below is an example of how to extend the ERC721: interface ERC721Scriptable { \tevent ParamsUpdated(uint256 indexed tokenId, string oldParamsURI, string newParamsURI); \tfunction scriptType() external view returns (string); \tfunction scriptURI(uint256 tokenId) external view returns (string); \t// hash result of params, protect params from being modified \tfunction paramsHash(uint256 tokenId) external view returns (bytes32); \tfunction paramsURI(uint256 tokenId) external view returns (string); \tfunction updateParamsURI(uint256 tokenId, string paramsURI) external; }  A p5js script example function setup() {   createCanvas(400, 400);   background(200/*{bgcolor}*/);    ellipse(200, 200, 80/*{ellipse1}*/, 80/*{ellipse2}*/);   text('world'/*{title}*/, 10, 30); }  The params example of the above script { \t\"bgcolor\": 100, \t\"ellipse1\": 60, \t\"ellipse2\": 60, \t\"title\": \"hello world\" }  ",
                    "links": [],
                    "GPT-summary": "The author proposes a dynamic version of ERC721 by supporting scripts. The author provides an example of how to extend ERC721 and how to use a p5js script. The author also suggests that the NFT owner can modify some parameters in the script. The post does not advertise the proposal, nor does it ask for collaboration.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.288461538461538
                }
            ]
        }
    ],
    "group_index": "1413"
}