{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/distributed-magicians-force/2156",
            "title": "Distributed Magicians Force ",
            "index": 2156,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "1",
                    "likes": "0",
                    "time": "07/12/2018-23:14:17",
                    "content": "The creation and existence of Bitcoin was living proof that the vision of a decentralised internet was possible. Many of us have since been recruited into the fold of the Ethereum community with a fierce belief in wanting to help create the future that we crave. Digital liberty. Fairness and equality. Decentralisation. Self sovereignty. Web3 is not only a technological movement but a social one. How can we bring these values out into the public world? The recent 2017 crypto price phenomenon brought the awareness of web3 to a lot of people. A lot of people were attracted for many reasons. Many for $$$ but also many who realised the need for a decentralised internet. It was also something outside of reason and outcome of our own control. How can we generate a world wide interest and awareness for the mission of web3 while representing it in a respectable manner? We have an army of web3 believers all around the world, almost like a decentralised guerilla force. How can we align this distributed army around the world and help coordinate to drive forward the web3 mission on our own terms? I know this doesn’t help the under-privledged who actually really need web 3.0 atm but it may do so via greater global awareness especially with governmental bills. And with laws such Australian’ anti encryption bill that was recently passed, we might need web3 far quicker than we thought we would have needed it. Ethereum 2.0 may just be the Zimmerman’s PGP 1.0 of this era. Where do we want the world to be with web3 and what is the warpath to get there? How are we aligned? How do we coordinate and communicate? What is the first big assignment we aim to tackle? food for thought, just having some conversations around this ",
                    "links": [],
                    "GPT-summary": "The post discusses the need for a decentralized internet and how the Ethereum community can bring its values to the public world. The author asks questions about how to generate worldwide interest and awareness for the mission of web3 and how to align and coordinate the distributed army of web3 believers. The post also mentions the recent Australian anti-encryption bill and the need for web3.0.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.9006410256410255
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/PaulRBerg",
                    "index": "2",
                    "likes": "0",
                    "time": "07/12/2018-23:51:57",
                    "content": "You asked a hotchpotch of questions no one has a clear answer to and probably won’t have for a long time. Still, here’s my shot at trying to shape some arguments:     pet3rpan:  How can we generate a world wide interest and awareness for the mission of web3 while representing it in a respectable manner?   Build stuff people want. This is tricky because you just cannot beat a business-level UX. It might be that a relatively large portion of the population will never even want to become self-sovereign, they will just trust and continue to trust no matter what other people and institutions.     pet3rpan:  How can we align this distributed army around the world and help coordinate to drive forward the web3 mission on our own terms?   This is a question with a manifold of possible answers. Somehow by definition, this distributed army is free to operate under their own terms, although there should be a common set of core beliefs, i.e. we strongly believe in meritocracy. Practically speaking, educational events are highly needed nowadays in places where the blockchain echo chambers haven’t reached yet - we might want to invest and spend our time on that.     pet3rpan:  Where do we want the world to be with web3 and what is the warpath to get there?   Not actually answering this, but I strongly oppose the “warpath” nomenclature. Whatever is that we want to achieve, it can be done in peace. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9737351190476184
                }
            ]
        }
    ],
    "group_index": "580"
}