{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/how-will-shards-interact-on-eth-2-0/4911",
            "title": "How will shards interact on ETH 2.0? ",
            "index": 4911,
            "category": [
                "Sharding"
            ],
            "tags": [
                "consensus-layer"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Hikari",
                    "index": "1",
                    "likes": "1",
                    "time": "04/11/2020-22:04:18",
                    "content": "Hello. I had read about ETH 2.0, and am still unable to understand how shards will work. I see that Beacon blocks will have a reference to latest known block of each shard and each shard blocks will have the same for Beacon. I suppose that’s used so that a Beacon block indicates the state it recognizes and uses on each shard. But how exactly will shards interact? In example. Say that somebody wanna create TokenA. Will he be able to choose on which shard the creation tx will be commited? And once it’s done, will TokenA balance on all address be stored to that shard, or will we be able to move some balance to other shards? If we wanna swap TokenA which is on shard1 for TokenB that’s on shard3, how will that happen? Using atomic swap? And how about features like liquidity pools. If a smartcontract deployed on shard5 wanna use a pool on shard11, how will it happen? Sorry for so many questions and tnx for any answer  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/alwintech",
                    "index": "2",
                    "likes": "0",
                    "time": "12/11/2020-11:56:09",
                    "content": "Ethereum 2. 0 Shard Chain Shard chain in ethereum 2.0 store and process transactions. These shard chains are an important part of increasing the number of transactions ethereum can handle per sec. As per official beacon chain statement, Ethereum 2.0 will support 1024 Ethereum shard chains, each of which will be secured by a committee size of 128 validators. It is also important to note that transactions are only executed and validated within a shard, and that state is only stored at the shard level. These beacon chains to make sure every shard has the most up-to-date data with the help of validators who communicate the state of shard chains to the beacon chain. Like, this shard chain helps the network enhance performance in transactions scalability and securities. To know more about Ethereum 2.0 details, visit our blog now @ https://alwin.io/blog/ethereum-2.0-notes-for-beginners Looking for start your own DeFi or staking platform in Ethereum visit us today! ",
                    "links": [
                        "https://alwin.io/blog/ethereum-2.0-notes-for-beginners",
                        "https://alwin.io/blog/ethereum-2.0-notes-for-beginners",
                        "https://alwin.io/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.638888888888888
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Hikari",
                    "index": "3",
                    "likes": "0",
                    "time": "12/11/2020-15:55:36",
                    "content": "I think it was reduced from 1.024 to 128 shards. Still, it doesn’t explain how shards will interact as I asked.     Hikari:  In example. Say that somebody wanna create TokenA. Will he be able to choose on which shard the creation tx will be commited? And once it’s done, will TokenA balance on all address be stored to that shard, or will we be able to move some balance to other shards? If we wanna swap TokenA which is on shard1 for TokenB that’s on shard3, how will that happen? Using atomic swap?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                }
            ]
        }
    ],
    "group_index": "1181"
}