{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-1167-minimal-proxy-contract-moving-to-last-call/936",
            "title": "EIP-1167 - minimal proxy contract - moving to LAST CALL ",
            "index": 936,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/yarrumretep",
                    "index": "1",
                    "likes": "4",
                    "time": "02/08/2018-13:56:09",
                    "content": "Greetings Wizards! We have been working EIP-1167 (https://github.com/ethereum/EIPs/blob/master/EIPS/eip-1167.md) through the process.  To date we have had few comments directly, but we do have several users of this code in production.   While not ground breaking, we believe a standard for this will allow third party tools to provide better user experience for contracts that implement hard-wired proxies. We are planning on submitting a PR to move the EIP to LAST CALL status today with a two week comment period per the EIP process.  Please feel free to weigh in on the discussion on EIP gitter, here, or on the github issue created for that purpose (https://github.com/optionality/clone-factory/issues/10). Best, pete ",
                    "links": [
                        "https://github.com/optionality/clone-factory/issues/10",
                        "https://ethereum-magicians.org/t/last-call-on-eip-1167/944/2"
                    ],
                    "GPT-summary": "The author of EIP-1167 is announcing that they are moving the proposal to LAST CALL status and inviting feedback from the community. They mention that they have had few comments directly, but several users are already using the code in production. They believe that a standard for this proposal will allow third-party tools to provide better user experience for contracts that implement hard-wired proxies. The author invites the community to weigh in on the discussion on EIP gitter, Github, or in the comments.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Community and engagement",
                        "None",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.7727272727272725
                }
            ]
        }
    ],
    "group_index": "1752"
}