{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/thread-to-begin-discussing-ethereum-1-0-proposals/1768",
            "title": "Thread to begin discussing \"Ethereum 1.0\" proposals ",
            "index": 1768,
            "category": [
                "Working Groups",
                "Ethereum 1.x Ring"
            ],
            "tags": [
                "ethereum-roadmap",
                "eth1x"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "5",
                    "time": "01/11/2018-09:59:37",
                    "content": "In light of the amazing conversation that the community had around the subject of Ethereum 2.0 and its roadmap, I would like to propose a Ring / category for the current improvement proposals across clients on mainnet e.g. Ethereum 1.0. Are there folks who would collect around such a ring? Probably there are quite a few! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.486111111111112
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "2",
                    "likes": "0",
                    "time": "01/11/2018-10:38:01",
                    "content": "And in a way All Core Devs is the original ring around this, so this would be a category here on the forum where those who normally would be on All Core Dev calls and other stakeholders would discuss EIPs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "3",
                    "likes": "2",
                    "time": "02/11/2018-10:58:17",
                    "content": "The Security Ring (#working-groups:security) is talking about some of the execution layer plans for the near and far term, including the transition to eWASM. Further information here: Ethereum Backend Discussion ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/bobsummerwill",
                    "index": "4",
                    "likes": "2",
                    "time": "02/11/2018-15:47:04",
                    "content": "Yes, there is a very real need for this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/latrasis",
                    "index": "5",
                    "likes": "0",
                    "time": "04/11/2018-19:50:13",
                    "content": "Hi Bob! Do you think anyone be interested to read on a proposed security protocol? Current whitepaper ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "6",
                    "likes": "0",
                    "time": "13/11/2018-03:51:48",
                    "content": "@latrasis, this message probably belongs in a DM to Bob! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "7",
                    "likes": "2",
                    "time": "13/11/2018-04:00:06",
                    "content": "According to the tweet by Ben Edgington entitled “Get your Ethereum 2.0 fix here”:  Proposals to evolve Ethereum 1.0 are being grouped under the name “Ethereum 1.x”. There are working groups forming! Er, where?  Reducing state size growth Implementing eWASM in some form Benchmarking framework for evaluating performance proposals   EIPs / proposals out be the end of this month? WOW   From the Google Doc “What’s New In Eth2”:  image.png1262×726 61.6 KB  ",
                    "links": [
                        "https://docs.google.com/document/d/1oMi-0ZbCD5SdBtMxtHC5gaiflX8MnXGF1_Nk-_gGIUI/edit",
                        "https://ethereum-magicians.org/uploads/default/original/2X/b/b08f7f762c20f4f45d80a934bbf822188205dd2a.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.590909090909091
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "8",
                    "likes": "1",
                    "time": "13/11/2018-05:04:13",
                    "content": "Thanks for continuing to curate this, @jpitts. I also wonder where / how one gets involved with working groups. Would be good to list them and have a repo or channel or somewhere where people can knock on the door to find out more and get involved. I’ve started on drawing diagrams of the Ethereum system – decomposing the entire Ethereum client and some of its specifications. See https://docs.google.com/presentation/d/1UDW1KsNc5w8xaFLWaisn_ZFqWcflZHWs-_FUpDq_2kk/edit#slide=id.p Relevant for this thread is one suggestion that could get us not to eWASM, but rather to an LLVM integration that means we can support the end goal of eWASM much more quickly, AND not have to throw out or migrate existing smart contract code. It would be forward compatible.  Ethereum System Diagrams.png960×540 44 KB  @lrettig where’s the best place to have this LLVM discussion? @fubuloubu wasn’t it someone from Trail of Bits who had started work on this? Can you connect us? ",
                    "links": [
                        "https://ethereum-magicians.org/uploads/default/original/2X/6/61b4ed5c8c5344ef26dbaacf92d22af882843959.png",
                        "https://ethereum-magicians.org/t/ethereum-1-dot-x-a-half-baked-roadmap-for-mainnet-improvements/1995/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.137566137566138
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "9",
                    "likes": "0",
                    "time": "13/11/2018-05:14:31",
                    "content": "cc @dguido I believe it was more a chat and general agreement on an LLVM backend that produces EVM code being a great approach for the medium term. Personally, I’d love to move that chart such that Vyper can use LLVM for optimization stages.  Edit: P.S. was gathering a working group on this… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8500000000000005
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "10",
                    "likes": "0",
                    "time": "13/11/2018-05:19:37",
                    "content": "Yeah, I was trying to draw it as current state. LLVM is good at optimization so would just mean writing an LLVM backend for Vyper rather than doing the work of creating the bytecode, I think? Maybe we should put it on the agenda for the EVM Evolution community call? I’ll link back to this here from the call agenda and we’ll cover it if there is interest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.484375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "11",
                    "likes": "0",
                    "time": "13/11/2018-05:23:27",
                    "content": "Maybe. I was considering it separately, including in the same chat as Yul, LLL, and all the other IRs that exist out there. Defining the optimization and security goals of the IR, best path(s) to get there, what the tradeoffs are, etc. EVM stuff is one layer lower, so that was going to be a separate discussion as I had planned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "12",
                    "likes": "2",
                    "time": "13/11/2018-05:25:22",
                    "content": "OK. I kind of think they are all inter-related, and not talking across layers is one of the issues in the first place. MOAR DISCUSSION. (also doing!) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.354166666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "13",
                    "likes": "0",
                    "time": "13/11/2018-05:38:39",
                    "content": "I know, it’s more of a practical thing. There’s already like 10 plus in each discussion. A lot of people in security community are interested in being included in this discussions, as they should. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "14",
                    "likes": "0",
                    "time": "13/11/2018-05:48:48",
                    "content": "P.S. @karalabe I think is involved in the state and block growth discussions? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dguido",
                    "index": "15",
                    "likes": "3",
                    "time": "13/11/2018-18:40:20",
                    "content": "Hey Boris, Yes, we have a detailed plan to implement a system similar to what you describe. We have worked on many compilers before, and about 1/3 of our company works on LLVM daily. I think the best approach would be a purpose-built machine-level IR for optimal EVM generation, let’s call it “EIR” for Ethereum IR. We have a high level spec for what this IR would look like, and it would enable us to create an efficient backend for EVM. It would include gas cost information and low-level memory layout information. I think it is just as important to consider building a frontend for Solidity, Vyper, or other languages in LLVM. Similar to Swift, we would probably want a high-level IR (not YUL) before handing it off to the rest of LLVM. For example, it would include accurate types, a CFG, and be in SSA form. Let’s call this one SOLIR for “Solidity IR.” We have rapidly prototyped an IR that meets the frontend specifications we need inside Slither, an Ethereum static analyzer. It is still evolving and lacks, for instance, SSA but given a few more weeks of work it would be an acceptable IR to ease and enhance integration of Solidity, Vyper, and other languages into a modern compiler like LLVM. You can find details about it here: https://github.com/trailofbits/slither/wiki/SlithIR. You’ll note we already have working code and it correctly translates all Solidity available on Etherscan. Adding support for translating Vyper or LLL to this IR would only be a ~2-4 week process. We have specs for our entire approach (frontend and backend) and want to begin working on it, however, we received no response after submitting a proposal to the Ethereum Foundation and, therefore, expect that our proposal for compiler development is no longer under consideration. We would still like to pursue this project because we think it’s the most important need for the Ethereum community to mature its software development process. Let me know if you’d like to chat elsewhere. I can be reached at dan@trailofbits.com. -Dan ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.192857142857143
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "16",
                    "likes": "1",
                    "time": "13/11/2018-19:30:23",
                    "content": "Hey Dan – this sounds great. I’ll send you a note by email. I think there are a number of people who believe in an LLVM approach. So there is a mix of rallying people around this as a direction, coordinating on moving forward, and getting grants / funding / sponsorship to do the work. Our broad label for related work is EVM Evolution, and outside that, this ETH 1.x roadmap (which really is more like – let’s keep shipping new stuff iteratively) is how we move forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.24905303030303
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "17",
                    "likes": "0",
                    "time": "14/11/2018-01:23:06",
                    "content": "How did you submit this to the Ethereum Foundation? It is the client developers, tool makers, and the the wider community to decide on a proposal like this.     dguido:  We have specs for our entire approach (frontend and backend) and want to begin working on it, however, we received no response after submitting a proposal to the Ethereum Foundation and, therefore, expect that our proposal for compiler development is no longer under consideration. We would still like to pursue this project because we think it’s the most important need for the Ethereum community to mature its software development process.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "18",
                    "likes": "1",
                    "time": "14/11/2018-01:25:21",
                    "content": "I think he meant a grant proposal. But yes – @dguido the Ethereum Foundation doesn’t decide technical direction of the ecosystem. “We” get to work together and build what we find is valuable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "19",
                    "likes": "0",
                    "time": "14/11/2018-01:59:06",
                    "content": "I see, this is a very interesting proposal and nudges me to learn more about compiler details and LLVM! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.1875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "20",
                    "likes": "0",
                    "time": "19/11/2018-16:23:19",
                    "content": "@dguido This is, of course, very interesting to me.  Can you post a link to the grant proposal? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "21",
                    "likes": "1",
                    "time": "23/11/2018-18:05:56",
                    "content": "A group of individuals has been meeting to discuss “Ethereum 1.0”. This group may be seen as All Core Devs, but its composition seems to be not fully representative and includes other stakeholders not generally associated with All Core Devs. For now, I will call this particular initiative “Ethereum 1.x”. The existence of this group has been known to a number of people in the community who chose not to participate (I will soon write up details in a disclosure). Ethereum 1.x now has been more or less officially confirmed by participants on today’s All Core Devs call #50. Unofficial “leaked” notes from the Ethereum 1.x proceedings:   docs.google.com    Notes: DevCon Eth 1.x and 2.0 Meetings Notes: DevCon Eth 1.x and 2.0 Meetings  Hey all, here are Dan Heyman'snotes from the meetings over the last week. I know I missed bits so please feel free to add. Also, I definitely missed people in the attendee lists. Not everyone made it onto the...      CoinDesk article by @rachel-rose:    CoinDesk – 23 Nov 18    Ethereum Developers Are Quietly Planning an Accelerated Tech Roadmap - CoinDesk Internal documents show that ethereum developers are privately planning strategies to more aggressively advance the world's third-largest blockchain.      ",
                    "links": [
                        "https://docs.google.com/document/d/1IB3oKuH5mryyhmVHE9r3aR6bK2pJCoJgAtiCYTEieh4/edit",
                        "https://docs.google.com/document/d/1IB3oKuH5mryyhmVHE9r3aR6bK2pJCoJgAtiCYTEieh4/edit",
                        "https://docs.google.com/document/d/1IB3oKuH5mryyhmVHE9r3aR6bK2pJCoJgAtiCYTEieh4/edit",
                        "https://www.coindesk.com/ethereum-developers-are-quietly-planning-an-accelerated-tech-roadmap",
                        "https://www.coindesk.com/ethereum-developers-are-quietly-planning-an-accelerated-tech-roadmap"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.634615384615385
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "22",
                    "likes": "1",
                    "time": "24/11/2018-07:07:12",
                    "content": "Epic breakdown of Ethereum 1.x by @cdetrio:     Ethereum 1 dot X: a half-baked roadmap for mainnet improvements Primordial Soup       Ethereum 1 dot X: a half-baked roadmap for mainnet improvements I’m posting this without any prior review or draft feedback from other core devs. This is my personal perspective on what 1.x is about. All mistakes and misrepresentations are my fault.  Summary Ethereum 1.x is a codename for a comprehensive set of upgrades to the Ethereum mainnet intended for near-term adoption. The 1.x set of improvements will introduce major, breaking changes to the mainnet, while 2.0 (aka Serenity) undergoes pro…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0375000000000005
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "23",
                    "likes": "2",
                    "time": "28/01/2019-06:08:19",
                    "content": "    jpitts:  How did you submit this to the Ethereum Foundation? It is the client developers, tool makers, and the the wider community to decide on a proposal like this.   This is a bad bind for low-level development.  It’s difficult to build wide consensus around a proposal that hasn’t been implemented, but difficult-to-impossible to implement such a proposal without financial support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.7
                }
            ]
        }
    ],
    "group_index": "493"
}