{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/1-ethproduct-community-call-video-notes/2060",
            "title": "#1 ETHProduct Community Call (Video + Notes) ",
            "index": 2060,
            "category": [
                "Working Groups",
                "Product Management Ring"
            ],
            "tags": [
                "community-call"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "1",
                    "likes": "8",
                    "time": "29/11/2018-02:40:52",
                    "content": "Agenda:  Web3 open source PMs vs traditional web 2.0 PMs Coordination vs management Leaner iterative dev cycles  Outcomes  Agreed that a web3 open source coordination play book may be potentially be really interesting Open up community office hours for product managers to help teams and project out? How to get more product managers involved in hackathons? Provide project planning and facilitation services? Pet3rpan is looking to interview product managers in the web3 space  Attendees:  Pet3rpan (Zed Software + Tenzorum) Yalor (Giveth + DappNode) Greg Wong (Cipher) Tim Beiko (Pegasys) Chris Remux (ENS) Cem F (Horatii) Aidan (Chainsafe)  Video:  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Annavladi",
                    "index": "3",
                    "likes": "0",
                    "time": "29/11/2018-17:42:15",
                    "content": "hey guys great disucssion, sorry i missed it. so I have been working on some “as is” interview doc that we can test run to see if we can capture “as is” comms and organization situtation.  I feel that till we know where we are , its hard to make improvements. So here are my initial thoughts and I will try to test run at in the next few weeks with few devs to get feedback early and re-iterate. Here it is, these are tactical next steps to do.  Schedule 30min converstaion remote or F2F to collect answers and collate/distribute. We are doing a grass root assessment of what type of organizational support is required for core devs, so that we do not create beurocracy, and provide value and ease their jobs in terms of communication and organization. With that we would like to go through some basic questions to understand what is done now and how devs communicate and organize today, where pain points are and where we can help. At the same time we want to make sure that support people are in no way inferior to the core devs and everyone is treated with respect that everyone deserves.  What forms of communications are used?  (Email, text, forums, chats)  What tools or applications are used?  (Telegram, skype, what’s up, signal, slack, reddit etc)   Does the comm channel change depending on the type of the comms?   What do you like and not like about the current process of comms?   What would you change? How?   How often are dev core meetings?   Are you happy how they are organized?   What would you change?   We have a team of volunteers willing to help core devs with organization and comms, where do you think they would add most value?   One of the proposed solutions: Would it be helpful to organize a ring of Comms and Org people that you know that you can always pull into various meetings to collect notes, organize and disburse comms etc?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.460648148148149
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "4",
                    "likes": "2",
                    "time": "29/11/2018-19:52:23",
                    "content": "Nice! I am planning to do this myself too! Calls already scheduled for next week - looking forward to what you learn as well  Will create some sort of repo to collect this… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.34375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jamesyoung",
                    "index": "5",
                    "likes": "1",
                    "time": "03/12/2018-04:09:55",
                    "content": "Catching up on the discussion. In terms of playbook, I found Accelerate to have a great break down of objective metrics that define excellent organizations. For a more illustrative narrative on software development, The Phoenix Project is an easy, fast and illuminating read. It is an homage to The Goal. In the evolution of decentralized/remote teams, ongoing improvement is more important than ever! ",
                    "links": [
                        "https://itrevolution.com/book/the-phoenix-project/",
                        "https://www.amazon.com/Goal-Process-Ongoing-Improvement/dp/0884270610"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.188888888888889
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "6",
                    "likes": "1",
                    "time": "03/12/2018-04:11:03",
                    "content": "    jamesyoung:  The Goal   Thank you for the suggestions! Just bought in paperback. Gonna be wholesome christmas reading material. For anyone else learning more about product management, I’d also recommend: Inside Intercom (listen to most of the episodes from the beginning and have learnt the most out of any podcast I have touched) & This is Product management (began listening to this more recently, not as good as inside intercom but definitely some good episodes in the mix) ",
                    "links": [
                        "https://www.thisisproductmanagement.com/",
                        "https://ethereum-magicians.org/t/interviews-on-product-management-in-the-web3-open-source-ecosystem/2129"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.678571428571428
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Eric",
                    "index": "7",
                    "likes": "1",
                    "time": "05/12/2018-23:59:26",
                    "content": "@jamesyoung great suggestion I’m going to read up on those soon. Currently reading Inspired and I’ve found it very learning as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                }
            ]
        }
    ],
    "group_index": "560"
}