{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-3300-phase-out-refunds/5434",
            "title": "EIP-3300: Phase out refunds ",
            "index": 5434,
            "category": [
                "EIPs"
            ],
            "tags": [
                "council-of-prague",
                "evm",
                "eip-3300",
                "selfdestruct",
                "refund"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "1",
                    "likes": "0",
                    "time": "27/02/2021-00:35:25",
                    "content": "  github.com/ethereum/EIPs         Phase Out Refunds   ethereum:master ← wjmelements:phase-out-refunds            opened 12:31AM - 27 Feb 21 UTC               wjmelements             +66 -0           ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pull/3300",
                        "https://github.com/wjmelements",
                        "https://github.com/ethereum/EIPs/pull/3300/files",
                        "https://ethereum-magicians.org/t/eip-3298-removal-of-refunds/5430/11"
                    ],
                    "GPT-summary": "The post is an explanation of a proposal called EIP-3300, which aims to phase out refunds. The author of the proposal is explaining it, and a third party is giving constructive criticism of the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Token economics",
                        "Interoperability and Scalability",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/timbeiko",
                    "index": "2",
                    "likes": "1",
                    "time": "27/02/2021-19:11:34",
                    "content": "Cross-posting a few comments from the Eth R&D discord:  @shemnon: I think a gradual incentive to clear out the inventory is better than a deadline and the preceding fire sale. I expect we would see more state cleanup in the gradual scenario.   @timbeiko: Generally agree, although 1m blocks (~1y) seems very long, especially given the “advance warning” w.r.t. this actually hitting mainnet. IMO if we’re planning to, say, have another upgrade around Q4/Q1, we should aim to have the refund at 0 by then, and then we can maybe simplify a lot of code on the next fork. So, in other words, ~1 year from today seems fine, but not ~1 year from London hitting mainnet  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.534848484848485
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/shemnon",
                    "index": "3",
                    "likes": "0",
                    "time": "27/02/2021-20:57:02",
                    "content": "Would a 50 block step be an option then?  Puts the phase out to ~1MM blocks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "4",
                    "likes": "0",
                    "time": "01/03/2021-04:16:24",
                    "content": "    timbeiko:  So, in other words, ~1 year from today seems fine, but not ~1 year from London hitting mainnet   The longer it goes the more cleanup we can expect. I would suggest 64 over 50 for a rounder number, but if they must be removed by the following major upgrade, 1,900,000 is a reasonable timetable. For 64 it would be 1,216,000 blocks, about 7 months. There were 1,789,000 blocks (282 days) between Constantinople and Istanbul, and Istanbul/Muir has gone for almost 3,000,000. For theoretically larger intra-tx refunds such as the 19800 specified by EIP-1283, I would not suggest to wait the full decay period since the refund was not stored between transactions. For that case it would be sufficient to go forward with an upgrade that replaces the remaining intra-tx refund with some negative-gas mechanic. From Github:  GasTokens are effectively an exploit  As a speedrunning enthusiast I wouldn’t categorize any feature being used in a way the developers are aware of and call a net-positive as an exploit.  It’s not our fault that certain people hoarded them against this advice. And most certainly it shouldn’t lead to stretching out selfdestruct phase out.  I wouldn’t say we’ve been hoarding them. We use hundreds to tens of thousands per week depending on congestion, and the amount we hold is reasonable for our business. We have to hedge against the gas price volatility and insure against the worst-case. It’s easy to criticize us if you don’t participate in PGAs or need to use the network in peak congestion, but refund usage is not optional, and our gas reserve is rational. If refund removal cannot be delayed for whatever reason, core devs might prefer the cleanup-and-compensation alternative I am currently writing up, tho that will be more work for them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.198908730158729
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MicahZoltu",
                    "index": "5",
                    "likes": "0",
                    "time": "02/03/2021-15:10:00",
                    "content": "What is the argument for 17 moths over 5 months?  (where 5 months is starting from now until expected London HF, and 12 months is that plus a 1 year decrease) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "6",
                    "likes": "0",
                    "time": "02/03/2021-21:10:55",
                    "content": "They’re more likely to be freed under the phase-out plan because as their intrinsic value drops it will be cheaper to buy the liquid refunds than to mint them, and they will still be burned in congestion. I don’t think 5 months would be enough time to burn even half of them, especially without the diminishing efficiency. This is also fairer to refund holders, especially illiquid refund holders who can’t just dump on some poor AMM LP. On a 5 month schedule I would suggest cleanup and compensation, where all of the refund contracts are replaced by EIP similar to the DAO fork, and refund holders receive freshly minted ETH at some fair gas price, perhaps totaling several thousand ETH. But the real cost of this would be developer time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.472222222222223
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MicahZoltu",
                    "index": "7",
                    "likes": "0",
                    "time": "03/03/2021-08:57:32",
                    "content": "    wjmelements:  On a 5 month schedule I would suggest cleanup and compensation, where all of the refund contracts are replaced by EIP similar to the DAO fork, and refund holders receive freshly minted ETH at some fair gas price, perhaps totaling several thousand ETH. But the real cost of this would be developer time.   I’m personally not a huge fan of taxing Ethereum holders in order to pay people who spent the last 12 months bloating the blockchain.  I would be fine with an irregular state change that wiped out the obviously worthless state though (CHI tokens and Gas tokens specifically). If we implement something like https://ethresear.ch/t/resurrection-conflict-minimized-state-bounding-take-2/8739 then the CHI and Gas tokens will eventually fade into cold state and be pruned, so the situation will clean itself up naturally long term (if we go that route). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.089743589743589
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "8",
                    "likes": "0",
                    "time": "04/03/2021-04:31:49",
                    "content": "    MicahZoltu:  I’m personally not a huge fan of taxing Ethereum holders in order to pay people who spent the last 12 months bloating the blockchain. I would be fine with an irregular state change that wiped out the obviously worthless state though (CHI tokens and Gas tokens specifically).   Holders aren’t necessarily minters, especially in the liquid case, but neither are doing anything wrong. It’s evil and possibly illegal to destroy their assets without compensation. Also the “bloat” is small relative to the total storage, has been in steep decline for months, and can be reduced further by taking advantage of its uniformity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.9555555555555557
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wjmelements",
                    "index": "9",
                    "likes": "0",
                    "time": "04/03/2021-19:03:19",
                    "content": "I currently prefer EIP-3322 to this because refunds encourage healthy state management. Most of the concerns with refunds can be solved by introducing a more-efficient alternative. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.666666666666666
                }
            ]
        }
    ],
    "group_index": "1243"
}