{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/ephemery-project-an-ephemeral-testnet/11955",
            "title": "Ephemery project: An ephemeral testnet ",
            "index": 11955,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "testnet",
                "testnets",
                "testing",
                "infrastructure"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/remyroy",
                    "index": "1",
                    "likes": "4",
                    "time": "30/11/2022-22:35:51",
                    "content": "Ephemery is a new Ethereum testnet project with the goal of creating a testnet that is ephemeral and that resets every few days or weeks. Our goal is to create a testnet that is well suited for testing a staking setup before going on Mainnet but also for any use case that does not need long-lived and durable storage. We are looking for genesis node operators, testers who want to setup different client pairs, people to create and help with documentation and developers who want to start implementing this in Ethereum clients, wallets and all the tools generally used with an Ethereum network. This is somewhat related to the https://ethereum-magicians.org/t/testnet-workgroup-paths-out-of-the-goerli-supply-mess as being one solution to the staking use case. You can get a glimpse of the current iteration of the Ephemery testnet on https://ephemery.pk910.de/. If you want to setup a node to connect to that testnet, we have the genesis state being published on GitHub - pk910/test-testnet-repo with some scripts to help with the reset step. Get in touch to get involved in the project. We have a chat room on https://matrix.to/#/#staker-testnet:matrix.org to reach us. ",
                    "links": [
                        "https://ephemery.pk910.de/",
                        "https://github.com/pk910/test-testnet-repo",
                        "https://matrix.to/#/#staker-testnet:matrix.org"
                    ],
                    "GPT-summary": "The author of the post is introducing a new Ethereum testnet project called Ephemery, which aims to create a testnet that resets every few days or weeks. The author is asking for feedback and looking for people to get involved in the project, including genesis node operators, testers, documentation creators, and developers. The post also provides links to the current iteration of the Ephemery testnet and a chat room to reach the project team.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 4.988636363636363
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/remyroy",
                    "index": "2",
                    "likes": "0",
                    "time": "28/02/2023-01:05:21",
                    "content": "The main repository for this is on GitHub - taxmeifyoucan/ephemeral-testnet: Resources and project management of Ethereum ephemeral testnet ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                }
            ]
        }
    ],
    "group_index": "241"
}