{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/devcon-process-eip/4139",
            "title": "DevCon Process EIP ",
            "index": 4139,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/kladkogex",
                    "index": "1",
                    "likes": "3",
                    "time": "16/03/2020-15:49:46",
                    "content": "I am looking for at least 20 people to co-author an DevCon process EIP. Last year over 6000 submissions were rejected - people did not get a single comment back On the other hand, many talks at devcon had nothing to do with ETH. The reason I think we need at least 20 people for the original EIP committee is , if we do not have many people we wont be able to push this through. If we  cant get at least 20 people, it does not make sense to start IMO. It cant be an EIP submitted by one person. We also need to have a neutral coordinator for this EIP with no affinity to any company project etc Lets start pulling some ideas and seeing if there is enough people interested in having an EIP like that Here are some of ideas -  have a github repository and a youtube channel for all submissions, so people that end up being rejected can present online have a virtual website so everyone rejected for a physical presentation can present virtually limit all talks to 20 minutes so more people can present autoreject all talks dealing with non-eth-compatible blockchains establish a transparent submission and review process similar to online  openaccess journals (which journal should we take as an example?) have a clear nomination and vote process for reviewers have a clear conflict of interest policy  Lets start brainstorming … ",
                    "links": [],
                    "GPT-summary": "The author is proposing a DevCon process EIP and is looking for at least 20 people to co-author it. The proposal aims to improve the submission and review process for DevCon talks, with ideas such as having a transparent submission and review process, limiting talks to 20 minutes, and autorejecting talks dealing with non-ETH-compatible blockchains. The author is also seeking feedback and collaboration from interested parties.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Change to proposal pipeline",
                        "Board composition",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.411564625850341
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/thor314",
                    "index": "2",
                    "likes": "0",
                    "time": "18/03/2020-21:41:01",
                    "content": "Bumping 20 to 30 minutes seems reasonable, as a fairly standard talk length. I do like upper limits on talk length, though I’m curious if that would be at odds with giving more time to more popular presenters’ Batches of Devcon 5 talks were haphazardly uploaded to youtube at irregular intervals with very minimal description. I suspect that could be improved upon. A website for everyone who was rejected presents risks. Mainly, giving an undeserved platform to those who shouldn’t be elevated (off topic, sketchy, or otherwise low quality). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.348611111111111
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/esaulpaugh",
                    "index": "3",
                    "likes": "1",
                    "time": "19/03/2020-22:58:12",
                    "content": "good idea. i proposed a five minute talk on my library esaulpaugh/headlong but didn’t make the cut. not a big deal but seeing things like libra, polkadot etc talk more than vitalik and vlad was really strange. last year’s devcon was a mess in a lot of ways, at least when viewed from the outside. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.421875
                }
            ]
        }
    ],
    "group_index": "1028"
}