{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/idea-allow-contract-addressing-by-ens-instead-of-conract-address/473",
            "title": "IDEA: allow contract addressing by ENS instead of conract address ",
            "index": 473,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "1",
                    "likes": "2",
                    "time": "29/05/2018-13:45:58",
                    "content": "From ether-router manual:  Allows you to have a contract with a stable address, but fully controllable and upgradeable behavior.  It looks like a nasty workaround for deeper problem in ethereum architecture, isn’t it? Guys, we should stop use ethereum addresses as a public ids for mutable entities! We have ENS for that. It should be possible to address a contract (or even contract+function callpoint) by ENS name. I know, it requires low-level ENS integration into ethereum core and there are challenges here, but now I am asking you just about the idea. Does it make sense? What do you think? ",
                    "links": [
                        "https://ethereum-magicians.org/t/usecases-for-account-abstraction/2973"
                    ],
                    "GPT-summary": "The author proposes the idea of allowing contract addressing by ENS instead of contract address. The author asks for feedback on the idea and acknowledges the challenges of low-level ENS integration into Ethereum core. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "2",
                    "likes": "0",
                    "time": "23/03/2019-23:16:09",
                    "content": "It were objections, that ENS lookup may be prohibitive high. I would suggest to introduce a global ENS resolution cache for that updated by resolver. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.4
                }
            ]
        }
    ],
    "group_index": "1160"
}