{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-pubref-script-op-code-for-public-data-references/4456",
            "title": "EIP: PubRef - Script OP Code For Public Data References ",
            "index": 4456,
            "category": [
                "EIPs"
            ],
            "tags": [
                "opcodes"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/rook",
                    "index": "1",
                    "likes": "0",
                    "time": "28/07/2020-17:22:50",
                    "content": "Imagine an immutable stack-based language where every push operation is executed contributing more to an ever growing global-stack. This stack can be pruned down for relevance, and then exposed to future scripts which can then reference any previous value used by any previous operation. Having a global shared stack would allow scripts to be less redundant as they could refer to what has already happened.  In effect, this is a form of running code-book compression of key material. I will be happy to write up an EIP if you guys are interested blockcahin pointers.  For now a i have BIP:   github.com   TheRook/bip-pubref/blob/master/bip-PubRef.mediawiki <pre>   BIP: PubRef   Layer: Consensus (soft fork)   Title: PubRef - Script OP Code For Public Data References   Author: Michael Brooks <m@ib.tc>   Comments-Summary: No comments yet.   Comments-URI: https://github.com/bitcoin/bips/wiki/Comments:BIP-0323   Status: Draft   Type: Standards Track   Created: 2019-07-23   License: CC0-1.0 </pre>  == Abstract ==  This BIP describes how a new OP code can be used to construct smaller, more compact transactions.  With a public reference (PubRef), a newly created transaction can reuse elements of a previously confirmed transaction by representing this information with a smaller numeric offset or “pointer”.  == Motivation ==  Giving scripts the ability to refer to data on the blockchain will reduce transaction sizes because key material does not have to be repeated in every Script. Users of the network are rewarded with smaller transaction sizes, and miners are able to fit more transactions into new blocks.  Pointers are a common feature and it felt like this was missing from Bitcoin Script.     This file has been truncated. show original      ",
                    "links": [
                        "https://github.com/TheRook/bip-pubref/blob/master/bip-PubRef.mediawiki",
                        "https://github.com/TheRook/bip-pubref/blob/master/bip-PubRef.mediawiki"
                    ],
                    "GPT-summary": "The post describes a proposal for a new OP code called PubRef that would allow for smaller and more compact transactions by reusing elements of previously confirmed transactions. The author explains the motivation behind the proposal and how it would benefit users and miners. A third party provides constructive criticism by asking questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Token economics",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.563089225589225
                }
            ]
        }
    ],
    "group_index": "1103"
}