{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/potential-options-for-a-hard-burn-removal-of-untransferrable-erc20-tokens/8144",
            "title": "Potential options for a hard burn/removal of untransferrable ERC20 tokens ",
            "index": 8144,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Spirit",
                    "index": "1",
                    "likes": "0",
                    "time": "29/01/2022-13:23:11",
                    "content": "Hello! I want to discuss potential options to remove untransferrable, scam (honeypot) ERC20 tokens from a wallet: tokens that have their contract locked or paused specifically to steal users funds through UniSwap etc.    Etherscan Information Center – 5 Dec 19    ERC-20 Token Transfer Might Have Failed There are times when an ERC-20 token transfer might have failed and this article lists some of the common reasons.      Is it possible, in theory, to remove or ‘hard burn’ untransferrable tokens from a wallet? I know most think it’s probably not an important issue, and you could just start fresh with a new wallet – but with the growth of ENS, I would argue having sovereigny over the contents of our wallets is more important than ever. Is it technically feasible to propose an update that could implement a way to ‘hard burn’ anything in your wallet, overriding the locked or paused ERC20 contract? Could obvoious scam tokens ever be dropped with The Purge? I’d love to hear your thoughts, and explore possibilities and hopefully learn some valuable info in the process. Thank you  ",
                    "links": [
                        "https://info.etherscan.com/what-happens-when-erc-20-token-transfer-might-have-failed/"
                    ],
                    "GPT-summary": "The author of the post is seeking feedback and suggestions on potential options to remove untransferrable ERC20 tokens from a wallet. They are asking if it is technically feasible to propose an update that could implement a way to 'hard burn' anything in a wallet, overriding the locked or paused ERC20 contract. The post also asks if obvious scam tokens could ever be dropped with The Purge. The post is open to exploring possibilities and learning valuable information in the process.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.107901936026936
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/davidc",
                    "index": "2",
                    "likes": "0",
                    "time": "31/01/2022-08:03:14",
                    "content": "Do you mean to extend ERC20 with some sort of a user-initiated burn function, so that it is no longer  associated with your wallet? Couldn’t a scam token just decide not to implement this functionality correctly? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.4375
                }
            ]
        }
    ],
    "group_index": "1586"
}