{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/is-there-a-good-standard-for-time-decaying-multisigs/10656",
            "title": "Is there a good standard for time-decaying multisigs? ",
            "index": 10656,
            "category": [
                "Wallets"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/SoundMoney",
                    "index": "1",
                    "likes": "0",
                    "time": "03/09/2022-19:17:04",
                    "content": "I’d like to implement the following multisig smart contract:  2/3 multisig until time T At time T the multisig becomes a 1/3 Any signer can increase T  I only want to store ETH for now, but ERC20 support would be a plus. Would appreciate any code pointers! Also open to philosophical feedback as to whether this is a good vault. I like it because the vault is not less secure than a standard 2/3 multisig as long as T is extended frequently. And if the owner loses 2 keys, they can recover the vault after T as long as nobody else knows any of the keys. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4221611721611715
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Pandapip1",
                    "index": "2",
                    "likes": "0",
                    "time": "03/09/2022-23:14:38",
                    "content": "Personally, I would have the following properties on it:  Can send ether and submit arbitrary transactions When a key is used, a time delay is set to remove that key from the multisig altogether. This gets cleared when a new time delay for that key is set. New keys can be added and old ones removed with a 2/3 supermajority (rounded down) Keys can remove themselves  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.058585858585859
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/TimDaub",
                    "index": "3",
                    "likes": "0",
                    "time": "04/09/2022-09:54:56",
                    "content": "I could imagine EIP-4973 to be helpful here. Among themselves, the parties could “give” or “take” account-bound tokens\" that signal membership over a shared account. A contract holding the funds could then be set up such that for withdrawing Ether, a quorum of ABT holders would have to accept the transfer. Additionally, it could be set up where any holder of the ABT may increase T. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "87"
}