{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/fix-block-reward-at-2-eth-per-block-eip-1277/905",
            "title": "Fix block reward at 2 ETH per block (EIP-1277) ",
            "index": 905,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/MicahZoltu",
                    "index": "1",
                    "likes": "0",
                    "time": "31/07/2018-07:48:46",
                    "content": "Discussion for EIP-1277 Simple Summary Changes the block reward to be a fixed amount per block of 2 ETH. Abstract As of FORK_BLOCK_NUMBER, set the block reward to 2 ETH and the Uncle and Nephew reward following the same formula as before. Motivation There has been an expectation of block reward reduction up to now as a side effect of the ice age.  If the Ice Age is removed or delayed, there will be an increase in block reward per time.  This change makes the most sense on a chain that removes or delays the Ice Age, but it can be implemented on a chain in isolation. Specification new_block_reward = 2_000_000_000_000_000_000 if block.number >= FORK_BLOCK_NUMBER else block.reward  (2E18 attoeth, or 2,000,000,000,000,000,000 attoeth, or 2 ETH). If an uncle is included in a block for block.number >= FORK_BLOCK_NUMBER such that block.number - uncle.number = k, the uncle reward is new_uncle_reward = (8 - k) * new_block_reward / 8  This is the existing pre-fork formula for uncle rewards, simply adjusted with new_block_reward. The nephew reward for block.number >= FORK_BLOCK_NUMBER is new_nephew_reward = new_block_reward / 32  This is the existing pre-fork formula for nephew rewards, simply adjusted with new_block_reward. Rationale This change will keep ETH issuance per day stable with pre-fork values in the face of a permanent decrease in blocks per day down to 15 seconds per block. If there is a desire to keep ETH issuance per day stable in the face of decreasing blocks per day then this EIP is not a good solution and another EIP should be implemented that adjusts the block reward formula to be a function of time rather than a function of block number. Backwards Compatibility This EIP is not forward compatible and introduces backwards incompatibilities in the block, uncle and nephew reward structure. Therefore, it should be included in a scheduled hardfork at a certain block number. Test Cases Test cases shall be created once the specification is to be accepted by the developers or implemented by the clients. Implementation None yet. Copyright Copyright and related rights waived via CC0. ",
                    "links": [],
                    "GPT-summary": "The post proposes a change to the Ethereum block reward system, suggesting a fixed amount of 2 ETH per block. The proposal includes a detailed specification and rationale for the change. The post does not advertise or seek collaboration, but rather explains the proposal and invites feedback and questions.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.83028083028083
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tjayrush",
                    "index": "2",
                    "likes": "0",
                    "time": "01/08/2018-23:39:48",
                    "content": "    MicahZoltu:  There has been an expectation of block reward reduction up to now as a side effect of the ice age.   Just to be overly pedantic. It’s not clear how a side effect can be an expected behavior. According to Google, a side effect is “a secondary, typically undesirable effect…”. Of course, removing (or delaying) the ice age would result in an increase in the block reward over time. But if the decrease in number of blocks per time period is a side effect of growing difficulty then restoring the original issuance per time period can be looked at as a remedy to the problem of the side effect. I actually support lowering the issuance, but the decision should be based on data. Is it possible to know how many attacks (of the type we’re trying to secure against) occur over a given time period? Have there even been any attacks? Is there a guestimate of how much the network (as a whole) is paying per time period for security. Can we estimate (even to an order of magnitude) how much security we need? Why 2.0 ether per block. Why not 2.5? Why not 2.75? I’ve seen a lot of discussion that the block reward should be lowered and/or raised, but almost no objective information about what the current situation looks like. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.449404761904761
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MicahZoltu",
                    "index": "3",
                    "likes": "1",
                    "time": "02/08/2018-04:17:35",
                    "content": "Ah, my understanding of the Ice Age was that its primary purpose was to force upgrades by making the network become unusable over time.  It had a secondary effect (possibly desired, but not the primary goal) of reducing block reward over time.  I’m amenable to changing the wording to something else.  Perhaps “There has been an expectation of block reward reduction up to now as a secondary effect of the ice age.”? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MicahZoltu",
                    "index": "4",
                    "likes": "0",
                    "time": "02/08/2018-04:22:15",
                    "content": "    tjayrush:  I’ve seen a lot of discussion that the block reward should be lowered and/or raised, but almost no objective information about what the current situation looks like.   This, unfortunately, is because calculating the needed security is really hard especially on Ethereum due to smart contracts.  The needed economic security is a function of value transferred over time.  The more value that is moved between parties per unit of time, the higher the economic incentive to attack the system is.  The block reward serves as a mechanism to give economic disincentive to attacks against these value transfers by making it more valuable to miners to mine the longest chain than to risk mining a forked chain in an attempt to steal some of that value. The lower the block reward, the more confirmations necessary to be confident that an off-chain value transfer actually occurred. The problem is that we do not have a good mechanism for calculating the value transfer per minute of Ethereum, so we don’t actually have a good measure of how much security we need.  I believe many people have a “gut feeling” about what that number is, but since the data is hard to acquire no one has hard data. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.763392857142858
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tjayrush",
                    "index": "5",
                    "likes": "0",
                    "time": "03/08/2018-02:07:05",
                    "content": "What information exactly would you need to calculate “value transfer per minute”. It doesn’t seem like there are that many variables. Per-block reward, transaction fees, uncle rewards, price in some basket of fiats averaged from multiple sources. Also, is there some way to make a judgement on how (or even if) anyone is ‘attacking’ the chain? Maybe it’s not possible to even distinguish between an attack and someone just following a different chain for a while. What data would you need to get a feel for that? Can QuickBlocks help with any of this? QuickBlocks watches every block and does whatever it does with it, but perhaps I can modify it to do some other junk to collect data to make some informed “non-gut-feeling” decisions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.446428571428571
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tjayrush",
                    "index": "6",
                    "likes": "0",
                    "time": "03/08/2018-04:06:43",
                    "content": "This article appears to have some data to consider: https://medium.com/@eric.conner/a-case-for-ethereum-block-reward-reduction-in-constantinople-eip-1234-25732431fc77. Looking at the first chart, I see the issuance plummeting just before the difficulty bomb was diffused. It doesn’t make sense to me to claim that the expected issuance pattern anticipates the rising difficulty. The bomb (the plummet) is clearly a wild shift in the issuance and the delay of the bomb at the hard fork is a discontinuity. I’m not saying the issuance shouldn’t be lower (I think it probably should be), I’m just saying that lowering it to keep it in line with the expected issuance if you build the difficulty bomb into “expected issuance” seems hard to support. At the rate the issuance was declining, if the fork was two weeks later, then by that argument, the new issuance should have been 1 ETH. If the fork was two weeks earlier, it should have been 4 ETH. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.835016835016835
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MicahZoltu",
                    "index": "7",
                    "likes": "0",
                    "time": "03/08/2018-04:43:15",
                    "content": "I personally don’t believe that comparing to other chains is necessary or meaningful.  Nor do I believe that market cap, inflation, etc. are relevant.  What matters is whether or not miners are being paid enough to behave in the way we desire or if they are underpaid, thus financially motivated to behave in undesirable ways (like attempting non-51% double spends). The reason it is difficult to calculate this is because you need to not only track how much ETH changes hands per minute, but also tokens, and any other asset that holds non-zero value (which is basically everything on-chain).  In theory, you can filter these by “value transfers where one party is providing something off-chain”.  This means that you can ignore almost all Augur trading transactions, or ERC20 to ERC20 trades on on-chain exchanges like 0x, IDEX or EtherDelta. However, even ignoring the filtering, it is hard to get a number to even start with since changing contract ownership is an example of a value transfer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.022435897435898
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tjayrush",
                    "index": "8",
                    "likes": "1",
                    "time": "03/08/2018-14:23:51",
                    "content": "I wonder if there’s some way to do sampling (https://en.wikipedia.org/wiki/Sampling_(statistics)). If we could collect together the right list of things to sample, we might be able to gain some insight. My goal (to the extent there is one) is to be able to make decisions with a bit more rigor. Switching from 3 ETH to 2 ETH (or 5 to 3, for that matter) seems remarkably “rough-hewn” for a system with 18 decimal place accuracy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.535714285714286
                }
            ]
        }
    ],
    "group_index": "1717"
}