{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/case-discussion-on-the-eip-process-based-on-eip-1900-eip-1/3627",
            "title": "Case discussion on the EIP process, based on EIP-1900 & EIP-1 ",
            "index": 3627,
            "category": [
                "Process Improvement"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "1",
                    "likes": "0",
                    "time": "05/09/2019-19:50:36",
                    "content": "Threads that started this discussion:   twitter.com          Dan Finlay (danfinlay)     @nicksdjohnson @lorecirstea It looks like a bit of miscommunication to me. The tragedy is how it is unclear when an EIP editor is just giving feedback or demanding changes, but Nick here got into the proposal, and seemed to be trying to help refine the spec, imho. https://t.co/mrEQVQjv6e       Loredana Cirstea @lorecirstea           I view dType & Alias as a project of collaboration with the community. ENS could for, example, support the Alias part for dType (even on top of the current format), and define & manage some of the types in dType.           11:51 PM - 31 Aug 2019     3              twitter.com          Loredana Cirstea (lorecirstea)     Timeline thread 👇 https://t.co/AP3XwQnJQ3       Dan Finlay @danfinlay           It looks like a bit of miscommunication to me. The tragedy is how it is unclear when an EIP editor is just giving feedback or demanding changes, but Nick here got into the proposal, and seemed to be trying to help refine the spec, imho. https://github.com/ethereum/EIPs/issues/1882 …           9:50 AM - 1 Sep 2019     3            I am also posting my timeline here:   https://github.com/ethereum/EIPs/issues/1882 opened on March 28th, https://github.com/ethereum/EIPs/pull/1900 opened on April 2nd.   Pinged an editor on April 6th for EIP number - no response   Wrote 3 articles about dType parts: https://medium.com/@loredana.cirstea   Made 3 video demos: https://www.youtube.com/playlist?list=PL323JufuD9JC46yClCf5fdaEX17kocem7   All shared on Twitter & Reddit, EIPs on EIP Gitter chat   https://twitter.com/jemenger/status/1143655108896362497   The article mentions the Draft PR, exactly where the opcode section was (NJ now says he did not see it). NJ was interested. I also gave him the issue link to discuss.First EIP editor interested!   1- NJ comments were useful - I said as much. But, up to a point, when he wanted to close the discussion because I wouldn’t do as he proposed. And kept asking for more and more content, even after I limited the EIP scope. 2 - My PR was unmerged, the only editor looking was stopping collaboration, while he was promoting fast Draft merging without technical soundness check - after the whole EIP999. So, I did not understand why he would not merge it after spending so much time on it.   July 2nd: https://github.com/ethereum/EIPs/issues/1882#issuecomment-507619192 I say: “Therefore, I do not see a reason to deny merging of this ERC Draft to master”. NJ still did not review/merge the PR.   July 2-4: I made proposals for EIP editors: https://github.com/ethereum/EIPs/pulls?q=is%3Apr+is%3Aopen+editors+author%3Aloredanacirstea   EIP1900 merged July 7th - not by NJ though.   @danfinlay , if you still think there are lapses in logic & I was overreacting, I can spend 30-60 min to go through the EIP discussion with you (not on Twitter, but on ETHMagicians, Gitter, etc.) & hear what I could have done better at each point. ",
                    "links": [
                        "https://twitter.com/danfinlay/status/1168187079089508352",
                        "https://twitter.com/lorecirstea/status/1152667597105745920",
                        "https://twitter.com/danfinlay/status/1168187079089508352",
                        "https://twitter.com/lorecirstea/status/1168204570390147072",
                        "https://twitter.com/lorecirstea/status/1168204570390147072",
                        "https://twitter.com/danfinlay/status/1168187079089508352",
                        "https://twitter.com/lorecirstea/status/1168204570390147072",
                        "https://github.com/ethereum/EIPs/issues/1882",
                        "https://github.com/ethereum/EIPs/pull/1900",
                        "https://medium.com/@loredana.cirstea",
                        "https://www.youtube.com/playlist?list=PL323JufuD9JC46yClCf5fdaEX17kocem7",
                        "https://twitter.com/jemenger/status/1143655108896362497",
                        "https://github.com/ethereum/EIPs/issues/1882#issuecomment-507619192",
                        "https://github.com/ethereum/EIPs/pulls?q=is%3Apr+is%3Aopen+editors+author%3Aloredanacirstea"
                    ],
                    "GPT-summary": "The post is a discussion about the EIP process, specifically regarding EIP-1900 and EIP-1. The author of the post is explaining their experience with the EIP process and the feedback they received from a third party. The third party is giving constructive criticism of the proposal and asking questions about it. The author also expresses a desire to collaborate on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 6.066964285714286
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "2",
                    "likes": "0",
                    "time": "05/09/2019-20:00:08",
                    "content": "Regarding:   twitter.com          Dan Finlay (danfinlay)     @lorecirstea I finished reviewing this timeline, and creating my own, and my analysis is similar to my initial one, I don't think there was malice, but misunderstanding. I could share my notes, or we could review the events in a channel of your choice.       Je-Meng @jemenger            from @lorecirstea.   \"Ethereum can still make the first move if it starts adopting a type system.\"  https://medium.com/@loredana.cirstea/ethereum-libra-and-a-unified-type-system-7cafa6ea0bc0 …           9:50 AM - 1 Sep 2019     1             I can’t know if he acted will malice. That is not under contention. What I said was that he abused my EIP and me personally (on Twitter, even when his person was not involved in the discussion). But we are not here to discuss him, I hope we are here to discuss my fault: how did I miscommunicate? ",
                    "links": [
                        "https://twitter.com/danfinlay/status/1169688792527065093",
                        "https://twitter.com/jemenger/status/1143655108896362497",
                        "https://twitter.com/danfinlay/status/1169688792527065093"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party wanting to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/danfinlay",
                    "index": "3",
                    "likes": "1",
                    "time": "05/09/2019-21:08:03",
                    "content": "    loredanacirstea:  But we are not here to discuss him, I hope we are here to discuss my fault: how did I miscommunicate?   So first of all, the EIP process is slow, and it’s run by volunteers, and that sucks. I think he needed to be clear when he was communicating as an editor and when not, and I think he even agrees about that. I didn’t see instances of him being specifically abusive. Some of the worst things you claimed out were things like pinging EIP editors, and getting no response, and I confirmed you waited like 3 months for EIP 1900 to be merged, but you had only pinged nick savers. Maybe you meant to ping Nick Johnson there, and maybe this is why you thought he was being abusive? I think the EIP process seems overwhelmed right now, I also have submissions that are not being actively interacted with, but I just assume people are busy, I don’t assume it’s malice. From your timeline, I didn’t see any instance of Nick being directly abusive to you on Github nor Twitter (maybe you could still link to examples, but they weren’t there), but you did act fairly cruel once you had decided Nick was acting against you. I feel like a lot of this is frustration that there hasn’t been wider community embrace of your proposals, and I mostly side with my earlier thought, that most people are just busy and distracted. I tend to agree with the saying “Genius is 1 percent inspiration and 99 percent perspiration.” The ideas you’ve shared may be great, and inevitable, and maybe they make ENS obsolete, but I just don’t think it’s productive to get defeated when sharing an idea doesn’t make it take off in a 3 day window. I think tools like dType and pipeline are useful even one user at a time, and maybe you don’t want to do it, but maybe you need a teammate who is willing to go talking to developers one at a time, and showing them how it works, why it saves them time, how it makes their contracts more composable. The first ~6 months of MetaMask was a big education effort. Most dapps built wallets into the site by default, and storing keys in an extension was not at all an intuitive next step. It can take a while to educate people into new paradigms. I’m a huge fan of your work, and I first started following you because I was also interested in graph-based smart contract authoring, but MetaMask keeps me so busy, I can’t read every proposal by anyone, even my favorite thinkers. Things fall through the cracks. Helping people allocate their attention to the highest-impact things is one thing I’d love to see come out of blockchain, but until we have that, we have to be sympathetic to the fact that our listeners are mortal, they have limited attention and energy and time in the day, and no matter how good our ideas are, most of the value will always come from the labor of implementation, not from the idea itself. A few times you expressed irritation at people who you perceived as being dense, or not attentive enough. I think this attitude is sometimes getting directly in the way of people who might otherwise want to learn more about the systems you’re proposing. Infrastructure like type systems may not get viral buzz like a hot ICO, but I wish that wasn’t as demotivating to you. Anyways, I wish good ideas always won, but ideas transmit by communication, and sometimes that communication can be tedious, and repetitive, but that’s communication, and it’s all we’ve got. I hope you find a way to rally the support you deserve without feeling slighted. ",
                    "links": [
                        "https://twitter.com/lorecirstea/status/1168085577503313920",
                        "https://medium.com/@loredana.cirstea/flexible-alias-or-why-ens-is-obsolete-a1353030f445"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.685583513708514
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "4",
                    "likes": "0",
                    "time": "05/09/2019-21:18:18",
                    "content": "If we want to get a clear answer on a problem, we should stick with the problem. I am going to avoid answering to anything else than the issue at hand: “It looks like a bit of miscommunication to me.” I can answer to your other points after we clarify this one. So, how did I miscommunicate when trying to get EIP-1900 merged? Please tell me one instance of miscommunication. We clarify that, and then we move to the next instance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.958333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/danfinlay",
                    "index": "5",
                    "likes": "0",
                    "time": "05/09/2019-22:30:47",
                    "content": "    loredanacirstea:  So, how did I miscommunicate when trying to get EIP-1900 merged?   For one thing, you said you had tried to ping EIP editors, but had only pinged Nick Savers. Did you mean to ping Nick Johnson? Is it possible you were mad at him for not replying to a message that was never sent to him? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.828125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "6",
                    "likes": "0",
                    "time": "05/09/2019-22:36:17",
                    "content": "I pinged Nick Savers because I saw he was reviewing EIPs at that time. There was no other active reviewer at that specific time. I also posted in https://gitter.im/ethereum/EIPs?at=5c9ce69caee5b449f3aafdcb  Just opened an issue for an EIP that I want to propose, to gather feedback: Decentralized Type System ethereum/EIPs#1882. There are links to the current in work implementation & a demo video. Comments, suggestions are really appreciated and I think we need this if we want better interoperability.  No, I did not confuse Nick Johnson with Nick Savers. Is this an instance of miscommunication from my part? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.524305555555555
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "7",
                    "likes": "0",
                    "time": "06/09/2019-16:46:41",
                    "content": "@danfinlay, it has been 18h hours and you have not answered. If anyone else wants to answer how this constitutes miscommunication from my part, I am open to hear it. Otherwise, unless another instance of alleged miscommunication is produced in the next 12h, I will consider that I have not miscommunicated during the EIP-1900 process. And we can move to the next point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/danfinlay",
                    "index": "8",
                    "likes": "0",
                    "time": "06/09/2019-19:21:43",
                    "content": "    loredanacirstea:  @danfinlay, it has been 18h hours and you have not answered. If anyone else wants to answer how this constitutes miscommunication from my part, I am open to hear it.   Sorry, there are a lot of things that have been demanding my attention lately. I’m fine conceding miscommunication was not your problem. Instead, it was maybe getting angry when no malice was intended. If you’re going to take one point at a time, I’m not sure I’ll be able to maintain the discussion. I might suggest a forum like kialo that allows many nested points to be addressed very specifically at once, if you require this kind of granularity to the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3939393939393945
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "9",
                    "likes": "0",
                    "time": "06/09/2019-20:38:00",
                    "content": " Sorry, there are a lot of things that have been demanding my attention lately.  You opened the discussion in the first place. And the only reasons for which I am willing to put time into this myself are:  I valued your opinion and wanted to see the exact points on which we agree and disagree I started this as a discussion on the EIP process, to see if I could have done anything better when proposing EIP-1900 (others might be interested in this too)   I’m fine conceding miscommunication was not your problem  Ok. But I hope it is not because of the medium or lack of time.  Instead, it was maybe getting angry when no malice was intended.  Then this will be the next point.  If you’re going to take one point at a time, I’m not sure I’ll be able to maintain the discussion  I think there is no other way to clarify a situation.  I might suggest a forum like kialo  You offered me the option to choose the medium and I thought the EIP process discussion could be useful here. We can use kialo (which seems great) for the other, unrelated topics. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.560049019607844
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "10",
                    "likes": "0",
                    "time": "06/09/2019-20:39:58",
                    "content": " Instead, it was maybe getting angry when no malice was intended.   https://twitter.com/danfinlay/status/1168192376294105088 but I think some of that un-clarity was met with overly quick hostility  I already said: “I can’t know if he acted will malice. That is not under contention.” What was the first occurrence from issue #1882 that you consider as “overly quick hostility” or “getting angry”? ",
                    "links": [
                        "https://github.com/ethereum/EIPs/issues/1882"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "12",
                    "likes": "0",
                    "time": "07/09/2019-18:21:24",
                    "content": "I take this personally because: The Ethereum Unicorn. If I see a problem, I want to fix it. If I am not the only one, then where are they and why are they not doing the same as I am? I am using this case discussion to exactly determine the problems. I am willing to fight for others and find solutions - see my EIP-1 process proposals. ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pulls?q=is%3Apr+is%3Aopen+editors+author%3Aloredanacirstea"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "13",
                    "likes": "0",
                    "time": "07/09/2019-19:17:25",
                    "content": "@danfinlay, I do not want us to forget the state in which this discussion is, so I am pressing ahead. Since you seem to not have time, I will make an assumption and answer the question for you. So, I will assume the first instance is in: https://github.com/ethereum/EIPs/issues/1882#issuecomment-507619192  I suggest you pay attention to how clearly you phrase your questions before being unsatisfied with the answer.  The sequence of interactions that resulted in my above phrase is:       One interface can have many implementations, but there doesn’t seem to be any distinction made between the two here. comment            LC: Are you referring to the dType registry interface and implementation or to the type library? comment          No, I’m talking about the distinction between a type definition and an implementation. For example, the ERC20 standard defines some types, which are implemented by a large number of different contracts. Capturing the ability for a type to have many implementations seems like a pretty basic feature to support. comment     If the word types has the exact same meaning in both ERC20 standard defines some types and in ability for a type to have many implementations, then:  The ERC20 standard defines functions types and devs can indeed implement the functions as they please. ERC20 function types can be defined & registered as types in dType. Devs can still implement them as they please.  But, I assumed that the problem was with non-function types. And from this perspective, the ERC20 example is a bad example (I was confused because of it).  Solidity is statically typed -> building a type system on top of it is restrictive -> the best solution that we found is one based on structs. when you describe a custom struct with dType, you can generate its implementation -> devs are not free to change the implementation, which is an automation feature; but devs are those who propose the type description in the first place.  Therefore, my answer:    LC: Devs have the freedom to implement type helper functions, as long as the required ones are implemented (to be discussed). As for the definition, I am open to other proposals that not necessarily based on structs. I am actually trying to have optional subtypes, that can be stored with map. dType registry will be extended with an additional optionals field in the dType struct & a standardized way to define optionals in the Type Library, but this is not ready yet. Other than this, what can I do more to give more freedom to the implementation comment      I still think you’re not understanding the difference between an interface and an implementation. An interface describes an API for other code to interact with, but not how it’s implemented. What you’re proposing here seems to be more along the lines of a directory of library code. […] [the spec] doesn’t make a clear distinction between interfaces and implementations. I wish you luck, but I don’t plan to offer further technical feedback. comment   At this point I was expecting references to the lines of code that were the culprit (one big reason why we use GitHub & PR reviews) and some pointers as to what can I do to fix them. But here, the assumption was that I do not know the general difference between an interface and an implementation. I still do not know what the exact problem was. If someone knows exactly, please explain.  LC: I asked you before: “Are you referring to the dType registry interface and implementation or to the type library?”, to which you answered with “No, I’m talking about the distinction between a type definition and an implementation”. I suggest you pay attention to how clearly you phrase your questions before being unsatisfied with the answer. I thought it was clear that this ERC aims to both:  standardize type libraries propose a unique type registry to be implemented (anyone can make their own registry, and the interface is defined here: https://github.com/ethereum/EIPs/blob/8d46acbaaead36b2063dc31fbfbf4fca1e34e621/EIPS/eip-1900.md#dtype-registry-data-structures-and-interface, but it is beneficial to have a unique registry and I explained why already) comment    So, regarding this interface-implementation criticism, the status was:  comparison with ERC20, which is a different type of standard no reference to any lines of code/spec no code/spec examples this criticism was used as one of the reasons for stopping any further technical feedback  Considering the above, do you consider my phrase: “I suggest you pay attention to how clearly you phrase your questions before being unsatisfied with the answer.” as being untrue? Did I not point out the exact problem that I was facing? If I become aware of a problem, I will voice it - it is the only way to help the communication advance. Overlooking makes me feel like a hypocrite and it does not help any discussion party understand or improve. @danfinlay, if you think my comment is coming off as unwarranted hostility, please help me rephrase it. @Arachnid, if you think I misunderstood your quoted words from above or if you have any material that I overlooked, let me know. ",
                    "links": [
                        "https://github.com/ethereum/EIPs/issues/1882#issuecomment-506029954",
                        "https://github.com/ethereum/EIPs/issues/1882#issuecomment-506471602",
                        "https://github.com/ethereum/EIPs/issues/1882#issuecomment-506495949",
                        "https://github.com/ethereum/EIPs/issues/1882#issuecomment-507243175",
                        "https://github.com/ethereum/EIPs/issues/1882#issuecomment-507465103",
                        "https://github.com/ethereum/EIPs/blob/8d46acbaaead36b2063dc31fbfbf4fca1e34e621/EIPS/eip-1900.md#dtype-registry-data-structures-and-interface",
                        "https://github.com/ethereum/EIPs/issues/1882#issuecomment-507619192"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.6286375661375665
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Arachnid",
                    "index": "14",
                    "likes": "0",
                    "time": "07/09/2019-20:29:19",
                    "content": "    loredanacirstea:  if you think I misunderstood your quoted words from above or if you have any material that I overlooked, let me know.   How would you represent ERC20 or another standard, where the standard defines an interface that can have multiple independent implementations, in DType? ERC20 and others define an interface in the form of an ABI, and specify some constraints on their behaviour, but do not prescribe an implementation. Many different contract instances can be accessed using this interface, without the caller having to care about how it is implemented. DType, in contrast, seems to assume each type will have exactly one implementation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "15",
                    "likes": "0",
                    "time": "07/09/2019-21:21:02",
                    "content": "@Arachnid, thank you for coming into the conversation. I already said:   The ERC20 standard defines functions types and devs can indeed implement the functions as they please. ERC20 function types can be defined & registered as types in dType. Devs can still implement them as they please.  non-function types:  Solidity is statically typed -> building a type system on top of it is restrictive -> the best solution that we found is one based on structs. when you describe a custom struct with dType, you can generate its implementation -> devs are not free to change the implementation, which is an automation feature; but devs are those who propose the type description in the first place.    As for the definition, I am open to other proposals that not necessarily based on structs.  So:  functions are described with dType by registering their ABI -> implementation is left to the dev (not all types have exactly one implementation) non-function types indeed have a deterministic implementation  We never said this is an interface system, but a type system. However, the registry itself has an interface and could be implemented differently by others. Types intended to be used in the EVM need to have a deterministic implementation - types are not interfaces and devs + machines need to know what to expect:  a type definition library a type definition struct  standardized names + ABI structure for additional type checking library functions (implementation is left to the dev) a set of standard functions for type manipulation (implementation is left to the dev)  Also, this is an example of how one can build types visually: https://pipeos-one.github.io/visual-dtype. The main output is a JSON that will be stored in the registry. From this JSON you could also build & deploy the type automatically if you do not know how to code & want the easy way. Note: Devs can create their own types (up to 2^256-1), with another name, if they are unhappy with an already registered type. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.598684210526316
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Arachnid",
                    "index": "16",
                    "likes": "0",
                    "time": "07/09/2019-22:53:54",
                    "content": "Can you give an example, then, of how you would define a DType type with, say, the ERC20 transfer method, and how multiple developers would implement this? I still don’t see how that’s possible in DType, so an end-to-end example would really help. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "17",
                    "likes": "0",
                    "time": "08/09/2019-10:54:02",
                    "content": "I have responded to this question in the EIP-1921 discussion thread, because I would like to keep the current thread on point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "18",
                    "likes": "0",
                    "time": "09/09/2019-12:43:26",
                    "content": "EIP-1900 only describes a data type system. EIP-1921 only describes the function type extension. For standards like ERC20, you need an extension to interfaces and that will come in future EIPs. This discussion was only about EIP-1900, and possibly EIP-1921. @Arachnid demonstrated that he does not understand dType as described in these two standards, because he demands that an interface heavy standard should be described with these tools. A simpler demo of what dType does (only EIP-1900), is made available in this video: https://youtu.be/GZg4L2o0Nyw @danfinlay, therefore, @Arachnid could not have “refined” the specs, beyond the first (indeed useful) comments on the spec structure & clarity  but Nick here got into the proposal, and seemed to be trying to help refine the spec source  ",
                    "links": [
                        "https://twitter.com/danfinlay/status/1168187079089508352"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Arachnid",
                    "index": "19",
                    "likes": "0",
                    "time": "10/09/2019-00:12:19",
                    "content": "All I am asking for is a practical end to end example of how someone would use DType - how you define a type, implement it, and consume it. I used ERC20 as an example because it’s a commonly used interface everyone understands, but I’d be happy to see any end to end example. If someone like myself who is heavily involved in the ethereum smart contract field has difficulty understanding the scope and intent of DType, you may want to consider the possibility that there is an issue with the ease of understanding your specification, rather than with my ability to consume it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "20",
                    "likes": "0",
                    "time": "10/09/2019-08:58:42",
                    "content": "@Arachnid, fair point, but I did not understand that the purpose of EIP-1900 was not clear to you when we had the discussion on #1882. Only now I understand because you were clear about it. I answered your above question here: https://github.com/ethereum/EIPs/issues/1882#issuecomment-529840460 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "21",
                    "likes": "0",
                    "time": "10/09/2019-17:13:12",
                    "content": "A. I see no interest for:  a detailed analysis on the conclusions and opinions put forth by @danfinlay, @Arachnid and myself a detailed analysis of the EIP process in this case discussion  B. I see:   @danfinlay expressing opinions without being prepared to give the other party (myself) time for rebuttal people quickly being sensitive around the word “obsolete”, referring to a tech, while not giving a damn about gatekeeping and actual ad hominem (1, 2). Yes, DNS should be made obsolete; if ENS started as a decentralized copy of DNS and does not plan to change, then you are promoting tech that stifles innovation and a truly machine-readable world) readers passively reading & waiting for a conclusion, instead of actively participating  When I will see interest in A, I will continue this analysis. And any time someone will bring any of these topics into a discussion on another topic, I will ping them here, since they have time to discuss it and force me to have time to discuss it. @danfinlay, you should at least post a clarification to https://twitter.com/danfinlay/status/1168187079089508352, saying that I did not miscommunicate, as you conceded in this comment. ",
                    "links": [
                        "https://twitter.com/nicksdjohnson/status/1163354936798666752",
                        "https://twitter.com/danfinlay/status/1168187079089508352",
                        "https://ethereum-magicians.org/t/case-discussion-on-the-eip-process-based-on-eip-1900-eip-1/3627/8"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.421875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/danfinlay",
                    "index": "22",
                    "likes": "0",
                    "time": "11/09/2019-16:51:05",
                    "content": "    loredanacirstea:  @danfinlay expressing opinions without being prepared to give the other party (myself) time for rebuttal   Sorry, like I’ve said repeatedly, I don’t have a lot of time to spare, and I already gave a lot of time to my initial feedback, which you are free to take and leave as you like. It seems you’ve had a lot of time to respond, and I’m willing to respond as I’m able, I’m sorry it’s not synchronous, there are many important things competing for my attention right now. I will try to get back to this, but if you’re going to read slow delays as unacceptable disinterest or even “not giving you time for rebuttal”, then I will just leave it alone, as it seems like I may be doing more harm than good.     loredanacirstea:  @danfinlay, you should at least post a clarification to https://twitter.com/danfinlay/status/1168187079089508352 , saying that I did not miscommunicate, as you conceded in this comment.   Thanks for highlighting the most important thing for me to reply on. From what I can tell, the hostility began around June 2. Phrases like:  I suggest you pay attention to how clearly you phrase your questions before being unsatisfied with the answer. So aside from your destructive (as opposed to constructive) and your inexact criticism, what can I do?  I totally get that this was frustration at not getting merged, but I would also point out that at no point during this issue discussion do you link to the pull request that you’re referring to, so I could imagine that Nick didn’t even realize there was a PR that you were suggesting, and didn’t see himself as blocking at all. There were also lots of instances of hostility in the more recent twitter thread. Anyways, I’m not judging, I really do understand the frustration with the EIP process, I have EIPs that also do not get merges or comments. I’m just answering your question so you can hopefully understand why from my perspective, this just looks like a misunderstanding that got escalated. I’ll try to review the other comments soon, sorry for the regular absence, it is not meant in bad spirit. ",
                    "links": [
                        "https://ethereum-magicians.org/t/case-discussion-on-the-eip-process-based-on-eip-1900-eip-1/3627/8",
                        "https://github.com/ethereum/EIPs/issues/1882#issuecomment-507619192",
                        "https://twitter.com/lorecirstea/status/1168085577503313920"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.305726600985222
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "23",
                    "likes": "0",
                    "time": "17/09/2019-17:44:59",
                    "content": "Ethereum is about open and decentralized processes. What is the outcome of a process that does not work? Abuse. Abuse can be on either side, willingly or unwillingly. Abuse on time, on effort, etc. For my case (EIP process), this abuse was:   months between the EIP PR and merging; merging only happened after I started proposing EIP editor processes   Arachnid did not understand dType, but still gave recommendations on how to write; first were ok and I complied; second ones, talking about the intrinsic tech demonstrated a lack of knowledge on the topic, which he was unwilling to admit or consider   I did not accuse him of not understanding what a type system is (i.e. not interfaces), but he did accuse me of not understanding the difference between an implementation and an interface   his status gives him the power to abuse even unwillingly; he did not understand the proposal and dismissed it   Arachnid can also consider that he was abused (time, effort, etc.). But he is an instrument & influencer of the EIP process. You started this discussion by voicing your conclusions. And the conclusions were:  Loredana was rude for no reason if a process does not work/abuse happens, then you should be nice and take it  Now, you are an obstacle to clarifying these problems because you have:  opened a lot of subjects without the intent to follow through because you then say you don’t have time returned to a subject that has already been explained, seemingly not accepting the arguments already given and not answering my questions on that subject; You should present counter-arguments to the arguments that I gave, not acting like the subject was not even touched (e.g. “I suggest you pay attention to how clearly you phrase your questions before being unsatisfied with the answer.”) not retreated the Twitter statements that you conceded  If you like to stay abused, at least do not block others who do not. I consider that I have a duty to me and others to fight against the abuse that I can directly see. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.21875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/danfinlay",
                    "index": "24",
                    "likes": "0",
                    "time": "19/09/2019-20:48:32",
                    "content": "    loredanacirstea:  You started this discussion by voicing your conclusions. And the conclusions were:  Loredana was rude for no reason if a process does not work/abuse happens, then you should be nice and take it    This is such a misrepresentation of what I said, that I barely have anything left to say. I did my best at interpreting what happened, and you reject my interpretation. That’s fine, but I am done trying to facilitate this conflict, I should have known it would turn on me soon enough. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.104166666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/loredanacirstea",
                    "index": "25",
                    "likes": "0",
                    "time": "05/10/2019-11:41:00",
                    "content": "Until this point you have been misrepresenting your intentions:  you seemed open to actually discuss the case, but then your actions showed that you only wanted to present your interpretation without really discussing you said one thing (conceeding that I did not miscommunicate - comment) and then your actions did not support that statement (you never retreated that statement in the original Twitter thread - first link in the description)  At this point, I cannot know if you actually mean what you write, so this discussion cannot be continued until your actions match your words. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.3203125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/danfinlay",
                    "index": "26",
                    "likes": "0",
                    "time": "05/10/2019-16:38:28",
                    "content": "This has been an intensely busy period for me, and while I wanted to give to this discussion, I gave what I could, and I did not have as much to spare as I expected or hoped. You can accuse me of misrepresenting my intentions, but I didn’t, and that accusation just further cements my opinion on this matter, that I don’t have interest in being a part of this discussion anymore, and I’d appreciate no further pings on the thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ctzurcanu",
                    "index": "27",
                    "likes": "0",
                    "time": "08/10/2019-11:29:22",
                    "content": "@danfinlay On 1st of September you started with a twitter statement:  twitter.com    Dan Finlay (danfinlay)  @nicksdjohnson @lorecirstea It looks like a bit of miscommunication to me. The tragedy is how it is unclear when an EIP editor is just giving feedback or demanding changes, but Nick here got into the proposal, and seemed to be trying to help refine the spec, imho. https://t.co/mrEQVQjv6e Loredana Cirstea @lorecirsteaI view dType & Alias as a project of collaboration with the community. ENS could for, example, support the Alias part for dType (even on top of the current format), and define & manage some of the types in dType.    11:51 PM - 31 Aug 2019     3            On 5th of September :  twitter.com    Dan Finlay (danfinlay)  @lorecirstea I finished reviewing this timeline, and creating my own, and my analysis is similar to my initial one, I don't think there was malice, but misunderstanding. I could share my notes, or we could review the events in a channel of your choice. Je-Meng @jemenger from @lorecirstea.   \"Ethereum can still make the first move if it starts adopting a type system.\"  https://medium.com/@loredana.cirstea/ethereum-libra-and-a-unified-type-system-7cafa6ea0bc0 …    9:50 AM - 1 Sep 2019     1            You accepted a debate in public that happens in this conversation. On 6th of September, to the initial statement you added  other statements [Case discussion on the EIP process, based on EIP-1900 & EIP-1 - #2 by loredanacirstea] that themselves would take some time to unpack.  “This has been an intensely busy period for me, and while I wanted to give to this discussion, I gave what I could, and I did not have as much to spare as I expected or hoped.”  You are participating in a debate that you started. If now you do not have the time or the will to continue, the gentlemanly thing to do is to concede all or any points that you presented. We still have to see you conceding the very first one in the original medium: on twitter. Especially after you conceded it here in comment  “You can accuse me of misrepresenting my intentions, but I didn’t, and that accusation just further cements my opinion on this matter, that I don’t have interest in being a part of this discussion anymore, and I’d appreciate no further pings on the thread.”  You have misrepresented your intentions in several instances:  When you pretended to concede but you are not acting on it When you start a debate but are not answering to the arguments presented by the other party, but only repeat your own. That bogs down the conversation because the other party is required to repeat the overlooked arguments. So at the level of intention: you do not want to have a meaningful debate. When you say you do not have the time to continue, but you had enough time to start several issues. When you further (meta) misrepresent your intent when you dismiss a clear and reasonable demonstration of you misrepresenting your intent. When you leave the debate with the imposition on others to not extract conclusions: “no further pings on the thread”  If I am mistaken in the above, I welcome the arguments in the renewed debate  I am not sure if the readers of this discussion are here for the stated title or just for your debate with @loredanacirstea on side-topics. I do think the stated title is more deserving of our attention than the debate, but I think we should be hygienic about approaching the main subject and first close the secondary discussions correctly. ",
                    "links": [
                        "https://twitter.com/danfinlay/status/1168187079089508352",
                        "https://twitter.com/lorecirstea/status/1152667597105745920",
                        "https://twitter.com/danfinlay/status/1168187079089508352",
                        "https://twitter.com/danfinlay/status/1169688792527065093",
                        "https://twitter.com/danfinlay/status/1169688792527065093",
                        "https://twitter.com/jemenger/status/1143655108896362497",
                        "https://twitter.com/danfinlay/status/1169688792527065093",
                        "https://ethereum-magicians.org/t/case-discussion-on-the-eip-process-based-on-eip-1900-eip-1/3627/2",
                        "https://ethereum-magicians.org/t/case-discussion-on-the-eip-process-based-on-eip-1900-eip-1/3627/8"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.575542005420054
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/danfinlay",
                    "index": "28",
                    "likes": "0",
                    "time": "21/10/2019-22:29:10",
                    "content": "    ctzurcanu:  You are participating in a debate that you started.   I firmly reject the notion that I started this debate. When I entered this discussion, I was hoping to mediate an already raging argument between two people I considered friends. I was never under any obligation to see this debate through, and it did not take me long to feel victim to the same kind of misrepresentation that I now believe Nick was victim to.     ctzurcanu:  You have misrepresented your intentions in several instances:  When you pretended to concede but you are not acting on it    Claiming that I was pretending as a purported form of evidence is the exact kind of poor-faith misrepresentation of my role in this issue that has made me want no further part in it.     ctzurcanu:  If now you do not have the time or the will to continue, the gentlemanly thing to do is to concede all or any points that you presented.   The burden of proof was never on me. Loredana was the one who directed accusations at Nick and the EIP editors. I was trying to find evidence that Nick had wronged Loredana, and I failed to find any that convinced me. Others can take the evidence and debate as they see fit, I’m done with it. I am now muting this thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.365384615384615
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ctzurcanu",
                    "index": "29",
                    "likes": "0",
                    "time": "29/10/2019-20:05:48",
                    "content": "  You are participating in a debate that you started.  I firmly reject the notion that I started this debate. When I entered this discussion, I was hoping to mediate an already raging argument between two people I considered friends.  I did not say that you started the debate between Loredana and Nick. I said you started this debate where you are coming as a third party. You yourself admit that you have a different role than the parties involved in the other debate. In this debate, you are introducing your own arguments and views and those were beginning to be addressed by Loredana. However, you did not even admit on Twitter what you admitted here. So you are stifling the debate that you started.  I was never under any obligation to see this debate through, and it did not take me long to feel victim to the same kind of misrepresentation that I now believe Nick was victim to.  ctzurcanu:  You have misrepresented your intentions in several instances:  When you pretended to concede but you are not acting on it   Claiming that I was pretending as a purported form of evidence is the exact kind of poor-faith misrepresentation of [/quote]  Please address the evidence given below related to point 1:  At the point of my writing you held true that:     danfinlay:  I’m fine conceding miscommunication was not your problem. Instead, it was maybe getting angry when no malice was intended.   At the same time, you did not retire your twitter statement. Therefore,  at that moment in time (when I wrote point 1), you held 2 positions that were mutually exclusive. It is your choice with which position you will remain, but you cannot logically pretend you were not pretending  You did not address the other 4 points. I guess they are solid. You also pretend to be a friend of @loredanacirstea.  That is surprising. Because she works with me and she asked me for some time off to help metamask and you in particular - in a friendly fashion. She produced this: https://github.com/MetaMask/metamask-plugin-beta/issues/43 What did you do? You took her work without giving at least some credit and presented it as your own:  https://github.com/MetaMask/metamask-plugin-beta/wiki/Sequence-Diagrams This was unfriendly and unprofessional in my opinion. I hope it is not your regular practice and it was just a fluke. ",
                    "links": [
                        "https://github.com/MetaMask/metamask-plugin-beta/wiki/Sequence-Diagrams"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.617559523809524
                }
            ]
        }
    ],
    "group_index": "921"
}