{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-5341-nft-referral-program/10121",
            "title": "EIP-5341: NFT referral program ",
            "index": 10121,
            "category": [
                "EIPs"
            ],
            "tags": [
                "nft"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/pianohands",
                    "index": "1",
                    "likes": "1",
                    "time": "26/07/2022-07:07:22",
                    "content": " Abstract An standard interface for defining NFT referral program from which referrers share referral code and earn a percentage of mint cost from referees who mint by using the referral code.   github.com/ethereum/EIPs         Add EIP NFT referral proposal   ethereum:master ← cdpiano:referral            opened 07:04AM - 26 Jul 22 UTC               cdpiano             +117 -0       When opening a pull request to submit a new EIP, please use the suggested templa…te: https://github.com/ethereum/EIPs/blob/master/eip-template.md  We have a GitHub bot that automatically merges some PRs. It will merge yours immediately if certain criteria are met:   - The PR edits only existing draft PRs.  - The build passes.  - Your GitHub username or email address is listed in the 'author' header of all affected PRs, inside <triangular brackets>.  - If matching on email address, the email address is the one publicly listed on your GitHub profile.       Comments are welcomed! ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pull/5341",
                        "https://github.com/cdpiano",
                        "https://github.com/ethereum/EIPs/pull/5341/files",
                        "https://github.com/ethereum/EIPs/pull/5341"
                    ],
                    "GPT-summary": "The post introduces a new Ethereum Improvement Proposal (EIP) for a standard interface to define NFT referral programs. The author invites comments and feedback on the proposal, and provides a link to the EIP template for submitting a pull request. The post does not advertise the proposal, nor does it contain entirely positive or negative feedback.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.35064935064935
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SamWilsn",
                    "index": "2",
                    "likes": "0",
                    "time": "02/09/2022-20:36:44",
                    "content": "Taking off my editing hat for a bit, I have a few comments. These comments don’t necessarily need to be resolved to complete the EIP process. I think this is a very interesting idea, and is absolutely a problem that needs solving. That said, I don’t think the current proposal is specified sufficiently. It also doesn’t actually require that referrers get paid (unless I missed something.) If it isn’t enforceable on-chain, I’d argue that the information doesn’t belong on-chain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5357142857142865
                }
            ]
        }
    ],
    "group_index": "12"
}