{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/og-council-amsterdam-devconnect/8564",
            "title": "OG Council Amsterdam Devconnect ",
            "index": 8564,
            "category": [
                "Happenings"
            ],
            "tags": [
                "ogcouncil",
                "amsterdam",
                "devconnect"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "1",
                    "likes": "4",
                    "time": "10/03/2022-07:45:57",
                    "content": "TL:DR  We are going to host “OG Council” on 23&24 April in Amsterdam during Devconnect  It’s going to be big - 2 day long Council full of sessions with Council ceremony Tickets coming in waves Council with session leaders  All info & tickets will be available on https://www.ogcouncil.com/ Annoucement article - Medium  Date: 23&24 April (Saturday & Sunday) 10am-5pm  About Our aim is to host Ethereum Magicians Council, similar as what our OG Community is used to - fish bowl / circle discussions, topic voting, group discussions. We are going to host a few session leaders that will help us lead sessions and encourage people to talk about the issues we are facing in the Ethereum Ecosystem. Council is a big gathering of Ethereum enthusiasts with aim to discuss and solve issues we are facing in the Ethereum core ecosystem. We are going to host 250 people over the period of two days with the aim to provide place for people to discuss issues on Ethereum. We are going to do Council with voting process at the venue Day 1 - Saturday will be focused on dApp layer EIPs and topic discussions. NFT, DeFi related discussions are welcomed, we would like to look into standardisation of DeFi and NFT protocols. Day 2 - Sunday will be focused on protocol layer EIPs and discussions. This day be can be used for community discussions with Core Devs and protocol researchers  Sessions & Session Leaders Day 1 - Saturday April 23rd Confirmed session leaders & sessions:   @MadeofTin - Ex AllCoreDevs Coordinator  @anettrolikova  - NFT Standards - Author of NFTStandards documentation, Working Group leader  @Amxx  - ERC-4626 - Author of ERC-4626 Open Zeppelin implementation  @ralexstokes - Co- Author of EIP-4444  Day 2 - Sunday April 24th Confirmed session leaders & sessions:   @pipermerriam  - Portal Network (ex Stateless Client) ETH Staker Team - Client UX  @MariusVanDerWijden - Merge Testing  More sessions will be proposed during Council ceremony - both days Both days the sessions will start at 10am with Opening Ceremony. Agenda of the day is available on OG Council Website  Ticketing process We are going to give away tickets for free with optional donation. Tickets will be available in 3 waves. The first wave will start today and will be distributed by email to:  Ethereum Magicians OGs - people that are actively participating in discussions on a forum EIP contributors - people that authored & co-authored EIP/ERC, EIP editors  The second wave tickets will be publicly available to Ethereum Community (everyone) on our OG Council Website . All tickets will have the same value & permissions to the event First ticket wave will have 7 days time period to claim their ticket.  Community Partner We are partnering with The Graph as community partners for this event. The Graph has been sponsoring our previous events and their members has been long time Ethereum Magicians members and supporters!  Venue Pakhuis de Zwijger is a famous old warehouse and located at ‘IJ’, the main river crossing Amsterdam. Public transport is in front of the venue and it’s a 26 minutes walk and 7 minutes bike ride away from Devconnect’s co-working space in Beurs van Berlage.  Bottom line - Communication channel & Organisers  We are going to plan ahead a few sessions although we are going to leave a lot of space for self organised sessions, feel free to prepare lead & facilitate session - we will try to find you a space at the venue. We created Ethereum Magicians Discord which we would like to use it as communication channel alongside to this forum for sessions. The discord will be used as chat channel for faster communication during the event and to coordinate sessions. Please use forum as main source of information, the Discord should be used for quick coordination. Event coordinators @anettrolikova and @Yorikobeal   Discord link Ethereum Magicians If you have any questions regarding OG Council, type them bellow. We will try to do our best to answer! ",
                    "links": [
                        "https://www.ogcouncil.com/",
                        "https://medium.com/ethereum-magicians/join-our-upcoming-event-in-amsterdam-og-council-aa8355709557",
                        "https://www.nftstandards.wtf/",
                        "https://www.ogcouncil.com/",
                        "https://www.ogcouncil.com/",
                        "https://thegraph.com/en/",
                        "https://goo.gl/maps/pnHc6BQZ24k62ihb6",
                        "https://discord.gg/869Bzt9gUC"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.938151041666666
                }
            ]
        }
    ],
    "group_index": "1644"
}