{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/earn-a-sbt-for-knowing-eip-standard-require-sbt-to-submit-eip/13021",
            "title": "Earn a SBT for knowing EIP Standard (Require SBT to submit EIP?) ",
            "index": 13021,
            "category": [
                "EIPs"
            ],
            "tags": [
                "nft",
                "sbt"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/tint",
                    "index": "1",
                    "likes": "1",
                    "time": "22/02/2023-23:46:25",
                    "content": "Hi everyone, I go by as Tint.eth and I am the co-founder of Lirn.io. We’re aiming to build a proof of education protocol to verify knowledge and skill onchain. We recently published a quiz that tests people’s knowledge about EIP standards. (The information is directly from EIP-1) If a user passes the quiz their wallet becomes legible to mint a soulbound token, hence merit on earning the token. The token can be used for utility cases such as token gating or permitting governance voting. An example case here is if you want to submit an EIP you need to have the token verifying you know the appropriate process of EIPs. You can take a look at the platform here https://lirn.io/. I’d love to connect with subject matter experts who are interested in creating multiple-choice quizzes to help verify knowledge onchain. Additionally, we’re still in our beta stage so open feedback is encouraged. Thank you, Tint.eth ",
                    "links": [
                        "https://lirn.io/"
                    ],
                    "GPT-summary": "Tint.eth, co-founder of Lirn.io, has published a quiz to test people's knowledge about EIP standards. If a user passes the quiz, they can earn a soulbound token that can be used for utility cases such as token gating or permitting governance voting. The token also verifies that the user knows the appropriate process of EIPs, which is required to submit an EIP. Tint.eth is looking for subject matter experts to create multiple-choice quizzes to help verify knowledge onchain and welcomes open feedback as they are still in the beta stage.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Smart contract updates",
                        "Identity and reputation systems",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.691666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/0xlizards",
                    "index": "2",
                    "likes": "0",
                    "time": "24/02/2023-13:49:32",
                    "content": "Hey @tint, sounds interesting. Anything in particular that you’re looking for help with or information on? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tint",
                    "index": "3",
                    "likes": "0",
                    "time": "05/03/2023-07:18:22",
                    "content": "Would love to get in contact to people who can help with exposure and implant this into practice ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "360"
}