{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip0-ethereum-project-management-governance/634",
            "title": "#EIP0: Ethereum \"Project Management\" Governance ",
            "index": 634,
            "category": [
                "Process Improvement"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "1",
                    "likes": "7",
                    "time": "02/07/2018-12:34:38",
                    "content": "The #EIP0 Ethereum Governance topic is usual understood as a governance on the level of the whole community. I would take another approach: I see many projects in ethereum space have good devs but are badly managed and nothing happens. Is it because the classical hierarchy based Project Management doesn’t really work well in ethereum space? Is it because ethereum devs are creative freedom-loving people working distributed over the world and it is not easy to herd the cats? Is it because ICOs promises better money for less job and incentives are not sufficient? I think we should discuss Project Management challenges in Ethereum developer community in the similar way we discuss Governance for whole community. Bad Project Management puts whole ethereum project at risk currently. I would like to discuss the topic at the next FEM “Concil of Berlin”. What about you? ",
                    "links": [],
                    "GPT-summary": "The author proposes to discuss the challenges of project management in the Ethereum developer community, as many projects have good developers but are badly managed. The author questions whether the classical hierarchy-based project management approach works well in the Ethereum space, and suggests discussing this topic at the next FEM \"Council of Berlin.\" The post does not contain any advertising, entirely positive or negative feedback, collaboration requests, or auditing/reviewing of the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.284313725490196
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mitch_kosowski",
                    "index": "2",
                    "likes": "3",
                    "time": "02/07/2018-16:50:48",
                    "content": "I’m not sure I’ll be able to make the Council of Berlin but this is a topic that is near and dear to my heart. I think with an ounce of Project Management a lot of different projects in the space would get a pound of results. I will be following this conversation closely and am very interested in ways to incentivize Project Management in the space as well as how to best demonstrate value by PM’s  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.196428571428571
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ricburton",
                    "index": "3",
                    "likes": "1",
                    "time": "03/07/2018-13:25:01",
                    "content": "I am happy to see someone who cares about this. I think a first step would be to get everyone to do leadership coaching. I use torch.io to make myself less shit at leadership. My goal is to go from terrible to acceptable in 12 months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.683333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "4",
                    "likes": "2",
                    "time": "03/07/2018-15:55:27",
                    "content": "Project management (or lack thereof) is a huge issue and while it is not itself thought of as a “technology”, defining common best practices and toolsets can help Ethereum-related projects run a lot better. At the very least communication channels are needed, if several others gather around this issue here we can create a working group. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.008333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "5",
                    "likes": "1",
                    "time": "04/07/2018-12:04:29",
                    "content": "@ricburton, To be honest, I am in doubts. Is it really the leadership problem that should be solved for better PM? Is it really necessary, that really everyone in ETH community should do leadership coaching? Should really everyone prepare youself to be a leader? Do you think the leadership skills provided by torch.io is compatible with ETH community? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "6",
                    "likes": "4",
                    "time": "04/07/2018-12:47:37",
                    "content": "I think the similar direction. In #EIP0 we have started to talk about governance and now focus has moved to signalling. I think Project Management (and Program Managment, btw!!!) should go similar way. Problem to solve: There are important projects considered to be core part of ethereum are either delayed or not integrated enough. Is there any person, feeling responsibility to track the efforts in public? I don’t know any. Possibly some PM work gets done by EF but it is not public. Solution proposal:  A PM should collect meaningful signals (whatever they are) from the project and make it public accessible by project members and by ethereum community. A PM should provide a public overview of most important projects in ethereum space with focus on integration and interoperability. A PM may be anyone. There could be many PMs with different views. It is less about governance, more about transparency and keeping focus. more ideas?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.974537037037038
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "7",
                    "likes": "1",
                    "time": "05/07/2018-00:29:54",
                    "content": "    Ethernian:  Is it because ethereum devs are creative freedom-loving people working distributed over the world and it is not easy to herd the cats?   This one has my vote. More catherders plz! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.513888888888889
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "8",
                    "likes": "0",
                    "time": "05/07/2018-03:19:31",
                    "content": "    Ethernian:  more ideas?   PM can also attempt to collect and feed back community signaling to those who are doing the primary research and innovation. This ensures that those people are working on something considered useful and what specific problems everyone is facing. I think this happens quite well already (basically on Twitter), but imagine a highly scaled version of Ethereum. How do we qualify what vexxes users? How do we qualify who our users actually are? How do we make sure that feeds back to our developers and researchers? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.033333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/serapath",
                    "index": "9",
                    "likes": "2",
                    "time": "05/07/2018-14:57:30",
                    "content": "I’m not a big fan of project management. All the successful products and services on the market usually have “anonymously” long supply chains - and even if you find some where that is not the case, they span more than a single organisation. In my mind, ethereum or blockchain or p2p or whatever you call that trend that ethereum is part of, it’s all about getting rid of middlemen. In my mind, projects should have customers/clients/users/… and the project makes it’s own decisions - which ideally means every single developer makes his own decisions and takes care of their/her/his clients/customers/users… …and if something doesn’t work well, it’s all open source - copy and fork around the problem. I think “project management” as such should be avoided at all costs and only be a last resort in cases where it’s hard to find an alternative way of doing things. This might mean educating all people with the necessary knowledge and skills around how to organise in such a way - and in cases where this is hard, the copy/fork mechanism can be used to re-structure ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.529291979949875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "10",
                    "likes": "1",
                    "time": "05/07/2018-20:13:26",
                    "content": "The Term “Project/Program Manager” brings us in the similar situation like “Governance”: we don’t like governance in its classic sense, but we can’t ignore problems that governace usually targets. Because that problems are real. In other words the term “Project/Program Manager” is ambigous: it is means both methods (we don’t like) and the problem area (we need to pay attention to) . I use the term “PM” to specify the problem area only. I see problems in area of usual responsibility of Program- and Project Management. If you don’t see any, we can discuss about it. But if you see them, please don’t ignore it only because you don’t like existing managment methods. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.627976190476191
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "11",
                    "likes": "1",
                    "time": "05/07/2018-20:33:27",
                    "content": "    fubuloubu:  but imagine a highly scaled version of Ethereum   This is “Program Management” in my terms. Nobody does it in public currently but it is neccessary. Look at all the EIPs: is there any publicly known person who knows all of them, who knows what the particular EIP is for and what is the status of its implementation? The same is about infrastructure projects around ethereum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.272222222222222
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Danibelle",
                    "index": "12",
                    "likes": "5",
                    "time": "06/07/2018-15:16:55",
                    "content": " as a PM with 20+ years of global corporate software and hardware experience, this is a debate that has been around since before Project Management was even a thing with capital letters. Especially in software dev…  many organizationally and prioritizationally skilled individuals can indeed manage their own work just fine and too, some can also coordinate a teams communication and progress.  We used to joke that my job was to order pizza and throw celebration parties when we delivered on our goals. Really though,  the collection, aggregation, and distribution of holistic data around defining and measuring the varied goals of multiple groups toward a shared mission is a unique role that includes skillfully neutral presentation of that data, reframing discovery in multiple communication forms and channels to ensure accessibility to and comprehension of the information available by people working in different contexts… Leadership of self and of people is always a good learning path for anyone, I won’t discourage that… project (and program) management is a different kind of skillset… it’s managing communication and information and relationships without authority…  it’s more akin, I think, to community organizing. Admittedly I am totally new to Blockchain and Ethereum however I am well-versed in project and program management AND community organizing…  and I am learning by seeking out all these data streams, lurking and following you all  and really really appreciating what I’m finding in these vital governance conversations and decision-making process developments. Thanks for having this one! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.245006887052341
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "13",
                    "likes": "4",
                    "time": "07/07/2018-07:10:09",
                    "content": "    Danibelle:  Leadership of self and of people is always a good learning path for anyone, I won’t discourage that… project (and program) management is a different kind of skillset… it’s managing communication and information and relationships without authority…  it’s more akin, I think, to community organizing.   I think that we are finding our distinction from traditional corporate practices. As a community and within each of our projects, we need to achieve the level of competency and coordination that certain for-profit orgs benefit from, while also not going against our values. We need to achieve these so that our values can prevail. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.438775510204082
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ricburton",
                    "index": "14",
                    "likes": "0",
                    "time": "11/07/2018-16:57:50",
                    "content": "Apologies. I did not mean to derail things. I just know—from personal experience—that I am new to management and need to work on that. It might help others. I should have been clearer  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.4876893939393945
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ltfschoen",
                    "index": "15",
                    "likes": "0",
                    "time": "14/07/2018-09:44:03",
                    "content": "i think ideally developers should be “knowledge workers” that either have sufficient competence to create a pull request (PR) to a codebase, or have verifier-level competence documented in a skills matrix to review/approve a PR. the project/program management/governance associated would be an automated push service built on polkadot or similar equivalent with emphasis on push notifications to mitigate risks, and for compliance and coordination purposes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/serapath",
                    "index": "16",
                    "likes": "0",
                    "time": "16/07/2018-01:03:46",
                    "content": "I publish programming modules to github and npm and i build apps. I do all of this alone or with very few people. But those apps are quite powerful if I think what i can build quickly in a weekend  The reason is, that it only looks like i would work alone on first impression. Oh, I’m not really exceptional nor am I a genius but quite average …and there are so many people with the same ability that i have i can’t even count them… So if you look deeper and think about it, it becomes quite clear, that I actually work in a team with hundreds of people, …actually thousands and more, but i never talk to my colleagues - or at least rarely… I am part of many different teams actually and they all consist of many people and those people are also part of many teams. …and it just works  This is what moves the world forward every day. I don’t believe “project management” or “governance” does that unless you mean exactly the mechanisms that i think of when i write what i have just written above, but i find the term project management and governance inappropriate, because all stories that i can think of that are associated with those words have nothing to do with “my team of thousands of people” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.566071428571428
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "17",
                    "likes": "5",
                    "time": "27/07/2018-18:07:55",
                    "content": "Guys, after some discussions, I’ve changed my mind about the whole domain of “Program/Project Management”. As I already wrote above, the term “Project/Program Management” has two aspects:   Management: usual authoritative management and governance methods. We don’t like that and we are trying to replace them with better approaches.  Construction: put different ethereum projects together, making it working properly.  AFAIK, the ethereum management philosophy encourages people to find tasks for themselves and suporting them if they make something useful. Therefore, the manager’s role is here to find developers and make their reputation and rewards depending from their work done. It is less management but more social netwoking. Putting different parts in some ethereum project together requires broad integral knowledge of many projects in ethereum space, their features, drawbacks and differences. This is a new job profile in ethereum space. I would call it Ethereum Architect. Ethereum Architect …  knows almost all sub projects in ethereum space (and makes his knowledge public), … incl. project’s features, performance, interoperability and future development. proposes ethereum based solutions for external customer’s needs (it is his B2B consultant business). creates a EIP’s in particular projects to improve their interoperability and UX, based on his experience in customer’s projects. usually integrates existing parts together instead of creating new ones. represents customer needs in technical ethereum discussions.  Ethereum Architect performs governance by signalling customer needs into ethereum community, project needs to each other, Ethereum Architect is not a core Developer and not necessary focused on developing of some core project. I would propose to create a Ring of Ethereum Architects instead of this “Project Management”  topic. Your thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.425741792929292
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ghthor",
                    "index": "18",
                    "likes": "1",
                    "time": "01/09/2018-01:55:20",
                    "content": "@ethernian The model you propose here, where architects core role is to analyze and observe the community and then project a positive intention, a goal, is exactly how our biological neo-cortex works. The conscience-ness has no power to make the body do anything outright, it can only suggest that the body do something. Those suggestions are based on observations and attaching symbolic meaning to higher-order patterns. This type of governance structure, one modeled on our own biological brain, is the ideal way to approach this community and project. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.9772727272727275
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "19",
                    "likes": "1",
                    "time": "01/09/2018-17:52:42",
                    "content": "I’m just re-reading this. This is pretty much exactly how the Drupal ecosystem grew up. It had Core and many third party modules. Composing those modules and knowing which were in good shape and which weren’t was a skill in and of itself. And yes, I was one of the people who had his finger on the pulse and bridged tech and business/use cases to do pretty much exactly what you describe. HOWEVER – it also became very insular. Welcoming broad collaboration with all of the decentralized web might be one way to get past this insularity. Finally, the word “architect” is an existing word with very specific (and generally negative) connotations in tech companies / big enterprise. The word “Consultant” would also not be incorrect, but it also has connotations. You might just call this Product Leads or Product Management or Product Design. I called my local meetup Blockchain Product Developers to try and have a broader tent than just the word “Dev”. In any case, interesting, I find your list of tasks / skills very interesting! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.948529411764706
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "20",
                    "likes": "0",
                    "time": "01/09/2018-23:38:35",
                    "content": " @boris Finally, the word “architect” is an existing word with very specific (and generally negative) connotations in tech companies / big enterprise.  I am wondering to hear about any negative connotation of the term “Architect”. I see it positive. Moreover I tried to avoid any hierarchical terms like “Manager”, “Lead” or “Chief”. Lets ask the community: What name is the best for this job?     Ethereum Architect Ethereum Product Lead Ethereum Product Developer     0 voters     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.4480519480519485
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "21",
                    "likes": "0",
                    "time": "07/09/2018-01:48:52",
                    "content": "Architect can be joined with another term in order to re-cast it to better represent the role that you are trying to convey @Ethernian. Examples include “DevOps”, “Design Ops”, “UX Researcher”. Perhaps “Ecosystem Architect”? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "22",
                    "likes": "1",
                    "time": "07/09/2018-12:58:54",
                    "content": "Community operations? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "23",
                    "likes": "0",
                    "time": "08/09/2018-03:26:05",
                    "content": "Name of “Ethereum Architect” is already public. Therefore the change request should be publicly accepted. Personally, I would not start to change the name before real work begins. If we’ll see the name doesn’t fit the real work and some poll will make it clear, then there is no problem to change it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "24",
                    "likes": "0",
                    "time": "08/09/2018-03:47:34",
                    "content": "Good point! There were and still are doubts about the use of  “Council” w/ Magicians’ gatherings. Still, it is important to learn about where people may have misunderstandings due to terminology. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "25",
                    "likes": "1",
                    "time": "08/09/2018-04:59:23",
                    "content": "An Enterprise Architect or Architecture Astronaut are both terms that you can Google to find negative descriptions. Typically denotes people who talk a lot but haven’t been in the trenches actually building & shipping. Sometimes also denotes over engineering or premature planning, rather than building small experiments to learn from. Just wanted to share some things that are used in North America. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.104166666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "26",
                    "likes": "0",
                    "time": "08/09/2018-10:48:24",
                    "content": "we should surely revise it mid-term. Nevertheless I have bad feeling to push a discussion about it right now because it should be a secondary topic not the only one. The work should go 1st. Anyway, everybody can start a discussion about name change at any time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.785714285714286
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "27",
                    "likes": "3",
                    "time": "26/09/2018-02:28:30",
                    "content": "What about Design Wizards? Or Management Mages? ManaMages I cast “Knowledge Transfer” to give your project +5 colloboration! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "28",
                    "likes": "0",
                    "time": "04/10/2018-03:22:25",
                    "content": "    fubuloubu:  I cast “Knowledge Transfer” to give your project +5 colloboration!   “Knowledge Transfer” is a good approach indeed, even it is only a partial aspect… In this case we should think if there any difference to Ring Education. I would discuss it in Prague. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/rumkin",
                    "index": "29",
                    "likes": "0",
                    "time": "22/12/2018-22:10:12",
                    "content": "Disagree with that:     Ethernian:   usually integrates existing parts together instead of creating new ones.    This is not requirement of the leaders. Their goal is to organize productive and effective collaboration of people while product development process. They should decide which direction should developed project to move in. The only requirements are to be competent enough to see perspective and to set clear goals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.741477272727273
                }
            ]
        }
    ],
    "group_index": "1345"
}