{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/council-of-berlin-2019-call-for-topics-and-eips-to-discuss/3425",
            "title": "Council of Berlin 2019 - Call for Topics and EIPs to discuss ",
            "index": 3425,
            "category": [
                "Happenings",
                "Council Sessions"
            ],
            "tags": [
                "gatherings",
                "council",
                "berlin-council",
                "council-berlin-2019"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "1",
                    "likes": "4",
                    "time": "01/07/2019-08:20:48",
                    "content": "Save the date: Main Council August 19, 2019 (during MetaCartel Demo Day) and “More” Council August 20, 2019 (during Web3 Summit) Save the address: Main Council - Berlin Institute of Technology Straße des 17. Juni 135, 10623 Berlin, Germany “More” Council - Funkhaus, Nalepastraße 18, 12459 Berlin, Germany for August 20th Time: Main Council 2pm till 5pm (with 20mins break from 3:40pm till 4pm) “More” Council TBA (we will have 3 hours for Council with break, but exact time we don’t know yet) Time flies so fast and it’s July which means that we are closer to our Magicians Berlin Council 2019  Things are getting more in shape lately and we finally determined the date and place for the Council. Magicians Berlin Council 2019 will happen on August 20 in Funkhaus (on behalf of Web3 Summit). Register form (please register via this form so we will know how many people we should expect)  FEM Council Berlin 2019 Registration form. If you want to organise a discussion or work session and you need our help (with getting a space for it or other logistics) let us know by filling out this form so we can reach you out. If you want to help us with organising this Council, join us on Telegram  Let’s try to keep this topic as the main source of discussion around Magicians Berlin Council 2019  ",
                    "links": [
                        "https://web3summit.com/",
                        "https://docs.google.com/forms/d/e/1FAIpQLScNmzJK5Y3qxeauCo93Du9yJT9MONsfaF4GUsGAEqLID3MqBQ/viewform?usp=sf_link",
                        "https://forms.gle/b87dMTusceiUAfio7",
                        "https://t.me/joinchat/HkTetRP98L9PAowB9y4w_w"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.063888888888888
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "3",
                    "likes": "0",
                    "time": "15/07/2019-17:01:12",
                    "content": "Update There’s official Telegram channel for everyone to join. We would like to gather Magicians that will be in Berlin during Berlin Blockchain Week.   There’s a sheet where you can find topics and individual ring meetings. Feel free to sign up if you want to organise one  ",
                    "links": [
                        "https://www.blockchainweek.berlin/",
                        "https://docs.google.com/spreadsheets/d/16pYOZSjzDhOO5BTb7a3u_pBmU0529OsZPlgRw2DLkI0/edit#gid=0"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "4",
                    "likes": "1",
                    "time": "17/07/2019-14:03:37",
                    "content": "Vision of Magicians Berlin Council 2019: Bring people  — We want to bring people together and talk about problems that we are facing in Ethereum ecosystem. We are all building and contributing to the ecosystem day-to-day and we all want to keep it running in the best technical way possible. Knowledge  — We want everyone to glean knowledge from this meeting and do good for the ecosystem. Facilitate  — We want to facilitate and let people know what we are working on. On the other hand, we want to spread the word about Individual Ring Meetings. We will try to get everyone to know when and where your meeting will be (but you have to let us know that your meeting is happening). Help  — We want to help you with everything that you need to make your meeting happen — whether you need a space or a whiteboard or anything else. Just let us know, we are here for you.  Topics that will be covered at The Council:   Alternateth by @MadeofTin   Business Models by @owocki   Decentralising Data Access by @tjayrush   **Topics that we would like to cover (but haven’t found anyone to discuss them yet — if you would like to talk about these, please sign up ):    EIP — 1559 — Fee market change for ETH1.0 chain  @econoar ? @AlexeyAkhunov ?   ProgPow Delay Issue  @greerso ?   Important Links: ETH Magicians Telegram Channel (no spam, just Magicians and announcements about Council & Individual Ring Meetings) Council Topics & Individual ring meetings sheet feel free to add yours if you want to organise one - we can help you with organisation and logistics around Checklist for Individual Ring meeting have to be filled out after every meeting Template for Individual Ring Meeting Notes  please use this Template when you will be taking notes from a meeting  For more informations check out this medium article:  Medium – 17 Jul 19    Let’s create Magic and talk about what’s important in the Ethereum Ecosystem ✨ We are getting ready for something special. We know that Berlin Blockchain Week is going to be packed with conferences and events, but… Reading time: 5 min read        Also feel free to ping me on Telegram with questions or anything else regarding to Berlin Blockchain Week  ",
                    "links": [
                        "https://ethereum-magicians.org/t/eip-1559-fee-market-change-for-eth-1-0-chain/2783/51",
                        "https://ethereum-magicians.org/t/progpow-audit-delay-issue/3309/85",
                        "https://t.me/ETHMagicians",
                        "https://docs.google.com/spreadsheets/d/16pYOZSjzDhOO5BTb7a3u_pBmU0529OsZPlgRw2DLkI0/edit#gid=0",
                        "https://docs.google.com/document/d/1SCRhSjKgtdYQQuSfdXmWb6c9RMelXX7iSuZSS3Jrt-E/edit?usp=sharing",
                        "https://hackmd.io/6BcaZNrzQrK_lAaRJoeHUw?view",
                        "https://anettrolikova.medium.com/lets-create-magic-and-talk-about-what-s-important-in-the-ethereum-ecosystem-45c94878fe3c",
                        "https://anettrolikova.medium.com/lets-create-magic-and-talk-about-what-s-important-in-the-ethereum-ecosystem-45c94878fe3c",
                        "https://t.me/anettrolikova"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.350563909774436
                }
            ]
        }
    ],
    "group_index": "870"
}