{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/erc-1646-decentralized-autonomous-zero-identity-protocol/2201",
            "title": "ERC-1646\\xef\\xbc\\x9aDecentralized Autonomous Zero-identity Protocol ",
            "index": 2201,
            "category": [
                "EIPs"
            ],
            "tags": [
                "zero-identity"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/zhous",
                    "index": "1",
                    "likes": "0",
                    "time": "12/12/2018-19:54:27",
                    "content": "The readme file: https://github.com/Silkroad-zid/EIPs/blob/master/eip-1646.md The reference implementation for ERC-1646 may be found in Silkroad-Framework/eip. It’s an ongoing protocol. Simple Summary A public autonomous zero-identity protocol which can greatly enhance smart contract based application’s security ,for itself and for the participants, and can be a core protocol to the decentralized autonomous civilization. Abstract This protocol allows any user, developer, organization to register ,backup and update their zero-identities by running smart contracts. It can protect the user’s  social media account and crytoassets held by smart contracts when the private key lost, and it can effectively eliminate theft and fraud from hackers and malicious smart contracts. This protocol is a fundamental protocol for the blockchain‘s decentralized autonomous civilization. The key to true autonomy is that only the owner of a zero-identity rather than any thirty party has full access control over his/her zero-identity unless the owner has his/her guardian or the owner authorizes a thirty party the highest permission. This means this protocol is decentralized, autonomous and anti-censorship. This is a fundamental protocol which an ideal public autonomous blockchain zero-identity framework is based on. It is a key proposal for building blockchain decentralized autonomous ecosystems, such as decentralized autonomous organization (DAO). Definitions   Zero-identity : Briefly speaking a Zero-Identity is a user’s Ethereum address which represents his/her effective identity and interacts with any smart contract in Ethereum.  We need your help cause this is a BIG thing! ",
                    "links": [
                        "https://github.com/Silkroad-Framework/eip"
                    ],
                    "GPT-summary": "The post introduces ERC-1646, a decentralized autonomous zero-identity protocol that enhances the security of smart contract-based applications. The protocol allows users to register, backup, and update their zero-identities through smart contracts, protecting their social media accounts and crypto assets from theft and fraud. The author is asking for help and feedback on the proposal, which is a key proposal for building blockchain decentralized autonomous ecosystems such as decentralized autonomous organizations (DAO).",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Identity and reputation systems",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.2749615975422435
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "2",
                    "likes": "0",
                    "time": "12/12/2018-21:31:40",
                    "content": "I am wondering about the name: Silk_Road is very specific brand and attractor. Unsure whether all people attracted by this brand are kind. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "3",
                    "likes": "0",
                    "time": "12/12/2018-22:03:07",
                    "content": "It would be great if you could compare SilkRoad-zid with Ethereum Universal Login. It will help to understand your approach. Thanks! ",
                    "links": [
                        "https://eips.ethereum.org/EIPS/eip-1078"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/zhous",
                    "index": "4",
                    "likes": "0",
                    "time": "13/12/2018-05:04:54",
                    "content": "The work is all around ERC-1646. Silkroad is the name of the whole project. Just like Enji is a project, but ERC-1155 is a protocol. Silkroad only means a civilization building process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/zhous",
                    "index": "5",
                    "likes": "0",
                    "time": "13/12/2018-05:13:18",
                    "content": "The later is only a solution for Login, but ERC-1646(DAZP) is a security solution for the application of Smart Contract. Maybe I could compare ERC-1646 with ERC-1484, which is not decentralized, not autonomous, not anticensorship, not focused on the application security of smart contract. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2285714285714295
                }
            ]
        }
    ],
    "group_index": "593"
}