{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/dorg-dao-is-recruiting-new-developers/4502",
            "title": "dOrg DAO is recruiting new developers ",
            "index": 4502,
            "category": [],
            "tags": [
                "jobs"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/rihp",
                    "index": "1",
                    "likes": "0",
                    "time": "14/08/2020-23:51:20",
                    "content": "Hello fellow magicians, This is Roberto from dOrg, and we’re happy to see that recently we have received a flood of project opportunities. Right now we’re looking to onboard a new group of agents like you who can fill those spots and help us build the new decentralized future. Here’s something we’ve prepared so that you know what to expect: Calling all Crypto freelancers  Want to get paid by working in a developers DAO? dOrg is a builders DAO and we have openings for epic projects alongside awesome web3 warriors :merman_tone3: About dOrg: dOrg is a collective of crypto native freelancers that join forces to tackle complex web3 projects. dOrg made history in 2019 when it became the first Decentralized Autonomous Organization (DAO) to ever be recognized by law. If you have… At least 1 year of proven experience in any of these, you’ll get far with us  :  Solidity Node React Typescript Rust  Benefits:  Enhanced credibility & support Competitive compensation Work whenever, wherever DAO Stake Friendly and multicultural team  Questions? DM a member or join our community channel at Keybase Next Steps → Submit an activation proposal to the dOrg DAO. Successful applicants will receive 100 USDC and the equivalent voting power. Instructions below  https://dorg.tech/membrane/ ",
                    "links": [
                        "https://dorg.tech/membrane/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166700487012987
                }
            ]
        }
    ],
    "group_index": "1117"
}