{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/how-do-eip-numbers-get-assigned/9079",
            "title": "How do EIP numbers get assigned? ",
            "index": 9079,
            "category": [
                "EIPs"
            ],
            "tags": [
                "eip-editors"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/PaulRBerg",
                    "index": "1",
                    "likes": "2",
                    "time": "28/04/2022-14:59:20",
                    "content": "I’ve read the the EIPs home page and EIP-1 but I’m still not 100% sure how EIP numbers get assigned. EIP-1 says this:  Once the EIP is ready for the repository, the EIP editor will:  Assign an EIP number (generally the PR number, but the decision is with the editors) …   So am I correct to assume that is up to the EIP editors, who oftentimes are different from the EIP authors, to assign a number to an EIP? If yes, and they do not want to use the PR or the issue number, is it common practice to increment the number used in the last EIP, or do they sometimes skip some values for brevity reasons (e.g. EIP-5500 is easier to remember than EIP-5497)? Here’s why I find this confusing. There currently exist two proposals in which the authors seem to have assigned whatever numbers they wanted:  EIP-5555 EIP-9000  This is in spite of the fact that the latest PR number on GitHub is 5045:  My guess is that these proposals haven’t been vetted yet by EIPs editors - but I want to make sure that my guess is correct. ",
                    "links": [
                        "https://eips.ethereum.org/EIPS/eip-1",
                        "https://github.com/ethereum/EIPs/issues/5046",
                        "https://ethereum-magicians.org/t/eip-9000-layer3-scaling-standard/9039",
                        "https://i.stack.imgur.com/wxIZw.png"
                    ],
                    "GPT-summary": "The author of the post is asking a question about how EIP numbers are assigned. They are confused about whether it is up to the EIP editors to assign a number to an EIP and if they sometimes skip values for brevity reasons. They also mention two proposals that seem to have assigned whatever numbers they wanted, despite the latest PR number on GitHub being 5045. The author is seeking clarification on this matter.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Law and regulations",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.575
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/matt",
                    "index": "2",
                    "likes": "4",
                    "time": "28/04/2022-16:56:11",
                    "content": "Your guess is correct. Unfortunately we don’t control what people claim their EIP numbers to be. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/alxi",
                    "index": "3",
                    "likes": "1",
                    "time": "29/04/2022-02:50:33",
                    "content": "But the claimed EIP is over-written by the editors correct? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/poojaranjan",
                    "index": "4",
                    "likes": "1",
                    "time": "09/05/2022-13:36:08",
                    "content": "    PaulRBerg:  So am I correct to assume that is up to the EIP editors, who oftentimes are different from the EIP authors, to assign a number to an EIP?   As per the current process, an EIP number has to be assigned by EIP editor(s). Usually it is the first Pull Request (or Issue, in some cases) for that proposal on EIP GitHub. We are strongly recommending discussion-to at FEM, hence authors are suggested to create a pull request with the proposal and most likely that pull request number is going to be the EIP number. In rare cases where EIP editors observe one/many spam pull requests or issues in the repo followed by a proposal on an attractive number like EIP-5555, EIP editors veto and allocate another unused number.  Here’s why I find this confusing. There currently exist two proposals in which the authors seem to have assigned whatever numbers they wanted:  EIP-5555  EIP-9000   This is in spite of the fact that the latest PR number on GitHub is 5045:  I understand this can be confusing, looking at a discussion thread with already assigned number without the Draft in pull request. We can not control what an author chooses to create a FEM thread for vetting the proposal, rest assured, at the time when added as a pull request Draft, chances are that EIP authors will allocate the EIP number which may be different than whatever shared earlier. As a team working on process improvement, we can educate people to follow good practices and self allocating an EIP number of own choice is certainly not a good one. ",
                    "links": [
                        "https://ethereum-magicians.org/",
                        "https://github.com/ethereum/EIPs/issues/5046",
                        "https://ethereum-magicians.org/t/eip-9000-layer3-scaling-standard/9039"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.800925925925926
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/high_byte",
                    "index": "5",
                    "likes": "0",
                    "time": "22/05/2022-20:54:37",
                    "content": "I propose EIP-10000: use clear descriptive titles in EIP proposals rather than numbers. e.g. this proposal could be EIP-Descriptive-EIPs ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/triddlelover69",
                    "index": "6",
                    "likes": "0",
                    "time": "24/05/2022-06:44:40",
                    "content": "It is a very useful and educational thread on how EIP numbers get assigned. I have learned a lot. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6000000000000005
                }
            ]
        }
    ],
    "group_index": "1721"
}