{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/ethereum-core-devs-meeting-58-summary/3053",
            "title": "Ethereum Core Devs Meeting 58 - Summary ",
            "index": 3053,
            "category": [
                "Announcements"
            ],
            "tags": [
                "core-devs"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/mariapaulafn",
                    "index": "1",
                    "likes": "3",
                    "time": "31/03/2019-20:11:57",
                    "content": "After the last ECH (Cat Herders Call) - some of us agreed on summarizing the core dev meetings and post here and on Reddit for better accessibility and to expand the audience following core dev meetings by creating easy to read summaries. Brett summarized this time. Thank you! (I would appreciate @jpitts if we could create a category for these summaries for people to find them easily) DECISIONS MADE DECISION 58.1  The ProgPoW Carbon Vote signal will be shutting down in 13 days from today. Everyone that wishes to vote will need to do so before this date and ensure they leave their ETH in the address they voted from until after block number 7504000, as per Lane’s tweet. DECISION 58.2  Going forward Clients will not provide generic verbal updates in the meeting but should provide an update in the comments in the agenda. If there are any questions or anything specific to discuss a space will be left to do so. DECISION 58.3  Going forward Reseach will not provide generic verbal updates but should provide an update in the comments in the agenda. If there are any questions or anything specific to discuss a space will be left to do so. ACTIONS REQUIRED ACTION 58.1  Cat Herders to look at updating EIP1, see here. ACTION 58.2  Review the proposed solutions for Roadmaps in the Ethereum Magicians forum to decide if going forward the Core Devs adopts smaller hardforks rather than larger hardforks. ACTION 58.3  Vitalik to format the currently proposed EIP-1559 so that it is correctly presented. ACTION 58.4  Lane to provide a block number for when the ProgPoW Carbon Vote will be shutdown. ACTION 58.5  Discuss if ProgPoW should continue to be implemented if the Technical Audit is not funded in Ethereum Magicians or here or here. ACTION 58.6  Clients should provide updates for future Core Dev Calls in the comments of the agenda and request an update to the agenda if they wish to discuss anything specific. ACTION 58.7  Research should provide updates for future Core Dev Calls in the comments of the agenda and request an update to the agenda if they wish to discuss anything specific. ACTION 58.8  Alexey to create a Beacon Chain Finality Gadget initiative working group and find someone to lead it, for context please see discussion in Ethereum Magicians. ",
                    "links": [
                        "https://twitter.com/lrettig/status/1111652965331415040",
                        "https://github.com/ethereum/pm/blob/master/All%20Core%20Devs%20Meetings/ethereum-cat-herders/PM#19",
                        "https://ethereum-magicians.org/t/more-frequent-smaller-hardforks-vs-less-frequent-larger-ones/2929",
                        "https://github.com/ethereum/pm/blob/master/All%20Core%20Devs%20Meetings/ethereum/EIPs#1559",
                        "http://www.progpowcarbonvote.com/",
                        "https://ethereum-magicians.org/tags/progpow",
                        "https://ethereum-magicians.org/t/what-has-to-be-done-to-get-progpow-on-ethereum/1361",
                        "https://ethereum-magicians.org/t/motion-to-not-include-progpow-without-audit/3027",
                        "https://ethereum-magicians.org/t/eth2-in-eth1-light-clients/2880"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.378472222222222
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "2",
                    "likes": "0",
                    "time": "01/04/2019-06:43:43",
                    "content": "This is a really good format, really needed! Wondering what is appropriate (generally, finished content would go elsewhere e.g. EIPs, EthHub, and Magicians’ scrolls). Would we eventually be summarizing other meetings in the community, not just the core devs? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mariapaulafn",
                    "index": "3",
                    "likes": "1",
                    "time": "01/04/2019-14:51:17",
                    "content": "Hi! if we have sufficient volunteers… We chose Magicians for the summaries and Github for the full call summary - let me know if you have better ideas ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "4",
                    "likes": "0",
                    "time": "01/04/2019-17:20:07",
                    "content": "Ok should this be a new Ring, or under the Education Ring? It may be MP’s Summary Ring , but you’ll want to have this so others can easily help out. A community TLDR for core devs decisions! I found myself doing the same thing with a list of Protocol releases, there was no definitive document. These things needs to be summarized and not primarily in 15 experts’ heads. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.978030303030303
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "5",
                    "likes": "1",
                    "time": "01/04/2019-17:21:53",
                    "content": "It could go in #eips:core-eips but really it should be called what it is – “Core Dev Calls”, and have a category called that. Just like EthMagicians hosts long form discussion for EIPs, no reason the same can’t happen for other content. Edit: under the EIPs top level category might still make sense? Not sure if we need another top level. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.553571428571429
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "6",
                    "likes": "0",
                    "time": "02/04/2019-17:07:08",
                    "content": "Seems summaries (or at least copies of them) should be kept in the https://github.com/ethereum/pm repo along with the agenda and notes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "7",
                    "likes": "1",
                    "time": "02/04/2019-17:43:16",
                    "content": "yes, agreed that committing them as markdown files in the repo would be good, too. The point of posting them here is that discussion and interaction and communication / broadcast goes beyond the bowels of Github. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "8",
                    "likes": "1",
                    "time": "02/04/2019-18:03:10",
                    "content": "Exactly. 01234567890 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "9",
                    "likes": "0",
                    "time": "03/04/2019-04:26:38",
                    "content": "So this brings me back to a Ring formation. This work could happen in a Ring here in the Forum, perhaps this is associated with the Education Ring. The output could be delivered to the EthCatHerders, or simply posted directly to the comments of the core devs meeting agenda (this is always an issue e.g. https://github.com/ethereum/pm/issues/89). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "10",
                    "likes": "0",
                    "time": "03/04/2019-04:54:57",
                    "content": "I’ll make a GitHub issue to finalize. But it’s not an Education ring. It’s a Core Dev notes category. We don’t have to have everything be a ring. @mariapaulafn what do you think — details in the issue:   github.com/ethereum-magicians/scrolls      Issue: Create a Core Devs Meeting Notes category  \t \topened by bmann \ton 2019-04-03 \t \t \t  The first Core Dev Meeting Notes were published https://ethereum-magicians.org/t/ethereum-core-devs-meeting-58-summary/3053 The suggestion is to make a category so all of these can easily...   \tforum       The issues get closed, where they are hidden by default. ",
                    "links": [
                        "https://github.com/bmann",
                        "https://github.com/ethereum-magicians/scrolls/issues/66",
                        "https://github.com/bmann",
                        "https://github.com/ethereum-magicians/scrolls/issues/66"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "11",
                    "likes": "0",
                    "time": "03/04/2019-07:40:59",
                    "content": "I do love the \" Fellowship Gatherings > Core Dev Meeting Notes\" suggestion LOL … who is to say that the core devs conference call is not also a gathering of Magicians? Each Ring is free to call themselves whatever they wish. I will go with this one initially. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                }
            ]
        }
    ],
    "group_index": "782"
}