{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/community-response-to-covid-19/4129",
            "title": "Community Response to COVID-19 ",
            "index": 4129,
            "category": [
                "Announcements"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "0",
                    "time": "11/03/2020-04:34:24",
                    "content": "It now appears as the probability for spread of the disease in our community is becoming an actuality. A little bit over a week ago I decided to dis-engage from working on COVID-19 preventive measures for Ethereum community events. It was a lot of work and I got very little feedback. I hope that someone can pick up on this topic.   twitter.com    Zhen Yu Yong (Zen) (zenzhenyu)  I fell ill yesterday and have just been diagnosed with #COVID2019. Everybody who had close contact @EthCC_ or @ETHLondon with me should take extra precautions and/or get tested  8:15 PM - 10 Mar 2020     1.4K          406            Is there anyone interested in working on this issue? There is a lot of ignorance of the complex issues around COVID-19, which is understandable because who needs another hairball besides Ethereum to understand. But the situation is dire, and we can’t only rely on our local health authorities for ideas and solutions. Here is the Google Doc I started in order to provide recommendations after observing measures taken at ETH Denver:   docs.google.com    Let’s look COVID-19 dead in the eye - DRAFT Let’s look COVID-19 dead in the eye - DRAFT By James Pitts   NOTE: I decided to not release this article. Not enough feedback given! Thank you to those who did provide feedback and encouragement.  WARNING: This article did not receive enough review...      Update: Twitter thread to anecdotally report if you got a flu before or after EthCC, or got tested for COVID-19.   twitter.com    Je-Meng (jemenger)  Let's create some anecdata for all of us to consider: who else got a flu around ETH London or EthCC (specify the time frame, was it before, during, or after)?  Woulda been nice to do this right in terms of privacy but we probably need to be expedient. https://t.co/IwuUnpMpcx Daniel  🦄 Luca (cleanunicorn.eth) @cleanunicornI got a really bad flu after #ethcc .  Anybody else has that?  Was anyone tested for COVID-19?  @EthCC_    6:05 AM - 11 Mar 2020     2          1            ",
                    "links": [
                        "https://twitter.com/zenzhenyu/status/1237577880109907971",
                        "https://twitter.com/zenzhenyu/status/1237577880109907971",
                        "https://docs.google.com/document/d/1aDFhM0pnapMegHL2MvTG6ytvrB0E5XB46kfQysOn0Q4/edit",
                        "https://docs.google.com/document/d/1aDFhM0pnapMegHL2MvTG6ytvrB0E5XB46kfQysOn0Q4/edit",
                        "https://docs.google.com/document/d/1aDFhM0pnapMegHL2MvTG6ytvrB0E5XB46kfQysOn0Q4/edit",
                        "https://twitter.com/jemenger/status/1237726338078797824",
                        "https://twitter.com/jemenger/status/1237726338078797824",
                        "https://twitter.com/cleanunicorn/status/1237160715707994117",
                        "https://twitter.com/jemenger/status/1237726338078797824"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.767020089285714
                }
            ]
        }
    ],
    "group_index": "1027"
}