{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/erc-and-eip-specific-groupchats/11592",
            "title": "ERC and EIP Specific Groupchats ",
            "index": 11592,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "1",
                    "likes": "0",
                    "time": "03/11/2022-17:39:25",
                    "content": "Groupchats, yeah, I know, something that’s very away from the vision of what Ethereum Magicians purpose is - create noise-free discussion to discuss technical difficulties on Ethereum. Unfortunately, no matter how much we try - people still end up creating group chats to relevant EIPs and have discussion outside of Ethereum Magicians Forum. Which is not bad as some discussion may want to be more private. Although the nature is try to keep things open. But not everyone has time to open Magicians forum daily and so groupchats are more effective way to collaborate. I’m sharing here some of the ERC related groupchats which I’m aware of that are topic specific. PLEASE don’t spam them, these channels don’t have good moderation and are created purposefully for specific topic discussions. Join them if you want to contribute, introduce yourself and be active in the discussion.  General NFT Standards Telegram: Join Group Chat - groupchat made as WG to NFT Standards Wiki  EIP-4973 Account-bound tokens Telegram: Contact @eip4973 - groupchat made by @TimDaub for SBT relevant discussion  Music NFT Metadata Standards Working group Telegram: Join Group Chat - This fork of initial NFT Standards WG, working on Music NFT Metadata  Wallet JSON-RPC Ethereum Wallets - and anything related to URLs Any others that should be on the list ? Please link them bellow ",
                    "links": [
                        "https://www.nftstandards.wtf/",
                        "https://t.me/eip4973",
                        "https://t.me/+U2yEL043GVUxZDZh",
                        "https://github.com/morestatic/musicmetadata/wiki/Music-NFT-Metadata",
                        "https://discord.gg/uFTHmUcF58"
                    ],
                    "GPT-summary": "The post lists several group chats related to ERC and EIP topics and invites interested parties to join and contribute to the discussions. The author also asks for suggestions of other relevant group chats.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party advertising proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.8533333333333335
                }
            ]
        }
    ],
    "group_index": "199"
}