{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/architects-gathering-in-prague-follow-up/1724",
            "title": "Architects gathering in Prague (follow up) ",
            "index": 1724,
            "category": [
                "Happenings",
                "Council Sessions"
            ],
            "tags": [
                "council-of-prague",
                "architect"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "1",
                    "likes": "0",
                    "time": "29/10/2018-15:50:46",
                    "content": "Here were are.  Put your names here. Thanks for your time, guys! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/apitkevich",
                    "index": "2",
                    "likes": "0",
                    "time": "29/10/2018-15:55:49",
                    "content": "Guys, many thanks for the session on 29th, I’m looking forward to work together on architecture topics ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/suenchunhui",
                    "index": "3",
                    "likes": "0",
                    "time": "30/10/2018-12:50:04",
                    "content": "Hi, I’ll like to contribute here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "4",
                    "likes": "0",
                    "time": "30/10/2018-13:35:42",
                    "content": "Guys, I hope most of you are at devcon4 now. One of things I would do is to talk to developer of different technologies and ask them for usecases. For example it would be interesting to see usecases for zk-Snarks and zk-Starks provided by their developers. This list of usecases may be very valuable input of any architect. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/apitkevich",
                    "index": "5",
                    "likes": "0",
                    "time": "02/11/2018-00:49:22",
                    "content": "Guys, finally I had some time to process the results of our talk. Here is my brain dump with the support of some pictures taken after the session:  There were about 10 people at the session and we had a good talk We’ve started with the mission, purpose and objectives discussion and the very short summary of it is despite the different angles and the starting positions we all see the value to combine and classify the architecture knowledge in the community. Than we’ve switched to the action list creation where each of us have proposed the actions he think are most important to start with. We’ve ended up with the following:  20181029_164609.jpg931×1248 482 KB   Where the most selected actions were:  20181029.jpg901×697 233 KB   (I actually reviewed it one more time and corrected the counting, see below)   (5 mentioning) : (create) A way to engage architects and start the architecture discussions      - Framework/template for proposing product/requirements and having an architecture discussion (4 mentioning) : (create) A list of architecture parts, best practices & patterns      - Smart contract best practices      - Protocol primitives      - Architecture diagrams & design patterns (2 mentioning) : Create list of architects & topics they are ready to discuss  Github repo for management Robust backend to support Dapp  This ranking by mentionings is a hint and not an obligation: anyone is welcome to fulfill any tasks he would consider as most important. At the end we’ve agreed to continue the communication and use github as a storage for the content materials and discourse for the meta/operational information. We also are going to communicate here on Ethereum-magicians ring    And as a final action we’ve agreed to start collecting the architecture questions\\discussions we think would be a good example (or we simply would like to start). It looks like an information gathering for #1  and the same for known use cases and design patterns which looks like a prep for #2   I’d like to thank you one more time for the constructive work and I’m going to proceed with the actions and create the Github repo - done (https://github.com/Ring-of-Ethereum-Architects), discourse (https://ethereum-magicians.org/c/working-groups/ethereum-architects) and schedule a monthly call for us. The practical information about it would be posted here Repo is available, you are welcome to add your materials\\information.   ",
                    "links": [
                        "https://ethereum-magicians.org/uploads/default/original/2X/b/bcb002f0f2a55b43d0e3afe7c786fde928a7e67b.jpeg",
                        "https://github.com/Ring-of-Ethereum-Architects",
                        "https://ethereum-magicians.org/c/working-groups/ethereum-architects"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.347290640394089
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/virgil",
                    "index": "6",
                    "likes": "0",
                    "time": "03/11/2018-13:30:41",
                    "content": "This place seems of interest to Magicians in Prague. http://www.muzeumpovesti.cz/en/muzeum-alchymystu-a-kouzelniku-stare-prahy/about-museum/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "7",
                    "likes": "0",
                    "time": "03/11/2018-14:01:29",
                    "content": "Thank you, @apitkevich!  (5 mentioning) :  (create) A way to engage architects and start the architecture discussions  I would like to propose (and will start) the social process engaging people into architecture discussions. I assume an existing incentive of developers to compare ethereum tools, frameworks  and services they are using with similar ones in order be up to date and on the most effective stack. The result of that discussions could be structured comparison of items mentioned above convenient for re-use by other devs. I assume it will be much needed by dev community. If you feel my assumptions are not correct, please let me know. I prefer things fail fast. In order to achieve the goal I would…  … create a list, where people could add themselves among the projects they know and ready to share knowledge about. Essentially, it will become a matrix [People] x [Tools,Frameworks,Projects]. Similar process will be set up for matrix [Technology] x [Usecase].  … invite devs to join the list. … identify technology domains and setup comparative talks about items inside it. The result would be public classification and comparison of projects inside the domain. … make public the names of contributers in order to increase their publicity  Anybody is free to join - it is permissionless. There will not be any “official” ranking of Architects, but anyone is free to build his own and subjective ranking  basing on knowledge contributed by people and identify the best of Architects (and corporations and other employers will certainly do so). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.738095238095237
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wschwab",
                    "index": "8",
                    "likes": "1",
                    "time": "06/11/2018-14:26:40",
                    "content": "You may want to also use this resource to update other curated lists. One that springs to mind is ConsenSys’s list here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "9",
                    "likes": "0",
                    "time": "07/11/2018-12:16:13",
                    "content": "It is a really good list! Thank you! As far I see the Architect’s role, one of his jobs is to compare two or more similar parts in context of particular requirements or decide on interoperability of different parts in context of particular architecture. The list is great starting point for the start. Would you like to join the Ring of EA and share you knowledge about particular tools and technologies? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.45
                }
            ]
        }
    ],
    "group_index": "483"
}