{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/wrapped-deposit-contract-eip/7740",
            "title": "Wrapped deposit contract EIP ",
            "index": 7740,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/j_chance",
                    "index": "1",
                    "likes": "0",
                    "time": "10/12/2021-03:21:57",
                    "content": "This is a discussion thread for an informational EIP describing a singleton contract meant to act as a deposit agent. The basic strategy is deploy a tiny, stateless contract that offers a way for other contracts to accept deposits (Ether, ERC20/721). This is done by having the singleton contract call into the destination contract with information about the deposit before executing the transfer. This means a user only needs to approve the wrapper contract once and can then deposit to many applications supporting the interface. This is designed to:  Remove the security implications of approving many application contracts to spend tokens Improve user experience when using tokens with applications Reduce the number of transactions needed when using the Ethereum network  Draft implementation of the wrapper contract here. EIP PR ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pull/4546/files"
                    ],
                    "GPT-summary": "The post is an explanation of an EIP proposal for a wrapped deposit contract. The proposal aims to improve the user experience and security when using tokens with applications on the Ethereum network. The post also includes a draft implementation of the wrapper contract. Some third parties are asking questions and giving constructive criticism of the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Privacy, Security and risk management",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.765625
                }
            ]
        }
    ],
    "group_index": "1540"
}