{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/a-new-direction-for-eth1-x-stateless-clients/3765",
            "title": "A New Direction for Eth1.x: Stateless Clients ",
            "index": 3765,
            "category": [
                "Working Groups",
                "Ethereum 1.x Ring"
            ],
            "tags": [
                "eth1x",
                "storage-rent",
                "stateless-clients"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "1",
                    "time": "10/11/2019-10:10:52",
                    "content": "Something important said by @AlexeyAkhunov at the Devcon5 Eth1 Roadmap was that storage rent is no longer the focus of Eth1.x research, with his effort shifting over to stateless clients. Here is his write-up on the issue:   Medium – 7 Nov 19   On the State Rent and pivot to Stateless Ethereum I should have written this long time ago, but it is never too late. Reading time: 3 min read        To recap, the State Rent project is currently ‘suspended’. And the active research, development and specification is happening around ‘flat db’ state storage model and the Stateless Ethereum.  This emphasis on stateless clients is also receiving attention and support from the Ethereum Research team and the Trinity (Eth1/Eth2 python implementation) team! As part of this support, a new category and tags have been added to ethresear.ch:    Ethereum Research    Eth1.x Research The Eth1.x Research category is for research topics related specifically to the current Ethereum PoW chain often described as Eth1.x. Although we expect synergy in some of the research topics with 1.x and 2.0, the domain is specific enough to often...      https://ethresear.ch/tags/stateless-client I will try to keep cross-linkage going. With this participation w/ Researchers and Trinity, I predict that for the time being most of the relevant discussion will occur over on ethressear.ch. Once the work gets to defining EIPs and getting community feedback, we can bring it over to our neck of the woods  ",
                    "links": [
                        "https://medium.com/@akhounov/on-the-state-rent-and-pivot-to-stateless-ethereum-ab4d967ff630",
                        "https://ethresear.ch/c/eth1x-research/37",
                        "https://ethresear.ch/c/eth1x-research/37",
                        "https://ethresear.ch/tags/stateless-client"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.50777867965368
                }
            ]
        }
    ],
    "group_index": "952"
}