{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/notes-from-evm-evolution-community-call-nov-26th/2030",
            "title": "Notes from EVM Evolution Community Call Nov 26th ",
            "index": 2030,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "community-call",
                "evm-evolution"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "1",
                    "likes": "1",
                    "time": "27/11/2018-05:16:43",
                    "content": "Today we had an #evm-evolution Community Call. The full transcript is on HackMD and the original agenda / discussion is on Github. Perhaps Community Call agendas should be posted on here in the first place, rather than Github? Still experimenting! A lot of the discussion was with the Trail of Bits team and their needs / the needs of the security & assurance community in tools that help analysis. Their SlithIR is designed for this. More discussion and clarity on how LLVM, various intermediate representation (IR) formats, EVM, and eWASM work together in the future is needed. I’ll paste in the end of the agenda discussion from @gcolvin on an implementation plan:  On reinspection, Aleth version is now EVM-C wrapped, and EVM 1.5 code fairly recently removed. So I’d say that path of least resistance is to get EIP-615 working in Aleth again and then port to Parity via EVMC.  Greg is the author of EIP615 and had some code around this last year. Below are the action items I captured: Action Items Plan an All EVM Call   github.com/spadebuilders/community      Issue: Plan an All EVM Call to gather interest  \t \topened by bmann \ton 2018-11-26 \t \t \t  We had ETC Cooperative on the Community Call #14. There are many other blockchains that run EVM or EVM compatible smart...   \tevmevolution  \tplanned        Need to make a list of EVM compatible clients / chains and gather contacts Brooke / Boris will meet with ETCDEV contacts as well  Get clarity on ETH 1.x roadmap around EVM1.5 and eWASM   github.com/spadebuilders/community      Issue: Get clarity on Eth 1.x roadmap around EVM1.5 and eWASM  \t \topened by bmann \ton 2018-11-26 \t \t \tclosed by bmann \ton 2018-11-27 \t  As part of working on EVM, would like more clarity about ETH1.x roadmap and eWASM. As per Casey's post on EthMagicians, there...   \tevmevolution       Goal is to have EVM Evolution support this process and provide expertise from security, VM, and other experts. The question marks here likely need a discussion with @lrettig, others from the eWASM team. Not sure where to look for this information or where discussion is happening. What is the process of rolling out EIP615 Static Jumps and other EVM opcode additions   github.com/spadebuilders/community      Issue: Process of rolling out EIP615 Static Jumps and other EVM opcode additions  \t \topened by bmann \ton 2018-11-26 \t \t \t  Write up a high level set of steps to help explain how new EVM opcodes get rolled out. Focus on EIP615...   \tevmevolution  \tin progress        First high level notes / process here https://hackmd.io/WmnAxhCsS1yd50hj9Ai7eg  Will create tracking issues for this process – e.g. PR against Yellow / Jello paper is the likely next step   General consensus continues to be that EIP615 is valuable and should get implemented, and that more learning / explanation around VMs and IRs to be done. Further explanation to the wider community is needed on how SlithIR – an intermediate representation designed for analysis for security purposes – is highly useful, and that Yul and/or LLVM are lower level IRs that can be used for performance optimization, but don’t help with security analysis. Some discussion on funding and funding sources. Trail of Bits applied to EF with Slither / SlithIR tools, wasn’t approved. Trail of Bits happy to put some time in and collaborate with SPADE, others in moving this forward. Brooke has a personal TO DO to correct / clarify some statements around EVM and eWASM designs. Boris working on diagrams to help communicate – Dan shared some SlithIR and related writing that is helpful. ",
                    "links": [
                        "https://hackmd.io/g0yKhTn3TYaThqFWVjF4Ow",
                        "https://github.com/spadebuilders/community/issues/14",
                        "https://github.com/spadebuilders/community/issues/20",
                        "https://github.com/bmann",
                        "https://github.com/spadebuilders/community/issues/20",
                        "https://github.com/bmann",
                        "https://github.com/spadebuilders/community/issues/20",
                        "https://github.com/spadebuilders/community/issues/19",
                        "https://github.com/bmann",
                        "https://github.com/spadebuilders/community/issues/19",
                        "https://github.com/bmann",
                        "https://github.com/spadebuilders/community/issues/19",
                        "https://github.com/bmann",
                        "https://github.com/spadebuilders/community/issues/19",
                        "https://github.com/spadebuilders/community/issues/18",
                        "https://github.com/bmann",
                        "https://github.com/spadebuilders/community/issues/18",
                        "https://github.com/bmann",
                        "https://github.com/spadebuilders/community/issues/18",
                        "https://hackmd.io/WmnAxhCsS1yd50hj9Ai7eg",
                        "https://github.com/trailofbits/slither/wiki/SlithIR",
                        "https://docs.google.com/presentation/d/1UDW1KsNc5w8xaFLWaisn_ZFqWcflZHWs-_FUpDq_2kk/edit#slide=id.g4957478a19_0_0"
                    ],
                    "GPT-summary": "The post is a summary of a community call discussing the EVM Evolution. The discussion was mainly about the needs of the security and assurance community in tools that help analysis. The post also includes action items and questions about the EVM Evolution, as well as some constructive criticism and suggestions for collaboration.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.697047209547209
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "2",
                    "likes": "0",
                    "time": "27/11/2018-13:52:49",
                    "content": "@lrettig just posted the eWASM working group proposal Ewasm working group proposal for Eth 1.x Which answers some of the questions about the precompile comment that didn’t make any sense. I’ll close the tracking issue I had opened. So essentially this means EVM side by side with eWASM in clients so that eWASM is used to execute precompiles. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "550"
}