{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/invitation-to-a-private-preview-of-an-ethereum-data-feed/11370",
            "title": "Invitation to a private preview of an Ethereum Data Feed ",
            "index": 11370,
            "category": [
                "Happenings"
            ],
            "tags": [
                "nft"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jackfryercass",
                    "index": "1",
                    "likes": "0",
                    "time": "18/10/2022-13:10:37",
                    "content": "Hi Magicians!  Private preview alert  I’m new here and am part of the team at DataStax - we are the ones behind Astra DB, a cloud-native database that runs on Apache Cassandra. But that isn’t why I’m here… We have been working to build an Ethereum Data Feed, allowing our users to sync the complete Ethereum dataset in minutes and store an always up-to-date copy of the Ethereum blockchain in their databases. Want to be clear that this will also be available to our free users too! To showcase what can be built with this new feed, we have built two sample applications that leverage this real-time Ethereum data. The first sample NFT Explorer. Built using React and Next JS, this application gives the user a complete view of NFTs supported on the Ethereum Blockchain that have been minted or transferred in real-time. You can get hands-on with the application here. The team has also created an industry-first, open-source Ethereum Explorer. Like the NFT Explorer, the app pulls all of the blockchain data from Astra DB and gives the user a real-time view of the latest blocks that have been mined, along with the latest Ethereum transactions. You can take a look at our Ethereum Explorer using this link. Why am I telling you? Before we publicly launch this capability, we want to get it into the hands of experienced Web3 developers and Ethereum Magicicans as part of our private preview program. I wanted to offer a private preview of this feature to you and give you all an opportunity to test this capability for us. We are offering $300 giftcards to all participants of this preview! We would be more than happy to include any sample applications in our launch materials, and you’d have the chance to chat with some tech journalists and be an integral part of our launch. If you just want to kick the tyres of this new offering, we would still love to have you join our preview and hear your feedback. If you’d like to get involved in this industry first, please respond and I can send out the preview welcome pack, including links to our documentation. ",
                    "links": [
                        "http://krypton-frontend-staging.herokuapp.com/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.32806324110672
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jackfryercass",
                    "index": "2",
                    "likes": "0",
                    "time": "18/10/2022-13:12:44",
                    "content": "For those interested - you can reach me at jack.fryer@datastax.com ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "172"
}