{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/distributed-accomplishable-intents/7219",
            "title": "Distributed Accomplishable Intents ",
            "index": 7219,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/michaeldunwort1",
                    "index": "1",
                    "likes": "0",
                    "time": "06/10/2021-03:41:58",
                    "content": "I’m a new user so limited on the content/links I can post, but you can find the unedited version here   Distributed Accomplishable Intents    tl;dr - We’re should aim to turn the address bar into a search engine. Encoding the function calls and search terms for desired outcome into a natural language system.  Can I borrow your brain for a second? I need you to try and wipe the idea of the address bar as a way to send and receive assets. Pasting in the janky addresses. Going through triple checking a bunch a characters to make sure they’re correct, then finally pulling the trigger and clicking confirm. In fintech these are referred to as “payment intents” where we have a finite path that user can go down to checkout. Sort of how you present different fields based on what payment method you choose, it’s like a pre-defined path to collect the necessary information as seamlessly as possible to complete your checkout. An example for crypto would be with MakerDAO. “Deposit collateral and generate DAI”. Because it’s a common use-case, a pre-defined intent of users opening CDP’s it means that we can build a one click behaviour. It’s a common theme, and will only trend more and more toward repeated value adding intents. Think of it more as a way to “communicate” your goals and intentions of your payment to a distributed system. Example Language  “Deposit.ToSavings.eth” (this deposits into compound, and returns CUSDC) “dai.toBitcoin.eth” (converts DAI to WBTC as outlined in the example above)  If you are looking for a simple mental model think of it this way… New users get something like an Amazon 1 click checkout for Ethereum smart contract interactions. New users get a familiar “Google” like interface UX/UI flow. ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining a proposal called \"Distributed Accomplishable Intents\" which aims to turn the address bar into a search engine for payment intents. The proposal suggests encoding function calls and search terms into a natural language system to make the payment process more seamless. The post also invites feedback and constructive criticism on the proposal and advertises it as a way for new users to have a simple and familiar interface for Ethereum smart contract interactions.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.454278499278499
                }
            ]
        }
    ],
    "group_index": "1466"
}