{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/charging-for-tickets-participant-numbers-event-ticketing-for-council-of-paris-2019/2321",
            "title": "Charging for Tickets, Participant Numbers & Event Ticketing for Council of Paris 2019 ",
            "index": 2321,
            "category": [
                "Happenings"
            ],
            "tags": [
                "events",
                "ticketing",
                "council-paris-2019"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "1",
                    "likes": "3",
                    "time": "02/01/2019-22:48:19",
                    "content": "Hello all! Happy 2019! We’re only a little over 2 months away from the Council of Paris, happening alongside ETHCC in Paris. Here are some items from this morning’s @council-volunteers call, which happen Wednesday morning 8AM PST / 17:00 Central Europe time. Charging for Tickets I proposed that we charge for tickets for the Council of Paris 2019. Our costs for food (lunch and coffee) are roughly 30EU per person, and food is also the single largest cost. So, this seems like the right number to ask for. The second reason for charging for tickets is to make sure we have a more accurate idea of how many people are attending. As always, “all are welcome” – so anyone not able to pay would still be welcome. This just makes sure that we ask people to support the event right up front, and get commitment to attend by paying. Ideally, we would collect ticket fees in ETH – participants are active in the Ethereum community, and creating a wallet and getting access to 30EU worth of ETH doesn’t seem too much of a barrier for new participants. Anyone have thoughts on why we shouldn’t charge for tickets? Participant Numbers We are planning for 200 participants. ETHCC is, I think, planning for about 1000 attendees, so at 20% this seems a decent guess. We did find in Prague that many more people registered than attended, so either Kickback (for “free” events) – or actually charging for tickets – we think will help get more commitment from participants. For space planning, we mainly need to be concerned with the maximum amount for a “main stage” gathering, plus looking at smaller classrooms / break out spaces. Think this number will be lower or higher? How many participants do you think we should be planning for? Event Ticketing We ask that people register / get a ticket so we can 1) plan numbers 2) communicate with them. As above, it also means collecting fees to help cover costs. I have reached out to the Kickback team to ask if they would actually let us charge for tickets (that is – no refund!). If we do get enough sponsors, we could refund tickets still, but this all comes down to budgeting and sponsorship interest. I have also used Tito for tickets in the past (just for ticketing / event management) – but we would need to ask for payment via ETH in some other way. Eventbrite would be the same – could do the ticket event management, but would need to take ETH payment separately. I will be researching this area, if other people have favourite event ticketing apps that can send email updates, please share! Alternate solutions on how to accept ETH for tickets while also gathering name and (optional) email address for communications also welcome.  P.S. Yes we are looking for more volunteers and sponsors. Talk to @tomislavmamic or message @council-sponsorships  who is the lead organizer to get involved. We’ll ideally finalize ticketing and open registrations at the end of next week, so start planning your ring topics and other things you want to discuss! ",
                    "links": [
                        "https://ti.to",
                        "https://ethereum-magicians.org/t/council-of-paris-2019-announcement/2438",
                        "https://ethereum-magicians.org/t/stable-magicians-poll-exchange-vs-cdp/2377/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.132549452861953
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "2",
                    "likes": "1",
                    "time": "03/01/2019-00:12:22",
                    "content": "Kickback should allow designating a large portion of the amount staked towards event costs, meaning it should be possible to use it like Eventbrite basically (or up the stake to 40 EUR to experience the “kickback effect”) I know the team is working pretty hard on the dapp, and with the idea that the coat be collected in ETH, this seems reasonable to me. It would be great to promote a reasonable community project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.980442176870748
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "3",
                    "likes": "2",
                    "time": "03/01/2019-00:35:49",
                    "content": "I suggest pretix as a ticketing solution. It is libre software. I was at multiple events using this system - always happy with it - just recently 35c3 with 16k participants - but also at very small events using it. ETH payment could be easily done as a plugin: https://docs.pretix.eu/en/latest/development/api/payment.html I would strongly signal against using Tito - let’s use libre software and dogfood as much as possible! ",
                    "links": [
                        "https://docs.pretix.eu/en/latest/development/api/payment.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/makoto",
                    "index": "4",
                    "likes": "0",
                    "time": "03/01/2019-20:06:35",
                    "content": "Hello. Makoto from Kickback. Thanks for considering the use of Kickback. I would like to ask a few questions to clarify the requirement.     boris:  so anyone not able to pay would still be welcome   Does this mean just an event crasher with no registration, or do you still want registration but payment as an option (like ETHDenver application process)? What are the actual cost     boris:  If we do get enough sponsors, we could refund tickets still, but this all comes down to budgeting and sponsorship interest.   Is this either “get all refund or no refund” or some sort of partial refund (eg: if total cost is 100 and you got sponsorship of 70, then you refund 30 split across participants)? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.990972222222222
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "5",
                    "likes": "0",
                    "time": "03/01/2019-23:59:29",
                    "content": "Not really concerned about event crashing. We ask for registration for planning and communication. And, with payment, to help cover costs. I don’t have the budget link handy. Simple thing is that we need to order catering which is roughly 30EU per person. All or partial refund: I would say that all or nothing would be the most likely scenario. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.571428571428571
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/makoto",
                    "index": "6",
                    "likes": "1",
                    "time": "07/01/2019-08:58:04",
                    "content": "Sorry for the bit of the silence. To handle “paid event”, it’s technically not difficult to modify payout logic so that the max payout can be adjustable by the organiser, etc. Having said that, we just announced using Kickback for  various ethereum meetups around the world, and supporting both free and paid event for March deadline is not feasible for us (especially coming up with UI which makes sense for both free and paid event). We just did a bit of brainstorming in our team and came up with a couple of solutions which could serve the purpose. Option 1: Use Kickback as is Currently we have the infamous “cooling off” feature where event organiser can claim the remaining ETH if attendees do not withdraw their ETH within one week cooling period. In the past 10~30% of people haven’t withdrawn but the figure may become lower as your commitment is 3~5 higher than the usual. This is the default way to have \"optional donation\" but this does not give you any assurance to cover the cost which you are after (NOTE: We are planning to get rid of this feature in Q1). Option 2: Abuse Kickback You (ETHMagicians) can just RSVP along with other participants but only mark yourself in so that you can get all the ETH. This is actual the dispute case #1 which I described here, but you guys can try it as one off experiment in the following conditions.  You will write description and make sure that people are aware that they may not being marked as attended despite the fact that they do attend. Kickback will not be responsible for involved in any disputes. You will still encourage participants to help you refer sponsorship In case you could not raise enough sponsorship and you don’t kickback, then we will modify our site to delist from our event listing page (/events) after the event ended. This is because having 1/200 attendees is unintended use of our platform and we would like stop confusing people visiting the site later on. As a platform usage fee, we usually charge $1 per attendance. If you decide not to kickback attendees, then we do charge per RSVP as you guys are not marking anyone as attended.  Would either of them solve your problem? If you really want to make modification to our code, then I suggest forking our old BlockParty code and deploy on your own though this misses lots of new features (eg: sign up, email notifications, better admin UI, etc). Weather you decide to use Kickback or not, I am more likely to attend ETHcc/EthMagicians and would happy to help. ",
                    "links": [
                        "https://medium.com/wearekickback/handling-disputes-at-kickback-82dc6f49d3e2",
                        "http://github.com/makoto/blockparty"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.509588068181818
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "7",
                    "likes": "0",
                    "time": "07/01/2019-21:43:06",
                    "content": "Thank you for this long thoughtful response @makoto! It sounds like selling tickets in the traditional sense isn’t really something that Kickback is focused on – totally understand that. Ideally we’re going to make an initial decision this week. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.107142857142858
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "8",
                    "likes": "0",
                    "time": "07/01/2019-21:53:31",
                    "content": "Hey @ligi I just had a look at Pretix. It is either a hosted version (basically equivalent to lots of other services out there, no Ethereum support) or I guess you meant a community install. I looked at the Docker installation. I try and run things on Heroku so I don’t have to deal with servers  – but it does look like there is a pretix docker image and I could arrange to have someone get this setup – either tickets.ethereum-magicians.org or I would use the tickets.ethereumevents.global domain that I own. And then developing a custom Ethereum payment system that integrates with pretix  I’m interested in working on a community / EthMagicians ticketing solution that can accept ETH (and DAI and other arbitrary ERC20s) and especially at the beginning of the year there could be lots of others that want to use this throughout 2019. I’m not sure if we can get this done quickly enough. We could use a self-hosted pretix for registration and then follow up in a couple of weeks? a month? once a payment solution is deployed? Do you have other thoughts on this @ligi? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.069444444444445
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "9",
                    "likes": "0",
                    "time": "08/01/2019-16:39:44",
                    "content": "@boris: there seems to be a docker image: https://docs.pretix.eu/en/latest/admin/installation/docker_smallscale.html but we could also IMHO at first use the hosted version and then confirm ETH payments manually as there is not much time left for ETHCC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "10",
                    "likes": "0",
                    "time": "08/01/2019-19:16:51",
                    "content": "    ligi:  then confirm ETH payments manually as there is not much time left for ETHCC.   This is the exact issue  I mean, I can put a message that says “you have to pay in ETH” but essentially we are doing free tickets and hoping people pay and/or lots of work in matching this up. The best way to ensure people pay is to have ticket registration all in one flow. And running the hosted version isn’t really that different than just using, say, Eventbrite or Tito which would be much easier to use (since I know those systems already). I still think this is worth doing and getting setup for future events, so I will look at both the docker option and the hosted option. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.807291666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "11",
                    "likes": "0",
                    "time": "08/01/2019-19:47:30",
                    "content": "    boris:  And running the hosted version isn’t really that different than just using, say, Eventbrite or Tito   I think there is a difference.It is still libre software in contrast to Eventbrite or Tito - so the upgrade path to self-hosting and the possibility to improve the software is there. The more you use systems like Tito or Eventbrite - the more you lock your self in into a jail of closed software … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "12",
                    "likes": "2",
                    "time": "08/01/2019-21:50:10",
                    "content": "OK, I setup an organizer account on the hosted version for FEM. @ligi I added you to the “admin” team, just so someone else has access for now. Will set it up so there is a team per event and hand out more access to volunteers. Turns out there is a “manual payment” option. Where you can give instructions on how to go pay by ETH, for example. I am waiting for my organizer account to be “approved” before I can bring it live. I’ve had to put in my credit card and I guess you get charged even for manual payments? But I’m willing to try out. Here’s a screenshot of the “manual payment” configured to use ETH. Elsewhere, I have email directing people to the EthMagicians donations page / wallet address. Will need some help testing this once it is live. Note to self: mark this down on the Infrastructure page in the Scrolls wiki  Screenshot 2019-01-08 13.39.38.png2474×1444 251 KB   Also, funny coincidence @codydjango jumped into our Discord chat and it turns out he has a background with Python/Django that pretix is written in, but is new to Ethereum. He’s going to look into what it would take to build a plugin. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.095959595959596
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/codydjango",
                    "index": "13",
                    "likes": "1",
                    "time": "08/01/2019-23:22:46",
                    "content": "Yep, I’ll take a look this evening.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "14",
                    "likes": "2",
                    "time": "09/01/2019-00:48:00",
                    "content": "No hurry on this. The “manual” payment option means we are unblocked. But, I think running our own instance as a service to the Ethereum community who want to collect in ETH would be pretty great. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.749999999999999
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ligi",
                    "index": "15",
                    "likes": "0",
                    "time": "09/01/2019-00:55:32",
                    "content": "Just wondering: perhaps it could make sense to take DAI instead of ETH ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/codydjango",
                    "index": "16",
                    "likes": "2",
                    "time": "09/01/2019-02:52:46",
                    "content": "I haven’t worked with DAI before, but I’m pretty sure I could do this as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/makoto",
                    "index": "17",
                    "likes": "0",
                    "time": "09/01/2019-12:30:00",
                    "content": "FYI GörliCon choose option 1 https://kickback.events/event/0xe2d2c31c68626b6c1301a49ed50854e1cae0c8fa About your Kickback contribution: as mentioned, Görli Testnet is facing funding difficulties. We are setting up a 0.2 ETH deposit to come to the event. As in Kickback’s usual fashion, you can either choose to claim it back, or donate to the project - this is entirely up to you and no fingers will be pointed. All proceeds will go to funding Görli Testnet.``` ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/markoprljic",
                    "index": "18",
                    "likes": "0",
                    "time": "09/01/2019-19:11:03",
                    "content": "@boris I just purchased the ticket. Did you set up everything already, because I’m seeing my order still pending even though I have confirmed transaction on Etherscan https://etherscan.io/tx/0x5ccad705e6d5418fe4875aed07aa0b54bee6ff0288af6f8e63953ddb0429efe6 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/markoprljic",
                    "index": "19",
                    "likes": "0",
                    "time": "09/01/2019-19:41:26",
                    "content": "Update: it just went through and got my ticket. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "20",
                    "likes": "0",
                    "time": "09/01/2019-19:44:04",
                    "content": "oh awesome! Thank you for testing! That was the next step, getting people to go through it. This is a manual process right now. So I saw this message, logged in to pretix, verified that the transaction was in the EthMagicians wallet and then “marked the order as paid” in pretix. I also added a comment to the order with a link to your transaction in Etherscan. Please, do you have any notes on the ticket process or the instructions? I am proposing we go ahead with this method for now. I can give access / permission to other people to also help manage pretix and edit the wording and so on. I would say I need at least one other person for this event (and, @ligi is also an admin on the FEM organizer acount). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.596938775510204
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/markoprljic",
                    "index": "21",
                    "likes": "0",
                    "time": "09/01/2019-19:57:39",
                    "content": "Thanks for that! No special comments, the purchase process ran quite smoothly, nothing significant to report. However, I was rushing a bit and wanted to add my order number to the message afterwards, too late and I couldn’t find where to add it since the website with my order already had the order number written. From that point I wasn’t clear to what the “website” refers to and wether I should have added the order number to message in transaction? Just that, otherwise all good and IMO you can push the button @boris ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.961734693877551
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "22",
                    "likes": "0",
                    "time": "09/01/2019-20:10:51",
                    "content": "Great! The website being https://donations.ethereum-magicians.org – as part of using the site, you can enter in a message, like in this screenshot:  ethmagicians_donations_leaderboard.png1531×665 75.4 KB  I’ve filed an issue on the donations leaderboard page – if you have suggestions for design, wording, or other items, please comment. And @markoprljic the wording can definitely be improved. I needed someone to test it – which you did! There isn’t, as far as I can tell, a please to come back and manually add something into an order. Basically we need people to tell us their transaction that matches their order number if they don’t enter it into the message. ",
                    "links": [
                        "https://ethereum-magicians.org/uploads/default/original/2X/0/0a0d2d58f509c49f0b2e486de6477a7e4ea53f4f.png"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/markoprljic",
                    "index": "23",
                    "likes": "0",
                    "time": "09/01/2019-20:17:04",
                    "content": "One more thing if we’re doing manual confirmations, assuming someone (I could as well) would do it daily in bulk maybe, to inform user that it may take up to xx hours to be confirmed and that they will get notified by email. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/markoprljic",
                    "index": "24",
                    "likes": "0",
                    "time": "09/01/2019-20:35:34",
                    "content": "    boris:  Basically we need people to tell us their transaction that matches their order number if they don’t enter it into the message.   That was my concern after completing transaction. In Metamask I couldn’t add message to transaction with my order number, and I was paying via pretix. Is there an option in pretix to add a field for sender address so we can match without relying on people telling us their order number and etherscan? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "25",
                    "likes": "0",
                    "time": "09/01/2019-21:45:30",
                    "content": "Yes. We can add custom questions. That’s a good solution. I’ll file an issue to track what things we need to ask people for registration. Here’s my thoughts right now:  food preferences incoming ETH address rings interested in topics interested in, especially EIP numbers open feedback / questions  Anything else we should ask as part of registration? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.238095238095238
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/markoprljic",
                    "index": "26",
                    "likes": "0",
                    "time": "09/01/2019-22:11:17",
                    "content": "Following some common sense e-commerce usability (although this doesn’t strictly fall into this category) I’d leave the registration/purchase process flat with addition for sender address. Leave all other questions as part of a survey after confirmed purchase/transaction. We have their emails, setting up a short survey (Google or other), to get more info that helps us better organise the event, is an easy task. If confirmative, want me to help with that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.629166666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "27",
                    "likes": "1",
                    "time": "09/01/2019-22:29:21",
                    "content": "I understand your point of view from ecommerce. I have found that anything that attempts to gather info separately (e.g. Google Survey) has gotten 1% conversion. We don’t have a problem with signups or ordering (or haven’t in the past). We do have problems with getting info and confirmation  – let’s add questions to pretix for now. I’ll DM you here for your email address and invite you into pretix and we can go from there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                }
            ]
        }
    ],
    "group_index": "617"
}