{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/open-call-for-core-devs-help-us-design-the-solution-for-signalling/918",
            "title": "Open call for Core Devs: Help us design the solution for signalling ",
            "index": 918,
            "category": [
                "Working Groups",
                "Signaling Ring"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/MaxSemenchuk",
                    "index": "1",
                    "likes": "1",
                    "time": "01/08/2018-09:33:49",
                    "content": "Dear Core Devs, as you know we have a ring that works on the signalling solution. While we have plenty of ideas to start buidling, but we’d like to get some signal from you first. Thus we’re asking you to answer some questions. If you’re ready to help us here’re the options. Option A: have an interview with beautiful Anna Rose Option B: answer a formal questionnaire. Here’s the link to the google form: https://goo.gl/forms/IH5AiT9FItbxwOTZ2 or just answer here below. Thanks in advance, we hope to help with coordination and develop efficient tools for the community. List of questions:  What’s your name / Github handle? How long are you in Ethereum Development? How do you select what to work on now? What do you consider a “core dev”? What is a core dev responsible for? What is a core dev not responsible for? How important is the community feedback to your work? How do you get your information about community sentiment now? How much coordination do you have with other ethereum developers? Is there anything particular you need now in regards to coordination?  ",
                    "links": [
                        "https://matrix.to/#/@arro:matrix.org",
                        "https://goo.gl/forms/IH5AiT9FItbxwOTZ2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.163194444444445
                }
            ]
        }
    ],
    "group_index": "1732"
}