{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/ideas-about-anonymous-meta-transactions/1982",
            "title": "Ideas about anonymous meta transactions ",
            "index": 1982,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "meta-transactions",
                "meta-magicians",
                "privacy"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/suenchunhui",
                    "index": "1",
                    "likes": "1",
                    "time": "23/11/2018-01:41:30",
                    "content": "I would like to seek opinions on good ideas for doing meta transactions while maintaining privacy on the identity of the user? Main reason is to allow B2B activities where buyers, sellers and possibly financiers can move tokens around or interact with smart contracts, but do so using ephemeral addresses that are one-time use to protect privacy, and known only for the duration these parties are interacting with each other. This is particularly important because leakage of identity can create unfair advantage in an open buy/sell market. How can we keep privacy, while bringing in the UX conveniences of meta-tx? My current idea involves embedded meta methods directly into the ERC20 token, but i’m not sure if that’s a good approach? ",
                    "links": [],
                    "GPT-summary": "The author is seeking feedback on ideas for anonymous meta transactions to enable B2B activities while maintaining privacy. They propose using ephemeral addresses that are one-time use to protect privacy, but are unsure if embedding meta methods directly into the ERC20 token is a good approach. The post asks for opinions and suggestions on how to maintain privacy while bringing in the UX conveniences of meta-tx.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.540750915750916
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/pet3rpan",
                    "index": "2",
                    "likes": "0",
                    "time": "23/11/2018-04:30:12",
                    "content": "You might benefit from watching the recent metacartel community call. We talked quite a bit about anonymous meta transactions https://www.youtube.com/watch?v=x8RPeH0OjCc ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/suenchunhui",
                    "index": "3",
                    "likes": "0",
                    "time": "23/11/2018-12:50:00",
                    "content": "hi @pet3rpan, Thanks for the video link. I’m not sure of the username of Ali who presented about anonymous meta tx, but I do have a question on that… Does it mean that the technique have a similar semi-privacy guarantee to UTXOs in bitcoin? Since the origin address will be revealed during a coin transfer, so all spent transaction can be traced to form a transaction graph (but not future unspent ones)? Its an interesting technique nonetheless. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.026785714285714
                }
            ]
        }
    ],
    "group_index": "543"
}