{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-5539-revocation-list-registry/10573",
            "title": "EIP-5539: Revocation List Registry ",
            "index": 10573,
            "category": [
                "EIPs"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/DennisVonDerBey",
                    "index": "1",
                    "likes": "2",
                    "time": "29/08/2022-19:45:31",
                    "content": "This is the discussion thread for EIP-5539 (currently in draft): Revocation is a universally needed construct both in the traditional centralized and decentralized credential attestation. This EIP aims to provide an interface to standardize a decentralized approach to managing and resolving revocation states in a contract registry. The largest problem with traditional revocation lists is the centralized aspect of them. Most of the world’s CRLs rely on HTTP servers as well as caching and are therefore vulnerable to known attack vectors in the traditional web space. This aspect severely weakens the underlying strong asymmetric key architecture in current PKI systems. In addition, issuers in existing CRL approaches are required to host an own instance of their public revocation list, as shared or centralized instances run the risk of misusage by the controlling entity. This incentivizes issuers to shift this responsibility to a third party, imposing the risk of even more centralization of the ecosystem (see Cloudflare, AWS). Ideally, issuers should be able to focus on their area of expertise, including ownership of their revocable material, instead of worrying about infrastructure. We see value in a future of the Internet where anyone can be an issuer of verifiable information. This proposal lays the groundwork for anyone to also own the lifecycle of this information to build trust in ecosystems. ",
                    "links": [],
                    "GPT-summary": "The post is an explanation of EIP-5539, a draft proposal for a decentralized approach to managing and resolving revocation states in a contract registry. The author discusses the problems with traditional centralized revocation lists and proposes a solution that allows issuers to focus on their area of expertise while anyone can be an issuer of verifiable information. A 3rd party gives constructive criticism of the proposal and asks questions about it.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.981481481481481
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/strumswell",
                    "index": "2",
                    "likes": "2",
                    "time": "29/08/2022-21:46:37",
                    "content": "It was great working with you and @lleifermann on this one! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MajdT51",
                    "index": "3",
                    "likes": "0",
                    "time": "20/09/2022-13:39:30",
                    "content": "Is there any reference implementation of the contract? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/DennisVonDerBey",
                    "index": "4",
                    "likes": "1",
                    "time": "20/09/2022-13:51:24",
                    "content": "We’re currently working on it, but it’s mostly done. Please keep in mind that this repository contains more features than the EIP describes (upgradeable proxy contract for example). We will try to do a simplified version as a reference implementation some time. Contract repository:   GitHub    GitHub - spherity/ethr-revocation-registry: A reference implementation of an... A reference implementation of an EIP-5539-compatible revocation registry for Ethereum. - GitHub - spherity/ethr-revocation-registry: A reference implementation of an EIP-5539-compatible revocation ...      Controller dependency to interact via Javascript:   GitHub    GitHub - spherity/ethr-revocation-registry-controller: The node module that... The node module that allows you to control your Ethereum revocation lists & resolve revocation keys.  - GitHub - spherity/ethr-revocation-registry-controller: The node module that allows you to...      ",
                    "links": [
                        "https://github.com/spherity/ethr-revocation-registry",
                        "https://github.com/spherity/ethr-revocation-registry-controller",
                        "https://github.com/spherity/ethr-revocation-registry-controller"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.666666666666666
                }
            ]
        }
    ],
    "group_index": "78"
}