{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/istanbul-hard-fork-community-call/3816",
            "title": "Istanbul Hard Fork Community Call ",
            "index": 3816,
            "category": [
                "Process Improvement"
            ],
            "tags": [
                "community-call",
                "istanbul",
                "hard-fork"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "1",
                    "likes": "2",
                    "time": "29/11/2019-13:49:27",
                    "content": " Istanbul%20HF%20CC%20thumbnail%201280×720 984 KB  Istanbul Hard Fork is about to happen. Magicians decided to call it out and invite Ethereum Cat Herders and Community to join the community call about Istanbul Hard Fork. We would like to let the community know how Istanbul Hard Fork will affect the Ethereum ecosystem. Let the community ask questions and chat about Hard forks that happened in the past.  Moderator @anettrolikova   Hosts @souptacular @poojaranjan @MadeofTin and more   Date and Time DATE: Wednesday 4th of December TIME : 2pm UTC    Location Zoom: Available only to hosts YouTube Livestream Link  Agenda:  Welcome intro into Hard Forks - what are they, effects of HF on the ecosystem … (briefly) Previous HF - briefly recap the HF that happened and how they affected & changed the ecosystem Istanbul HF - what EIPs are included (mention EIP-1884), how this update will affect the ecosystem, what changes it will bring  Post your questions to this thread, they will be most likely answered on a call. ",
                    "links": [
                        "https://savvytime.com/converter/utc-to-germany-berlin-united-kingdom-london-ny-new-york-city-ca-san-francisco-china-shanghai-japan-tokyo-ny-new-york-city/2pm",
                        "https://www.youtube.com/watch?v=zv5E9bq34j4&feature=youtu.be"
                    ],
                    "GPT-summary": "The post is an invitation to a community call about the upcoming Istanbul Hard Fork in Ethereum. The authors explain what a hard fork is, briefly recap previous hard forks, and discuss the EIPs included in the Istanbul Hard Fork and how they will affect the ecosystem. The post also invites the community to ask questions and participate in the call.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.011111111111111
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MadeofTin",
                    "index": "2",
                    "likes": "1",
                    "time": "29/11/2019-13:52:35",
                    "content": "Would it be a good idea to post this on the reddit to ask for questions people would like answered? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/souptacular",
                    "index": "3",
                    "likes": "0",
                    "time": "29/11/2019-14:04:53",
                    "content": "Yes that’s the plan  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "6",
                    "likes": "0",
                    "time": "29/11/2019-14:41:42",
                    "content": "Oh, I’m not a fan of Reddit so I don’t have enough karma to post it on Reddit. Can someone please post it on Reddit and post link to this thread please  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tjayrush",
                    "index": "7",
                    "likes": "1",
                    "time": "02/12/2019-22:19:51",
                    "content": "I didn’t know who to contact otherwise, but I was looking at this page https://blog.ethereum.org/2019/11/20/ethereum-istanbul-upgrade-announcement/ which announces the coming hard fork, and I thought this question:  What happens if I am a miner or node operator and I do not participate in the upgrade?  With this answer:  If you are using an Ethereum client that is not updated to the latest version (listed above), your client will sync to the pre-fork blockchain once the upgrade occurs. You will be stuck on an incompatible chain following the old rules and you will be unable to send ether or operate on the post-upgrade Ethereum network.  Could be expanded to explain how to recover from this situation. I don’t think it’s that hard (someone can correct me). I think they just have to upgrade even if they missed the fork, so perhaps a sentence something like:  If you do get stuck on the incompatible chain, you can simply upgrade your client and it will catch back up to the correct chain eventually.  A little mini EIP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.664583333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/poojaranjan",
                    "index": "8",
                    "likes": "0",
                    "time": "03/12/2019-15:10:37",
                    "content": "I think it is visible on Reddit, at least I can see it. https://www.reddit.com/r/ethereum/comments/e3fa42/istanbul_hard_fork_community_call/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "9",
                    "likes": "0",
                    "time": "13/12/2019-12:02:11",
                    "content": "Thank you all for an amazing call  ! We are looking forward to do more similar calls in the future  For those who missed this call, it was recorded. The recording is available on YouTube ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.65
                }
            ]
        }
    ],
    "group_index": "965"
}