{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/proposed-process-for-assigning-opcode-address/4302",
            "title": "Proposed Process for Assigning Opcode Address ",
            "index": 4302,
            "category": [
                "Process Improvement"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/MadeofTin",
                    "index": "1",
                    "likes": "0",
                    "time": "20/05/2020-17:01:07",
                    "content": "It came upon the previous ACD that an author was unclear how an address is chosen for a precompile. I wrote a sample process that uses an EIP registry that tracks all opcodes. An Author would submit a PR to the registry to request an address as part of the processes. Reasons this might be a good thing.  Clear to Authors how to proceed The current spec of all opcode/precompiles exists in a single place.  Reasons it might not be a good thing  More complex than necessary Process for process sake  Some proposed text that could be included in the EIP or EIP-1 .  Process for Assigning Precompile Addresses Once an EIP containing a precompile has progressed to REVIEW or has progressed to a sufficient maturity* the authors may propose a precompile address through a PR to the PRECOMPILE REGISTRY(TBD). The Precompile Status reflects the EIP status it references. *The definition of sufficient is arbitered by the EIP Editors and is left to their decision. Example Format      Value Mnemonic δ α Description EIP Status     0x00 STOP 0 0 Halts execution. YP FINAL    Thoughts? ",
                    "links": [],
                    "GPT-summary": "The post proposes a process for assigning opcode addresses and suggests using an EIP registry to track all opcodes. The author explains the process and provides reasons for and against it. The post ends with a question asking for thoughts on the proposal. A third party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.6645021645021645
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MadeofTin",
                    "index": "2",
                    "likes": "0",
                    "time": "21/05/2020-14:26:58",
                    "content": "   gitter.im    ethereum/AllCoreDevs @MadeofTin: It came up on the the last call the process for deciding a precompile address isn’t clear. I wrote a proposal for a simple process we could adopt if we feel it appropriate and helpful....      Some discussion in ACDs ",
                    "links": [
                        "https://gitter.im/ethereum/AllCoreDevs?at=5ec5628c9832dd6f04649aa4"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MadeofTin",
                    "index": "3",
                    "likes": "0",
                    "time": "21/05/2020-14:27:34",
                    "content": "Suggested Process: Alexander @shamatar May 20 11:10 I’d say it’s an overkill. I’d say that after EIPs are accepted (implemented and go into the testnet) then continuous chunk of addresses should assigned as it happened now. It’s not necessary to know addresses beforehand. If more than one EIP in a batch requires addresses than in EIP number ascending order each of them gets an assignment. Before finalization even the number of proposed precompiles may change Martin Holst Swende @holiman 01:02 Final state of precompile addresses might be good to include in hf meta-eips (if any precompile was added) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                }
            ]
        }
    ],
    "group_index": "1067"
}