{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/whisper-v2-request-for-requirements-for-unified-messaging-protocol-x-post-to-ethresear-ch/2433",
            "title": "Whisper v2: Request for requirements for unified messaging protocol - X-Post to ethresear.ch ",
            "index": 2433,
            "category": [
                "Working Groups"
            ],
            "tags": [
                "whisper"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/atoulme",
                    "index": "1",
                    "likes": "2",
                    "time": "16/01/2019-01:53:58",
                    "content": "Hey folks, In an effort to expand on our efforts and include the community at large around Whisper, @Ethernian has posted to ethresear.ch a first post asking for feedback and comments on how messaging will work under the new ETH 2.0 paradigm. The post is here. Your feedback and thoughts are very welcome. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.000811688311687
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "2",
                    "likes": "2",
                    "time": "16/01/2019-07:26:05",
                    "content": "Updated the title to better reflect the topic. I’ve seen this on reddit and other forums, often it is a good idea to indicate the “primary post” of an X-Post in the title. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.84375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "3",
                    "likes": "1",
                    "time": "22/01/2019-13:48:13",
                    "content": "Guys, I would like to submit for topic “Whisper v2: Unified Ethereum Secure Messaging” on Magicians Council in Paris 2019. I would like to discuss …  What do Ethereum Projects expect from Secure Messaging and why they are re-implementing it? What should be improved on whisper in order to make it convenient to use for most ethereum projects? //open for other aspects  In order to get a time slot we need to present enough people interested in the discussion. Please  the post to signal your interest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.017857142857142
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/cryptogoth",
                    "index": "4",
                    "likes": "0",
                    "time": "26/04/2019-17:47:46",
                    "content": "Hi @Ethernian thanks for starting this discussion (I know it’s a late reply) I’m investigating the use of Whisper to implement private securities trading for a current and future consulting clients, and also to coordinate cross-chain swaps, sidechannels, and similar beasts. I’ll respond to the original topic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.171875
                }
            ]
        }
    ],
    "group_index": "647"
}