{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/discussing-long-term-cashflow-and-budgets-for-ethereum-projects-teams-and-individuals/1849",
            "title": "Discussing Long Term Cashflow and Budgets for Ethereum Projects, Teams, and Individuals ",
            "index": 1849,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "budget",
                "funding",
                "business-models",
                "cashflow"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "1",
                    "likes": "10",
                    "time": "09/11/2018-01:15:38",
                    "content": "TL;DR: Here is a template for planning out cashflow and budgets for projects. Let’s use these to have a discussion about sustainability, the complexity & need for some global  entities, and how to work together and improve all of this.  For our own work at SPADE in getting support for ERC1066 and the rest of FISSION Suite, and our new project around EVM Evolution, I modified a set of cashflow / budget planning spreadsheets that I’ve used to support new startups. It’s a vastly simplified version of Christoph Janz’s Point Nine Capital Financial Planning for SaaS startups. Cashflow & Budget Planning Worksheet - Google Docs   docs.google.com    Open Source Budget TEMPLATE Open Source Project Template   O, Open Source Budget Template, Dec-18, Jan-19, Feb-19, Mar-19, Apr-19, May-19, Jun-19, Jul-19, Aug-19, Sep-19, Oct-19, Nov-19, Dec-19, Jan-20, Feb-20, Mar-20, Apr-20, May-20, Jun-20, Jul-20, Aug-20, Sep-20, Oct-20,...      Use File > Make a Copy.. so you can edit it. Please DO make comments directly on the sheet if you have questions I developed these this summer and shared them with some of the ECF team when I heard that nothing like this was being used to support teams. I also used them for our ECF and EF grant submissions. A startup (or new business), isn’t fundamentally different than an Ethereum project. The project may be inside an existing company, but in many cases grants go to individuals or teams who are thrown into the deep end of having to create new corporate entities. This means getting legal and accounting setup, getting banking facilities, and everything else around tracking cash, not running out of money, and planning for the future. These worksheets are by no means done. Some of the issues include: It assumes zero costs for an office or hardware. They don’t really include a plan for annual taxes of a corporation. They run at “break even” for the project – meaning there is no “margin” on top of paying people, meaning there is no buffer. I started work on a recurring sponsorship model, which really needs to be expanded. And, this is at the project level. If one company takes on multiple projects, then cashflow can be buffered and some expenses shared. (I really need to document all these issues / assumptions) Collaborating on Solving Issues I had early discussions with Ben, the head of the Status Incubate program, of how to share resources on getting to sustainability as companies, as small teams, as projects. The business model ring that @owocki kicked off is obviously related. There are early discussions beginning about a couple of related topics. One is how grants are handed out – if you don’t already have a company setup and need to scale beyond one person, all of this setup has to be repeated for each project. Does this mean grants should go to existing organizations? Or should individuals and small teams be encouraged to form? How should they be supported? How can we “share” some of this setup? The second is the need for long term security & sustainability. One off bounties and small grants might fund a 3 - 6 month project. But a year or two years are more appropriate for some deep problems, especially in the sense of having the individuals working on it having it as their full time job – where they don’t need to be constantly looking at getting another small grant to keep going. What Should People Get Paid? Related to this is a discussion around market rates. Apparently, for many individuals in the ecosystem, they were making very low rates compared to programming jobs in the industry. It’s great that people want to work on open source – but if anything it should be MORE expensive, because it can be re-used and doesn’t need to be re-written multiple times. Buffer – which is a transparent, global company with team members around the globe – has a public salary calculator for roles that might be a useful starting point for discussion. That page also links to their spreadsheet of all their staff salaries as a reference. Minimum Entity? I had reviewed Open Collective for EthMagicians as one existing structure that could be used to support open source projects without having to setup an entity – but then a lot of the other work goes back to the individual who has to figure out the rules around laws and taxes in their home country (or rules for what it means to be a nomad worker). This came up in Meta Magicians as well. We need to define the problems that we are solving. Some are “have a bank account” and “make sure taxes are paid”. Others might be “formally employ or contract people in some country” or “help pay and manage health benefits” (cough USA cough). Disclaimer My disclaimer? I’ve been thinking about this for a long time, and the foundation that @expede and I created – SPADE – was in part created to potentially be a friendly corporate entity that can help support individuals and teams with the fiat- and state-based world. I created an “open source” corporation 15 years ago in growing the Drupal ecosystem, and saw a lot of the same issues. I knew this was going to be a problem for us, so thought about it a little ahead of time as part of the setup. I’ve been tracking related concepts around commons based peer production and changing open source licenses and support models. Oh, and Opolis – started around ETHDenver – may solve some of the portable entity issues. They have an entity in the US for starters. Next Steps Do we want to do a call to discuss this topic broadly? What problems need to be solved? I am putting up my hand to help people fill out these cashflow and budget worksheets for their project, including hiring plans, capturing other costs, and so on. Leave a comment or DM me and we can setup a call. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1CqaIu4ZupDWU0IedRXQw2coJptUhhyyMTu7ep6nNmIU/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1CqaIu4ZupDWU0IedRXQw2coJptUhhyyMTu7ep6nNmIU/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1CqaIu4ZupDWU0IedRXQw2coJptUhhyyMTu7ep6nNmIU/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1CqaIu4ZupDWU0IedRXQw2coJptUhhyyMTu7ep6nNmIU/edit?usp=sharing",
                        "https://buffer.com/salary/",
                        "https://docs.google.com/spreadsheets/d/1l3bXAv8JE5RB9siMq36-Ogngks2MT6yQ5gt8YXhUyAg/edit",
                        "https://github.com/ethereum-magicians/scrolls/issues/8",
                        "https://spade.builders/about",
                        "https://blog.bmannconsulting.com/commons-based-peer-production/",
                        "https://blog.bmannconsulting.com/further-thoughts-on-the-fair/",
                        "https://opolis.co/",
                        "https://ethereum-magicians.org/t/community-call-with-megan-knab-treasury-management-crypto-accounting-jan-24th-2019-8am-pst/2420/4"
                    ],
                    "GPT-summary": "The author of the post provides a template for planning out cashflow and budgets for Ethereum projects, teams, and individuals. The post discusses the need for sustainability, the complexity of global entities, and how to work together to improve the situation. The author also highlights some issues with the template and invites collaboration to solve them. The post includes constructive criticism, questions, and an offer to help others fill out the cashflow and budget worksheets.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.373816287878787
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "2",
                    "likes": "2",
                    "time": "09/11/2018-01:18:51",
                    "content": "Paging @OKDuncan @lrettig who I know are involved in some discussions around this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/owocki",
                    "index": "3",
                    "likes": "1",
                    "time": "09/11/2018-19:33:35",
                    "content": "two thoughts here:  i am tracking the addition of this information to the FEMBusinessModels github here => https://github.com/FEMBusinessModelsRing/web3_revenue_primitives/issues/9  remind me to shill you gitcoin.co/grants when it launches.  we’d love to do an opencollective grant, and i think that many in the community would be happy to support it (i believe that consensys grants would be a good starting place to get some seed capital)  ",
                    "links": [
                        "http://gitcoin.co/grants"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "4",
                    "likes": "0",
                    "time": "09/11/2018-20:36:32",
                    "content": "Will keep tracking. Something like a mix between Open Collective and Opolis could be interesting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/RexShinka",
                    "index": "5",
                    "likes": "0",
                    "time": "13/11/2018-20:52:36",
                    "content": "Hi, this is very relevant to EthSecurity.  We have 5 people involved.  We got funding from multiple grants and funded a 1 day conf with everything being paid by individuals.  There is no organization yet.  Any advice would be appreciated.  This year we will do even more, we hope. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5249999999999995
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "6",
                    "likes": "0",
                    "time": "13/11/2018-21:16:06",
                    "content": "You might want to start by doing a 2019 budget plan. Happy to review it once you have a draft. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "7",
                    "likes": "0",
                    "time": "13/11/2018-23:23:13",
                    "content": "great work, @boris! a lot of thanks for sharing it! I need a little bit more time to read and understand all your thoughts, but one question I would ask right now: Why you don’t use the power of crypto in your constructs? Is there nothing suitable and ready to use or there are any other reasons? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.545758928571428
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "8",
                    "likes": "0",
                    "time": "13/11/2018-23:46:12",
                    "content": "I’m not sure what you mean by using the power of crypto? I’m structuring this in one “currency” right now – it’s set to USD but could be anything. And behind the scenes, the payments or others could be paid in crypto, or banked in crypto. But, my thinking is that you need to do legal, accounting, etc. and set up real world organizations somewhere in the world. Otherwise, you are pushing all of the work onto the individuals, who each need to be freelancers who do their own accounting and legal and so on. And so, we form organizations where different people have different skill sets, and we can get some quantities of scale. Since I don’t know what you mean by power of crypto, I don’t know if that answered your question or not? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.095779220779221
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "9",
                    "likes": "0",
                    "time": "14/11/2018-00:06:08",
                    "content": "    boris:  Since I don’t know what you mean by power of crypto, I don’t know if that answered your question or not?   Sorry for unclear question. I don’t mean crypto as money, I mean cryptoeconomy as set of incentives and workflows. It could be something big like colony, or a smaller approach for accepting donations an UnOrgs, or some kind of ICO (just an example). All this approaches are about get people organized, funded and working for particular goal. It is very UnOrg way to get things done, but you don’t suggest any workflow based on cryptoeconomy. Why? ",
                    "links": [
                        "https://ethereum-magicians.org/t/donations-to-the-un-organisation-of-ethereum-magicians/1746"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.155092592592593
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/OKDuncan",
                    "index": "10",
                    "likes": "1",
                    "time": "14/11/2018-11:45:35",
                    "content": "Boris, thanks for starting this thread. We have a Funders League group call that has been brainstorming how to lower the barrier to entry for devs looking for support (shoot me your telegram if you want to jump in). This has manifested into a potential ‘grant clearing house’ concept where people can bring proposals to be refined and receive advise on where they should submit. Coming up with some reasonable guidelines on how folks should expect to be paid would ease the decision making process for programs and help set stronger expectations - I like the conversation you started here. RE: Cryptoeconomic approaches to receiving funding – I agree with examining more approaches to understand how to most effectively distribute capital. The EF Grants program has been able to give to both entities and individuals… if the individuals have a team working with them we prefer for an entity to be formed at some point. Understanding tax law etc for these funds is another thing that I know is a large cognitive overhead for the grant recipients and would be really useful for there to be a central advisory source to help with this. Ultimately developing a ‘common app’ type system for funding would be highly beneficial for the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.220879120879122
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "11",
                    "likes": "2",
                    "time": "14/11/2018-20:31:52",
                    "content": "My point with this thread is, how do small teams share resources and get funding. This is mainly about budgeting and being realistic about costs. If someone wants to plug a DAO or something on top of it – sure. But it doesn’t solve any problems around how much people should get paid or budget planning. Might crypto be used to collect votes / funds for what is important to work on? Maybe. That’s not the layer that this is about. Let’s say an R&D project with $250K of funding was funded – how do 2 people work on it for a year? How do they need to setup their company or freelance structures? What other tasks and costs do they have? And, for example, our original FISSION Codes budget had $30K worth of bounties budgeted for various integrations, translations, and so on. That’s using crypto incentives at a certain layer. Even work that can be turned into smaller tasks effectively, has to be turned into those tasks by someone. Does that help? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.082539682539682
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "12",
                    "likes": "1",
                    "time": "15/11/2018-03:55:53",
                    "content": "Thanks for clarifying! I think that we can learn from the nonprofit world, how projects deal with grants, budgeting, and tranches. I will reach out to a few people I know from nonprofits outside of Ethereum, as well as in the community. The Ethereum Foundation’s Grants program has some very relevant experiences too. @boris do you have any experiences to share from the Drupal world? UPDATE: I now see in your original post those links to articles on your blog… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.945
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "13",
                    "likes": "2",
                    "time": "20/11/2018-16:02:45",
                    "content": "Via Twitter discussion the topic of treasury management came up again, and apparently already small teams are keeping everything in ETH and not doing any treasury management (or creating an entity or bank account). Another missing piece from the templates I created would be tracking different currencies. They are currently denominated in USD. Not sure a spreadsheet is the best way to model a whole multi-currency treasury management model. I mentioned on Twitter, I think something like 6 months of expenses in whatever currency the expenses need to be paid in could be a good rule of thumb to start with. That expenses currency is the key part. If people involved are being contracted in DAI – great! But if they are being paid in USD or EUR, then likely they should be kept in that expense currency, rather than pushing the conversion to the end receiver. As I said, would love some input from some finance operations / treasury management experts! @decanus @fubuloubu @chisel don’t know if Yalor has an account here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.105769230769232
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/YalorMewn",
                    "index": "14",
                    "likes": "3",
                    "time": "21/11/2018-02:41:57",
                    "content": "I do now @boris and just to clarify I am not a “treasury expert” or anything, far from it, I am however a person committed to supporting open source projects and the long term health of the Ethereum Environ. So I chimed in on that thread to make it known that we are working solutions for Grantees at the Grant Ops project (which is literally just getting it’s feet) I would love to collaborate on and potentially fund the crowdsourcing and creation of articles that we can host on our site and share with all the teams we come in contact with. So for now let’s keep discussing and see where the path leads us, I’ll keep an eye on this channel and thanks again for the invite! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "15",
                    "likes": "2",
                    "time": "21/11/2018-21:38:55",
                    "content": "RE: What Should People Get Paid? At the Ethereum Foundation, there is currently a base rate for contractors that varies based on experience, but IMO is generally too low for major cities. I have been advocating that there be a global base rate based on experience + an additional amount based on regional living costs. The regional addition would be changed once the contractor notifies their lead that he/she will be living somewhere for longer than a month. Recently I started thinking that if a person is moving around a lot, the EF should carry that person’s living expenses, and otherwise give that person the base rate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.5703125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "16",
                    "likes": "1",
                    "time": "01/12/2018-07:08:37",
                    "content": "    boris:  I had reviewed Open Collective for EthMagicians  as one existing structure that could be used to support open source projects without having to setup an entity – but then a lot of the other work goes back to the individual who has to figure out the rules around laws and taxes in their home country (or rules for what it means to be a nomad worker).   Open Collective has a bunch of updates rolling out. I’ve arranged for a Community Call with Open Collective so that various projects can ask questions from the OC team. ",
                    "links": [
                        "https://ethereum-magicians.org/t/community-call-with-open-collective/2085",
                        "https://ethereum-magicians.org/t/funding-taxonomy-issues-for-ethereum-ecosystem/2014"
                    ],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.921875
                }
            ]
        }
    ],
    "group_index": "514"
}