{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-5489-nft-hyperlink-extension/10431",
            "title": "EIP-5489 - NFT Hyperlink Extension ",
            "index": 10431,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/IronMan_CH",
                    "index": "1",
                    "likes": "0",
                    "time": "18/08/2022-08:28:18",
                    "content": "Add EIP-5489 by Ironman_CH · Pull Request #5489 · ethereum/EIPs · GitHub NFT Hyperlink extension. Give an use case, such as in advertisement industry, they can take NFTs as the medium of promotion, and put advertisement as an attachment on NFTs. It has that potential to impact if it grows as a standard. If anyone else would like to add their thoughts, please reply in the post. Let’s get this moving forward. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SamWilsn",
                    "index": "2",
                    "likes": "0",
                    "time": "23/08/2022-16:21:05",
                    "content": "Hey! Since your EIP involves URI/URL and a new scheme, I’d recommend coming out to the AllWalletDevs discord and joining the URI/URI Working Group discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/IronMan_CH",
                    "index": "3",
                    "likes": "0",
                    "time": "24/08/2022-02:54:00",
                    "content": "I see, will join that URI/URI Working Group. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/IronMan_CH",
                    "index": "4",
                    "likes": "0",
                    "time": "24/08/2022-03:37:40",
                    "content": "The invitation is invalid now. I got the following toast.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/bfondevila",
                    "index": "5",
                    "likes": "1",
                    "time": "06/03/2023-10:05:06",
                    "content": "Thanks @IronMan_CH - this is a great initiative that also allows intraoperability within the same blockchain, allowing 3rd parties to add their own metadata to the NFT. I have a question however - what’s the rationale behind making authorization a MUST by including it as part of the standard? Since I don’t see the risk of the usual DDoS due to data growing out of control, because the way to access that data is also providing the address of the slot setter. In the interest of decentralization I see this as an opportunity for web3 projects to immortalize NFTs from dead projects by giving them a second wind, in the form of metadata updates specific to 3rd party players. This is a revised simplified reference implementation based on that: simplified-IERC5489/ERC5489.sol at main · bfondevila/simplified-IERC5489 · GitHub Such a pity that I saw this EIP so late! But potentially could submit a simplified proposal as another EIP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.087962962962963
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/IronMan_CH",
                    "index": "6",
                    "likes": "0",
                    "time": "06/03/2023-10:21:02",
                    "content": " I have a question however - what’s the rationale behind making authorization a MUST by including it as part of the standard? Since I don’t see the risk of the usual DDoS due to data growing out of control, because the way to access that data is also providing the address of the slot setter.  Because, there exits ownership problem. It’s the answer for “If the slot’s trade makes profit, who should that profit belongs?”. If we extend this question, there will be a slot DEX on chain for EIP-5489. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.03125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/bfondevila",
                    "index": "7",
                    "likes": "1",
                    "time": "06/03/2023-10:55:44",
                    "content": "I see. It certainly has a need for that specific use case of using an NFT as a billboard, but the foundation of it could still be permissionless (if we talk exclusively about NFT hyperlink extension). Based on your answer I do see the need for two standards - a permissionless one that allows for fully decentralized NFT hyperlinking, and a permission based one that could be used by external operators such as an exchange. I’ll join the discord and discuss it further with the team, thanks for your response! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.386904761904762
                }
            ]
        }
    ],
    "group_index": "55"
}