{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/five-arguments-against-fee-burning-in-eip-1559/5184",
            "title": "Five arguments against fee burning in EIP-1559 ",
            "index": 5184,
            "category": [
                "EIPs"
            ],
            "tags": [
                "eip-1559"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/kladkogex",
                    "index": "1",
                    "likes": "8",
                    "time": "18/01/2021-13:26:11",
                    "content": "EIP-1559 has two pieces. One is a more effective auction for fees.  Most people agree that it is a great improvement. The other piece is fee burning.   Many people oppose it. Here are some arguments why fee burning is a bad idea.   Psychology.  People simply are not used to burning money. It feels unfair and wasteful.   Miners feel victimized since the network prefers to burn money vs paying miners.   Security.  Fee burning will immediately affect the security of the network, as the hash rate is paid by miners. Less money for miners means a lesser hash rate.   Fairness.  Fee burning is good for whales since it makes the price of the token higher.  Bad for miners.   So rich guys will become richer at the expense of guys that secure the network.   Fairness.  Small miners invested in hardware. Noone told them about fee burning.  Now they will make much less money.   Changing rules is unfair.   Can cause ETH to Fork.  Many miners are so unhappy, they are openly talking about forking the network.   ",
                    "links": [],
                    "GPT-summary": "The post explains the two pieces of EIP-1559, an improvement in auction for fees and fee burning. It then presents five arguments against fee burning, including psychology, security, and fairness. The post does not advertise or collaborate on the proposal, nor does it receive entirely positive or negative feedback. Instead, it provides constructive criticism and raises questions about the proposal, potentially leading to an audit or review.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Law and regulations",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.321969696969697
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/CryptoBlockchainTech",
                    "index": "3",
                    "likes": "7",
                    "time": "18/01/2021-17:33:48",
                    "content": "    kladkogex:  Fairness. Small miners invested in hardware. Noone told them about fee burning. Now they will make much less money. Changing rules is unfair.   I will add a 6th. 6. Integrity. GPU miners have been getting squeezed by ASICs for 3 years, yet the developers refuse to live up to what the founding yellowpaper explains why Ethash was developed, to prevent ASICs on the network. GPU miners invested in hardware with the expectation that ASICs would not be allowed on the network. 1559 just further agitates the miners as they see developers working with other communities to help profitability. The difference however it is written in the yellow paper that Ethereum opposes ASICs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.4966856060606055
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ButtaTRiBot",
                    "index": "4",
                    "likes": "5",
                    "time": "22/01/2021-11:32:10",
                    "content": "Decentralization   Miner will need to pay the base_fee for their payouts - Do you think it would attract more small miners, thus decentralize the network, by saying “You now need to have 0.1x ETH to get your 0.1 eth payout” ?   Mining will not be borderless. Miners will need to have $x to cover the base fee at least. Mining is the only way to introduce new users into the ethereum ecosystem without KYC. Let’s not forget all the countries where KYC’ing is not as easy as in priviledged parts of the world like the US/EU.   Security  The current hashrate is pretty much distributed. Around ~50% of the hashrate is currently non-asian. The EU/US hashrate has been growing faster than the Asian hashrate by a factor of 2 on Ethermine, which provides the largest non-asian hashrate. [Compare here yourself]. Due to cheaper electricity prices in Asia, we can assume that with 1559, mining will centralize towards china.  9.1.  An emergency merge to Ethereum 2.0 does not come without compromises and will come with worse UX - exactly what 1559 is trying to solve. @MicahZoltu states in his post that an emergency merge to Ethereum 2.0 if miners are malicious is a valid plan, but in reality it is not and wishful thinking at best. If such plan would be valid, then there is no reason to wait and we should merge ASAP. ",
                    "links": [
                        "https://i.imgur.com/2JvsdB9.png",
                        "https://hackmd.io/S6kW1MjvT8-SjmaoZTyaJw?view#Reducing-pay-of-miners-will-cause-them-to-revolt"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.263146167557933
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/kladkogex",
                    "index": "5",
                    "likes": "3",
                    "time": "22/01/2021-12:42:30",
                    "content": "    ButtaTRiBot:  an emergency merge to Ethereum 2.0 if miners are malicious is a valid plan, but in reality it is not and wishful thinking at best.   Well - Satoshi Nakamoto has given us all a beautiful algorithm that worked perfectly and securely. ETH 2.0 is a new thing and I wish for it to end up as successful as Satoshi’s genius, but it will take many years for it to prove security. In the meantime, if someone tries to forcefully kill PoW clearly there will be people that will keep on mining PoW. Some people will think the old thing is better, some people will think the new thing is better. Some super clever people will put eggs in both baskets,  which may be the most rational thing to do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.147727272727273
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ButtaTRiBot",
                    "index": "6",
                    "likes": "1",
                    "time": "22/01/2021-14:25:20",
                    "content": "Valid concern, what do you think?  Has no one raised argument that fee burning might put ETH at SEC radar? This is nothing more that stock buyback to increase value for investors. Commodities don’t decrease their supply. Securities territory.    twitter.com    Bastard (BastardTrader)  @sparkpool_eth @etherchain_org Has no one raised argument that fee burning might put ETH at SEC radar? This is nothing more that stock buyback to increase value for investors. Commodities don't decrease their supply. Securities territory.  5:42 AM - 22 Jan 2021     1            ",
                    "links": [
                        "https://twitter.com/BastardTrader/status/1352617828860489732",
                        "https://twitter.com/BastardTrader/status/1352617828860489732"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AFDudley",
                    "index": "7",
                    "likes": "5",
                    "time": "22/01/2021-14:36:08",
                    "content": "Burning isn’t a stock buy back. ETH is clearly not a stock (we can argue if it’s a different type of security, but at this moment it’s not considered one in the US or any other jurisdiction I’m aware of. IANAL), it’s a nonsense argument. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.074999999999999
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/rovdi",
                    "index": "8",
                    "likes": "4",
                    "time": "23/01/2021-07:33:28",
                    "content": "Just a thought: Fees in block reward does not create new ETH, it transfers ETH from one participant to another (miner), now miner can use that ETH to interact with network, in some sence this increase velocity. Is it possible that by burning fees you can  end up with no supply for network activity? When incentive to keep is greater than to use what is the point of network? I’m not against nor for 1559, what bothers me is  all this greed in $ terms,  wrong values, wrong focus, not clear goals. Let me ask you all:  “describe in one sentence, what is ethereum goal? ( what does it trying to achive? What need it is trying to satisfie? what problem does it trying to solve?  For whom it is trying to solve this problem?”) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.65530303030303
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Mike81",
                    "index": "9",
                    "likes": "1",
                    "time": "23/01/2021-16:51:50",
                    "content": "Don’t worry, once Ethereum is unmineable by the public all the miners will switch to another coin. Ethereum will never be as big as it was and it will just be another low edge crypto coin. The miners make it what it is worth today and I know me as well as over one thousand others will have no problem switching to another profitable coin to mine and drive that coin up in price. Big mistake for Ethereum… BIG mistake. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ButtaTRiBot",
                    "index": "10",
                    "likes": "3",
                    "time": "23/01/2021-17:01:21",
                    "content": "Sharing this here as well. Transparency for transaction submitters matters. Discord_2021-01-23_18-00-111369×623 105 KB ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mdalembert",
                    "index": "11",
                    "likes": "5",
                    "time": "24/01/2021-22:37:08",
                    "content": "There are also some arguments against fee burning (or even against the proposed auction model) from the point of view of the transaction user (see the main EIP-1559 thread for more of the background): The base fee imposes a floor on the gas prices paid by end users, which could create further upwards pressure on the already expensive transaction prices.  The magnitude of this upwards pressure doesn’t seem to have been quantitatively modeled in the existing simulation notebooks (probably as a result of it being an explicit non-goal of this proposal to minimize user transaction costs, despite what many people seem to think around the internet). Effectively, fee burning acts as a transfer of value from the transaction user to the ETH holder, which brings me to another major counter-argument (acknowledged by the EIP-1559 proposal text itself): It precludes fixed supply, making the inflationary behavior of the currency even more difficult to predict with this proposal.  I don’t question the utility of a progressively deflationary monetary policy (like Bitcoin’s) as means to preserve the value of the currency, but this way of doing things seems like a bit of a gamble to me (as it might to other investors), since it’s basically impossible to predict beforehand whether the fee burn will exceed the block reward or not (The modification other people have suggested of banking and redistributing base fees would address this problem). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/rhubbard-nwf",
                    "index": "12",
                    "likes": "1",
                    "time": "02/02/2021-18:58:00",
                    "content": "Hell, if ETC brings PROGPOW on line to stop the ASICs, as well as a few other items, we may have a real winner ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/rhubbard-nwf",
                    "index": "13",
                    "likes": "1",
                    "time": "02/02/2021-19:45:04",
                    "content": "#4 - Yes. Our investment in hardware was substantial for us, even though its a small operation, all things considered. We mine because we believe in ETH and want to contribute how we can, and to earn of course. To know that ETH devs just change the rules and potential destroy our ability to break even, with no warning, just to ram a fix in to resolve a long standing issue, WHILE also working on ETH2 is quite concerning and without regard to the little guys securing and facilitating the chains. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.3125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/esaulpaugh",
                    "index": "14",
                    "likes": "1",
                    "time": "04/02/2021-19:35:37",
                    "content": "I must warn that bad arguments against fee burning (or anything else) will only serve to make people more certain of its harmlessness, because after a period of time they will understandably assume that the best opposing arguments have already been made (and those weren’t very good). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.603571428571429
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/kladkogex",
                    "index": "15",
                    "likes": "3",
                    "time": "05/02/2021-11:36:07",
                    "content": "Well  - the statement is emotional  First, it assumes that “people” exist.  It is an undefined set, usually equivalent to “people I like” Second, it assumes that “people” are already certain that “it is harmless”. This is by default an unsubstantiated statement, unless there is  an independent poll proving this. Third, the only poll that exists shows the majority of miners think it is not harmless.  Unless miners are not considered to be people  ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.133928571428571
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/esaulpaugh",
                    "index": "16",
                    "likes": "0",
                    "time": "05/02/2021-18:47:30",
                    "content": "I don’t think there is any evidence that, upon hearing an argument he knows to be bad, a person will be unaffected or allow the argument to nudge him towards his opposition. I guess if the function is only to rally the troops (i.e. solidify existing support) then it might do that. But again, if the troops know it to be a bad argument, will it not fail to rally them? All five of your arguments boil down to miners and their reduced profitability. So it’s one argument and one that’s entirely anticipated. I personally think that Ethereum’s user experience is so horrible that miners have it quite good compared to users. So a tradeoff between the two makes sense. Not to mention that miners have benefited from multiple years of delay in proof-of-stake, and they may well see multiple years more. If I were them, I would be focused on getting the Ethash replacement done, which has been unfairly delayed and unscrupulously maligned for far too long. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.498263888888889
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/CryptoBlockchainTech",
                    "index": "17",
                    "likes": "1",
                    "time": "05/02/2021-21:26:17",
                    "content": "    esaulpaugh:  If I were them, I would be focused on getting the Ethash replacement done, which has been unfairly delayed and unscrupulously maligned for far too long.   We have been trying but there always seems to be more important discussions and just mentioning 1057 or ProgPow sends people into uncontrollable epileptic seizures. https://github.com/ethereum/pm/issues/241#issuecomment-769444358 We really need a Dev to create a new EIP for Ethash 2.0 and start moving forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4602272727272725
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/kladkogex",
                    "index": "18",
                    "likes": "2",
                    "time": "08/02/2021-18:35:51",
                    "content": "Hey ) I am not saying miners are the only part of ETH community. I am just saying that every member of the community needs to be respected. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Stevenans66",
                    "index": "19",
                    "likes": "0",
                    "time": "15/03/2021-12:31:45",
                    "content": "Ladies and gentlement, I am the psudomous , hodl the most eth in deposit myaelf is also 1 of the miner , please could someone represent me to inform the developers that CEO refuse the form of eip 1559 as well , if he insist , then the total amount in the lockdown deposit will goes to personal wallet. Thank You ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/YHRW80",
                    "index": "20",
                    "likes": "0",
                    "time": "15/03/2021-14:39:40",
                    "content": "But to your point, why waste resurces on something POS (if succeed) will solve? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/hexzorro",
                    "index": "21",
                    "likes": "0",
                    "time": "18/03/2021-23:28:30",
                    "content": "@kladkogex cited this discussion on this new EIP proposed that maintains base fee to miners: Median Gas Premium ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.340909090909091
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/esaulpaugh",
                    "index": "22",
                    "likes": "0",
                    "time": "19/03/2021-02:28:35",
                    "content": "miner-extractable value means that miners are effectively being paid significantly more than just block rewards and fees. 1559 won’t stop frontrunning by miners but at least it can start to address the cumulative losses incurred by holders/users due to frontrunning since the network’s inception, by reducing the ever-present tax of inflation ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.84375
                }
            ]
        }
    ],
    "group_index": "1213"
}