{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/erc-proposal-beakeros-an-secure-operating-system-protocol/1464",
            "title": "ERC Proposal - BeakerOS: An Secure Operating System Protocol ",
            "index": 1464,
            "category": [
                "EIPs"
            ],
            "tags": [
                "operating-system"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/latrasis",
                    "index": "1",
                    "likes": "0",
                    "time": "25/09/2018-19:27:51",
                    "content": "Hello Everyone  Our team recently submitted a proposal to bring BeakerOS - a secure operating system protocol, to the Ethereum ecosystem in the form of an EIP. The ERC will initially outline the initial alpha specification and abi interface of the exokernel kernel library and instance. Please see the whitepaper (link below) for a complete overview. Feedback, discussion and suggestions are all greatly appreciated.   Summary We propose an operating system protocol for establishing policies and restrictions in Ethereum smart contracts within a machine-readable format. Our unique approach allows users to independently verify whether the policies of a governance system or an ICO are enforced without relying on manual code checking or 3rd party developers to trust.  Links  Website and Whitepaper Initial ERC Proposal  ",
                    "links": [
                        "https://github.com/ethereum/EIPs/issues/1448"
                    ],
                    "GPT-summary": "The author of the post submitted a proposal for BeakerOS, a secure operating system protocol, to the Ethereum ecosystem in the form of an EIP. The post provides a brief overview of the proposal and links to the whitepaper and initial ERC proposal. The author is asking for feedback, discussion, and suggestions on the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.7038690476190474
                }
            ]
        }
    ],
    "group_index": "432"
}