{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/forming-a-ring-of-ethereum-architects/947",
            "title": "Forming a Ring of Ethereum Architects ",
            "index": 947,
            "category": [
                "Working Groups",
                "Ethereum Architects"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "1",
                    "likes": "4",
                    "time": "03/08/2018-17:33:51",
                    "content": "Short Version: Ethereum Architect (EA) is a new role in Ethereum Community. EA keeps in mind most core projects in ethereum ecosystem with focus on their interoperability, performance and specific features. EA’s role in a project is to integrate different modules into working product and compare similar modules to pick the most suitable one. EA is financially self-sufficient: you are able to earn money even if you are not part of any other project. In Ethereum Community EA takes care about core project’s UX, interoperability and integrations and creates RFEs in that projects in order to push necessary improvements. In Ethereum Governance (Signaling) his role is to identify influencers (projects and developers). Ring of Ethereum Architects supports, summarizes and promotes community work done by its members. Long Version: Many of the ethereum projects are developer driven grassroot projects. Developers are acting independently and get revenue from community attention generated by their project. Moreover nobody in Ethereum likes hierarchies and external management, nothing can be enforced. We are like that cats, that don’t like to be herded. All this is an ethereum-style development process, this is our “eth-ish” lifestyle . It has huge drawbacks. Ethereum Ecosystem is a patchwork of many loosely connected independent projects. There is no direct incentives for developers to spend their time working on interoperability and integrations into other projects. In old-school world there is a management for that, but we don’t like it, we like to have it “eth-ish”. Therefore we don’t have any role in our community taking care about seamless integration of the parts into one smoothly working platform. Ethereum Architect (EA) is exact the full-time role for that purpose: he/she …  knows almost all sub projects in ethereum space (and makes his knowledge public),  … this includes project’s features, performance, interoperability and future development.   proposes standard architectures and solutions, i.e. for external customer needs. creates a EIP’s in particular projects to improve their interoperability and UX, based on own experience in customer’s projects. represents customer needs in technical ethereum discussions. compares similar projects creating the “best-of” lists. provides quality reports and promotes best devs or projects or makes list of their flaws public.  EA role meant to be “eth-ish”. It means an EA should not pretend to manage other people, but because of his broad knowledge of ethereum ecosystem and community, this role is quite influential. “Eth-ish” means also working active and independently. It means also, the role is self-sufficient: as an Ethereum Architect you are able to earn money even if you are not part of any other project. EA is like a Software Architect but it is more, because EA actively takes care about ethereum as a platform in general. Moreover, he/she brings projects, developers and stakeholder together because of knowledge of the community and ecosystem. Because of wide knowledge of ethereum ecosystem and community, EA plays important role in Ethereum Governance (Signaling): EA identifies influential projects and people, which is essential to interpret signals. EA signals customer needs into ethereum community and project needs to each other. Any thoughts? ",
                    "links": [
                        "https://ethereum-magicians.org/t/council-of-prague-agenda-ring-of-ethereum-architects-gathering/1656/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.657851077493935
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "2",
                    "likes": "1",
                    "time": "04/08/2018-07:21:57",
                    "content": "This is an interesting approach, and much-needed! I appreciate how you incorporate values into this ring.     Ethernian:  In old-school world there is a management for that, but we don’t like it, we like to have it “eth-ish”. Therefore we don’t have any role in our community taking care about seamless integration of the parts into one smoothly working platform.   As an aside, I see three types of rings emerging:  type of EIP or dapp e.g. wallet ring technique or process e.g. UX ring type of work e.g. architects, philosophers, attorneys  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "3",
                    "likes": "0",
                    "time": "04/08/2018-11:17:39",
                    "content": " As an aside, I see three types of rings emerging:  type of EIP or dapp e.g. wallet ring technique or process e.g. UX ring …   Why do you put EIP and dapp/walet together and UX in separate category? As an aside, I would re-think EIP categorisation to separate Standard from DesignPattern.  A Standard MUST be stricktly followed by all implementors. Once released and implemented, it can’t be changed. Therefore it needs cautios design and broad discussion.  (f.e.: ERC20). A DesignPattern is only a recomendation. It needs roughly consensus and can be changed later. The process should be RFC like.  Personally, I try to read and understand every new Standard, proposed in Ethereum Space, because it has lasting and general impact. Not the same about DesignPattern: I read them if I need them. Unfortunately, I am totally overhelmed by EIP proposals that pretend to be Standards but are DesignPatterns actually. They do not need so much timely attention, but they claim it. It is a pain and we need to target it, IMHO. Possibly by better categorisation for EIPs, applied by EIP editors. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.265269886363636
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "4",
                    "likes": "0",
                    "time": "04/08/2018-12:03:00",
                    "content": "I am still thinking about realtionship between “Ethereum Architect (EA)” role and “XYZ Manager”. Even EA should solve some typical problems, that the classical manager would solve, I would avoid to give the EA role the “Manager” name. Nomen est omen. Using term “manager” to describe EA role, we will import old problems from hierarchically managed world. I would avoid it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.888888888888888
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "5",
                    "likes": "1",
                    "time": "04/08/2018-14:39:52",
                    "content": "I think I like how you put it best somewhere else, it’s more of a community management role. The EAs ensure that those in the community understand what else is out there in terms of colloboration and partnerships so Ethereum can be a more effective platform overall. We can all be so far down our silos it’s difficult to listen for these, but our EAs are superstars and can bridge those connections. I think this honestly already happens quite well on crypto-twitter, but it’s great to discuss the importance of this role especially as we scale. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.565656565656566
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "6",
                    "likes": "0",
                    "time": "04/08/2018-22:06:27",
                    "content": "@Ethernian, are you volunteering? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "7",
                    "likes": "3",
                    "time": "04/08/2018-22:14:17",
                    "content": "    gcolvin:  @Ethernian, are you volunteering?   ===== Yes, for sure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "8",
                    "likes": "0",
                    "time": "05/08/2018-14:19:01",
                    "content": "… Excellent  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "9",
                    "likes": "0",
                    "time": "06/08/2018-11:24:44",
                    "content": "… I am just waiting few days more for feedback and then will continue with formal steps organizing the ring ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/eolszewski",
                    "index": "10",
                    "likes": "3",
                    "time": "14/08/2018-17:07:25",
                    "content": "Interested in helping with this  I have a keen focus on helping out with scalability - particularly state channels and plasma. Naturally, I can assist on the various user onboarding nuances - transaction fueling services, identity management, etherless accounts, etc… I’m really just in favor of helping to promote any open standards  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.597222222222222
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "11",
                    "likes": "1",
                    "time": "15/08/2018-08:28:37",
                    "content": "Great! A lot of thanks for your help! I will finalize forming a Ring of Ethereum Architects next days and then will start a separate topic to bring more structure into the Ring. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MadeofTin",
                    "index": "12",
                    "likes": "0",
                    "time": "15/08/2018-12:18:54",
                    "content": "@Ethernian working on the specification of the Ring Application Process. As someone who is interested in forming a ring I would love to hear some feedback.     Process for Ring Formation Working Groups       I read through this thread      Should a wiki be part of a Field Ring?   Sounds a lot like a Field to me.     An aside As part of EthSignals this would be great      Ethernian:  EA plays important role in Ethereum Governance (Signaling): EA identifies influential projects and people, which is essential to interpret signals   We want to integrate with projects as much as possible and are working on finding appropriate projects for each signal. Being new to the space it has been pretty difficult to even know what exists out there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.168181818181818
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "13",
                    "likes": "0",
                    "time": "15/08/2018-15:16:47",
                    "content": "    MadeofTin:  As part of EthSignals this would be great   unsure I am understand you correctly. Do you see Ring of Ethereum Architects as a part of EthSignals? hmm… I would disagree… I see them on different levels:  EthSignals creates an infrastructure and methodology to understand whats going on in community related to any possible topic. In particular in domain of Ethereum Architects or Ethereum Wallet Developers or any other ring. Any Ring will use EthSignals but not be part of it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.701388888888888
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MadeofTin",
                    "index": "14",
                    "likes": "0",
                    "time": "17/08/2018-16:15:13",
                    "content": "    Ethernian:  hmm… I would disagree… I see them on different levels: EthSignals creates an infrastructure and methodology to understand whats going on in community related to any possible topic. In particular in domain of Ethereum Architects or Ethereum Wallet Developers or any other ring. Any Ring will use EthSignals but not be part of it.   That is how I see it as well. Sorry for the confusion. One thing that would be helpful for us is as Ethereum Architects identifies projects, some of those could be analysed for integration. One example is Slockit.io gas voting. They are actively working on a voting mechanism never before seen. Luckily, we found them because Phil found them. Without this connection we may have never found this amazing project. We are always interested in integrating more and varied signals and hope to keep on top of upcoming technology in this area. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.663194444444445
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/apitkevich",
                    "index": "15",
                    "likes": "0",
                    "time": "17/08/2018-21:17:47",
                    "content": "Great idea. Goes very much with the market demand for this type of the service. With wise realisation should help in identification of real skills and knowledge among tonns of self elected gurus. I support the idea to build the structured approach as it will simplify the usage of the technology and clarify the gaps for the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.45
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/a4nkit",
                    "index": "16",
                    "likes": "0",
                    "time": "18/08/2018-14:19:52",
                    "content": "Great idea. This is much needed. But, I am bit worried about it’s governance model. Anyway, so let me know If I can be any helpful in scalability and solidity research . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "17",
                    "likes": "1",
                    "time": "19/08/2018-12:45:58",
                    "content": "Guys, I have filed an formal application for creating the Ring. I have put me (@ethernian) and @apitkevich @eolszewski @a4nkit as the Ring’s member. There are people who have explicitly offered help or asked for membership. Any new members or membership corrections are welcome. I would start working on creating of reference architecture (or many of them) and place ethereum projects into this scheme. If you have another Ideas, please let me know. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.393939393939394
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "18",
                    "likes": "0",
                    "time": "21/08/2018-22:11:56",
                    "content": "@Ethernian, I have created the Ring of Ethereum Architects wiki page and working group category for the Ring of Ethereum Architects. There is some text which I have edited, feel free to improve that. The  wiki page needs a small list for “purpose”, you should be able to edit this page. See Token Ring for ideas on purpose. Lastly, this is the new charter template: https://github.com/ethereum-magicians/scrolls/wiki/Ring-Charter-Template. What I created for EA is bare-bones so fill in more to complete this. ",
                    "links": [
                        "https://github.com/ethereum-magicians/scrolls/wiki/Token-Ring",
                        "https://github.com/ethereum-magicians/scrolls/wiki/Ring-Charter-Template"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.99025974025974
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "19",
                    "likes": "0",
                    "time": "21/08/2018-22:13:28",
                    "content": "Ah never mind all of the above, I realize that GitHub wiki naming pages based on title has got me yet again  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chris-remus",
                    "index": "20",
                    "likes": "0",
                    "time": "28/08/2018-17:15:11",
                    "content": "I’m interested in doing what I can to help, if this is seen as more of a Product/Project Manager role, rather than a Community Manager role. (I’m the Product Manager at AragonOne and p/t Project manager at ENS…) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "21",
                    "likes": "0",
                    "time": "30/08/2018-22:34:52",
                    "content": "Guys, I have started a new topic about Roadmap for Ethereum Architects. Please place your ideas there.     [EthA]: Ethereum Architects in Berlin. Discussing a Roadmap Ethereum Architects       Hello guys!  I have spent some more days to realize how we could go forward, here are my ideas.  Any feedback is welcome. If you are in Berlin on 05-11.09.2018 let me know - it would be great to brainstorm in person.  I see two huge topics we can start with:   Book of Ethereum Reference Architectures and Design Patterns Organize a EIPs in a meaningful way.  Both topics are much needed for community and for ethereum adoption. Although final goal is very unclear at the moment, I could imagine a wa…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.735227272727274
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "22",
                    "likes": "0",
                    "time": "22/09/2018-20:11:04",
                    "content": "Will there be a Ring formation discussion for this ring at the FEM Council in Prague? I think this would be a VERY important one to discuss, perhaps along the lines of the Meta discussion as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Ethernian",
                    "index": "23",
                    "likes": "0",
                    "time": "22/09/2018-20:43:40",
                    "content": "Yes, it makes sense! As part of EAs roadmap (EIP tagging), I am currently working on detailed specification of decentralized tagging. Which should be applicable to EIPs, but also should have sense a stand-alone project as well. There is a good progress there, but it is more difficult than I thought initially. So looks like I will be able to present a preliminary report, but not a complete implementation. Anyway I have two topics to present already:  General presentations of the Ring of EAs as part of Meta discussion. Most ideas were already posted, but they need to be discussed. Decentralized tagging of EIPs as part of EA’s Roadmap.  What formal steps from me are necessary to make it happen? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.807692307692308
                }
            ]
        }
    ],
    "group_index": "1764"
}