{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/governance-session-outtakes-and-open-questions/732",
            "title": "Governance session: outtakes and open questions ",
            "index": 732,
            "category": [
                "Happenings",
                "Council Sessions"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/MaxSemenchuk",
                    "index": "1",
                    "likes": "3",
                    "time": "15/07/2018-14:26:53",
                    "content": "Notes on the discussion session. Pls feel free to correct if something not captured or needs edit. Current proposal for structure:  IMG_1489.JPG2448×3264 1.28 MB  Distributed Governance - a way to make decisions where each node (person) has the same right to participate. Finding ways for more efficient consensus (as forks are very expensive). The missing aspect is the stakeholders’ structure. Possibly we don’t know who they are. Some are obvious, like core devs, but not everybody. Maybe it can be resolved with signalling. We may start with the less abstract things like the government. The government has the access to the physical force. Its role is to flip it from the zero-sum game to non-zero sum game. Monopoly over violence, and in Ethereum – a monopoly over the code and shared resources. So the government is needed only when it’s a non-zero sum game., e.g. scarcity. Story: the lemons were discovered to be a cure in the 18th cent, but they grew only in Sicily, and demand grew high. What first started as a payment for protection to mobs turned out unfortunate to the lemon trees owners. We may take that governance is needed for blockchain, as if it was 100% distributed, there would be no need in it, but it’s not realized fully today. What usually helps is to outline components as authority, wealth distribution, etc. How do you use your influence in the right direction, as social currency? Status has created the principles and we ended up with 80 terms than we proceeded with clustering. Though it’s may not go well with the scaling to the whole community. The next phase is to distillate the principles, it should be a multi-person decision making. We’re trying the text analysis. One of the rules of complexity – as the system becomes more complex the rules are changed a lot. There’s a need in constant adaptation to solve the problems. The proposal and decision processes are mostly well-defined. But still lacks decentralization as only a few people have access to that. Nodes can also participate and not accept the updates. In the current world, the signalling work is done mostly by media. And in the corp, there are requests for procurement, requests for decision etc. One of the interesting liquid democracy group is FLUX, so they try to hack democracy and elect somebody who can just follow what the app says. Problem is people usually don’t give a shit, as they try to simplify their lives and avoid participation. Ethereum started as a small team and emerged now, but its growth can be limited if the governance models won’t scale with it. Internet, as well as printing, brought entirely different frameworks to people collaboration. So with blockchain, we’re going after the transparency and fighting corruption. Ability to ensure there’s skin in the game. From the social contract perspective, you give out some freedom to government to provide the structure. The politicians get elected to have power, which as a principle we may want to rethink. The primary limitation is the cognitive flow. We should assume most of the people wouldn’t be interested to vote. On resources, we may think of the taxation system. The important factor is legitimization. A lot of discussions now go around the liquid democracy to resolve the cognitive load issue. Still, there’s a lot of underlying problems as a voting fatigue. With working groups, we try to overcome that and it became a solution. At the current stage, it’s working. But not until a very high scale. Now one of the confusions is who’s the core developer. We may see the miners collecting into an org and that can be a time we define more clearly who are the core devs. But it’s not a democracy in this way. Story: Before we had villages, without the mayor, based on the reputation. But after they grow the hierarchies emerged to sustain. It’s the question of principles, advantages and disadvantages. If we need an adaptation then it dictates the form of governance. There’re also people who build on top of Ethereum and we don’t know their goals. Maybe they want to overcome the issues with the centralized systems, like Twitter, that can close API. Maybe we can introduce a distributed communication application specifically for this context. Currently, the government is not attacking the blockchain, but we can need this when it starts. Maybe we can define matrix and riot as those. Another approach is to not care much about signalling and democracy, as it’s not influencing much the devs stakes. The decentralization happens in several layers, e.g. country government layers. And their distribution power decision makes a big influence. The government wants to achieve is the balance between the stakeholder. So none group can overpower the others. Ethfinex learned that their voting tokens were sold or not used in many times by users. That’s the design problem, where we try to define the requirements. We need to practice, as we don’t have much experience. Maybe in things like charity. Anonymous Alcoholics work for many years as they got a clear mission. And we need to remember the governance are servants. Let’s move all discussions to https://gitter.im/ethereum/governance Open questions:  How do we define community? How do we establish the same terminology? What are the moral rules here? How do we crowdsource principles? How do you form consensus over symbols/meanings (rather than terms)? How can we try principles and make them scalable? How can we collect signals? What if we can use the participation of vast groups (billions) and how we can do that? What are the problems in the former system? What is the goal of ethereum? Who do we build for? What is it role in the society?  ",
                    "links": [
                        "https://gitter.im/ethereum/governance"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.389846153846154
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "2",
                    "likes": "0",
                    "time": "15/07/2018-16:04:04",
                    "content": "    MaxSemenchuk:  smth   “smth” is used multiple times in this article, sometimes in contexts that make me doubt it’s meaning (it’s shorthand for “something”, right?) Please edit and remove the shorthand. It may be confusing for non-native speakers (and even native speakers like me lol) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.982142857142857
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MaxSemenchuk",
                    "index": "3",
                    "likes": "1",
                    "time": "15/07/2018-16:20:05",
                    "content": "@fubuloubu, for your input and interest. I’ve made an edit, your guess about something is right ) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                }
            ]
        }
    ],
    "group_index": "1485"
}