{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/erc721-minting-only-one-token/8602",
            "title": "ERC721 minting only one token ",
            "index": 8602,
            "category": [
                "EIPs"
            ],
            "tags": [
                "nft"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/victormunoz",
                    "index": "1",
                    "likes": "1",
                    "time": "14/03/2022-12:28:59",
                    "content": "If the ERC721 was modified to mint only 1 token (per contract), then the contract address could be identified uniquely with that minted token (instead of the tuple contract address + token id, as ERC721 requires). This change would enable automaticlaly all the capabilities of composable tokens ERC-998 (own other ERC721 or ERC20) natively without adding any extra code, just forbidding to mint more than one token per deployed contract. Then the NFT minted with this contract could operate with his “budget” (the ERC20 he owned) and also trade with the other NFTs he could own. Just like an autonomous agent, that could decide what to do with his properties (sell his NFTs, buy other NFTs, etc). Well not really autonomous, because it still requires external inputs to operate, but kind of… For sure additional code and functions should be added to the implementation to allow all these operations. I am thinking on submitting a new EIP for this “NFTs with wallet” (not sure how to name it yet), but first wanted to know other opinions on this idea (as suggested in the EIP guidelines). Does this make sense for you? ",
                    "links": [],
                    "GPT-summary": "The author proposes modifying ERC721 to mint only one token per contract, which would allow for unique identification of the contract address and enable the use of composable tokens ERC-998. The author is considering submitting a new EIP for this proposal and is seeking feedback and opinions on the idea. A 3rd party could provide constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Token economics",
                        "Interoperability and Scalability",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.792464114832536
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/peplluis7",
                    "index": "2",
                    "likes": "0",
                    "time": "18/03/2022-19:15:26",
                    "content": "Having a unique token per NFT contract should be constructed at the rollout of the said contract, and no more. I’d prefer to have a solid definition of a non fungible token with a wallet, but this ERC721 specialization might work as fine to me. I don’t know how to push an EIP, sorry. Cheers ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.041666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SamWilsn",
                    "index": "3",
                    "likes": "0",
                    "time": "05/04/2022-23:06:11",
                    "content": "Taking off my EIP editor hat and putting on my reviewer hat, I don’t think this EIP is fully thought through. It sounds like you want to basically make a smart contract wallet that you can transfer using ERC-721 functions? That seems interesting, but the EIP as written is nowhere near specified enough to function as a smart contract wallet. There’s so much more that has to go into it. If you want to explore this route more, I’d recommend checking out the contracts powering existing smart contract wallets! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.435267857142857
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MaxFlowO2",
                    "index": "5",
                    "likes": "1",
                    "time": "09/04/2022-02:33:44",
                    "content": "wait… so you want an NFT in a EOA and the Contract as a vault? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/victormunoz",
                    "index": "6",
                    "likes": "0",
                    "time": "02/05/2022-12:18:01",
                    "content": "Yes. This is basically a Smart Contract wallet that is also an NFT (ERC-721). The initial name of this EIP was Wallet NFT, which I think is more understandable, but some editor changed it to “Contract with exactly one NFT”: Wallet NFT proposal by victormunoz · Pull Request #4944 · ethereum/EIPs · GitHub Maybe I can re-edit the EIP title and elaborate more on the EIP purpose and specification. Regarding current existing smart contract wallets, you mean EIP-173 right? (are there other smart contract wallets?) 173 is good for smart contract wallets, but the main point for my proposal is to be also an ERC-721 compatible contract. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.10734126984127
                }
            ]
        }
    ],
    "group_index": "1650"
}