{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/i-think-nick-johnson-is-merging-ercs-too-hastily/117",
            "title": "I think Nick Johnson is merging ERCs too hastily ",
            "index": 117,
            "category": [],
            "tags": [
                "erc",
                "eip-editors"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/fulldecent",
                    "index": "1",
                    "likes": "1",
                    "time": "06/04/2018-16:35:31",
                    "content": "The first ERCs were good and well thought out. I spent three months generating consensus for ERC-721. ERC-20 is clearly used everywhere. Next month a Michelangelo sculpture will sell with 721, CryptoKitties just raised another $12M. There are 3 new 721 applications launching on Rarebits each day (source Dallas Explore 721 meeting). Now ERCs are getting merged as draft (same level as 721) constantly with minimal review.   github.com/ethereum/EIPs         Create EIP 191   ethereum:master ← Arachnid:191            opened 12:41PM - 05 Apr 18 UTC               Arachnid             +63 -0              github.com/ethereum/EIPs         ERC-820 Pseudo-introspection using a registry contract.   ethereum:master ← jbaylina:eip820            opened 08:34AM - 27 Feb 18 UTC               jbaylina             +274 -0              github.com/ethereum/EIPs         ERC-777 A New Advanced Token Standard   ethereum:master ← jbaylina:eip777            opened 08:56AM - 27 Feb 18 UTC               jbaylina             +649 -0            Also, EIPs with zero use cases or motivation are being accepted “just because I can” like this one:   github.com/ethereum/EIPs         Address metadata registry   ethereum:master ← Arachnid:addressmetadata            opened 12:55PM - 12 Mar 18 UTC               Arachnid             +73 -0           The current EIP-1 process “If the EIP collaborators approve … the EIP editor will … merge your pull request” is being skirted or ignored altogether.  I will note that the Immutability Enforcement Proposal was not merged even though it is technically just as valid as the other proposals and has more community support: https://github.com/ethereum/EIPs/pull/894  I believe if this trend continues then the relevance of EIP/ERC as a whole will be tested. And it will become vulnerable to a fork. Ping: @Arachnid ",
                    "links": [
                        "https://github.com/ethereum/EIPs/pull/973",
                        "https://github.com/Arachnid",
                        "https://github.com/ethereum/EIPs/pull/973/files",
                        "https://github.com/ethereum/EIPs/pull/906",
                        "https://github.com/ethereum/EIPs/pull/906",
                        "https://github.com/jbaylina",
                        "https://github.com/ethereum/EIPs/pull/906/files",
                        "https://github.com/ethereum/EIPs/pull/907",
                        "https://github.com/ethereum/EIPs/pull/907",
                        "https://github.com/jbaylina",
                        "https://github.com/ethereum/EIPs/pull/907/files",
                        "https://github.com/ethereum/EIPs/pull/926",
                        "https://github.com/ethereum/EIPs/pull/926",
                        "https://github.com/Arachnid",
                        "https://github.com/ethereum/EIPs/pull/926/files",
                        "https://github.com/ethereum/EIPs/pull/894"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4438131313131315
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Arachnid",
                    "index": "2",
                    "likes": "7",
                    "time": "06/04/2018-16:50:13",
                    "content": "EIP editors don’t apply editorial judgement beyond a basic “is it syntactically correct and not obviously stupid” check. Getting merged as a draft does not imply approval, and a draft is not an EIP, it’s a draft. As I stated in today’s All Core Devs, I’m really trying to move to a situation where anyone wanting to submit a draft can get a permanent identifier as soon as possible; it reduces the tendency to treat PRs as persistent URLs, and helps ensure that drafts can all be found in the same place with stable URLs. Edit to add: I’m sorry you had so much trouble getting 721 merged. The difficulty was because our process is broken - not because we want to make it really tough to get drafts merged. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.506172839506172
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MicahZoltu",
                    "index": "3",
                    "likes": "3",
                    "time": "07/04/2018-07:33:57",
                    "content": "I’m a fan of “get merged as draft ASAP”. The issue with 894 I believe is that it doesn’t yet pass the “technically sound and grammatically correct” test.  “treat account holders differently” isn’t clear enough. The author obviously has a view of what that includes and doesn’t include but the average reader will not come to the same conclusion when reading the EIP (as can be seen in the EIP discussion). The author insists on using a particular word (bailout) and redefining it to mean something that it doesn’t mean to a native English speaker.  This is a tactic for poisoning the well that isn’t conducive to technical discussion. The changes shouldn’t be an EIP, they should be a PR against EIP-1.  @Arachnid may have more insight into what the intended process is for changing the process, but last I heard a PR against EIP-1 is that process.  If the author can fix these things then I think it should be merged, even though I also think it is not a good EIP for other non-technical reasons. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.973958333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Arachnid",
                    "index": "4",
                    "likes": "1",
                    "time": "07/04/2018-07:38:28",
                    "content": "I’d say that 894 has not been merged for a couple of reasons:  As @MicahZoltu points out, it’s not structured correctly; it should be a PR against EIP1, or at the very least an EIP that encodes changes to EIP 1. Nobody wants the heat of being the one to merge it, because merging is still perceived as a political statement.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.683333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MicahZoltu",
                    "index": "5",
                    "likes": "0",
                    "time": "07/04/2018-07:39:23",
                    "content": "I was under the impression that your EIP merging rampage was an attempt to train people away from merging being perceived as a political statement?  Is it just that we haven’t achieved that goal yet? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Arachnid",
                    "index": "6",
                    "likes": "2",
                    "time": "07/04/2018-08:46:16",
                    "content": "Pretty much. Here’s some extra text to make Discourse happy with my short reply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jamesray1",
                    "index": "7",
                    "likes": "1",
                    "time": "08/04/2018-04:01:03",
                    "content": "Agree fully with this, was going to reply to say something similar. I support your approach to streamlining the EIP process. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/phiferd",
                    "index": "8",
                    "likes": "1",
                    "time": "08/04/2018-05:31:47",
                    "content": "First, EIP-894 is not an ERC.  We should either update the title of this thread to refer to EIPs in general or move the EIP-894 discussion elsewhere.  @fulldecent – maybe you can clarify if your concern is with EIPs in general or ERCs specifically. Second, I think you are claiming that Nick is not following the EIP-1 guidelines (as opposed to claiming that the guidlines are wrong). Specifically, that he’s ignoring this part:  If the EIP collaborators approve, the EIP editor will assign the EIP a number (generally the issue or PR number related to the EIP) and merge your pull request  Here, I think EIP-1 could stand to be re-worded; it’s not clearly written.   What does “If the EIP collaborators approve” mean? No objections, unanimous approval, something else? In my opinion, a single editor should be able to merge as draft because there’s not really any significant risk associated with it.  That also aligns with what I seen/heard elsewhere, but the “If the EIP collaborators approve” line is just adding to the confusion.   EIP-1 says “Please send all EIP-related email to the EIP Collaborators, which is listed under EIP Editors below”. So “EIP Collaborators == EIP Editors”? Why have two names for the same thing? I’m guessing it has something to do with distinguishing between the group and the specific editor assigned to an EIP.  In that case, I would recommend “Editors”  and “Assigned Editor(s)” in the context of a particular EIP. Also, capitalize terms that have a definition that is specific to EIP-1 and stop prefixing terms with “EIP”.   My original reading (without reading EIP-1 from top to bottom) was that “EIP collaborators” were the authors of the EIP in question, not the EIP repository collaborators. I think the main thing that confused me was that if “EIP Editors” was meant, then it would have said “If the EIP Editors approve…”, but it didn’t.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.238501082251083
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fulldecent",
                    "index": "9",
                    "likes": "0",
                    "time": "09/04/2018-03:45:38",
                    "content": "    Arachnid:  merging is still perceived as a political statement.   ^^ If you don’t merge it then you are making a political statement. If you merge it then you are not making a political stance. Therefore at current, you are making this political. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fulldecent",
                    "index": "10",
                    "likes": "0",
                    "time": "09/04/2018-03:51:17",
                    "content": "META. Just want to make clear. I’m not blaming anyone, incl. Nick, of failing to faithfully execute their role, or of doing anything wrong. We are just reviewing some things that happened to address inconsistencies in our processes. I hope that is understood. I think the team is good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jamesray1",
                    "index": "11",
                    "likes": "0",
                    "time": "21/04/2018-03:04:51",
                    "content": "Yeah I agree that it needs rewording.  Please send all EIP-related email to the EIP Collaborators, which is listed under EIP Editors below  There are only people listed under EIP Editors, there is no heading for EIP Editors. As you say I think EIP collaborators could be misconstrued to mean the authors of the EIP. Collaborators and contributors on GitHub have specific meanings.  An outside collaborator is a person who isn’t explicitly a member of your organization, but who has Read, Write, or Admin permissions to one or more repositories in your organization.  Once a pull request is merged in a repo you become a contributor in that repo.     phiferd:  What does “If the EIP collaborators approve” mean?   This could be edited to say: “If the EIP editors approve the EIP (see the EIP editors workflow section below for details) and the authors are happy for it to be merged as a draft”  For each new EIP that comes in, an editor does the following:  Read the EIP to check if it is ready: sound and complete. The ideas must make technical sense, even if they don’t seem likely to be accepted.  The title should accurately describe the content.    Check the EIP for language (spelling, grammar, sentence structure, etc.), markup (Github flavored Markdown), code style    If the EIP isn’t ready, the editor will send it back to the author for revision, with specific instructions.  I made a PR here. ",
                    "links": [
                        "https://github.com/ethereum/EIPs/blob/master/EIPS/eip-1.md#eip-editor-responsibilities-and-workflow",
                        "https://github.com/ethereum/EIPs/pull/1017"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5864898989899
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jamesray1",
                    "index": "12",
                    "likes": "1",
                    "time": "21/04/2018-03:39:07",
                    "content": "Note also that he does make a disclaimer when merging contentious EIPs, e.g. here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/backus",
                    "index": "13",
                    "likes": "3",
                    "time": "07/05/2018-22:26:40",
                    "content": "For what its worth, I made basically the opposite argument as @fulldecent in this thread: EIP process should embrace a model like TC39 I considered just responding here but  It isn’t specific to Nick I think it is a proposal on its own (or at least an argument for a proposal)  and of course visibility of the topic if it is buried in this thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6
                }
            ]
        }
    ],
    "group_index": "214"
}