{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/conscienteum-social-media-a-leap-into-the-quadratic-lands/6824",
            "title": "Conscienteum: Social-Media - A Leap into the Quadratic Lands ",
            "index": 6824,
            "category": [
                "Process Improvement"
            ],
            "tags": [
                "social-media"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/Zadeii",
                    "index": "1",
                    "likes": "1",
                    "time": "09/08/2021-14:53:37",
                    "content": "Hello, I’m developing a social technology for Ethereum and I’m in the process of creating the white paper to bring attention to the issues of our current social media, societal, and institutional standards. It’s still in the first draft phase, but I’m going crazy just looking at it by myself and I am looking for some technical and other Ethereum community members to take a look at it and give me their perspective. Is this something you guys would love to create a community foundation for and put time into creating as the next evolution of social media? This is something I’m incredibly excited about and would love to bring this idea to fruition as blockchain can be utilized for so much more than DeFi. It can literally change the world and what I hope to create is something I hope will be utilized as a tool in a positive manner for our society. Here is the abstract: “This paper proposes the design and creation of a social technology that contains an optimized provision of a decentralized network of member-owned communities where the ecosystem is maintained by an ideology that is continuously reacting in response to the world and is on the lookout for preventable failures of these mechanisms in order to succeed where previous attempts have failed in the pursuit of a coupling of a societal and technological growth that sustains itself indefinitely through the use of science and cultural unity. The use of quadratic voting, quadratic funding, the Institutional Analysis and Development framework (IAD), and many other mechanisms discussed in this paper are the beginning fundamentals that will be utilized to create a complex decentralized autonomous organization, called Conscienteum, that intends to drive solutions into various sectors of self-terminating systems for the benefit of not just one individual or the majority at a certain point of time, but for the next generation as well.” Here is the link to the PDF on pCloud: Conscienteum-First Draft.pdf - pCloud Let me know what you guys think. EDIT: The brief breakdown is this: Issues: Ledger of Harms - The overabundance of technology, coupled with immense pressure and desire for technological growth, has led to a social-technological system that rewards misinformation, disinformation, tribalism, poor mental and physical health, apathy, miscommunication, systemic oppression, idea suppression, short attention spans, and sociopathic behavior (Center for Humane Technology, 2021). Two key issues will be introduced that this organization seeks to solve: Poor institutional metrics and methods for growth and misconceptions about “human nature” Direction Conscienteum seeks to accomplish - Currently, societal growth is decoupled from the exponential technological growth occurring. In order to become good stewards of power, we must couple these two concepts. A wide growth of societal prosperity comes from development from within. This is where Conscienteum comes in. Solution - Creating a global space that allows for positive and actionable proposals from mainstream and heterodox individuals-- one that is optimized to ensure this system can continuously feed increasing returns while preventing diminishing returns-- is the first step. Any conceptualization of it now is where we will feel apprehension because the complexity that arises from such a system requires a certain majority finding common ground at a very fundamental level which then gives birth to a wide breath of outcomes. Mechanisms – Quadratic voting to hold governance over communities, quadratic funding for public goods and other proposals, Institutional Analysis and Development framework (IAD) to allow for optimal social system. User Interface  Ethereum login – social recovery wallet; accessible across all applications on the platform. All feed – includes Ethereum based decentralized applications: news, podcasts, music, etc. and includes updates from the greater Conscienteum community. Home feed – includes Conscienteum based content; projects, notifications, data, QAPs, updates from their specified communities, and other content they wish to track. Profile - The option for containing a blog, store, content postings, streaming (physical exercise, podcast, animation, educational videos, etc.) on their profile for which if people like their output on content, can donate crypto or economic tokens to their profile. Interactive tools – smart contract templates, calendar, management utilities, chat, audio calls, video calls, secured file sharing, email, visualizations and calculators for analysis or computation of relevant data (for predictions or determining if a project will have enough money to be successful), scheduled or regular intervals of autonomous funding mechanisms, etc. Emporium - Artists, developers, etc. can sell their art, music, etc. in an aggregated marketplace. Developer smart contract employment feed – individuals that need a developer to code up a smart contract can go over to this feed and post their request. A developer can accept or negotiate the amount, and complete the smart contract for the client. Statistics/Data – researchers or interested analysts can access data to make informed decisions or make calculations (user identity protected). Assemblies – News media, political financing, decentralized finance, and other forms of decentralized applications that agree the with the culture and mechanism of Conscienteum can be partnered to the platform to allow easy of accessibility and engagement.  Intellectual Propoerty Rights NFTs – Any community within the DAO will directly hold their IP rights from underlying research they do and can auction off as governed appropriately in their community treasury. ",
                    "links": [],
                    "GPT-summary": "The author is developing a social technology for Ethereum and is seeking feedback from technical and other Ethereum community members. The proposal seeks to create a decentralized network of member-owned communities that utilizes quadratic voting, quadratic funding, and the Institutional Analysis and Development framework to create a complex decentralized autonomous organization called Conscienteum. The proposal aims to solve issues such as poor institutional metrics and methods for growth and misconceptions about \"human nature.\" The proposal includes a user interface, interactive tools, and an emporium for artists and developers to sell their work. The author is seeking feedback and collaboration from interested parties.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.472128427128427
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/imkharn",
                    "index": "2",
                    "likes": "0",
                    "time": "12/08/2021-18:54:28",
                    "content": "Just with what you posted here and not reading the whitepaper, this looks like a collection of things already being worked on by Aragon and RadXchange. Thus, not sure what kind of feedback you are wanting. Of course everyone here hopes that organizations similar to this will exist, and that is why they are under progress currently. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.4375
                }
            ]
        }
    ],
    "group_index": "1409"
}