{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/the-big-introduce-yourself-thread/75",
            "title": "The BIG 'introduce yourself' thread ",
            "index": 75,
            "category": [],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/owocki",
                    "index": "1",
                    "likes": "18",
                    "time": "10/03/2018-21:03:17",
                    "content": "I am posting this thread to say hi to folks.  I encourage others to do this same. Hi  I am Kevin Owocki (owocki (Kevin Owocki) · GitHub)… I am a CS degree from UDel and nowadays I work at Consensys on Gitcoin.co.  In a past life I’ve given nerdy talks on mental health ( Kevin Owocki \"End Suicide Stigma\" at Ignite Boulder 26 - YouTube ) lucid dreaming ( Kevin Owocki \"Lucid dreaming\" at Ignite Boulder 28 - YouTube ) and why Blockchain is the TCP/IP of money ( Kevin Owocki @ Ignite Boulder 34 -- Blockchain is the next TCP/IP - YouTube ) I #BUIDL with web3py, python3, django, and a good pinch of metamask/truffle See you all around the discourse threads.  Subscribing to email notifications now. twitter => https://twitter.com/owocki ",
                    "links": [
                        "http://Gitcoin.co",
                        "https://www.youtube.com/watch?v=C5LHTxIWQZk",
                        "https://www.youtube.com/watch?v=BUPKAWOJakg",
                        "https://www.youtube.com/watch?v=eaIeFQd8h3k",
                        "https://twitter.com/owocki",
                        "https://ethereum-magicians.org/t/welcome-please-readme-first/8"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "3",
                    "likes": "6",
                    "time": "11/03/2018-09:11:49",
                    "content": "Hi all, I am Jamie Pitts. I help out at the Ethereum Foundation with operations. In blockchain development, I am most interested now in metadata / Semantic Web and, generally, standards which have the potential to create ecosystems. For a long time, I have had an interest in self-organizing social systems, particularly ones in which goals are accomplished or problems addressed. My twitter is https://twitter.com/jamiepitts ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/lrettig",
                    "index": "4",
                    "likes": "8",
                    "time": "11/03/2018-19:09:53",
                    "content": "Hi friends! I’m Lane Rettig. I’m on the ewasm team (working on replacing the EVM with a new webassembly-based engine). I also run a technology-agnostic blockchain community based in New York City called Crypto NYC. I have a background in tech, finance and entrepreneurship, but I’ve been working full-time on blockchain and Ethereum since last year. I’ve become really fascinated with governance recently since I think it’s critical, it’s a lot less well-formed than blockchain tech, and it gives us a chance to rebuild certain social structures and institutions in a very powerful, compelling way. My twitter is https://twitter.com/lrettig. ",
                    "links": [
                        "https://twitter.com/lrettig"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.565308933490751
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/phiferd",
                    "index": "5",
                    "likes": "5",
                    "time": "12/03/2018-03:12:10",
                    "content": "Hi all, I’m Dan Phifer, CTO and co-founder of Musiconomi and co-founder of the Musicoin project before that.  Thanks to jpitts and gcolvin for getting this going.  I’m looking forward to many insightful and enlightening discussions that will take place here. I think we have a great opportunity to set a very high standard for the level of discourse that becomes the norm for this site.  The meeting in Paris was certainly an auspicious start and made it clear that there are many intelligent people interested in getting involved. It was great to meet many of you at EthCC and I hope I will be able to attend the next in-person meeting (EdCon maybe?). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.890761904761905
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fulldecent",
                    "index": "6",
                    "likes": "3",
                    "time": "12/03/2018-14:04:48",
                    "content": "Hi, I’m Will Entriken. I am contributing to EIPs (we passed #165 and #721) and Solidity development. I am working on a very simple advertising platform called Su Squares. Also, I am presenting at the Explore 721 conference in Dallas next week. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/spalladino",
                    "index": "7",
                    "likes": "3",
                    "time": "12/03/2018-14:05:52",
                    "content": "Hey folks, Santiago Palladino here (smpalladino on Twitter), from Zeppelin. I’m particularly interested in the government process for deciding on ERCs, given that OpenZeppelin provides standard implementations for some of them. Really happy to see such awesome people around here! ",
                    "links": [
                        "http://zeppelin.solutions/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.05
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/andytudhope",
                    "index": "8",
                    "likes": "11",
                    "time": "15/03/2018-07:42:48",
                    "content": "Hello! I’m Andy from Status, where I am the interplanetary cat herder. I build mobile DApps, help manage https://openbounty.status.im and run education for our community. I come from a language and linguistics background, with a bit of applied maths and physics thrown in for good measure, and am most interested in the kinds of communication that can be created through building decentralized systems. Really happy to be here, and encourage you all to also check out https://artproject.io for a really great community project that ought to interest quite a few people here. Only love for you all! ",
                    "links": [
                        "https://artproject.io"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.171875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gregc",
                    "index": "9",
                    "likes": "3",
                    "time": "18/03/2018-01:41:37",
                    "content": "Hello all.  I finally fought my way through the activation system by using a different email.  I’m still on the road home from EthCC, which was a great conference in a great city.  So glad to meet all of you that I did.  More later when I settle in. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.857142857142858
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tenthirtyone",
                    "index": "10",
                    "likes": "7",
                    "time": "27/03/2018-07:41:59",
                    "content": "Hello. I’m Alex and I’m working with nonprofits to help onboard them. I’m interested in crypto’s value to the developing world. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/GNSPS",
                    "index": "11",
                    "likes": "11",
                    "time": "29/03/2018-18:40:14",
                    "content": "Hey guys!  I’m Gonçalo from ConsenSys Diligence. Currently doing security & optimization stuff on Ethereum. Also Director of Hugs @ ConsenSys.  I’m also a hopeless technocrat and truly believe that love wins all in the end. So be kind!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/PaulApivat",
                    "index": "12",
                    "likes": "5",
                    "time": "20/04/2018-08:00:18",
                    "content": "Hey everyone, I’m Paul (@paulapivat on twitter), i’m looking to do research bridging cryptoeconomics, governance and my background in social-organizational psychology. Will be going to “The Philosophy of Ethereum Governance” session shortly before EDCON, come say hi if you’re there. Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tjayrush",
                    "index": "13",
                    "likes": "4",
                    "time": "21/04/2018-13:00:04",
                    "content": "My name is Thomas Jay Rush, but people call me Jay. Working on QuickBlocks. Looking forward to meeting many of you in Toronto. Very interested in the idea of how large groups of people coordinate and work together for the greater good. Big fan of the group. ",
                    "links": [
                        "http://github.com/Great-Hill-Corporation/quickBlocks"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.866071428571429
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/michaelrice",
                    "index": "14",
                    "likes": "5",
                    "time": "22/04/2018-19:44:11",
                    "content": "Hi everyone. I’m just getting started on smart contracts. Long time software engineer and also California lawyer. Working on how to blend smart contracts (solidity and ethereum atm) with traditional legal terms to see how they could come together under contract law and be enforceable in a court at this repo (lots to do): https://github.com/mrice/solidity-legal-contracts Also interested, naturally, in regulation of ethereum, blockchain, icos, etc… hit me on Twitter @michaelricelaw. ",
                    "links": [
                        "https://twitter.com/michaelricelaw"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.663265306122449
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jcyr",
                    "index": "15",
                    "likes": "5",
                    "time": "24/04/2018-12:51:39",
                    "content": "I’m Jean. My key interest is high performance computing. I rewrote much of the ethminer code bringing it up to best in class performance, at least for Nvidia GPUs. I no longer pursue this… what’s the point of developing miner code at this stage? I am fascinated by the governance issue and how Ethereum will handle it. It mirrors current societal problems in so many ways! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.203571428571428
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jamesray1",
                    "index": "16",
                    "likes": "3",
                    "time": "28/04/2018-11:15:00",
                    "content": "Hi everyone. I’m working on sharding with Rust along with a few others.    GitHub    Drops-of-Diamond/diamond_drops WIP on sharding and Ethereum 2.0 with enshrined-in-consensus data availability and Rust: a fast, safe, concurrent and practical programming language - Drops-of-Diamond/diamond_drops      https://about.me/james.ray. ",
                    "links": [
                        "https://github.com/Drops-of-Diamond/diamond_drops",
                        "https://about.me/james.ray"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Recmo",
                    "index": "18",
                    "likes": "6",
                    "time": "30/04/2018-16:41:39",
                    "content": "Hi, Remco here. Currently working on the decentralized exchanges and generally improving the ecosystem with 0x. Founding partner at Wicked Ventures (aka WickEth). Former technical co-founder of Neufund (tokenized equity), Cointel (blockchain forensics), Storro (p2p encrypted filesharing) and Coblue (cybersec). Mathematician and programming language geek. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/naghdy",
                    "index": "19",
                    "likes": "3",
                    "time": "30/04/2018-22:03:17",
                    "content": "Hey everyone. I’m Nabil from Status. Worked at Googs for around 8 years on maps and flights. Joined Status end of 2017 to help bring mass adoption to ethereum! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/cslarson",
                    "index": "20",
                    "likes": "2",
                    "time": "02/05/2018-16:14:03",
                    "content": "Hi all. I’m Carl. I started and help moderate r/ethtrader where we’re starting to incorporate functionality provided by the r/recdao project for things like governance and curation. Reddit can be a tough, frustrating environment, but it’s where (many) people are so I think it’s worth working with that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.009259259259259
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tank",
                    "index": "21",
                    "likes": "5",
                    "time": "04/05/2018-00:38:21",
                    "content": "Hello all, My name is Fodé Diop. I’m a Smart Contract Engineer at https://www.nuclo.io/ here in Oakland California. I’m currently working on interesting Renewable Projects and I’m here to learn.    GitHub    diop - Overview Software Engineer @SupercargoAfrica - A Bitcoin Technology Company - diop      ",
                    "links": [
                        "https://github.com/diop",
                        "https://github.com/diop"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.190476190476191
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jamesray1",
                    "index": "22",
                    "likes": "3",
                    "time": "11/05/2018-00:49:57",
                    "content": "I encourage you with this approach! If you want to get into blockchains, much of what you learn at university won’t be relevant. (Indeed, much of what anybody learns at university doesn’t get used.) It’s risky, but persevere and you will make progress more quickly than you would if you finished a degree. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.633333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mattlock",
                    "index": "23",
                    "likes": "3",
                    "time": "12/05/2018-15:35:55",
                    "content": "Hello All, My name is Matt Lockyer, CS and Development background. Currently working on:   github.com/ethereum/EIPs      Issue: ERC-998 Composable Non-Fungible Token Standard  \t \topened by mattlockyer \ton 2018-04-14 \t \t \t  title: ERC-998 Composable Non-Fungible Token Standard authors: Matt Lockyer mattdlockyer@gmail.com; Nick Mudge nick@perfectabstractions.com; Jordan Schalm jordan.schalm@gmail.com status: Draft type: Standards Track category: ERC created: 2018-04-15 requires: 721,...         Draft implementation here:    GitHub    mattlockyer/composables-998 An implementation and documentation repo for developing the ERC-998 standard for Ethereum. - mattlockyer/composables-998       Seeking any help with pushing this along standards track and completing a robust sample implementation to pass off to Zeppelin for maintenance. Thanks and pleasure to meet everyone! ",
                    "links": [
                        "https://github.com/mattlockyer",
                        "https://github.com/ethereum/EIPs/issues/998",
                        "https://github.com/mattlockyer",
                        "https://github.com/ethereum/EIPs/issues/998",
                        "https://github.com/mattlockyer/composables-998",
                        "https://github.com/mattlockyer/composables-998"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/wschwab",
                    "index": "24",
                    "likes": "4",
                    "time": "13/05/2018-06:39:58",
                    "content": "Hi all. I’m William Schwab. I’m new to development in general (was a full-time scholar), and I sort of fell down the rabbit hole while I was trying to figure out how to Hello World in Python. (Don’t ask.) I’m really excited by the whole Ethereum space in general, though the governance issues are also particularly interesting to me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.825577200577201
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/bootload",
                    "index": "25",
                    "likes": "2",
                    "time": "14/05/2018-13:37:40",
                    "content": "Hi all, looks like you’ve got a nice community here. I’m Harry Wright, a developer currently working for Totle, who are building a liquidity aggregator/trading platform for decentralised exchanges. I spend most of my time coding in Solidity and Javascript. Look forward to chatting to you all on the forum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AtLeastSignificant",
                    "index": "26",
                    "likes": "5",
                    "time": "15/05/2018-20:30:00",
                    "content": "Hey everyone, AtLeastSignificant / Tomshwom here.  VT CpE/Math/Cyber grad ( @CryptoHokie ! ) and work as a systems engineer / cybersecurity specialist. I’ve been supporting the community for a little over a year now via reddit moderating (/r/ethereumnoobies, /r/ethereumcommunity, /r/ethdev, /r/cryptoguides, /r/ethgarden), blogging on steemit.com/@tomshwom, youtube, twitter, etc. Most interested in the greater societal implications of blockchain tech, digital self-sovereignty, and cyberlibertarianism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/hughkarp",
                    "index": "27",
                    "likes": "4",
                    "time": "17/05/2018-07:45:43",
                    "content": "Hi all, Hugh Karp here from Nexus Mutual. Unfortunately I’m not a dev, I’m an actuary by training and have quite a few years experience in the insurance world. Decided to apply that knowledge to blockchain and hopefully help out the community by providing a mutual based alternative to insurance for smart contract bugs. So hopefully that’s somewhat applicable here. Really looking forward to the discussion! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jamesray1",
                    "index": "28",
                    "likes": "2",
                    "time": "20/05/2018-11:21:32",
                    "content": "Cool, I worked and studied with renewable energy before pivoting to Ethereum! I found that the pace of growth is slower than what is needed, hopefully Ethereum will help to change that, e.g. with Grid+. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jamesray1",
                    "index": "29",
                    "likes": "2",
                    "time": "20/05/2018-11:25:32",
                    "content": "Also I recommend reading https://github.com/ethereum/wiki/wiki, there’s lots of info there, although the governance compendium is rather short: https://github.com/ethereum/wiki/wiki/Governance-compendium. ",
                    "links": [
                        "https://github.com/ethereum/wiki/wiki/Governance-compendium"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ben-kaufman",
                    "index": "30",
                    "likes": "3",
                    "time": "21/05/2018-09:07:30",
                    "content": "Hi everyone ! I’m Ben Kaufman from SealDeal. I’m a software developer focusing on smart contracts for the last year. Open source contributor at my free time (which I don’t have much from…), focused mostly on Vyper. See you around here  ",
                    "links": [
                        "http://sealdeal.org",
                        "https://github.com/ethereum/vyper"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.095238095238096
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Clay",
                    "index": "31",
                    "likes": "0",
                    "time": "08/06/2018-02:49:45",
                    "content": "Hi Kev! You sound like someone who has an overview of this space. Im looking around, I’m an inventor, trying to change the world as usual, and one of my projects just ran aground on this crypto, blockchain subject. Who do you suppose I can find to talk to around here and get some advice? My area is pretty far from etherium lol. Deep subjects, and the language is once all its own! Clay ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.177083333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AtLeastSignificant",
                    "index": "32",
                    "likes": "4",
                    "time": "08/06/2018-13:39:14",
                    "content": "I’d highly recommend reddit.com/r/ethereumnoobies for any questions about Ethereum/blockchain tech.  If it’s a more technical or developer oriented question, /r/ethdev is a good resource along with ethereum.stackexchange.com. ",
                    "links": [
                        "http://ethereum.stackexchange.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.699999999999999
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mmhh1910",
                    "index": "33",
                    "likes": "3",
                    "time": "28/06/2018-07:58:46",
                    "content": "Hi, I’m Marcus Mönnig, based in Hamburg, Germany. I have worked in IT for about 20 years as a software developer and as an Oracle OCM DBA for the last 10 years. Got bored a bit, so I recently quit my DBA job to focus on blockchain. I currently deal with solidity development in general and especially on smart contract security/auditing. Twitter: MarcusMonnig Cheers, Marcus ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.982142857142858
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tomnash",
                    "index": "34",
                    "likes": "3",
                    "time": "28/06/2018-08:56:38",
                    "content": "Hello everyone , I’m Tom Nash, founder of Flex Dapps which is a Web3 proof-of-concept agency based in Melbourne Australia. I studied Software Engineering and have been working with smart contracts for a couple of years now. Personally I’ve supported the local community in Melbourne by running regular Ethereum explainer meetups for the last year as well as a weekly hack night for about three months now. At Flex we’re working on exploring the entire Web3 stack and looking at how we can pull different pieces of technology to build funky useful things like the (kind of) decentralised file-selling application Enzypt(dot)io and the completely useless but kind of fun Blockhash Tone Matrix. Personally I’m interested in the effect that Ethereum and other technologies can have on how people organise themselves around shared ideals. Cheers, ",
                    "links": [
                        "https://ipfs.enzypt.io/ipfs/QmcpDvTsvqauWvmbQiEQHAFhqSfKaX8fdmSdPG7YZgfXRH/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5854591836734695
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Timotheus",
                    "index": "35",
                    "likes": "4",
                    "time": "03/07/2018-23:17:08",
                    "content": "Hi there, I’m Tim Bansemer. My background is in network engineering and IT Security. I joined the blockchain space last year and I’ve been working with Ethereum since then, mainly in the consulting business how this new technology can be applied for enterprise customers, public sector but also what it brings in the general sense. I organised with a group of very nice people the “Blockchain for Society” meetups in Amsterdam, Berlin, Leipzig and Hamburg before moving forward to start my own company inblock.io to support the growth of the blockchain space. Since a long time I’m very interested in governance but recently things fall in place how governance and blockchain play together. This is my main interest regarding the Ethereum community - to connect and to find ways how we can find new governance mechanisms which can help to coordinate for and around  distributed systems. For that reason we also initiated the dgov.earth #dgov18 conference in Athens this year. Next to governance my focus remains in the security aspects of distributed consensus technologies. I believe that we need to achieve a state where we can trust those platforms to be mission critical. Together I hope that we can archive an inclusive, sustainable well being for anybody through distributed consensus technologies. My twitter is https://twitter.com/tim_bansemer ",
                    "links": [
                        "https://twitter.com/tim_bansemer"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.825378787878788
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/nagydani",
                    "index": "36",
                    "likes": "3",
                    "time": "04/07/2018-21:44:44",
                    "content": "Hello, I am an Ethereum developer (working mostly on Swarm) and the principal author of ERC 681. It seems like there is some interest in public discussions about the latter, so I joined this forum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AugustoL",
                    "index": "37",
                    "likes": "3",
                    "time": "09/07/2018-11:50:52",
                    "content": "Hello everyone, Augusto from Winding Tree here, Im in charge of the blockchian related development and R&D on WT. I add some experience in ERCs after writing ERC827 like 8 months ago (still in draft).   github.com/ethereum/EIPs      Issue: ERC827 Token Standard (ERC20 Extension)  \t \topened by AugustoL \ton 2018-01-11 \t \t \t  EIP: 827 Title: ERC827 Token Standard (ERC20 Extension) Author: Augusto Lemble <me@augustolemble.com> Type: Token Standard Status: Draft Category: ERC Created: 2018-01-11 Updated: 2018-06-28 This standard is still a draft...        https://github.com/AugustoL & https://twitter.com/ Im interested in ERCs goverance, on chain implementations and ens-erc domains, looking forward to solve some issued we have currently on ERC827 standard and deploy an on chain implementation mantained by developers. ",
                    "links": [
                        "https://github.com/AugustoL",
                        "https://github.com/ethereum/EIPs/issues/827",
                        "https://github.com/AugustoL",
                        "https://github.com/ethereum/EIPs/issues/827",
                        "https://github.com/AugustoL",
                        "https://twitter.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/void4",
                    "index": "38",
                    "likes": "3",
                    "time": "13/07/2018-06:40:48",
                    "content": "I’m void4 (@dd4ta) and I’m interested in  exploring alternative deterministic virtual machines interfacing electronic passport/id cards with smart contracts  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1607142857142865
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/randomshinichi",
                    "index": "39",
                    "likes": "3",
                    "time": "16/07/2018-11:06:49",
                    "content": "Hi folks, I’m Andrew Chiw, and I first got to know of Ethereum Magicians last weekend through your unconference at c-base. I used to be a web developer using Django, but a year ago I joined the Quantum Resistant Ledger and I’m interesting in getting deeper into the decentralized-everything-blockchain space. Right now I’m doing whatever I can in go-ethereum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.294642857142857
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Clay",
                    "index": "40",
                    "likes": "1",
                    "time": "16/07/2018-20:38:03",
                    "content": "Hi Marcus, I’m the founder of a project call Mega. We are building with giant LEGO and automated robot cranes, we want to tokenize our building units. If you might be interested in joining our project I can send you more detail. Sounds like you have a good grasp of blockchain! My speciality is in construction and development of construction systems. Basically we are rebuilding the construction method, it’s my favorite project so far! Clay ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Dobrokhvalov",
                    "index": "41",
                    "likes": "3",
                    "time": "17/07/2018-19:56:55",
                    "content": "Hi all, I’m Mikhail Dobrokhvalov, main developer of eth2.io and Quid Wallet. I’m interested in wallets, UX and mainstream adoption of Ethereum. Cheers ",
                    "links": [
                        "http://quidwallet.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dugla",
                    "index": "42",
                    "likes": "3",
                    "time": "19/07/2018-14:02:24",
                    "content": "Hi everyone. I am an Apple alumnus with skills spanning iOS mobile dev, 3D graphics, and AR/VR. I am currently building data visualization apps for genomics researchers in Cambridge (near Boston) in the US. I am a hybrid with both tech and design in my DNA. I recently began wandering around the cryptocurrency/blockchain space looking for a door to open. Here’s a talk I recently gave entitled How to Think About Augmented Reality https://youtu.be/bf7Q2aSCF5w Tweets: @dugla. Medium: http://bit.ly/1WwLsqA ",
                    "links": [
                        "http://bit.ly/1WwLsqA"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/WSWLEGAL",
                    "index": "43",
                    "likes": "5",
                    "time": "19/07/2018-22:05:48",
                    "content": "Hey there, everyone! I’m Wil Wenzel, a blockchain lawyer in Los Angeles with a background in business and corporate law. I’m currently servicing a handful of blockchain tech companies along with my regular client roster. I’m also regularly going out into the legal and accounting communities to lecture, bringing folks up to speed on blockchain tech so the professionals aren’t so scared of the new developments. This is my first post and I look forward to participating with all of you more soon! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7571022727272725
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/eolszewski",
                    "index": "44",
                    "likes": "5",
                    "time": "23/07/2018-01:38:16",
                    "content": "I wonder if anyone is reading this at this point… Anywho, I’ve been in software for a little while now and was put on to Ethereum and IPFS at the beginning of 2016. Started doing some development for a few companies, started a company, and now I’m roughly a leaf on the wind looking to help out here and there in various projects. I’ve totally drank the koolaid, but I’m also very pragmatic and want to work on general things to extend all blockchains that come out of the space. For the purposes of Ethereum, I am going to be spending a good bit of time on state-channels as these are going to be the only thing that possibly prevent ethereum from being trounced by other chains in the short run. It’s important to not blindly believe that sharding and PoS are going to be finished and work, we didn’t intend to need scaling this soon, but the fact is that we need it now. That’s really it, you can find me on twitter @hrdwrknvrstps, I’m a troll and I like to question everything. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.395833333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mariapaulafn",
                    "index": "45",
                    "likes": "3",
                    "time": "23/07/2018-20:50:28",
                    "content": "I’m MP, or María Paula if you want to call me by my full name, never María. Working in communications for Golem, helping out a couple other projects and organizing ETHBerlin. Happy to help with my expertise, as much as possible, and to help raise awareness. Been working in the space for more than a year, still have plenty to learn. Very interested in social topics, very uninterested in personal or professional agendas. And I make sick memess and I’m also a known troll. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.667748917748918
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/twel",
                    "index": "46",
                    "likes": "2",
                    "time": "24/07/2018-03:38:36",
                    "content": "Software engineer and neuroscience PhD working in medical imaging research. I am quite interested in possible applications of Ethereum in academia (e.g. publishing), image processing, data sharing… I am experimenting with dapps ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/krakjack",
                    "index": "47",
                    "likes": "2",
                    "time": "24/07/2018-12:11:41",
                    "content": "Hi everyone. My name is Kartic and I look after the community at GovBlocks. I’m not a dev myself but have been around developers building communities for a while now. I’m especially interested in DAO governance (big surprise) and hope to add value here in whatever way I can @karticrakhra on twitter  ",
                    "links": [
                        "https://twitter.com/karticrakhra"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Professional-Kiwi",
                    "index": "48",
                    "likes": "4",
                    "time": "02/08/2018-18:23:28",
                    "content": "Hello everyone! I’m Ivan, nice to meet you all! I’ve been in the professional dev scene for a few years now working with React and JS and I’m trying my best to get into the Ethereum scene more. I’ve been studying Solidity for 9 months now and have toyed with ERC20 and ERC721. I love this field and I’m hoping to learn as much as I can about it  Hoping to talk with everyone soon! Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.96875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/glyphx",
                    "index": "49",
                    "likes": "3",
                    "time": "09/08/2018-20:33:33",
                    "content": "Hi all, I’m Matt Stephenson, founder of Planck/Glyphics (prizes and science on the blockchain.) I’m a PhD in behavioral econ and I’ve been working on “solving” fomo-3D’s game using a commitment strategy. Somehow I didn’t know about these boards (I’ve been posting in ethresear.ch) but I’m excited to discuss on here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/compscidr",
                    "index": "50",
                    "likes": "3",
                    "time": "17/08/2018-20:32:14",
                    "content": "Hey, I’m Jason Ernst, CTO at the RightMesh project. Looking to get more involved in the Ethereum community, and will likely be in Prague for DevCon, so wanted to connect ahead of time. Really interested in payment channels, UI/UX for wallets, key management, network protocols ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/raycho",
                    "index": "51",
                    "likes": "5",
                    "time": "17/08/2018-20:51:49",
                    "content": "Hi All! Rachel Cheng from the RightMesh project, Dev Manager/Developer. Interested in a lot of things: payment channels, UI/UX for wallets, key management, token standards, keeping up to date with what’s happening in the Ethereum community. Happy to connect with anyone! Will likely be in Prague for DevCon  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/a4nkit",
                    "index": "52",
                    "likes": "3",
                    "time": "18/08/2018-14:16:10",
                    "content": "Hy , This is Ankit Raj. I am a Solidity contributor. I got dev grant from Eth Foundation on Phase 1. After that I have continued my contribution to the community. My interest lies on scalability in payment channel, & interoperability. Looking forward to meet you guys and learn from you all. Thanks, Ankit https://twitter.com/a4nkit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/caspar",
                    "index": "53",
                    "likes": "3",
                    "time": "30/08/2018-08:45:59",
                    "content": "Hi everyone. I’ve been working for brainbot (raiden network) for almost a year now, but I’m going back to studying economics soon. I want to dive deeper into game theory. Hopefully see some of you at ETHBerlin!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/MariusVanDerWijden",
                    "index": "54",
                    "likes": "2",
                    "time": "30/08/2018-11:00:59",
                    "content": "Hey, my name is Marius, I’m working on payment and state channels at Perun (www.perun.network), Ethminer (https://github.com/ethereum-mining/ethminer) and my own blockchain called SM²-Coin (sm2.network) which uses a proof-of-storage consensus to provide useful instead of wasting energy like PoW’s I would love to meet all of you at Devcon in Prague! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.541666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/EntropicNonsense",
                    "index": "55",
                    "likes": "1",
                    "time": "19/09/2018-15:01:59",
                    "content": "Hi there! I’m Ryan Noble, can find me on most platforms as RyRy79261. I’m the lead blockchain developer for Linum Labs, heading up the Protea network project and assisting with Molecule. Essentially I’m addicted to the why of all things, blockchain being the an endless spring of weird 'why’s. My goal is to make blockchain seamless and invisible while doing weird and wonderful nonsense along the way. Main topics are security, ux & reputation/identity systems, would want to see a school of though in blockchain that moves away from tokens and proxy enumerations. Background in full stack progressive web apps and redux driven FE animation work, that can get pretty limiting in terms of what you’re allowed to do so blockchains been much more satisfying. Cant wait to dive in to everything here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.987179487179487
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/hahnmichaelf",
                    "index": "56",
                    "likes": "4",
                    "time": "19/09/2018-17:23:26",
                    "content": "Hey all, I’m Michael Hahn (moniker: blurpesec) and I work at MyCrypto on the Etherscamdb project as well as user education and support. I’m interested in security, privacy, and decentralized storage and governance! Background is in Information Tech, but I am currently self-teaching cryptography and web app development. Eventually, i want to get into Data Analysis and ML. I look forward to cooperating with you in the future! ",
                    "links": [
                        "https://etherscamdb.info"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chrishobcroft",
                    "index": "57",
                    "likes": "3",
                    "time": "25/09/2018-12:14:10",
                    "content": "Hello. This is Chris Hobcroft here. Defined by:  Exploration of Europe, India and Asia Lifelong relationship with computers Being really tall Studying of Mathematics and Computer Science Cooking of tasty food Driving motorbikes Playing with cameras and Microphones Vipassana Meditation and Hatha Yoga Making music with people Pursuit of decentralized technologies and ideologies Giving hugs (@GNSPS we should compare techniques sometime)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/kladkogex",
                    "index": "58",
                    "likes": "1",
                    "time": "26/09/2018-15:30:22",
                    "content": "This is Stan Kladko - I am co-founder of Skale, we raised $8M to build a mineable decentralized network of fast EVM-compatible sidechains. We use threshold signatures and a set of pre-compiled solidity smartcontracts to send messages across sidechains and from our sidechains to the ETH main chain. Each sidechain can reach tens of thousands of transactions per second. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/sinamahmoodi",
                    "index": "59",
                    "likes": "3",
                    "time": "28/09/2018-09:38:40",
                    "content": "Hey everyone, I’m Sina Mahmoodi. I’m finishing my master’s in CS atm, and I hope to become more involved in development/research in the ecosystem (read aspiring junior researcher ). My current side projects are ethbase, an oracle for event logs, and relay-network, a p2p relay network for L2 execution markets. I find what everyone’s doing here at Ethereum Magicians really valuable, and would love to help if I can . ",
                    "links": [
                        "https://github.com/planet-ethereum/relay-network"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/umurb",
                    "index": "60",
                    "likes": "2",
                    "time": "02/10/2018-20:45:37",
                    "content": "Hello everyone! This is Umur Basar. I am one of the co-founders of Pheme, a decentralized publishing platform built on IPFS & Ethereum. At Pheme, we are trying to find the right motivations and tools to help people (and ourselves) to write and share their ideas/views more often. We invest heavily in UX and target nocoiners for mass web3 adoption. We will be hosting a workshop at web3 summit in Berlin on October 24th. Please join us and write that article you have been postponing for this whole time  I am also the product manager for Galleon, a desktop wallet for Tezos (my bread and butter). I am based in NY. Would love to grab a coffee with any eth magician visiting/living in NY! Happy to be here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.008928571428571
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/RiganoESQ",
                    "index": "61",
                    "likes": "2",
                    "time": "12/10/2018-05:27:26",
                    "content": "hello, i want to live as long as gandalf and truly believe the only way to do that is by increasing human bandwidth to scale R&D.  take down the silos + collaborate for public benefit. the only reasonable way to do this without confidentiality agreements is thru crypto-economic incentives --> web 3.0 (ethereum et. al. + IPFS). we will trade fungible intellectual property rights on a blockchain, and this will unlock exponential life expectancy.  security + metadata = global trade of any information value.  when dfinity. -RiganoESQ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2154040404040405
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/tjayrush",
                    "index": "62",
                    "likes": "1",
                    "time": "16/10/2018-21:58:43",
                    "content": "Hi @RiganoESQ. Don’t know who you are, but I love the words you speak: “collaborate for public benefit…without confidentiality agreements…”  Right on! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Iphara",
                    "index": "63",
                    "likes": "1",
                    "time": "17/10/2018-11:58:08",
                    "content": "Hello all ! My name is Jean-Malo from France, I’m buidling a cryptobank for companies called multis.co. We intend to provide companies the tools they need to run their operations. TLDR, it’s non-custodial, dedicated to teams and we are working on making the experience as seamless as possible. Feel free to contact me if you want to know more about it. Have a lovely day, Jean-Malo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/robtg4",
                    "index": "64",
                    "likes": "3",
                    "time": "29/10/2018-13:52:52",
                    "content": "What’s up y’all! Very late to this thread but thought I’d give it a try! My name is Robby Greenfield, and I’m Co-founder of Consensys Social Impact, which focuses on Building solutions for the social sector, typically pro-bono, developing partnerships, and working on UX research to better onboard marginalized communities into the Blockchain ecosystem. I’m a solidity, web3, api and front end nerd looking to grow from all of you geniuses in here. I also love developing social sector Token models. You can find me here Amon the tweets: @robtg4 And here on the Mediums: https://medium.com/@robertgreenfieldiv ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.318452380952381
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/antoineherzog",
                    "index": "65",
                    "likes": "1",
                    "time": "03/11/2018-17:08:06",
                    "content": "hi Everyone! My Name is Antoine Herzog. I co-founded IOV, french company working to improve user-experience and interoperability. Looking forward to have great conversations. Kind regards Antoine https://www.iov.one ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/vlad-kahoun",
                    "index": "66",
                    "likes": "2",
                    "time": "05/11/2018-15:28:52",
                    "content": "Hi everyone! My name is Vlad, I’m working on Unframework project (http://unfw.info/) from the beginning of 2018. The project aims to help solve standardization and interoperability. It is an abstraction layer over standards and features that enables:   To translate different standards between each other. As a result, various dApps, clients and platforms can communicate with each other. I wrote a short proposal: https://ethereum-magicians.org/t/data-standardization-with-a-rough-consensus/1810   To combine existing features into new kinds of services.   One of my passions is to enable an environment where anyone can create his own standard/language/service while being still understood by all other parts of the system. You can read a description of a particular use case here https://github.com/unfwk/jekyll Twitter: https://twitter.com/vladkei ",
                    "links": [
                        "https://ethereum-magicians.org/t/data-standardization-with-a-rough-consensus/1810",
                        "https://github.com/unfwk/jekyll",
                        "https://twitter.com/vladkei",
                        "https://ethereum-magicians.org/t/data-standardization-with-a-rough-consensus/1810"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.293350168350168
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/melove07",
                    "index": "67",
                    "likes": "3",
                    "time": "18/01/2019-16:09:26",
                    "content": "Hi All, Maggie Love - I have been @ ConsenSys since summer of 2017 and previously product strategy / management at IBM Watson, where I launched a portfolio of 7 finserv Watson based products. Since joining ConsenSys, I have been helping projects launch, operationalize, and grow. My strengths are in strategic consulting, project and process management, operations, marketing, and growth. Looking to get more involved in initiatives that seek to improve the overall ecosystem, its processes, and D&I initiatives. @melove_07 on twitter – sometimes I tweet crypto, sometimes randomness, and sometimes things that make me laugh  Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ahoff",
                    "index": "69",
                    "likes": "1",
                    "time": "11/02/2019-14:49:37",
                    "content": "Hi everyone, Wanted to introduce myself ahead of ETHDenver (very excited). I have more of a finance background - worked on the trade desk at BATS (acquired by CBOE) then most recently worked at ShapeShift as a financial analyst then later as the head of reporting & analytics. I’m a self described open finance shill. Stumbled head first into the crypto UX world by necessity. I’m very interested in helping build a more usable, open financial system - specifically, by conveying the benefits of use, simplified onboarding, education / content, more intuitive dApp experiences, and better analytics. I left ShapeShift recently and am in the very early days of starting Ahnboard.io. to fuel this mission. Also, I’m based in Denver! See everyone at ETHDenver. Follow me on Twitter and say  : https://twitter.com/_ahoff Cheers, Alex ",
                    "links": [
                        "https://twitter.com/_ahoff"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.025694444444445
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/BradleyC",
                    "index": "70",
                    "likes": "5",
                    "time": "25/02/2019-07:52:07",
                    "content": "Hello, I’ve been lurking here since November and it’s time to introduce myself. In my corporate life I was a Technical Product Manager, designing and building APIs and data stores. I’ve recently left 9-5 behind to work on Ethereum projects full time. I’m drawn to Ethereum because of its potential to put the tools of production AND stores of value into the hands of every day people. I imagine a world in which people spend the majority of their lives entertaining each other (and make their living at it). Outside of Ethereum, I like backpacking and playing MtG. I lived in Istanbul for a few years, where I spent all my free time studying the symbolism in the city’s incredible art and architecture. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.509615384615385
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/esaulpaugh",
                    "index": "71",
                    "likes": "2",
                    "time": "26/02/2019-06:21:18",
                    "content": "Oi! I am based in Austin, Texas. My interests in software engineering, politics, and cryptography led me to Ethereum. And I used to work in fintech in SF. Recently I’ve been working on headlong, a high-performance Java library for ABI and RLP (feedback welcome). I also have a background in Android. I’m interested in making the Ethereum ecosystem faster and more JVM-friendly. -Evan Saulpaugh ",
                    "links": [
                        "https://github.com/esaulpaugh/headlong-android"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jackiepeters",
                    "index": "72",
                    "likes": "2",
                    "time": "26/02/2019-16:22:21",
                    "content": "Hi there! I’m Jackie Peters. I work with Orchid Labs on UX, research and product design. I’m really interested in helping to solve some of the UX challenges that come along with this space along with emergent systems, ethics, governance, education and adoption. Excited to share and exchange ideas with you all. Who’s going to be in Paris? Tweet tweet ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/puniaviision",
                    "index": "73",
                    "likes": "1",
                    "time": "05/12/2019-01:49:56",
                    "content": "Hey! My name is Punia and I got involved in the blockchain space in around 2016 through Blockchain at Berkeley. Since then I’ve done consulting for a few startups and most recently was leading blockchain investments at Draper Associates. I quit my job to start my own company that didn’t work. I’m thinking deeper about the intersection of governance and social, the positive sum games it can create, and the financial primitives needed to do so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.829004329004329
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/danforbes",
                    "index": "74",
                    "likes": "2",
                    "time": "12/12/2019-18:45:21",
                    "content": "Hi, my name is Dan Forbes - I am a software engineer working as a developer advocate in the blockchain space. I joined this industry about three months ago and have been on a steep learning curve! This forum looks like a great resource  I am currently working on a reference document for people like me who are learning about smart contract development with Ethereum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.69047619047619
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dawnbass68",
                    "index": "75",
                    "likes": "0",
                    "time": "18/03/2020-04:14:31",
                    "content": "My name is Dawn Bass   “AnnRKey”  I was an early bitcoin miner only bitcoin at the time. When Ether rolled out and litecoin ripple i was mining on my phone and laptop. I dropped off the earth for a few years lost belongings. Now able to communicate again I see huge changes glad I wasnt watching. Anyway maybe I dont have to mention I am not a tech. In fact maybe a moron. I have coins in my name and can confirm my ??  I could really use a friend on the inside to guide me . I am a student at 51 and trying very hard to learn but i fear it to late. I want to contribute learn intern get involved I have a passport and school online. One more thing  I am on ssdi have been for 28 years survivor of early abuse and I think my government would prefer me to die hear in this hell  of poverity.  But that is what we are all about right?  financial freedom?/for all?? I dont want to to say to much ???I live in  Vegas ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.279034767316018
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/DanEv",
                    "index": "76",
                    "likes": "2",
                    "time": "10/07/2020-16:11:06",
                    "content": "Hello everyone! I am a tech enthusiast with an interest in computer programming, electronic commerce and cryptocurrency. Hope to contribute to this forum and find some useful info that bothers me  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/siddhant085",
                    "index": "77",
                    "likes": "1",
                    "time": "23/08/2020-09:23:38",
                    "content": "Hey guys, I am Siddhant. I have 2 years experience working on clustered filesystems for a big company. I recently got interested in  blockchains and since then I have been following the updates on Ethereum. I have some experience in working with algorithms in complex system and hope to contribute something to the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.95
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/JhonnyJason",
                    "index": "78",
                    "likes": "0",
                    "time": "10/12/2020-08:25:13",
                    "content": "Hi guys! I’m Lenny or The JhonnyJason - probably the best describtion is the cog that fits no machine^^… I’m very philosophically interested since ever and since 18 years of age somewhat on the path to technological mastery. First weirdly arrogantly through the pathway of the Technological University in Graz - then after I finally flunked out and had some good adventure with attempt on gf +  family. I finally found the path to deal with my inner insecurities and the issue about feeling simultaneously superior to everybody else and inferior to everybody else. Which finally allows me to really evolve as a developer and not just expect of myself to know everything in beforehand xD - then judging myself and everybody to not have known better. On this path I also have a strong opinion of what to work for makes sense and what not. One reason why I constantly run on a negative Budget^^ - though minimalism FTW, frees up your time. Now I like the perspective very much that this imperfect world is the best opportunity to live out that sense. There is so much to be done and every little bit helps. Especially all that what we may do with such a plattform like Ethereum the whole Ecosystem evolving right now in the space…  it is the perfect time for an upgrade of our financial systems and democrazy. So now I’m here from an halfway sophisticated fullstack-webdev background and just starting to develop on some Smart Contracts. There you are, I’ve got you, be very much appreciated  Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1820328282828285
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Hvdson",
                    "index": "79",
                    "likes": "0",
                    "time": "02/01/2021-07:11:25",
                    "content": "Hey all, I’m Hvdson, a software developer and artist - I found out about blockchain back in 2017 and now I’m finally fully committed to the long-term vision of a decentralized internet. Starting to dip my toes into developing smart contracts. Excited to see what the future has in store for us  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.491071428571429
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Dadybayo",
                    "index": "80",
                    "likes": "0",
                    "time": "06/01/2021-16:41:38",
                    "content": "Hi all, my name is Dan Dadybaev, @ddadybayo on Twitter. Since 2017 I’ve been working on the Unstoppable - open-source non-custodial wallet(https://unstoppable.money). You can also check out my team’s other products by going to (https://horizontalsystems.io/) ",
                    "links": [
                        "https://horizontalsystems.io/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Aleppe",
                    "index": "81",
                    "likes": "1",
                    "time": "04/02/2021-20:28:09",
                    "content": "Hi there! I’m the one who proposed and tried to patent prepaid credit cards in Italy long time ago, 1998, joined to an online payment system for e-commerce. Since then I’ve always been around, trying to not make the same mistakes.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/SamPorter1984",
                    "index": "82",
                    "likes": "0",
                    "time": "11/03/2021-18:12:50",
                    "content": "Hi all, I am working on Nameless Protocol currently and lurking around to see what I can learn to perfect it as much as humanly possible ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AusIV",
                    "index": "83",
                    "likes": "1",
                    "time": "11/03/2021-18:42:47",
                    "content": "Hello! I’m Austin Roberts. I’ve been around the Ethereum ecosystem since about 2017, though I’ve been following it since the first papers started coming out about it. I built OpenRelay, the first open source 0x relayer, followed by Rivet.cloud - an open source solution for enterprise scalable Ethereum node infrastructure. Through Rivet I’ve been managing a Geth fork since early 2018, so I’m pretty intimately familiar with the inner workings of Ethereum clients. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/horomancer",
                    "index": "84",
                    "likes": "0",
                    "time": "30/04/2021-21:21:18",
                    "content": "Hello, I’m not currently not working in the crypto space, but would very much like to change that. I’m here to try and get upto speed on how to build the emerging web3 tech. Any guidance or advise is welcomed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dievardump",
                    "index": "85",
                    "likes": "2",
                    "time": "02/05/2021-14:28:10",
                    "content": "Hello here, I’m Simon Fremaux, also known online as dievardump. I’m a web developer since a bit more than 10 years. I have been in the crypto space since a few years, and really building on it since last year, when I created a platform call BeyondNFT allowing developers to mint Interactive NFT (html+css+js) directly in their browser and the Open Source format on which those interactive NFTs are based Happy to have found this forum and eager to participate in the growth of the space if I can, focusing primarily on NFTs and everything that is around Simon / @dievardump ",
                    "links": [
                        "https://github.com/beyondnft/sandbox"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/spope",
                    "index": "86",
                    "likes": "1",
                    "time": "06/06/2021-19:59:49",
                    "content": "what has been the best resource you’ve used for learning to build dApps? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/spope",
                    "index": "87",
                    "likes": "2",
                    "time": "06/06/2021-20:12:37",
                    "content": "Hey All, I work for a company of bureaucrats that don’t want me to work from home anymore. Out of 600 employees, 28 make up our engineering department and collaborate on our suite of web2 products. I am on a team of 5 frontend devs. Even though I’m clearly salty, it’s ok. I’ve decided that transitioning to web3 development is non-negotiable step I must take in my career, and I’m excited to have a good reason to accelerate that transition. This forums the newest stop in my trip down the web3 rabbithole. Very glad to be here with you all! Any advice from you brilliant people would be greatly appreciated  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.144965277777777
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/daksh",
                    "index": "88",
                    "likes": "2",
                    "time": "06/06/2021-21:06:19",
                    "content": "Hey Y’all  I’m Daksh, I’m a 19 y/o self taught programmer who has built a bunch of SaaS products over the years. Most notably one in Insolvency Space (which is about recovering loans from bankrupt companies) After building software for banks/auditors, I realised how easy it is to game the system and the fact that  it’s just secure on paper and the people managing those banks have huge attack vectors, because of them many people have lost their entire life savings. That is why I decided to work on financial products but on Ethereum (a system where code is law) and build good UX products so that it is inclusive to everyone; So far I’ve contributed to Many DeFi protocols and have been building my own DeFi playground lately. I’m super excited about ETH Scaling too, especially L2. ",
                    "links": [
                        "https://github.com/DakshMiglani/defi-playground"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.544270833333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ajcnyc",
                    "index": "89",
                    "likes": "1",
                    "time": "08/06/2021-12:34:19",
                    "content": "Hi, I’m Alex Cohen. I’m a programmer and investor. I’m interested in working as a developer for blockchain and DeFi projects. Some of the projects that I find interesting right now are ethereum (of course), UMA, Uniswap, Chainlink, and Aave ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.726190476190475
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Haleymiranda79",
                    "index": "90",
                    "likes": "0",
                    "time": "08/06/2021-23:12:15",
                    "content": "I’m Haley. How can I hear a mental health talk? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/benjamistan",
                    "index": "92",
                    "likes": "0",
                    "time": "15/09/2021-16:51:49",
                    "content": "Hey there, I’m Ben Stanley, one of the devs working on the GodMode testing suite of tools. I’m based in Paris, France, though I’m originally from London. Happy to be here! Catch me on twitter at @benjamistan Ben ",
                    "links": [
                        "https://twitter.com/benjamistan"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.4375
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mackbowes",
                    "index": "93",
                    "likes": "0",
                    "time": "19/09/2021-19:46:49",
                    "content": "Hi, I’m Mackenzie, I like writing CSS. Currently unemployed, based near Vancouver BC. Excited about the abilities Ethereum has developed around collective ownership and distributed decision making, the future feels brighter with each new Ethereum concept I learn. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.592803030303031
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Sartela",
                    "index": "94",
                    "likes": "0",
                    "time": "23/09/2021-20:28:24",
                    "content": "Robin Aletras here. I would like to get help authoring a new ERC standard. Any suggestions on how to go about this would be greatly appreciated. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.732954545454545
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/hacker",
                    "index": "95",
                    "likes": "0",
                    "time": "20/10/2021-09:09:14",
                    "content": "Greetings, Lovely day, its a pleasure to meet you all. I am Igor Komolov. Loving to participate in the markets, coding, business and art.  Lets have some fun augmenting reality!  Twitter @microsawft Instagram @rogivolomok ",
                    "links": [
                        "https://www.instagram.com/rogivolomok/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.458333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/frozies",
                    "index": "96",
                    "likes": "0",
                    "time": "29/10/2021-02:10:56",
                    "content": "Hello everyone! My name is Davin (Frozies). I want to learn how and work with a team on a crypto project. You can find me in Webstorm, a construction site, or in CSGO.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/thelastjosh",
                    "index": "97",
                    "likes": "2",
                    "time": "01/11/2021-14:37:41",
                    "content": "Hi folks, I’m Josh, a computer scientist at Oxford & Metagov. A bunch of folks from the DAO space and I are working on a new ERC standard for DAOs as part of an initiative called DAOstar One. Look forward to connecting to folks here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/blockchain_addict",
                    "index": "98",
                    "likes": "1",
                    "time": "04/11/2021-04:10:55",
                    "content": "Hi… This is Saurabh here I am a blockchain dev and a big fan of the technology. Have been following this space from last 5 years. I am looking to built platforms which will have an impact on the community using blockchain tech. Currently working on IdeaTribe, a platform for users to publish their ideas (stories, poem, art, scientific paper, business ideas) to get a proof of ownership (based on timestamp and hash). The main aim  is to help ideators realise their ideas through collaboration. The community can collaborate using staking on idea, on chain service contracts to help the ideator. What do you guys think? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chiarawilden",
                    "index": "99",
                    "likes": "2",
                    "time": "09/12/2021-12:40:08",
                    "content": "Hi everyone! I’m Chiara. I first stumbled upon the Ethereum community this past Spring. I find the Web3 space both technically and ideologically fascinating. At the moment, I’m focused on smart contract development, and better understanding the Ethereum ecosystem. I’m also interested in exploring 3D web development, and how this type of media may be stored and displayed on blockchain-based infrastructure. LinkedIn and GitHub are currently my professional networks of choice. Feel free to get in touch there @chiarawilden. (Please leave me a short note on LinkedIn if you’d like to connect so that we can properly introduce ourselves ). Looking forward to getting to know my fellow magicians, and contributing to the community  ",
                    "links": [
                        "https://github.com/chiarawilden"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.983766233766233
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/j0xhn",
                    "index": "100",
                    "likes": "4",
                    "time": "23/01/2022-06:23:26",
                    "content": "Hola  Developer in the space since pre 2016. Career front end engineer in specializing in integrating React and JAM stack methodologies in web3 apps.  Consensys Alumni, short stint at NFT . org, ex-node operator for POA network and general hackathon junkie who loves having philosophical governance discussions.  Currently birthing daohaus.org & legt.co in an effort to tokenize the world  ",
                    "links": [
                        "http://legt.co"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dtedesco1",
                    "index": "101",
                    "likes": "3",
                    "time": "03/04/2022-02:59:09",
                    "content": "Hi Everyone, I’m DT. During the workday, I’m at Google advising big APAC game and app companies on international growth. Every other moment for the past year has been devoted to soaking up how the ETH and open source communities work, and I’m enthralled. Like @jpitts, I want to cultivate self-organizing social systems that work together (for good, and beyond just making money). My first attempt contributing is a standard for non-tradable fungible tokens. Find me on Twitter @dtedesco1. ",
                    "links": [
                        "https://twitter.com/dtedesco1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/sigridjonasson",
                    "index": "102",
                    "likes": "3",
                    "time": "04/04/2022-15:20:14",
                    "content": "Hi everyone! My name is Sigrid Jonasson. Introduced to cryptocurrencies in 2016. I have been following the development of the Ether network for a very long time and think it is brilliant. I am also a cryptocurrency investor and a contributor to a cryptocurrency portal that specialises in cryptocurrency robot reviews. Glad to be part of the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.66875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Mouradif",
                    "index": "103",
                    "likes": "2",
                    "time": "05/04/2022-12:14:33",
                    "content": "Hi everyone! I’m Mourad Kejji, passionate developer from Morocco. I learned about Bitcoin in 2011 (at the time, I was convinced that the person behind it was using everyone’s computers to rent them to render farms ), then started really getting into it in 2013 but it was already too late to try to mine with the hardware I could afford. I learned about Ethereum in 2016 and immediately started experimenting with smart contracts. Once again, I let my skepticism get the best of me. After heavily trying to convince people around me that this was the future, I ended up conceding to the argument “it’s a great tech but there’s no real use-case”. In 2018, it was my greed that got me back to it, prices had just surged so I put all I could of my savings in crypto and started doing web3 hackathons. Got a few prizes at some of them, and since then, I just never stopped. I discovered this forum while googling “how to propose an EIP”. I’ve been working on a Visual Novel game engine for a little while and I’d like to come up with a standard way to store players’ progress and choices on a smart contract that would represent the story. But more on that on the dedicated thread once I muster enough courage to open it. Until then, I have a lot of lurking to do  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.272767857142857
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mukas",
                    "index": "104",
                    "likes": "0",
                    "time": "12/04/2022-02:24:55",
                    "content": "Hello everyone, I’m mukas . I am someone who studies blockchain and its applications daily in a self-taught way. My main engine is innovation and the search for solutions to real problems, you will see me here proposing all kinds of ideas and developing them. I hope we share our information and ideas and help each other to create something worthwhile. If you want to contact me you can do it through my instagram muquifuler Greetings ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.741666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/philipjonsen",
                    "index": "105",
                    "likes": "0",
                    "time": "05/05/2022-18:33:42",
                    "content": "Hello Familiy! Im Philip from Sweden, I started working, developing and investing in ethereum back in 2014-2015 (I missed the btc train) So ive been in the game from the start, I have lots of contracts with companies(now a days, was projects back then) with like crypto.com, binance(BUSD); cryptopunks, EOS, DAO (the original) and many many more. I have written and helped eth from the start but also projects like bitshares (wrote the whitepapers to make it more decentralized after 2014) and worked with them and the steem creators, its been a wild journey. Today I work with GitLabs and also have my own organization called Cryptocurrencies Sweden https://cryptosweden.eu (still beta) We are developing a decentralized internet called Unigrid today.  But im here to connect back to my old community, my first wallet was the old MEW wallet, before it was MEW for those who remember, it was still a beta back then but are not MEW and Jaxx. If someone who is good with old smart contracts and how to work with them trough proxy can reach out to us/me and get rewarded for helping us to upgrade these contracts either trough proxies or something. I tried it myself, with a proxy to gnosis vault and by mistake transfers 8 million. So will not like that to happen again. I used to be very anonymous but now a days thats a gone, so im here and please reach our for business or just talk old memories. Over and out  / Philip Jonsén ",
                    "links": [
                        "https://cryptosweden.eu"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.109821428571428
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/dcposch",
                    "index": "106",
                    "likes": "0",
                    "time": "16/05/2022-21:02:42",
                    "content": "Hello world. I’m DC / Dan Clemens. My background is in startups, where I helped build two businesses as an engineer and CTO. Today, I’m interested in Ethereum. I’ve been fascinated by blockchain ideas since reading the Satoshi paper a decade ago, and I think now is a particularly exciting time. Over the past year, I’ve been running a validator node at home. Despite the bites, I welcome the bear. Overnight, it feels like the space became quieter and more discerning. It’s time to build. Here’s my Eth learning project: https://bitcoinmirror.org/ I also love old growth forests. I’ve been intentionally spending more time offline this year, backpacking in the redwoods. I’m on Farcaster and Twitter: https://twitter.com/dcposch ",
                    "links": [
                        "https://twitter.com/dcposch"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Okpara",
                    "index": "107",
                    "likes": "0",
                    "time": "19/05/2022-18:38:19",
                    "content": "Blockchain seems to be the current foundation of Web 3.0… By way of introduction, I am someone that just created an alternative to Blockchain. From blocks to spheres… blockchain to atomsphere… The Atomchain!    GitHub    GitHub - OkparaOkechukwu/atomchain Contribute to OkparaOkechukwu/atomchain development by creating an account on GitHub.      ",
                    "links": [
                        "https://github.com/OkparaOkechukwu/atomchain"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/TsBauer",
                    "index": "108",
                    "likes": "1",
                    "time": "22/07/2022-08:06:45",
                    "content": "Hello fellow Ethereum enthusiasts!  My name is Thomas. I’m a former professional poker player. But I switched my entire focus to computer science and software engineering a couple of years ago. Whereas Crypto and blockchain have been my passion for even longer. Currently, I’m focusing on scaling solutions - especially ZK-STARKs. These days, I’m writing a thesis about the influence of ZK-STARKs on smart contract engineering. I’m also having a startup project with a friend on StarkNet. Nonetheless, I highly appreciate the power of a decent L1 solution. And no L1 is better than good old Ethereum, right? I’m happy to participate in discussions. By that I hope to provide some value to the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1641025641025635
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gmako6",
                    "index": "109",
                    "likes": "1",
                    "time": "25/07/2022-00:45:10",
                    "content": "hello, I am George (official internet user handle: gmako6). I am a computer science student focusing on smart contracts and blockchain development. I am good in react js, web3, and react native. I would like to have the best Mentors in smart contract development Ihave a plan to initiate a stat]rtup to level up my fellow africans to blockchain technology. Twitter handle: https://twitter.com/gmako6 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.660714285714285
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/EllaMackness",
                    "index": "110",
                    "likes": "0",
                    "time": "08/08/2022-12:51:36",
                    "content": "I’ve been investing/studying cryptocurrencies for a long time. Now I’m delving into the technical part of blockchain. I am trying to understand exactly the infrastructure of several blockchains (eth, matic, bnb chain). I am also interested in topics like:  Decentralised storage, authentication, the problem of storing user wallet keys and so on Zk evm Operation of evm (eth org I’m already reading, getting into it)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/burnto",
                    "index": "111",
                    "likes": "0",
                    "time": "23/08/2022-03:05:55",
                    "content": "Hey all, Brent Fitzgerald here. I’ve been actively developing in the Ethereum space for a bit over a year, mostly in projects related to DeFi and novel uses of NFTs. I have a long history in traditional fintech / payments stuff, with focuses on mobile payments and developer tooling. And along the way I’ve played a lot with computational art and building weird UIs. I live in Oakland, USA, where I enjoy riding bicycles, tromping around on trails, and helping kids with math. I’ve been psyched lurking in this forum for a few weeks seeing the smart and creative energy. Looking forward to learning, helping, and contributing where I can. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.394234553325462
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/merikarhu",
                    "index": "112",
                    "likes": "0",
                    "time": "23/08/2022-12:26:06",
                    "content": "Hello Magicians. My name is Aleksi Honkakari. I am Artist, validator, delegator at least. Main core are combined as build physical Art - Artists and DAO. Currently working on Art project, inkDrawing&openAi thx and pleasure to meet everyone! Aleksi ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/yupotrew",
                    "index": "113",
                    "likes": "0",
                    "time": "25/08/2022-07:31:36",
                    "content": "Hey everybody! I’m Emi and I’m getting to know more about crypto everyday. I invest in BTC and ETH but recently have been discovering new alt coins and reviewing them thoroughly. My faves are SOL and WEI (a new very promising project), but I’d like to know more. Maybe we could discuss some of ETH forks? Pleasure to be here  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.951948051948052
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/sirius",
                    "index": "114",
                    "likes": "0",
                    "time": "25/08/2022-12:42:07",
                    "content": "@sirius here! I am currently about to complete 5 months since I discovered web3, they have been ups and downs everywhere, and the path without a guide is more complicated. I have been part of the team since the first days of May this year, and have been sailing since 2006… I have some developed projects, some that are still in process and many more complete… I usually don’t visit the blog for a long time, but when I’m here I try to read or be active as much as possible. Feel free to send me a direct message and tell me about any interest of yours or blockchain… or any topic that you like! Salu2! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5617559523809526
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/5cent-AI",
                    "index": "115",
                    "likes": "0",
                    "time": "04/12/2022-04:01:32",
                    "content": "Hi all, I am 5660.eth from China. I used to be a soldier, studying military science, engineering and finance. Previously worked as a researcher in traditional finance, and also worked as a researcher in CEX. My English is not good, and sometimes I even have to use Google Translate to communicate with everyone, haha. I don’t know how to program(learning), but I really like the atmosphere here, everyone seems to be doing some amazing things, and I will try my best to communicate with everyone. about me => 5660.eth.limo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.768518518518518
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/cybertelx",
                    "index": "116",
                    "likes": "0",
                    "time": "04/12/2022-09:31:50",
                    "content": "hi  i’m cybertelx.eth and i’m a 13 year old dev interested in ZK cryptography, defi, DAOs, blockchain scaling and smart contract wallets ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.940476190476191
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/zak46",
                    "index": "117",
                    "likes": "0",
                    "time": "29/12/2022-18:07:28",
                    "content": "Hello, I’m Zak who start to learn ETH from now on. let’s enjoy it together:) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/AdamGil",
                    "index": "118",
                    "likes": "0",
                    "time": "17/01/2023-11:43:16",
                    "content": "Hey Crypto Bro’s! I am a newbie to this forum. I would like to take this as opportunity to introduce myself. My name is Adam and I am Crypto Enthusiast. I have 3 years of experience in blockchain & crypto as a market analyst. Joined recently one organization as a Research Analyst and my scope of work lies in predicting the crypto prices, noting the price movements and crypto market news. Happy to connect and learn from you all. Thanks, ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/kofujimura",
                    "index": "119",
                    "likes": "0",
                    "time": "31/01/2023-10:33:16",
                    "content": "Hello everyone! My name is Ko Fujimura. Before the blockchain era, I created a platform for circulating tickets and vouchers on the internet and wrote IETF RFC3506, 4153, and 4154. Currently, I am focusing on developing the token circulating system that issues, transfers, presents, or consumes a token only if the control tokens are owned by the participants of the transaction. The control token themselves can be any type of token and recursively circulated in the token circulating system. See this paper for more details. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/speis",
                    "index": "120",
                    "likes": "0",
                    "time": "07/02/2023-10:28:05",
                    "content": "Hello magicians! My name is Joonas and im from Finland🇫🇮 Im musician, VJ, Videographer/editor, graphic designer. I got audiovisual communication education and now learning to coding. First time i was into crypto ~2011 but it ~2019 i joined DeFi world and want to contribute world decentralizion. Im open minded and want to share my creativity skills. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jimmyw3c",
                    "index": "121",
                    "likes": "0",
                    "time": "10/02/2023-07:22:40",
                    "content": "Hello everyone, I am a newbie here. My name is Jimmy and I am a web3 entrepreneur. I have 3 years of experience in blockchain & crypto as a entrepreneur. I’m currently the co-founder of UBIQnet, which is a DePIN(Decentralized Physical Infrastructure Network) project aims to adaptively schedule computing resources among cloud, network, and edge according to business demands. My honor to connect and learn from you all. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/urataps",
                    "index": "122",
                    "likes": "0",
                    "time": "11/02/2023-00:04:28",
                    "content": "Hello There! I am a strong introvert, so it’s a big step for me saying this hello  I’ve been programming Solidity and doing research on smart contracts for over 3 years now I love the open-mindedness of the web3 community and I would be glad to criticize ideas here Also I would like to start my journey in writing an EIP myself, so I am happy to receive criticism as well Cheers everyone! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.2063492063492065
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/alvinwo",
                    "index": "123",
                    "likes": "1",
                    "time": "15/02/2023-14:19:27",
                    "content": "Hey magicians, I’m alvin! I’m a software engineer in a web2 company now. I would like to join the web3 community, and contribute to the web3 community to build something really meaningful to the world! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/GabrielMartinez",
                    "index": "124",
                    "likes": "0",
                    "time": "13/03/2023-10:42:13",
                    "content": "Hello everyone, I’m Gabriel, and I’m a blockchain engineer for a company. I’m here to propose an ERC for notifications during the following days. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/sunny2022da",
                    "index": "125",
                    "likes": "0",
                    "time": "14/03/2023-06:43:43",
                    "content": "Hello, I am Sunny that works for a web3 company, having some experience in programing language virtual machine and compiler tech, hope I could learn EVM from you and make contribution here. Feel free to ping me, I am eager to learn and have discussion with you. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/bawtman",
                    "index": "126",
                    "likes": "0",
                    "time": "18/03/2023-02:38:12",
                    "content": "Hey everyone, I am Kevin and I am a blockchain addict. I have been in website development for 20 years, Love all things dealing with code and started working with blockchain about one year ago, Main interests are in Web3 dev and contracts to include in php based games. Thanks for having me and have a great day! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.333333333333334
                }
            ]
        }
    ],
    "group_index": "1509"
}