{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/introducing-eas-the-ethereum-attestation-service-a-base-layer-for-trust-identity-reputation-voting-and-more/6703",
            "title": "Introducing EAS: The Ethereum Attestation Service - A base layer for Trust, Identity, Reputation, Voting, and more ",
            "index": 6703,
            "category": [],
            "tags": [
                "reputation-systems",
                "attestation"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/slavik0329",
                    "index": "1",
                    "likes": "2",
                    "time": "21/07/2021-19:15:47",
                    "content": "EAS is a base layer protocol for global, generic attestations. Any attestation schema/type can be registered. It is made up of two simple smart contracts. One is an attestation schema registration contract which allows anyone to register any type of attestation. The second is simply a ledger of all attestations. EAS is meant to be a public good like ENS. We imagine infinite use cases which will open up the Ethereum ecosystem to endless possibilities not limited to mostly finance. We would love to get feedback on this project! https://eas.eth.link - Details, Contract links in the slides. Smart contracts: https://github.com/ethereum-attestation-service/contracts Team: Steve Dakh, Dino Mark, Leonid Beder Thanks! -Steve Dakh ",
                    "links": [
                        "https://github.com/ethereum-attestation-service/contracts"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.504464285714286
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/krebit",
                    "index": "2",
                    "likes": "0",
                    "time": "28/07/2021-22:36:50",
                    "content": "Hi Steve, This is Alejandro from Krebit, I saw your presentation on #ethcc, we’re definitely converging on the same path here, with a few twists, check out our working plan here (preparing testnet launch by mid August): Krebit's Motivation and Vision A couple of things we’re building from Krebit’s side that seem different from your approach:   Krebit leverages IDX for reusing DIDs, which makes it single-sign-on cross-chain ready and much better for onboarding   All the data would be stored off-chain, controlled by each of those DIDs (sovereign)   There will be a cyclical token, for both issuing attestations and DAO governance, I see no other way around it in order to trust or pick the attestators in an open marketplace   Finally, I think we can be compatible with any attestation approach, we just need to set the interfaces for the schemas, that’s why we’re going to follow the W3C recommendation for verifiable credentials:   https://www.w3.org/TR/vc-data-model what are your thoughts on that?   Happy to keep discussing on this very passionating topic! Thanks, Alejandro ",
                    "links": [
                        "https://www.w3.org/TR/vc-data-model"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.697115384615384
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/slavik0329",
                    "index": "3",
                    "likes": "0",
                    "time": "28/07/2021-22:59:40",
                    "content": "Hi Alejandro, EAS presupposes nothing. We intentionally did not want to build in any specifications as we are simply a base layer for any kind of attestations. With EAS you can register an attestation schema that follows the DID spec if you wish and then make attestations referencing it. EAS also doesn’t assume that all attestations will be on chain. Our SDK and contracts provide an easy way to create off-chain attestations that can be verified by anyone and also be submitted on-chain by anyone at a later time if desired. We have no token because since we don’t believe we will have to change the contracts since we kept everything as minimal as possible and presupposed nothing. Anyone can attest or register a new schema on EAS for any reason. The only token required is ETH to pay for the TX fees. For these reasons I believe EAS can possibly be a platform for your attestations. There is no need to create a separate system. Attestations can be votes, trade agreements, social scoring, ratings, tweets, etc. There is no limit to the types of attestations that can be made so that was the purpose for EAS. -Steve ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.151515151515151
                }
            ]
        }
    ],
    "group_index": "1396"
}