{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/eip-3670-eof-code-validation/6693",
            "title": "EIP-3670: EOF - Code Validation ",
            "index": 6693,
            "category": [
                "EIPs",
                "Core EIPs"
            ],
            "tags": [
                "evm",
                "evm-object-format",
                "shanghai-candidate"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/axic",
                    "index": "1",
                    "likes": "0",
                    "time": "20/07/2021-09:03:07",
                    "content": "This is the discussion topic for  Ethereum Improvement Proposals   EIP-3670: EOF - Code Validation Validate EOF bytecode for correctness at the time of deployment.      ",
                    "links": [
                        "https://eips.ethereum.org/EIPS/eip-3670",
                        "https://ethereum-magicians.org/t/evm-object-format-eof/5727/16"
                    ],
                    "GPT-summary": "The post is an explanation of the Ethereum Improvement Proposal EIP-3670, which proposes to validate EOF bytecode for correctness at the time of deployment. There is no request for feedback or collaboration, but a third party could provide constructive criticism of the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/axic",
                    "index": "2",
                    "likes": "0",
                    "time": "05/02/2022-01:56:40",
                    "content": "Since EIP-3670 was added to the CFI (Considered for Inclusion) list for Shanghai today, I’d like to raise a question regarding this in the rationale:  The deprecated CALLCODE (0xf2) opcode may be dropped from the valid_opcodes list to prevent use of this instruction in future. Likewise SELFDESTRUCT (0xff) could also be rejected. Yet we decided not to mix such changes in.  It would be nice to disallow these two instructions, which means EOF contracts containing those instructions cannot be deployed. (Legacy contracts are unaffected.) I think CALLCODE is a no brainer. SELFDESTRUCT is a more complicated topic, depending on the fate of it, it may become a feature for sending value without triggering execution. I personally think that is not a good idea, so would propose to reject that in EOF.  Furthermore, depending on other proposals it would be possible to restrict further instructions:   PC if EIP-4200 is adopted  JUMPDEST if either EIP-3690 or EIP-4200+EIP-4750 is adopted  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.034090909090909
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "3",
                    "likes": "0",
                    "time": "07/02/2022-07:38:11",
                    "content": "If an instruction is deprecated then I think that almost by definition a contract that uses them is invalid, and therefore should not pass code validation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/poojaranjan",
                    "index": "4",
                    "likes": "1",
                    "time": "25/05/2022-17:51:08",
                    "content": "EVM Object Format (EIP-3540 & EIP-3670) with @gumb0 @axic @chfast      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1392"
}