{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/the-term-council-may-be-easily-misunderstood-by-ourselves-and-the-community/357",
            "title": "The term \"Council\" may be easily misunderstood by ourselves and the community ",
            "index": 357,
            "category": [
                "Announcements"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "1",
                    "likes": "1",
                    "time": "15/05/2018-16:08:05",
                    "content": "Some useful feedback from the ethereum/EIPs Gitter channel:  Nick Johnson @Arachnid 01:55 Can I just say that “Berlin Council” is not a great name. Micah Zoltu @MicahZoltu 02:05 So many people hating on the name of this thing.  Thomas Jay Rush @tjayrush 07:18 Should be”Berlin Inclusion”. I can see the headlines now. “Magicians’s Council meets at Berlin. Only 100 Allowed In.” Stop calling it a council! Nick Johnson @Arachnid 08:09 “Workshop” and “Working group” both sound better than “Council” to me Or just “Meeting” Jamie Pitts @jpitts 08:59 Interesting, @arachnid what do you think is wrong with it? I have my own opinions but don’t want to bias yours Nick Johnson @Arachnid 09:01 It just sounds a bit exclusionary and far more ‘official’ than it really is. Councils have closed memberships. It also sounds pretty pretentious. Like “the Tokyo accords” or “the Geneva convention” Jamie Pitts @jpitts 09:03 LOL. ok that is good feedback. The Magicians metaphor can go too far and communicate the wrong intention.  So if you feel that “Council” as a term is just not right for what this set of meetings will embody, say that here. And declare an alternative as well. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.954081632653061
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/fubuloubu",
                    "index": "2",
                    "likes": "3",
                    "time": "15/05/2018-18:33:11",
                    "content": "“The Berlin Brouhaha” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "3",
                    "likes": "1",
                    "time": "15/05/2018-19:41:36",
                    "content": "I think we’ll end up just as “Magician’s Meetings”, and that’s what I’ve updated the site to read. See https://ethereum-magicians.github.io/berlin-council/magicians-meetings/ And – we are confirmed for July 14th & 15th at c-base. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/expede",
                    "index": "4",
                    "likes": "3",
                    "time": "23/05/2018-18:57:19",
                    "content": "Perhaps “Ethereum Magicians’ Congress”? Keeps the heightened tone, but possible less exclusionary undertone. Less Tolkienesque, sadly  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.958333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "5",
                    "likes": "1",
                    "time": "19/07/2018-21:41:06",
                    "content": "I’m circling back around to this. I think we’re going full meme with this and people aren’t too fussed with the naming anymore? I shouldn’t have caved so easily the first time around  Magicians – this forum and its members. Rings – working groups Scrolls – long term knowledge, playbooks, notes in the Github wiki Councils – the tri-annual meetings that we’re committing to for now Meetings / events outside of the tri-annual ones are likely to be Ring Meetings and regional and/or ad-hoc events. Back in Drupal land, we called them Drupal Camps, but that doesn’t fit our meme-ology. Anyone? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.768518518518518
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/mariapaulafn",
                    "index": "6",
                    "likes": "3",
                    "time": "23/07/2018-20:46:59",
                    "content": "Chipping in. I do not think, from a comms perspective that the word council has a negative connotation. What I do believe, is that the message has not been clear enough that EVERYONE can join these meetings. I tried to clarify in my blogpost, and got some interesting questions around. I believe that if we can reinforce blogposts, invitations, share them on Reddit (always ask as I got enough karma), and etc. we can raise awareness on this. It’s not the word but the lack of communication. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "7",
                    "likes": "0",
                    "time": "01/08/2018-23:41:57",
                    "content": "It’s always been our intent that anyone can attend.  It’s also true, and Council sort of communicates, that we are gathered for a purpose, so those not deeply interested working on our technology will probably be very bored. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.291666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/Jason_C",
                    "index": "8",
                    "likes": "0",
                    "time": "03/08/2018-03:54:41",
                    "content": "Is it too late to suggest “Summit”? It gives the heightened connotation, encourages networking and mingling, and matches the meme-core of all the mountains they climb in the book to meet their goals. Some might think they’re “top-brass only” and/or exclusive, but after many of the non-top-brass non-exclusive summits I’ve been to this interpretation might be on the way out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gcolvin",
                    "index": "9",
                    "likes": "0",
                    "time": "04/08/2018-19:28:05",
                    "content": "Too late, I hope ;-> ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                }
            ]
        }
    ],
    "group_index": "903"
}