{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/ethereum-magicians-remote-hackathon/1519",
            "title": "Ethereum Magicians Remote Hackathon! ",
            "index": 1519,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "1",
                    "likes": "10",
                    "time": "02/10/2018-22:27:42",
                    "content": "Hello Magicians! After talking to a few people about it, I would like to start a remote hackathon with the ethereum magicians. This will be a good opportunity for a longer hacking period, allowing for EIPs and ethereum long term issues to be the focus. Our friends at Colony have already had a great remote hackathon and to start I have forked their repo and began filling in the gaps. The reason I bring this up specifically before the Council of Prague is to allow for us to have the opportunity to invite people to join the hackathon during Prague Blockchain Week. To start it would be great if people indicate their interest in contributing to the larger organization of the hackathon. After we have a better idea of who wants to organize the hackathon, it would be great to plan a call for sometime next week. For now there are no concrete dates regarding anything. Thanks! ",
                    "links": [],
                    "GPT-summary": "The author is proposing a remote hackathon with the Ethereum Magicians to focus on EIPs and long-term issues. The author has already started filling in the gaps and is inviting people to join the hackathon during Prague Blockchain Week. The author is asking for people to indicate their interest in contributing to the organization of the hackathon and plans to schedule a call for next week.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 6.122916666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chisel",
                    "index": "2",
                    "likes": "3",
                    "time": "03/10/2018-00:00:46",
                    "content": "I’d be happy to help organize, and join a call next week to that end  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "3",
                    "likes": "0",
                    "time": "03/10/2018-14:19:49",
                    "content": "Awesome thanks @chisel! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "4",
                    "likes": "3",
                    "time": "04/10/2018-22:20:37",
                    "content": "The Status Hackathon is, I think, also set up for remote? Not sure. But, maybe you want to think of it as a “perma hackathon”? Like, how do we seed local regions to work together, and how do we get more and better open source contributions and collaborations? That’s all I got. No bandwidth for anything else. Go go go @ChainSafe  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "5",
                    "likes": "1",
                    "time": "05/10/2018-18:13:33",
                    "content": "Thats awesome, it would be great to have a bunch of parallel meetups happening to get people hacking! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/deltajuliet",
                    "index": "7",
                    "likes": "1",
                    "time": "10/10/2018-14:30:21",
                    "content": "I don’t know how much bandwidth I’ll have but I’m happy to join the call and contribute where I can. We’ll be in Prague for DevCon as well, and organizing some local things there! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "8",
                    "likes": "0",
                    "time": "10/10/2018-18:55:28",
                    "content": "Thanks for the feedback everyone! I apologize over the lack of communication, SF blockchain week has been extremely busy. If everyone could please fill out this poll so we can get things going next week. I am suggesting that the time is around 12pm EST to try and accommodate as many people as possible. If anyone wants to suggest another time please do.     Monday Tuesday Wednesday Thursday Friday     0 voters     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chrishobcroft",
                    "index": "9",
                    "likes": "1",
                    "time": "29/10/2018-16:14:02",
                    "content": "Here are notes from the breakout session about organising a Remote Hackathon as part of the Ethereum Magicians: Please feel free to add / amend as appropriate in the case that I missed something, or misrepresented. https://hackmd.io/8aSF4t87QqCPu6P5wiOIbA ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "10",
                    "likes": "1",
                    "time": "29/10/2018-21:42:24",
                    "content": "Thank you so much for taking these notes Chris, extremely excited to get a few of the action items complete and get things going  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.575
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/chrishobcroft",
                    "index": "11",
                    "likes": "1",
                    "time": "30/10/2018-17:57:12",
                    "content": "Livepeer are having a “Virtual Hackathon” on 14th  IMG_20181030_185347.jpg4048×3036 1.64 MB  Apologies for poor quality photo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "12",
                    "likes": "4",
                    "time": "07/11/2018-14:00:06",
                    "content": "Hey folks! I have attempted to summarize @chrishobcroft’s notes from our ring into a template/proposal for how a remoteHackathon could work. Intro The aim is to create a tangible template that reinvigorates our local communities - as some kind of valuable output of tangible energy back into our own local communities. Proposal As a starting point, I would like to expand on the previously stated 2 month hackathon timeline from a high level.  Split into 2 halves, the hackathon can begin with 1 month dedicated to local meetups.   The meetup period should be expected to have a minimum of two educational meetups dedicated to onboarding new developers, designers, researchers, etc… Meetups should also live stream these events to allow for remote participants to learn as well. By the end of the first meetup, participants should begin engaging in the wider remoteHackathon community, proposing hackathon project ideas that may be collaborated on by members of different communities. The intention is for these meetups to cater to the needs of local communities while engaging in the wider Ethereum ecosystem for support during the hackathon. Building relationships that could last a lifetime.   Hackathon   The hackathon period should have a minimum of two hacking sessions, where hackers and mentors can come together to solve problems. Hackers and mentors should be continuing the conversation online throughout the hackathon at ethereum-magicians.org allowing everyone to learn together from the problems being encountered. A decentralized group of mentors will be available to answer these questions.  Conclusion The intention for this is to create a template for a series of events that empower local communities to take part in, while allowing for wider Ethereum support. At the moment we have a repo forked from Colony (https://github.com/ChainSafe/remoteHackathon), this is by no means done, it is just a template to get us started. I will transfer it to the FEM github when necessary. Please join the conversation by adding to the proposal or making your own. We need people to turn intention into action by pledging to bringing this initiative to your local community. Notes from the Council of Prague ring that might be relevant \"Interest in how to connect into localized creative communities, outside the Blockchain space, which already have space / funding / shared community values - and seek to support these communities (example in Reno, Berlin). Aim to balance the focus of bringing a “hackathon” ethos to building (fun, experimental), with real-life use-cases to support communities. Important to create some kind of vision, but also leave space for less “planned” activities or objectives - i.e. accepting that we don’t know all the answers yet. Spreading the teaching of the information about what tools exist in our community, and empower / enable others to build. In order to convince someone to go to a localised hackathon, there needs to be some kind of incentive. However, connection to e.g. ETH Magicians, can potentially help to bring some “big speakers” to attract hackers. The travel / accommodation costs for “big speakers” might end up being the only funding needed. Another thing to draw in hackers is to encourage participation from projects already building in this space, in order to provide skilled resources to help hackers when they get stuck etc.\" Thanks you everyone for your interest in this! As the last action item states “Take this idea back to your communities - IT’S UP TO YOU TO START TO BUILD THE MOVEMENT” ",
                    "links": [
                        "https://github.com/ChainSafe/remoteHackathon"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8630230880230885
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "13",
                    "likes": "2",
                    "time": "19/11/2018-15:13:27",
                    "content": "We have had a lot of people say they want to help bring Ethereum to local communities and create frameworks for people to feel comfortable to start a meetup or another type of event. However here we have a potentially easy way to achieve this goal together and no one seems interested. Definitely disappointed with the noise on twitter and the lack of action here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.361111111111111
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "14",
                    "likes": "0",
                    "time": "22/11/2018-08:22:56",
                    "content": "I’m interested in organizing something in the Bay Area, but I won’t be able to do this until January. What I’d like to do is something relating to “Ethereum financial and operational primitives”. Mainly these would be small-scale and rough components to be strung together into workflows. These workflows would be strongly associated with practices for small organizations to safely receive, manage, account for, and disburse their Ether, DAI, and other crypto resources. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.763888888888888
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "15",
                    "likes": "0",
                    "time": "22/11/2018-18:01:20",
                    "content": "That’s awesome do you think you could maybe record it? It would be great to have a bunch of videos that we could use as resources for people joining the community. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/jpitts",
                    "index": "16",
                    "likes": "1",
                    "time": "29/11/2018-06:38:01",
                    "content": "That is a good idea, perhaps as things clear up I will carve out an hour to do it & upload… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gichiba",
                    "index": "17",
                    "likes": "0",
                    "time": "07/01/2019-12:27:49",
                    "content": "Hi there! I’m Griffin, and I organized the Colony Hackathon… I realize I’m super late to the game here but I’d be definitely interested in helping to organize more local, remote, and hybrid hackathons this year! –Griffin ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to collaborate on proposal",
                        "3rd party giving positive feedback on proposal"
                    ],
                    "Sentiment": 5.18452380952381
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/codydjango",
                    "index": "18",
                    "likes": "0",
                    "time": "08/01/2019-00:35:13",
                    "content": "I’m also interested in helping organize! I have time and energy  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "19",
                    "likes": "0",
                    "time": "08/01/2019-03:14:20",
                    "content": "Hey! That’s awesome  Should we arrange a call? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gichiba",
                    "index": "20",
                    "likes": "0",
                    "time": "08/01/2019-16:20:49",
                    "content": "Sure; I’ll also be at ETHDenver next month… but a call might be good to just generally sync up on what’s possible and how it can come together. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "21",
                    "likes": "0",
                    "time": "08/01/2019-18:07:23",
                    "content": "I will be there as well! @codydjango how about you? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/codydjango",
                    "index": "22",
                    "likes": "0",
                    "time": "08/01/2019-23:22:00",
                    "content": "No plans to leave Vancouver, for the near future  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "23",
                    "likes": "0",
                    "time": "09/01/2019-17:06:29",
                    "content": "So should we plan for a call sometime next week @codydjango @gichiba? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/codydjango",
                    "index": "24",
                    "likes": "1",
                    "time": "10/01/2019-05:21:07",
                    "content": "Sounds good to me. My schedule is very flexible at the moment, so feel free to book something at your leisure  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gichiba",
                    "index": "25",
                    "likes": "1",
                    "time": "10/01/2019-09:59:20",
                    "content": "Yeah, that sounds good to me! Currently based in London, so the timezone shift entails morning West Coast, afternoon Europe ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "26",
                    "likes": "0",
                    "time": "10/01/2019-16:23:42",
                    "content": "@codydjango @gichiba how about Monday at 2 EST? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/codydjango",
                    "index": "27",
                    "likes": "1",
                    "time": "14/01/2019-08:33:32",
                    "content": "Sorry about the delay. Monday morning works, but Tuesday or Wednesday would be better fit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gichiba",
                    "index": "28",
                    "likes": "1",
                    "time": "14/01/2019-16:02:07",
                    "content": "Also sorry for the (even longer) delay! Wednesday would be much better for me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "29",
                    "likes": "1",
                    "time": "14/01/2019-18:59:30",
                    "content": "No worries! Does Wednesday at 2pm work? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/codydjango",
                    "index": "30",
                    "likes": "1",
                    "time": "15/01/2019-04:03:58",
                    "content": "Works for me. I’ll just need to know where to sign on ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "31",
                    "likes": "0",
                    "time": "15/01/2019-04:13:38",
                    "content": "Sorry can we do 3pm? Maybe we can start a telegram or riot group to coordinate? I am @aidanh. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/codydjango",
                    "index": "32",
                    "likes": "0",
                    "time": "15/01/2019-04:26:16",
                    "content": "    ChainSafe:  aidanh   3’s good, and telegram works. I’m codydjango. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gichiba",
                    "index": "33",
                    "likes": "0",
                    "time": "15/01/2019-13:50:03",
                    "content": "Yeah, I don’t have ETHMagicians notifications so prolly better to coordinate there! I’m @gichiba on telegram Also 3pm tomorrow works for me! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.90625
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/ChainSafe",
                    "index": "34",
                    "likes": "0",
                    "time": "15/01/2019-17:17:45",
                    "content": "having trouble finding you @codydjango, do you mind adding both of us? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/gichiba",
                    "index": "35",
                    "likes": "1",
                    "time": "16/01/2019-18:38:31",
                    "content": "Hmmm we seem to have missed the mark on this one… I’m unfortunately not going to be free in a EST-friendly time until early next week. Maybe it’d be better to brainstorm a bit more asynchronously and then call? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/codydjango",
                    "index": "36",
                    "likes": "1",
                    "time": "16/01/2019-19:32:15",
                    "content": "I’ve added you both in a telegram group. No worries @gichiba, join in when you can  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "441"
}