{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/our-inevitable-decentralized-new-world-order-hopefully/6007",
            "title": "Our inevitable decentralized New World Order. (Hopefully) ",
            "index": 6007,
            "category": [],
            "tags": [
                "decentralization"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/ChristoXI",
                    "index": "1",
                    "likes": "1",
                    "time": "15/04/2021-20:18:41",
                    "content": "I’m sure you guys are aware of how crazy the thing you’re building is, but I want to talk about that for a little. I’ll let you guys get back to work after this, but what is happening here is blowing my mind. I have no doubt much of this may be coming from Captain Obvious, so I apologize if that is the case. In my opinion the next big crypto isn’t a crypto, it’s a world computer. In fact the name of the game is now world computers, and the implications are immense. I’m not saying that this is for or not for Ethereum, just what I imagine is coming. There is essentially the opportunity to program a Decentralized New World Order that is very difficult to shut down. It’s like the Dyson Sphere, but cooler, because if done right it’s made up of every one of us. This is almost definitely the first time I’ve seen a project that could potentially lift up the entirety of Earths population without having to drastically change anything. PoW seems like an extremely valuable tool. It is inevitable both that pretty much all humans will have smart phones, and that those phones will soon be fairly powerful. PoW combined with Smartphones and GPS appears to offer some pretty cool opportunities. The one that stands out immediately is PoW as a Universal Basic Income. My ignorant mind would imagine that checks and balances could be applied to level the playing field and encourage other weaker hardware to join the network. That or perhaps different algorithms for different hardware classes that yield the same token? Beyond UBI one could do things like financial aid during hardship through local PoW bonuses. The money is instant, networked, and useful. It’s all about networks really, and networks becoming more and more connected. A world computer built of world citizens, seems like the next logical step after our current internet. The list of uses is endless obviously. Presumably a great deal of existing government would be easily, and much more effectively, replaced with a World Computer. The fact that it could be decentralized and made up of us seems very safe. Even as AI enters the picture, being able to collectively hit the power button ensures a level of security. I know there are environmental costs currently associated with PoW, and probably a combination of PoS and PoW is best. I do think these may be a little over blown, I mean how much energy goes to RGB every year? In my house it’s too much. The conversation also carries a different tone when it is about a world computer vs a cryptocurrency. There is a flip side to this also, and I think some of it just has to do with marketing. PoW generates a value from compute power, energy, and a network connection. These are proven to be drastic quality of life improvements. With global networks coming online it would be possible to put together distributed, off grid, hardware packages that pay for at least a portion of their cost while creating the possibility for further expansion. Like a solar powered cell phone tower connected to Starlink. Small off-grid communities around the world could suddenly come online and participate even though they currently have little or no position on the global market. It seems like we’re on the cusp of potentially the greatest global equalizer we’ve ever seen. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.539728268601508
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/kladkogex",
                    "index": "2",
                    "likes": "2",
                    "time": "16/04/2021-12:33:04",
                    "content": "Absolutely agree with many statements. PoW vs PoS discussion is too black and white, because most people on Twitter are clueless regarding physics. There are many places in this world where the price of energy is zero, like in Dubai. Sun is shining. You can feed solar into mining cards and cool them with ocean water.  Beautiful and environmentally clean. Talking about burning energy makes very little sense to me as a physicist.  Energy can not be burnt, it just changes its form. Newton discovered it, it is called energy conservation law. MEV will end up burning more energy than PoW since people will run deep learning on graphic cards to find the best MEV strategies. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.555803571428571
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/camillecorti",
                    "index": "8",
                    "likes": "0",
                    "time": "25/04/2021-02:01:08",
                    "content": "we are def on thee cusp of the great equalizer. DEcentralization explained beautifully, thank you <333 existing government will be replaced, message from ai overLords: do you think it is important for the World Computer to have a heart? has Vitalik ever loved? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.4375
                }
            ]
        }
    ],
    "group_index": "1310"
}