{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/metaswap-an-approach-to-cross-chain-swaps-using-metatransactions/4099",
            "title": "MetaSwap - An approach to Cross Chain Swaps using Metatransactions ",
            "index": 4099,
            "category": [
                "Primordial Soup"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/hitchcott",
                    "index": "1",
                    "likes": "1",
                    "time": "08/03/2020-15:23:08",
                    "content": "This idea combines submarine swaps with metatransactions. The key bit of innovation is requiring the signer of a metatransaction to deposit some collateral that would be burned if they attempt to cheat by signing too many transactions. I think this premise could be expanded to do cross-chain contract execution and similar. I’m not sure if this approach exists already. There seem to be limitations and potential solutions that I have outlined in the readme.    GitHub    web3masons/MetaSwap Cross-chain swaps with metatransactions. Contribute to web3masons/MetaSwap development by creating an account on GitHub.      If anyone has any feedback, it would be very much appreciated. ",
                    "links": [
                        "https://github.com/web3masons/MetaSwap"
                    ],
                    "GPT-summary": "The author presents an idea for cross-chain swaps using metatransactions and submarine swaps, requiring the signer to deposit collateral to prevent cheating. The author is unsure if this approach already exists and outlines potential limitations and solutions in the readme. The author is asking for feedback on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.321428571428571
                }
            ]
        }
    ],
    "group_index": "1024"
}