{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://ethereum-magicians.org/t/berlin-meta-cartel-demo-day-business-model-ring-notes/3623",
            "title": "Berlin Meta Cartel Demo Day Business Model Ring Notes ",
            "index": 3623,
            "category": [
                "Working Groups"
            ],
            "tags": [
                "business-models",
                "council-berlin-2019"
            ],
            "content": [
                {
                    "author_link": "https://ethereum-magicians.org/u/boris",
                    "index": "1",
                    "likes": "1",
                    "time": "04/09/2019-21:38:19",
                    "content": "Permanent location of biz models - https://bitly.com/web3businessmodels Kevin - excited by PoolTogether Uses compound to generate interest    PoolTogether    PoolTogether Win $ every week just by saving your money.      12% on Compound PT - makes 10% Lots of questions on money to be made Compound is killing it Good model for DEX traders no fees — having fees from holding Ether If deposits are highly fluid Require of DEX might require deposit first before using in order to make money Would users be OK with this? cDAI or rDAI — stake who the interest goes to — eg fund a charity Kevin: interest works with staking / deposits Makoto: ETH NYC staking $30 worth of ETH Needs to be DAI Calculated that $18,000 — $45 of interest More ETH in a contract is a security risk About 10% of people never get their Kickback returned Could I have Kickback memberships which are perma-staked Megan: DAO like a Foundation endowment — enDAOment Lili: kind of fun - evolve into something that isn’t luck Build business model on top of opportunity cost — pyramid scheme Idea: DAO with a stated mission — interest is used to fund grants etc - reputation Reputation in DAOstack Sebastien: Pay for a service, privacy preserving — need someone to pay for gas Even 10% might be enough to fund things  Kevin Subscriptions Advertising Marketplace - ownerships / inventory take a cut ICOs Continuous Funding Staking NFTs Inflation funding Micro transactions — one way gas fee Paying with compute — eg PoW Data as Labour Megan: how is NFT a business model? Kevin: explains Gitcoin kudos Artists makes $1 per mint Boris / Megan: this is more like a marketplace model Makato: secondary market is where lots of money is made ENS Hadrien: with everything open source — what is the defensibility Subscriptions: what is the current state of this? Kevin: 1337 submitted — subscriptions using meta-transactions. Has a reference client. Use it for Gitcoin Grants. Live and in production. Next step: registry of people using subscriptions Megan: Tried to integrate subscriptions into Veriledger, weren’t able to. Idea - industry for profit closed source companies — percentage of revenue to open source projects. Discourse blog post on how they give back to open source that they use: Discourse Gives Back 2017 | Blog  Jamie: something like a patent Where software is built, and it’s not open source, until the team is paid Sounds like DRM that people also hate   Lili: will make an iteration slower? Guy: Sounds like an ICO or a promise? Boris: Hapi license for access to new versions https://hueniverse.com/on-hapi-licensing-a-preview-f982662ee898 Guy: what if Devs don’t open source? Jamie: reputation or legal contract. Maybe slashing. Noah: pay or contribute  Recommendations / curating — can you get paid by curating, affiliates  Guy: donations Boris: we’re back to shareware! Bonding curves: Influencers in this generation. Every influencer can have tokens. Can unlock exclusive content. Megan: Fairmint — (can’t find link?) Kevin: Commons Stack — Makato: Nexus Mutual — insurance — needed as part of their model. Kevin: bonding curves for Kickback Boris - Scalpback: primary - I hate Kickback — I’m an event organizer, I need money to pay for events Kevin: frontier, not extractive, projects like compound — accelerate the development of new models  What is the list of funding sources? _Probably shouldn’t live here, Boris started a page on the Ethereum Wiki _ Moloch DAO ETHHub ECF - don’t have money AFAIK Panvala Gitcoin Grants Dominance assurance contracts Funding public goods - no one wants to be the only one funding something 10ETH Kickstarter - When I cross the line — I get my money back 1559 - 150K cost to implement Working Group - Rick Dudley Annet: Filter for appropriate Grants Kevin: was the grant used? Who decides: daostack — transparent  Common applications ",
                    "links": [
                        "https://pooltogether.com/",
                        "https://pooltogether.com/",
                        "https://blog.discourse.org/2017/12/discourse-gives-back-2017/",
                        "https://hueniverse.com/on-hapi-licensing-a-preview-f982662ee898",
                        "https://eth.wiki/en/funding"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.654933481152994
                },
                {
                    "author_link": "https://ethereum-magicians.org/u/anett",
                    "index": "2",
                    "likes": "0",
                    "time": "06/09/2019-14:08:58",
                    "content": "Great notes  Thank you @boris ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                }
            ]
        }
    ],
    "group_index": "919"
}