{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/knowledge-transfer-generate-economic-graph-visualizations/11481",
            "title": "Knowledge Transfer: Generate Economic Graph Visualizations ",
            "index": 11481,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "grants"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "2",
                    "time": "11/09/2022-01:54:24",
                    "content": "Over the years I have been publishing graph visualizations of the Gitcoin Grants datasets, like these.  Screen Shot 2022-09-10 at 7.45.08 PM1708×1360 112 KB  This is data from Grants Round 13.  Each node in the network is a user (or grant) and each edge is a transaction between those nodes. I find these graphs are useful for visualizing each grants round in 3-dimensional space.  Using this data you can see which users/grants are hyperconnectors and which are on islands unto themselves. @Benwest asked me to tell him how to generate mesh visualizations of the grant data., so here goes:  On Grants 1  Get staff permissions on Grants 1 from CSDO. Go to https://gitcoin.co/_administration/mesh  Enter the fields on the form, and click ‘Go’. This doesnt ALWAYS work because sometimes there is so much data the tool times out (either server side, or client side it can crash your browser).  If this happens, try again and use the ‘trimmed’ parameter to trim the dataset by 99%.  Here is what the form looks like.  The fields:  Trimmed, 0% to 99% how much should the data be trimmed into a representative sample? (default: 0%) Label: Do you want to see the names of the nodes? (default: no) Theme: light or dark, self explanatory (default: light) type: return grant data, bounties data, tip data, kudos data, or all data (default: all data) From/to: from => to dates (default: current day)   /results updates Every round I’ve historically tweeted out these onto this thread and updating https://gitcoin.co/results/ with the new viz here Now that I’m disaffilated I wont be doing this for GR15 data.  Someone in the DAO should probably do it IFF it the DAOs intent to keep publishing these.  On Grants 2 If anyone wishes to build a similar tool for traversing the data in Grants 2, you can just use simplegraph.js to do it.  Just plug in the transactional data to that visualization tool. There are probably better graph analysis tools to use, but simplegraph.js is the one i’ve used. ",
                    "links": [
                        "https://www.shortform.com/blog/malcolm-gladwell-connectors/",
                        "https://twitter.com/BenWest/status/1565818468934492162",
                        "https://twitter.com/owocki/status/1540257178233106433",
                        "https://gitcoin.co/results/",
                        "https://github.com/gitcoinco/web/blob/master/app/retail/templates/results.html#L190",
                        "https://gov.gitcoin.co/t/passing-the-torch/10971",
                        "https://gitcoin.co/_administration/mesh?trim_pct=97&show_labels=0&theme=light&type=grant&year=2022&month=9&day=7&to_year=2022&to_month=9&to_day=22&submit=Go",
                        "https://github.com/gitcoinco/web/blob/master/app/dataviz/templates/dataviz/mesh.html#L30",
                        "https://gov.gitcoin.co/t/gitcoin-digest-33-merge-day-gr15-round-manager-is-live/11513"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.49512987012987
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ccerv1",
                    "index": "#2",
                    "likes": "3",
                    "time": "11/09/2022-02:08:43",
                    "content": "This is amazing. I want to give it a whirl! For other tools for making directed or undirected network graphs, also consider:   Flourish - easy no code solution  Observable - need to know some javascript and have your data processed, but very easy to customize AND takes advantage of the full d3 physics engine  Plotly Cytoscape - need to know python and how to deploy to a web server. This is even more customizable and helpful if you want a standalone webapp with features that a user can customize.  You can also just use NetworkX in python for a static visualization, but that’s no fun. ",
                    "links": [
                        "https://observablehq.com/@d3/force-directed-graph",
                        "https://dash.plotly.com/cytoscape"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.763541666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "5",
                    "time": "11/09/2022-06:07:53",
                    "content": "    ccerv1:  For other tools for making directed or undirected network graphs, also consider:   I think there is a sweet spot for data exploration/viz tools like these to hasten the DAOs ability to turn data into learning into insights.   could be major alpha in the infinite game against the red team! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8875
                }
            ]
        }
    ],
    "group_index": "197"
}