{
    "poll_list": [
        {
            "id": "0x93d337378cc8c6c507b88ebb518ddd57f772bb010b75cb9daaae03974eeacfdb",
            "title": "Fraud Defense & Detection (FDD) S13 budget request",
            "discussion": "",
            "body": "Workstream Mandate: Defend Gitcoin (Grants, DAO, & future products) from threats to its legitimacy, credible neutrality, and sustainability.\n\nFDD is requesting $879,000 (93,500 GTC*) to fund Season 13 (S13) and replenish its reserves for S14.\n\nHigh Level Budget Breakdown\nSeason 13 Budget Total = $596,295 = 74.1k GTC ($8.05/GTC*)\nPLUS Season 14 Reserves = $596,295\nTotal Needed = $1,192,590\nMNUS Current Reserves = $313,000\nTotal Amount requested at this time = $879,590 =109,265 GTC ($8.05/GTC*)\n*Prices last updated 2/16/22\n\nThe GTC total will be adjusted based on the current market value at the time this proposal is moved to Snapshot and to Tally. The vote will be to send $879,590 in GTC at the current price when moved to Tally or the 20 day moving average (whichever is lower).\n\nFDD Season 13 (Q1) 2022 Budget 8\n\n*TL;DR*\n\nSeason 13 Financials\nSeason 13 is $155k increase = 34% budget increase\nSeason 13 Round Deliverables:\n\nWe currently have 18 outcomes for the next 90 days. Each outcome has 3 measurable key results that will determine if we achieved the outcome.\n*Ground Control (Operations)*\n - 90% of decisions for mid-season budget changes and new proposals will go through our FDD Operating System rather than just Disruption Joe\n- Disruption Joe will participate in our “source council 2” rather than having a workstream lead salary\nLong term metric goals will be set to define the health of our initiatives\n\n*Sybil Defenders*\n- GitcoinDAO will run the end to end operational processes of the anti-sybil ml pipeline reducing our dependence on Blockscience\n- A simulation software will be developed to let us better anticipate attacks and possibly increase training opportunities for the ml models\nA human evaluations app built for effective training, improved inter-reviewer reliability at a lower cost per evaluation, and continuous data insights\n- Work will continue on our long term vision A Community Based Roadmap for Sybil Detection Across Web 3 1\nWe will gain soft commitments and technical requirements from 3 partners to a sybil data sharing network built with a web 3 ethos & ethics\n\n*Grants Investigation Agency (GIA)*\n- We are using the GIA tool built last round to review the estimated 7-800 new grant applications that come in.\n- Our goals include increasing the number of reviewers per grant, lower the cost per review, and define a mechanism design that will allow us to open up the review process to anyone via staking of GTC\nBuilding the decentralized appeals integration and testing it\nReviewing and updating ALL of the grant eligibility policy documentation\n\nThis budget was reviewed by many stakeholders including the FDD Multisig Oversight Council, other workstream leads, and some Gitcoin Holdings team members. One question that came up multiple times was “If you had to slash $x from your budget, do you know what you would cut?” The answer is yes. However, it wouldn’t be to the benefit of Gitcoin. We could operationally function at half this budget for GR13, but we wouldn’t be doing anything to build scalability into our tech or our processes.",
            "choices": [
                "Fund FDD as requested",
                "Do not fund FDD as request"
            ],
            "scores": [
                2902493.432814721,
                450105.311
            ],
            "start": 1645037582,
            "end": 1645470000,
            "snapshot": "14212732",
            "state": "closed",
            "author": "0xc2E2B715d9e302947Ec7e312fd2384b5a1296099",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        }
    ],
    "discourse_list": []
}