{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gtc-single-sided-liquidity-whitelisting-proposal-is-now-being-voted-on-at-bancor/5379",
            "title": "GTC single sided liquidity whitelisting proposal is now being voted on at Bancor ",
            "index": 5379,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/proy24",
                    "index": "#1",
                    "likes": "0",
                    "time": "07/06/2021-17:46:07",
                    "content": "TLDR Bancor $GTC whitelisting proposal is now live for voting on Snapshot, If passed, GTC holders can stake their GTC tokens in the pool and earn passive rewards in the form of more $GTC (and also in $BNT if a subsequent LM reward vote is approved) without suffering from IL. For the proposal to pass, 20% of quorum and >67% FOR votes are needed, so any vBNT (Bancor gov token) holders amongst the Gitcoin community should go and vote on the proposal. Bancor is the OG DEX where liquidity providers can get decent returns  on staked tokens without suffering from impermanent loss, Bancor has been a friend to Gitcoin community and has sponsored multiple hackathons and bounties in which many developers (myself included) have built features and broadened the horizons of our knowledge. There is currently a snapshot vote live for whitelisting the $GTC token for Bancor Single sided liquidity protection. This is immensely beneficial for GTC holders since they can now provide liquidity on the GTC side of the pool and earn passive yield on the GTC tokens without suffering from IL. This is 2 major benefits -  GTC holders no longer have to sell half their tokens for ETH in order to provide liquidity For a token like GTC which is still in price discovery phase, providing liquidity carries extreme risk of impermanent loss (magnified in UNI v3 where you could potentially involuntarily sell all your GTC for ETH if the token price significantly outperforms vs. ETH)  Additionally, pool whitelisting on Bancor is often followed by additional BNT Liquidity mining rewards for stakers (requires a separate vote) on both TKN side and BNT side of the pool. Here is a link to the snapshot vote (currently underway)- https://snapshot.org/#/bancornetwork.eth/proposal/QmYmYwNMr7xvpmrtQsKLTPRmnmjMV9KZYvKh7F15WxdvK6 Link to governance proposal and discussion-   Bancor Governance Forum – 1 Jun 21    Proposal : Whitelist Gitcoin (GTC) / 250K BNT Co-Investment This Proposal Is expected to appear on Snapshot for Voting on Monday June 7th, 2021.  TLDR;   Proposal to Whitelist GTC. Proposed Co-Investment 250K BNT. There are no apparent Security Concerns that would prohibit Whitelist Status. There is no reason...  Reading time: 1 mins 🕑 Likes: 16 ❤       Guide to how IL protection (single sided liquidity provision) works on Bancor   docs.bancor.network    The V2.1 Difference How Bancor's V2 Update Takes AMMs to the Next Level‌      In-depth analysis of impermanent loss   Medium – 7 Nov 20    Beginner’s Guide to (Getting Rekt by) Impermanent Loss Automated market maker (AMM) technology has taken off in spite of one of DeFi’s dirty secrets: Users who provide liquidity to AMMs can see…  Reading time: 3 min read       If the vote passes on Bancor governance, the gitcoin community should then decide whether liquidity providers on the pool should still be eligible for voting rights (they should since providing liquidity is a vital form of governance) and whether the DAO wants to allocate LM rewards to LPs on the pool. ",
                    "links": [
                        "https://snapshot.org/#/bancornetwork.eth/proposal/QmYmYwNMr7xvpmrtQsKLTPRmnmjMV9KZYvKh7F15WxdvK6",
                        "https://gov.bancor.network/t/proposal-whitelist-gitcoin-gtc-250k-bnt-co-investment/2297",
                        "https://gov.bancor.network/t/proposal-whitelist-gitcoin-gtc-250k-bnt-co-investment/2297",
                        "https://docs.bancor.network/getting-started/the-v2-difference",
                        "https://docs.bancor.network/getting-started/the-v2-difference",
                        "https://blog.bancor.network/beginners-guide-to-getting-rekt-by-impermanent-loss-7c9510cb2f22",
                        "https://blog.bancor.network/beginners-guide-to-getting-rekt-by-impermanent-loss-7c9510cb2f22"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.316118777056277
                }
            ]
        }
    ],
    "group_index": "455"
}