{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/impact-certificates-proposals-wanted/10499",
            "title": "Impact Certificates [Proposals Wanted] \\xf0\\x9f\\x93\\x84 ",
            "index": 10499,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "15",
                    "time": "05/05/2022-03:29:17",
                    "content": "I think that the idea of an Impact Certificate is really powerful. If ImpactDAOs were able to issue highly legitimate Impact Certificates, then we’d have a verifiable on-chain resource for validating who has created Impact. Some hypothetical examples:  40k Tons Carbon Removed from Atmosphere Impact Certificate; Signed by Gitcoin Governance 15k Citizens Removed from Poverty Impact Certificate; Signed by CaliforniaDAO  If someone reads an Impact Certificate claiming X impact, they could be reasonably sure that that claim was actually physically legitimate if there was an attestation of it coming a knowledgeable and credibly neutral source (say, perhaps Gitcoin governance). This idea could get really powerful if we were able to create buy pressure for Impact Certificates.  One could imagine a world in which crypto-wealthy philanthropists buy Impact Certificate NFTs to flex how much they’ve done to support their favorite charitable causes or public goods.  Screen Shot 2022-05-04 at 9.22.17 PM2370×868 152 KB  If ImpactDAOs prove they are able to create a good amount of income at their later stages, then ImpactDAOs become investable at their early stages, as investors seeking a return discover ImpactDAOs.  Over time, as this cycle matures & grows, the capitalist flywheel that traditionally invests in traditional for-profit ventures would start to turn for the public good.  HubSpot-English-Flywheel-Jul-27-2020-04-17-18-68-PM1360×1358 56.4 KB  One powerful Impact Certificate integration could be Grants 2.0.  I hope that one day you can browse by Gitcoin Grants that had been issued the most Impact Certificates.  Having knowledge of which projects have created Impact could be a valuable new source of data for crowdfunders who are trying to make good decisions about what to fund. Is anyone working on something like this or interested in starting to? If so, I would like to talk to you. Please (1) join this telegram (2) post a proposal below in 500 words or less that articulates how you would attack this problem and what would have to be true for it to happen (hint: please ask for funding, I want to fund good proposals!). Attributes of a good proposal:  Leverages open standards (DIDs, VCs, NFTs) to create Impact Certificates Uses governance to create credible neutrality of Impact Certificates Enables the creation of a liquid market with buy pressure for Impact Certificates. Being built by a credible team with experience building product. Integrates with Gitcoin Grants 2.0 Project Registry and/or Proof of Impact (optional)  I have budget to fund as many promising proposals as I receive, and will decide how to spend that budget on a case by case basis. ",
                    "links": [
                        "https://t.me/+ORZ8joj8_AhjM2I5",
                        "https://gov.gitcoin.co/t/proof-of-impact-proposals-wanted/10179",
                        "https://gov.gitcoin.co/t/impactdao-category-creation-proposals-wanted/10500",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.586385281385281
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/djnicke",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/05/2022-16:27:36",
                    "content": "We work with landowners to employ field-tested stewardship practices that improve soil fertility and crop yield without the use of any artificial inputs: zero fertilizers, zero pesticides, zero herbicides! This regenerative carbon farming process improves all surrounding ecosystems over time, and we can achieve this at a profit (by selling Carbon Credits or Proofs of Impact) – while allowing the farmer/landowner to keep 100% of any crop harvest, restoring local economies and food security. Our goal is to restore soil fertility and aquifer levels on a global scale by incubating local farm-based economies built around the principles of restorative hydrology, regenerative organic farming, agri-solar, and permaculture. By teaching communities to cultivate healthy soils and align with natural carbon & water cycles, we empower them to become self- sufficient and eventually become net exporters of abundant harvests of natural products while simultaneously restoring health to local ecosystems and economies. Each local farm-based economy then becomes a node in a global network of interdependent earth stewards, learning from and inspiring each other. They can produce Proof of Impact via Carbon Credits or verified improvements to local biodiversity, water table/cycle restoration, and overall ecosystem health. There are a myriad co-benefits from our methods which would be ideal to measure, quantify, and verify. We have experience managing international agri-solar projects, however we require funding and guidance on bringing our knowledge into web3 tools and integrating our projects into a cohesive global community. We have partners developing various tools, however we are still searching for the right blockchain/DAG and community. We don’t want to own the network, we simply want to initiate and cultivate it. Our goal is to shift 1 billion acres back to regenerative by 2030, so we will need the scalability that web3 offers while leveraging the schelling point you have created. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.562142857142857
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/llllvvuu",
                    "index": "#3",
                    "likes": "1",
                    "time": "05/05/2022-19:04:20",
                    "content": "Not a proposal, but I had some quick ideas on this topic a while back, if anyone finds it helpful (comments enabled): notion.so/llllvvuu/Digital-Impact-Certificates-efe24dedbf784279aec2bb0c5510fa8b ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/upper-left-k",
                    "index": "#4",
                    "likes": "0",
                    "time": "06/05/2022-01:30:12",
                    "content": "Yes! I have been poking around GitcoinDao just to have this conversation. I don’t know the tech side but I have over a decade of real world experience with international manufacturing.   2 biggest impact points:    Living wage proving adherence to any number of 3rd party inspected environmental standards such as ISO:14001    How we get there:    Build a Fair wage index oracle in cooperation with a non profit doing the work to quantify it by country/ region. Build a 3rd party inspection certificate oracle to house inspection documentation Connect the consumer-> brand-> factory-> worker via smart contract purchase Use this smart contract to fractionalize Fair Wage payments so that the brand is guaranteeing the customer that the product they are buying was produced at Fair Wage payment levels. Use this smart contract to confirm inspections are done and up to date WAGMI reaches workers worldwide    Keeping it short but could give a whole talk to explain where Fair Trade programs fail and why at this point in time fractionalizing Fair Wage payments at the factory level is key. Also could make a very strong case that all of the “let’s reinvent fashion or Consumer packaged goods with web3” will never be game changers without something like this as the foundation. From this basic architecture you can add on concepts like production efficiency through presale, design efficiency, material sourcing efficiency, material safety, carbon offsets, circular economy, right to repair etc.  *not yet a member of GitcoinDAO but applied. Saw the proposal request on the discord server. Can be reached karen@astorandorion.com With tech support/ funding 100% could do a use case/proof of concept project.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.069501133786847
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jimbo530",
                    "index": "#5",
                    "likes": "1",
                    "time": "06/05/2022-13:32:17",
                    "content": "I volunteer with a 501c3 public charity that uses crypto to pay people for doing environmental tasks, The EverGreenCoin Foundation, we have made large impacts on a great many lives with the downstream effects of our program and are interested in improving and expanding our efforts, receiving any form of recognized certifications would be great for us but i am not sure how to help you reach the goal of creating them. I would like to request some help to increase our positive impact though. To start i imagine you will want some basic information about EGC currency, The 501c3 foundation The EverGreenCoin Foundation and my personal efforts that also utilize the EverGreenCoin currency. EverGreenCoin currency launched end of 2015 as Proof of Work, after a decentralized supply was established it shifted to Proof of Stake. The 501c3 public charity The EverGreenCoin Foundation was incorporated in 2017, the program we call Proof of Environment that has become a large part of what we do was launched in 2019. PoE allows any one any where to turn in photos of environmental works they do and claim EGC for their efforts and helped us structure our ongoing environmental bounty in a sustainable way. 2021 the sole proprietorship simple solutions with Jim was founded with the intent of rewarding CO2 sequestration and finding funding to create market structure that will extract value from global market fluctuations to support the value of the EverGreenCoin currency. This would mean the charity can reduce its dependence on grants and donations as well as provide value to the CO2 sequestration bounties i personally pay. With some basic info out there lets touch on impact we have already made as proof of function of the program. Before PoE launched we had several successful fund raisers, tree plant bounties and other projects that where kind of all over the place. Almost immediately after PoE launched we had a group called Falu Productions led by a man named Lyama take advantage of the program to raise enough money to afford a more dependable internet connection and other needed supplies, he then used that internet connection to reach a larger number of donors and built a permicuture school in the refugee camp he lives in, the school has been in operation for years at this point changing many lives.  We do not claim all of Lyama’s success as our own but are proud to be able to give him the small step up he needed to start his works, more recently i had a friend contract malaria and he was able to sell his EGC to pay for medical treatment, he stays active in his community helping many schools, churches and other community members so his continued health is a boon to his community and all of humanity, we are happy we helped him how we could. Many many projects have done between then and now and is hard to remember or mention them all now but direct and downstream impact of our efforts has been substantial. What we need is support and participation. If you have no money you can participate in PoE and claim EGC to help. US tax payers can make tax deductible donations to The EverGreenCoin Foundation or volunteer time just like any other traditional public charity. You can also buy EGC from people earning it doing environmental works in peer to peer transactions if you want to meet the community and be more involved.  You can buy and trade EGC on exchanges to help support market building or, you can help build liquidity pools attached to automated market makers against diversified assets to help extract market value from fluctuating global markets while building your personal crypto savings. If you do decide to send me (simple solutions with Jim) funding it would be utilized in this last way with the exception it will be locked in an account no one has keys to so there is an ever growing coin sink for EGC and its paired asset. This is where collaboration between crypto projects has a lot of potential, Simple solutions with Jim is in the XPRIZE carbon capture contest and the majority of any grant funding we win would be used to lock liquidity into EGC and that means buying and locking other assets into liquidity as well, a lot of how we would structure these investments is undecided but any crypto community that participates in helping us win would be included in our decision making and with a $50,000,000 grand prize we can show many deserving projects much needed support, this alone could also be largely impactful in many ways. I hope to get several thousand dollars worth of several assets into EGC liquidity, you can help do this yourself or entrust me to do it. I did create the account with lost keys mcbrn on XBTS and have already locked 1,000,000 liquidity tokens for each BTC, STH, LTC and XAUT as well as put a large portion of my personal savings into EGC liquidity i do maintain access to. In a sense i see EverGreenCoin as a generic fungible impact certificate because most everyone who has EGC has either done good works or bought them from someone else doing good works. I am happy to answer any question. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.177156458406459
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/exeunt",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/05/2022-13:18:38",
                    "content": "genreFund operates under the assumption that crypto should identify and support those elements in society that share its core ethos, not just its tech. Our small team has identified genre, as it functions in the written and visual arts, as a veritable platonic ideal of the DAO: decentralized, open source, permissionless, forkable, the genre as distributed creative community model has conventionalized some of crypto’s most radical practices to the point where they are taken for granted. Structurally, these informal communities have an antifragile relationship with the broader art and writing world: conflict and forking in a genre community make the creative world more robust and powerful. genreFund hopes to accomplish two goals: take on the challenge of supporting genres as peers in pluralism and open source; borrow from and experiment with the organizational form of genre as an experimental challenge. The goals depend on each other, as the challenge of supporting an informal community with no institutional face will require some creative organizational design. genreFund thus has a parent DAO sub DAO structure, where the parent DAO supples DAO tools, marketing and directional coherence to a landscape of genre-aligned impact DAOs. Within this context, the funds make the genreFund DAO antifragile, as internal disputes, when resolved, improve the polyvocal aptitude of the subDAO and, when irresolvable, result in forks which enrich the diversity and effectiveness of the whole project. Polyvocality means that the informal creative communities are approached and supported as clouds of goal-aligned creators rather than institutions with centers (an internally plural conception of what the genre is is a MUST). Multifaceted avenues of support would include artist basic income fellowships, archival projects, emergency support funds for organizations (“save City Lights Books!”) and viral special projects to increase enthusiasm for fundraising. The process of investigating and funding the community in its full multidimensionality should never be complete – the genre that can be named is not the true genre. The principle fundraising mechanism for each subDAO was long thought to be impact NFTs, creatively marketed as (in our prior formulation) “proof of philanthropy” as well as “community allegiance tokens” (build your stack, show off your interests) and of course, objects of speculation. In short, our strategy is conceptually resonant with the proof of impact certificate, but missing an edge of legitimacy. Genre-affiliation is an already compelling case for buying our impact NFTs; impact verification levels it up. (And vice versa: other spheres might leverage positive sum competition between sub-sectors of impact projects, making gamified personal preference an additional selling point for certificates). A potential con of this application is that many of the support vectors may be challenging to independently verify, as they are by design institutionally marginal. Solutions to this in the context of genreFund, however, will be solutions to the proof of impact certificate at large. Due diligence: Two person team, no technical, execution still at level of concept. Resources needed: Funding in the region of 5ETH (to go towards bootstrapping NFT sale). Engineers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.940462662337662
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/hrobertcolvin",
                    "index": "#7",
                    "likes": "2",
                    "time": "09/05/2022-02:25:11",
                    "content": "Impact Certification Concept: Greenpilling the Sustainable Development Goals tl;dr - We need to ensure the Impact Certificate aligns with the Sustainable Development Goals’ (SDG) impact framework, so we can access large sources of capital (from commercial to philanthropic donations) and promote go-to-market To start, we should establish a basic set of Impact Certification criteria that can be easily submitted (established through APIs, on-chain data, and / or a basic diligence questionnaire); ImpactDAOs meeting these criteria receive a DID, and their progress on creating impact can be displayed through a simple dashboard on a dApp Units of impact (e.g., carbon credits) can be issued as NFTs and market demand for these can be generated among crypto and SDG investors (institutional and retail) Impact Certification should be governed through flexible, neutral decision-making bodies; this could be done through ~17 sub-DAOs (based on number of SDGs), with voting power inversely correlated to an investor’s return expectations (philanthropic donations have lowest dilution and strongest voting power, followed by concessional, and profit / yield-maximizing) Let’s work together for a month or so to build out all of these ideas, figure out what we should keep and throw out, and put together a fleshed-out concept that we can take forward --------  tl;dr end  -------- Objective: the objective of this proposal is to outline the approach to develop an Impact Certification concept note. See Google Doc below for the unabridged version of this proposal:   docs.google.com    Impact Certificate Proposal - SDGs Impact Certification Concept: Greenpilling the Sustainable Development Goals  tl;dr -  We need to ensure the Impact Certificate aligns with the Sustainable Development Goals’ (SDG) impact framework, so we can access large sources of capital (from...      Proposed Activities Phase 1 of this study should focus on fleshing out the ‘Design Implications’ and starting to put up the scaffolding for a successful Impact Certification program. To do this, I propose the following analytical activities below: 1. Map the SDGs to currently available on-chain data The objective of this activity is to determine the extent to which on-chain data (e.g., carbon credits) can be mapped to the SDG’s prescribed impact metrics. Since the majority of SDG impact metrics will not be a 1:1 match with on-chain data, this analysis will also explore other approaches to approximate impact. For example, we could explore the feasibility of using on-chain financial transaction data to determine increase in economic activity (and decline in poverty rates). 2. Propose 2-3 strawman governance frameworks / funding modalities for the Impact Certification The objective of this activity is to explore how individual and collective incentives for ImpactDAOs, investors, contributors, and others can be positively shaped. A wide range of mechanisms, such as retroactive public funding, staking, and NFTs, will be considered and assembled into potential governance structures. This analysis will draw on existing literature regarding DAO governance and consider ‘best practices’ from successful comparator DAOs. 3. Generate a series of ‘minimum viable criteria’ options for the Impact Certification The goal of this activity will be to generate a series of criteria that ImpactDAOs will have to meet in order to obtain the first level of impact certification. This analysis will take into consideration the trade-offs of including certain criteria, while ensuring that the initial burden for ImpactDAOs is minimal but meets the standards / intentions of the Impact Certification. 4. Create a high-level roadmap of what could come next Ultimately, this rapid study will only be useful if it leads to action and concrete results. As such, I will outline what additional steps need to be taken during Phase 2 to flesh out key conclusions and validate assumptions. A critical part of this will be getting initial feedback from potential users (ImpactDAOs, crypto native investors, SDG investors, etc.). Output: research, analysis, and recommendations can be summarized in a 20-30 slide Timeline and Budget This study will be conducted and finalized over the course of a month, with Robert performing the majority of the work during free evenings and weekends. The proposed budget is $2,800, with 50% of the payment due following submission of the first draft and the remaining 50% upon finalization of the report. See consultant profile and other detailed information in Google Doc ",
                    "links": [
                        "https://docs.google.com/document/d/1Dr3KJADXI1hltUVqNRS2o-amyKK2A0UsNrx5QLCXYs0/edit?usp=sharing",
                        "https://docs.google.com/document/d/1Dr3KJADXI1hltUVqNRS2o-amyKK2A0UsNrx5QLCXYs0/edit?usp=sharing",
                        "https://unstats.un.org/sdgs/indicators/Global%20Indicator%20Framework%20after%202022%20refinement_Eng.pdf"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.549839917027417
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tayken",
                    "index": "#8",
                    "likes": "1",
                    "time": "10/05/2022-00:15:14",
                    "content": "@hrobertcolvin digging the idea of greenpilling the SDGs. We work with the UN and a number of SDG-focused orgs (mostly on #4 and #8). Would be excited to support if/as needed. More here: The Learning Economy Foundation's Decade Resolution: Solve SDG 4 & 8 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.34375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/hrobertcolvin",
                    "index": "#9",
                    "likes": "0",
                    "time": "10/05/2022-03:34:36",
                    "content": "Very cool, will definitely have to dig further on this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.758333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/T0admomo",
                    "index": "#10",
                    "likes": "0",
                    "time": "12/05/2022-20:44:56",
                    "content": "Who We Are Athena Protocol is building a suite of tools for bridging the gap between the real world and the blockchain. We work to bring transparency, accountability and accessibility to environmental and social governance through a two pronged approach.  Data Collection Process Design  IOT mesh networks Edge computation infrastructure   Smart Contracted Algorithmic Consensus  Privacy preserving data C2d (Compute to Data). User owned data governance.    Our work will help open the flood gates on data silos in environmental and social governance while creating accessible, repeatable, and equitable solutions for verifying real world observations that prove sustainable and regenerative action. We partner with Impact NFTs, game developers, certified offset marketplaces, NGOs, activists and land stewards to facilitate the secure, equitable and verifiable flows of data from the real world to decentralized ledgers. Who We Serve The best way to illustrate how our work creates value for the entire Web3 and Refi Ecosystem in a diverse number of ways is to talk about our partnerships. We have a major role to play with growing number of projects and organizations of which the following are just a few examples. OPADES: Deploy IOT mesh network and edge computation deployment for early wildfire detection, parametric insurance, and ReFi MRV. BasinDao: Deploy IOT mesh network and edge computation deployment for water quality and aquifer recharge, biodiversity, and wetland habitat extension. Open Forest Protocol: Develop tools, models, and smart contracts to facilitate consensus driven validation of OFP assets. Pozzle Planet: Design, develop and implement positive sustainable action validation protocols. Orgo: Curate verifiable data verticals to back in game Impact NFT  assets. Ocean Protocol: Develop tools for verifiable claims / credentials and algorithmic consensus contracts. Increase accountability and transparency in web3 data markets. FOAM: Develop solutions for IOT interaction with EVM compatible smart contracts. Field test proof of location zones with Lora. Impact Certificates: What is described in the OP as “Impact Certificate” sounds a lot like how we see our data backed NFTs. Our verifiable data sources are minted into IP preserving smart contract using ocean protocol. DataToken are then used to facilitate access to the underlying data and generate revenue for the data providers, curators, and validators. These DataToken also facilitate the governance over the process and procedures that keep the data credible. Our Impact Certificates are tied directly to the data required sign verifiable claims about real world observations relating to the projects and initiatives they are intended to support. The intended contract design will pool  DataToken and other digital assets in order to power algorithmic consensus contracts, while also mining liquidity. Additional Points  We use and support the development of open standards in data and sustainability. We are a multi-chain protocol to facilitate interoperability impact related projects.  Funding for:  Infrastructure  Engineering Lab & Production Facility for scalable and sustainable MRV / edge computation solutions.   Recruit  A core team of domain experts to aid in responsible data collection process design and proto    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.555088219860948
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/OrBlob",
                    "index": "#11",
                    "likes": "3",
                    "time": "13/05/2022-08:04:41",
                    "content": "Hi folks, My name is Or (@realblob), I work in impact management and measurement. I lead a community of SDG stakeholders and professionals and I work with startups to help them align their KPIs with impact KPIs, indicators, and frameworks. Our proposal is to align impact metrics and values with monetary values and streamline their incorporation into transactions through an “Impact Oracle”. I posted about Impact Oracle also on the Proof of Impact proposal thread, but I’m going to appeal to a different aspect of this topic in this proposal. Please check out our proposal on the other page as well if you’re interested. About Impact Certificates Impact certificates that currently exist (e.g., fair trade, rainforest alliance, etc.) are good tools for marketing. Meaning, that usually they’re used to promote how “ethical” or “fair” a product is. Most companies do whatever needs to be done, or pay whatever necessary price they must for certification, and show the certification to consumers as part of their branding and marketing. This marketing approach works. But more often than not, it turns impact into a luxury. Because the providers of the good or service are paying for said certification, they charge higher premiums. This turns impact into a category that is inaccessible to most - or stated otherwise, being responsible means you have to be above middle class, with more disposable income. And being a responsible or impactful business means higher costs to your operations. Impact for everyone The difficulty with certificates (NFTs or others) is that we are at the whims of philanthropists or the middle class/upper-class market. Certification is rigid and is done post-fact while lacking due diligence much of the time. Too often metrics are static, unchanging, and cant evolve with the pace of change. This creates a race to the bottom of what is the minimum that has to be done to gain certification. We want to create a system that incentivizes companies to do the maximum by aligning their maximization of profits with the maximization of impact. More impact = more profit – built-in and streamlined instead of added on to reporting and measurements. Impact Oracle (IO) is a price oracle for impact that draws on market values and stakeholder consensus. Instead of creating a rigid top-down accounting for impact, we decentralize the process and allow the price of impact to reflect its actual value in monetary terms. IO maintains a registry of the value of impact, as a flexible, ad-hoc, community-sourced metric. Constantly evolving, living, and changing with the needs and values of the ecosystem. Just as prices of commodities and assets change with market demands, so must impact. Using this pricing, IO compensates for positive impact and offsets negative impact. By creating a price for every type of impact we create a new metric for businesses to measure against. By making this metric monetary, we create a new potential revenue stream and incentivize a race to the top: More impact = more profit. This creates transparency, impact, alignment, and transformation of the economic incentives in our economy like never before. IO creates a system in which verification of impact is an all-in-one process. Any organization, DAO or otherwise, can streamline their impact accounting, getting compensation for positive impact and offsetting their negative. Certification through transparency Instead of creating a system of certification that happens retroactively, companies that connect to IO and transact through it create a live picture of their impact. By fully accounting for a product’s impact, certification becomes a by-product of impact price transparency. If a product is regenerative, it will be more affordable, if a product is less sustainable, it will be offset through its pricing. We envision a world in which certification is unnecessary because it is “backend”. Just as we don’t think twice about our foods if they contain dangerous materials, we shouldn’t think twice about the impact of products. Impact accounting and certification should be as invisible to us as risk assessment is when we buy a product. It’s already incorporated into the price of our goods and services. What we’re looking for: We are currently building the tokenomics and governance system and building partnerships with relevant stakeholders to supply capital and professional resources. This should be a cross-chain endeavor and we would like for it to be built for Ethereum as well as other blockchains. A full version of the lite paper is available and we’d be happy to share it upon request. Any of the following would be of massive help:  35K USDC for an MVP of the Oracle Professional and tech support from the ICC community Community-building support for the IO DAO through Gitcoin and others  (This proposal is similar to a proposal in the the “Proof of Impact” thread - if one is accepted, we will rescind the other) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.925172780435939
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/hrobertcolvin",
                    "index": "#12",
                    "likes": "1",
                    "time": "16/05/2022-19:58:24",
                    "content": "Enjoyed reading this - love the idea of an impact oracle! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.8125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/cyrusclarke",
                    "index": "#14",
                    "likes": "0",
                    "time": "18/05/2022-21:55:42",
                    "content": "Hey everyone, hey @owocki, I’m sharing an idea that I DM’d you about to leverage synthetic biology and web3 to help enable the idea of Impact Certificates. It aims to help solve the problem of making the certificates interesting/attractive in order to create a market for them, thus creating a virtuous cycle. About us: We are Grow Your Own Cloud (@_GYOC on Twitter) and we’ve been researching and developing DNA data storage in plants since 2018. We’ve won several international awards including from the UN and EU Starts Prize, presented our work at places like SXSW, Future of Everything, and Ars Electronica, and worked with companies including LVMH and Ginkgo Bioworks. Our mission is to transform data centres from carbon creators to carbon absorbers. We envision a future where conventional data farms are linked to data forests that could help regenerate the planet and store data efficiently for centuries. I’ve been keen to bring our work into the Blockchain/Web3 space as I have been a passionate advocate for the past 7 years. I invented a game called What The Block through which I’ve onboarded >1000 people to Blockchain through a game-based learning approach. Now I think we’ve found the right reason and medium to bring our work as GYOC into this space. We’re working on a project that links Web3 and Synthetic Biology to create what we call Web🌳. The Project is called Non-Fungible Plants (NFPs). NFPs: NFPs are literally plants-based NFTs. We store data in Plants via DNA data storage and genetic engineering processes that you may be familiar with such as CRISPR. This is something that works, we have done and we are about to launch this as a green, carbon absorbing complement to conventional NFTs. We have support from the biotech world - Ginkgo Bioworks, University of Washington and MIT. . and we are now immersed in the world of Web3 through Seed Club. The Idea: When an Impact certificate reaches maturity e.g. 40k Tons Carbon Removed from Atmosphere Impact Certificate; Signed by Gitcoin Governance, an impact certificate NFT is created. GYOC would also create an NFP - which is essentially a carbon absorbing and biodegradable NFT, as it is a plant. The NFT/NFP would go to auction to create a liquid market for the certificate. We are currently developing an immersive online platform called NFP.Garden, which we could use to offer a beautiful garden experience to celebrate the Impact Certificate going on sale. The auction winner(s) would receive ownership of the NFT and the NFP. The funds from the sale would go back into reinvestment on green activities and enhance R&D on green projects. We know that people in general love what we are doing with GYOC, and we think that an NFP sitting on a philanthropist’s desk is the perfect ‘Green Trophy’ for doing good. Regarding governance, we would love to work with Gitcoin and other established players to think through the exact mechanics. One mechanism that seems plausible would be a gated community of token (NFT) holders, where a random subset of holders are delegated to verify each particular claim (Condorcet Jury system) Making this a Reality: As mentioned this tech already works, we have the team in place and partners who would love to work on this. What remains to be done is building a link between the on-chain impact certificates and a physical plant-based twin that could serve as the ornamental green trophy. Based on previous work, I would estimate something between $70k - $100k should be sufficient to get going with a first proof-of-concept. We would hope to receive a grant towards that amount from this Gitcoin call. We would love inputs/advisory/contributions from people within the Gitcoin community, ReFi and public goods sphere to help work on this. For example on appropriate governance systems, and technology decisions. We want to build this collectively. I’ve kept this relatively high level idea for brevity. I’m happy to go into further details especially on the science. Our project is highly generative so hopefully it sparks other creative ideas for positive change. In general I’d love to discuss this further and see how our tech might empower the idea of impact certificates and make them the ultimate Green Flex. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.668728956228957
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nate",
                    "index": "#15",
                    "likes": "0",
                    "time": "21/05/2022-02:27:32",
                    "content": "Who we are SproutUp is the donation platform for web3 social entrepreneurs. Organizations and individuals will use SproutUp to mint good deeds into NFTs (impact certificates). Each donation pays for one NFT. How it works Initially, we have one type of impact certificate (IC). We call them Verified Unique Donations. Organizations create a unique video of each project outcome. E.g. they save a puppy and take a video. They mint each video into an ERC-721 NFT. On their donation page, they set an exact donation amount and specify the project outcome. E.g. $150 saves one puppy. Each donor receives one unique NFT (an IC) of the puppy they donated to rescue. There will be a different IC mechanism for projects with similar outcomes (e.g. planting trees). Certificate neutrality The market determines IC legitimacy. If donors want to donate X dollars for Y outcome, they will do so. If they have concerns about NFT uniqueness or quality, they won’t donate. There are no third-party validators that sign ICs into existence. Donors are the validators and they vote with their money. The organization selling ICs should have its reputation at stake. Not a third-party validator or governance network. External validation diffuses accountability and increases complexity. Validator incentives are often untransparent. And validators can get things wrong. Projects may of course show various forms of third party certification (e.g. testimonials) on their donation pages. But these are simply pieces of evidence. Not sign offs that bring an IC into existence. Liquid market IC buy pressure already exists: donors. Every donor now receives an NFT. NFTs can be resold, shown off, and unlock benefits in other dApps. If an NFT turns out to be fake or low quality, its resale value and any external benefits should evaporate. Again, the market determines NFT quality, not a governance board or token network. NFT uniqueness Verifying uniqueness is key. Organizations will try to double sell the same outcome. Imitators will plagiarize NFTs. At launch, the complete project outcome history (all NFTs) will be visible to donors. There will be a reporting system to catch duplicates. And a review system where donors comment on NFT / project outcome quality. We will add more systems to verify uniqueness as needed. Gitcoin integration Select SproutUp projects can be included in Gitcoin. This would be a pipeline of projects with proven outcomes (NFTs) and known impact per dollar. This is perfect for your EA focus. Team I am the team and the product speaks for itself. The initial build is 90% ready. Happy to demo. Request I’m requesting $10,000 to continue building and bring SproutUp to market. I have been building and iterating for two years with zero funding. Bonus Every SproutUp project has a sustainable business model from day one: create impact NFTs and sell for profit. No more fundraising. SproutUp web3 charities are not nonprofits. They use profit for good and can grow with investor capital. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.695402298850575
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/TiarnachEsq",
                    "index": "#16",
                    "likes": "0",
                    "time": "23/05/2022-11:35:44",
                    "content": "Impact certificates are central to BÚAN. We understand that effective communication is key to maximising value to society and perpetuating a strong underlying demand for expansion. The effective communication of quantitive information is a technical design challenge. The technical part is integral to legitimacy and the design aspect critical to making it valuable. We are first of all consulting ecologists and other experts to ensure that we are focused on the right metrics. We have also been dissecting all of the EU taxonomy guidelines for sustainable activities so our certificates can be moulded to fit within official environmental social governance frameworks. As for governance, an effective accountable approach which includes bringing experts such as ecologists, foresters and existing organisations into the fold has been very helpful in informing our approach so far. There is also a sense of perpetuating some much greater good by demonstrating to legacy organisations how they can avail of blockchain.  Screenshot 2022-05-16 at 16.54.032620×1304 276 KB  We are doing systems level thinking to ensure that our framework does not preclude us from including a whole range of valuable habitats in the future. We are starting with forestry as this is a well supported sector in Ireland and gives us a clearly quantifiable results. Afforestation of a greenfield site will lay the foundation for developing a holistic approach that will eventually include hedgerows, raised bogs and riparian vegetation in catchment areas. Pluralistic civilisation scale infrastructure has to be spoken in the language of economics. Ethereum is the greatest platform ever developed for creating new economic vehicles that work for humanity. Already we have found a strong demand for what we are creating from businesses. Central to our approach is the integrity of The BÚANeconomy that binds issuance and the minting of certificates to the underlying natural capital. Issuance is bound directly to the growth in biomass and diversity - a growth over time based bonding curve that rewards the holders of certificates. To ensure strong demand we are actively going to sell the certificates to businesses. The tokenomics underscore the scarcity of the underlying assets themselves so minting a certificate means locking tokens up and new ones are only issued in correspondence as more assets are added and they grow. We have found demand for what we are creating from businesses. There is an innate understanding of what we are doing and the benefits. Right now we are looking for funding to continue building with designers that can code what we have gathered from our work with universities and others. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.103939978939978
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#17",
                    "likes": "3",
                    "time": "23/05/2022-15:05:52",
                    "content": "just an update that we (myself + the PL team) have started reviewing the proposals above.  we will hopefully be back with some thinking about path forward in the coming weeks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tayken",
                    "index": "#18",
                    "likes": "0",
                    "time": "24/05/2022-22:43:33",
                    "content": "Good timing for this as I reluctantly soak in the WEF vibes this week in Davos. There’s a keen ear to web3 and a growing awareness that many/most SDGs are unlikely to be met by 2030. It’s a bit of a trojan horse approach, but could be a lever worth pushing on. Curious to hear @owocki thoughts… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/willprotein",
                    "index": "#19",
                    "likes": "0",
                    "time": "25/05/2022-00:55:25",
                    "content": "[Reposting our earlier proposal here, as it’s more relevant!] Protein is looking to build a web3 version of BCorp/MSCI to make it easier for ImpactDAOs to access funding, investment and other novel mechanisms to boost their impact. There is a need for impact investors and philanthropists to be able to synthesize due diligence, using the tools of web3 to escape the siloed and proprietary approach of legacy ESG initiatives. A token curated registry (TCR) of ImpactDAOs with their validated impact / traction scores would create a key ingredient in a composable ecosystem to improve the collective impact of the web3 world. Such registry is basically a curated list of impact DAOs, which enables discovery of impactDAOs for potential contributors, investors, funders. Each ImpactDAO receives an on-chain score from a validator, allowing for investment vehicles and other token mechanics / governance to be built on top. For example a tracker fund could invest in the 10 highest impact across all projects, or the 10 highest impact in solving the food crisis, or buy a crypto ETF based on the tokens of top DAOs across specific areas of impact (for retail investors). Alternatively, an active donor fund could use this list to adjust its recurring / streaming donation. Conversely, a certain score could be used for gating access to the list, e.g. on the Regen Stack for web3 orgs that want to address their impacts but are outside of their expertise: highly rated forestry might be recommended for offsetting, highly rated design for reuse featured for laptops equipment, etc. The impact rating can be kept honest due to 1) crypto economic incentives for evaluation / challenging scores and adding / removing DAOs from the registry, 2) robust governance system that would ensure legitimacy of the process. This grant would allow us to reach the goals of Stage 1:  Develop the scoring mechanism v1 - impact values that validators would be attesting to. These could range from internal policies and processes through to verifiable impacts. Design the incentive structure v1 required to ensure all eligible ImpactDAOs are scored and that their scores are an accurate reflection (this would include arbitration mechanisms). Validate the demand from potential investors (consumers of the curated list)  What we need  35,000 USDC Support from RatingsDAO / access to talent from ICC/Gitcoin network (e.g. for game theory and token engineering)  Once Stage 1 is completed, we’ll look for additional support to:  Prototype the investable TCR Build frontend for ease of navigation Train validators / evaluation agents to use our scoring mechanism Kickstart the ecosystem for decentralized validation of ImpactDAOs, incl. supplying it with the necessary liquidity  Who we are Protein Community is a community DAO, building out the Good Growth standard and cultural / regenerative accelerator. We’ve just released our pilot cohort, supporting and funding projects that ‘bring under-represented communities into the new economy’. We are currently evaluating our approach before our next “recelerator” which focuses on supporting projects and their regen stack. You can learn more about us on Twitter @protein     Proof Of Impact  [Proposals Wanted] 📜 Proposal Discussion       Hi guys!  Protein is looking to build a web3 version of BCorp/MSCI to make it easier for ImpactDAOs to access funding, investment and other novel mechanisms to boost their impact. There is a need for impact investors and philanthropists to be able to synthesize due diligence, using the tools of web3 to escape the siloed and proprietary approach of legacy ESG initiatives.  A token curated registry (TCR) of ImpactDAOs with their validated impact / traction scores would create a key ingredient in a…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.751539502164502
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Ahmed_Lelamo",
                    "index": "#20",
                    "likes": "1",
                    "time": "26/05/2022-01:29:07",
                    "content": "Hi everyone, my name is Ahmed  Lelamo, I work with Ethelo doing public digital decision-making engagements. I’ve taken the lead in our impact measurement efforts as we try to understand what kind of impact our technology is having on decision-makers. We’ve recently started a conversation with Ashoka (a global network of social entrepreneurs) practitioners who are very excited about the prospects of impact work in web3. About us: Ethelo Ethelo provides best-in-class engagement technology, coupled with expert services that make big decisions easy. We combine fairness and collective intelligence to unlock the answers to hard, contentious problems. Ethelo has worked with approximately 100k participants across 400 major decisions. More than 150 customers have used our platform including local governments, businesses, nonprofits, health agencies, universities, indigenous communities, housing associations, foundations, and the Canadian government. Ashoka Ashoka identifies and supports the world’s leading social entrepreneurs, learns from the patterns in their innovations, and mobilizes a global community that embraces these new frameworks to build an “everyone a changemaker world.” The Ashoka Fellow Network consists of a global network of 3,000 Fellows in over 72 countries. Ashoka’s process for qualifying fellows, and the strict criteria that are applied, have made its community synonymous with highly impactful, innovative strategies for social and environmental impact. Overview The process of creating impact certificates needs to be credibly neutral, transparent and inclusive. In collaboration with Ashoka, Ethelo will provide the consensus-building processes and technology and a wealth of expertise in impact assessment (through Ashoka’s practitioners) needed for a governance body to:   Collectively create an Impact Assessment Framework (IAF) that can align stakeholders around foundational impact assessment features such as methodology, criteria and metrics.   Ashoka impact specialists, along with interested community members, use the Ethelo platform to apply the Impact Assessment Framework and collectively assign Impact Certifications (unique NFTs) to qualifying projects.   Collectively create an Impact Assessment Framework What does “Impact” mean in the first place? How do we measure it? What are the criteria for Impact? Should some metrics or criteria be weighted differently? Should there be several Impact Categories with unique impact metrics? These are questions that should be answered by a broader set of stakeholders, not just the third-party organization tasked with adjudicating impact certification. Ethelo can provide the platform to engage a large number of stakeholders, including the impact makers themselves to build consensus around the most broadly supported Impact Assessment Framework. Ideally, we would invite all DAOs identified to be Impact DAOs and ask them to participate in the process of collectively shaping the Impact Assessment Framework. This engagement process can be a multi-stage process starting with Ideation where participants brainstorm on broad ideas about what “impact” means and culminating with a Prioritization stage where the details of the Impact Assessment Framework are voted on and the most broadly supported framework is selected. Involving the community of Impact DAOs from the beginning will go a long way to legitimize the Impact Assessment Framework and the certificates that result from it. The key to a successful engagement process culminating in a broadly supported Impact Assessment Framework is making sure that the questions posed during the Ideation process are open-ended enough to receive a wide variety of responses but also the process needs to be structured enough to facilitate the following Prioritization phase. To make sure these engagement goals are achieved, the Ethelo team can provide a wealth of experience configuring public engagement processes, while Ashoka practitioners can provide knowledge and insight about alternative impact assessment methodologies which can be used as content-prompts for participants to respond meaningfully. Ashoka’s impact framework Over the last 40 years, Ashoka has perfected its expertise in identifying and supporting social entrepreneurs with system changing ideas. We have learned to distinguish between four levels of impact: direct service, scaled direct service, system change and framework change and engage only with the last two. The vast majority of social impact initiatives tend to concentrate on addressing the symptoms of a problem by providing direct services to those it serves (i.e. a soup kitchen, planting trees). While these approaches will always be needed, alone they will never address the root causes at play. Systems change, meanwhile, changes the pattern of behavior in a given system (i.e. introducing “zero deforestation” policies; turning fishermen into algae farmers).  Untitled1600×975 119 KB  The highest level of impact is one where social entrepreneurs manage to change the mindsets that drive behavior (i.e. the civil rights movement; decentralization). By changing the way people see and understand the world, they create demand for new behaviors at all levels. Ashoka has developed a number of measures to track and evaluate systems change and framework change, which we’d love to adjust for Gitcoin’s Impact Assessment Framework. Collectively assign Impact Certifications Once the Impact Assessment Framework has been democratically created, along with all the impact sectors, criteria, metrics and whatever else the framework includes, it can be democratically implemented resulting in the assignment of Impact Certificates (in the form of unique NFTs) Impact makers will be asked to provide their claim of impact in detail, specific to the impact sector they are involved in. This information will be uploaded on the Ethelo platform for the governance body to review using a multi-criteria Impact Assessment Framework, resulting in a final Impact Score per individual impact claim. Here is a demo of a multi-criteria Ethelo Granting instance that could be repurposed for an Impact Evaluation process: https://granting.ethelo.net/ Reviewers involved in the governance/impact-verification process can be several different groups of stakeholders with different levels of influence over the Impact Score. Ethelo supports several levels of authentication that can allow different stakeholders to influence the final Impact Score differently. We could have several tiers of potential reviewers:  Independent Judges (provided by Ashoka) Gitcoin Stewards Gitcoin DAO members General DAO Community  Allowing a larger number of stakeholders in the review process ensures that the process is transparent and inclusive. The results of this collective assessment exercise will determine whether a particular project will receive an impact certificate. Again, all the details about the impact framework will be decided in the earlier engagement phase. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6138930683138
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/rkauf",
                    "index": "#21",
                    "likes": "4",
                    "time": "26/05/2022-14:03:31",
                    "content": " TL;DR: Digital Gaia is building the decentralized foundations for environmental impact measurement and certification:  Infrastructure for algorithmic, probabilistic and transparent forecasting and measurement of impact, based on decentralized science; Incentivized knowledge feeds to connect and reward the global communities of nature stewards, domain experts, and data scientists; An Impact Oracle that can back dynamic Proof of Impact NFTs.   Our thesis on Proof of Impact (PoI) Tokenized impact certificates must be far more legitimate than their legacy counterparts. Most proposals assume (implicitly or explicitly) such legitimacy can be derived from attestation by some trusted governance body, and, once issued, has a well-defined and immutable “face value”, i.e., some metric of success (ideally according to ex ante criteria). This is reflected in Vitalik’s own proposal of a Results Oracle for public goods funding. We believe this sort of model is insufficient for efficient externality pricing, particularly for natural impact, which involves a context-dependent, long-running interplay of global and local factors. In our proposal, the basic Web3 primitive is a dynamic, algorithmic assessment of an intervention’s impact. This judgment is achieved by an autonomous (AI) agent which integrates and weighs the available evidence and knowledge contributed by (a fully open and untrusted community of) humans, using commonly accepted principles of science and decision theory, such as Bayesian inference and free energy minimization. The source of its legitimacy is the scientific method itself - based not on authority, but on an evolving and transparent paper trail of inferences cross-validated against real-world data. These impact tokens, and the economy built on top of them, will generate ongoing incentives for communities to contribute further knowledge and create a commons of impact assessment know-how, eventually arbitraging away structural uncertainty, noise and disinformation, while gaining resilience due to the strong upside to contrarian views, whistleblowing etc. Finally, arbitrarily high-grade impact credits can be minted as derivatives (”99.99% certainty that 1 ton of CO2 was removed by this project”). It’s worth mentioning that this would also be the foundation for algorithmic impact investing, and therefore self-funded public goods.  About Digital Gaia  Our team and partner network combines expertise in both active inference and deep learning AI, data science, economics, community engagement, climate business, and collective intelligence. We are building: (1) the basic primitive mentioned above; (2) MVP contribution & engagement apps for nature stewards and scientists; (3) Python SDKs for data scientists. We have already built PoCs for a large portion of (1) and (2). We have completed a draft whitepaper describing our architecture and validated it with world leaders in AI, data science and collective intelligence.   Ask We’re raising $200,000 to complete MVP development over the next 3-6 months. ",
                    "links": [
                        "https://medium.com/ethereum-optimism/retroactive-public-goods-funding-33c9b7d00f0c",
                        "https://bit.ly/dg-twp"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.563244047619048
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/upper-left-k",
                    "index": "#22",
                    "likes": "2",
                    "time": "27/05/2022-14:54:23",
                    "content": "Like that you are talking about Oracles​:clap:. Been out of the loop with a lovely case of Covid but please loop back to me if you are looking for more team members. I am still interested in working on project! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.640625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/upper-left-k",
                    "index": "#23",
                    "likes": "1",
                    "time": "27/05/2022-15:17:25",
                    "content": "@owocki been out of loop for a bit here with Covid but officially on the mend. Wondering if someone from Gitcoindao can connect with me. I’m trying to figure out if my time is better used going for supporting role in the public goods discussion work stream or if I should just go ahead and try to get funding for my idea about using web3 tech to make Fair Trade more effective and transparent. (Could overlap well as a use case writhing the UN sustainability goals mapping) Either way my background in international manufacturing and fashion activism would bring more diversity to the work around public goods and would appreciate it if I could get pointed in the right direction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.667857142857143
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/hrobertcolvin",
                    "index": "#24",
                    "likes": "2",
                    "time": "28/05/2022-20:32:03",
                    "content": "My two cents: I think we’re at a fascinating inflection point in mainstreaming Web3.0, and the space could be ripe for disruption. Part of this has to do with the fact that, as you point out, we’re nowhere near close to achieving the SDGs. At the same time, though, that’s been known for a while now. I think a larger driver is that many ‘mainstream’ SDG folks have moved into prominent positions in the Web3.0 space. The SDG space is very technocratic and risk-averse; you need the ‘hundredth monkey effect’ to kick in to see increased uptake of Web3.0 solutions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.21875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#25",
                    "likes": "2",
                    "time": "06/06/2022-16:30:28",
                    "content": "    owocki:  just an update that we (myself + the PL team) have started reviewing the proposals above. we will hopefully be back with some thinking about path forward in the coming weeks.   still working on figuring out how to evaluate these.  i would expect an update sometime in june. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/upper-left-k",
                    "index": "#26",
                    "likes": "0",
                    "time": "10/06/2022-22:52:35",
                    "content": "Thank you. And yes can see it’s a bit bonkers with “all the things”. But want to emphasize that I have sincere interest in coordinating and understand that reimagining the Fair Trade system is going to take some patience. Maybe there’s a steward that can point me in the right direction? Or go thru Kernal and come back later? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.485714285714286
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#27",
                    "likes": "2",
                    "time": "14/06/2022-18:51:36",
                    "content": "Update: we have had our first proposal review committee meeting today!  progress, sorry for the stop & go pace so far folks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.854166666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/noahyeh",
                    "index": "#28",
                    "likes": "0",
                    "time": "11/07/2022-09:02:26",
                    "content": "Hi Kevin, I’m a little late to the party but hope you and your team still see this somehow. I’ve introduced our project to a couple of guys on the Gitcoin team at Funding The Commons New York a couple of weeks ago, and would love to get your thoughts here as well. A quick introduction of the idea, the NFT project is called Fox Of Utopias, we were inspired by the Ukraine airdrop announcement which incentivized 3x more donation amount and 9x more contributor counts a week after they first made their ETH address public. We’re trying to apply that process to various global causes selected by our community, hoping to start with Gitcoin Grants Round 15. To address the attributes you mentioned  NFT : The Fox PFP NFTs act as impact certificate to reward donors Governance : Holders of NFTs have a vote on which causes to support next, not with funding but with airdrops Buy pressure : The NFT project will still be an IP business, which would come with its own stories, content, merch and whatever attracts public attention, the more popular it gets the more incentives for donors to make a contribution Team : I built one of the leading music NFT marketplaces in Asia, founding partners are ex-Googler and award winning artist Gitcoin integration : Gitcoin rd15 donors are our intended first target for airdrops  We do a couple of things differently,   we find the task to fairly measure impact at scale extremely hard, Gitcoin can of course be neutral but probably not knowledgable enough in all areas that require measurements. Although fair measurement is still possible with a well designed government structure, it is a hefty task to kickstart momentum for impact certificate. Our solution is to simplify and focus on one variable, on-chain donations, which requires no human measurement, scalable and transparent we can just airdrop to them with no permission. This might not be the impact that you guys are looking for, but donations are still undeniably impacts, and the easiest place to start with.   We created a character and story for the NFT project. What we’ve learned from the PFP market is it’s almost always in some ways about self-expression, attaching oneself to a likable character that has a story to tell is more attractive than a certificate written in words, this also creates a desire to hold on secondary market.   To create buy pressure, we decided to leverage mainstream demand. One one side we do what other NFT projects do to create a strong community with storytelling and with IP building, on the other side because we chose high impact high net worth individuals to be our holders, we think we can create a focal point for other projects to provide WL to or utilities to our holders, as an acquisition strategy or as a charitable attempt to help the world.   All in all the higher the demand and price of these NFTs, the more incentives our potential target has to make donations, in that way we can help more causes reach their goals, while building a brand that does good. Would love to talk to you and answer your questions if any. Noah ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.175963438735178
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#29",
                    "likes": "5",
                    "time": "13/07/2022-16:35:19",
                    "content": "Hey everyone, Thanks for your submissions to this proposal process and for your patience as we evaluated them. As you know, the market has shifted around over the past few months. I have been preoccupied with the many implications that that has on the work we do here. So that accounts for part of the delay. The rest of the delay is accommodated by the fact that Gitcoin is currently in the early stages of forming a partnership with Protocols Labs, who runs the Funding the Commons conference series. You may have noticed that we recently did a podcast episode with them about the collaboration. Protocol Labs bring strong economic/ game theory/ design thinking to the table that we just did not have when we launched these RFPs. Checkout this talk from their recent conference to see what I mean. We have learned a lot from them in the last few months and leveled up our seriousness in solving these problems! We’ve read through each of the submissions and given private feedback to many of the top proposals. Through the last few months, we realized that many of these proposals bring something to the table, but none of them completely solved for what we wanted to solve for. And after getting in touch with PL, we ended up very excited about HyperCertificates. We would like to build a long term ecosystem where each composite part of this movement can contribute different components to a thriving interoperable ecosystem, but in the short term, we need to figure out how all these things fit together. The components  Gitcoin Grants Impact Certificates NFTs / HyperCertificates Impact Marketplaces Marketing Category Creation More???  As such, we have decided that the most prudent course of action will be to.  Reward the top 5 proposals with a stipend of $2k each, thanking them for their time & effort so far. We consider this a retrospective reward for the time spent pulling together these proposals, but more importantly the value generated through the discussion and questions raised by the community during this process that significantly accelerated our thinking on impact markets / hypercertificates. We hope that the funds are used to continue these efforts. Have a series of bi-weekly calls in which we attempt to achieve consensus about how the composite parts fit together. The end goal of these weekly series will be to define a set of interfaces that interoperate with each other. Once we have defined the interfaces, we will revisit funding individual proposals for different components.  The proposals that will receive a stipend now are  Digital Gaia (rkauf) Protein (willprotein) Ethelo/Ashoka (Ahmed_Lelamo) Impact Oracle (OrBlob) Crowdmuse  If you are on one of these teams, please send us an ETH address where we can pay you the stipend in the shared channel we created at the start of the collaboration.  If there is no shared channel, please email me kevin@gitcoin.co Even though this isn’t a grant big enough to implement the proposals, we hope that you’ll continue your work and push this forward together with us. Thanks again for your time and patience. Best, Kevin + the DAO Impact Team + Protocol Labs PS - pls join the telegram continuing the discussion here Telegram: Join Group Chat ",
                    "links": [
                        "https://www.youtube.com/watch?v=nSbSRaA2VNo&list=WL&index=2&t=2s",
                        "https://www.youtube.com/watch?v=2hOhOdCbBlU",
                        "https://gov.gitcoin.co/t/impactdao-category-creation-proposals-wanted/10500",
                        "https://t.me/+ORZ8joj8_AhjM2I5",
                        "https://gov.gitcoin.co/t/proof-of-impact-proposals-wanted/10179/11",
                        "https://gov.gitcoin.co/t/impactdao-category-creation-proposals-wanted/10500/12",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-26-2022/11134"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.728219696969697
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/noahyeh",
                    "index": "#30",
                    "likes": "1",
                    "time": "14/07/2022-19:47:54",
                    "content": "@owocki Hi Kevin hypercerts is brilliant, I believe this is to be an open standard we can build on top of? If we wish to do so, who would be the best way to push this forward? We also intend to work with Gitcoin Grants, which we hope to talk to Connor soon. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.4
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/CrowdFundedCures",
                    "index": "#31",
                    "likes": "0",
                    "time": "17/07/2022-11:27:53",
                    "content": "Hi folks - I’m a founder of Crowd Funded Cures (crowdfundedcures [dot] org), which is a DeSci crowdfunding platform (NZ charity aiming to launch as Impact DAO), that will issue Open Source Medical Prize NFTs / Hypercerts to create demand for clinical trial data (using Molecule’s IP-NFT platform) validating the safety and efficacy of “unmonopolisable therapies” (e.g. repurposing generic drugs as open source medicines such as generic ketamine to treat depression or fluvoxamine to treat covid). I conducted my Masters thesis on this problem back in 2014 and set up a NZ charity to implement the idea of flexible Medical Prizes to address it. This has evolved into the concept of Social Impact Bonds and now, with crypto, I believe the Impact Certificate or Hypercert framework fits well. Basically, you issue an Open Source Medical Prize NFT / Hypercert in a specific disease class, which represents a bounty that is split annually or paid specifically to a research group that publishes a clinical trial validating the safety and efficacy of an off-patent medicine or unmonopolisable therapy. We have a number of off-patent use cases, and reaching out to key stakeholders, e.g. am presenting to NHS Medicines Repurposing Steering Group on 26 July and have been in discussions with BARDA about backing a generic drug repurposing Advance Market Commitment / Pay-For-Success contract incentive of $50-100m. Also working PsyDAO on an Open Ketamine project to obtain FDA-approved generic (racemic) ketamine for treatment resistant depression, which has been shown to be more effective than the patented s-ketamine intranasal spray. As mentioned, above, another use case is FDA-approved generic fluvoxamine to treat Covid (like ivermectin but actually effective at only $10 a course, as shown in TOGETHER Phase 3 trial in Brazil and similar to patented molnupiravir that costs $700 a course). We are also trying to raise funds for a feasibility study with a management consulting firm (e.g. BCG, McKinsey, Guidehouse) to show that repurposing either of these drugs to get FDA-approval would be worth billions of dollars in  value for a relatively low cost ($5-10m Impact Certificates to de-risk optimal open source treatment protocol in Phase 2 clinical trials, then $50-100m PFS contract negotiated with government for Phase 3 clinical trials and regulatory approval). We have a front end dev and blockchain dev, but if any folks interested to contribute in a high impact DeSci project, please email savva [at] crowdfundedcures [dot] org or check our our Discord (link at bottom of website). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.386781609195403
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#32",
                    "likes": "1",
                    "time": "17/07/2022-16:53:57",
                    "content": "Scott Alexander (author of Meditations on Moloch) just created a great post on Impact Certificates => Impact Markets: The Annoying Details - EA Forum ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nate",
                    "index": "#33",
                    "likes": "1",
                    "time": "22/07/2022-20:01:29",
                    "content": "Thanks for sharing, my thoughts:  EA’s are primarily funders and view issues through a funder’s lens.  Hence it is no surprise that Scott and other EAs think of Impact Certificates as a funding/investment vehicle. While ICs could be used in this manner, this completely misses the primary way to use ICs. We should think of Impact Certificates as purchases, not investments. You can go to the store and buy a product. Or you can go to a charity and buy an impact certificate. An IC represents one verifiably unique outcome, e.g. one rescued puppy. There doesn’t need to be any reselling or financial ROI associated with the purchase. Paying to rescue a puppy (and own the associated IC) is valuable to a dog lover.  Nonprofit is no longer necessary or beneficial for charity.   The web3 public goods/charity space needs to unlearn the concept of nonprofit. I’ve seen too many proposed web3 public goods/charity funding mechanisms bend into pretzels to add investment dynamics to a nonprofit. It’s unnecessary. If you want a way to invest in these organizations, there is a dead simple solution: make them businesses and then invest in them like any other business. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5390625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/llllvvuu",
                    "index": "#34",
                    "likes": "1",
                    "time": "21/08/2022-01:25:06",
                    "content": "    nate:  We should think of Impact Certificates as purchases, not investments.   +1; this is an avoidable cultural mistake that could be learned from the broader NFT community. My view is a bit more nuanced - IMO we need to tread the fine line of sometimes investing in ICs and sometimes purchasing ICs. Both ICs and NFTs in general recognize in theory that both speculators and final purchasers are necessary for a long-term healthy ecosystem. However, the broader NFT community arguably didn’t give enough love to the latter, and so is up until now largely Ponzi. While “Ponzi for good” is arguably productive, we could probably do even better. One thing about making these more attractive for final purchasers: although the media/community/status/etc should be compelling, this ideally shouldn’t require significant amounts of skillful labor on behalf of every organization hoping to raise money (I’ve spoken to at least one org that’s noted “but we don’t want to manage a community” - and wasteful donor engagement is already a pain point of trad nonprofits). Of course, one approach to “final purchasers” is to have them picked out in advance and flush with cash (a luxury that happily, some orgs have). Other than that these social planners should be decentralized, we must also ask whether it makes sense from a specialization standpoint to separate the “initial purchasers” from the “final purchasers” (it seems likely both would require similar skillsets - and a lot of coordination/iteration can be achieved by having the same people do the initial action and the retro, as “agile teams” do). Finally, I believe the following “anti-prize” pieces are worth us prize-proponents reading (for the purpose of steelmanning our own approaches): https ://itif.org/publications/2020/02/03/delinkage-debunked-why-replacing-patents-prizes-drug-development-wont-work/ https ://news.ycombinator.com/item?id=31217851 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1478174603174605
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/llllvvuu",
                    "index": "#35",
                    "likes": "4",
                    "time": "26/08/2022-17:30:58",
                    "content": "A follow-up: I just came across this extension: Lit Token Access. I think it’d be cool for Gitcoin and/or impact certificates to collab with some e-commerce stores. For example, we could have Gold Sponsor, Silver Sponsor, Bronze Sponsor for contributing to the matching pool; Gold Voter, Silver Voter, and Bronze Voter for contributing to a project; Gold Seer, Silver Seer, Bronze Seer retroactively for contributing to a project that the community in hindsight voted to turn out highly impactful. Then partner stores could have different discount tiers (see this Vitalik post). Is it still “mathematically optimal” at this point? Probably not. But the increased volume seems worth it. I think we’ll continue to see really cool integrations of NFT/POAPs with Web2 services for “utility” (the Twitter hexagon was another good one, and it sounds like Instagram is making a play as well). For Grants 2.0 we could make it a core part of the stack to provide the tools & the network for any community to promo and build a viral campaign around their round. So we open-source not only an FDD stack but also an MMM stack. ",
                    "links": [
                        "https://vitalik.ca/general/2017/03/11/a_note_on_charity.html",
                        "https://gov.gitcoin.co/t/the-grants-2-0-funding-stack-choose-your-own-algorithm/10770",
                        "https://gov.gitcoin.co/t/workstream-suggestion-mmm-merch-memes-marketing-for-public-goods-gitcoin-gitcoindao/7066"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9222222222222225
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nate",
                    "index": "#36",
                    "likes": "0",
                    "time": "28/08/2022-21:46:12",
                    "content": "    llllvvuu:  we need to tread the fine line of sometimes investing in ICs and sometimes purchasing ICs   Yes, there will be both use cases. I just wanted to push back on the investment tunnel vision.     llllvvuu:  Of course, one approach to “final purchasers” is to have them picked out in advance and flush with cash (a luxury that happily, some orgs have). Other than that these social planners should be decentralized, we must also ask whether it makes sense from a specialization standpoint to separate the “initial purchasers” from the “final purchasers” (it seems likely both would require similar skillsets - and a lot of coordination/iteration can be achieved by having the same people do the initial action and the retro, as “agile teams” do).   Impact certificates are like donation receipts but 100x better. We don’t need to coax people to buy them. People already donate. Now they will donate and get the associated impact certificate. Impact certificates improve the donor experience. The need to create a liquid market for impact certificates is unnecessary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5703125
                }
            ]
        }
    ],
    "group_index": "85"
}