{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/the-new-grants-protocol-flywheel/11769",
            "title": "The New Grants Protocol Flywheel ",
            "index": 11769,
            "category": [
                "\\xf0\\x9f\\x8c\\xb1 Grants"
            ],
            "tags": [
                "contributors",
                "stewards",
                "Grants2",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "17",
                    "time": "27/10/2022-22:34:06",
                    "content": "The new grants protocol will launch over the next 2-6 months in staged beta & alpha launches. Once this publicly available infrastructure is released, the responsibilities of Gitcoin will change. This post is designed to think through the critical activities of the DAO after the launch. A clear view of a desired future state can help us align our efforts before and during the launch. Here are a few key questions which must be answered to understand the flywheel which will drive us to our goal of helping communities to fund their shared needs.  What does grants protocol provide which other funding mechanisms do not? What is the flywheel that will support maintenance and improvements for the grants infrastructure? How might we accelerate the pace at which we approach our optimally allocated capital future?   The High Level Flywheel Getting more communities onboard is the one thing we can control right now.  Now how can we increase the speed of this flywheel? Here are the levers I have identified.  More Communities Increasing the total number of communities using the grants protocol to fund their shared needs. By extension, this increases the number of voters & users on the protocol.  Service Sales Partnership Marketing Systems Integrations   Shared Learning & Tools Empowering and enhancing the community to interact with the grants software, run grants rounds, and continuously iterate on their funding stack using learnings from the ecosystem.  Developer Relations  Forking the Protocol  Decentralized storage Smart contracts   Forking the User Interface  Grant Explorer Grant Hub Passport, Round Manager   Building Modules to Integrate  Sybil Resistance & Identity Scaling Grant Eligibility Reviews Dispute & Appeals Judgment Payout Calculation & Release     Open Data Community  Data Infrastructure  Accessibility Reproducibility App Composability   Data Analysis  Fund Distribution Preventative Sybil Defense Reactive Sybil Mitigation Grant Eligibility Reviewer Trust     Directed Research & Development  Scoring Model Efficacy  Sybil detection Trust Bonus Personhood Score Grant Eligibility Reviewer Trust Rating Community Trust Rating   Mechanism Design  GTC Utility Ecosystem Sustainability Funding mechanisms   Community Direction  Identify High Potential Experiments  Scoring Model Efficacy Research Mechanism Design Research Prioritized Analysis Backlogs Prioritized Development Backlogs         Better Capital Allocation Actively increasing the rate at which we move towards our goal state.  Communications  Round Owners Matching Pool Funders Grantees Voters DevRel DataRel DAO contributors   Protocol Maintenance Product Maintenance Key Module Building & Maintenance   Legitimacy Verifiable and reproducible results. Being able to support high-resolution democratic decisions which more accurately reflect the desires of the communities which participate.  High Quality Partners Brand Positioning Impact Certificates   How do we create sustainability in the mechanism?  More Communities We know that more communities means more opportunities to upsell services.  441×632 16.9 KB  Now we must figure out how we can sustainably increase the number of communities. This can be done by using service revenue to pay for partnership marketing and systems integration support.  Now the question becomes, why would anyone want to do this before there are any customers? Upsells! Gitcoin should provide a basic level of service via it’s PGF stream. Either the PGF stream or a new entity could provide upsells including grant eligibility reviews, customized sybil defense and/or marketing help. Ideally, this becomes sustainably profitable such that a competitive market emerges where ROUND OWNERS solicit donations from MATCHING POOL FUNDERS and hire ROUND OPERATORS to facilitate the round’s execution.  Shared Learnings & Tools This area has the highest risk for failure and the most opportunity within our control. As public goods for the entire Gitcoin ecosystem, the shared learnings and tools must be funded by the DAO to start and eventually be sustained via mechanism design. The learnings and tools needed for communities to optimally allocate capitol must exist and be understood before this is no longer needed. Our product as Gitcoin DAO is NOT the grants protocol. Our product is the continuous improvement of a community’s ability to fund their shared needs! Until the day when you see a pothole and think, “That is weird… the government never messes up how they fund our shared needs”, there is still a need for Gitcoin. Now let’s dive into the sustainability of this function. As public goods funded by the DAO, we will need to see the token price increase to maintain the stability of this function. Here we can see that you can lower the supply of GTC or increase it’s utility to positively affect the price of the asset.   Increasing GTC Utility To increase the utility of GTC we will need to run experiments to understand which mechanisms people will use and how well they produce their intended effects. Identity staking, grant staking, and even betting on future impact are all potential use cases. To increase our odds of success, we can harness the community’s intelligence using crowdsourced analytics to drive research and development decisions. DevRel efforts will make it easier to access talent needed to build a backlog of modules decided to be the highest potential builds for increasing the utility of GTC while accomplishing their primary objective.  Decreasing GTC Supply A continually decreasing supply of GTC can be made sustainable by that grants rounds in the Gitcoin ecosystem pay back to the system. One way to do this is by creating a norm to include a grant in every grant round that is used to buy and burn GTC. Additionally, building modules which help a round operator to better allocate the costs as desired between voters, grantees, and matching fund donors could also increase the odds of success. This sustainable flywheel might look like this.   Better Capitol Allocation When we learn about a new permutation of the funding stack that works well, it will need to be communicated to the community at large. Continuously engaged stakeholder groups are crucial to our ability to do this.  Hub & Spoke Network Effect Our network effect will largely be built as a hub and spoke model. Think about the publications and authors on Medium. The advantage of being in the Gitcoin ecosystem is that you can benefit from the shared learnings which come from other rounds. Like Medium, our distribution introduces users of one community to other communities they might enjoy. It encourages the publications (communities) to better serve their readers (voters) and writers (grantees). They do this by continually refining their funding stack utilizing shared learnings and tools.  Ecosystem vs Community Participation We might think of the broader Gitcoin ecosystem to include anyone who is building on or forking the grants protocol. The Gitcoin community is likely to be defined more narrowly. I might suggest those who are willing to stake to be a part of it. Defining the Gitcoin community could be a great utility use case for GTC. Voters can stake GTC AND be asked to use it in a module that secures the system. Round owners can create burn grants to pay for their part of the public good services. Grantees can stake on their reputation!  Legitimacy This is the easiest one. It mostly comes as a by-product of the others. If more communities choose to share their learnings and tools to support the Gitcoin ecosystem, then capital will be allocated better for any community using gitcoin grants protocol.  Conclusion As Gitcoin moves towards our protocol launch, we need to think deeply about sustainability. We need to assess which levers have the highest impact. We need to get thoughts like these into the open to be discussed and debated. @Owocki has passed the torch to a decentralized group of regens. We need to continue to articulate our vision for it to manifest. PS. This is my take expanding on The Grants 2.0 Flywheel ♻️ ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-digest-40-s16-budget-requests-everscale-hackathon-and-the-fantom-alpha-round/11836",
                        "https://gov.gitcoin.co/t/november-csdo-digest/12338/13",
                        "https://gov.gitcoin.co/t/from-gitcoin-driven-to-community-driven/11875",
                        "https://gov.gitcoin.co/t/the-utility-of-gtc/10071/6",
                        "https://gov.gitcoin.co/t/the-utility-of-gtc/10071/7",
                        "https://gov.gitcoin.co/t/discussion-feedback-request-grants-protocol-alpha-round-eligibility/11873"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Community and engagement",
                        "Smart contract updates",
                        "Interoperability and Scaleability"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.809736043177601
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#2",
                    "likes": "3",
                    "time": "28/10/2022-02:36:27",
                    "content": "While I’d have suggestions about details, overall this kind of thinking and this direction seem like the sort of big systems thinking that we need to rally around our goals. This is the first post or strategic discussion about Gitcoin I’ve read (and I may have missed some!) that ties together:  data and dev rel service revenues GTC utility  As such IMO this post has the ingredients for a vision and a plan that both focuses Gitcoin on newer behaviors (technical community centric) and shows how these new approaches might lead to sustainability via revenues and increased GTC utility.  I hope everyone who reacts to the post keeps in mind the need for this sort of thinking and planning if we are to both fully achieve our essential intents and thrive while doing so.  I’m really looking forward to other responses and also to ideas about how to operationalize something along these lines. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.510847107438016
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Kydo",
                    "index": "#3",
                    "likes": "2",
                    "time": "30/10/2022-20:38:05",
                    "content": "Hey Joe, Great overall post laying out the Gitcoin 2.0 flywheel. I have a few questions:  Why focus on GTC price? Is it that we want more free cash flow for operation or to attract attention from the general crypto community? How does the DAO accrue value? Is Gitcoin going towards a service based DAO?      DisruptionJoe:  Our product as Gitcoin DAO is NOT the grants protocol. Our product is the continuous improvement of a community’s ability to fund their shared needs!    What is the projected revenue for Gitcoin 2.0 if we assume the metrics is the same? Another of asking this is: if we are operating under 2.0 model, what much cash would we have for operation? More or less?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0479166666666675
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tayken",
                    "index": "#4",
                    "likes": "1",
                    "time": "31/10/2022-21:27:33",
                    "content": "Thanks for this @DisruptionJoe! With regard to protocol forking and Systems Integrations, are there resources available beyond the typical GRs? I’m working on an aligned project, but will need capital to devote time/resources to prioritize an integration. Bit of a chicken/egg scenario as it always has been with public goods funding. Open to thoughts/ideas for helping the regen flywheel.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.483333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#5",
                    "likes": "2",
                    "time": "01/11/2022-16:56:25",
                    "content": "    Kydo:  Why focus on GTC price? Is it that we want more free cash flow for operation or to attract attention from the general crypto community?   To fund the DevRel, Open Data, and Operational Support needed to accelerate the pace at which we approach optimal capital allocation. Attracting more users could be helpful, but not the goal of this post.     Kydo:  How does the DAO accrue value? Is Gitcoin going towards a service based DAO?   This is an open question. I’ve tried to think it through here in a more grandiose long-term vision setting way. A model for Gitcoin sustainability I do think there is room for Gitcoin DAO to launch public good infrastructure and hold governance in those utilities. It could also spin out services like systems integration consultants, grant program optimization consultation, etc.     Kydo:  What is the projected revenue for Gitcoin 2.0 if we assume the metrics is the same? Another of asking this is: if we are operating under 2.0 model, what much cash would we have for operation? More or less?   This is like saying “what is the projected revenue for having clean air?”  It is a public good. The positive sum aspects of the protocol could create enough positive externalities to eventually put a metric together. Something like a positive externalities generated per $ invested/staked? I’m not sure how to answer that, however, I would bet on the Gitcoin team to understand their limitations, including runway, and innovate solutions. Thanks for engaging here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.169960474308301
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Kydo",
                    "index": "#6",
                    "likes": "2",
                    "time": "02/11/2022-02:57:40",
                    "content": "Hey Joe, thank you for the responses.     DisruptionJoe:  To fund the DevRel, Open Data, and Operational Support needed to accelerate the pace at which we approach optimal capital allocation. Attracting more users could be helpful, but not the goal of this post.   Just to clarify, the idea here is: GTC price goes up → treasury value increases → we can do things. If this is the case, I agree with the logic. I think we would also agree that this would not be the most optimal sort of capital allocation given its impact on token price.     DisruptionJoe:  This is an open question. I’ve tried to think it through here in a more grandiose long-term vision setting way. A model for Gitcoin sustainability   Thank you for referencing this and I will comment under that thread.     DisruptionJoe:  This is like saying “what is the projected revenue for having clean air?”   I agree with this statement but my question is more on the side of operation, talent retention and etc. To sustainably develop, we need a way to continuously fund the amazing things we do. Whether that is through donations, contributions, membership fees, or other kinds of revenue, that is an open question. Do you know anywhere on this governance forum where people are actively discussing this issue? @kyle here as well. Thank you for your time, good sers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.420138888888889
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/maialepine",
                    "index": "#7",
                    "likes": "2",
                    "time": "02/11/2022-04:10:13",
                    "content": "I truly appreciate this whole breakdown in helping me better understand the critical thinking behind Gitcoin’s strategy. “Our product as Gitcoin DAO is NOT the grants protocol. Our product is the continuous improvement of a community’s ability to fund their shared needs!” <— very poignant.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#8",
                    "likes": "4",
                    "time": "02/11/2022-12:15:47",
                    "content": "    Kydo:  If this is the case, I agree with the logic. I think we would also agree that this would not be the most optimal sort of capital allocation given its impact on token price.   Perhaps, but I’m not sure what is more important than building the machine that builds the machine. Is there a more impactful way to invest capital? Of course this is all conjecture here, but maybe the contrarian bet here is that we can find more people interested in investing time and capital at a rate higher than the inflation of the token supply (which is 0). Bitcoin does it. Ethereum does it. How do we build Gitcoin as a hyperstructure?     Kydo:  I agree with this statement but my question is more on the side of operation, talent retention and etc. To sustainably develop, we need a way to continuously fund the amazing things we do. Whether that is through donations, contributions, membership fees, or other kinds of revenue, that is an open question.   I’m not sure where it is on the forum, but I do know this is a regular discussion I have at both the workstream and the leadership level. There is some amount of tension created in understanding these mechanisms. For example, if a workstream has service revenue, should that be used by the DAO as a whole or should the workstream spin out a service org in which Gitcoin has an ownership stake? Or should it be kept by the workstream? Here is an incredibly well articulated post covering describing the tension of a workstream with a clear mandate which realizes it is capable of more impact outside of its mandate, but within the DAOs overall purpose. [Cancelled/Superceded S14 Proposal] FDD Season 14 Budget Request - #50 by danlessa I hope this helps! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.255952380952381
                }
            ]
        }
    ],
    "group_index": "226"
}