{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gr-15-bug-or-feature/11522",
            "title": "GR 15 Bug or Feature? ",
            "index": 11522,
            "category": [
                "\\xf0\\x9f\\x8c\\xb1 Grants"
            ],
            "tags": [
                "Grants2",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/codingsh",
                    "index": "#1",
                    "likes": "2",
                    "time": "16/09/2022-22:16:59",
                    "content": "I’ve been facing some issues with my lease since the GR14 and now on the GR15 I can’t see the matching value to each dollar. My grants now for every 100 dollars I receive 1, is there any reason why the grants are like this? Is the quadratic distribution algorithm not working for all grants? I would like help from users and delegates holding gtc to understand what is happening with grants. Look →   Screenshot 2022-09-16 at 23.13.481920×719 88.3 KB  ref:   💰 Blockchain Developer | Opensource Developer | White Hat | Grants    💰 Blockchain Developer | Opensource Developer | White Hat | Grants The opensource funding challenge, I'm currently a full time bounty hunter and opensource contributor, yes I do what I love, but it comes at a cost I can't always get paid for the bountys I participate and the hackthons I win. This has great weight in...      ",
                    "links": [
                        "https://gitcoin.co/grants/646/gitcoinblockchain-developer-grant-codingsh"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "None",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.041666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#2",
                    "likes": "0",
                    "time": "18/09/2022-22:42:18",
                    "content": "Heya! Great question - in this case because you have donations from 4 contributors, the matching amount is going to be small and I suspect it is accurate. Gitcoin has grown quite a lot and some of the top grants now see thousands of contributors, which means that grants with less than 50 contributions dont get much matching. We have been getting feedback that some folks in our community wish we had more support for OSS, so in GR16 we may do a round just for OSS devs like yourself  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.114583333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/09/2022-01:38:47",
                    "content": "From my view, this could be correct. From the grant explorer, you can see the top grants with thousands of donors, which might impact the QF matching funds strongly. Comparing you have 4 contributors now, you could get 1/1000 or even less matching funds than the top grants. (Number of contributors matter than the funds) Here is a brief introduction and simulation for QF - https://wtfisqf.com/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2666666666666675
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/codingsh",
                    "index": "#4",
                    "likes": "0",
                    "time": "20/09/2022-12:02:07",
                    "content": "So the problem is that it is the second round in a row that I have a problem, and in the last round I met the requirements, because I worked for aurora and for polygon. however I was removed from the polygon and gitcoin pools. I’m a big believer in the project, but I’m really not happy with how things are working out. In the last round there was even a celebration of the funds that remained in the pool, but if they stayed it was because they were not distributed. I even thought I was attacked by spam but I was not notified. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                }
            ]
        }
    ],
    "group_index": "203"
}