{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/marketplace-project/3036",
            "title": "Marketplace project ",
            "index": 3036,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/K1du",
                    "index": "#1",
                    "likes": "4",
                    "time": "27/05/2021-12:14:40",
                    "content": "As far as i read about the project, I would like to create a marketplace,but my expertise on the code its poorly and I’m not able to do this by my own,nor fund it by myself. I was thinking if it would be possible to create a new project here. A marketplace that sells/resells products with fiat and with a crypto gateway payment system. Several niche categories that involve the crypto space in the traditional commerce as the NFT, not a dedicated marketplace for Nft’s as there are a bunch out there. We could propose a chart with the benefits to be spent to fund other projects on the quadratic lands, a 15 % of the monthly profits goes to the next voted project by the community, other on marketing and so on. The idea of a marketplace is good as we could do many things within it, the benefits could go on print on demand shirts for the community to promote more the quadratic lands or any kind of marketing implementation on this project. It’s just a small idea and I’m not even sure if I’m writing it in the proper place or section. But there’s a long time I would like to create one and with it, if we could help other better. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.502705627705628
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#2",
                    "likes": "2",
                    "time": "27/06/2021-15:39:38",
                    "content": "Hey! Looks like folks missed this with so many proposals coming through, I’m moving this over to the prototyping workstream discussion section. I’d definitely join the first call for moonshotcollective.space if you’re around! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.354166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/K1du",
                    "index": "#3",
                    "likes": "0",
                    "time": "28/06/2021-08:10:38",
                    "content": "I will take a look into it,for sure.Dont have much time tbh. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ],
    "group_index": "378"
}