{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/non-transferrable-governance-token-for-structured-workstreams-to-signal-contributor-interests/8985",
            "title": "Non-transferrable governance token for \"structured workstreams\" to signal contributor interests ",
            "index": 8985,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "9",
                    "time": "08/11/2021-14:53:46",
                    "content": "The CrossStream DAOops Governance (SDG) council is a group that votes on changes that will affect the infrastructure of all DAO workstreams. It does not have the authority of the stewards. It is an opt in group of workstreams choosing to collaboratively design the way DAO operations are executed. This group has representatives from all the workstreams. The current initiatives that are funded and governed by CSDG include: Discord Revamp, Oboarding Reviews, Onboarding Calls, Notion Revamp, Legal, and Accounting. I am interested in considering a proposal to create a governance token for all workstreams that choose to collaborate rather than defect from the decisions from this group. The goal is to ensure modularity and composability between the workstreams. It would work by rewarding all contributors who participate in any “structured” workstream 1 token each week. Then, a snapshot would be setup for the CSDG to poll contributors to govern these decisions directly rather than only a small group of workstream representatives being involved. Contributors would receive a max of one token per week even if participating in more than one stream. Due to the high level of confidence we would have in these being individual humans, it would allow us to use quadratic weighted voting on Snapshot. A few definitions: Structured workstream - A workstream choosing to abide by the guidance of CSDG Contributor - Any DAO contributor who has done work which would receive hourly, salary, or dReward payments for that weekly Epoch. Please discuss! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4520833333333325
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/11/2021-16:15:19",
                    "content": "Joe this is a great stab at a clear problem.  I think you clearly identify the issue when you describe the possibility of workstreams DEFECTING from the decisions of this group. We have multiple workstreams working hard for their own survival and success but is any workstream driving the Dao?  I felt the absence of big-picture leadership for a while now but didn’t know how to deal with it. I posit that the cohesiveness of the dao is our greatest priority.  Without it we might end up as five separate daos each with their own processes.  I don’t believe this is desirable but maybe it better fits into Ostrom’s principals. Super happy to see a group taking the helm of the dao.  Shocked to consider a group would act against the greater dao interests but clearly it can happen.  This suggestion by Joe will mitigate the negatives I have described. Thus I will support this proposal.  We need overall dao leadership and the ability of the leaders to actively give support and resources to those groups that support dao cohesiveness.  This is the first attempt I have seen to address the issue.  Thanks Joe. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.261458333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "1",
                    "time": "08/11/2021-16:25:22",
                    "content": "Thanks for your input. It is not a proposal at this point. Only a discussion that could influence a proposal. The way it is formed here, probably wouldn’t need the steward proposal, but only opt in from the groups that choose to participate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#4",
                    "likes": "1",
                    "time": "15/11/2021-14:56:43",
                    "content": "not sure I see the need for this yet. The better solution IMO is to get the stewards more involved and leverage Gitcoin’s governance token more intentionally. Creating a second governance token seems contradictory to the intention with the first. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#6",
                    "likes": "0",
                    "time": "28/11/2021-07:52:55",
                    "content": "Great suggestion! Contributors may not be interested or involved in the governance of the protocol. They should be incentivized in a way they are encouraged to be involved. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#7",
                    "likes": "1",
                    "time": "24/12/2021-02:13:20",
                    "content": "Non-transferrable governance tokens address some of these issues. Moving beyond coin voting governance I see the need for legitimacy in how bottoms-up norms are created. A clear process can help. This process would follow Ostrom’s SES Framework Once bottoms-up norms are established, top down governance can legislate them into law/policy backed by resources. I believe a framework like this would legitimize the information the stewards receive thus increasing their ability to govern the future of Gitcoin. The FDD research initiative will be running a test throughout Q1 modeling how decisions would turn out in 5-10 different governance issuance models. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Socio-ecological_system"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.444444444444444
                }
            ]
        }
    ],
    "group_index": "607"
}