{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/closing-out-grants-round-10/7662",
            "title": "Closing out Grants Round 10 ",
            "index": 7662,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "5",
                    "time": "02/07/2021-17:37:47",
                    "content": "Grants Round 10 has open disputes. Resolutions need to be in place by Tuesday, July 6th. ASKS OF STEWARDS:  Comment on Disputes (The decisions will create precedent and policy in the future) Be ready to ratify round results   This post serves as an update to GTC governance as to next steps in the process.  (All dates are estimates and are subject to change) Dispute deliberations: July 2nd - July 6th What: Period for commenting on the open grant disputes Where: On GitcoinDisputes twitter Who: Anyone (We are looking for input from stewards and engaged community members) Dispute resolutions due: July 6th What: Final decisions must be made Where: Asynchronous Who: Anti-Fraud & Collusion workstream of GitcoinDAO Governance Brief: July 7th What: The formal request to the stewards to ratify the round results and decisions made for the current round. Precedent set by these decisions will be debated prior to the stewards ratification of the next round. This will include the official policy & ToS updates. Where: gov.gitcoin.co Who: Public Goods and Anti-Fraud & Collusion workstreams Steward Ratification: July 7th - July 11th What: Formal ratification of the round results as presented in the GR10 Governance Brief Where: snapshot? Who: All GTC holders Payouts: July 12th-17th What: Matching funds are paid out through the GR10 smart contract Where: A wallet near you Who: All eligible grants with matching funds from round 10 ",
                    "links": [
                        "http://gov.gitcoin.co",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-2/7777"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.754712301587301
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#2",
                    "likes": "2",
                    "time": "02/07/2021-20:40:44",
                    "content": "    DisruptionJoe:  What: Period for commenting on the open grant disputes Where: On GitcoinDisputes twitter  Who: Anyone (We are looking for input from stewards and engaged community members)   Hey Joe, a Small ask from me would be to also cross-post stuff in the stewards channel which I think you do already just to remind us to act. So here for disputes they should be discussed in Twitter and go through all Twitter posts of the dispute account? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/07/2021-15:32:14",
                    "content": "It doesn’t matter where they were posted for this round. We were looking at all Twitter, Discord, and the Notion page. We will develop a process that is better at alerting stewards and offering a standard central place for comments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/07/2021-15:33:36",
                    "content": "An update: We are working on incorporating the results of the machine learning pipeline and expect to post the governance brief with final results and the ask for the stewards to ratify today or tomorrow morning at the latest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                }
            ]
        }
    ],
    "group_index": "517"
}