{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-2-17-eth-denver-event/9419",
            "title": "[Proposal] 2/17 ETH DENVER event ",
            "index": 9419,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Huntfrye11",
                    "index": "#1",
                    "likes": "2",
                    "time": "13/12/2021-17:19:17",
                    "content": " Summary This is a proposal to fund GitcoinDAO activities at ETHDenver 2022.  Abstract This is a proposal to fund GitcoinDAO activities at ETHDenver 2022.  EthDenver Cypher Sponsorship Included in this proposal is a sponsorship of ETHDenver 2020 at the ‘Cypher’ level. This is what the benefits of that sponsorship are:  1448×780 141 KB   SporkDAO Retroactive Reward SporkDAO is the DAO that runs ETHDenver. During the SporkDAO Launch, Gitcoin got 444,092.03 $SPORK in exchange for past sponsorships of ETHDenver. We would like to reward them some amount of GTC as a show of good faith.  Total Cost The cost all in of this proposal is 4363 GTC. Here is a rough breakdown of costs: ETHDenver Cypher Sponsorship (ETHDenver) 2,488 GTC SporkDAO Retroactive Rewards (ETHDenver) 1,625 GTC Event Planning & Admin (Hunt Frye Web3 Services LLC) 250 GTC Total costs 4363 GTC  Administered by Hunt Frye Web3 Services LLC This engagement will be administered by Hunt Frye. Hunt has planned multiple events around conferences in the ETH space, including the last one day Gitcoin conference. He is using his local event planning knowledge to ensure each the experience of the GitcoinDAO experiences goes well at ETHDenver - for specifics on the GitcoinDAO engagement at ETHDenver this year, checkout this event. Hunts goal is to make sure no heavy lifting is required by the Gitcoin team or the GitcoinDAO stewards to plan a great event.  Motivation ETHDenver and Gitcoin have historically been very intertwined, with Gitcoin being a “Founding Steward” of ETHDenver during its first year (2018). ETHDenver and Gitcoin are both promoters of the blockchain space in Colorado, and have a positive-sum relationship that has lasted several years. This proposal ratifies that relationship, and karmically accounts for the fact that ETHDenver was not part of the initial retroactive distribution. Some history of the relationship with ETHDenver here:  Gitcoin is a founding member of ETHDenver in 2018. During ETHDenver 2019, Gitcoin provided Kudos NFTs to the winner of the hackathon and also Gitcoin Bufficorn avatars to attendees. During ETHDenver 2019, Gitcoin was granted a comp’d sponsorship of the Event. During ETHDenver 2020, Gitcoin was granted a comp’d sponsorship of the Event, and a discounted rate to do Sustain Web3 ( https://web3.sustainoss.org/ ) at ETHDenver. During ETHDenver 2021, Gitcoin was granted a comp’d sponsorship of the Event. During ColoradoJAM 2021, Gitcoin was given access to the Colorado Governors office to pitch Quadratic Funding to the States Department of Technology.  ETHDenver and Gitcoin have historically had a very “positive sum game” relationship, with a “pay it forward” mantra, and this grant is in that spirit. The relationship is not typically viewed as transactional by any party, but if one were to put on that lense when evaluating this proposal, I’m sure this proposal will not hurt Gitcoin’s continued access to comp’d sponsorships. This proposal is an opportunity for GitcoinDAO to give back to the Ethereum ecosystem, get its message out there, and to network with leaders of other DAOs.  Specification This is a proposal to cover GitcoinDAO’s engagement at ETHDenver 2022.  specifically, to give Hunt Frye Web3 Services LLC (address 0x3B734d9f4759F24afa771c1Fef4Df1AEa6498360) 250 GTC to administer the ETHDenver engagements in February 2022. to give 4113 GTC to the ETHDenver/SporkDAO mainnet address: 0x11CCE80E6EA89C7DA94F670977edBF7673FdCeF4.  When this proposal is setup on tally, we could perhaps set it up as a multisend so that the funds go directly to those parties directly.  Benefits This proposal takes the relationship with ETHDenver to the next level. The relationship with ETHDenver (now sporkDAO ) is very “pay it forward”-centric, not transactional - But if you view this in a transactional lense, I’m sure that this proposal passing will not hurt Gitcoins ability to receive comp’d sponsorships in the future. It is possible (but not guaranteed) that SporkDAO will return the favor by giving SPORK to GitcoinDAO. This proposal is an opportunity for GitcoinDAO to give back to the Ethereum ecosystem, get its message out there, put GitcoinDAO logo side by side with talks by amazing luminaries from the space (Vitalik, Juan Benet, Austin Griffith) and to network with leaders of other DAOs.  Drawbacks 4363 GTC removed from treasury.  Vote Vote YES to pass proposal. Vote NO to NOT pass proposal. ",
                    "links": [
                        "https://www.sporkdao.org/",
                        "https://twitter.com/Hunthk11",
                        "https://www.youtube.com/watch?v=wWXdi891b28&list=PLvTrX8LNPbPnJYe0v37HL4T8dsilPQWTE&index=2",
                        "https://www.addevent.com/event/MG10118272",
                        "https://web3.sustainoss.org/",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-1-2022/9683",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-2-2022/9739",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-3-2022/9771",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-4-2022/9816",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24/9446"
                    ],
                    "GPT-summary": "The post is a proposal to fund GitcoinDAO activities at ETHDenver 2022. The proposal includes a sponsorship of ETHDenver 2020 at the ‘Cypher’ level, SporkDAO Retroactive Reward, and Event Planning & Admin. The proposal is administered by Hunt Frye Web3 Services LLC. The post also highlights the positive-sum relationship between ETHDenver and Gitcoin and the benefits of the proposal for GitcoinDAO. The drawbacks of the proposal are the removal of 4363 GTC from the treasury.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.454112554112554
                }
            ]
        }
    ],
    "group_index": "631"
}