{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q1-2023/12693",
            "title": "How should I change my delegations? [Q1 2023] ",
            "index": 12693,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "3",
                    "time": "27/01/2023-20:52:23",
                    "content": "by request, i’m starting a thread to present my Q1 2023 delegations. (for those of you dont know me, im kevin owocki - one of the original cofounders of Gitcoin.  i started Gitcoin in my basement and (along with early hires) took it from nothing to a brand that Joe Lubin/Vitalik Buterin have endorsed with $50mm+ in GMV.  to embrace decentralization of leadership, i disaffiliated from the DAO’s leadership last summer.  if you check out my discourse profile or public speaking history you can learn more about me.) here are my delegations as they currently stand  del702×1140 83.7 KB  medium/long term, i’d love to decentralize my GTC voting power among more community members.   my goal is to get each delegatee below 10% of my delegations. here is my post on that.. short term,  i delegated heavily to janine, kyle, olsen, and griff because Gitcoin is in a place of change into a protocolDAO and i see these people actively helping create clarity there. i delegated to griff because I admire what Giveth has done in the space, especially how quickly they iterate, and i’d welcome his presence stewarding Gitcoin. because of my disaffiliation i am not aware of what up & coming talent there is in the DAO.  thus far i’ve not been getting a ton of inbound on this form so my plan to decentralize my delegations is somewhat stalled. id love to learn more about the up & coming talent in the DAO. please fill out this form if you have a recommendation to make.   feedback welcome i would like to solicit feedback from you all about how i should change my delegations. pls come to my office hours (link forthcoming) or fill out this form if you have feedback for me (anon responses ok).  or if you can comment below as long as your comment meets the forum guidelines and code of conduct.  past delegation updates from me:  Q4 2022 Q3 2022 Q2 2022 Creating more Transparency into delegations Does the DAO need a decentralization Essential Intent?  ",
                    "links": [
                        "https://gov.gitcoin.co/t/passing-the-torch/10971",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://owocki.com/public-speaking",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/0/016d8026a24a1f9b6024ec94f659add4303f8cf8.png",
                        "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q3-2022/11132/5",
                        "https://gov.gitcoin.co/t/passing-the-torch/10971/2",
                        "https://forms.gle/vCvnJfh8N3n52BBH7",
                        "https://forms.gle/vCvnJfh8N3n52BBH7",
                        "https://forms.gle/vCvnJfh8N3n52BBH7",
                        "https://gov.gitcoin.co/t/forum-guidelines-and-code-of-conduct-2023/12479/4",
                        "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q4-2022/11542",
                        "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q3-2022/11132",
                        "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q2-2022/10828",
                        "https://gov.gitcoin.co/t/creating-transparency-into-delegations/11127/3",
                        "https://gov.gitcoin.co/t/does-the-dao-need-a-decentralization-essential-intent/11228",
                        "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q2-2022/10828/35",
                        "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q2-2022/10828/23"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.009615384615384
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/chaselb",
                    "index": "#2",
                    "likes": "4",
                    "time": "27/01/2023-23:55:36",
                    "content": "I would love to see @shawn16400 on this delegation list. He is doing incredible work on the organizational side of GitcoinDAO, really trying to progress this experiment in decentralized organizing and create fair and transparent community governance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.875
                }
            ]
        }
    ],
    "group_index": "310"
}