{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-aqueduct/9684",
            "title": "Gitcoin Aqueduct ",
            "index": 9684,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/paradave",
                    "index": "#1",
                    "likes": "30",
                    "time": "12/01/2022-23:15:22",
                    "content": " Authors Dave White, Kevin Owocki  Summary This paper introduces Gitcoin Aqueduct, a tool that incentivizes ecosystem development for your project with a single line of Solidity. Aqueduct helps unbundle the work of protocol creation from the work of supporting an ecosystem, and helps protocols grow in a truly decentralized way. To fill your Aqueduct, you transfer in some of your project’s revenue or inflation. In the beginning, your Aqueduct will distribute these tokens to developers on your ecosystem automatically, creating and running quadratic funding rounds with no human intervention. As your project grows and more assets flow into its Aqueduct, GitcoinDAO will begin to provide more and more high-touch ecosystem development services.  Narrative  Problem Alice is developing a new NFT project, NFTP. She is a talented coder and artist and believes in what she is making. Alice also knows that if her project is to be successful long-term, it will need an ecosystem, with other developers contributing, a team managing the Discord, and so on. However, Alice is a builder, not a manager. She is also committed to decentralization. As a result, she doesn’t want to personally coordinate an ecosystem long-term, and she doesn’t want to set up an organization or hire somebody to do it for her.  Solution By design, NFTP receives ongoing revenue from secondary sales of its NFTs. Alice redirects 10% of this revenue to NFTP’s Aqueduct. If NFTP were intended as a pure public good, it might send 100% of revenue to its Aqueduct.  Result After a sufficient amount of tokens accrue in the Aqueduct, Gitcoin automatically holds a quadratic funding round for NFTP using those tokens: developers propose projects that will benefit the NFTP ecosystem, and members of the NFTP community allocate the Aqueduct’s funds to those projects using the quadratic funding mechanism. GitcoinDAO supports this process both by providing the infrastructure for funding and by promoting the round on Twitter and other channels (including, perhaps, a list of Discords to which a GitcoinDAO bot has been invited). Critically, none of this requires any significant expense or human time. Furthermore, it requires no further interaction from Alice or NFTP, which doesn’t even need to have governance. As NFTP grows, aided by Aqueduct-funded development, the amount of revenue allocated to the Aqueduct will grow as well, eventually reaching a point where human involvement is both prudent and economical. Accordingly, at certain pre-defined revenue tiers, the level of service provided by GitcoinDAO will increase. For example, a $100K Aqueduct might come with automated human-in-the-loop anti-fraud support, while a $1M Aqueduct might come with a part-time community manager, and a $10M Aqueduct might come with a full-time ecosystem management team. GitcoinDAO would be compensated with a percentage fee for providing these services.  Mechanism Notes  Side Round Protection The main challenge with this design is how to ensure that funds in the NFTP side-round are actually spent on NFTP ecosystem projects. At sufficient levels of Aqueduct funding, a fee to GitcoinDAO could easily pay for humans to help ensure grants are appropriate. For smaller rounds, or even to ensure alignment in larger rounds, specific protection mechanisms might help. For example, in order to match a donation of 1 ETH, Aqueduct might require the donor to stake at least 5 ETH worth of NFTP NFTs for some time period. Or, it might require the person posting a new grant to post a bond that can be slashed if they are found to have submitted a project that isn’t for the benefit of NFTP, with the bond amount sufficient to incentivize both reporting and adjudication.  Alternatives to Quadratic Funding Today, quadratic funding is the leading system for permissionless ecosystem development. Over time, other methods like Retroactive Public Goods Funding might prove to be more effective. Any such method can easily integrate with Aqueduct.  Conclusion Gitcoin Aqueduct unbundles the work of designing and implementing a protocol from the work of scaling it and managing its community. By doing so, it reduces the friction involved with starting a protocol while providing opportunities for developers to make a living contributing to open source. This is only a rough design sketch, and there are likely many problems to be solved before it can become a reality. We’re excited to hear your feedback and work on improving it together.  Acknowledgements Dan Robinson, llllvvuu, Allan Niemerg, Jordan Lazaro, Greg Fodor ",
                    "links": [
                        "https://twitter.com/owocki",
                        "https://vitalik.ca/general/2019/12/07/quadratic.html",
                        "https://vitalik.ca/general/2019/12/07/quadratic.html",
                        "https://medium.com/ethereum-optimism/retroactive-public-goods-funding-33c9b7d00f0c",
                        "https://twitter.com/danrobinson",
                        "https://twitter.com/llllvvuu",
                        "https://twitter.com/niemerg",
                        "https://twitter.com/jordanlzg",
                        "https://twitter.com/gfodor",
                        "https://gov.gitcoin.co/t/scaling-funding-for-blockchain-era-public-goods/9797",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-public-goods-funding-budget-request/10443",
                        "https://gov.gitcoin.co/t/ditch-quadratic-funding/10316/2",
                        "https://gov.gitcoin.co/t/how-does-the-dao-prioritize-side-rounds/9827",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-7-2022/9996",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-2-2022/9739",
                        "https://gov.gitcoin.co/t/can-gitcoin-be-doing-more-to-support-ethereum-protocol-devs/10151",
                        "https://gov.gitcoin.co/t/how-does-the-dao-prioritize-side-rounds/9827/3",
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-wonder/10170",
                        "https://gov.gitcoin.co/t/proposal-gr15-round-structure/11272",
                        "https://gov.gitcoin.co/t/an-evolutionary-lens-on-web3-open-source-software/10293",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-wonder/10170/19"
                    ],
                    "GPT-summary": "The post introduces Gitcoin Aqueduct, a tool that incentivizes ecosystem development for a project with a single line of Solidity. The tool helps protocols grow in a decentralized way by unbundling the work of protocol creation from the work of supporting an ecosystem. The post explains how the tool works and how it can be used by developers. The author also invites feedback and collaboration from the readers.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.7238203463203465
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#2",
                    "likes": "2",
                    "time": "12/01/2022-23:58:38",
                    "content": "This is awesome. I can imagine Public Goods projects using some sort of funding curve where as the amount of proceeds they generate increase, the amount going to Aqueduct increases too. This would allow Founders to support themselves in early days and then let the funds flow to the ecosystem in later days. Let’s make up an example for illustration: If NFTP has a wallet which has received less than 100k then maybe 10% flow into the aqueduct. If the project has received more than 1 million then maybe 50% flow into the aqueduct. If the project has received more than 10 million then 90%+ should flow into the aqueduct. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3809523809523805
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "5",
                    "time": "13/01/2022-01:47:56",
                    "content": "if people have questions, or would like to discuss the design, pls comment below. or you can pls contact aqueduct@gitcoin.co if you’d like to set up a Gitcoin Aqueduct.  is-this-a-pigeon (5)700×420 229 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/0xjim",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/01/2022-04:20:04",
                    "content": "Really cool idea! This reminds me of an automated version of Metis’ “ecosystem mining” program they announced last week. Nitpick on the value prop: in the illustrative example, you mentioned that Alice is a builder and doesn’t want to deal with growing an ecosystem. However, Aqueduct only automates the BD/grants/dev relations part of running a project, and doesn’t touch the marketing side – which will still need to be done by Alice’s team. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.729166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/01/2022-05:21:17",
                    "content": " Metis’ “ecosystem mining” program they announced last week.  will check that out! edit: found it!     0xjim:  However, Aqueduct only automates the BD/grants/dev relations part of running a project, and doesn’t touch the marketing side – which will still need to be done by Alice’s team.   why is that? AFAIK - there are plenty of marketing teams funded by QF in recent grants rounds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/leeyy777",
                    "index": "#6",
                    "likes": "2",
                    "time": "13/01/2022-10:04:20",
                    "content": "真的很酷的想法我可以想象公共产品项目使用某种资金曲线，随着它们产生的收益量增加，进入Aqueduct的金额也会增加。这将使创始人能够在早期支持自己，然后在以后的日子里让资金流向生态系统 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#7",
                    "likes": "1",
                    "time": "13/01/2022-16:23:21",
                    "content": "Interesting, can you expand how does this work or it’s still a work-in-progress, do you guys have an architecture model for the solidity line of code that represent what it actually do, is this an addon over an existing contract that bridge both? I’m really curious about that and understand the process of funds distribution from that !code     paradave:  Furthermore, it requires no further interaction from Alice or NFTP, which doesn’t even need to have governance.   Looking really great! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/0xjim",
                    "index": "#8",
                    "likes": "1",
                    "time": "13/01/2022-16:27:31",
                    "content": "Ah I see - so the Aqueduct can also fund marketing contributors ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/simplemachine92",
                    "index": "#9",
                    "likes": "4",
                    "time": "13/01/2022-17:33:47",
                    "content": "Hey Dave, Kevin, Read through the notion after Kevin sent me the draft, and as a solo-maintainer / dev of a public goods supporting project (Mars-Shot Bots), I really see the niche for this. What if we think of this as a permission-less system, where we can identify “Cartels”? We could enable anyone to contribute to “Moonshot”, “Mars-Shot”, “LARP” cartels, simply by including an ID in their contract. When funding, or x amount is received from a contract, we can call a view function to retrieve their ID, and associate them with their cartel for a funding round. Anyway, really interested in helping y’all get this off the ground. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#10",
                    "likes": "6",
                    "time": "13/01/2022-17:52:45",
                    "content": "This is a game changer. Love the idea. Looking forward to see how people use it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#11",
                    "likes": "3",
                    "time": "13/01/2022-18:02:40",
                    "content": "I love this idea and am excited to collaborate in bringing it to life. In case it’s helpful to others as we ideate on what this might look like, I jotted down some thoughts on my interpretation of the write-up and the potential solution sets & customer sets that I gleaned from it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.899305555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/joshuavial",
                    "index": "#12",
                    "likes": "2",
                    "time": "13/01/2022-22:00:00",
                    "content": "Best proposal I have seen in a long time. Love it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.416666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seedphrase",
                    "index": "#13",
                    "likes": "2",
                    "time": "14/01/2022-10:28:58",
                    "content": "Oh wow! This is an awesome concept. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.8125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jordan",
                    "index": "#14",
                    "likes": "2",
                    "time": "14/01/2022-19:00:43",
                    "content": "This is a game changer for the whole ecosystem, love to see the community reaction. Already seeing a possible improvement :     paradave:  bond that can be slashed   This would make sense only if bonds can be community sponsored. Indeed if all proposals must have bond then we run into a problem where proposers without any “cash” cant add value to the projects and we might end up money gating contribution. A potential solutions would be to have proposers submit the proposal “off chain” and anyone from the community could stake on their behalf to support the aforementionned proposal, once the staking thresehold is met, the proposal becomes on-chain code and enter the aqueduct voting system. We can call this the Dropshafts, those are safety mechanism in aqueduct architecture. Happy to hear feedback on this to make the aqueduct even more efficient. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/rahul-kothari",
                    "index": "#15",
                    "likes": "2",
                    "time": "15/01/2022-19:10:25",
                    "content": "Love this idea! Esp that Alice can now grow and reward the ecosystem without having to do grants or be ever present on discord.   How do you determine who in the ecosystem would be rewarded? Is it an automatic or manual process?   What are the biggest technical problems do you see rn for implementing this?   Stupid question that I might have missed → will the contributions to Aqueduct be strictly in GTC or their token or a mix?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.78125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#16",
                    "likes": "1",
                    "time": "19/01/2022-11:51:24",
                    "content": "Jordan, that is a cool consideration! Thanks for posting. I see this is your first post on the forum. Are you in the Discord already? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.479166666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/frankchen07",
                    "index": "#17",
                    "likes": "2",
                    "time": "19/01/2022-20:27:41",
                    "content": "This may come out as we experiment with the first initial groups in the Aqueduct, but do you think it’s a risk that this fundamentally separates handling possible protocol development and the community that supports the protocol? The positive case is that this would be a good separation between protocol building and the Aqueduct funding spawned off projects themselves in the community that eventually become public goods. In the example for the NFTP ecosystem, what are the guidelines for the proposals that developers give? I can see in the case of a protocol, there can be projects that spawn off of it, but if it’s already a set NFT project, are Aqueduct funds used to develop a community, or develop additional projects on top of NFTP? Is this distinction even important? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.298295454545455
                }
            ]
        }
    ],
    "group_index": "660"
}