{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-appeals-discussion-and-planning/10035",
            "title": "Gitcoin Appeals Discussion and Planning ",
            "index": 10035,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#1",
                    "likes": "2",
                    "time": "10/03/2022-21:48:53",
                    "content": "Hello folks, thanks to all that are contributing to building the Gitcoin Appeal process.  Here a plan  to facilitate informed steward debate & vote for denied grant applicants seeking an appeal.  Please share feedback. Gitcoin Appeals Synopsis - March 9, 2022 TL:DR: The denied-grant appeal system needs some updating and attention to properly reflect the community’s intended outcomes. Specifically, the work-flows and automation associated with the system.  By creating and automating processes related to information and communication transfer, and establishing a dedicated group of senior trusted grant reviewers, who will filter out poor quality appeals, Gitcoin can offer a credibly neutral, simple and quick appeal process to denied grant teams. Table of Contents:  Current System - What isn’t working Temporary Fix - What we will do for Appeals between now and when the future state system is built Future State - What FDD will build out for the Appeals before GR14 Appendix - Appeal flowchart, Potential ‘Trusted Select Reviewers’ criteria  The Gitcoin Appeal system for denied grants was designed long ago and much has changed. The system has not been used operationally yet.  We can achieve better alignment with the Gitcoin ecosystem by making a few light changes. This document sets out the current state of Gitcoin appeals, notes strengths and weaknesses, and describes an attainable future state. Current System:   Appealflow903×811 68.9 KB  The description of the current system is accessed through the ‘Support’ section of the Gitcoin.co website. See:   Why isn’t my grant active? The Friction Points with Original Design  Potential single point of failure with needing a independent steward (bribery) Slow to obtain a steward vote (no process) Slow processes of transferring information and communication (no automation) No stake needed (prone to spam)  Changes to Original Design: Temporary changes to original design to be used until the full appeals system is built out:  Remove the staking fee until a better system is built The FDD source council will determine if an appeal has merit (We receive many requests to appeal which provide no new info. Without the staking system we expect to receive spam or “spray and pray” type appeals. While this step is a temporary bottleneck, it is better than the current system and a step in the right direction.) All appeals deemed to have merit will be added to the governance forum where they will need 5 positive comments from known stewards to be advanced to snapshot. The discussion period will be a minimum of 3 days. Snapshot vote period of 3 days. Whether the grant should be “reimbursed” or back paid for lost matching is a separate issue. We hope to set precedent during the first full run of the appeals system.  Here is what this would look like:  Newappealflow_21233×710 37 KB  The Future Vision:  Staking or deposit requirements to appeal Supplement or replace the FDD Source Council vote with community appeal vote An application built to expedite the process An appeals system based on Ostrom’s principles Advancing policy using the model of English Common Law Potential integration to other tested adjudication systems like Kleros or Celeste  ",
                    "links": [
                        "https://support.gitcoin.co/kb/article/79-why-isn-t-my-grant-active?",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.452841484756378
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/03/2022-01:36:54",
                    "content": "Great outline here. Thank you for taking the time to drive this. We can use the thread you started for BrightID’s novel case as a first appeals post. At this point, I think a snapshot vote for policy updates is warranted as we clean up these hard to define and novel cases. Novel Situation #1 - Project should not have a token or raised VC funding Let’s aim for a snapshot vote for BrightID starting on Tuesday, then we can have the BrightID appeal settled before the end of the round as promised AND can update the policy for revised judging during the dispute period which begins Thursday next week. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.660714285714286
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/03/2022-20:30:39",
                    "content": "Another part of this, we can’t be overloading stewards with tasks and so I will create a template for posting the synopsis into the Gov Forum for steward vote.  That way it will be a consistent presentation of info.  A very succinct but detailed description. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666667
                }
            ]
        }
    ],
    "group_index": "8"
}