{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-community-input-on-gitcoindao-s-draft-purpose-essential-intents/10662",
            "title": "[Proposal] Community Input on GitcoinDAO\\xe2\\x80\\x99s Draft Purpose & Essential Intents ",
            "index": 10662,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "regen",
                "contributors",
                "stewards",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#1",
                    "likes": "10",
                    "time": "20/05/2022-21:55:10",
                    "content": " Summary This proposal seeks community input on GitcoinDAO’s Purpose and Essential Intent to create greater alignment among stakeholders. Amended Timeline: To facilitate additional input from the community, the deadline to provide feedback to the draft purpose and essential intent statements is extended one week to Friday June 3, 2022.  Context Earlier this year, several members of CSDO raised concerns that there was growing misalignment between GitcoinDAO contributors, stewards, community, and fans around the DAO’s mission and methods for delivering outcomes on that mission. Some of the confusion is historic. Since Gitcoin launched in 2017, there have been several iterations of its articulated mission, vision, and values. Along the way, followers and contributors alike were drawn in by the company’s continuous evolution within the ecosystem, first as a funder of open source, and eventually, as a builder and funder of public goods. Though directionally similar, how community members frame Gitcoin Holdings’ impact is often a signal of when they started following and contributing to the project. Part of this misalignment is also due to where we are in our organizational development. GitcoinDAO will be a year old this month (yay!). In the midst of the disaffiliation from Gitcoin Holdings, contributors are developing the common rituals, processes, and language that clearly articulate our vision for the world we are trying to build. It is also increasingly clear that the confusion over the DAO’s purpose and essential work is beginning to affect how we create alignment with all the constituents we have. This was most recently felt during the S14 budget process where stewards and contributors voiced concerns about the various workstream projects and associated spending, which seemed out of sync with the stated mission and vision of Gitcoin Holdings. The broader market conditions and the desire for tighter alignment underscored the need for a clear statement of purpose, and focused direction on the DAO’s medium-term goals. During a recent cross-stream strategy session held on May 6th, workstream leads and Gitcoin Holdings attendees brainstormed potential statements of GitcoinDAO’s Purpose and Essential Intent (see link).  Process to-date During the strategy session, workstream leads and Gitcoin Holding attendees met with the goal of developing a shared sense of potential statements of DAO-level Purpose and Essential Intent. The session was facilitated by Sam Spurlin of The Ready. Instead of focusing on traditional Mission and Vision statements, Purpose and essential intents seek to offer context on what work matters most within an organization and and why.  1244×208 85.7 KB   1258×268 139 KB  Attendees were asked to consider:  The definitions of a stated purpose and essential intent (see above).  Instead of focusing on what an organization does (a mission statement), a Purpose statement describes the reason it exists. Essential intent describes the concrete, measurable work of contributors to an organization in pursuit of the overall purpose.   The utility of developing and articulating a DAO-level purpose and essential intents. The role of the GitcoinDAO community articulating and consenting to the drafted artifacts.  Using previous Gitcoin discussions on the topic as inspiration, attendees drafted and voted on potential purpose and essential intent statements. The session ended with the attendees electing a subgroup to synthesize the discoveries of the session into draft language for consideration by the broader community. The subgroup included  @annika, @owocki, @lthrift, @kyle, and @Jodi_GitcoinDAO. Draft language was presented and discussed during CSDO Meeting #32 held on May 17th. The group decided we had enough conviction in the working group’s language that we were ready to move the discussion forward to our community.  Emergent Themes and Tensions from Session We are an Impact DAO working to launch our Protocol. We will transition to a Protocol DAO focused on building and funding tools that support community-driven shared resources. We knew we wanted to stay true to our earlier mission and ensure the purpose and essential intents were focused on empowering the builders of funders to use Gitcoin Grants to realize the green pilled future we have imagined. We agreed the Grants protocol is the most important essential intent for us to focus on over the next 12mos. We also quickly identified the thematic need to ensure we thrive as a DAO — financially, in the impact we deliver, and in the example we set for the web3 ecosystem. You can find more of the details in the session notes, which are documented here. The work of the elected subgroup can be found here.  Draft Purpose and Essential Intent  Purpose To empower communities to build & fund their shared needs.  Essential Intents…in no particular order Grants Protocol (+ Growth)  Build a widely adopted, modular Grants protocol that creates a flourishing ecosystem of funding mechanisms.  Financial Sustainability  Have a comprehensive, diversified strategy for financial stability of the DAO in order to effectively achieve our mission.  DAO Organization  Create and promote clear and engaging rituals, communication channels, and messaging that build shared context among GitcoinDAO’s contributors, stewards, and supporters.  Grants Program   Enable a successful grants protocol launch by dogfooding it internally & supporting ecosystems in adopting it.   Continue to support the Ethereum ecosystem & public goods in web3 and beyond through Gitcoin-led rounds.    Additional Context At the same CSDO meeting, workstream leads discussed the following tradeoffs, tensions, and opportunities that emerged from the proposed language, including:  The potential confusion created by moving from a ‘public goods’ or ‘open source’ framing in our stated purpose to one that centers a community’s ‘shared needs’. How creating a distinction between the Grants program directed by the PGF and the Grants Protocol allows for flexibility in messaging the importance of each. What role our ethics play in informing our purpose and essential work. The constraints created by including prescriptive language in our essential Intents.  Ultimately, we cannot finalize these artifacts without feedback from you on these or other emergent considerations.  Request to the Community We are seeking community comment on the draft purpose and each essential intent by May 27th, 2022 (1 week from today). In parallel, we will be presenting the draft language at a Steward Council call to be held on Tuesday May 24th to seek their advice and/or consent. It’s important to conclude this post noting that the goal of this proposal is to build in the open. We hope that this process helps us work with clarity and focus over the the 12-18 months, and well into the future. Be on the lookout for a post from our friends at MMM with updates on how some of the work in this post ties into the DAO’s brand strategy. We appreciate your engagement with this proposal in the comment thread below. Sincerely, CSDO ",
                    "links": [
                        "https://app.mural.co/t/theready7827/m/theready7827/1651759127362/e725e0a698f03944495507ed206cf5f90bd07428?sender=sam3202",
                        "https://www.notion.so/gitcoin/CSDO-Cross-Stream-DAO-Ops-32-48eafb8da28c4daabf105442a035200a",
                        "https://app.mural.co/t/theready7827/m/theready7827/1651759127362/e725e0a698f03944495507ed206cf5f90bd07428?sender=sam3202",
                        "https://docs.google.com/document/d/1UtgdSH5RNLJQ4bxX8irew93hQYoMFp2vKO-alQogPBc/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-19-2022/10737",
                        "https://gov.gitcoin.co/t/a-compensation-commitment/10830/22",
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v3/10358",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-20-2022/10789",
                        "https://gov.gitcoin.co/t/the-network-effects-of-gitcoindaos-protocols/10973",
                        "https://gov.gitcoin.co/t/update-gitcoindaos-adopted-purpose-and-essential-intents/10984",
                        "https://gov.gitcoin.co/t/building-momentum-around-grants-2-0/10709",
                        "https://gov.gitcoin.co/t/proposal-the-gitcoin-foundation-a-proposal-to-represent-the-gitcoin-dao-irl-by-a-cayman-islands-foundation/9983/30",
                        "https://gov.gitcoin.co/t/the-meta-trap/10666/3",
                        "https://gov.gitcoin.co/t/the-overton-window-for-grants-2-0/10461/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.409044715447155
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#2",
                    "likes": "0",
                    "time": "21/05/2022-01:59:36",
                    "content": "    Jodi_GitcoinDAO:  Purpose To empower communities to build & fund their shared needs.   I’m concerned about committing to a purpose that is too broad/void of any moral content. Are we open to our product being used to raise funds for nefarious purposes or even just things that aren’t public goods? If we do this in the spirit of decentralization/permissionlessness, we’ll lose many of the core principles that serve as glue for the community. What do we stand for if not public goods? “I help fund things” doesn’t quite have the same ring to it. The language of “public goods” only showing up in the Grants Program intents makes me feel that would be the only workstream I’d be values-aligned with if the rest of the DAO isn’t also focused on that ideal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "6",
                    "time": "21/05/2022-15:07:34",
                    "content": "gm gm, glad we are doing this. it’s great to see the DAO start to figure out how to prioritize what its most essential intents are, which will hopefully lead to greater focus, alignment, & success. @safder , thanks for commenting!  Responding to your queries now as a member of the workstream.  And I welcome any feedback on my feedback!     safder:  I’m concerned about committing to a purpose that is too broad   Curious - What do you think about the constraints of the purpose that were given to us?  59uhtku9_AKE0lrhReeVwH16fXUsSMzyBcgkXblJ2sWNLezVdqAp0BfpJG6RRX0Refw9DhlGExQPTj6Q9-YVovlD15ni6XmWx3giEbxx1R25Pve801eoCOl3mNNKTSAlCJxJBQ2pM6mDfHXY7w1244×208 85.7 KB      safder:  I’m concerned about committing to a purpose that is … void of any moral content   One thing I like about the drafted purpose is that it defers to communities to define their own shared needs.  The thinking here is that the moral content for each community is relative to their own value systems (and should not be imposed by us or anyone else, it should be soveirgn to those communities). This is how I kind of visualize this in my brain:  Screen Shot 2022-05-21 at 8.50.20 AM1304×724 94.3 KB      safder:  Are we open to our product being used to raise funds for nefarious purposes or even just things that aren’t public goods?   I have 3 thots on this:  1 I think that one implication of becoming a protocol dao is to be credibly neutral, defined as follows:  Essentially, a mechanism is credibly neutral if just by looking at the mechanism’s design, it is easy to see that the mechanism does not discriminate for or against any specific people The great benefit of a protocol is that GitcoinDAO does not have control nor liability.  This means there is no intermediary who can rent seek, nor is there an intermediary who can discriminate against specific people.  But there is also no one to impose Gitcoin’s values (beyond what is baked into the protocol itself - IMO QF is already an opinionated mechanism).  2 Here is how I think about public goods vs other types of goods.  We put ‘shared needs’ in the purpose because we didnt want to continue getting drawn into long technocratic discussions defining public goods (ask the FDD about what its like to be in the middle of one of these - its a very large time sink + not always very fruitful in a world where there is much nuance between public goods + other types of goods). We felt that it was more important to meet the shared needs of the communities we serve, and in a world where public goods are the most underfunded, the communities will naturally be drawn via the protocol to allocate resources there.  3 I dont worry about the product being used for nefarious purposes, because Quadratic Funding naturally optimizes for broadly what communities want, and I believe that people in communities very often want positive things for themselves - and very rarely do people broadly advertise doing nefarious/immoral things.  Bc QF optimizes for the preferences of the broad many, I think the QF mechanism is resistent to this concern.     safder:  What do we stand for if not public goods?   To empower communities to build & fund their shared needs.     safder:  The language of “public goods” only showing up in the Grants Program intents makes me feel that would be the only workstream I’d be values-aligned with if the rest of the DAO isn’t also focused on that ideal.   IMO communities shared needs is a superset of public goods. I am just one node in the network, feel free to disagree with me - Feedback welcome! ",
                    "links": [
                        "https://vitalik.ca/general/2019/05/09/control_as_liability.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.217471709576973
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#4",
                    "likes": "3",
                    "time": "21/05/2022-17:56:39",
                    "content": "Playing a bit with meme-ifying the “shared needs” concept here:   twitter.com    Ξwocki (🤖,💚) @owocki  IYKYK https://t.co/N5YlyPlCrS   10:53 AM - 21 May 2022           3            ",
                    "links": [
                        "https://twitter.com/owocki/status/1528071536564793345",
                        "https://twitter.com/owocki/status/1528071536564793345",
                        "https://twitter.com/owocki/status/1528071536564793345"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#5",
                    "likes": "3",
                    "time": "24/05/2022-02:27:52",
                    "content": "Thanks for the thoughtful response @owocki!     owocki:  Curious - What do you think about the constraints of the purpose that were given to us?    I like this. I see the purpose of this purpose statement as being something the community will feel inspired to build towards, even in rough times. Which leads to the main issue I have with our proposed purpose - it’s not inspiring enough (speaking for myself). I generally agree with most of the remainder of your post - agree that Gitcoin should be a credibly neutral protocol and agree that this means we’re probably open to the protocol being used in ways our individual community members might not always agree with.     owocki:  I believe that people in communities very often want positive things for themselves - and very rarely do people broadly advertise doing nefarious/immoral things.   I would challenge this - I think people can quite easily be led into believing they need/want something when it’s actually against their best interests. And harmful things can be marketed as “good”. This is why advertising exists, and I think QF is susceptible to social manipulation. Speaking of advertising, maybe the “glue” part of this is just a task for MMM in that case - can we meme-ify “shared needs” the way we’ve done for “public goods”? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.002978650137742
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#6",
                    "likes": "4",
                    "time": "24/05/2022-13:52:35",
                    "content": "    safder:  I think people can quite easily be led into believing they need/want something when it’s actually against their best interests. And harmful things can be marketed as “good”. This is why advertising exists, and I think QF is susceptible to social manipulation.   I agree with what you wrote here Saf and that’s why I would have added a 4th point to Kevin’s points above:  The protocol we are building is neutral, but we do not need to be.      safder:  Speaking of advertising, maybe the “glue” part of this is just a task for MMM in that case   We will indeed heavily promote the public goods use case, and the Grants program team (PGF) will play a big role in this, in deep coordination with marketing (MMM). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.983333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#7",
                    "likes": "9",
                    "time": "24/05/2022-18:49:34",
                    "content": "    safder:  Speaking of advertising, maybe the “glue” part of this is just a task for MMM in that case - can we meme-ify “shared needs” the way we’ve done for “public goods”?   Would love to weigh in here. IMO it’s not essential that the purpose is something that is directly meme-able. Most of the time, organizations do not market (here I mostly mean “amplify”) their purpose directly. Instead, they come up other artifacts that do this for them - like a tag line. Or audience-customized versions of these. While I agree that “shared needs” is not very meme-able, I don’t think that this is a requirement for a purpose, which is primarily for internal use in my view. That being said, I’ve crafted a vision & a mission as well based on the purpose being discussed. Perhaps these are more “opinionated” and therefore more inspiring. First, some definitions. Purpose, Vision, Mission & Impact can all sound somewhat similar. Here’s how we can tell them apart.  Purpose guides you. Mission drives you. Vision is where you aspire to be. Impact is what matters.  Gitcoin’s purpose is to empower communities to build & fund their shared needs. ^ This is what “guides” us, not what drives us. (This is what we’re ratifying in the orig post.) Gitcoin’s mission is to help ecosystems grow & thrive by building protocols & programs that enable them to build & fund their shared needs. (my draft version) ^ Is this what drives us? It’s more narrow & opinionated than the purpose. (We could potentially add a qualifier to ecosystems such as “positive sum” if we want to be more selective in the ecosystems we support with our limited resources.) Gitcoin’s vision is to create a world where millions of diverse, interdependent, cooperative & autonomous communities flourish, thereby enabling universal human thriving. (my draft version) ^ Is this what we aspire to create? Are these the right adjectives? Words matter! Finally, our impact should be quantified and outlined. What we have outlined with essential intent  here are close but IMO none are not nearly measurable enough. Let’s take a look at the graphic @owocki shared:  image1304×724 93.5 KB  We could adopt the following north star metrics (or something like it): By the end of 2023, we have 69 communities that have adopted our protocols, enabling at least 69420 individual grants, funded by 6,942,000 contributors. Imagine how the above vision, purpose, mission, and impact would help us to prioritize our daily, weekly, seasonal work and keep us aligned across workstreams? How has our mission changed over time? 2017: \t\tPush open source forward. Gitcoin is the easiest way to monetize or incentivize work in Open Source Software 2019: \t\tGrow & sustain open source. 2021: \t\tBuild & fund digital public goods. End of 2021: \tGitcoin DAO builds for human thriving (not fully adopted) Now: \t\tHelp ecosystems grow & thrive (shortened version of the above draft mission) What type of DAO are we?  We are a “protocol / impact” DAO - a DAO that designs, builds & deploys open protocols that create positive externalities. (Q: Is there a better name for this? I’m more focused on the definition here, which is below):  How do we measure success? We measure our success across both utility & impact. Today, BOTH utility & impact are reflected in the Gitcoin DAO governance token (GTC). (Is that sustainable & scalable?)    What are we not?  We are not a grants DAO We are not a protocol DAO ← a pure protocol DAO measures its value only in utility We are not a social DAO ← while we have many social events, these are in service of our broader purpose to empower communities to build & fund their shared needs  How do we think about our journey?  We launched a number of experiments to support open source builders & open source ecosystems - bounties, kernel, grants The most successful mechanism was grants. We experimented with grants and grants rounds as a way to allocate funds to promising projects and builders. QF was the mechanism that really found PMF because of the way it harnesses voices from the community. We helped many incredible projects get off the ground directly by raising money from matching pool sponsors & pairing them with community donations through quarterly grants rounds & QF We then expanded to offer grants rounds as a service to organizations like Uniswap that are looking to efficiently allocate funds to grow their ecosystems The product-market fit for ecosystem rounds was so immediate and clear that we’re now decentralizing our monolithic grants product into composable grants money legos. This will allow for supercharged adoption & impact. We will start to deemphasize running grants rounds directly and emphasize building & scaling protocols that allow web3 projects to run their own grants rounds. This pivot led to the reevaluation of our mission, purpose, vision and intended impact. We go from DAO-to-individual as our primary go-to-market to a primarily DAO-to-DAO model over the coming seasons.  Would love thoughts on any/all of the above ways to describe our evolution. Why is this important for marketing? Our vision, purpose, mission & impact feed into our overall marketing strategy. They are what is used to create a channel & content strategy. To amplify our key messages across all of our channels - websites, Twitter, Discord, YouTube, etc. With this clarity, we can much more easily spin up new channels that all align too. We will use this clarity to  speak with a unified voice to all of our audiences, thereby increasing awareness, comprehension & action. Please reach out to me directly if you have thoughts here! And know that we’re working on other ways to engage with the community on these topics outside of this gov forum as well! ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-19-2022/10737"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.864663198247535
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#8",
                    "likes": "2",
                    "time": "25/05/2022-11:22:00",
                    "content": "Hey guys thanks for writing all these down. In the Stewards council call, yesterday the 24th, we had a really nice discussion and had some suggestions, questions and reactions from all stewards present about both the Purpose and Essential Intents. Would it be possible to post a summary of it here? Perhaps @Pop you know? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.537037037037037
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#9",
                    "likes": "2",
                    "time": "25/05/2022-11:56:54",
                    "content": "Absolutely - Working on putting it all together! I want something quite visual so hopefully I can get it added here today   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#10",
                    "likes": "1",
                    "time": "25/05/2022-22:02:25",
                    "content": "    Jodi_GitcoinDAO:   Create and promote clear and engaging rituals, communication channels, and messaging that build shared context among GitcoinDAO’s contributors, stewards, and supporters.    Do we think that the goal of these “rituals, communication channels, and messaging” are just to build shared context?  Is a shared sense of momentum part of the goal too?   If context is a subset of momentum, then I’d propose the following revision:  Create and promote clear and engaging rituals, communication channels, and messaging that build momentum towards the DAOs essential intents among GitcoinDAO’s contributors, stewards, and supporters.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#12",
                    "likes": "5",
                    "time": "26/05/2022-11:22:11",
                    "content": "As promised, adding here the flow and takeaways from our Stewards Council session on Tuesday. The aims for the session were as follows:  The council understanding the process through which Purpose and Essential Intent was developed and the reasons it felt necessary at this time in the evolution of this DAO The council having an opportunity to share meaningful feedback on the Purpose and Essential Intent and continuing to evolve it into something useful & conducive to this DAO thriving  We specifically split the P&EI portion of the call in two stages and ran the session in Mural:  Record reactions, suggestions, and questions (via individual private mode brainstorm to enable unhindered honesty) Have an open conversation about Purpose & Essential Intent based on the recorded questions and reactions  Here are some of those questions and reactions by the members of the council (you can see full member list in the link above)  Screenshot 2022-05-26 at 11.56.381634×802 103 KB   Screenshot 2022-05-26 at 11.55.551316×622 67.1 KB  The questions were answered in the call (specifically the ones regarding bounties, hackathons, some of clearer definition of terms and further clarifications around structure) and the reactions broadly signalled an alignment at council level at the time of the call. I invite all council members to express and thoughts not captured in the screenshots above or in their inputs on the call. One main things to note with Essential Intent is that the time frame is meant to be 12-18 months. Once intents are completed, new ones may emerge and make the list. Nothing should be viewed as static and everything is designed to evolve as we continue to purposefully and collectively move forward. cc @lefterisjp @linda @tjayrush @bobjiang @Fishbiscuit @DisruptionJoe @austingriffith to tag but a few of the council. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.478882575757575
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#13",
                    "likes": "4",
                    "time": "27/05/2022-02:49:20",
                    "content": "Thank @Pop for the summarize, for the draft purpose of Gitcoin (mission) I still have concerns. regarding the draft purpose: To empower communities to build & fund their shared needs. It’s too broad and vague. Comparing with Google's mission is to organize the world's information and make it universally accessible and useful.  Broad - communities, when I see communities, and shared needs, it is too broad. Community could be alias of DAO, real community I live in, or other format of community (like community of practice, a group of people with same habits etc). From google’s mission, we can see it focuses on the world’s information, broad but specific. For shared needs it is also too broad. Vague - Communities, and shared needs are value as well. As above mentioned, what kind of communities Gitcoin would support? For shared needs, it is vague too, which leads the unclear questions. What questions Gitcoin should solve? But comparing with google’s mission, it’s clear that the potential question is current world's information is not well organized, and then not be accessed universally. So what questions are Gitcoin aiming at? I believe that community shared needs are not the question. The questions could be:  DAO’s governance process DAO’s compensation model  So I would suggest to rephrase the purpose like: To empower Decentralized Autonomous Organization (aka DAO) to make them flourish. – my 2 sato. ",
                    "links": [
                        "https://gov.gitcoin.co/t/discussion-series-evolving-the-gitcoin-brand-brand-personality-brand-voice-brand-tone/12316",
                        "https://gov.gitcoin.co/t/discussion-series-evolving-the-gitcoin-brand-naming-our-protocols-products/12500"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.181559917355372
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#14",
                    "likes": "4",
                    "time": "27/05/2022-20:02:35",
                    "content": "Great discussion so far about our purpose & essential intents. Lots of change over the years for sure!  From funding OSS to digital public goods to ? To me it seems the suggested draft phrase is more about what our clients will do (…build and fund their shared needs) and less about what Gitcoin will do (To empower…) I prefer expanding on the vague term ‘empower’ to present a clear picture about what Gitcoin is about.  Which to me is about allocating capital in a way which is so new and special it goes viral, and in a fraud-resistant way. For example, here is a quick attempt at a Purpose & Essential Intents statement which focuses on Gitcoin actions: To create and share the most effective, fraud-resistant  fundraising & allocation protocol on the planet. imo it is not necessary to explain what the clients/customers will do with the Gitcoin Product.  Much more critical to explain what WE will do…and for me ‘empower’ doesn’t actually tell the reader anything about what Gitcoin does.  We might as well say Gitcoin helps people help themselves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.925041228612658
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#15",
                    "likes": "4",
                    "time": "29/05/2022-19:01:50",
                    "content": "After reading the debates about Decentralized Society the last couple weeks on twitter, I think there is another rather large opportunity for GitcoinDAO as a ProtcolDAO. I therefore propose a 5th essential intent to GitcoinDAO: Passport Protocol (+ Growth)  Build a widely adopted, modular Pluralism Passport protocol that creates a flourishing ecosystem of network effects around Decentralized Society with Soulbound tokens, VCs, DIDs and ratings algorithms (starting with Sybil Resistance).  I think this essential intent would be supportive of the other Essential Intents (especially the Grants Protocol) and would allow us another highly valuable “shot on goal” as a ProtocolDAO at a time in which there is heat around DeSoc (and the QF heat has dissipated largely as QF/Gitcoin Grants has become a routine part of the ecosystem).   The opportunity here is quite large – given Vitalik/Glens championship of DeSoc, the “data => rating algorithm” pipeline is likely to be important infrastructure for the space. Open to feedback.  Esp from those working on POPP.  / @brent @kevin.olsen @lthrift @erich @DisruptionJoe Supportive of whatever the DAO decides.   Just felt like this proposal should be on the table. ",
                    "links": [
                        "https://twitter.com/ns_human/status/1530599279697358848",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-20-2022/10789"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5817226890756295
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#16",
                    "likes": "2",
                    "time": "30/05/2022-04:22:21",
                    "content": "   A model for Gitcoin sustainability   Gitcoin’s path to sustainability A 100 year purpose is the direction, but how do we set boundaries for how we focus our decentralized collaboration in the next year? Our essential intents are these boundaries. The CrossStream DAO Operations council (CSDO) includes the workstream leads from all of the “structured” workstreams. (There is still conversation to be had around which groups GitcoinDAO chooses to fund will be included as workstreams, though the conversation should be had soon to minimize mis-communication.) CSDO ratified these 5 essential intents plus I’m including the one suggested by Kevin afterwards. Grants Protocol (+ Growth)  Build a widely adopted, modular Grants protocol that creates a flourishing ecosystem of funding mechanisms.  Passport Protocol (+ Growth)  Build a widely adopted, modular Pluralism Passport protocol that creates a flourishing ecosystem of network effects around Decentralized Society with Soulbound tokens, VCs, DIDs and ratings algorithms (starting with Sybil Resistance).  Financial Sustainability  Have a comprehensive, diversified strategy for financial stability of the DAO in order to effectively achieve our mission.  DAO Organization  Create and promote clear and engaging rituals, communication channels, and messaging that build shared context among GitcoinDAO’s contributors, stewards, and supporters.  Grants Program  Enable a successful grants protocol launch by dogfooding it internally & supporting ecosystems in adopting it. Continue to support the Ethereum ecosystem & public goods in web3 and beyond through Gitcoin-led rounds.  To me, none of these are very good as essential intent because they are not clear and achievable. They are too high-level. Here are my suggestions for how we can use these intents to clearly move Gitcoin toward sustainability. SUGGESTIONS Launch and grow the components of a successful Grants 2 flagship protocol A successful grants 2.0 protocol is each of the components having been launched with well documented SDKs and clear growth metrics. The components include the fixed and modular components. Fixed components include the grants registry, the identity registry, and the round manager (pool registry). The round manager is where communities can choose their own “funding stack” of modular components. Standards, protocols, modular design, and composability all benefit evolutionary systems because it limits the design space so new builders can experiment where the most impact is available. A funding stack includes the user and grant moderation (regulation), the funding mechanism, and the discoverability of grants on the Gitcoin UI (only because it will be the only one at launch). These spaces are what will create the most innovation. Here are my essential intents for this objective.   Launch the grants registry, user registry, and pool registry (3 binary goals)  If these are completed it means we hit our base goal of shipping a flagship product (Could clear up the wording to indicate actual usage, but I don’t think semantics are the issue here)    Identify and set growth targets for each to use during season 15 (ie. 10k Passport non-sybil passport holders, 5000 grants on registry, $50 million in pooled funds)  Clear growth goals to be assigned to workstreams for accountability    Identify and set growth targets for 1 click funding stack permutations available (ie. 12 funding stack permutations)  The value proposition is that GTC will catalyze an increase in the accessible experimentation surface for any community to fund their shared needs. Growing this experimentation surface can be measured by permutations available on the Gitcoin UI for easy use by any community.    Improve the sustainability of Gitcoin The sustainability of Gitcoin requires capital contributors to continue seeing the velocity of GTC lower and innovative solutions shipped. This means the communication from contributors to stewards who control funding decisions is delivered in an effective way and that the contributors efforts are substantial. To do this Gitcoin must create a portfolio diversification thesis, a value capture thesis, and the roadmaps and tools to implement them. Diversification is simple actions and tools which can be handles by a delegated authority with oversight. Roadmaps and implementation are simply design and engineering. Value capture is unexplained at this point. Here I will attempt to connect this to my long intro. GTCs sole utility should be investing in workstreams, structured and unstructured, via Gitcoin governance. Gitcoin should use quadratic weighted staking to reward people for governance participation. The key is that the staked GTC would not only be eligible for voting to direct funding in GitcoinDAO, but it would also be used to participate in the governance of the components of the grants 2.0 protocol. Each component of the funding stack could launch its own token for economic rights without governance (or with some portion) of the participation in governance. For example, Gitcoin Passport would fuse with the sybil detection DAO concept and launch a token economy to incentivize the acceleration of network effects in its adoption. It could reward stamp providers used by reader apps based on how many uses the reader gets or by funds passed through it’s resistance algorithm. It could reward sybil hunters and data scientists in a model contest. The grants and pool registries could do the same in their own way. Then Gitcoin could invest in the first solutions available for the composable components such as a decentralized grant review protocol or a revenue generating business consulting communities on using the protocol. If this sounds familiar, it is the roadmap of ethereum ecosystem expansion. Gitcoin currently has a huge information asymmetry we can collectively take advantage of to bring sustainability. We are building a city and have first dibs on ownership of the public utilities (decentralized grants eligibility reviews) and private businesses (UI generation and round consultation as a service). The best part is the monopolies are ethical because they are openly accessible through Gitcoin. Maybe we monopolize most solutions and SALSA tax their value into future rounds… That said, here are my other essential intents:   Have > 2 years of runway in stablecoins & runway time is INCREASING  An R(n) growth rate over 1 means sustainability    Investments in Gitcoin built or used businesses & protocols > Gitcoin investments in non-gitcoin built or used businesses & protocols  Means we invest at least $100k in our own dogfooded solutions (ie workstreams become value capture factories)    Improve steward satisfaction score from x to y  Implication of needed communication & process fixes around this role    Improve contributor satisfaction score from a to b  Implication of needed improvements self scored by those in the role    In conclusion My intention here is to share my personal perspective and influence others’ thinking. I don’t intend to prescribe what is correct or incorrect, but rather to share the perspective I hold. I am HIGHLY aligned with the essential intents already proposed and would vote to ratify them to the DAO today.   There are a few references to “above” which is referring to the larger post that I made on a model for Gitcoin sustainability. ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-model-for-gitcoin-sustainability/10757"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.859127864005913
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#17",
                    "likes": "0",
                    "time": "30/05/2022-15:17:46",
                    "content": "    owocki:  If context is a subset of momentum   Not sure if context is a subset of momentum. Momentum works toward a certain moment in time afaik and context is an ongoing process, so in my logic momentum can be part of the ongoing context we are building? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.910714285714286
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#18",
                    "likes": "1",
                    "time": "30/05/2022-15:24:00",
                    "content": "    owocki:  Passport Protocol (+ Growth)   As this is part of what already exists in the Grants protocol roadmap, maybe it could just be a second point under grants protocol (+growth)? On top of this the essential intents are ratified (draft language) and I do like that we have some clear focus atm - the protocol we are building as gitcoin is Grants, and a module within this is POPP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#19",
                    "likes": "0",
                    "time": "30/05/2022-18:25:40",
                    "content": "    krrisis:  maybe it could just be a second point under grants protocol (+growth)?   open to that. my thinking for making it a top level essential intent is that i’m increasingly thinking that sybil resistence/DeSoc is as big of an oppy as Grants 2.0. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#20",
                    "likes": "1",
                    "time": "30/05/2022-23:15:16",
                    "content": "Just read lefteris’ summary and I’m sure it will be. But in the logic of us wanting to focus as a DAO and make our mission not too complex for the outside world (and also not deviate too much from the already ratified intents) it might be good to stick with the ones we already proposed, and just add this under grants 2.0. Just my 2 cents ofc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#21",
                    "likes": "2",
                    "time": "01/07/2022-17:12:36",
                    "content": "Link to the post with the ratified version here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "109"
}