{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/increase-developer-engagement-on-gitcoin-platform/9080",
            "title": "Increase developer engagement on gitcoin platform ",
            "index": 9080,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Aveesh52",
                    "index": "#1",
                    "likes": "22",
                    "time": "18/11/2021-12:38:03",
                    "content": "The gitcoin ecosystem has 311,668  active developers currently. 71K twitter followers.The number of views on videos on gitcoin media is like 123 views. We need someone who can handle social media side of things Gitcoin is not able to market its idea of “Quit your job and work for the open internet” on multiple channels. We have should have marketers who go on different media channels speak on gitcoin mission on open-source contribution and public goods funding. We leverage other community-based startups like Opendefi that we already have partnerships with and education platforms like ethernautDAO to grow the community. Also sending out merch to regular contributors is a great idea github did this in its early days. Also partnering with other Blockchains like Solana , Avalanche , Harmony , Algorand which already have ecosystem funds available would draw their community to our platform. Also, we should encourage more physical hackathons and engage with the community than doing it mostly on the internet. ",
                    "links": [],
                    "GPT-summary": "The author of the proposal is explaining how to increase developer engagement on the Gitcoin platform. They suggest leveraging partnerships with other community-based startups and education platforms, partnering with other blockchains, and encouraging physical hackathons. The author also suggests marketing Gitcoin's mission on open-source contribution and public goods funding on multiple channels and sending out merch to regular contributors. A 3rd party could give constructive criticism, extend to the proposal, advertise the proposal, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/codingsh",
                    "index": "#2",
                    "likes": "2",
                    "time": "18/11/2021-20:50:29",
                    "content": "This proposal is very good, the ideal is to interview the blockchain marketing guys and what they are currently doing, building a DAO for marketing is interesting too. So the discovery formula can be used to power blockchain service sites… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.887500000000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/huofu",
                    "index": "#3",
                    "likes": "0",
                    "time": "21/11/2021-01:52:38",
                    "content": "I have a deep hobby of blockchain and hope to be recognized by the community. I can help this network gradually announce the team and support it for a long time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/0xAA",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/11/2021-06:54:46",
                    "content": "I agree, we need more marketing moves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/thelostone-mc",
                    "index": "#5",
                    "likes": "5",
                    "time": "22/11/2021-08:05:30",
                    "content": "Yup we def could up our marketing game! I’m wondering if it makes sense for this initiative to be a part of MMM workstream and maybe we start with one piece and see how we can up for marketing game. @Aveesh → do you have a document which we could pass along to @Fred and see how if we have the scope / ability to get this kicked off. Right now from what I’ve seen, while everyone agrees this is needed, we lack someone who’d be able to lead this initiative and given that you brought this up. I’m hoping you could play a role in this (assuming you are interested + got the bandwidth) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.135714285714286
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/okeaguugochukwu",
                    "index": "#6",
                    "likes": "0",
                    "time": "26/11/2021-01:10:08",
                    "content": "this is a nice idea.  gitcoin is always getting better ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                }
            ]
        }
    ],
    "group_index": "613"
}