{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/poap-edition-gitcoindao-digest-23-2022/11004",
            "title": "POAP Edition! GitcoinDAO Digest #23 2022 ",
            "index": 11004,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "contributors",
                "stewards",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#1",
                    "likes": "2",
                    "time": "25/06/2022-03:58:51",
                    "content": " 1600×381 61.7 KB  Thank you to all contributing to GR14! This was a spectacular round that made Gitcoin History!  If you would like to receive this newsletter in your inbox, sign up here!  Key actions for this week:  Earn a POAP for helping FDD to test new software for reviewing grant applications. Stroll down memory lane with GitcoinDAO’s First Year-in-Review and also see what big things we have on the horizon.    Hot Topics:   Jodi shares nuanced updates to GitcoinDAOs Adopted Purpose and Essential Intents like removing ‘build’ from the purpose to simplify it to: ”To empower communities to fund their shared needs.” She also announces that the CSDO ratified these statements: “It’s really important to state here that this is a beginning, not an end. As GitcoinDAO grows, the essential work will change with it. With that said, we hope the statements provide all contributors a clear sense of the direction we’re all building toward.”   In Passport is our AWS, Owocki compares AWS, a trojan horse hiding within the Amazon store to Gitcoin Grants hiding Gitcoin Passport. With this post, Owocki emphasizes how large the opportunity will be for a Sybil resistance or DeSoc identity primitive that drives a shift from 1-token-1-vote to 1-human-1-vote. He also shares that Greenpill podcast season 2 will likely focus on Sybil resistance and asks who he should have on.   The Network Effects of GitcoinDAOs protocols by Owocki points out that network effects scale exponentially to increase growth and this applies directly to Gitcoin grants’ funders and projects. He proposes that Gitcoin consider bootstrapping some of the early, cold start days of Gitcoin Passport to make sure the user base scales to a critical mass to keep growing on its own.    Remove Lifetime funding received from Gitcoin Grant page from Lefteris claims the lifetime funding number for a grant creates a tax liability, is “wrong and by a big margin”, and excludes grants from ecosystem rounds because the token prices have fell since the time of donation. Connor asks if Lefteris has any data he can share, verify that “the price tokens were received at is what matters most” for tax purposes, and shares that ecosystem rounds (like ENS) set their own rules.   In Gitcoin Accelerator Program → GTC utility, Puncar outlines his belief that “every organization needs to have a long-term sustainable economic model that creates more value than it consumes.” He proposes a Gitcoin Accelerator Program whereby the early-stage projects on Gitcoin Grants would be provided support that could turn into DAO revenue later on. Saf responds to share from his experience running an accelerator at Protein: “I support this idea in theory if we were still in an abundance mindset (and would love to revisit when we go back there), I think it’s too big of an undertaking for the current climate.”     GitcoinDAO Governance Overview: Snapshot polls GTC Holders and Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, move on to Tally after being ratified on Snapshot.     Proposal Discussions Active Proposals Latest completed proposals     Upgrading the Gitcoin Governance Contracts     Improve GTC Liquidity with Tokemak      Carbon Neutral Policy at Gitcoin     Gitcoin Treasury Diversification Update        Workstream Discussion    Public Goods Funding    We’re so happy with the turnout for GR14! Our contributors really showed up. With over 44k unique grant funders contributing over $1.7 million, we had the highest numbers we’ve ever had!   We’re locking in commitments for GR15 and mutual grants partnerships. Our contributors will be discussing a Public Goods coalition and making connections during NFT.NYC.     Moonshot Collective    Gitcoin Passport: We’ve been squashing bugs and upgrading nodes   Governance Operations Scaling: Our team has been researching, meeting, discussing, and has landed on focusing on three key items:  Process for non-binary funding of workstream season budgets Improvement of deep discussions and coordination for budget proposals Improvement of context sharing.    Operations: The collective completed an expedited peer-review process and shipped an updated notion page, including a refined mission statement: “Moonshot Collective is an open and diverse network of builders, hackers, and regens. We focus on experimentation and innovation that advances the purpose and essential intent of GitcoinDAO.”     Fraud Detection & Defense (FDD)    Community Intelligence: We conducted an analysis to determine if our trust bonus weightings are optimal. The analysis required running 3.7 billion calculations and over three days of computing time. We were able to show our weightings were not optimal and determine a better method to optimize.   Grants Intelligence Agency: All open disputes and appeals will be closed before Tuesday, June 28th. We are using an Ethelo instance to help us decentralize decision-making and amplify community voices.   Data Operations: We’ve been focused on the Sybill Account Detection (SAD) model to run daily predictions in close collaboration with human evaluation. We analyze the results of training and running the model to resolve bugs and extract usable data.   Operating System: We passed a proposal to make our S15 process clear by aggregating resources into a single document. We’re engaged in a greater DAO discussion regarding contributor compensation.     Merch, Memes & Marketing    Our brand marketing and content strategy teams have been hard at work on building a handbook to guide the future direction of our brand content. We’re pleased to share today that the MMM Content Handbook has a v1 complete to guide streamlined & decentralized content creation.   Did you know it’s already been a year since the launch of GitcoinDAO and GTC? We’ve taken some time to reflect on the past year and what we hope the coming one will bring. Check out our very first GitcoinDAO Year in Review, hot off the presses!   Operationally, we completed a first draft of a new MMM compensation model and kicked off the sprint of “v3” of our Steward Health Cards.   In order to make sure GR14 ends strong, we held Fundapalooza on Thursday at 7pm UTC and were joined by over 500 live internet regens! We’re tallying up the final count on the round but it looks to be our most successful round EVER!      DAO Operations    CSDO: This week, we discussed how the budget process for S14 went and agreed we want to identify a better process for S15. We passed a proposal to delay S15 budgets by 1 month and are discussing 6-month budgets with a 3-month check in. We also talked about organizing around protocols, sybil defense, socializing interworkstream initiatives, and a budget proposal for the Gitcoin Product Collective as it spins out of holdings.   We’re discussing season 15 timeline with our stewards and an updated budget proposal flow.   We’ve developed a DAO-wide spending report and planning to publish it with a regular cadence. Stay tuned for more!     Grants 2.0    Gitcoin Passport: In collaboration with the Moonshot Collective, we are stabilizing our ceramic node infrastructure to support the heavy user inflow we saw during GR14   Grants Hub: We’re excited to announce we are 100% dev-complete with our MVP! In the next couple of weeks, we’ll be getting production-ready to meet our July 1st deadline.   Round Manager/Explorer: Check out our first demo! While building this steelthread, the team has also been hard at work defining milestones and subtasks for building out our first MVP by July 5th.   Find more details in our weekly update thread.     Upcoming community events    Drop in on our weekly DAO Vibes on Wednesdays at 4:00 PM UTC on Discord! We have been seeing great attendance and engagement and we would love for you to join us.   Community Onboarding Call! New to Gitcoin? The next event will be Monday, July 4th from 5:00 to 6:00 PM UTC. We’ll tell you all about how we’re organized and how you can become an active contributor. If you haven’t applied, do this first!     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our notion page.   Have you already applied but have yet to join a Gitcoin workstream? Start here to learn more about where you might fit in.   Previous edition ",
                    "links": [
                        "https://gitcoin-grant-disputes.ethelo.net/page/welcome-to-the-gia",
                        "https://gitcoindao.com/yearinreview/yir.pdf",
                        "https://gov.gitcoin.co/u/jodi_gitcoindao/summary",
                        "https://gov.gitcoin.co/t/update-gitcoindaos-adopted-purpose-and-essential-intents/10984",
                        "https://gov.gitcoin.co/t/passport-is-our-aws/10995",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/the-network-effects-of-gitcoindaos-protocols/10973/2",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/proposal-remove-lifetime-funding-received-from-gitcoin-grant-page/10981",
                        "https://gov.gitcoin.co/u/lefterisjp/summary",
                        "https://gov.gitcoin.co/u/connor/summary",
                        "https://gov.gitcoin.co/t/gitcoin-accelerator-program-gtc-utility/10967",
                        "https://gov.gitcoin.co/u/puncar-dev/summary",
                        "https://gov.gitcoin.co/u/safder/summary",
                        "https://gov.gitcoin.co/t/upgrading-the-gitcoin-governance-contracts/10721",
                        "https://gov.gitcoin.co/t/improve-gtc-liquidity-with-tokemak/10725",
                        "https://gov.gitcoin.co/t/proposal-carbon-neutral-policy-at-gitcoin/10823",
                        "https://gov.gitcoin.co/t/gitcoin-treasury-diversification-update/10932",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://gitcoin.notion.site/e79f1dd9e5074a1d986ee3f91b12943e?v=74372375b4ba42ebb269be219f2c452d",
                        "https://gitcoin.notion.site/5627564cce204a0f8ae5af463873bb3d?v=2510b1a2634b4a0ea24cf2b81241d13a",
                        "https://gitcoin-grant-disputes.ethelo.net/page/welcome-to-the-gia",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://miro.com/app/board/uXjVO0BktOo=/?share_link_id=473865239855",
                        "http://gitcoindao.com/yearinreview",
                        "https://gov.gitcoin.co/t/gitcoindao-year-in-review/11003",
                        "https://www.daostewards.xyz/",
                        "https://gitcoin.notion.site/DAO-Ops-84f425e281ae49579a2b4acf0bad5dd5",
                        "https://www.notion.so/gitcoin/Grants-2-0-f2860138cbb24505b5cb2d8576119a78",
                        "https://drive.google.com/file/d/1LyAuPQgzwkx_MRsV3_5DIdzjYkZ00z9Q/view?usp=sharing",
                        "https://share.vidyard.com/watch/ceKWmWCmMERDewqWn2sq1Q?",
                        "https://gov.gitcoin.co/t/weekly-grants-2-0-update-2022-6-7/10835",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://calendar.google.com/calendar/u/0/r/eventedit/copy/NWo3ODBxdmpmOHJ1ZGZqYnRxa3I2ZzhwdGhfMjAyMjA2MjJUMTYwMDAwWiBjX3R0NGczOGE2NnVtam1lcTE1NGFnY3AyZDRzQGc",
                        "http://gitcoin.co/discord",
                        "https://calendar.google.com/calendar/u/0/r/eventedit/copy/Mm00bzZjdjg2YmhwcGZwb2toMXMybGpwNDJfMjAyMjA3MDRUMTcwMDAwWiBjX3R0NGczOGE2NnVtam1lcTE1NGFnY3AyZDRzQGc",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com/",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "http://gitcoindao.com/",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-22-2022/10972",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24-2022/11060"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.767679646004114
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#2",
                    "likes": "1",
                    "time": "27/06/2022-01:01:13",
                    "content": "Here is Chinese version. 中文版本如下：   Notion    Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. A new tool that blends your everyday work apps into one. It's the all-in-one workspace for you and your team      ",
                    "links": [
                        "https://bobjiang.notion.site/GitcoinDAO-23-2022-ddf5d7d1cc304085974ddede22ca4244"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.893939393939394
                }
            ]
        }
    ],
    "group_index": "146"
}