{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/waiting-6-months-for-an-impersonator-project-of-our-legitimate-project-to-be-removed-has-stolen-approx-1k/12163",
            "title": "Waiting 6+ months for an impersonator project of our legitimate project to be removed. Has stolen approx 1k ",
            "index": 12163,
            "category": [
                "\\xf0\\x9f\\x8c\\xb1 Grants"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/polarpunklabs",
                    "index": "#1",
                    "likes": "3",
                    "time": "29/11/2022-22:31:54",
                    "content": "Hi folks, I have written a number of times about this in Discord, but we have had a project that is impersonating ours for 6+ months and has stolen about 1k from Gitcoin users (and in a roundabout way taken funds for us). Our legitimate project (created first, is this hard to check?): Defining Web3: An Off-Chain Collective Research Project | Grants | Gitcoin The fake one: Defining Web3 | Grants | Gitcoin I have reported this project a couple of times now to both Gitcoin and Github and am told it will be addressed in Discord, but then hear nothing. As a last resort I am bringing it up here. One to highlight the specific problem and two to show how difficult it can be as a grantee to get your voices heard about people copying your project. ",
                    "links": [
                        "https://gitcoin.co/grants/5514/defining-web3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Privacy, Security and risk management",
                        "Law and regulations",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.131944444444445
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "5",
                    "time": "30/11/2022-18:16:23",
                    "content": "Well this is embarrassing. Our communications between support and FDD which deals with fraudulent impersonation were not up to par. I will be looking into making sure this doesn’t happen again. I found your message to support a few months ago and then there was one a couple weeks ago. I don’t have any insight as to why the ball was dropped at this time. It is fixed now and the fake grant is deactivated (but still visible if you go directly to the link). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#3",
                    "likes": "2",
                    "time": "30/11/2022-22:29:28",
                    "content": "Apologies that this took so long to address. If it’s any consolation, it appears this grant never received any donations or matching funds:    Defining Web3 | Grants    Defining Web3 | Grants 25 leading university researchers describe their vision for Web3 by exploring next-generation publications with NFTs, quadratic crowdfunding, textual gamification, and new models of the digital commons.  Overview: The Off-Chain Collective is a group...         Ethereum (ETH) Blockchain Explorer    Address 0x27180eb5f52D2AaaA5d268A1b5C910fD9dFc7DF4 | Etherscan The Address 0x27180eb5f52D2AaaA5d268A1b5C910fD9dFc7DF4 page allows users to view transactions, balances, token holdings and transfers of ERC-20, ERC-721 and ERC-1155 (NFT) tokens, and analytics.       Screenshot 2022-11-30 at 5.28.50 PM764×560 28.7 KB  ",
                    "links": [
                        "https://gitcoin.co/grants/5514/defining-web3",
                        "https://etherscan.io/address/0x27180eb5f52D2AaaA5d268A1b5C910fD9dFc7DF4",
                        "https://etherscan.io/address/0x27180eb5f52D2AaaA5d268A1b5C910fD9dFc7DF4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1439393939393945
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/polarpunklabs",
                    "index": "#4",
                    "likes": "2",
                    "time": "01/12/2022-09:57:40",
                    "content": "That makes me very happy! It’s not a major deal to us as Uni Profs, but I hated the idea of people donating to someone who just set up a page. As always, Gitcoin rocks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.947916666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/polarpunklabs",
                    "index": "#5",
                    "likes": "2",
                    "time": "01/12/2022-09:58:37",
                    "content": "Thanks Joe! If anything I think the benefit of our case means this has been highlighted. I do feel from the other perspective it’s a little hard to get your voice heard in this scenario, so it might be worth discussing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.945833333333333
                }
            ]
        }
    ],
    "group_index": "251"
}