{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/prototyping-workstream-moonshot-budget-request/8074",
            "title": "Prototyping Workstream (\\xf0\\x9f\\x9a\\x80 Moonshot) Budget Request ",
            "index": 8074,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/austingriffith",
                    "index": "#1",
                    "likes": "13",
                    "time": "29/07/2021-19:27:49",
                    "content": "Hey everyone, This is a request to fund the Moonshot Collective with GTC from GitcoinDAO Treasury for the next 3 months. The moonshot collective is a collection of builders & web3 community members who are looking to prototype experiments in coordination (whether thats public goods, private goods, governance tools). By funding the moonshot collective, we’re creating a cryptoeconomic force for builders in the space to create tools for GitcoinDAO and the ecosystem at large. We have already started building a few starter kits and demoed them during our first call. We need to start funding developers. We’ve put together a budget which asks for 40k GTC, with a breakdown as follows;   Decentralized Rewards - 30k GTC Decentralized Rewards for contributors , deployed via a tool like CoordinAPE, decided upon by the workstream. The objective here is to create bottoms up leadership in the workstream and DAO. Deliverable: 2-4 new coordination tools for the DAO  Scholarships - 2.5k GTC What: 25 x 100 GTC scholarships for members of the BUIDL GUILD who are building modular components on scaffold.eth, which will accelerate the pace of innovation in the space. Deliverable: Up to 25 new components built in scaffold.ETH.  Ops Slush Fund 7.5k GTC Will be deployed to those who help herd cats (build website, run comms) for the workstream. Deliverable: a more organized, tightly communicated, moonshot collective execution.  We propose that the funding be deployed to 0x230Fc981F7CaE90cFC4ed4c18F7C178B239e5F9F - a multisig of the Moonshot Collective Workstream Owners. Along with the Moonshot Collective Gitcoin Grant, this budget will allow us to meet our objective of supporting rapid prototyping in the space and in GitcoinDAO. Signed, @AustinGriffith  @Owocki  and the rest of the Moonshot Collective. ",
                    "links": [
                        "https://gitcoin.co/grants/3004/moonshot-collective",
                        "https://gov.gitcoin.co/t/ecosystem-mapping-discussion/8123",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-9/8422",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-7/8229",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-5/8075"
                    ],
                    "GPT-summary": "The post is a proposal by the Moonshot Collective to fund their workstream with GTC from GitcoinDAO Treasury for the next three months. The collective aims to prototype experiments in coordination, create tools for GitcoinDAO and the ecosystem at large, and accelerate the pace of innovation in the space. The proposal outlines a budget breakdown for decentralized rewards, scholarships, and an ops slush fund. The authors of the proposal are asking for funding to be deployed to a multisig of the Moonshot Collective Workstream Owners.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.426323676323676
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Yalor",
                    "index": "#2",
                    "likes": "6",
                    "time": "30/07/2021-21:46:30",
                    "content": "100% support this proposal being funded by the DAO, I’ve see nothing but great things coming from MoonShot  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "1",
                    "time": "02/08/2021-16:27:37",
                    "content": "Providing budget for Moonshots is what Gitcoin is all about. Let’s normalize funding great initiatives and doubling down when they deliver! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.513888888888889
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#4",
                    "likes": "1",
                    "time": "05/08/2021-17:20:16",
                    "content": "Love the mission, in particular IMO the scholarships would be a huge win I’m glad that was considered. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.366666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#5",
                    "likes": "0",
                    "time": "09/08/2021-17:43:30",
                    "content": "I really like the idea of the moonshot collective. Think it can achieve awesome things and bootstrap cool projects. I generally support it. But would also like to see some metrics for success. So what kind of milestones achieved would you consider success and how would you evaluate them? Some ideas. Perhaps count and showcase the projects done by the scolarships? Have them showcase their work? For the 30K GTC budget for new tools the deliverables would be the new tools, but who and how would evaluate them and determine that they are indeed useful? Actually that point was a bit confusing for me. What’s the point of the first bullet point? To build tools? Or to use existing ones? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.2779720279720275
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/austingriffith",
                    "index": "#6",
                    "likes": "1",
                    "time": "09/08/2021-18:30:52",
                    "content": "Yeah 100% good feedback. I think a lot of this is figuring it out as we go so we haven’t tried to be super explicit about goals yet. The north star is to bring devs in, fund them, and mentor them toward building coordination and public goods funding mechanisms. To speak to that a bit more, we’ve realized that really forkable starter kits act as “dapp generator functions”. I think a very first milestone should be to create a few coordination/dao starter kits. A theory we have is that coordination/DAOs don’t need a complex and specific smart contract to start, but rather a generic gnosis safe with a custom frontend. This is the very first thing we are already started building! During the first call a dev demoed their pitch/progress for a moloch dao starter kit too. Basically, Owocki and I are steering the overall direction and we are pushing toward these generic coordination starter kits/ tools. BUT! Build #3 that we have already started is exactly this coordination tool: a way for us to add all the possible projects and let the community weigh what they think is important and we quadratically fund builders based on that community signal. SO, TLDR, right now we have a north star and we are evaluating them in a centralized way to bootstrap the group, but very soon we will be dogfooding our own apps to quadratically signal/fund projects. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.060132575757575
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/08/2021-19:12:13",
                    "content": "Thank you for the response Austin. Let me process this a bit. I would personally be interested on this custom gnosis safe with a frontend. Sounds like something useful to play with. Would also like to eventually see the coordination tool from Build #3 and play with it myself too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tenfinney",
                    "index": "#8",
                    "likes": "0",
                    "time": "12/08/2021-14:34:18",
                    "content": "    lefterisjp:  custom gnosis safe with a frontend   This ^^ and this very much >> really \"forkable starter kits act as “dapp generator functions”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                }
            ]
        }
    ],
    "group_index": "540"
}