{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/roadmap-to-network-utility/10546",
            "title": "Roadmap to Network Utility \\xe2\\x9a\\xa1\\xef\\xb8\\x8f ",
            "index": 10546,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "10",
                    "time": "09/05/2022-16:24:46",
                    "content": "I have seen a few threads about “What does GTC do?” and “What does the network do?” and so I want to synthesize the latest thinking on the roadmap. IMPORTANT: Nothing in this thread constitutes a promise to build anything.  It is up to DAO Governance to ratify what it wants to build/fund. As you recall from the launch post, GTC is governance token that can be used to ratify proposals via the Governance process.  “GTC is a governance token used to oversee the Gitcoin ecosystem. It has no claim on financial rights.” But what utility does it have beyond that? Here are the two utility thesis’ I’m aware of that the DAO working on right now:   Protocol Governance Utility - By creating a widely used protocols, and then adding utility for GTC into those protocols, the network could gain utility over time as those protocols become more widely adopted.  Meta-Governance Utility -  Through its work in Quadratic Funding via Gitcoin Grants, GitcoinDAO gains a signal of what is up & coming in the ecosystem.  This creates an unfair competitive advantage insofar as GitcoinDAO finds out about the hottest new projects before anyone else.  By doing Mutual Governance Rights Grants with these projects, Gitcoin could be a powerful meta-governor of the ecosystem over time.  I will break down my understanding of each of these thesis below:  Protocol Governance Utility By creating a widely used protocols, and then adding utility for GTC into those protocols, the network could gain utility over time as those protocols become more widely adopted. The protocols that GitcoinDAO is working on right now are   Grants 2.0 - a grants registry protocol Proof of Personhood Passport - a sybil resistance protocol  One could imagine that in the future, network utility could be baked into these protocols  A GTC Voting App to help distinguish which grants are quality from those that are not. A GTC Voting app which helps to distinguish which pseudonomanous identities are sybil and those that are not.   Meta-Governance Utility Through its work in Quadratic Funding via Gitcoin Grants, GitcoinDAO gains a signal of what is up & coming in the ecosystem.  This creates an unfair competitive advantage insofar as GitcoinDAO finds out about the hottest new projects before anyone else and over time builds a network of projects peer to peer supporting each other.  By doing Mutual Governance Rights Grants with these projects, Gitcoin could be a powerful meta-governor of the ecosystem over time. The most famous examples of successful projects that Gitcoin has funded in the past  Uniswap Yearn 1inch Wallet Connect  What would it look like to find projects of this caliber in upcoming cycles & to do  Mutual Grants with them before they become phenomenons?  Feedback welcome I am just one node in the Gitcoin network.  If you have other ways that you see GTC creating utility for it’s holders, please comment below! Looks like one other thread has been posted on the topic as well: The Utility of GTC ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v3/10358",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
                        "https://gov.gitcoin.co/t/gtc-conviction-voting-dapp-gtc-utility/10523/2",
                        "https://gov.gitcoin.co/t/gitcoindao-as-a-generator-function-for-coordination/10078",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://gov.gitcoin.co/t/the-utility-of-gtc/10071",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17-2022/10597",
                        "https://gov.gitcoin.co/t/what-would-a-lean-effective-gitcoin-look-like/10540/9",
                        "https://gov.gitcoin.co/t/what-would-a-lean-effective-gitcoin-look-like/10540/4",
                        "https://gov.gitcoin.co/t/s15-proposal-integrated-moonshot-collective-budget-request/11214/18",
                        "https://gov.gitcoin.co/t/where-is-the-fire-around-this-fire/10664",
                        "https://gov.gitcoin.co/t/gitcoindaos-final-form-maximum-coordination/10605"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.674572627193594
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/erich",
                    "index": "#2",
                    "likes": "6",
                    "time": "10/05/2022-11:24:59",
                    "content": "I’d be interested in utilizing GTC and other community governance tokens to measure Quadratic Funding contributions in a Gitcoin Grants ecosystem by a shared denominator. For example, GTC could be the only accepted unit of account for Gitcoin Grants main rounds. Likewise, ENS could be the only accepted unit of account for ENS rounds. UNI for the Uniswap rounds. MATIC for the Polygon round. Et cetera. So to get main round matching on a contribution to a project on Gitcoin Grants, you’d need to contribute in GTC. In a nutshell, in Gitcoin Grants, people would utilize community governance tokens for governing the Quadratic Funding matching pools related to their communities. The governance token would be the only unit of account accepted for matching-eligible Quadratic Funding contributions. This requirement is easy to ensure because currently, the Gitcoin Grants Quadratic Funding contributions all happen on-chain, enabling the special status of the governance token to be hard-coded. Why bother? Besides adding utility to the governance tokens in Gitcoin Grants, there are some serious issues related to the current setup. Currently, we nearly accept every Ethereum-based token as units of account, including the most universal forms of account like US-dollar pegged stable coins, bitcoin, and ether. These features lead to a) weird incentive shifts and b) extreme power inequalities. Weird incentive shifts: Accepting multiple units of account and even coupling contributions to multiple matching funds adds incentive complexity that we haven’t thoroughly analyzed yet. Based on what unit of account and value do we usually denominate the contributions? Do we have reliable oracles to scale the value denomination? What are the social benefits of accepting multiple currencies? Does it align with the values of our community? Does it confuse the community? Extreme power inequality: @anoanoano proposed a new community currency design to recognize and foster wealth in a more meaningful local context than universal currencies. He explains the various troubles with exitocracy that more universal units of account like USD, EUR, BTC, and ETH enable.  Put simply, money makes it easy to uproot power accrued in one community, and transplant it to another. Let’s call this capital exit . Capital exit is how mud gets tracked into the house; it is how the language we speak with our enemies becomes the language we speak with our friends. When anyone who accrues power within our community can cheaply remove it, we can no longer assume that our community will return what we put into it. This makes us lose faith in the process of mutual aid – the idea that what we give to others will come back to us. And without a commitment to mutual aid, we lose the reason behind our reverence for the norms of justice, accountability and legitimacy that constitute our communities. This is a devastating value destruction, in every sense of the word value. The trust and norms that prevail within communities unlock uniquely rich and productive forms of cooperation. They are the source of enormous power. Therefore – returning to the idea of observer effect – money as a universal unit of account actually diminishes precisely the community-based power that it purports to measure. … Traditional money, and indeed traditional private property, has a kind of forgetfulness. It stores no information about where it came from, and in a way, asserts that its provenance is irrelevant. However, this ahistorical quality is a moral fiction. The value of land was always co-created over time by people other than its owners. Profit taken from a business always owes something to the loyalty and sacrifice of customers and employees. If money (and other forms of private property) had memories, these memories would reveal that ownership and wealth is always co-created and underwritten by a community (or communities). Any economic institution – including a currency – that intends to support the social fabric upon which it depends must respect this fact.  Prewitt’s post is a cohesive diagnosis of issues with universal money and a prescription for more plural money that, among other things, would require:  Formalized community membership accounts, Democratic community currency governance, Governance of real-world assets through community currencies, Dynamic community currency exit taxes.  It might take a significant effort to build the features needed to achieve this valuable vision. In the meantime, single-token matching-eligible contributions in Gitcoin Grants (e.g., GTC for main round matching eligibility) might get Gitcoin one step closer to it. In any case, I’d be delighted to break down Prewitt’s more comprehensive picture of plural money into actions and strategies related to governance tokens like GTC and their intersections with Quadratic Funding ecosystems. For example, another step might be to tax Gitcoin Grants recipients who want to send out their GTC received in the main round to accounts other than verified main round contributors and projects. This process might work similarly to the follwing prescribed by Prewitt. (Note that CC stands for community currency.)  … CC transfers to non-community members are taxed quadratically, in the following way. The amount of wealth a transferor has, not the amount they’re transferring out, determines their quadratic exit tax rate . Suppose someone has 100 units of CC wealth … . The square root of 100 is 10. 10 thus becomes the number by which any removal is divided. So, if a person with 100 CC wealth wishes to transfer 2 units of CC to a non-member of the community, it will cost them 20. The other 18 will go into the community treasury.  The logic here is that the more wealth a person has within a community, the greater their obligations to the community, and the greater the cost to the community when they remove it. This steep exit tax is mitigated if you are transferring from one community to a member of a second community that has substantially overlapping membership. Thus, if community A and community B have 75% identical membership, then all else being equal, only 25% of a transfer from a member of A to a member of B is taxed like an external transfer.   To the latter point, dPopp and Grants Hub might enable us to track contributor and project memberships in Quadratic Funding ecosystems in terms of what matching rounds somebody contributed to and what matching funds a project is eligible for. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Observer_effect_(physics)"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.265957898310839
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/michaelgreen06",
                    "index": "#3",
                    "likes": "3",
                    "time": "11/05/2022-17:57:00",
                    "content": "Super interesting ideas @erich! On the point of taxing the GTC withdrawals, I wonder if that would incentivize projects to use a different grants platform that doesn’t tax withdrawals? Would withdrawing GTC and converting it to USDC so you can pay real world expenses trigger this tax? @owocki I am in favor of all of your proposed ideas and don’t have anything else to add at this point. I will be thinking about other possible solutions moving forward though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lunacat",
                    "index": "#4",
                    "likes": "2",
                    "time": "12/05/2022-23:23:43",
                    "content": "Thank you for starting this discussion.  With the Great Bear here and workstream budgets getting scrutinized with an eye on ensuring they are focused on making a direct impact to the protocol, this seems like a ripe area for one of the workstreams that may be a little off track to pick up to ensure their long-term funding.  I hope a team like Public Goods explores this seriously, as seems directly relevant to supporting the sustainability of their mission. Like it or not, GTC is equivalent to equity in the GitcoinDAO, and the DAO is funding its contributors purely through what amounts to stock based compensation 2.0.  For this to be sustainable, GTC holders need to have ownership in what the contributors create.  Governance rights is one form of ownership, and I love ideas mentioned here to that end.  But frankly, the market is showing that governance rights are not enough for GTC holders to sustainably support workstream budgets. Off top of head, these are some simple ideas on why people might want to hold GTC:   Staking – pretty obvious, see Giveth’s Givfarm.  Gitcoin should have had this yesterday.   Governance – see the great ideas mentioned in earlier posts here.  Gitcoin was a trailblazer in how it made claimers delegate from onset, which helped foster this great forum we see here.  But this had counter of making those who delegated to totally check out.  How to make governance cool?  What parts of the rounds can be outsourced or set by regular GTC holders?  Could wallets that have held x amount of GTC over y period of time be given higher matches?  Could projects that receive funding by GTC be incentivized to hold GTC as part of their reserves?  Governance also ties into …   Virtue signaling – Gitcoin is a great brand, and it’s safe to say pretty much everyone in Ethereum community is in violent agreement that funding public goods is cool.  Being an owner in the Gitcoin protocol should be a sign of pride and something people want to show off.  The comic and ethbots were a great step in this direction, but reach was fairly limited.  How to build on this momentum?  Virtue signaling is also very present in voluntary carbon markets, is there something to explore there (eg creating carbon pools limited to GTC holders)?  Need to think of this beyond just launching PFP projects or creating cool t-shirts/memes that don’t really leave the existing community.  Which leads to…   Outreach – Gitcoin has a great story to tell and represents what is good about crypto and web3.  This story is only being told to its existing supporters.  Gitcoin’s brand and mission has immediate appeal to corporations jumping on the ESG bandwagon, not to mention elected officials and regulators looking for any reason to support crypto as more than just ponzi schemes.  Gitcoin needs to prioritize expanding its brand beyond its existing community, we are fine there.  Gitcoin should be the first and immediate reference point that the NYTimes, Capitol Hill, and whatever tradfi/web2 company thinks of when asked “what good has crypto ever done?”.  Expand mind share outside of this circle, and there will be demand for the token that provides ownership.   Just a few hot takes to try and get ball moving a bit… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.181224120082815
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/05/2022-17:28:35",
                    "content": "One thing i have been thinking about today is the developer community for the DAO and how there are a lot of folks looking to recruit talent from our contributor community. I wonder what a staking mechanism would look like here? stake some gtc that linearly unlocks over time and if they decide not to fill the role the funds go to the dao? Posting this here so i hold myself accountable to think about this more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/05/2022-18:48:50",
                    "content": "    Lunacat:  Virtue signaling – Gitcoin is a great brand, and it’s safe to say pretty much everyone in Ethereum community is in violent agreement that funding public goods is cool. Being an owner in the Gitcoin protocol should be a sign of pride and something people want to show off. The comic and ethbots were a great step in this direction, but reach was fairly limited. How to build on this momentum?   Agree with you that this is an important reason that communities have always gotten involved and we need to do a better job of coordinating here on how they can tell this story. I have been working on ideas here with @annika, @vgk this week around publishing a case study for work we did with Nouns DAO. Curious for an update from @Coltron.eth on Ethers Phoenix or other projects that also align with this objective.     Lunacat:  Outreach – Gitcoin has a great story to tell and represents what is good about crypto and web3. This story is only being told to its existing supporters.   Very true that we have exciting stories to tell beyond the crypto-native audience. We’re getting there! In Season 14, we’re kicking off work with a PR firm for the first time. One piece of coverage that has already come out of this partnership is a feature in Wired on ETH Denver. It will be coming out in print in June’s edition of Wired too! More soon on additional PR plans as we get this partnership going in full-swing! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.308928571428572
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#7",
                    "likes": "5",
                    "time": "14/05/2022-16:58:26",
                    "content": "Giveth is doing something really interesting called “GIVpower” where people who lock GIV tokens can use their voting power to increase a project’s ranking on the platform… We will use several data streams to create a projects ranking and each project’s ranking effects the benefits we offer on the platform starting with the default sort on the platform and GIVbacks (and eventually GIVmatching and other cool things that we have waiting in the wings) This would create a little bit of demand and utility for GTC… We would love to share our learnings/designs/smart contracts/etc of course, we are still finalizing designs and contracts… but yeah… honestly we have a really interesting roadmap for GIV utility… I would love to team up on this work, we have almost the exact same core product (just different scopes, we are more focused on on-the-ground public goods work, while Gitcoin is more about open source) so the concepts have a lot of cross over. Here is a video of the opportunity we have:      Screen Shot 2022-05-14 at 10.52.34 AM1920×1068 92.3 KB  I go thru a core part of the roadmap at the second 1/2 of the call… it starts with staking tokens behind projects that are requesting donations on the platform and creates an onramp for them to work with their stakers to launch an economy with that locked collateral to back the token… Using GTC to back smaller regen economies focusing on building open source products would create a lot of demand and utility… ",
                    "links": [
                        "https://gov.gitcoin.co/t/gtc-conviction-voting-dapp-gtc-utility/10523/5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7265625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#8",
                    "likes": "7",
                    "time": "14/05/2022-18:11:01",
                    "content": "As we consider how to create more utility for GTC, I wanted to add what I perceive as the three pillars of Gitcoin.  These are pillars because they have the largest impact (whether measured financially or socially).   KERNEL which does web3-native education for 200 community members per quarter.  Total alumni of ~1k people, many of which have deep affection for KERNEL…  Grants - Our flagship product from a brand perspective, which uses Quadratic Funding to deliver $3m-$6m of funding for Open Source / public goods.  Also has massive intellectual and experiential impact   Hackathons - Our flagship product from a revenue generation perspective - A series of virtual hackathons (about 6-12 per quarter) that each help onboard 200-2000 developers/designers/new entrants into the web3 ecosystem per quarter.  Delivers $1m-$2m/quarter per value to the ecosystem and about $600k in revenue.  As we consider GTC utility, we may want to consider focusing on the areas of Gitcoin that have the most heat.  IMO those are above flagship products. ",
                    "links": [
                        "https://www.kernel.community/en/love/",
                        "https://kernel.community/",
                        "https://www.kernel.community/en/love/",
                        "http://gitcoin.co/grants",
                        "https://wtfisqf.com/",
                        "http://gitcoin.co/results",
                        "https://gov.gitcoin.co/t/articulating-gitcoindaos-impact-on-the-world/9994",
                        "https://gitcoin.co/hackathons",
                        "http://gitcoin.co/results"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/puncar",
                    "index": "#9",
                    "likes": "3",
                    "time": "16/05/2022-13:00:36",
                    "content": "Those are great pillars for an incubator program and to grow the ecosystem sustainably. I think Gitcoin can be the best web3 accelerator. By saying that, I think the meta-governance part is essential to help projects grow, mature, and succeed. I have been supporting Index coop with their metagovernance initiative as they are a large token holder in many Defi protocols thanks to their products like DPI. We have supported many proposals within DeFi and enabled those teams to execute as planned. Index is solving the voter apathy problem at those established projects, and it’s very important. I think Gitcoin can do even more than that by supporting project creation, assisting them with their product development and organization setup, and being their trusted partner from the beginning. But Gitcoin should carefully choose what project to support as our capacity is limited, and we need to make sure that we provide sufficient support to every project we pick. And with being a significant holder of those project tokens, the meta-governance utility of GTC will grow significantly as those projects will be maturing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.739075630252101
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nategosselin",
                    "index": "#10",
                    "likes": "8",
                    "time": "27/05/2022-17:31:26",
                    "content": "Hey everyone — a cross-functional group met on 5/20 to brainstorm ways to increase the utility of GTC and we wanted to share notes from our discussion back here. We kicked off the session by each sharing why we thought there was value in GTC having utility. Key themes that emerged from that part were:  Creating a virtuous cycle for the DAO Providing legitimacy / longevity / viability for the DAO Making Gitcoin more of a commons economy, which feels like the most aligned way to manage a public good Providing more psychological safety for contributors Enabling the community to have more meaningful engagement with the DAO through GTC  After discussing the why behind our task, we all took a few minutes to drop ideas for GTC utility into a slido. We then upvoted ideas that we wanted to discuss in more detail with the remaining time. The full slido can be seen here, and the notes from our discussion on the top upvoted ideas are here:  Identity / Trust Bonus (staking in dPopp Passport)  High-level mechanic would be to stake GTC on yourself or on others in order to get some reputational benefit. Some key considerations from the conversation included:  The idea generally has support, but it’s unclear if trust bonus is the right metric or if we should be focusing on increasing the cost of forgery  We need to think through the benefit for the person staking, as well as the potential slashing mechanic It may be more aligned to require holders to stake on others instead of themselves     Grants Curation Game (Delphi Version)  We did a lot of work pre-token launch on building out a grants curation game (details here) that rewarded those for curating before the round instead of during the round. People earned money for curating grants / collections. We should investigate how best to use this curation mechanism for future rounds. This idea had general support from the team —> we also discussed clarifying how curation is different from actual voting in the round. The tl;dr is that curating ahead of the round influences how the funds are then distributed during the round.   Create a Tokemak reactor which gets $200k-$300k/mo of TOKE (which can be dumped to stables) going into the treasury  This idea was presented on a governance post here. The basic premise is that Gitcoin would put up GTC into one half of a liquidity pool and the Tokemak community would put up the other half, based on governance votes from their community on which pools to fund. This type of arrangement would enable us to earn money in TOKE, which we could then convert to stables if needed. The team was interested in this concept, but thought it would be valuable to more deeply understand risk level (impermanent loss, etc).   Mutual grants with up & coming DAOs  The idea is that GTC becomes a kind of emerging-markets fund of the ecosystem, which would align our interests with those of similarly-motivated DAOs and facilitate creative collaboration. The team was supportive of this idea generally, but felt like this was more of a tactic for treasury diversification as opposed to GTC utility specifically.   Locking a portion of recurring aqueduct contributions into GTC liquidity pools  The team discussed the potential considerations and trade-offs of this approach, including whether or not our community or customers would be interested in this idea.    After discussing the top ideas, the team decided on a few next steps:  Posting these notes to the governance form (this post) Standing up a CSDO-like committee to shepherd these ideas forward and present them back to CSDO (Kyle and Chase to kickoff) Scheduling a follow-up meeting to focus specifically on how GTC utility could be built into Grants 2.0 protocol development (scheduled for week of 5/30)  ",
                    "links": [
                        "https://gov.gitcoin.co/t/establishing-a-new-process-for-identify-verification-scoring-and-removing-troubled-id-methods/7506/3",
                        "https://docs.google.com/document/d/1KKd0BhgchnY5zYcubggagD8940pSTFicRBnDyCLC7b4/edit#heading=h.1al5rzyhmirq",
                        "https://gov.gitcoin.co/t/discussion-securing-a-gtc-token-reactor/9976",
                        "https://gov.gitcoin.co/t/gitcoin-radicle-public-goods-alliance-temp-check/10825/3",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-20-2022/10789"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.688958916900093
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#11",
                    "likes": "1",
                    "time": "10/06/2022-06:40:01",
                    "content": "I would like to learn more as a way of seeing whether I could be of help in this analysis and other work individually and/or in my role as a wildfire operator. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                }
            ]
        }
    ],
    "group_index": "92"
}