{
    "poll_list": [
        {
            "id": "0x08bc5d61cf0e939b333187625eb2f3dce3a630a328db2b76f4776107cf6612c3",
            "title": "S16 - DAO Operations Budget",
            "discussion": "https://gov.gitcoin.co/t/s16-proposal-integrated-dao-operations-budget-request/11811",
            "body": "This is a funding proposal for the DAO Operations (DAO Ops) Workstream requesting ratification budgetary funds for Season 16.\n\nTL;DR\n\nDAO Ops continues to evolve our service model in service delivery of our workstream partners and cross stream collaboration. In S16, we will continue to support key initiatives to support contributor professional development, and with budget increases to support the success of our Grants Program and Protocol development. Also, in light of recent shifts in our community engagement strategy, we will be winding down our Community Experience initiative to focus even more on cross-stream collaboration, accountability and project management across the DAO.\n\nBased on what we learned in S15, we will be focusing our resources on supporting DAO and contributor success vis-a-vis our cross-stream DAO operations, governance, tooling, people operations and success initiatives.\n\nBudget Request\n\nDAO Ops requests $348,260 USD* in S16. Included in the budget is a placeholder for a Technical Support hire to support our Design Partner Program and 2 months of parental leave for 1 contributor. This request does not include the additional 60 days of reserves per season. A breakdown of the full budget can be found at the end of this proposal.\n\n*The amount of GTC requested and the value of the reserves will be adjusted based on the current market value at the time this proposal is moved to Tally using the lower of the current price or the 20 day moving average, whichever is lower.\n\nMore in our full proposal [here](https://gov.gitcoin.co/t/s16-proposal-integrated-dao-operations-budget-request/11811)",
            "choices": [
                "Yes",
                "No",
                "Abstain"
            ],
            "scores": [
                10280374.82859171,
                1033182.6285064168,
                1386457.801808714
            ],
            "start": 1668605526,
            "end": 1669201200,
            "snapshot": "15982899",
            "state": "closed",
            "author": "0x7E052Ef7B4bB7E5A45F331128AFadB1E589deaF1",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "S16 - DAO Operations Budget",
            "date": "Proposed on: Nov 23rd, 2022",
            "yes_votes": "5.6M",
            "no_votes": "0"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/s16-proposal-integrated-dao-operations-budget-request/11811",
            "title": "[S16 Proposal] INTEGRATED DAO Operations Budget Request ",
            "index": 11811,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#1",
                    "likes": "11",
                    "time": "31/10/2022-20:12:39",
                    "content": " Essential Intent During Season 16 (S16), DAO Operations will focus on the following Essential Intents (EI) within the DAO:  DAO Organization Protocol Adoption Program Success   TL;DR DAO Ops continues to evolve our service model in service delivery of our workstream partners and cross stream collaboration. In S16, we will continue to support key initiatives to support contributor professional development, and with budget increases to support the success of our Grants Program and Protocol development. Also, in light of recent shifts in our community engagement strategy, we will be winding down our Community Experience initiative to focus even more on cross-stream collaboration, accountability and project management across the DAO. Based on what we learned in S15, we will be focusing our resources on supporting DAO and contributor success vis-a-vis our cross-stream DAO operations, governance, tooling, people operations and success initiatives.  Amount DAO Ops requests $348,260 USD in S16. Included in the budget is a placeholder for a Technical Support hire to support our Design Partner Program and 2 months of parental leave for 1 contributor. This request does not include the additional 60 days of reserves per season. A breakdown of the full budget can be found at the end of this proposal.     Season Season 13 Season 14 Season 15 Season 16     Season Budget $450,000 $608,308 $293,000 $348,260   Season Reserves $0 $405,539 $188,585 $232,173   Unspent Reserves % 1)  15% 123.47% 12% N/A   Treasury Request 2)  $450,000 $947,846 -$261,423 $558,433    1) The amount of GTC requested and the value of the reserves will be adjusted based on the current market value at the time this proposal is moved to Tally using the lower of the current price or the 20 day moving average, whichever is lower. 2) The Treasury Request amount is an estimate using the price of $1.66 GTC to calculate the total of the reserves rolled over from Season 15.  Milestone Report for Past Season  Success  Incomplete, will hit goal or priority change  Incomplete, will not hit goal  Canceled - out of workstream’s control     Initiative Project Key Results Status Value Delivered/Notes     Community Experience Increase engagement and satisfaction among DAO Citizens interested in our grants program or grants protocol. KR1: Increase the average weekly percentage of engaged citizens on the DAO Citizens channels by 20%.  Though there isn’t a way to measure engagement on Discord, the average engagement on the DAO Vibes citizen calls has increased between 66-80%.     KR2: 50% reduction in requests to change Discord logic when compared to S14  Discord Managers have been assigned for each workstream. We audited roles, optimized access, and documented the access control process.    Develop a strong “Why” for community management initiatives that aligns with the DAO’s Purpose. KR1: Support the MMM community engagement strategy through weekly syncs, with insights from seasonal community management audits.  The MMM community audit and strategy creation is still underway. DAO Ops is coordinating with MMM to understand what support is needed in S16.     KR2: Identify and document the community and Discord needs of each workstream.  Guides and audits are in progress and will continue in S16.    Continuing to improve how we work at CSDO level KR1: Adopt a streamlined budget process ahead of S16.  Multiple proposals were made over the past season, but at CSDO member direction, DAO Ops paused this KR in favor of focusing on cross-stream strategic decision making.     KR2: Improve the quality of cross stream meeting processes, and the documentation of reviewed and adopted proposals.  Implemented changes to CSDO meetings, including format and facilitation changes and additional process documentation. We will continue to experiment with our format and to improve transparency in the upcoming season.   Community Governance Improve community governance and steward engagement through simplified processes that streamline decision making for the largest GTC delegates. KR1: Create a clearly understood onboarding and incentivization process  A new Steward Council proposal is live on snapshot and a proposal for onboarding new Stewards will be posted before the end of October.     KR2: Launch a Governance Documentation Hub for new and existing stewards.  A documentation hub has been created and will be shared in the next Stewards meeting.     KR3: 80% of stewards and workstream leads view steward meeting structure, pacing and content favorably.  Anecdotal feedback about this meeting has been positive, and we have created a standardized survey which will be administered 1x per month. Beginning in S16, DAO Ops will track and adjust meeting structure based on feedback from this survey.     KR4: 80% of top stewards vote on 100% of formal S15 proposals.  Current Steward Council voting engagement = 62%   People Ops Ensure contributors are in the right roles, and embrace a DAO-native hiring approach that further develops well supported contributors. KR1: 100% of core and trusted contributors have received a quarterly peer review.  MMM, FDD, and DAO Ops review complete. PGF and GPC’s reviews should be completed by late October.   People Ops Empower DAO contributors to grow and support our ImpactDAO and protocol development. KR1: Four or more workstreams receive compensation leveling recommendations from People Ops.  Recommendations were made to 4 workstreams. Implementation to be completed by workstreams.     KR2: Provide GPC contributors comprehensive support transitioning from holdings to the DAO.  We’ve created resources and set up calls to ensure a smooth onboarding.   Tooling Ensure a coordinated and transparent software tooling approach. KR1: Deliver a recommendation for cost reductions based on a deep dive into all tools used by DAO.  DAO Ops has reviewed access for several tools transferred from Holdings, which led to removing 30+ contributors from paid tools; we have also sunsetted a number of tools that were no longer actively used. We also inventorized access to all tooling and will continue to track access and needs in the upcoming season.     KR2: Facilitate access to all control domain requests within 48 hours.  In S15, we implemented changes, including a list of tool owners that facilitated quicker responses to the requests.     KR3: Ensure that all workstreams can use Notion as their primary tool for meeting notes and outward facing workstream description by end of season.  During the season, the Tooling initiative completed project management guidelines and revamped the Notion contributor database. All workstreams have been transferred to the current structure and have the ability to use Notion.   Support Continue to implement processes that improve our grants rounds and support our transition to a protocol-focused DAO. KR1: During GR15, support tickets (Discord+Email) are resolved within 20 hours (on average).  The average handling time of support tickets during GR15 was 13hours and 42 minutes.     KR2: Current state of the Grants program and protocol development is reflected on Knowledge Base within 10 business days of changes.  40+ Knowledge Base updates completed before and during GR15.     KR3: Deliver easily used data to grants round workstream partner post-GR15.  Without many trending technical issues, there wasn’t a lot of data to share with workstream partners.     List of Season 16 Commitments     Initiative Essential Intent Outcomes Likely Projects/Initiatives     Cross-Stream Operations DAO Organization Continuing to improve how we work at CSDO level. Identify and implement streamlined budget process design.      Document CSDO’s charter and make it known to the rest of the DAO      Launch a monthly CSDO digest to increase transparency.      Deliver DAO-wide organizational map.      Plan a team retreat.   Cross-Stream Operations DAO Organization Provide ongoing facilitation and internal communication support to cross stream Program and Protocol pods. Develop an updated framework for the Workstream Weekly calls; reformat calls based on framework.      Support cross-stream pods through context sharing and facilitating check-ins.   Community Governance DAO Organization Increase Steward engagement with novel incentive structures; simplify key processes to streamline decision making for the largest GTC delegates. Deliver additional updates to DAOstewards.xyz      Build a performance metric (OKR) between Council members and workstreams to enable rapid iterations and adjustments to the execution of the Steward Council v2.      Develop a “governance satisfaction score” & survey to understand governance perceptions and needs from stewards, contributors, and token holders   People Ops DAO Organization Empower DAO contributors to grow and pivot to support our ImpactDAO and protocol development. Deliver Professional Development guidance to support contributor’s continuing education.   People Ops DAO Organization Ensure contributors are in the right roles, and embrace a DAO-native hiring approach that further develops well supported contributors. Core and trusted contributors can participate in a quarterly peer review   Tooling DAO Organization Continue to engage in operational support, tooling, security and reconciliation to ensure an aligned and transparent software tooling approach meets the needs of the DAO. Facilitate response within 48 hours to all requests within the access control domain.      Identify and document the community and Discord needs of each workstream.   Support Program Success, Protocol Adoption Provide comprehensive support to GR16 participants and Design Partners. Discord tickets are resolved within 13 hours, and email tickets are resolved within 20 hours throughout S16.      Current state of the Grants Program and protocol development is reflected on the Knowledge Base within 10 business days of changes.     Budget Breakdown  View: USD per Initiative/Project     Initiative/Project Amount USD %     General Ops $20,000 5.74%   Cross Stream DAO Operations $119,248 34.24%   Community Governance $41,120 11.81%   Tooling $32,689 9.39%   People Operations $36,200 10.39%   Support $99,003 28.43%   Total $348,260 100%     View: USD per Category     Budget Category Description Amount USD     Core Contributors Workstream Lead - Kris $161,400    Workstream Lead - Jodi     Pod PM Lead - Saf     Technical Support Lead - TBD     Support Coordinator - Rohan    Trusted Contributors Community Governance Lead - Shawn $110,860    Tooling Lead - Puncar     Discord Management - Kyle J.     People Ops Coordinator - Sandy     Support Coordinator - Yuki     Knowledge Base - Joshua     Contracted Knowledge Base Content - Mathilda     Discord Support - Juliet, Emmanuel, Prof    Professional Development Funds approved continuing education for DAO contributors. $20,000   Operating Expenses Contributor reimbursements, parental leave, consulting fees, and tooling $56,000   Total Budget before Rollover and Reserves  $348,260   60-day Reserves* Covers workstream costs between seasons, including budget approval delays. $232,173   S15 Rollover (est) Includes S15 reserves and unused budget -$188,585   Total Requested from Treasury (est)  $391,847    Notes: A denomination in dollar amount will be prioritized in budget proposals over GTC - if the spot price assumed at the time of posting ($1.66 on November 9th) this document on the forum changes between then and when the budget gets proposed on-chain, the GTC amount will be readjusted to reflect the USD amount above. GTC amounts are rounded values. Current signers of the DAO Ops Multisig are @Jodi_GitcoinDAO, @krrisis, @DisruptionJoe, @lthrift, @CoachJonathan, and @kyle ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-digest-40-s16-budget-requests-everscale-hackathon-and-the-fantom-alpha-round/11836"
                    ],
                    "GPT-summary": "The post is a proposal for the Season 16 budget for DAO Operations, outlining the essential intents and initiatives for the upcoming season. The author explains the budget breakdown and provides a milestone report for past seasons. The post also includes a list of Season 16 commitments and a breakdown of the budget per initiative/project and category. The post could be subject to constructive criticism, questions, and auditing from third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Tooling",
                        "People Ops",
                        "Cross-Stream Operations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.109755037465881
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/CoachJonathan",
                    "index": "#2",
                    "likes": "6",
                    "time": "01/11/2022-16:12:52",
                    "content": "    Jodi_GitcoinDAO:  Continue to help evolve the budget process and explore new options to reduce the workload for workstreams and increase transparency for external parties.   This is a huge pain point for many WS leads right now. I’d love to see some more affirmative language around this. Perhaps instead of “continue to help evolve… and explore new options” we can count on DAO Ops to “identify and implement a new budget process…”. The rest of the proposal looks great. Looking forward to seeing DAO Ops continue to support all the WSs next season. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.664502164502164
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lthrift",
                    "index": "#3",
                    "likes": "3",
                    "time": "03/11/2022-21:49:15",
                    "content": "Thanks for the thorough request. Seems straight forward to me and I support it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#4",
                    "likes": "0",
                    "time": "03/11/2022-22:01:51",
                    "content": "Thanks for the feedback! We’re aligned on moving fast to solve this pain point and I will adjust the  language to clarify our intent in the integrated budget proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#5",
                    "likes": "1",
                    "time": "07/11/2022-10:27:13",
                    "content": "    Jodi_GitcoinDAO:  Discord Managers have been assigned for each workstream. We audited roles, optimized access, and documented the access control process.   I can testify to the effectiveness of the audit! I removed my permissions and somehow I had them since last year, they were removed, came back, etc.  Great work with this one!  At long last my godlike DIscord powers have been destroyed  Maybe I’m not knowledgeable around this, but I am quite surprised to see that Gitcoin DAO still doesn’t have a  HR department. Or is each WS supposed to have it? I honestly don’t know, sorry! GL in season 16  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.640625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#6",
                    "likes": "2",
                    "time": "07/11/2022-14:09:34",
                    "content": "Hey Zer8, happy to hear the roles powers are fixed for you      ZER8:  Maybe I’m not knowledgeable around this, but I am quite surprised to see that Gitcoin DAO still doesn’t have a HR department. Or is each WS supposed to have it? I honestly don’t know, sorry!   We do have an ‘HR department’ in a way, in the sense that we have People Ops as an initiative within DAO Ops. Next to this each workstream also has a talent coordinator who syncs with the People Ops team. It’s a smaller ‘centralized’ team within daoops, but we support all needs within each workstream as good as we can and based on feedback we adapt what people ops means exactly for Gitcoin. Hope this helps! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.104166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tigress",
                    "index": "#7",
                    "likes": "3",
                    "time": "07/11/2022-17:52:10",
                    "content": "    Jodi_GitcoinDAO:  Continue to support CSDO in effective and transparent decision making and information sharing, by continuously redefining formats for both strategic and tactical meetings.   As just mentioned on the Stewards Call: I d love to see an extension of your perspective on meetings to the whole workflow.   image1162×877 91.5 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#8",
                    "likes": "2",
                    "time": "07/11/2022-18:18:26",
                    "content": "This is a great call out. Recent OS insights extend well beyond the facilitation of meetings, and Kris and I sense the need for DAO Ops to take lead prioritizing how we build the overall canvas, document agreements, and implement any changes that come out of these conversations. We’ll work to refine this language to better reflect the need. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#9",
                    "likes": "1",
                    "time": "07/11/2022-20:36:07",
                    "content": "Hi Jodi - again thank you for our conversations and for educating me about DAO ops and about Gitcoin itself.  It was a pleasure working with you on this budget review.  Thank you for your patience with me. On the whole - at the risk of being a lonely voice in the wilderness - I think we should consider whether the DAO is leaning forward too aggressively given unavoidable risks.     Is Gitcoin over its skis? should we hold spending flat while addressing unavoidable risks? 📜 Budget Proposals       In today’s Steward’s call, I raised the question of whether Gitcoin might be “over our skis”.  In this post, I’d like to explain my question and offer some evidence in support of the hypothesis that we are actually “over our skis.”  Skiing?   The metaphor to be over one’s skis refers to emphasizing a course of action to such an extent that it constrains freedom of maneuver - implicitly in conditions in which one might want to be able to change direction.  When you lean far forward when sk…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.484375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/SLBK123",
                    "index": "#10",
                    "likes": "1",
                    "time": "08/11/2022-16:31:15",
                    "content": "Had a chance to read through and it has my full support. Very excited that there continues to be many improvements and continued planning around increasing Steward engagement and the simplification of key processes. I see that $20,000 is marked for professional development. What sort of continued education is planned for DAO contributors? Or does everyone choose what they want to do individually on their own? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3359375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/sandy_gitcoinDAO",
                    "index": "#11",
                    "likes": "2",
                    "time": "08/11/2022-21:49:50",
                    "content": "Each contributor decides their own professional development path  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#12",
                    "likes": "4",
                    "time": "09/11/2022-00:47:17",
                    "content": "It was great connecting! I read the considerations you laid out in your governance post and agree to a degree that coordinating our resources and developing metrics to track our progress are essential to a successful transition. For our part our budget is flat with exception for one hire to support our protocol work. We’re starting the process now to keep pace with the DevRel initiative and Design Partner launches happening this season. I also see cause optimism. As I shared in our 1:1, the workstream coordination continues to improve – we’re asking each other better questions, which in turn is building our strategy muscles.  The risks you lay out are good call outs, and ones we’re all thinking about. Either way, I hope we can count on your support this budget cycle.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#13",
                    "likes": "3",
                    "time": "09/11/2022-01:00:46",
                    "content": "@SLBK123 appreciate your support! To add to @sandy_gitcoinDAO’s response, last season many contributors used the professional development funds to reimburse costs related to ongoing coaching or classes to level-up in their functional areas. Examples of approved reimbursements include a content writing, agile project management, and full stack engineering courses; we also reimbursed ongoing coaching to improve communication, time management and leadership skills. We are asking for the same funding amount as last season, which was fully utilized. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.90625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Rachel-Mesh",
                    "index": "#14",
                    "likes": "1",
                    "time": "11/11/2022-22:29:05",
                    "content": "Thank you Jodi and Shawn for taking the time to chat with me this week – the time you’ve given to help with onboarding has been amazing and is much appreciated! I’m curious what data you typically use to determine salary range, i.e. for the technical support new role? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Topics:",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.599747474747475
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#15",
                    "likes": "2",
                    "time": "14/11/2022-13:40:55",
                    "content": "Hi Rachel! We have been using OpenComp as a standard and combine this with insights across other DAOs. Hope this helps! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.609375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#16",
                    "likes": "2",
                    "time": "14/11/2022-13:41:54",
                    "content": "    Rachel-Mesh:  I’m curious what data you typically use to determine salary range, i.e. for the technical support new role?   Hi Rachel! We have been using OpenComp as a standard and combine this with insights across other DAOs. Hope this helps! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.789614898989899
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Rachel-Mesh",
                    "index": "#17",
                    "likes": "1",
                    "time": "14/11/2022-15:42:31",
                    "content": "Hi! Thank you for the clarification – much appreciated! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#18",
                    "likes": "2",
                    "time": "16/11/2022-13:58:41",
                    "content": "To note - This proposal is now live on Snapshot and will be open for your vote through Nov 23, 2022, 6:00 AM EST https://snapshot.org/#/gitcoindao.eth/proposal/0x08bc5d61cf0e939b333187625eb2f3dce3a630a328db2b76f4776107cf6612c3 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/mingyuezong",
                    "index": "#19",
                    "likes": "0",
                    "time": "16/11/2022-16:47:51",
                    "content": "Why I have $gtc but can’t vote ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/GClayMiller",
                    "index": "#20",
                    "likes": "2",
                    "time": "17/11/2022-12:59:00",
                    "content": "Brand new Steward, lacking context. Apologies if questions and comments are naive while I get my footing  The previous budget requests and Season Reserves caught my eye—what was going on between S13 & S14 that led to dramatically large jumps in % unspent?    Saw that you had trouble tracking engagement in Discord. Not certain of your needs, but I think there are several bots or custom integrations you can implement that will help track your most engaged contributors! Check out https://statbot.net/   and some of the documentation here: Understanding Server Insights If not, maybe its something that could be built—would be a valuable tool for any community and Gitcoin grantee!  Screen Shot 2022-11-17 at 7.45.44 AM716×187 11.8 KB   I am a brand new steward and have not seen anything about the Steward Council calls or steward-specific channel yet!   Screen Shot 2022-11-17 at 7.45.49 AM742×362 17.8 KB   The S16 goals around CSDO sound important! However the outcomes/likely projects seem a bit more vague than what I have seen in other workstream budget proposals. Are there specific KPIs you are trying to meet? Is there existing data on where bottlenecks exist, where contributors fall off, where onboarding stalls, topics that get lost between workstreams etc etc?  Thanks for the time & effort everyone put into this proposal—was very detailed and helpful  ",
                    "links": [
                        "https://discord.com/community/understanding-server-insights"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5951601094983445
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#21",
                    "likes": "0",
                    "time": "17/11/2022-13:21:29",
                    "content": "hi @mingyuezong can you DM me and I can help? discord: shawn16400#5507 twitter:  @shawnlgrubb or here via discourse mail ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#22",
                    "likes": "2",
                    "time": "19/11/2022-11:14:57",
                    "content": "Hey thanks a lot for the proposal. I have some comments here. I am not really convinced in how important this workstream’s work is for the operation of the DAO which is bleeding a very big amount of funds in the most severe bear market we have seen in years. I am happy to see that you have unspent reserves from S15. I am not happy to see an increase in budget request during such market conditions. If I compare the salaries you guys pay they are higher than I have ever made as an opensource developer, even in good market times. I am also trying to understand and judge what exactly does the DAO gain from this workstream. Looking at the S16 commitments and the outcomes and initiatives I just don’t see any of these as actually important, except perhaps the Support section which is indeed something Gitcoin should have. As things currently stand I will have to vote No in this proposal with the feedback being to recognize the terrible state of the market and the industry and adjust the budget accordingly. And to also keep only the stuff that is absolutely essential to the DAO and shed everything else. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#23",
                    "likes": "2",
                    "time": "20/11/2022-16:57:41",
                    "content": "I agree with Lefteris. Though I am going to make a harder stand and vote no on this budget request and every other one as well. We need to make cuts and the only way the stewards can signal it is by voting no. Voting no on all work streams until we get our spending under control is the only thing I can do at this point, and I hope other Stewards will follow suit. We have given strong warnings over the last few seasons and they don’t seem to be enough. We cannot spend this much money in this market, it is a bad strategy. I am happy to work with the Gitcoin Hiring team to explain how Giveth finds intrinsically motivated high caliber contributors in lower income countries to keep our budget at 1/10th of the cost. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party offering to collaborate on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1320512820512825
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#24",
                    "likes": "1",
                    "time": "20/11/2022-17:10:26",
                    "content": "    griff:  Though I am going to make a harder stand and vote no   I also voted No here though  And my abstain in PGF may change to no if no sufficient answer comes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#25",
                    "likes": "1",
                    "time": "21/11/2022-12:58:45",
                    "content": "I meant that I am going to take a harder stance in general and vote no on all the proposals this round. Sadly I missed the FDD vote and left a yes vote on the Product team. It’s definitely my bad for not getting that all in correctly, but 'm not sure why these votes were scheduled with different lengths of voting time… :-/ Either way, the stance isn’t going to stop anything this round it seems. But I’m planning on voting no across the board until we see serious budget cuts, and next season I will rally more support for this across the stewards group if there isn’t a change. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.237179487179487
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#26",
                    "likes": "0",
                    "time": "21/11/2022-19:15:29",
                    "content": "Welcome and thanks for your thoughtful questions!     GClayMiller:  what was going on between S13 & S14 that led to dramatically large jumps in % unspent?   Our first two seasons as a workstream included a couple key personnel moves, including several contributors transitioning to the DAO from Holdings. A couple of those moves took longer to occur than planned, which led to larger than expected rollovers at the end of each season. Then, ahead of of S15, four contributors left DAO Operations and excess funds in our multisig were returned to the DAO’s treasury (about $270k).     GClayMiller:   Check out https://statbot.net/   and some of the documentation here: Understanding Server Insights   Appreciate this suggestion. Tagging our discord manager to follow up with you with questions. @kylejensen     GClayMiller:  I am a brand new steward and have not seen anything about the Steward Council calls or steward-specific channel yet!   Tagging @shawn16400 to help get you onboarded.     GClayMiller:  Are there specific KPIs you are trying to meet? Is there existing data on where bottlenecks exist, where contributors fall off, where onboarding stalls, topics that get lost between workstreams etc etc?   We don’t have specific KPIs for CSDO. But anecdotally some of the important projects CSDO members asked DAO Operations to drive in S16 include:  An updated CSDO charter and DAO OS with clear metrics A streamlined budget process that balances planning with execution, and borrows from best practices in the broader ecosystem. Experimentation with workstream coordination that improves internal communications and project management (i.e., working in cross stream pod or guild structures).  Each is listed as a DAO Ops project commitment this season. ",
                    "links": [
                        "https://discord.com/community/understanding-server-insights"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.981872294372295
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#27",
                    "likes": "0",
                    "time": "21/11/2022-20:11:38",
                    "content": "We appreciate you naming these concerns. For our part, in S15, People Operations rolled out a compensation framework that tried to balance fiscal responsibility with the ability to attract value-aligned talent. Based on those recommendations, most workstreams (including DAO Operations) re-leveled contributor pay to 50% of U.S. median salary. This ensures that all contributors, regardless of where they live, are paid the same for the same work.     griff:  I am happy to work with the Gitcoin Hiring team to explain how Giveth finds intrinsically motivated high caliber contributors in lower income countries to keep our budget at 1/10th of the cost.   But we love feedback. We have one contributor repping our hiring team – tagging @safder should you want to connect with him or if he has more to add regarding our compensation work last season.     lefterisjp:  I am not happy to see an increase in budget request during such market conditions.   If not for one projected Support Engineer hire, DAO Ops’ budget would be flat, and like last season, we will look for ways to spend less than budgeted wherever possible. This is why our S15 rollover balance includes approximately $31k of unspent budget.     griff:  We have given strong warnings over the last few seasons and they don’t seem to be enough.   And we’ve also heard stewards on spending, only using reserves in S15, returning $261k to the DAO’s treasury.     lefterisjp:  I am also trying to understand and judge what exactly does the DAO gain from this workstream.   As for our value to the organization: our commitments to the DAO remained largely unchanged in S16 in accordance with CSDO’s decision to keep planning to a minimum this season. That said, DAO Ops is a service-oriented team that is constantly responding to the needs of the DAO. That means that in addition to the commitments listed above, we are also assessing a number of projects that stewards, workstream leads and contributors have already raised since the start of the season, including:  an updated treasury dashboard contributor pay survey creation of a CSDO charter Facilitated strategy sessions to set the DAO’s operating system and set value proposition as a protocol and grant giving DAO.  Hope all this helps but @krrisis and I are here if either of you would like discuss further. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.44275308025308
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#28",
                    "likes": "4",
                    "time": "21/11/2022-23:54:46",
                    "content": "I appreciate the thoughtful engagement here Griff, and I’m very much in alignment with the need to minimize costs. On compensation/hiring, we recently went through the process of developing a compensation model in collaboration with workstreams, one that aligns incentives with performance and accountability. Currently the DAO Ops, FDD, and MMM workstreams are using this new performance-based compensation model. As Jodi mentioned, this model uses the US median for base salary numbers from the data provided by OpenComp, which aggregates salary data from hundreds of companies in its database. The base numbers here are pretty reasonable, and NOT meant to be competitive with FAANG/high CoL area tech salaries. One reason we use US numbers, and it makes sense for us to continue to do so, is that a majority of our full-time contributors are US-based. It would not be prudent to lay off and attempt to replace our entire workforce with contributors from lower CoL regions. I would note here that the costs of replacing a strong employee/contributor can be much higher than potential benefits of rehiring someone at half the cost. Here is a good read on the costs associated with turnover, and there is a lot of research that has been done on this. That being said, what is important is ensuring that compensation makes sense for the skills/experience/value each contributor is bringing to the DAO by having high levels of accountability, and I think this is an area the DAO could definitely improve. This is what the compensation model attempts to solve, as well as potentially some of the budget auditing work @shawn16400 is looking into. Would love to continue working with you as well as other Stewards in exploring how we can continue to ensure that we’re only taking what we need from the treasury in the ongoing market conditions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.408643250688705
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#29",
                    "likes": "1",
                    "time": "23/11/2022-11:38:58",
                    "content": "This snapshot has passed with ~80% approval rate. Metrics: 843 unique votes ~12.4M GTC tokens cast. And thank you to all the commenters & voters who took the time to participate in Gitcoin Governance. https://snapshot.org/#/gitcoindao.eth/proposal/0x08bc5d61cf0e939b333187625eb2f3dce3a630a328db2b76f4776107cf6612c3 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#30",
                    "likes": "3",
                    "time": "02/12/2022-22:41:22",
                    "content": "    safder:  One reason we use US numbers, and it makes sense for us to continue to do so, is that a majority of our full-time contributors are US-based. It would not be prudent to lay off and attempt to replace our entire workforce with contributors from lower CoL regions. I would note here that the costs of replacing a strong employee/contributor can be much higher than potential benefits of rehiring someone at half the cost. Here is a good read on the costs associated with turnover, and there is a lot of research that has been done on this.   I’m not saying we need to fire good contributors that are making high US salaries, we have who we have and if they are performing we should keep them 100% agree. That said, it is a huge mistake to be spending so much when there is no clear business or economic model for a path forward for GTC, and setting the salary rate high for people that are hired in the future doesn’t make sense to me. Fine, people are paid a lot who work here now… that doesn’t mean we should maintain that policy into the future. There are incredible people all over the world that can do work just as well as someone from the states. I know because we hire them at Giveth, and they don’t care that they aren’t getting paid American wages. I said as much here when the idea was presented, and i’m surprised it was pushed through anyway given the debate there:    A Compensation Commitment 🤖 DAO Governance and Vision       I love many aspects of this proposal, but am skeptical of a few as well   Transparency I am neutral here… I like the ideals of transparent salaries, but in practice, i haven’t found it very beneficial, so i could go either way.   Global Salary Benchmark I strongly disagree with the proposed policy.  US Base + 30% ? This doesn’t make any sense in general IMO… If you are hiring a strategic expert solidity dev, you might need to pay a lot more than US base + 30%, or if you are hiring an admin from …     In general we are going backwards with the approach in budgeting. We should say how much GTC and DAI we are willing to spend each quarter, given our current holdings and the macro outlook, divide that up amongst the working groups and live within our means. This is how we need to build a budget for the DAO in the bear. Right now we don’t actually have a budget, our process (cynically) looks like this: Each working group spends way too much time trying to sell their work in forums and calls, then they put out a number that gets nickel and dime’d by a bunch of stewards that don’t have enough of an incite to really judge the request and then it gets approved eventually and we spend whatever, with no concern (at least outwardly) about how the increase in supply is going to be met with demand. ^^^ This is a fine pattern in a bull market where the macro environment can generate tangential demand… that is not where we are right now. ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-compensation-commitment/10830/28",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-dao-ops-budget-request/12741/8"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.575937558817994
                }
            ]
        }
    ],
    "group_index": "230"
}