{
    "poll_list": [
        {
            "id": "0x119e0e8f70806a969fcd5b0a7fa97f44bc5979b19a32921bd59c65d6783c1cdc",
            "title": "[GCP-002] - RocketPool oDAO participation ",
            "discussion": "https://gov.gitcoin.co/t/gcp-002-rocketpool-odao-participation/13044",
            "body": "Gitcoin was recently invited to participate in Rocket Pool’s oDAO, to do so we need to post a bond of 1750 RPL (which we have from an airdrop from the Rocket Pool community in our Matching Pool) and ensure we have a validator running to perform oDAO required tasks. \n\nThe RocketPool oDAO invitation passed their governance vote, and as a result of completing our oDAO responsibilities we will earn rewards that will go back to the Matching Pool. \n\nI am asking for permission to use 1750RPL to post a bond for our participation, set up a validator with 16Eth (also from the matching pool), and foster a relationship with Rocket Pool where we support the decentralization of Ethereum.\n\nFull details can be found on the governance forums listed below!",
            "choices": [
                "Join RP's oDAO & run a node",
                "Join RP's oDAO ",
                "Do not join oDAO"
            ],
            "scores": [
                9744478.917514171,
                379.5523508518961,
                821.6787425198407
            ],
            "start": 1678332557,
            "end": 1678890540,
            "snapshot": "16787977",
            "state": "closed",
            "author": "0xc2E2B715d9e302947Ec7e312fd2384b5a1296099",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gcp-002-passed-rocketpool-odao-participation/13044",
            "title": "[GCP-002] - PASSED - RocketPool oDAO participation ",
            "index": 13044,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#1",
                    "likes": "9",
                    "time": "23/02/2023-02:05:29",
                    "content": " [Gitcoin Community Proposal] - RocketPool oDAO participation  Summary Gitcoin was recently invited to participate in Rocket Pool’s oDAO, to do so we need to stake 1750 RPL (which we have from an airdrop from the Rocket Pool community in our Matching Pool) and ensure we have a validator running to perform oDAO required tasks. If we are selected, we will earn rewards for participation which will go back to the Matching Pool. I am asking for permission to use 1750RPL to post a bond for our participation, set up a validator with 16Eth, and foster a relationship with Rocket Pool where we support the decentralization of Ethereum.  Abstract Rocket Pool is one of the leading staking protocol providers for individuals to stake at home. You can read more about Rocket Pool here. Essentially individual node operators can stake ETH to secure the beacon chain using Rocket Pools’ protocol and in doing so, they earn RPL rewards. So I, Kyle, would stake 16Eth to run a validator node and my Eth is paired with Eth from another community member who wants to stake their Eth, but doesnt want to run a node themself. Often the rewards are pooled to increase the total rewards of those staking. Rocket Pool has an Oracle DAO (oDAO) that ensures those who are participating in the Rocket Pool network are good actors. This oracle membership in oDAO provides the Rocket Pool network assurances that the rewards paid out are fairly and accurately and essentially helps confirm the Rocket Pool protocol is running as it should. Gitcoin has been invited to run an Oracle node, and join oDAO. You can read more about oDAO in this post. oDAO members are rewarded for participating, and offered a seat at the governance table with Rocket Pool. You can review past proposals and learn more about participation in oDAO here. A number of other great communities already participate in oDAO (Fire eyes, Eth Staker community, Nimbus, Etherscan, etc.)  Motivation As discussed in past posts, finding recurring and sustainable funding models for funding public goods is high on our priority list. At the same time, growing and continuing to be good stewards and partners to other protocols in the space has long been in our Ethos. I love the idea of supporting a fellow protocol as it continues to grow, and it is with our support we can also secure the Beacon chain. Partnering with Rocket Pool enables the DAO to accomplish a few key tasks:  We can help secure both the Ethereum network by running a validator, and also help secure the Rocket Pool protocol via their oDAO participation. We can partner with a leading Ethereum Validator protocol, and earn rewards by doing so. Those rewards can be used to participate in governance in the Rocket Pool community, and if desired, fund public goods.  By participating in Rocket Pool’s oDAO we will play our part in a broader ecosystem while being rewarded for that action. This will further the good will of Gitcoin, and also broaden our participation in securing the Ethereum Network.  Specification In order to participate a few things need to happen:  We need to run a Rocket Pool validator Node We need to be formally invited by Rocket pool We need to post a bond of 1750 to confirm we will perform our validator duties adequately Once we are formally invited, and the bond is posted, we can begin our oDAO membership and services.  I Have been running a validator node since genesis at home, and have recently stood up a (brand new) Rocket Pool validator node on spare hardware for this task. Taking on the Oracle verification steps required by oDAO should be straightforward and easy to keep up with as the software mostly runs on its own. I am requesting to use the 1750 RPL that was airdropped to the DAO and put it to work back in the community that entrusted us with those tokens to begin with. The full documentation for how to set up a node can be found here, and the oDAO details are here. Some of the key account details can be found here to ensure transparency on the token accrual.  1600×570 186 KB  I would also like to stake 16 Eth from the Matching pool to run a validator and earn rewards for the DAO. That earned Eth can be withdrawn at any time (after the Shanghai hard fork), and will continue to grow at a rate of around 7% annually.  Benefits This proposal enables us to support a growing protocol, earn rewards for doing so, and also gives us an opportunity to participate in governance with Rocket Pool’s oDAO.  Drawbacks This participation gives us a responsibility with another community, and it is important we take that to heart when committing. This means, we will need to ensure we have a node running and are able to perform our duties with the highest up time possible. One potential drawback is in the event our node is no longer operational (power outages, hardware outages, etc.) we may be asked to leave the oDAO and lose part if not all of our bond. The current value of the RPL tokens and Eth being requested is worth just under $114K USD. These funds could be sold and used in other places. Though we don’t have a need for them today, I want to call out this is a drawback in the immediate term.  Vote For this vote, I am proposing three options: 1 - Yes to joining oDAO and posting the 1750 RPL bond, and also establish a validator on Rocket Pool with 16 Eth 2 - Yes to joining oDAO and posting the 1750 RPL bond, but do not create a validator node with 16 Eth 3 - Do not use the 1750 RPL and 16 Eth to take these actions I am looking forward to hearing from the community on what they think   Revision history  [placeholder]  ",
                    "links": [
                        "https://rocketpool.net/#how-it-works",
                        "https://medium.com/rocket-pool/rocket-pool-staking-protocol-part-2-e0d346911fe1",
                        "https://rocketscan.io/dao/",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/1/1117e7b3b1be8021c009728688b2b0f2d1f22241.png"
                    ],
                    "GPT-summary": "The author of the proposal is requesting permission to use 1750 RPL to post a bond for participation in Rocket Pool's oDAO and set up a validator with 16Eth. The proposal explains the benefits and drawbacks of participating in oDAO and provides specifications for participation. The author is also requesting feedback from the community on the proposal. A 3rd party could give constructive criticism, extend to the proposal, collaborate on the proposal, or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.829214876033058
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/azeem",
                    "index": "#2",
                    "likes": "2",
                    "time": "23/02/2023-02:08:41",
                    "content": "I vote Yes with the first option of joining oDAO and posting 1750 RPL bond, and also establishing a validator on Rocket Pool with 16 ETH. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "3",
                    "time": "23/02/2023-02:17:45",
                    "content": "This is the kind of experimentation we need. Even with the risks, I’d like to see this move forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#4",
                    "likes": "1",
                    "time": "23/02/2023-02:24:12",
                    "content": "Thanks, Azeem. This is yet another GCP opportunity you have been cultivating! Huge thanks  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#5",
                    "likes": "6",
                    "time": "26/02/2023-23:45:08",
                    "content": "I’m supportive of this, and would go with option 1 as well. Just for transparency, I spoke with Kyle about the process for unwinding this if we wanted to continue for whatever reason, and feel confident that this would be a painless process. I’d love to normalize documenting the failure case in our future GCPs so that we can consider the full scope of these proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.277777777777778
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/chaselb",
                    "index": "#6",
                    "likes": "0",
                    "time": "27/02/2023-18:31:53",
                    "content": "If we join the oDAO, what is the continued expectation? Is it relatively passive with minimal maintenance? Or does someone from GitcoinDAO have to actively involve themselves with the Rocketpool community? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.611111111111112
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#7",
                    "likes": "0",
                    "time": "03/03/2023-03:45:20",
                    "content": "    chaselb:  Is it relatively passive with minimal maintenance?   Generally speaking yes. Though I am excited to be a good steward and participate in their governance as well. Rocketpool usually has a couple proposals a month for their oDAO members, and they are usually not very contentious. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.482142857142858
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#8",
                    "likes": "3",
                    "time": "07/03/2023-16:14:21",
                    "content": "I’m supportive for the reasons articulated here and, tbh, because of the enthusiasm expressed as well. Living our values by helping to defend the commons seems right on every level. Secondarily - if running these nodes becomes challenging then either we unwind (as @kevin.olsen mentions it wd be nice to see this unwind or exit option briefly articulated) or gitcoin can build a little more devops muscle to address, which seems like a capability we need for passport and otherwise. I’d vote for option 1. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.186383928571429
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#9",
                    "likes": "2",
                    "time": "07/03/2023-17:35:24",
                    "content": "Give the five steward comments, I am going to move this to the proposal section for us to get more comments before posting to Snapshot. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#10",
                    "likes": "1",
                    "time": "07/03/2023-19:17:50",
                    "content": "Also supportive. Where is the new place to comment? I don’t think I see another location? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.590909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/eugyal",
                    "index": "#11",
                    "likes": "2",
                    "time": "07/03/2023-19:21:02",
                    "content": "I support the ODAO participation wholeheartedly due to its decentralized structure, relative ease of implementation, and potential for generating income. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#12",
                    "likes": "0",
                    "time": "07/03/2023-20:56:51",
                    "content": "This is the right place. I moved the conversation from #open-discussion to #governance-proposals It feels like we should have quorum to get a vote live  -kyle ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.055194805194805
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#13",
                    "likes": "1",
                    "time": "08/03/2023-10:04:45",
                    "content": "    annika:  Where is the new place to comment?   hi Annika, this is THE place  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ebransom",
                    "index": "#14",
                    "likes": "0",
                    "time": "08/03/2023-18:55:23",
                    "content": "I agree with option 1. This seems like a good experiment and opportunity to participate across the ecosystem & earn rewards. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/koday",
                    "index": "#15",
                    "likes": "0",
                    "time": "08/03/2023-20:31:35",
                    "content": "    kyle:  One potential drawback is in the event our node is no longer operational (power outages, hardware outages, etc.) we may be asked to leave the oDAO and lose part if not all of our bond.   I’m in support of this proposal (Option 1) but I’d like to see this risk evaluated a bit more. How long does the node need to be offline in order to be kicked out of the oDAO? Can we quantify this risk and implement some mitigation strategies? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#16",
                    "likes": "2",
                    "time": "08/03/2023-22:47:24",
                    "content": "Great question! I think another oDAO member was down for over 60 days before a proposal went live to kick them out… Although outages happen, I highly doubt we would ever have an outage that long. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.090808080808081
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#17",
                    "likes": "1",
                    "time": "08/03/2023-23:39:50",
                    "content": "I support option 1, thanks a lot for your new and creative proposal, Kyle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3939393939393945
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#18",
                    "likes": "1",
                    "time": "09/03/2023-03:31:31",
                    "content": "Hey everyone - this is now live on Snapshot! https://snapshot.org/#/gitcoindao.eth/proposal/0x119e0e8f70806a969fcd5b0a7fa97f44bc5979b19a32921bd59c65d6783c1cdc Would love for you to get out and vote! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "• Author of proposal is advertising proposal",
                        "• 3rd party extending to proposal",
                        "• 3rd party asking questions about proposal",
                        "• None of the topics listed match"
                    ],
                    "Sentiment": 6.988636363636363
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/koday",
                    "index": "#19",
                    "likes": "1",
                    "time": "09/03/2023-04:11:54",
                    "content": "Awesome - I assumed it was a much lower threshold. I’m fully in support of option 1! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jengajojo",
                    "index": "#20",
                    "likes": "1",
                    "time": "10/03/2023-08:58:50",
                    "content": "I agree with option 1. This is a net positive for the overall industry as well as the DAO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.378787878787879
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#21",
                    "likes": "2",
                    "time": "14/03/2023-01:23:53",
                    "content": "Love this. So glad we are doing it. Would be great to see more experimentation like this. Feels like a path to aqueducts being set up. Yes to 1 from me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#22",
                    "likes": "1",
                    "time": "14/03/2023-16:49:18",
                    "content": "Voted for it. Experimentation like this is good and rocket pools and ETH staking is super cool! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.451388888888889
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#23",
                    "likes": "1",
                    "time": "20/03/2023-00:33:06",
                    "content": "Hey all - An update on this. The vote has passed! Thank you to everyone for the support. I have gone through and done the following:  Joined the RocketPool oDAO with the following node address: 0x58fa2ca71c4a37f6B280fc55e04cC8Effa68a18A Deposited 16Eth into the node to kick off our first DAO validator! The minipool address is: 0x1337b9d32B57188914bbF82F995e083C4De96B8B This will go live in a few days once we get through the que. Configured the oDAO node and I am in the process of testing our ability to generate the proofs for the node.  Overall, its been a great personal experience to dive back into Linux and work with the RocketPool folks to get this going. I will share validator status as I have that  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.582702020202021
                }
            ]
        }
    ],
    "group_index": "332"
}