{
    "poll_list": [
        {
            "id": "0x6a7500e65d65468fede15c1a447b1077e75fe66dd4ca87b690dde904c0008b8b",
            "title": "Moonshot Collective (MSC) S13 funding request",
            "discussion": "",
            "body": "TLDR :\nWe are growing. We are tooling up. We’ve already shipped some bangers. We have many more planned…\n\nWe would like 130k GTC\n\nOur goal is to focus on bringing the toolkit to market, validating new prototypes, onboarding new talent.\n\n*Q1/Q2 OKR’s:*\n\n*Objective: OP Partnership is successful.*\n- KR: Jing decides to continue on with us after Q2 2022.\n- Optimism chooses to use MC’s MVP to elect badge holders for their next round of RetroPGF\n- Vitalik blogs about RGPF and mentions Gitcoin in it.\n\n*Objective: dPopp is successful*\n- KR: MVP of dPOPP launches by July 1 2022\n- Can integrate with POH + BrightID\n- At least 100 users have connected their identity.\n\n*Objective: CPK successful*\n- CPK used by emu to pay moonshot devs.\n- 6 DAOs using CPK by July 1.\n\n*Objective: Innovation Factory*\n- ICs/Developers are happy.\n- Increase active devs by 50% (+7)\n- We are good at validating opportunities.\n- We are good at building validated opportunities (achieving product market fit).\n",
            "choices": [
                "Fund MSC as requested",
                "Do not fund MSC as requested"
            ],
            "scores": [
                4790608.189188188,
                450822.33235469536
            ],
            "start": 1645040315,
            "end": 1645470000,
            "snapshot": "14219091",
            "state": "closed",
            "author": "0xc2E2B715d9e302947Ec7e312fd2384b5a1296099",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "🚀 Moonshot Collective (MSC) S13 - Funding request",
            "date": "Proposed on: Mar 3rd, 2022",
            "yes_votes": "5.44M",
            "no_votes": "0"
        },
        {
            "title": "Canceled proposal: 🚀 Moonshot Collective (MSC) S1…",
            "date": "Proposed on: Feb 22nd, 2022",
            "yes_votes": "0",
            "no_votes": "2"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/moonshot-collective-workstream-budget-request-q2-2022/9824",
            "title": "\\xf0\\x9f\\x9a\\x80 Moonshot Collective Workstream Budget Request Q2 2022 ",
            "index": 9824,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/austingriffith",
                    "index": "#1",
                    "likes": "11",
                    "time": "04/02/2022-18:09:17",
                    "content": " TLDR : We are growing. We are tooling up. We’ve already shipped some bangers. We have many more planned… We would like 130k GTC Our goal is to focus on bringing the toolkit to market, validating new prototypes, onboarding new talent.  Proposal Body : This is a request to fund the Moonshot Collective with GTC from GitcoinDAO Treasury for Q2 2022. The moonshot collective is a collection of builders & web3 community members who are prototyping experiments in coordination. Last request for funding: Q4 21’ (skipped Q1 22’) Workstream Objectives: Our target state is to build an innovation machine that systematically rapidly prototypes new coordination tools and takes them to market. Current Mulit-Sig signers (⅔): Owocki Austin Griffith Emu Current Treasury Reserve: 14,997 GTC The Ask: 130k GTC to 0x230Fc981F7CaE90cFC4ed4c18F7C178B239e5F9F Q4/Q1 Accomplishments:  Added Brent, Laura, Emu to the workstream to create a systematic approach to product development. Gitcoin Metaverse Comic #3 released  GreatestLARP.com raised $500k for grants multisig 6 High Quality Schelling Point activations planned Moonshot Collective is proving to be a natural convergence point for web3 contributors who not only want to see this space succeed, but want to accelerate the pace at which we can successfully coordinate with one another. 21 Streams deployed 6 successful pay party elections for MC Contributors (and counting) Voted on signers and deployed a baby multisig (Funded with monthly burn) where our devs get to feel our products. Here  Mars shot bots raised $140,500 Moonshot bots raised 786.24 ETH, $2.5mm at the time of the raise  Planned:  Ratify the compensation policy Optimism partnership kicked off Tip.party, pay.pary, tokenstream.party used to pay devs Recruiter.party product validation Backlog full of prototyping possibilities! MMM begins using pay.party  Inquiry for a Scaffold ETH Notion competitor prototype (fdd) Moonshot multidropper as revenue source (GTC) (staging app)   Q1/Q2 OKR’s:  Objective: OP Partnership is successful.  KR: Jing decides to continue on with us after Q2 2022. Optimism chooses to use MC’s MVP to elect badge holders for their next round of RetroPGF Vitalik blogs about RGPF and mentions Gitcoin in it.   Objective: dPopp is successful  KR: MVP of dPOPP launches by July 1 2022 Can integrate with POH + BrightID At least 100 users have connected their identity.   Objective: CPK successful  CPK used by emu to pay moonshot devs. 6 DAOs using CPK by July 1.   Objective: Innovation Factory  ICs/Developers are happy. Increase active devs by 50% (+7) We are good at validating opportunities. We are good at building validated opportunities (achieving product market fit).    Stretch Objectives:  MVP of watchtower.party - Financial, health and functional dashboard for DAO operators. Scaffold ETH Notion competitor prototype/use case exploration Gnosis safe gas reimbursement script  Breakdown:     New Developer Streams (20% of pay - basic income) (goal of 7) 2520 GTC     New Developer Streams (Other 80% of pay – contribution based) 10080 GTC   Current tokenstreams  13,661 GTC   Prototype Builds 40000 GTC   Product Builds 40000 GTC   Emu - Project Managment/Coordination 4515 GTC   Jason - Developer Advocate 4320 GTC   Bliss - Head of Prototype 6000 GTC   Marketing (Matt Carano, MMM) 1800 GTC   Bookkeeping/Tax Filing 1000 GTC   Reimburse Austin Request here  7147.71 GTC    https://gnosis-safe.io/app/eth:0x230Fc981F7CaE90cFC4ed4c18F7C178B239e5F9F ",
                    "links": [
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gov.gitcoin.co/t/moonshot-collective-target-state/9648",
                        "https://gnosis-safe.io/app/eth:0x230Fc981F7CaE90cFC4ed4c18F7C178B239e5F9F/balances",
                        "https://gnosis-safe.io/app/eth:0x230Fc981F7CaE90cFC4ed4c18F7C178B239e5F9F",
                        "http://GreatestLARP.com",
                        "https://gnosis-safe.io/app/eth:0x5558bCC7E1ebf4A18c3CEdB321F4F9737839172E/transactions/history",
                        "https://pay-party-dev.herokuapp.com/",
                        "https://multidrop.surge.sh/",
                        "https://tokenstream.party/",
                        "https://docs.google.com/document/d/1TqOsbnLXAbJUspsC-k1Cn_rOwd60AMmmL6x7N6TLux8/edit",
                        "https://gnosis-safe.io/app/eth:0x230Fc981F7CaE90cFC4ed4c18F7C178B239e5F9F",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110",
                        "https://gov.gitcoin.co/t/coordination-party-kit/9231/7",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862"
                    ],
                    "GPT-summary": "The post is a proposal from the Moonshot Collective requesting funding from GitcoinDAO Treasury for Q2 2022. The proposal explains the objectives of the workstream, the accomplishments of the previous quarter, and the breakdown of the budget request. The post also includes positive feedback from contributors and extends an invitation to collaborate.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Token economics",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.252761164274322
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#2",
                    "likes": "2",
                    "time": "07/02/2022-16:17:42",
                    "content": "Thanks for putting this together Austin.     austingriffith:  We would like 130k GTC    Whew, $1.1M is certainly a big jump over the last quarter.     austingriffith:  Current Mulit-Sig signers (⅔):   I would love to see this expanded to a 4 of 7. I know MSC has been growing the team, and decentralizing decision making on fund appropriation would be a great step to honor the growth of the team. Further, having multisig members who are your “customers” would really enforce the feedback loop too. Not sure if you have identified who your customers are yet, but I would love to see 1 or 2 of those on the multisig to offer a signal on the outcomes you are delivering. The budget request breakdown is pretty hand wavy. Asking for 80k GTC for “product/prototype builds.” Do you have ideas on how that will be spent yet? Local contributors, outside contracting firms, etc. As I think about the budget here, with little details on the 80k, having more accountability on the multisig would be a great first step. I think about this in two ways. Low detail/accountability on the budget request, high detail/accountability on distribution of funds (more multi-sig holders). Or perhaps the inverse. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.981547619047619
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/James",
                    "index": "#3",
                    "likes": "4",
                    "time": "07/02/2022-17:24:30",
                    "content": "The impact Moonshot Collective has had across the DAO has been amazinggg - One exmaple i wanted to highlight:     austingriffith:   Moonshot bots raised 786.24 ETH, $2.5mm at the time of the raise    Raising over $2.5m for public goods should act as a masssive signal for the Moonshot collective to the Gitcoin DAO. +1 +1 on this proposal ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/austingriffith",
                    "index": "#4",
                    "likes": "6",
                    "time": "08/02/2022-02:46:36",
                    "content": "130k GTC isn’t really a big jump. Our first quarter we asked for 40k and our second quarter we asked for 100k. Then we skipped a quarter and now we’re asking for 130k. We successfully deployed that GTC to build a lot prototypes and return (+3mm?) in public goods funding to the Gitcoin multisig. We will put this funding to good use and empower builders to create next generation dao tooling. I’d love to get more customers as signers on the multisig. We’ll keep our eyes out for good candidates. Basically we just make a few signatures a month because of other tooling in place like our “baby multisig” that makes GTC distribution to builder streams a breeze. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.28125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jaxcoder",
                    "index": "#5",
                    "likes": "0",
                    "time": "08/02/2022-13:58:10",
                    "content": "I would have to agree 100%, the Mars Shot Bots Nowonder and Bliss threw together also raised 140K+ for public goods🔥 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#6",
                    "likes": "0",
                    "time": "08/02/2022-19:01:45",
                    "content": "    austingriffith:  Basically we just make a few signatures a month because of other tooling in place like our “baby multisig” that makes GTC distribution to builder streams a breeze.   I would love to learn more for the DAO Ops workstream too  I am supportive of the Budget proposal as is, and I am looking forward to seeing if the Q1/Q2 OKRs are met  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.175000000000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/02/2022-04:18:52",
                    "content": "One clarification @austingriffith - Is this budget for one season (S13) or is this for two (S13, S14)? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#9",
                    "likes": "0",
                    "time": "09/02/2022-14:56:03",
                    "content": "Thanks Kyle! We would love to share how we use our products with the ops workstream! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#10",
                    "likes": "0",
                    "time": "09/02/2022-15:00:28",
                    "content": "This budget request is for one season (S13 - Q2 2022) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#11",
                    "likes": "2",
                    "time": "09/02/2022-16:34:44",
                    "content": "I’m in support of this budget. I think Moonshots are the heart of why DAOs exist. The amount raised is greater than the amount asked for. This seems like a reasonable jump to me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#12",
                    "likes": "2",
                    "time": "09/02/2022-19:55:33",
                    "content": "fully in support of this - wanting to see a lot of what the work stream ahas built at Shelling Point ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#13",
                    "likes": "1",
                    "time": "09/02/2022-23:21:44",
                    "content": "hrm, this is quite the budget for a single season, with little to no insight into how the funds are being spent, outside of the OKRs. $700k for three months feels like it should come with more insight into which projects are getting what part of the budget. Do you have any thoughts on how you plan to staff or spend the funds across the two initiatives (protocol and product development)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.141071428571429
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#15",
                    "likes": "1",
                    "time": "10/02/2022-22:56:22",
                    "content": "Can you help to understand what kind of insights and metrics into how these funds are being spent you would want to see? The OKRs are the key results for the seasons, as a collective we were under the impression that they are the primary way we should be governed.    Coordination.Party Kit 🧙 🧙‍♀️ Workstream Discussion       In the month of January, 100% of moonshot pay was made using moonshot built products. This is a major milestone; all of our payment products are in a working state!  At the Collective we currently have 16 active contributor tokenstreams. While our compensation policy has not been completely ratified (see OKR’s and planned accomplishments here) these streams serve as basic income for our contributors. We target ~20% of total compensation with these streams. The other 80% of contributor pay comes …     ",
                    "links": [
                        "http://tokenstream.party",
                        "https://gov.gitcoin.co/t/moonshot-collective-workstream-budget-request-q2-2022/9824"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.372632575757575
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/MercuricChloride",
                    "index": "#16",
                    "likes": "1",
                    "time": "11/02/2022-00:17:45",
                    "content": "100% support of this. Not an unreasonable jump in funding given the scaling proposed as well as the success of the moonshot ventures so far. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#17",
                    "likes": "3",
                    "time": "11/02/2022-02:39:17",
                    "content": "It’s definitely a large budget but I’m supportive of this request due to the success of prior projects, exciting roadmap, total amount the moonshot collective has raised for public goods, and that a quarter was skipped. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.743303571428572
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#18",
                    "likes": "2",
                    "time": "11/02/2022-20:20:14",
                    "content": "Yes. Most workstreams have a transparent budget on funding planned for the duration of their season. Here is FDD’s, here is DAO Ops, etc. FWIW, this is an area I hope that DAO Ops can help… both in sharing a budget template and helping MSC operationalize it if there is interest. Given the sizable request, it would be great to know that there is a plan for the money and that it’s not being spent without a plan. I still have a hard time voting yes on a budget of this given the lack of budget, and progress on some of the tools (ie, missing market fit). The “success” to date has largely come from raising funds for public goods, which were (primarily) Kevin and Austin YOLO efforts. I am really bullish on the tools MSC are building, and I would love to see more thought given to how those will become prolific amongst DAOs. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1kXrRT0qeP9DKuqJ17lAuCGEsnePQkn9Vw46rVCfsMi0/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.217757936507936
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#19",
                    "likes": "4",
                    "time": "14/02/2022-14:14:22",
                    "content": "    kyle:  The “success” to date has largely come from raising funds for public goods, which were (primarily) Kevin and Austin YOLO efforts.   It is true that Moonshot Bots, which raised $3mm for Grants matching pool, was mostly a Kevin/Austin YOLO to start. I’d just briefly challenge this assertion by pointing out a few counter examples that the collective has built:  Successes at Moonshot that did not deeply involve Austin/Kevin   Quadratic Trust, was led by @anneconnelly and her team with only recruiting/advisory support from myself and Austin, and was able to build & ship a social quadratic curation experience that successfully was used by hundreds of people during GR11, and proved that Quadratic Funding can be used for curation (something that’s been on the core team backlog for a very long time).  The Greatest LARP was built by a half dozen people from the collective (though it was my vision), and raised $500k for public goods + the comic was read thousands of times.  Tip.Party, TokenStream.party, and pay.party, and the inchoate multisiend app have each been used dozens of times to reward Moonshot Devs, and are run almost entirely without my involvement.  Though to your point these tools need more work to cross-pollinate to other DAOs. There will be a half dozen marketing activations at schelling point driven by Moonshoters with almost no involvement by myself/Austin. An art gallery, actors doing on-theme performances, NFT auctions, a POAPathon, and a few other bespoke activations.  I cannot say how successful these are yet, perhaps on Friday we can.   Successes in Rapid Prototyping at Gitcoin And even before the Moonshot Collective launched in July 2021, there was a track record of successful YOLO innovation happening in/around GitcoinDAO.  For example:   Fundoss - a QF application for web2 that successfully raised $95k for web2 oss. (2021)  Downtown stimulus - a QF application that successfully raised $45k for Boulder COVId relief. (2020)  WTFisQF - an easy QF calculator/explainer, used by 100s of ppl per month.  (2020)  QuadraticVote.co - an easy tool for hosting Quadratic Votes, used by 100s of ppl per month (2020) Hosting Sustainweb3 - a one day conference about OSS sustainability, with attendance in the 100s and video watches in the 1000s (2020) the launch of Gitcoin Labs and the Burner Wallet, with my friend Austin Griffith (2019) Various experiments & products launched on Gitcoin.co including small experiments like Gitcoin Quests, Gitcoin Kudos, the Quadratic Lands, an avatar builder, a quadratic funding social network, and other tools that later evolved into being flagships like Gitcoin Hackathons or Gitcoin Grants. (over the years) a handful of other tools that recorded here and here (over the years)  Of course, Moonshot Collective does not take credit for the innovation that precedes it, but it is cut from the same cloth of this innovation - so it is worth mentioning it to give full context.  In Conclusion It is true that the Moonshot Collective does need more work to get to its target state, and the recent additions of two product managers and a project manager (and the systems they set up) are investments in getting more systematic about the progress towards product market fit. But I think we should start that journey with a consensus that the tools sometimes reach product market fit right now. I also want to dispel the notion that the only successes have come from myself/Austin  (they have been the result of the work of ppl in many corners of the collective). ",
                    "links": [
                        "https://twitter.com/owocki/status/1291746535403741184",
                        "https://wtfisqf.com/",
                        "https://quadraticvote.co/",
                        "https://www.youtube.com/watch?v=wWXdi891b28&list=PLvTrX8LNPbPnJYe0v37HL4T8dsilPQWTE&index=1",
                        "https://gitcoin.co/labs",
                        "http://Gitcoin.co",
                        "https://gov.gitcoin.co/t/a-quadratic-funding-powered-social-network/9462",
                        "https://github.com/gitcoinco/skunkworks/issues?q=is%3Aissue+is%3Aclosed",
                        "https://github.com/gitcoinco/skunkworks/issues?page=3&q=is%3Aopen+is%3Aissue",
                        "https://gov.gitcoin.co/t/moonshot-collective-target-state/9648",
                        "https://twitter.com/MoonshotCollect/status/1491207970994089985"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.110106382978724
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#20",
                    "likes": "1",
                    "time": "14/02/2022-14:20:48",
                    "content": "    kyle:  I am really bullish on the tools MSC are building, and I would love to see more thought given to how those will become prolific amongst DAOs.   @laura.fletcher @brent may be able to comment about MSC GTM plans.  i know a  lot fo user research has been happening. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/laura.fletcher",
                    "index": "#21",
                    "likes": "2",
                    "time": "14/02/2022-14:55:45",
                    "content": "@kyle We are also really excited about what MC has developed so far. Our next big questions are around whether the problems these tools solve for our experienced widely across DAOs, and if the specific solutions we’ve built for them (the tools themselves) are meaningful solutions to those problems. We are tackling this in two ways:  Short term: cleaning up the usability and intuitiveness of the tools we’ve already built (specifically pay, tokenstream, and tip) and getting them into users hands Longer term: digging into evidence-based research about how DAO workstreams outside of our own function, drawing a map of a typical DAO’s landscape, identifying the big white spaces, and going after solving those big, exciting problems  Tip will be going live at Schelling Point (woohoo!) and we plan to have Pay certainly and Tokenstream hopefully in a much more usable place by the end of the month. Excited to see what we can learn! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.919481807874664
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#22",
                    "likes": "2",
                    "time": "14/02/2022-15:48:27",
                    "content": "    owocki:  I also want to dispel the notion that the only successes have come from myself/Austin (they have been the result of the work of ppl in many corners of the collective).   I appreciate you noting this and I want to echo that this is my sentiment as well. The work of the collective is and needs to continue to be stronger than just the funding brought in for matching pool (though that is important). The callout on other projects is helpful, but my primary concern is that the funding feels immense without clear details on how to spend it. I am being critical right now of another workstream to request a large reserve (which is contentious), and to instead use the governance process quarterly to ensure they are accountable. It feels appropriate to ask the same of MSC – to have a budget with details on how it plans to spend and not make requests that are too large for their needs. Is this something DAO Ops can help with? How can we support you all with this type of planning? @emudoteth ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.957417582417582
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#23",
                    "likes": "0",
                    "time": "14/02/2022-17:20:45",
                    "content": "    kyle:  Is this something DAO Ops can help with? How can we support you all with this type of planning? @kdm5126   It would be very welcomed if DAO Ops could help with this planning next season! Internally we have also started to form a budget/governance working group to assist in preparation and communications for season 14. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#24",
                    "likes": "1",
                    "time": "15/02/2022-06:58:50",
                    "content": "    emudoteth:  This budget request is for one season (S13 - Q2 2022)   Just to clarify here (also for you @austingriffith) we consider S13 to be basically Q1 2022, as agreed by all workstreams during the CSDO call on January 18th. No Workstream has received budgets for ‘Q1’ (DAOops & PGF proposals passed previously, but they will now also follow the seasons), dates: 2.1 to 4.30 (GR13 | 3.9-3.24). So no seasons/quarters have been skipped here. I agree with @kyle’s feedback that this is a massive request by a workstream that has work to do on internal organization & communication. At the same time the output has been impressive and has resulted in millions of funding for public goods, and big strides are being made on project management by hiring new people. I will probably abstain from voting on this proposal because I’m also missing transparency on how funds will be spent, and want to hold all workstreams to the same standards. Unfortunately I have no time to dive/dig deeper by myself at this moment but knowing some of the people in this team & the massive and diverse talents they bring to the table I’m looking forward to what’s next, including more in-depth reporting & budget planning! #publicgoodsaregood ",
                    "links": [
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kris-s-voter-guide/9895"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.26489898989899
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Globallager",
                    "index": "#25",
                    "likes": "0",
                    "time": "19/02/2022-07:33:42",
                    "content": "Would appreciate some clarification / further breakdown on the budgets of 40,000 GTC each for “Prototype Builds” and “Product Builds”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#26",
                    "likes": "2",
                    "time": "21/02/2022-11:55:47",
                    "content": "This is a massive funding request. I would like to see better reporting of how the budget plans to be spent much like the FDD workstream does. In fact it would be better if there is some coordination between the different workstreams on funding requirements and reporting so it’s easier for stewards to provide a proper judgement. The moonshot collective has produced some cool stuff but I am afraid that without some proper reporting and and accountability process we won’t be able to really judge funding requests and we will either be left to flat-out decline or accept anything that comes our way. That said I don’t want to block this funding request as I have also been critical of FDD for different reasons and I did not block that either. But please let’s improve for next season otherwise I will have to either start rejecting or abstain from voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.484375
                }
            ]
        }
    ],
    "group_index": "675"
}