{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855",
            "title": "The Great Bear, The Great Reset, The Great Revival ",
            "index": 9855,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "15",
                    "time": "09/02/2022-05:24:11",
                    "content": "I’ve previously written about Gitcoin’s history from 2017 to today. The objective of that post was to produce a chronological account of Gitcoin’s history. This post is also about Gitcoin’s history, but it’s arranged differently - The objective of this post is to convey the major challenges that we’ve overcome, and to share how they have deeply shaped how I think about building in web3.  1444×938 160 KB   The Great Bear The Great Bear started in December 2018, but to understand it, you need to understand the 2017 ICO craze. During the 2017 ICO craze, ETH went from $8 up to $1400. Consensys, which funded Gitcoin in it’s early days (starting in November 2017), grew from tens of people to 1500 people. Gitcoin grew from just myself working part time to a team of 13. It was an absolute mania - there was no economic gravity - money and budgets were infinite, and projects across the space were hiring in droves… The Great Bear started in 2018 as the market hit its malaise, but it really hit its apex in December 2018 - ETH drew down from $1400 a year before to only $80. This is when the music stopped. Consensys began laying off it’s staff - and many of the projects that previously did not have to worry about revenue went to being guided to “get profitable this quarter”. We were assigned a “Spinout Shepherd” and instructed that we had 3 months of capital left. From December 2018 to Summer 2020 was the Great Bear. Asset prices had gone done 95% in the case of the large caps like ETH/BTC. Some ICOs went down 99.9% or more. These were not fun times. I’ve also called these years The Struggle years. Our team of 10 was funded by Consensys for these years, and we struggled to get revenue, to keep morale up, and we struggled as we saw many changes in the ecosystem at Consensys during these years. Consensys divided into Consensys Software Inc and Mesh Inc - we were slated for the later (and somehow, whether by luck or by skill, our 3 months of capital kept getting extended). Morale was hit hard during these years. In retrospect, I think we all thought we were missionaries during the Bull Market, but when the Great Bear, we realized how many of us were mercenaries. We were unable to secure budget for compensation increases through these years - and we because of that, we didnt do performance reviews. Stuck between a HR department whose attitude was “youre still lucky to be here”, many questions about our business model and longevity, and a team who was burnt out, our progress ground to a halt on many important initiatives. Our culture suffered. Our communication suffered. Our trust suffered. I worked insane 13 hour days and just YOLO built features like Gitcoin Quests or the Gitcoin Avatar builder. During this time, we fell into a habit of hiring contractors to build new product initiatives like Grant Collections or the Quadratic Lands because the core team was unable to coordinate to push these things forward. Gitcoin almost did not survive the Great Bear. But we did. And to understand that, let us next talk about the Great Reset.  The Great Reset The foundation for the Great Reset started being laid in winter 2020. It was when we began to pay down the debt from the Great Bear. The debt was (in some cases “is”):  A fatigued team with many members who did not have a role/person fit any longer or were stagnating in their career growth. We had to turn the team to solve these problems. A product with centralization debt & tech debt - which no one seemed to be able to create new forward progress on. We had to rebuild this team & decentralize our products to solve this problem. A very “0 to 1” culture, which needed to figure out how to pivot to “1 to 10”. Instead of building the machine, we need to build the machine that builds the machine. Other cultural problems including hero culture, a lack of good communication, and a lack of focus on looking at things like a customer. We were very inside out, as opposed to outside in. Organizational debt in having depended on Consensys HR,Finance, and Legal for years. We had to spin up our own departments to do these things. Centralization debt in the form of a US based company, hardly the best foundation for a public goods funding product aimed at a global decentralized ecosystem.  Luckily by the Great Reset, we had some strong tailwinds - we had found our product/market fit - Vitalik had written a few blogs about us. We had supported many important projects/developers through the bear market, we had begun to show some revenue thanks to our Hackathon business unit, and our (sometimes) brand was strong with our target customers because of it. Also, the market for funding web3 projects was recovering, and that never hurts  The Great Reset was greatly accelerated by my friend & former coworker Kyle Weiss joining Gitcoin (a Leadership Reset) + the round we raised from Paradigm to allow us to spin out of Consensys + become an independent entity (a Legal Reset if you will!) But the Great Reset started for real when we launched the Quadratic Lands and announced we would be decentralizing Gitcoin Grants from a platform into a DAO & a protocol. Since then, the DAO has laid out plans for how to decentralize Gitcoin’s product suites and begun laying the foundation for, and an alpha of, decentralized Gitcoin Grants. We’ve also seen the DAO innovating on governance, starting with the Quadratic Lands and more recently with the Stewards Council and Steward Report Cards. Many of the inchoate workstreams began to get their legs under them. Oh, and we’ve also seen 400% growth in the marketplace during the same time period  There are still problems though. The dGrants protocol is not ready for prime time yet. It’s hard to make much forward progress on the cGrants platform. We still have to fully round the corner from “0 to 1” culture to an effective “1 to 10” culture. We still need to pay down our centralization debt. We still need to figure out onboarding & orientation of DAO contributors at scale. We still need to build the Gitcoin Operation system - how the DAO works together to solve these problems. It is during The Great Revival that I believe these problems can be solved.  The Great Revival From where we are today, I am hoping that we will begin to see what I call “The Great Revival”. The Great Revival is the DAO “growing up”. It is unleashing a beautiful decentralized fractal of growth & impact.  Right now we’re All Theory No Action, and thatll change in the Great Revival. I think it looks like this:  Empowered & accountable workstreams working together to grow & decentralize Gitcoin - guided by the Stewards. Focusing on deliberately sculpting our culture. Turning from 0 to 1 culture to 1 to 10 culture. Focusing on customer outcomes. Creating great onboarding & orientation rituals - a culture where leaders dont grab power or create fiefdoms, but where people are always recruiting & mentoring their replacements… New innovations on decentralized DAO based Governance and DAO based coordination. The ImpactDAO/ProtocolDAO Sandwich emerging. Growth, but to do good - not just for growths sake. New Innovations like Gitcoin Aqueduct and the Public Goods Coalition. A muscular product organization (one that ships quality code consistently, that leads the market by innovating & enabling others to innovate on top of their work. ) Beginning to have product velocity again. Giving the cPlatform a soft landing - The dGrants Protocol + dPOPP launching and being well documented platforms that hundreds of developers can build public goods + sybil resistant technology upon.  There is a tradeoff between speed & anti-fragility. In the past, we had no budget + so we were focused on efficiency.  Now we’re focused a bit more on anti-fragility/decentralization.  Theres an old trope in startups that you focus on the “people, then the products, then the profits”. I am happy to say that a major reason why I have a ton of hope for the Great Revival is the next generation of leaders who have emerged in the DAO to build the social & cultural foundation for our mission in 2022 and beyond. Some of the areas I’m particularly excited about:  Gitcoin Product Group: Leaders like VP of Product Lindsey Thrift & VP Engineering Kevin Olsen who will be working on making our product teams into great places to work + seeing that they are a lean mean product machine that builds solid products & consistently innovates upon them. All of the folks working on governance innovation & preserving Gitcoins legitimacy: Especially Loie, Kris, Simona, Kyle, Sam, Disruption Joe, Scott, the Moonshot Devs working on Governance/Coordination tools. All of the workstream leads within Gitcoin DAO & the dozens of people working on each workstream. The Gitcoin Holdings Leadership team & members of the Holdings Staff. The dozens of other leaders that I do not personally know about, but are contributing value in their respective groups.  The Great Revival starts with people - I am so proud of what we have built thus far, and I’m looking forward to this next chapter of Gitcoin that is led by the new faces that we’ve brought on board. I hope that we do not go through another Great Bear together, but I am sharing this context in case we need to. Gitcoin is certainly better capitalized than it was during the Great Bear. I hope we do not need to go through another Great Reset, and as Gitcoin Grants becomes an unstoppable protocol for funding Grants, I am hopeful we will not need to. Gitcoin certainly has more momentum & resources than it did when we made the mistakes that led to the Great Reset. I hope that this post was helpful in sharing context on some of our past challenges - I am looking forward to solving these challenges together with you. See you all at the Gitcoin DAO retreat. ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-brief-history-of-gitcoin-from-2017-2022/9431",
                        "https://media.consensys.net/gitcoin-joins-consensys-announces-pilot-projects-f5a0955de9d6",
                        "https://thenextweb.com/news/consensys-blockchain-layoffs",
                        "https://techcrunch.com/2012/06/14/the-struggle/",
                        "http://gitcoin.co/quests",
                        "https://gitcoin.co/landing/avatar",
                        "https://avc.com/2013/08/mba-mondays-turning-your-team/",
                        "https://twitter.com/owocki/status/1329925310599479296",
                        "https://decrypt.co/66541/ethereum-gitcoin-raises-11-million-spins-out-consensys",
                        "https://www.youtube.com/watch?v=mTU6J4WTPtk",
                        "https://gitcoin.co/blog/its-time-to-decentralize-gitcoin/#:~:text=A%20decentralized%20Gitcoin%20is%20flexible%2C%20antifragile%2C%20collaborative%2C%20and%20global,that%20will%20strengthen%20our%20species.",
                        "https://gov.gitcoin.co/t/how-might-we-decentralize-gitcoin/8734",
                        "https://twitter.com/owocki/status/1469283258617630723",
                        "https://gov.gitcoin.co/t/introducing-the-steward-council/9485",
                        "https://gov.gitcoin.co/t/introducing-steward-report-cards/8712",
                        "http://gitcoin.co/results",
                        "https://www.youtube.com/watch?v=Dj_b3QOEFYU",
                        "https://avc.com/2013/08/mba-mondays-turning-your-team/",
                        "https://gov.gitcoin.co/t/the-steward-council-formation-mandate/9843",
                        "https://gov.gitcoin.co/t/coordination-party-kit/9231",
                        "https://gov.gitcoin.co/t/the-impactdao-protocoldao-sandwich/8944",
                        "https://gov.gitcoin.co/t/gitcoin-aqueduct/9684",
                        "https://en.wikipedia.org/wiki/Antifragility",
                        "https://www.linkedin.com/in/thriftlindsey/",
                        "https://www.linkedin.com/in/kevinolsen/",
                        "https://gov.gitcoin.co/t/knowledge-transfer-who-is-a-cofounder-of-gitcoin/11371/4",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862",
                        "https://gov.gitcoin.co/t/where-is-the-fire-around-this-fire/10664",
                        "https://gov.gitcoin.co/t/knowledge-transfer-hardness-a-feature-of-gitcoin/11508",
                        "https://gov.gitcoin.co/t/abundance-scarcity/10045",
                        "https://gov.gitcoin.co/t/knowledge-transfer-gitcoin-grants-wall-of-love/11569",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/dao-vibes-1-12-3-2/9995",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
                        "https://gov.gitcoin.co/t/03-16-dao-vibesss/10191",
                        "https://gov.gitcoin.co/t/wartime-dao-peacetime-dao/10228",
                        "https://gov.gitcoin.co/t/the-plateau-of-productivity/10269"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.364844746638225
                }
            ]
        }
    ],
    "group_index": "680"
}