{
    "poll_list": [
        {
            "id": "0x79e8ca9c2f8af4b606cbba35a478e9fc2080d48d1fd80300deeb63245a148768",
            "title": "Gitcoin // Radicle Public Goods Alliance",
            "discussion": "https://gov.gitcoin.co/t/gitcoin-radicle-public-goods-alliance-temp-check/10825",
            "body": "Forum post: https://gov.gitcoin.co/t/gitcoin-radicle-public-goods-alliance-temp-check/10825\n\n## Summary\n\nWe propose a Public Goods Alliance be formed between Gitcoin and Radicle. Gitcoin and Radicle will provide a mutual grant of their respective native tokens (GTC and RAD) to the partner DAO’s treasury. Voting power from these tokens will be delegated to multisigs controlled by the partner DAO. Gitcoin will receive a range of RAD (dependent upon the final grant rate) and Radicle will receive 500,000 GTC, making both DAOs top 10 delegates in one another’s governance [1]. \n\n### Context \n[Llama](https://llama.xyz) builds economic infrastructure for DAOs. We are an opinionated layer on top of DeFi protocols that helps DAOs take treasury actions including treasury diversification, liquidity provisioning, token swaps, and more. As part of our goal to grow the DAO economy, Llama has engaged with key stakeholders from the Gitcoin (Scott) and Radicle (Abbey) communities to propose a Public Goods Alliance. We presented our plan to Gitcoin’s Mutual Grants Committee and, after incorporating feedback from the committee, would now like to present the alliance to the broader Gitcoin community. You can view some of our work [here](https://llama.xyz/community). For more on Llama and our initiatives, see below. \n\n### Overview of Radicle \nRadicle is a decentralized code collaboration network built on open protocols, allowing developers to collaborate on code without trusting intermediaries. Radicle provides the benefits of a centralized code collaboration platform while retaining Git’s peer-to-peer nature.\n\n## Purpose \nAs web3-native DAOs, Gitcoin and Radicle share similar missions of growing the public goods ecosystem. The Gitcoin and Radicle communities have rallied around this public goods mission and informally worked together over the last few years, co-hosting events and integrating Radicle in Kernel. In the future, Gitcoin and Radicle can benefit from more product integrations and a closer relationship.  As the two operate in similar spaces and have complementary focuses, Llama believes a formal Public Goods Alliance between the two DAOs would be mutually beneficial.  We view this alliance as a unique opportunity to formalize the partnership that has developed over the last few years by gaining a governance stake in each other’s communities. The alliance will allow the communities to: \n* ***Collaborate on a shared vision through governance in each other’s communities***: The mutual grant makes Gitcoin and Radicle major governance stakeholders in one another’s communities. Each community will have influence in the other’s governance process, enabling them to best represent their interests and to more closely collaborate on a shared open-source vision. \n* ***Develop synergistic features and products***: A formal partnership and vested token interest creates opportunity for closer collaboration on features and products that will benefit both communities. This could provide the necessary support for joint development on things such as using Radicle’s decentralized identity for Gitcoin Grants and Gitcoin becoming a de facto funding mechanism for open source projects on Radicle. \n* ***Set precedent for future community alliances***: Both Gitcoin and Radicle’s treasury strategies outline the basis for mutual grants and community collaborations being influential to the success of the protocols. This alliance can serve as a basis and provide the template for future collaborations for Gitcoin, Radicle, and the larger web3 ecosystem. In the future, and with alliance-member approval, more DAOs could be brought into the alliance. \n* ***Diversify each DAO’s governance base***: Today, the distribution of voting power at both DAOs is concentrated in the hands of internal contributors. Both DAOs would benefit from a more diverse voter base, especially one that includes a like-minded partner DAO as one of its top stakeholders. To achieve this, Llama proposes that Gitcoin receive RAD (depending on final grant rate) and Radicle receive 500,000 GTC, formalizing the alliance between the two DAOs and making each DAO a top 10 delegate in each other’s governance. \n\nAfter the proposal is executed, both DAOs agree to hold the others’ tokens for a minimum of 2 years. \n\n## Proposed Voting Process \nTwo committees (one committee from each community) of 3 representatives will be chosen to focus on metagovernance in each community. 2 representatives will come from the respective community, while 1 representative will be from the Llama team. Community representatives should have a similar level of engagement as Gitcoin Stewards; they should have the context needed to make decisions on most proposals that Radicle is putting up for votes.  \n\nThe committees should vote independently, though the two should collaborate on joint governance proposals and initiatives relating to the strategic alliance. \n\nThe committee will be responsible for keeping track of all proposals in the other community and bringing them to their respective community for discussion. For each proposal, the committee will vote on behalf of their respective community, informed by their community’s values, the goals of the Public Goods Alliance, and feedback from the broader community.  \n\nVotes will be executed out of a multisig controlled by the Metagovernance Committee. Upon receiving the mutual grant, the Treasury will automatically delegate votes to the multisig. \n\n## Reporting & Criteria for Success \nIn order to allow the communities to evaluate the success of the alliance, it’s important to provide comprehensive, objective reporting on how the partnership is working. Reporting should be done on a monthly and quarterly basis to share results with both communities. Below are several ideas about how to gauge success of the alliance. \n* Governance  \n    * Participation rate in each other’s governance votes \n    * Number of proposals posted in each other’s forum by the committee  \n    * Number of comments posted in each other’s forum by the committee  \n    * The impact of cross-governance participation, with a particular focus on the major or contentious proposals \n* Social  \n    * Number of co-sponsored events and their attendance  \n    * Community sentiment regarding the partnership and overall governance involvement (e.g. community members’ willingness to hold the other protocol’s tokens, voting on the other community’s proposals) \n* Product  \n    * Number of development hours contributed to joint projects  \n    * Joint features / products / integrations shipped or in-flight \n\nThe quarterly review might include the above information and additionally report on: \n* Furthering Gitcoin and Radicle’s primary mission  \n    * Whether and how the partnership has helped Gitcoin build and fund public goods on web3  \n    * Whether and how the partnership has helped Radicle develop resilient, peer-to-peer collaboration software \n* Collab / interoperability  \n    * Cross-community interoperability and its growth trajectory  \n    * Other synergies, or the lack thereof  \n\n## Ragequit Options \nIn the event that one party wants to reverse the deal after the mutual grant has been executed, Gitcoin and Radicle will need to strike a new agreement and run it through the governance process. Considering the operational complexities, compromise of the future roadmap, and damage of capital and goodwill the other community may endure, the party that initiates the reversal should reasonably expect less lenient terms, such as a partial return of the originally granted assets. Each DAO may choose to leave the alliance and return tokens within one month of the proposal being executed. \n\n## Ideas for Extensions of the Alliance \nWe view this mutual grant as just the beginning of a long alliance between Gitcoin and Radicle. In the future, we would like to explore more options to further the alliance. Several ideas include: \n* Gitcoin and Radicle commit funding to a jointly-governed pool and use it to advance public goods (grant programs, product development, etc.) \n* Having new public-goods-centric DAOs join the alliance \n\n## Asks from the Community \n*We are looking for 2 community members to serve on the Metagovernance Committee. If you are interested, please reach out to Scott or Dan.* \n\n--- \n\n ##### *[1] Source: [Radicle delegates](https://www.tally.xyz/governance/eip155:1:0x690e775361AD66D1c4A25d89da9fCd639F5198eD), [Gitcoin delegates](https://www.tally.xyz/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489).* \n\n--- \n## About Llama \nLlama is building economic infrastructure for DAOs. We have worked with some of the leading DAOs, including Aave, Uniswap, dYdX, Gitcoin, Radicle, PoolTogether, FWB, Harvest Finance, and Fei Protocol, among others. Llama has implemented on-chain proposals, constructed treasury strategies, designed liquidity incentive programs and on-chain indices, and built analytics dashboards and financial reports. Llama’s 45 contributors are among the most active in the DeFi and DAO ecosystem and include engineers, DeFi strategists, data analysts, quants, and accountants.",
            "choices": [
                "FOR",
                "AGAINST",
                "ABSTAIN"
            ],
            "scores": [
                3530895.556044378,
                49.14519179530084,
                160436.82944126564
            ],
            "start": 1655308740,
            "end": 1655740500,
            "snapshot": "14968318",
            "state": "closed",
            "author": "0x10D6d2e343281D388291A3e02f3293AaEdA67178",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "Gitcoin // Radicle Public Goods Alliance",
            "date": "Proposed on: Sep 10th, 2022",
            "yes_votes": "6.94M",
            "no_votes": "4.39"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-radicle-public-goods-alliance-temp-check/10825",
            "title": "Gitcoin // Radicle Public Goods Alliance [Temp Check] ",
            "index": 10825,
            "category": [
                "\\xf0\\x9f\\xa4\\x9d Partnerships"
            ],
            "tags": [
                "stewards",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/schlabach",
                    "index": "#1",
                    "likes": "11",
                    "time": "06/06/2022-18:57:27",
                    "content": "Authors: @schlabach, @HelloShreyas from Llama  Summary We propose a Public Goods Alliance be formed between Gitcoin and Radicle. Gitcoin and Radicle will provide a mutual grant of their respective native tokens (GTC and RAD) to the partner DAO’s treasury. Voting power from these tokens will be delegated to multisigs controlled by the partner DAO. Gitcoin will receive a range of RAD (dependent upon the final grant rate) and Radicle will receive 500,000 GTC, making both DAOs top 10 delegates in one another’s governance [1].  Context Llama builds economic infrastructure for DAOs. We are an opinionated layer on top of DeFi protocols that helps DAOs take treasury actions including treasury diversification, liquidity provisioning, token swaps, and more. As part of our goal to grow the DAO economy, Llama has engaged with key stakeholders from the Gitcoin (Scott) and Radicle (Abbey) communities to propose a Public Goods Alliance. We presented our plan to Gitcoin’s Mutual Grants Committee and, after incorporating feedback from the committee, would now like to present the alliance to the broader Gitcoin community. You can view some of our work here. For more on Llama and our initiatives, see below.  Overview of Radicle Radicle is a decentralized code collaboration network built on open protocols, allowing developers to collaborate on code without trusting intermediaries. Radicle provides the benefits of a centralized code collaboration platform while retaining Git’s peer-to-peer nature.  Purpose As web3-native DAOs, Gitcoin and Radicle share similar missions of growing the public goods ecosystem. The Gitcoin and Radicle communities have rallied around this public goods mission and informally worked together over the last few years, co-hosting events and integrating Radicle in Kernel. In the future, Gitcoin and Radicle can benefit from more product integrations and a closer relationship. As the two operate in similar spaces and have complementary focuses, Llama believes a formal Public Goods Alliance between the two DAOs would be mutually beneficial. We view this alliance as a unique opportunity to formalize the partnership that has developed over the last few years by gaining a governance stake in each other’s communities. The alliance will allow the communities to:   Collaborate on a shared vision through governance in each other’s communities: The mutual grant makes Gitcoin and Radicle major governance stakeholders in one another’s communities. Each community will have influence in the other’s governance process, enabling them to best represent their interests and to more closely collaborate on a shared open-source vision.   Develop synergistic features and products: A formal partnership and vested token interest creates opportunity for closer collaboration on features and products that will benefit both communities. This could provide the necessary support for joint development on things such as using Radicle’s decentralized identity for Gitcoin Grants and Gitcoin becoming a de facto funding mechanism for open source projects on Radicle.   Set precedent for future community alliances: Both Gitcoin and Radicle’s treasury strategies outline the basis for mutual grants and community collaborations being influential to the success of the protocols. This alliance can serve as a basis and provide the template for future collaborations for Gitcoin, Radicle, and the larger web3 ecosystem. In the future, and with alliance-member approval, more DAOs could be brought into the alliance.   Diversify each DAO’s governance base: Today, the distribution of voting power at both DAOs is concentrated in the hands of internal contributors. Both DAOs would benefit from a more diverse voter base, especially one that includes a like-minded partner DAO as one of its top stakeholders. To achieve this, Llama proposes that Gitcoin receive RAD (depending on final grant rate) and Radicle receive 500,000 GTC, formalizing the alliance between the two DAOs and making each DAO a top 10 delegate in each other’s governance.   After the proposal is executed, both DAOs agree to hold the others’ tokens for a minimum of 2 years.  Proposed Voting Process Two committees (one committee from each community) of 3 representatives will be chosen to focus on metagovernance in each community. 2 representatives will come from the respective community, while 1 representative will be from the Llama team. Community representatives should have a similar level of engagement as Gitcoin Stewards; they should have the context needed to make decisions on most proposals that Radicle is putting up for votes. The committees should vote independently, though the two should collaborate on joint governance proposals and initiatives relating to the strategic alliance. The committee will be responsible for keeping track of all proposals in the other community and bringing them to their respective community for discussion. For each proposal, the committee will vote on behalf of their respective community, informed by their community’s values, the goals of the Public Goods Alliance, and feedback from the broader community. Votes will be executed out of a multisig controlled by the Metagovernance Committee. Upon receiving the mutual grant, the Treasury will automatically delegate votes to the multisig.  Reporting & Criteria for Success In order to allow the communities to evaluate the success of the alliance, it’s important to provide comprehensive, objective reporting on how the partnership is working. Reporting should be done on a monthly and quarterly basis to share results with both communities. Below are several ideas about how to gauge success of the alliance.  Governance  Participation rate in each other’s governance votes Number of proposals posted in each other’s forum by the committee Number of comments posted in each other’s forum by the committee The impact of cross-governance participation, with a particular focus on the major or contentious proposals   Social  Number of co-sponsored events and their attendance Community sentiment regarding the partnership and overall governance involvement (e.g. community members’ willingness to hold the other protocol’s tokens, voting on the other community’s proposals)   Product  Number of development hours contributed to joint projects Joint features / products / integrations shipped or in-flight    The quarterly review might include the above information and additionally report on:  Furthering Gitcoin and Radicle’s primary mission  Whether and how the partnership has helped Gitcoin build and fund public goods on web3 Whether and how the partnership has helped Radicle develop resilient, peer-to-peer collaboration software   Collab / interoperability  Cross-community interoperability and its growth trajectory Other synergies, or the lack thereof     Ragequit Options In the event that one party wants to reverse the deal after the mutual grant has been executed, Gitcoin and Radicle will need to strike a new agreement and run it through the governance process. Considering the operational complexities, compromise of the future roadmap, and damage of capital and goodwill the other community may endure, the party that initiates the reversal should reasonably expect less lenient terms, such as a partial return of the originally granted assets. Each DAO may choose to leave the alliance and return tokens within one month of the proposal being executed.  Ideas for Extensions of the Alliance We view this mutual grant as just the beginning of a long alliance between Gitcoin and Radicle. In the future, we would like to explore more options to further the alliance. Several ideas include:  Gitcoin and Radicle commit funding to a jointly-governed pool and use it to advance public goods (grant programs, product development, etc.) Having new public-goods-centric DAOs join the alliance   Asks from the Community We are looking for 2 community members to serve on the Metagovernance Committee. If you are interested, please reach out to Scott or Dan.   [1] Source: Radicle delegates, Gitcoin delegates.    About Llama Llama is building economic infrastructure for DAOs. We have worked with some of the leading DAOs, including Aave, Uniswap, dYdX, Gitcoin, Radicle, PoolTogether, FWB, Harvest Finance, and Fei Protocol, among others. Llama has implemented on-chain proposals, constructed treasury strategies, designed liquidity incentive programs and on-chain indices, and built analytics dashboards and financial reports. Llama’s 45 contributors are among the most active in the DeFi and DAO ecosystem and include engineers, DeFi strategists, data analysts, quants, and accountants.  Disclaimer: This post has been provided for informational and discussion purposes only. It is not intended to, and does not, constitute legal, financial, business, or tax advice. This post should not be relied upon to provide any form of protections or business advice. No decision to buy, sell, exchange, or otherwise utilize any digital asset is recommended based on the content of this framework. ",
                    "links": [
                        "https://llama.xyz/community",
                        "https://www.tally.xyz/governance/eip155:1:0x690e775361AD66D1c4A25d89da9fCd639F5198eD",
                        "https://www.tally.xyz/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-21-2022/10911",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24-2022/11060"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.451813811188812
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#2",
                    "likes": "5",
                    "time": "07/06/2022-23:35:34",
                    "content": "It seems like a great idea at first blush and hopefully precedent-setting as you suggest. A few quick questions:   How would it help each project focus more on its core strategy?  Specifics here could include what, if any, projects currently being undertaken by GitCoin or Radicle would instead use software being built by the other entity?  This may be a question better posed to the work streams of each DAO.  To be blunt - would it help either DAO save otherwise budgeted or at least anticipated costs (bear market talk I know…)?   Does this help create more “utility” in a sense for GTC in that GitCoin would have some governance input into Radicle and vise versa?  This could be a digression however if you have a strategy you are executing to improve GTC utility, could you put this partnership into that context?   Did you decide not to mention diversification of treasury as a benefit because so far tokens are highly correlated?  I suppose also holding for 2+ years suggests the tokens won’t be able to be used directly in case of a further collapse in treasury values?   Other than the swap of the treasury tokens - are there any financial impacts anticipated?  For example, would there be a budget for committee members or is that relatively speaking immaterial?   Thank you for all the work that you and the teams must have put in thus far! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8206140350877185
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/schlabach",
                    "index": "#3",
                    "likes": "5",
                    "time": "08/06/2022-16:26:07",
                    "content": "Hey @epowell101   We see the governance committees from each community as responsible for initiating and driving these types of conversations around integrations and partnerships. Right now, there’s not an ongoing formal conversation happening between the two communities about how products can be integrated. Rather than thinking about the alliance as a cost-cutting measure, it probably makes sense to think of it more in terms of driving growth for both communities’ products. For example, how might a tighter integration with Radicle’s product line help drive growth in Grants?   There is some metagovernance power and value to the mutual grant given Gitcoin’s ability to vote in Radicle proposals. We aren’t working on any specific strategy to improve GTC utility, but there is a lot of active discussion on the forum about how to improve GTC to add more utility. I’d point you to this thread in particular.   You’re correct, there’s not much of a treasury diversification benefit. Since GTC launched in the summer of '21, the two tokens have a correlation of 0.73. Data here.  chart744×460 40.2 KB    That’s right; committee members will need to be compensated, though we’d expect those expenses to be relatively small. We wanted to get a general sentiment check on the proposal before diving into the specifics, but we can be sure to include details around that in our follow up post. Other than governance committee expenses, there should not be any other financial impact.   ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1_D6iU611RkL609L1vw7m2kKSg0Hhiw8s3EPL-1MCl5g/edit#gid=0"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.584920634920635
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/vgk",
                    "index": "#4",
                    "likes": "3",
                    "time": "10/06/2022-12:58:55",
                    "content": "Big thanks to @schlabach @HelloShreyas for putting this together! And a huge shoutout to @ceresstation and the rest of the Mutual Grants Committee for working swiftly and decisively to get us to this point. I’d love to chime in to voice my support for this temperature check - and highlight a few areas to source input from the greater community to help flesh out future iterations of this proposal.  What are the characteristics of an ideal Metagovernance Delegate from Gitcoin who will be participating in Radicle’s governance?  Let’s define what we are looking for so that we can find the best committee members and make the process more transparent.  How should we source Metagovernance Committee Members?  A couple of options have been floated including:   Nominating/sourcing from existing Gitcoin steward pool   Nominating/sourcing from Gitcoin community and ratifying delegates via Gitcoin Mutual Grants Committee    What are the requirements to maintain Metagovernance Committee membership?  Having clearly defined onramps and offramps for memberships will allow the committee to be as effective as possible. This also sets expectations to avoid future bandwidth-sucking situations that may require resolution.  One last thing I’d love to double click into is the way we are measuring outcomes for mutual grants like these:  No immediate ask here - but the Public Goods Alliance presents an opportunity for us to think deeply about what end states we are looking to drive and how we’re measuring against our progress on the way there. Overall - I am very supportive of this initiative and would love to hear from others on the points above! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3478260869565215
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Danelund.eth",
                    "index": "#5",
                    "likes": "3",
                    "time": "10/06/2022-13:36:13",
                    "content": "I echo the sentiments above - thank you to @schlabach and @HelloShreyas for the thoughtful proposal. I am in support of the strategic logic of the proposal and believe that the general governance framework makes sense. Here are the three areas I would like to understand better.   Is it better to grant the full amount at once, or can we come up with a system of deploying tokens periodically based on a consistently updated set of KPIs agreed upon by the two committees?   What are the respective powers of the metagovernance committee and the community committees? Is it purely a tie-breaker or a veto right?   Assuming I read the proposal right, the proposal would place a Llama team member on each of the community committees. While I could see an argument that this creates an independent voice in each community, it could also create an incentive for one community to capture the independent members by building a close relationship with the common source. I have high confidence in Llama, and placing a Llama team member on both committees could be the right choice, but I’d like for the community to consider the question.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9316964285714295
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#6",
                    "likes": "6",
                    "time": "10/06/2022-14:21:03",
                    "content": "Thank you Llama team for drafting this - as part of the Mutual Grants Committee, it was great for me to be able to review and offer feedback on the initial draft and I am pleased to see it was included in this temp check. Agree with many points above, including the further need for some extra clarity on certain elements. Regarding the committees, perhaps some inspiration can be drawn from the Steward Council format we currently run for Gitcoin - as we all know, I am a lover of standards so perhaps a pattern can emerge here in how we work these committees for this partnership and future ones. Would love some thoughts here - highly supportive overall. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.255102040816327
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#7",
                    "likes": "3",
                    "time": "10/06/2022-16:07:02",
                    "content": "Thank you for putting together this thoughtful proposal, I’d like to mention a few points. Here’s some things I think Gitcoin and Radicle could collaborate together:  Radicle Drips for public goods funding Radicle and Gitcoin can build a roadmap for infrastructure to create recurring funding for public goods which could sit on top of Grants 2.0 structure Potentially talent flowing between both DAOs or cross-DAO workstreams/teams  Therefore it would fulfill the 3 layers (Social, Product/Tech, Governance) of collaboration suggested by Owocki. Echoing earlier sentiments, it would be great if Radicle could also provide a preference on an ideal governance process too ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.216666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Colton",
                    "index": "#8",
                    "likes": "2",
                    "time": "10/06/2022-18:59:23",
                    "content": "I’m very supportive of this initiative. Both impactDAOs are highly aligned and this will help the communities take our coordination to the next level. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Maxwell",
                    "index": "#9",
                    "likes": "2",
                    "time": "10/06/2022-22:45:49",
                    "content": "Thank you so much for your work here @schlabach and @HelloShreyas. It’s extremely exciting to see GitcoinDAO begin to form Public Good Alliances and move into meta-governance. In addition to the governance implications of this mutual grant, I’m very excited to see ‘Social’ and ‘Product’ as two key gauges for success in this collaboration. The prospect of hosting events and greenpilling + advancing the public goods narrative alongside Radicle would be a huge win. GitcoinDAO is also at a unique inflection point as Grants 2.0 begins to materialize, and I’m optimistic about the potential for product partnerships and integrations between GitcionDAO and Radicle. Highly supportive! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.507440476190476
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/HelloShreyas",
                    "index": "#10",
                    "likes": "3",
                    "time": "10/06/2022-23:26:13",
                    "content": "Thanks for your support and thoughtful questions, @Danelund.eth.  Is it better to grant the full amount at once, or can we come up with a system of deploying tokens periodically based on a consistently updated set of KPIs agreed upon by the two committees?  We considered streaming tokens over a two year period where either community can vote to cancel the stream if goals like governance participation were not met. However, this has a few significant trade-offs:  Smart contract risk: the simplest implementation of a swap is always the best from a security perspective. Incorporating KPI options or holding tokens in an escrow contract has added risk. Market risk: two years is a long time in crypto. Token prices could fluctuate a lot and the exchange rate agreed to in the beginning may not make sense for a continuing stream and could lead to weird dynamics between the communities.  Given the trust that the Gitcoin and Radicle teams have with each other and synergies with their missions, we think it makes sense to do a one-time exchange.  What are the respective powers of the metagovernance committee and the community committees? Is it purely a tie-breaker or a veto right?  The metagovernance committee in Gitcoin will vote on Radicle’s governance proposals. They should incorporate Gitcoin’s interests and get feedback from the Gitcoin community while participating in Radicle governance. The reason for having a metagovernance committee is that it is cumersome and time-consuming for every Radicle proposal to go through Gitcoin DAO for a vote.  Assuming I read the proposal right, the proposal would place a Llama team member on each of the community committees. While I could see an argument that this creates an independent voice in each community, it could also create an incentive for one community to capture the independent members by building a close relationship with the common source. I have high confidence in Llama, and placing a Llama team member on both committees could be the right choice, but I’d like for the community to consider the question.  We’re definitely happy staying out of the metagovernance committee if needed! Not super keen or insistent being on the committee. We just think this alliance is a good thing for Gitcoin, Radicle, and the DAO space generally. Having said that, we definitely view ourselves as part of the DAOs we work with. We’re one of the most active contributors to Gitcoin so definitely understand Gitcoin’s interests well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9130541871921185
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/azeem",
                    "index": "#11",
                    "likes": "3",
                    "time": "13/06/2022-12:39:09",
                    "content": "After taking a look at this proposal, I’m very much so in favor of it. It only makes sense and the thought that went into outlining how it’s enacted, the ways to understand whether it’s been successful, timeline for being able to sell the tokens, and then even the idea of what would be needed to ragequit shows me that it’s an excellent idea. Looking forward to seeing this in action! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.195833333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#13",
                    "likes": "3",
                    "time": "17/06/2022-21:02:35",
                    "content": "Just chiming in here. I am very much in favor of this proposal as Radicle and Gitcoin are two philosophically aligned projects and set on funding opensource. The goal for which I got attracted to gitcoin in the first place. I would really like to see the governance of the 2 DAOs work closer together and try to develop synergy in products that fund opensource software. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/abbey",
                    "index": "#14",
                    "likes": "5",
                    "time": "22/06/2022-12:52:09",
                    "content": "Hey all! Abbey from Radicle here  Happy to see all of the positive reception (and great ideas!) here. Looking forward to keeping tabs on this conversation moving forward. And feel free to drop me any Radicle-specific questions! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.15909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Kydo",
                    "index": "#15",
                    "likes": "1",
                    "time": "29/06/2022-14:49:45",
                    "content": "Some amazing questions here from @vgk and I would love to put forward some ideas and maybe we can even form some standards for the future re @Pop.     vgk:  What are the characteristics of an ideal Metagovernance Delegate from Gitcoin who will be participating in Radicle’s governance?       vgk:  How should we source Metagovernance Committee Members?   I personally believe the sourcing process should be open to the general community and ratifying process should be handled by the MGC. I believe the sourcing process should be open because while the stewards are fantastic and capable, most of them already have a lot on their plates. By keeping the sourcing funnel open to the greater community, we can have more diverse and dedicated candidates. I believe the ratifying process should be decided by the MGC but the selection criteria should be clearly defined and communicated. This way we can have low overhead for the general community but have transparency at the same time. Some ideas on selection criteria:  Time commitment. Understanding of Gitcoin’s and Radical’s missions and roadmaps.      vgk:  What are the requirements to maintain Metagovernance Committee membership?   On this topic, I believe periodic default offramping is important. We are in the early process of meta-governance; therefore, our selection criteria and candidate sourcing channels will be improved in the future. By introducing new talents into the system, we can expand our search space and better optimize this committee structure and processes. Also on the representatives’ side, as this might be the first time for some of them to participate in this function, their expectation and the reality might be different. By making offramping a default, it decreases their friction to move forward. However, in the event that the representatives enjoy their work and are producing meaningful results, a proposal should be put forward by the representatives to the MGC for approval. This offramping can be done every year or six months. Although it is important to think about these questions with rigor, I believe most learning is done through experimentation and iteration. Therefore I propose a three phase sourcing process to jumpstart the process:  Initialization: (one technical person, one llama person, and scott), (committee ratifying), (mandatory offramping). 6 months period, starts asap. Experimentation: (sourcing from community), (committee ratifying), (soft offramping). 12 months period, follows the previous phase. Maturation: (sourcing from community), (committee ratifying), (formalized procedures)  *Kydo is a contributor at Llama. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.738528138528139
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Kydo",
                    "index": "#16",
                    "likes": "2",
                    "time": "01/07/2022-21:12:14",
                    "content": " Update on specification  Implementation Llama will write the code for all governance payloads and set up the multisigs for each metagovernance committees. Code will be reviewed by external reviewers and each community’s engineering team. The setup will consist of one smart contract and two multisigs. The contract will facilitate the mutual grant transferring process. It has one function which transfers RAD and GTC to the other DAO’s treasury. The two 1/3 multisigs are gnosis safes which the voting power will be delegated to. Votes will be executed out of the 1/3 multisig controlled by representatives. The multisig only holds the delegated voting power and is designed for the committee representatives to more effectively execute votes. Three governance payloads will need to be approved by Gitcoin and Radicle in this order. Payload 1 (for Radicle): approve the contract to transfer X RAD to Gitcoin’s treasury address (0x57a8865cfB1eCEf7253c27da6B4BC3dAEE5Be518) on behalf of the Radicle treasury. X will be determined by a 90-day TWAP. On the day of the first proposal on Radicle, grant rate between GTC and RAD will be determined by a 90-day TWAP calculated from Binance’s price feed. Both RAD and GTC’s volume mainly happen on Binance, therefore Binance is selected. Payload 2 (for Gitcoin): 1. approve the contract to transfer 500,000 GTC to Radicle’s treasury (0x8dA8f82d2BbDd896822de723F55D6EdF416130ba) on behalf of the Gitcoin treasury. 2. Call the grant() function in the contract. 3. Delegate RAD voting power to Gitcoin’s metagovernance committee multisig. 4. Transfer pre-defined amount of GTC to Llama treasury. Payload 3 (for Radicle): delegate GTC voting power to Radicle’s metagovernance committee multisig. Transfer pre-defined amount of RAD to Llama treasury. For Gitcoin, only one on-chain governance proposal will need to be submitted and passed for this to materialize.  Committee Setup Two committees (one committee from each community), each of 3 representatives, will be chosen to focus on metagovernance in each community. Committee representative selection will be in three phases to minimize starting costs and encourage experimentations.   Initialization Phase (six months): one representatives will come from the Gitcoin community, while one representative will be from the Llama team. Community representatives should have the context needed to make decisions on most proposals that Gitcoin is putting up for votes. Community representative should be selected from the current contributor/team base. Llama representative will facilitate communication, ideate on future metagovernance committee structures, and handle possible disagreements.   Community representative:   1. Vishnu (0x58Bb2761A4F4165d03553804D590234da534f4f4)   Experimentation Phase (12 months): two representatives will come from the Gitcoin community, while one representative will be from the Llama team. Interested community representatives will be self-nominated and ratified by the current governance group. Representative selection standards will be formalized and published. Llama representative will handle possible disagreements. Maturation Phase (indefinite): three representatives will come from the Gitcoin community. Interested community representatives will be self-nominated and ratified by the current governance group.  *The timeline proposed above is subject to change based on the progress of the metagovernance committee. After the proposal is executed, both DAOs agree to hold the others’ tokens for a minimum of 2 years. The committees should vote independently, though the two should collaborate on joint governance proposals and initiatives relating to the strategic alliance. At least one community representative should attend monthly updates in the other community to gain context and explore possible synergies. The committee will be responsible for keeping track of all proposals in the other community and bringing them to their respective community for discussion. For each proposal, the committee will vote on behalf of their respective community, informed by their community’s values, the goals of the Public Goods Alliance, and feedback from the broader community.  Compensation Llama Llama will charge $20k in GTC for the work involved in strategy analysis for the alliance and potential synergies, writing the initial proposal, coordinating with Gitcoin and Radicle teams and incorporating feedback, pricing analysis, legal analysis and approval, Snapshot proposal and follow up with stewards, smart contracts to implement the proposal, and set up of meta governance committee. (Llama will charge $20k in RAD from Radicle as well.) Metagovernance committee representatives Non-Llama representatives will be compensated based on each DAOs decision. For the first iteration of the committee which is made up of core team members from each respective DAOs, community representatives might not be compensated separately since each respective DAOs already are paying them. In the future, when we start recruiting community members to become committee representatives, clear guidelines on compensation should be in place to encourage a healthy incentive structure. Llama representative will not be paid. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.311411149825784
                }
            ]
        }
    ],
    "group_index": "129"
}