{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/s17-budget-reviews-are-underway/12752",
            "title": "S17 Budget reviews are underway ",
            "index": 12752,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#1",
                    "likes": "7",
                    "time": "02/02/2023-14:42:37",
                    "content": "Gitcoin Stewards: Season 17 Budget reviews are once again underway.  If you volunteered to review a budget, you have been tagged in a discord conversation where you were introduced to the workstream leader, seen the roadmap of work to be done, and received the new “how to conduct a budget review” document (thanks @chaselb for the prompt). Recall that participation in the budget review increases your steward health score found at https://www.daostewards.xyz/ and can be a gateway to greater engagement inclusive of remunerated roles like the Steward Council. At Gitcoin, we understand that steward engagement helps Gitcoin to progressively decentralize and perform better as a DAO. To drive this, we are posting these details on the forum for greater visibility and to encourage more participation. Schedule:  image1179×500 78.4 KB  Tools to help you along the way:  Ideas on how to review a Gitcoin Budget (here) Links to each budget:  [S17 Proposal] DRAFT Gitcoin Passport Budget Request [S17 Proposal] DRAFT Gitcoin Allo Budget Request [S17 Proposal] DRAFT Gitcoin Public Goods Funding Budget Request [S17 Proposal] DRAFT FDD Budget Request [S17 Proposal] DRAFT DAO Ops Budget Request [S17 Proposal - DRAFT] MMM Budget Request    Steward Review on Monday Feb 06: Monday Feb 06 is the monthly call for all Stewards and Steward Council members. The meeting will include a brief summary and followed by a Q&A session for Stewards to ask budget questions to the workstream leaders.  By publishing the agenda and review materials early, we are hoping stewards can come to the meeting with questions in hand. The pre-reading for this meeting will be posted at the link below by Thursday Feb 02 COB. https://www.notion.so/gitcoin/All-Stewards-Sync-Feb-2023-57bf75716826449ab384be7ac22a7340 FAQ: Q: I am a Steward and I don’t have access to discord / monthly meetings, what do I do? A: Reach out to shawn16400#5507 on discord - I can get you sorted Q: Where do I ask questions about the budgets? A1: Bring your questions to the Monday Feb 06 Steward meeting A2: Post your questions directly to the forum under the draft. Q: By when do I need to post my final questions & feedback to the DRAFT? A: At the latest post by Wednesday Feb 08. This gives the workstreams time to make changes. Q: What happens after I post my feedback to the draft? A: The workstreams incorporate the feedback as it comes in and will post the final INTEGRATED budget proposal for vote on Monday Feb 13th Q: Do I need to post my position on the budget when the final INTEGRATED version is posted? A: Ideally yes.  We encourage those who have spent the most time with the budget and build additional context to share their opinion with their fellow voters. IF you have any questions or feedback about our process, you can post here - or reach out to shawn16400#5507 Also, we are always seeking to improve. If you have ideas or have seen a really good budget process in other spaces, let us know. ",
                    "links": [
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/f/f473c3dda99ebe4b68a0533ab398678ff40c8865.png",
                        "https://docs.google.com/document/d/1X-63Ayid-y_Fu-2Rb5tv5EgQE98DixuODViLbJIUyqg/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-gitcoin-passport-budget-request/12727",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-gitcoin-allo-budget-request/12739",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-gitcoin-public-goods-funding-budget-request/12742",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-fdd-budget-request/12738",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-dao-ops-budget-request/12741",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-mmm-budget-request/12733",
                        "https://www.notion.so/gitcoin/All-Stewards-Sync-Feb-2023-57bf75716826449ab384be7ac22a7340"
                    ],
                    "GPT-summary": "Gitcoin Stewards are conducting budget reviews for Season 17 and are encouraging more participation. The post provides tools and links to help with the review process and includes a schedule for the review. The author is asking for feedback and questions from Stewards and is open to collaboration and improvement suggestions.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.990800865800866
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#2",
                    "likes": "5",
                    "time": "07/02/2023-23:53:57",
                    "content": "Although I know some of the budgets may be materially changing, I did an exercise to map budget line items to Essential Intents.  I noticed two things: Observation 1: Gitcoin has a lot of individual goals, but do we have specific organizational goals? As we reconsider EIs, it might be helpful to articulate 1 or 2 high level organizational goals per EI that each worksteam can ladder up to for each budget line item.  Here I am thinking specific & challenging, but achievable. Examples might include:  “Allo & Grants Stack will deliver $100M in public goods via the platform funding by 2025” “Passport has been adopted by X leading platforms by 2024” “Gitcoin has the most engaged community as determined by measure x, y, and z” “Gitcoin DAO is fully self sufficient by 2024, and is generating 120% of expenses by 2025” “Gitcoin has the highest DAO contributor retention rates and is in the top 80% of contributor satisfaction ratings”  Declaring specific organizational goals linked to EIs vs. having workstreams identify their own goals (linked EIs) is a centralizing step and can stifle creativity and experimentation. But it can also help us to ship faster, control spending, and focus work. Observation 2: The financial sustainability EI is lonely While financial sustainability might not be at the top of our list of things to do, sufficient income does deliver a measure of contributor safety.  Cost is always a concern and given we have no “in case of 90% dip break-glass” plan, it might be prudent to think about creating a role or workstream that is 100% focused on finding sources of income and guaranteeing the future of Gitcoin. If you are so inclined - have a look at the mapping and let me know if you notice anything. LInk to the miro board  image587×573 117 KB   image834×670 96 KB    ",
                    "links": [
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/2/2110738da72704817f105469cddfa6b53f3f17e5.png",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/a/a7fbedea87a61150093bd6fe8a3873001b97354f.jpeg"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.83125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/J9leger",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/02/2023-17:14:45",
                    "content": "Thanks @shawn16400 for putting time into the above. Agreed the Financial Sustainability EI is lonely. I’d love to see as we launch the protocols a dedicated person to support here. We may be 2 months away from this still. I’m not sure where else to put this and I don’t think it’s a formalized thought enough to put as a full forum post but I know a few people have been talking about what voting “no” would look like on budgets. @griff has asked this on every budget. A good question to ask:) One suggestion if we vote “no” on any of the budgets is not that there is no funding at all for that workstream this season but instead we move to a project based model where the workstream breaks up projects it wants to focus on and funding needed for those projects and we can vote on all the projects in a workstream (some yes, some no). This will force us to pair down to our top priorities. This is just an experiment but one way to address the question and a way I would as a PGF lead do it in the circumstance that we have people vote no on our budget. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.801587301587302
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#4",
                    "likes": "3",
                    "time": "13/02/2023-15:37:12",
                    "content": "    J9leger:  project based model where the workstream breaks up projects it wants to focus on and funding needed for those projects and we can vote on all the projects in a workstream (some yes, some no   @J9leger in S17 Kris has asked I help with a second look at budgeting and that is one of the concepts I will propose, - move from omnibus functional spending packages to project portfolio management approach (PPM) where funding is allocated at the project / program level timefenced by deliverables, not arbitrary periods. This approach allows for modular decision making and better signaling for projects that are not quite cutting it, and maks closing otu less disruptive. BUT core components of PPM is strategic fit and delivery on goal.  You can do PPM without having specific goals, but it is more appropriate for budget-secure early stage work (upstream R&D for example - where you are not sure what you are going to get).   In our case, specific goals for each EI would be helpful for each WS to focus as well as allow for better PPM execution. PPM as a budgeting approach would take a little bit of additional PM training, but could solve some of the issues we are seeing with budgeting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5152777777777775
                }
            ]
        }
    ],
    "group_index": "317"
}