{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-dexplorer-bounty-fund-bounty/8960",
            "title": "[Proposal] dExplorer (Bounty / Fund Bounty) ",
            "index": 8960,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/codingsh",
                    "index": "#1",
                    "likes": "3",
                    "time": "05/11/2021-19:27:06",
                    "content": "Summary With the exponential growth of Gitcoin and its transition to a DAO some improvements went unnoticed, I believe that the explorer and foundation of Bounties is very important for the whole ecosystem so I propose some modifications. Resume  Today we store the bounties in a centralized database, I propose to store this data in arweave, decentralizing information from both the github base and the gitcoin base. Explorer There is no notification, it is necessary to be in discord or keep giving F5 on the page, or be notified by email of a new bounty or hackathon  Motivation I’m an explorer, hunter and founder who loves being on gitcoin and I see exponential value in everything we build, I would like to improve this ecosystem. Specification  I estimate a 8 weeks  job between design construction, react application with all integrations  dExplorer Roundmap 1 and 2 weeks  build a new design Improve Search Filters Improve the Design of Featured Bounts built an application in React Integration with arweave  3 and 5 weeks  Mobile Application  6 and 8 week  Building a firefox/chrome extension as bounty notifications CrossChain Native - Ability to create bountys on any compatible EVM chain  Budget Budget required for construction is GTC 7736 GTC Why should this proposal go to vote? I am always thinking about improving the things I consume and use, I believe that improving the explorer will improve the relationship between bounty founders and hunters thus increasing the speed in building applications and joining web3 projects ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing modifications to the explorer and foundation of bounties in Gitcoin. The proposal suggests storing bounty data in arweave, improving search filters, and building a mobile application and browser extension for bounty notifications. The author believes that improving the explorer will improve the relationship between bounty founders and hunters, thus increasing the speed in building applications and joining web3 projects. The post also invites feedback and questions on the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 4.134848484848485
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/socal434",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/11/2021-10:55:31",
                    "content": "I am not very savvy with budget estimations but the idea sound very good. Maybe this is a dumb question but what is the mobile application for? Notification of new bounties to your cell phone or something? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.971363636363636
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/codingsh",
                    "index": "#3",
                    "likes": "0",
                    "time": "06/11/2021-20:48:59",
                    "content": "I thought of literally a mobile application using ReactNative for dExplorer, with the focus on founding bountys and applying to bountys. think of the world of possibilities of a mobile application in many places in the world how people look for a mobile application when accessing a responsive application. I don’t have the data but I believe a large portion of gitcoin is accessed by mobile devices. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.7857142857142865
                }
            ]
        }
    ],
    "group_index": "606"
}