{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-17/8897",
            "title": "GitcoinDAO Digest #17 ",
            "index": 8897,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "5",
                    "time": "28/10/2021-14:26:51",
                    "content": " 1600×381 62.6 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading! Without further ado, let’s dive in!   Meta-Governance    The proposal to Integrate dCompass within dGitcoin to build dQuests & dKnowledge has received feedback from the required amount of Stewards. The proposal is now live on Snapshot until Nov 7th.   Gitcoin Financial Reporting by Elliot from Llama presents GitcoinDAO Treasury Report for September 2021. The report is the first out of a series of monthly treasury reports with the ambition to “provide insight into the performance of Gitcoin”.   CrossStream DAOops & Community XP Funding by DisruptionJoe presents options for how the “CrossStream DAOops Governance squad (CSDG), which makes decisions that affect the entire DAO, should be governed”. The thread is a continuation of the conversation started on the FDD Q4 Budget Proposal.   Owocki authored a thread on Twitter with slides on how “Ethereum is Solarpunk”. The thread describes how “Ethereum is a schelling point for the hopeful” and how it is a “campfire we can rally around, and together, that we can use to create a cyberpunk world AND a solarpunk world.”   The discussion around Redistribute GTC to Individuals Who Could Not Claim Due to Error is ongoing with the author Tardigrade continuing to answer questions regarding the proposal.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     Decentralize Gitcoin Workstream Budget Request - Q4 2021 MMM Q4 2021 Budget Proposal # Prototyping Workstream ( Moonshot) Budget Request - Q4 2021 2    Proposal - Request to fund FDD workstream Q4 2021 budget  Moonshot Workstream Allocation Q4 # Proposal to Ratify the Results of GR11     Integrate dCompass within dGitcoin to build dQuests & dKnowledge dCompass (build dQuests & dKnowledge) - Q4 Budget request    Gitcoin Discovery: Decentralize the Knowledge Base & Quests     Redistribute GTC to Individuals Who Could Not Claim Due to Error        Workstream Discussion    Public Goods Funding    The Library continues to bring together a fantastic group of people to discuss public goods each week.   A second RFP, continuing the ethos of Seeking a New Kind of Public Good, is in planning.   Over $600k has been raised so far for Grants Round 12 and partnership discussions with other web3 x social impact organizations have begun.   The first workstream payments have been made to key contributors in the Public Goods workstream. Formal accounting will be moving into cross-DAO ops in time for the second budget proposal. Progress has been made on onboarding, which will also move into a larger cross-DAO ops initiative     Moonshot Collective    The vote to ratify the Moonshot Collective budget request for Q4 2021 has passed and is now live on Tally for a formal on-chain vote.   The Greatest LARP launched on Wednesday, October 20 to great fanfare! So far 4 of 5 ETHBot Statues have been sold, as well as 158 ETHBot NFTs. The next level will be unlocked once 200 ETHBot NFTs have been minted. More than $180,000 has been raised to fund public goods so far. Owocki authored a thread describing the “Womp womp”-mechanism and a poll to determine if, and how it should be used. The poll resulted in executing the Womp womps around 9am MST every day, Kevin will post in the telegram channel when the txns are submitted.   Every Friday the Moonshot Collective gets together to show off their progress. Individual projects demo what they’ve been working on. This week three projects shared their work: Anon Vs Moloch, Moonswap, and Decentralized Recruiter. Demo videos for each project can be found on this YouTube playlist.   Follow @MoonshotCollect onTwitter for frequent updates. Learn more by saying hello in Discord, or checking out our site.     Decentralize Gitcoin    The dGTC Workstream Q4 Budget Proposal has been posted on the forum by Philip for review. The proposal brings the Data & DevOps project into this workstream. A team to design a sybil score aggregation protocol and build a POC implementation will be added. The workstream is also planning to add community contributors to the dGrants team to increase velocity and scale.   The Moonshot Collective dGrants Round Proof of Concept is currently running and is scheduled to end on Sunday, October 31st at 11:59PM EST. As of Wednesday morning, Oct 27, the round had 11 grants and $5,449.54 worth of matching funds available. A total of 14 grants have been created and approved with 105 contributions. We’d love for you to test with us! Fund your favorite grant or builder before matching ends on Sunday and provide feedback in the Discord channel #dgtc-feedback (under Decentralize Gitcoin).     Fraud Detection & Defense (FDD)    The FDD Q4 Budget Proposal will be moving to Snapshot after healthy deliberation on the forum. Owocki expressed concern about CrossStream DAOops & Community initiatives being included in the FDD Budget. FDD had brought the issue to the CrossStream DAOops Governance (CSDG) last Tuesday and passed a proposal to include these streams funding as to not interrupt contributor payments, but intending to spin out these streams. Multiple CSDG reps were in Lisbon last week and missed the vote.   For decisions that affect all streams, the CSDG has reps from each stream which vote on the proposal before changes are made. They hand it off to a specialist squad to drive a solution, which then is approved by the CSDG before implementation. After Owocki’s post on the proposal in the Governance forum, FDD brought the proposal back to CSDG again this Tuesday. The conclusion was that the FDD budget will include these initiatives, however, FDD will expedite the creation of a multisig with one rep from each workstream to govern the CrossStream DAO Ops funding.   Another decision is that the FDD Legal & Accounting Squads will be integrated into the CrossStream DAOops, this will be a gradual process, with support of Kyle and Joe.   The FDD workstream published a document outlining the State of FDD Q3 2021. The document describes the role of defending Gitcoin, how FDD provides value to the Gitcoin community, FDD’s vision, mission, values, strategies, how FDD plans to progressively decentralize, Q3 accomplishments & Q4 deliverables. Includes a breakdown of all initiatives & squads. Worth a read if you want to get a better handle on this workstream!     Merch, Memes & Marketing    The MMM Q4 budget is live on Tally to get ratified on-chain, please vote to ensure we reach quorum!   A design bounty for Grants Round 12 was posted. For Grants Round 12 going forward, design bounties will be funded and maintained by MMM (previously supported by the Gitcoin Holdings design team).   MMM is representing Gitcoin DAO at the ForeFront DAOlloween event in gather.town this Friday, the 29th. This is a special-themed metaverse networking event where ticket holders “gather” in the metaverse to get acquainted with representatives from other sponsoring DAOs. Special tokens and POAPs will be rewarded to lucky participants.   Matthew proposed “MMM Raids” to scale operations. MMM Raids are “an efficient and flexible way for people to request, approve, disperse, and account for funds in MMM initiatives, with minimal bureaucracy and maximum transparency.”   To request or propose a new project for MMM - please fill out the MMM-Request Typeform!     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM EDT in Discord! We have been seeing great attendance and engagement.   Community Onboarding Call! New to Gitcoin? Every other Wednesday we’ll tell you all about how we’re organized and how to become an active contributor. The next one is Wednesday, November 10, 12:00pm - 1:00pm ET. (If you haven’t applied, do this first!)   On Wednesday, November 3, 1-2PM ET Anett will be hosting the monthly Steward Unconference Chat. According to Anett, “The idea to host unconference sessions is to meet stewards & friends and have non formal chats together, share memes, share whatever we want. The outcome should be to build relationships as the DAO moves faster when people know each other and create a more friendly atmosphere in DAO.”     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to check out what they are up to and where you might fit in. Current openings across the GitcoinDAO can be found here.   In summary, there are four key actions to take this week:  Vote on the MMM-Workstream on-chain budget proposal. Vote on the Moonshot Collective on-chain budget proposal. Vote on the dCompass Snapshot budget proposal.  Fund your favorite builder or grant in the dGrants proof of concept.  Thanks for reading!  If you would like to receive this newsletter in your inbox, sign up here!  Last week’s edition ",
                    "links": [
                        "https://gov.gitcoin.co/t/proposal-integrate-dcompass-within-dgitcoin-to-build-dquests-dknowledge/8836/1",
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v2-updated/7860",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x230bcb7d3548048fc94e5745f7934d80bfc357632af1038cb0941fc54fbae021",
                        "https://gov.gitcoin.co/t/gitcoin-financial-reporting/8867",
                        "https://gov.gitcoin.co/u/Elliott",
                        "https://www.canva.com/design/DAEs4t7TzsE/Q2--4jnA6n5W4s9kgsQgzg/view?utm_content=DAEs4t7TzsE&utm_campaign=designshare&utm_medium=link&utm_source=publishsharelink",
                        "https://gov.gitcoin.co/t/crossstream-daoops-community-xp-funding/8883",
                        "https://gov.gitcoin.co/u/DisruptionJoe",
                        "https://gov.gitcoin.co/t/proposal-request-to-fund-fdd-workstream-q4-2021-budget/8857",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://twitter.com/owocki/status/1452735783719243778",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782",
                        "https://gov.gitcoin.co/u/Tardigrade",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782/10",
                        "https://gov.gitcoin.co/t/proposal-decentralize-gitcoin-workstream-budget-request-q4-2021/8895",
                        "https://www.withtally.com/governance/gitcoin/proposal/7",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmUMKpGM6daj2Lo7Wb8urz6hG4gvfoDu94fpBgueRZGYDi",
                        "https://gov.gitcoin.co/t/proposal-request-to-fund-fdd-workstream-q4-2021-budget/8857",
                        "https://www.withtally.com/governance/gitcoin/proposal/8",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmQTMLG8qbDpTCCUwVnbEmzLkdCvf1ApZ8w9nd9idfC8r7",
                        "https://gov.gitcoin.co/t/proposal-integrate-dcompass-within-dgitcoin-to-build-dquests-dknowledge/8836",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x230bcb7d3548048fc94e5745f7934d80bfc357632af1038cb0941fc54fbae021",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-discovery-decentralize-the-knowledge-base-quests/8747/",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gov.gitcoin.co/t/workstream-public-goods-funding/129",
                        "https://gitcoin.notion.site/Enter-the-Library-867e8df229374e1f97cae7eae45e5681",
                        "https://gitcoin.co/blog/seeking-a-new-kind-of-public-good/",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gov.gitcoin.co/t/workstream-public-goods-prototyping/130",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmUMKpGM6daj2Lo7Wb8urz6hG4gvfoDu94fpBgueRZGYDi",
                        "https://www.withtally.com/governance/gitcoin/proposal/8",
                        "https://greatestlarp.com",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/a-governance-question-for-greatestlarp-com/8848",
                        "https://gov.gitcoin.co/t/a-governance-question-for-greatestlarp-com/8848/20",
                        "https://gov.gitcoin.co/t/a-governance-question-for-greatestlarp-com/8848/24",
                        "https://t.me/joinchat/ekBANXnlwcQ1NzRh",
                        "https://youtube.com/playlist?list=PLVupIN3GgLtj6ZjXCvDed6WPXZCf4mU7l",
                        "https://twitter.com/MoonshotCollect",
                        "https://gitcoin.co/discord",
                        "https://moonshotcollective.space/",
                        "https://gov.gitcoin.co/t/workstream-decentralize-gitcoin/180",
                        "https://gov.gitcoin.co/t/proposal-decentralize-gitcoin-workstream-budget-request-q4-2021/8895",
                        "https://gov.gitcoin.co/u/phutchins",
                        "https://grants.gtcdao.net/",
                        "https://discord.gg/A44BkknX",
                        "https://www.notion.so/gitcoin/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://gov.gitcoin.co/t/proposal-request-to-fund-fdd-workstream-q4-2021-budget/8857",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/proposal-request-to-fund-fdd-workstream-q4-2021-budget/8857/6",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://docs.google.com/document/d/1uEuGe5OOecLyAsLbgnqaLplaH8ycU4zej3c-mv6QHTI/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/workstream-suggestion-mmm-merch-memes-marketing-for-public-goods-gitcoin-gitcoindao/7066",
                        "https://www.withtally.com/governance/gitcoin/proposal/7",
                        "https://github.com/gitcoinco/creative/issues/412",
                        "https://ff.mirror.xyz/j_9eeNjtiXd0TYqMN6WCMexUFHcjbPUnxJsIog2sU78",
                        "https://docs.google.com/presentation/d/1NELqWafJQZkY05QE3E9ImSmfnoSzNnjUvKaH4gycLKw/edit?usp=sharing",
                        "https://form.typeform.com/to/iM5lAFFD",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://gov.gitcoin.co/u/anett/summary",
                        "https://www.addevent.com/event/ux8437207",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://www.notion.so/gitcoin/06fad27dbd2d49468aa810c92f1f28c2?v=d403dc9f76144dcab232e3a18002494f",
                        "https://www.withtally.com/governance/gitcoin/proposal/7",
                        "https://www.withtally.com/governance/gitcoin/proposal/8",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x230bcb7d3548048fc94e5745f7934d80bfc357632af1038cb0941fc54fbae021",
                        "https://grants.gtcdao.net/",
                        "https://form.typeform.com/to/ttNCMt8w",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-formerly-week-in-governance/8844",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-18/8947"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.862403281584316
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/hapob",
                    "index": "#2",
                    "likes": "1",
                    "time": "28/10/2021-15:50:09",
                    "content": "Great read, thank you. i would love to see MemePalooza in the list of the community events list. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#3",
                    "likes": "1",
                    "time": "28/10/2021-16:18:59",
                    "content": "Yes absolutely, the next Memepalooza will take place next Friday on November 5th and will be included in the upcoming Gitcoin DAO-Digest #18. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#4",
                    "likes": "5",
                    "time": "28/10/2021-18:07:44",
                    "content": "These are getting really good. They are incredibly helpful. Thanks MMM ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-18/8947",
            "title": "GitcoinDAO Digest #18 ",
            "index": 8947,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#1",
                    "likes": "4",
                    "time": "03/11/2021-21:50:03",
                    "content": " image936×223 14 KB  Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading! Without further ado, let’s dive in! Key actions for this week:  Vote on the dCompass integration proposal and FDD Q4 budget proposal  Vote on the Moonshot Collective on-chain budget proposal. Provide your input to the Multisig Keyholders Rotation Proposal  Unlock the next level of the The Greatest LARP     Meta-Governance    Owocki authored a thead on the multisig holders of Gitcoin titled Your Input wanted - Multisig Keyholders Rotation. The thread raises the question whether the keyholders of the Gitcoin multisig should be rotated from the current 6 signers. The thread includes a poll to gauge sentiment of who should be multisig signers going forward. Action: Dive in and provide thoughts here.   Calling all GitcoinDAO Metaverse Coordinators! by Owocki explores the importance of storytelling and culture to spread the narrative of Gitcoin’s mission and raise funds for public goods. The thread concludes with a call to action: “I’m looking for dreamers & leaders who are inspired to make this a reality to join the GMC - the GitcoinDAO Metaverse Coordinators 24 - a group dedicated to laying down pieces of this metaverse brick by brick, campaign by campaign, one fight against Moloch at a time.” Action: Join this telegram to learn more.     Blazingthirdeye announced that GitcoinDao is sponsoring a round of trivia with 1Hive in the thread: Question suggestions for a trivia round. The top 10 questions will be used in the game-show which will take place in December. Action: Submit your questions for the trivia game in the Google doc: Potential Trivia Questions.    GitcoinDAO Governance Overview      Proposal Discussions Active Proposals Latest completed proposals     Redistribute GTC to Individuals Who Could Not Claim Due to Error  Moonshot Workstream Allocation Q4 # MMM Q4 2021 Budget Proposal     dCompass (build dQuests & dKnowledge) - Q4 Budget request # Prototyping Workstream ( Moonshot) Budget Request - Q4 2021 2     dGTC Workstream Q4 Budget Proposal     Request to fund FDD workstream Q4 2021 budget       Workstream Discussion    Public Goods Funding    Over $700k has been raised so far for Grants Round 12! Partnership discussions with other web3 x social impact organizations are underway and are planned to wrap up in the next couple weeks.   Some cool joint projects are in the works with Olympus and others that share the idea that it’s all coordination.   Alisha and Lani have started brainstorming what a broader, more public call to the community around the importance of public goods might look like, including running consistent Twitter Spaces and community sessions     Moonshot Collective    4 of 5 ETHBot Statues have been sold, as well as 161 ETHBot NFTs in The Greatest LARP. The next level will be unlocked once 200 ETHBot NFTs have been minted. More than $200,000 has been raised to fund public goods so far. Owocki introduced, on behalf of Colton, “Womp Womp V2” with a poll to determine if Womp Womp should be used every 24 hours, regardless of sales. Kevin will post in this telegram channel when the txns are submitted. A Womp Womp is a mint cost reduction in order to help spur more participants.   The Moonshot Collective monthly demo call was held on Monday, November 1 at 1pm. Moonshot projects have 5 minutes to demo their tech. In case you couldn’t make it a link to the videos will be included in next week’s digest.    Every Friday the Moonshot Collective gets together to show off their progress. Individual projects demo what they’ve been working on. This week three projects shared their work: Anon Vs Moloch, Mintler, Tip Party, and Decentralized Recruiter. Demo videos for each project can be found on this YouTube playlist. Check out @MoonshotCollect on Twitter for frequent updates and learn more by saying hello in Discord, or checking out our site.    Decentralize Gitcoin    The vote to ratify the dGTC Workstream Budget Proposal for Q4 2021 has passed and steps have been taken to propose a formal on-chain vote.   The Moonshot Collective round of dGrants has been completed. The round had 11 grants, 145 contributors and $5,477 worth of matching funds available.   Planning and preparations for running a dGrants round in the upcoming Grant Round 12 in December are underway. The workstream is working on shipping new features, performance fixes and UX improvements until then.     Fraud Detection & Defense (FDD)    Request to fund FDD workstream Q4 2021 budget passed quorum on Snapshot. After the deadline has been passed steps will be taken to propose a formal on-chain vote.   Payouts for matching pool for GR11 have begun as reported by Gitcoin Holdings & the FDD workstream. If you’re the owner of a Grant; check your email inbox!   All expected Q4 2021 deliverables from the FDD-worksteam are now listed on the FDD Notion.   The workstream spun out FDD Legal & FDD Accounting to the CrossStream DAOops. A process to spin out User Support in Q1 2022 is currently being planned.   Anonymized contributor feedback mechanism for the DAO as a whole is being worked on to ensure the entire DAO can give feedback on these things rather than only stream leads.     Merch, Memes & Marketing    The on-chain vote for MMM-budget Q4 2021 passed! Deeper planning is now underway to scale MMM impact and operations. We are restructuring our substreams and streamlining our Notion page to be able to take on more contributors and projects.   We are on the hunt for talented designers and developers - if you know any, send them our way in the #mmm-general channel on Discord!   If you’re part of another workstream and want design/marketing support from MMM - please utilize our Request Typeform.   The third iteration of Memepalooza will take place on Discord this Friday at 2-5 pm EST. The event is a collaborative experiment in meme production and rewards Memelords meming the values of GitcoinDAO. Tools from Moonshot Collective will be used to distribute GTC to contributors during the event.   Fresh merch dropped Monday in the Schwag Store! New items are a Public Goods embroidered black hoodie and sunny gm mug. A portion of sales will be paid to a carbon removal initiative making these pieces fully carbon neutral!   Outlines of the Meme-Museum are now underway. The Meme-Museum aims to celebrate great memes and Memelords & will be a web3-friendly archive that allows users to upload, search and reuse memes created in the broader web3-community.     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM EDT in Discord! We have been seeing great attendance and engagement.   Community Onboarding Call! New to Gitcoin? Every other Wednesday we’ll tell you all about how we’re organized and how to become an active contributor. The next one is Wednesday, November 10, 12:00pm - 1:00pm ET. (If you haven’t applied, do this first!)   Memepalooza 3 will take place on Discord this Friday at 2-5 pm EST. Hang out, create memes, test out coordination tools from Moonshot Collective and receive GTC!     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to check out what they are up to and where you might fit in. Current openings across the GitcoinDAO can be found here.   Thanks for reading!  If you would like to receive this newsletter in your inbox, sign up here! Last week’s edition ",
                    "links": [
                        "https://www.withtally.com/governance/gitcoin/proposal/8",
                        "https://gov.gitcoin.co/t/your-input-wanted-multisig-keyholders-rotation/8925",
                        "https://greatestlarp.com",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/your-input-wanted-multisig-keyholders-rotation/8925",
                        "https://gov.gitcoin.co/t/your-input-wanted-multisig-keyholders-rotation/8925",
                        "https://gov.gitcoin.co/t/calling-all-gitcoindao-metaverse-coordinators/8902",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://t.me/joinchat/DRkmhTiIH6E0MjYx",
                        "https://t.me/joinchat/DRkmhTiIH6E0MjYx",
                        "https://gov.gitcoin.co/u/blazingthirdeye",
                        "https://gov.gitcoin.co/t/question-suggestions-for-a-trivia-round/8909",
                        "https://docs.google.com/document/d/1BLqgDUDkaEJDmYUSzcG6iI7i6uT5_3Aypsdw4u1hBg8/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782",
                        "https://www.withtally.com/governance/gitcoin/proposal/8",
                        "https://www.withtally.com/governance/gitcoin/proposal/7",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x230bcb7d3548048fc94e5745f7934d80bfc357632af1038cb0941fc54fbae021",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmUMKpGM6daj2Lo7Wb8urz6hG4gvfoDu94fpBgueRZGYDi",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xd65bb1c535d0c83ec197df8d000464c6fb7a6ef000ad59df48af82d39d23e42e",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x265fe70790524875caacb6675ef6d10b4d4ceac8b1c26df26ad1ba284eab70a1",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gov.gitcoin.co/t/workstream-public-goods-funding/129",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://greatestlarp.com",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/u/colton",
                        "https://gov.gitcoin.co/t/a-governance-question-for-greatestlarp-com/8848/25",
                        "https://t.me/joinchat/ekBANXnlwcQ1NzRh",
                        "https://youtube.com/playlist?list=PLVupIN3GgLtjS-vgOpe5hXoZlKk5k5L0q",
                        "https://twitter.com/MoonshotCollect",
                        "https://gitcoin.co/discord",
                        "https://moonshotcollective.space/",
                        "https://gov.gitcoin.co/t/workstream-decentralize-gitcoin/180",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xd65bb1c535d0c83ec197df8d000464c6fb7a6ef000ad59df48af82d39d23e42e",
                        "https://grants.gtcdao.net/#/dgrants/rounds/0x6c7B74D7640f401271208186e5CbBc6e7E2C73F4/grants",
                        "https://www.notion.so/gitcoin/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x265fe70790524875caacb6675ef6d10b4d4ceac8b1c26df26ad1ba284eab70a1",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmQTMLG8qbDpTCCUwVnbEmzLkdCvf1ApZ8w9nd9idfC8r7",
                        "https://gitcoin.co/blog/gitcoin-grants-round-11-governance-brief/",
                        "https://www.notion.so/gitcoin/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://gov.gitcoin.co/t/workstream-suggestion-mmm-merch-memes-marketing-for-public-goods-gitcoin-gitcoindao/7066",
                        "https://www.withtally.com/governance/gitcoin/proposal/7",
                        "http://discord.gg/gitcoin",
                        "https://form.typeform.com/to/iM5lAFFD",
                        "https://www.addevent.com/event/ZY9211606",
                        "http://discord.gg/gitcoin",
                        "http://store.gitcoin.co/",
                        "https://store.gitcoin.co/products/%E2%AD%90%EF%B8%8F-public-goods-hoodie",
                        "https://store.gitcoin.co/products/%F0%9F%8C%9E-gm-enamel-mug?_pos=&utm_medium=gmMug",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.addevent.com/event/ZY9211606",
                        "http://discord.gg/gitcoin",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://www.notion.so/gitcoin/06fad27dbd2d49468aa810c92f1f28c2?v=d403dc9f76144dcab232e3a18002494f",
                        "https://form.typeform.com/to/ttNCMt8w",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17/8897",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-19/9003"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.850953594587854
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-19/9003",
            "title": "GitcoinDAO Digest #19 ",
            "index": 9003,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#1",
                    "likes": "2",
                    "time": "10/11/2021-20:01:36",
                    "content": " 1600×381 62.6 KB  GitcoinDAO Digest Edition #19  Weekly highlights and hot topics from the GitcoinDAO community  Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading! Without further ado, let’s dive in!   Meta-Governance    Owocki published The ImpactDAO/ProtocolDAO Sandwich sandwich , which describes how he perceives Gitcoin’s place in the emerging DAO ecosystems as a ProtocolDAO/ImpactDAO Sandwich: “A ProtocolDAO is a DAO that is centered around a crypto-economic protocol.  An ImpactDAO is a DAO that is oriented around the creation of positive externalities.”   We’re continuing to lean into ecosystem rounds, where projects run their own matching pools alongside the main Gitcoin matching pool. Check out this recent case study that highlights Uniswap’s goals, experience and results using ecosystem rounds in GR11.   November 2021; Who’s hiring? by Owocki invites workstream leads of the DAO to announce the currently open positions in their respective workstream. If you’re interested in taking on a role in the GitcoinDAO – this is a great way to start!   Non-transferrable governance token for “structured workstreams” to signal contributor interests by DisruptionJoe proposes to “create a governance token for all workstreams that choose to collaborate rather than defect” from the decisions of The CrossStream DAOops Governance (SDG) council.   Codingsh authored a proposal which introduces dExplorer, a project which aims to improve and decentralize the Bounties platform.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     dExplorer (Bounty / Fund Bounty) dGTC Workstream Q4 Budget Proposal # dCompass (build dQuests & dKnowledge) - Q4 Budget request    Redistribute GTC to Individuals Who Could Not Claim Due to Error  # Request to fund FDD workstream Q4 2021 budget      #  Moonshot Workstream Allocation Q4      dGitcoin Workstream Q4 Budget Proposal      Workstream Discussion    Public Goods Funding    New squads are starting to form around Public Goods PR (workstream awareness), NFT artist sales for public goods, and smaller token alliances with groups like Verses, DreamDAO, and more.   As we get closer to being able to execute small test token swaps, we have also begun to seed and fund a number of other partnerships with orgs including DeveloperDAO, Verses, PadawanDAO (TBD), and DreamDAO.   Fundraising and grants operations continue to ramp up as GR12 approaches   The public goods library has more participation than ever, consistently maxing out the Discord room limit.   The Gitcoin Holdings team is starting to connect more deeply with this work as part of “the great migration” into the DAO!     Moonshot Collective    The Q4 Budget for Moonshot Collective passed on Tally and is queued for execution.   We’ve reached Level 3 in The Greatest LARP with more than 200 ETHBots minted and over $270,000 raised for public goods! Owocki shared the current bonding curve with a poll to ratify a new womp womp policy for level 3. Do you hold any of the first 200 ETHbots minted? Congratulations, you get a special prize 3D-bot! Check out Level 2 on greatestlarp.com for more details.   Want to get caught up on what Moonshot Collective was up to in October? MC co-lead Kevin Owocki sat down with Matt Carano to talk it through — what went well, what we learned, and what’s next. Watch the video here.   Help Wanted: Moonshot Collective is looking for a Product Manager and React devs. If you’re interested, please say hello in the Moonshot Collective telegram.     Decentralize Gitcoin    dGTC Workstream Q4 Budget Proposal has now passed the quorum on Tally.   The vote to ratify the dCompass Budget Request for Q4 2021 has passed and steps have been taken to propose a formal on-chain vote.   Payouts for the Moonshot Collective round have been executed.   Development related to running a round in Grants Round 12 is ramping up. Priorities include Performance, My Grants page, My Donations page, GrantRegistry, and Contract Updates.   The team is preparing to build the ML pipeline infrastructure.   dGitcoin is starting to gather DAO-wide data needs from stakeholders     Fraud Detection & Defense (FDD)    The team needs a top Steward to create the proposal on Tally after Q4 Budget passed last week on Snapshot. Many seem confused by the double vote on Snapshot and Tally. Snapshot is where the vote takes place after a deliberation period on the governance forum. Tally is essentially a multisig with 18k keyholders!   All contributor payments for Q3 have been made. FDD spent less than the projected budget on the initiatives listed on the original proposal. Our support of CrossStream DAOops including onboarding, Notion revamp, and others put our total spending for the Quarter at around $5-10k over the 25k GTC Q3 proposal budget estimate at a price of $10/GTC.   The first forking of a squad has happened. The grants approval squad split into two squads each with their own mechanism for splitting dRewards. The initial effect has been more engagement by the initiators of the fork to prep and train new onboards. We’ll report back on long term effects.   Sybil Detection took a big step forward as we connected the different teams on Q4 deliverables and forward-looking vision. These include the Gitcoin Holdings GPG team, dGrants, Data & DevOps stream, Omnianalytics, and Blockscience. Deliverables can be found on the FDD homepage.   The FDD research group is picking up steam as a bottom-up governance designed stream from the start. They will have 4 researchers participating in the TE Governauts Open Science program studying DAO Compensation Policies. As GitcoinDAO doesn’t have enough history to provide good data for a study of this type, we thought it would be advantageous to pay GitcoinDAO contributors to participate as researchers studying the results in other DAOs.     Merch, Memes & Marketing    The Q4 budget has been transferred to the MMM-Multisig. Compensation for contributors and other expenses for October will be sent out this week. Our first Raid proposals will also be awarded. If you’re part of another workstream and you need design/marketing support from MMM - please utilize our Request Typeform!   Memepalooza #3 happened last Friday! The event lasted three hours and hosted 74 unique visitors who contributed to the creation of 100+ memes accompanied by a live DJ streaming from Twitch. Participants were awarded POAPs and GTC. There was also an NFT-raffle and some Schwag Store coupons given away to some excellent Meme lords.   The playtesting-phase of the Degen vs Regen-card game has been completed. Thanks to everyone who participated! Tweaks to game mechanics as well as artwork are being worked on and finalized. Once done, we’ll be hosting recurring tournaments with the broader community.   If you’re a schwag-designer, don’t miss out on the GR12 Schwag design bounty - $500 will be awarded to the best designer, with smaller rewards to the runner-up. There’s still time left to apply!     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM EDT in Discord! We have been seeing great attendance and engagement.   Community Onboarding Call! New to Gitcoin? Every other Wednesday we’ll tell you all about how we’re organized and how to become an active contributor. The next one is Monday, November 22, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in. Current openings across the GitcoinDAO can be found here.     Key actions for this week:  Vote on the Decentralize Gitcoin on-chain budget proposal for Q4. Get your wallets ready to help fund some amazing projects in the upcoming Grants Round 12 (December 1-16)!  Thanks for reading! Last week’s edition ",
                    "links": [
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/the-impactdao-protocoldao-sandwich/8944",
                        "https://gitcoin.co/blog/case-study-uniswap-grants-program-ugp-gitcoin-partnered-to-distribute-ecosystem-funds/",
                        "https://gov.gitcoin.co/t/november-2021-whos-hiring/8946",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/non-transferrable-governance-token-for-structured-workstreams-to-signal-contributor-interests/8985",
                        "https://gov.gitcoin.co/u/DisruptionJoe",
                        "https://gov.gitcoin.co/u/codingsh",
                        "https://gov.gitcoin.co/t/proposal-dexplorer-bounty-fund-bounty/8960",
                        "https://gitcoin.co/issue/gitcoinco/creative/412/100026987",
                        "https://www.withtally.com/governance/gitcoin/proposal/9",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x230bcb7d3548048fc94e5745f7934d80bfc357632af1038cb0941fc54fbae021",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x265fe70790524875caacb6675ef6d10b4d4ceac8b1c26df26ad1ba284eab70a1",
                        "https://www.withtally.com/governance/gitcoin/proposal/8",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xd65bb1c535d0c83ec197df8d000464c6fb7a6ef000ad59df48af82d39d23e42e",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gov.gitcoin.co/t/workstream-public-goods-funding/129",
                        "https://twitter.com/notscottmoore/status/1457885830333308928",
                        "https://twitter.com/garysheng",
                        "https://twitter.com/developer_dao",
                        "https://twitter.com/notscottmoore/status/1457885830333308928",
                        "https://forum.metacartel.org/t/the-padawan-dao/1653",
                        "https://twitter.com/garysheng",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gov.gitcoin.co/t/workstream-public-goods-prototyping/130",
                        "https://www.withtally.com/governance/gitcoin/proposal/8",
                        "https://greatestlarp.com/",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/a-governance-question-for-greatestlarp-com/8848/26",
                        "https://greatestlarp.com/",
                        "https://twitter.com/owocki",
                        "https://youtu.be/XUxN1B8S6vU",
                        "https://moonshotcollective.space/",
                        "https://gov.gitcoin.co/t/workstream-decentralize-gitcoin/180",
                        "https://www.withtally.com/governance/gitcoin/proposal/9",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x230bcb7d3548048fc94e5745f7934d80bfc357632af1038cb0941fc54fbae021",
                        "https://www.notion.so/gitcoin/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://gov.gitcoin.co/t/workstream-suggestion-mmm-merch-memes-marketing-for-public-goods-gitcoin-gitcoindao/7066",
                        "https://www.withtally.com/governance/gitcoin/proposal/7",
                        "https://gnosis-safe.io/app/#/safes/0xC23DA3Ca9300571B9CF43298228353cbb3E1b4c0/balances",
                        "https://form.typeform.com/to/iM5lAFFD",
                        "https://gitcoin.co/issue/gitcoinco/creative/412/100026987",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://www.notion.so/gitcoin/06fad27dbd2d49468aa810c92f1f28c2?v=d403dc9f76144dcab232e3a18002494f",
                        "https://www.withtally.com/governance/gitcoin/proposal/9",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-18/8947",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-20/9070"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.901439849255383
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-24/9446",
            "title": "GitcoinDAO Digest #24 ",
            "index": 9446,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/seedphrase",
                    "index": "#1",
                    "likes": "6",
                    "time": "16/12/2021-11:46:43",
                    "content": "     GitcoinDAO Digest - Edition #24 Weekly highlights and hot topics from the GitcoinDAO community  If you would like to receive this newsletter in your inbox, sign up here!  Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading! Without further ado, let’s dive in!   Meta-Governance     Owocki published a series of posts this week after the deactivation of a grant last week. Read to learn more about how GitcoinDAO Stewards govern Gitcoin, and how that might change over time.   To the Web3 Farsi-speaking community   When We Come Up Short   What is the Governance Surface Area for GTC?   The Kobayashi Maru   An official response from @Gitcoin was also published on twitter.     Governance via Curation in Gitcoin Grants may be Necessary by Joe aims to “spark conversation, inform the community, and serve as a precursor to a proposal to potentially have steward ratification of the main round being separated from the Ethereum ecosystem rounds at a technical level and their guidance towards governance via curation.”   The Gitcoin Anti-Sybil Flywheel by Owocki explores how Gitcoin could be uniquely positioned to help with sybil resistence in the web3 ecosystem and how the sybil resistance created on Gitcoin could one day be exported to the rest of the ecosystem. Joe added further information and directions to the FDD General channel in Discord and If you would like to join the conversation.   Kevin gave an update on the proposal to Retroactive GTC Allocation to Lead Engineer of Gitcoin Grants V1 as the conversation continues with multiple Stewards providing feedback.   GitcoinDAO Hackathon 2022 by Leon describes how “The Gitcoin Events Team aims to organize the first GitcoinDAO Hackathon. In doing so, we hope to encourage the Gitcoin community, computer and social scientists, and field experts to accelerate the growth of digital public goods. The Gitcoin Events Team invites builders to propose digital technology solutions that make the governance and production of digital public goods and Gitcoin more democratic and accountable.”   Gitcoin Mission & Vision by Simona started a conversation around the “Gitcoin mission and vision for the project in an effort to align and update the trajectory & the purpose of this DAO” and proposes a “crystallised goal and modus operandi”.   2/17 ETH DENVER event by Huntfrye11 is a proposal to fund GitcoinDAO activities at ETHDenver 2022 with 4363 GTC to fund ETHDenver Cypher Sponsorship, SporkDAO Retroactive Rewards and Event Planning & Admin.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     Public Goods Are Good: PGF Q1 Budget Request Redistribute GTC to Individuals Who Could Not Claim Due to Error # dCompass Q4 Budget request    2/17 ETH DENVER event  # DeveloperDAO Partnership    Implementation of a Decentralized Bounty Platform - Progressive Decentralization Workstream  # Partnership & Mutual Grant with Prime DAO    Retroactive GTC Allocation to Lead Engineer of Gitcoin Grants V1        Workstream Discussion    Public Goods Funding    Public Goods Are Good: PGF Q1 Budget Request posted by @ceresstation requests 90k GTC for Q1 to forward the workstream mission to “help increase the interest in public goods within the web3, and to increase the funding for and the usage of quadratic funding based systems”.   Grants Round 12 officially exceeded $5m in funds raised across all rounds, the largest ever. Thanks to everyone who pitched in to make it a huge success!   Our first two DAO partnerships have passed on Snapshot for DeveloperDAO and PrimeDAO    Alisha and Lani hosted three episodes of the “Public Goods Are Good”-Twitter spaces last week. If you would like to listen back to an episode they will be up on Twitter for 30 days after recording. Three new episodes scheduled for this last week of GR12 before we continue on with the 1/weekly schedule. Recordings can be found here:  Recording with @garysheng Recording with @kaiynne & @noun12LFG Recording with @numagama & @stefdelev    Initial conversations around the Public Library + Crypto Culture and Society collaboration is starting to take place later this week!     Moonshot Collective    Yesterday (Tuesday 12/14) was the LAST DAY of The GreatestLARP. Colton also gave an update on The GreatestLARP in the forum thread.   Thanks to the help of our amazing community, The GreatestLARP raised over $500K for public goods.     Decentralize Gitcoin    This new dGrants dashboard shows key stats for GR12 and will be used for future rounds!   The Gitcoin Building Gitcoin round has received 1385 contributions valued at over $4718 across 39 grants with an average contribution amount of 3.4 DAI   Our workstream held a dGrants workshop which is intended to be the first of a series that goes into a deep dive of the various sections and components of dGrants   We are currently addressing the questions that we have received around a grant determined to be related to a sanctioned country   The DevOps sub-stream is building a VPN service to increase the level of security around our data.     Fraud Detection & Defense (FDD)    Operations  Building the FDD Operating System to restructure and smooth out the governance process as FDD continues its push towards decentralization. A framework for “minimal viable governance” is being worked on by core contributors. This includes councils rather than leads of initiatives. Our treasury diversification paid off! $150k USDC was bought over the last 2 weeks. We are now moving into ETH with the down market at parity. Our goal is approximately 50% GTC, 25% ETH, 25% stables (USDC/DAI/RAI) We are modeling a non-transferrable governance token for FDD to start examining decision integrity in different models alongside our current processes during Q1 2021. These models will explore the effect of issuance, inflation, voice/conviction, and exit ability as measurements.  Q4 2021 Budget | Epoch 5 & 6 payments this weekend. FDD is pausing mandatory meetings from 12/21/21 until 1/8/22. Contributors know their Q4 deliverables and will be able to work async or take time off as needed.    Sybil Detection  Monday the 20th at 3pm UTC (10am EST) - Join our massive, huge, incredible Sybil Defense roadmap event. This is the FDD contribution to the overall Grants Events schedule. Monday the 20th at 3pm UTC (10am EST) - Inviting relevant ecosystem guests Three out of five rounds of human evaluations have been completed totaling almost 3k reviews. Our data science squad performed an analysis of results to help us better review in the future rounds. We worked with Trueblocks as a contributor to FDD to create onchain data features for our ml algorithm. This will help the community data science group hit their Q4 deliverable of having one onchain feature in the ml pipeline. Final run of Blockscience algo to be run Monday afternoon. This is the one that is currently used for addressing the sybil accounts. Kevin published The Gitcoin Anti-Sybil Flywheel     Grant Eligibility  We made a new squad which aptly named itself the Grant Investigation Agency. Tasked with handling the grants disputes using Ethelo software, they talked to stakeholders to criteria for distributed adjudication of grants. This round we will run this process in parallel to the previous review squad model. A post round review will allow us to assign proper weighting to use the system to scale grant approvals and decrease turnaround time for GR13. Grants created after Dec 10th will not be approved for this round. Our review squads are now working on the dispute backlog which can be seen at our public Grants Disputes oversight page. Feel free to comment directly on the page!    Research  TE Governauts DAO Compensation Open Science Program had its halfway event. While GitcoinDAO is not a subject matter, 5 of the FDD researchers are participating in the study of DAO Compensation Models. Event Video  Growth & Experimentation - This squad is looking at how to define squad/initiative health & creating a playbook for starting new streams & squads. Their Q4 deliverable will be to deliver 3 academic papers focused on the following topics:  Bottoms Up Approach to Building the Research Stream Contributor Life Cycle Analysis dReward & Decentralization Review   Risks & Threats - The study of defending Gitcoin from both sybil attacks and other attacks on Gitcoins legitimacy to produce 3 academic papers include:  Sybil Profiles Analysis Gitcoin: Threats & Vulnerabilities Threat Detection in GitcoinDAO        Merch, Memes & Marketing    An update to the Steward Report Cards is underway and scheduled for launch by the end of week. The update greatly improves the APIs that fetch the different metrics displayed. A version 2.0 of the cards with added metrics and features is currently being outlined in collaboration with Simona.   The MMM workstream is working more closely with Gitcoin Holdings design and marketing team. We will present more plans in our upcoming Q1 budget proposal as we look to fully merge early next year.   A GitcoinDAO Primer as well as a couple of infographics are being worked on to help the community visualise the structure of various parts of GitcoinDAO.     Upcoming community events    Join the upcoming Sybil Defense roadmap event on Monday the 20th at 10pm ET hosted by the FDD-Workstream.   Join the Gitcoin team as we discuss the results of GR12 at 2pm ET on Dec 17th at the Gitcoin Grants Round 12 Finale Event.   Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET in Discord! We have been seeing great attendance and engagement.   Community Onboarding Call! New to Gitcoin? Every other Wednesday we’ll tell you all about how we’re organized and how to become an active contributor. The next one is Monday, December 20, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in. Current openings across the GitcoinDAO can be found here.     Key actions for this week:  Vote on the proposal to Redistribute GTC to Individuals Who Could Not Claim Due to Error.  Donate to your favorite project in GR12 and join us for the Gitcoin Grants Round 12 Finale Event at 2pm ET on Dec 17th.  Thanks for reading! Last week’s edition ",
                    "links": [
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/to-the-web3-farsi-speaking-community/9408",
                        "https://gov.gitcoin.co/t/when-we-come-up-short/9378",
                        "https://gov.gitcoin.co/t/what-is-the-governance-surface-area-for-gtc/9377",
                        "https://gov.gitcoin.co/t/the-kobayashi-maru/9379",
                        "https://twitter.com/gitcoin/status/1469046914226307127",
                        "https://gov.gitcoin.co/t/governance-via-curation-in-gitcoin-grants-may-be-necessary/9365",
                        "https://gov.gitcoin.co/u/DisruptionJoe",
                        "https://gov.gitcoin.co/t/the-gitcoin-anti-sybil-flywheel/9417",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://en.wikipedia.org/wiki/Sybil_attack",
                        "https://gov.gitcoin.co/t/the-gitcoin-anti-sybil-flywheel/9417/2",
                        "http://gitcoin.co/discord",
                        "https://gov.gitcoin.co/u/captnseagraves",
                        "https://gov.gitcoin.co/t/proposal-retroactive-gtc-allocation-to-lead-engineer-of-gitcoin-grants-v1/9343/8",
                        "https://gov.gitcoin.co/t/proposal-retroactive-gtc-allocation-to-lead-engineer-of-gitcoin-grants-v1/9343",
                        "https://gov.gitcoin.co/t/gitcoindao-hackathon-2022/9405",
                        "https://gov.gitcoin.co/u/leone",
                        "https://gov.gitcoin.co/t/gitcoin-mission-vision/9421",
                        "https://gov.gitcoin.co/u/Pop",
                        "https://gov.gitcoin.co/t/proposal-2-17-eth-denver-event/9419",
                        "https://gov.gitcoin.co/u/Huntfrye11",
                        "https://gov.gitcoin.co/t/proposal-public-goods-are-good-pgf-q1-budget-request/9416",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x3fdc2452ce289ea193413b3f169577f4dea05373fb6c503d982f4c3b1b892bb0",
                        "https://www.withtally.com/governance/gitcoin/proposal/11",
                        "https://gov.gitcoin.co/t/proposal-2-17-eth-denver-event/9419",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xe74f2ddceaf3a50cb7c6de9ae1be5ace0bed4c5c34ca980adda8d323de1cd2c6",
                        "https://gov.gitcoin.co/t/proposal-implementation-of-a-decentralized-bounty-platform-progressive-decentralization-workstream/9292",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-prime-dao/9330",
                        "https://gov.gitcoin.co/t/proposal-retroactive-gtc-allocation-to-lead-engineer-of-gitcoin-grants-v1/9343",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-Funding-80a3202a3a244c65b3fda08c0f7c7d60",
                        "https://gov.gitcoin.co/t/proposal-public-goods-are-good-pgf-q1-budget-request/9416",
                        "https://gov.gitcoin.co/u/ceresstation",
                        "https://twitter.com/gitcoin/status/1470878659363807232",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xe74f2ddceaf3a50cb7c6de9ae1be5ace0bed4c5c34ca980adda8d323de1cd2c6",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x29eaaff1ca752785b508298b4aaf5d4bf3173e9b3859b9832cc84c5b12b48847",
                        "https://twitter.com/gitcoin/status/1468469316546973697?s=20",
                        "https://twitter.com/i/spaces/1eaKbNZMrgXKX",
                        "https://twitter.com/i/spaces/1lDGLLEkdZoGm",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://greatestlarp.com/final-battle",
                        "https://gov.gitcoin.co/u/Colton",
                        "https://gov.gitcoin.co/t/a-governance-question-for-greatestlarp-com/8848/35",
                        "https://gitcoin.notion.site/Decentralize-Gitcoin-c3197f918bf640bc9809cd26d56c93f3",
                        "https://dune.xyz/fronk/gitcoin-dgrants-gr12",
                        "https://www.youtube.com/watch?v=17I7dBdMn3A",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://docs.google.com/spreadsheets/d/1-AYF28k2tyv0-eDhfqcLdqymCRcp6CdTsDgkflsAqMU/edit?usp=sharing",
                        "https://discord.com/events/562828676480237578/920072403655217252",
                        "https://gov.gitcoin.co/t/the-gitcoin-anti-sybil-flywheel/9417/2",
                        "https://www.notion.so/gitcoin/e79f1dd9e5074a1d986ee3f91b12943e?v=74372375b4ba42ebb269be219f2c452d",
                        "https://youtu.be/wndDaI-eNgc",
                        "https://gitcoin.notion.site/Memes-Merch-Marketing-c1bd89fac8ab4569bf2a676df28025d8",
                        "https://www.daostewards.xyz/",
                        "https://form.typeform.com/to/umHOZWWx",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://discord.com/events/562828676480237578/920072403655217252",
                        "https://www.addevent.com/event/fW10408956",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com/",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://www.notion.so/gitcoin/06fad27dbd2d49468aa810c92f1f28c2?v=d403dc9f76144dcab232e3a18002494f",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x3fdc2452ce289ea193413b3f169577f4dea05373fb6c503d982f4c3b1b892bb0",
                        "https://gitcoin.co/grants/",
                        "https://www.addevent.com/event/fW10408956",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-23/9370",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-1-2022/9683"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6150616008570555
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-20/9070",
            "title": "GitcoinDAO Digest #20 ",
            "index": 9070,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "5",
                    "time": "17/11/2021-22:14:55",
                    "content": " 1600×381 62.6 KB  Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading!  If you would like to receive this newsletter in your inbox, sign up here.  Without further ado, let’s dive in!   Meta-Governance    Owocki announced Schelling Point in Denver Colorado the day before ETH Denver on February 17th. The event is a one-day celebration of mechanism design, coordination tech, public goods, culture and regen finance. Join the conversation in the Telegram chat.   Transcending the Individualism & Collectivist Divide by Owocki makes the case that “there is a large opportunity to create alignment between these Individualist/Collectivist communities with web3 (and thereby move past the differences with views on public goods funding).”Individualists/Collectivists do not agree how to organize society. These disagreements were amplified by the nation-state era. We can bridge this divide with web3.   Laurence started a thread titled dGrant solution to discuss the challenges and possible solution to improve the Decentralized Grants Verification. The thread introduces the role of a “Watcher” that can flag suspicious submissions and send them to the “Gitcoin Grant Court” to challenge.   Owocki authored a thread titled Where does the Gitcoin Grants Matching Pool Money Come From? To give more insight and recognition to the projects and individuals that help fund the Matching pool for Grant Rounds. “As of Nov 2021, the Grants Multisig has roughly $15mm of tokens in it. At $1m/round and 1round/quarter, that is 15 rounds of Gitcoin Grants forward funded (for 3.5 years).” A big thank you to all the fantastic funders of Gitcoin Grants!   The GitcoinDAO Notion is undergoing a major revamp by QZ and Vishnu to make the experience more streamlined and easier to navigate. Right now there’s not a whole lot to see just yet, but we will be rolling out the new design during the next few days.   Lately you might also have noticed a lot moving around in the GitcoinDAO Discord: some channels popped up, others disappeared, and this is all part of a bigger plan to help people find their way around more easily. Kris and Alp have been focusing on this over the past couple of weeks, more updates coming soon!     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     dExplorer (Bounty / Fund Bounty)  dGTC Workstream Q4 Budget Proposal   Redistribute GTC to Individuals Who Could Not Claim Due to Error        Workstream Discussion    Public Goods Funding    Annika has been ramping up as a grants-ops lead. She published a proposal for Gitcoin GR12 Matching Pool Allocations to “discuss and finalize how funding allocations for the Gitcoin Grants Round 12 Matching Pool are distributed and how to use categories (if at all). After previous successful Grants Rounds, this proposal aims to continue community-owned decision making.”   The Ethereum Foundation announced their allocation of $500k to help fund crypto policy advocacy; other thematic rounds continue to make progress in the background.   The first Public Goods Twitter Space was hosted on Monday by Alisha and Lani, the event aims to help push the mission of public goods to a broader audience, QZ made a summary.   The first official librarian meeting was held to discuss the future of library onboarding and content curation.   As we get closer to being able to execute small test token swaps, we have also begun to seed and fund a number of other partnerships with orgs including DeveloperDAO, Verses, and DreamDAO.     Moonshot Collective    The GreatestLARP is going strong as 118 of 200 Molochs needed to open Level 4 (The Final Boss) have been minted. We have settled on a “womp womp” policy for Level 3, which adjusts the bonding curve in case minting slows. So far The Greatest LARP has raised over $338,000 for public goods. That’s a green-pilling! Owocki published a new poll on the go-live policy for level 4 (The Final Boss), which is about a week away at current pace.   Last Friday we dogfooded several Moonshot projects including Recruiter.Party, Tip.Party, and Tokenstream.Party. Get caught up on what they’re all about on our YouTube.   Moonshot Collective is the prototyping workstream of GitcoinDAO, do you want to help tell its story? We need writers, video producers, designers, and more. Come say hello in the Discord.     Decentralize Gitcoin    The Decentralized Gitcoin Workstream budget for Q4 has been executed on chain.   Currently the grant approval/denial process is very unclear in the interface to the end user. We are working on adding some clarity to the UI and process around this. My Grants and My Contributions pages are also being worked on.   The Data/DevOps substream has made movement on getting the sybil resistance machine learning pipeline running and is currently waiting for BlockScience to complete updates required to make it possible to run in a new environment   We are actively interviewing product and project management candidates for our workstream to help with both dGrants and our other projects     Fraud Detection & Defense (FDD)    The Sybil Detection pipeline gained a devops person to run the operational processes and algorithm developed by Blockscience while also beginning work on a community data lake. Combined with the anonymized data model for the open source feature engineering pipeline will create a wide range of community participation which wasn’t possible before.   Sybil Detection stream is looking to make a proposal to receive funding from ENS. They are also looking to contribute funding to BrightID, Proof of Humanity, and Idena to share datasets making more features available for detecting sybil accounts in a flywheel of reinforcement between identity and reputation.   The research stream passed its first proposal and will also be sending 5 Ph.D. researchers to participate in Token Engineering’s Governauts DAO Comp Policy study. They will study the mechanisms used by other DAOs and the effects they create.   The user support stream will be moving to the DAOops stream. This includes the knowledge base maintenance and the translation squads. FDD will send the remainder of their Q4 budget when they are set up with a governance structure or by request of the DAOops stream.    FDD Weekly Flags:  Yellow Flag: Aligned on next steps for legal. Gray area on contributor agreements in the meantime Green Flag: CrossStream DAOops governance made a plan for How we make decisions! Red Flag: Steward compensation could change options for entity type & tax requirements Yellow Flag: Need some parameters for judging squad/stream health Yellow Flag: How might we track insights from RAID models that don’t pay directly to contributors?      Merch, Memes & Marketing    The development substream of MMM is currently building out the Meme Museum. The purpose of the site is to provide an archive of web3 related memes for the broader community to reuse and to celebrate Memelords and artists.   A first version of the workstream’s website is currently being developed. The site will act as the team’s portfolio and create a more intuitive first point of contact for new contributors.   The “MMM🤝MC comms”-raid has been passed and funded. Matt leads the raid and is actively seeking new content creators, writers and video editors for the mission. Reach out on Discord if you would like to contribute!   The @GitcoinDAO Twitter account has been transformed into Gitcoin vibes. The account will interact with the community in a more fun and informal manner. The @ Gitcoin Twitter-handle will continue to be used as a way to announce events, initiatives and news. We are looking for contributors to manage @ GitcoinDAO, reach out if you’re interested!   We’ve seen some great submissions to our GR12-Schwag-bounty which will end next week. We look forward to onboard more talented designers and collaborate on the ETHDenver-swag pack and upcoming merch-drop!     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM EDT in Discord! We have been seeing great attendance and engagement.   Community Onboarding Call! New to Gitcoin? Every other Wednesday we’ll tell you all about how we’re organized and how to become an active contributor. The next one is Monday, November 22, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in. Current openings across the GitcoinDAO can be found here.     Key actions for this week:  Register for Schelling Point and join the Telegram chat. Give your feedback on how GR12 Matching Pool Allocations should be distributed before Thursday, November 18th.  Thanks for reading! Last week’s edition ",
                    "links": [
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://twitter.com/owocki/status/1460648659146608647?s=20",
                        "https://twitter.com/owocki/status/1460648659146608647?s=20",
                        "https://t.me/joinchat/EX2vtzI0earU2LER",
                        "https://twitter.com/owocki/status/1458541350211575808?s=20",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/u/lanlan3322",
                        "https://gov.gitcoin.co/t/discussion-dgrant-solution/9023",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/where-does-the-gitcoin-grants-matching-pool-money-come-from/9036",
                        "https://etherscan.io/address/0xde21f729137c5af1b01d73af1dc21effa2b8a0d6",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/u/fishbiscuit/",
                        "https://gov.gitcoin.co/u/vgk",
                        "https://discord.gg/gitcoin",
                        "http://twitter.com/krrisis",
                        "https://twitter.com/alpergintr",
                        "https://gitcoin.co/issue/gitcoinco/creative/412/100026987",
                        "https://www.withtally.com/governance/gitcoin/proposal/9",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gov.gitcoin.co/t/workstream-public-goods-funding/129",
                        "https://gov.gitcoin.co/u/annika",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-gr12-matching-pool-allocations/9007",
                        "https://twitter.com/AyaMiyagotchi/status/1460621197935198209",
                        "https://gov.gitcoin.co/u/alisha",
                        "https://gov.gitcoin.co/u/lanitrock/summary",
                        "https://twitter.com/f_shbiscuit/status/1460682988899868673?s=20",
                        "https://twitter.com/developer_dao",
                        "https://twitter.com/notscottmoore/status/1457885830333308928",
                        "https://twitter.com/garysheng",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gov.gitcoin.co/t/workstream-public-goods-prototyping/130",
                        "https://greatestlarp.com/",
                        "https://gov.gitcoin.co/t/a-governance-question-for-greatestlarp-com/8848/29",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/a-governance-question-for-greatestlarp-com/8848/33",
                        "https://zora.co/collections/zora/5725",
                        "https://youtube.com/playlist?list=PLVupIN3GgLtjNtEMPz32MQdQfX_wNYujL",
                        "https://gov.gitcoin.co/t/workstream-decentralize-gitcoin/180",
                        "https://www.withtally.com/governance/gitcoin/proposal/9",
                        "https://www.notion.so/gitcoin/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://gov.gitcoin.co/t/workstream-suggestion-mmm-merch-memes-marketing-for-public-goods-gitcoin-gitcoindao/7066",
                        "https://twitter.com/matthewcarano",
                        "https://twitter.com/gitcoindao",
                        "https://gitcoin.co/issue/gitcoinco/creative/412/100026987",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://www.notion.so/gitcoin/06fad27dbd2d49468aa810c92f1f28c2?v=d403dc9f76144dcab232e3a18002494f",
                        "https://schellingpoint.gitcoin.co/",
                        "https://t.me/joinchat/EX2vtzI0earU2LER",
                        "https://twitter.com/gitcoin/status/1461040846594363409?s=20",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-19/9003",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-21/9209"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.715693115364168
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-21/9209",
            "title": "GitcoinDAO Digest #21 ",
            "index": 9209,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/seedphrase",
                    "index": "#1",
                    "likes": "6",
                    "time": "24/11/2021-19:37:36",
                    "content": " 1600×381 61.7 KB  Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading!  If you would like to receive this newsletter in your inbox, sign up here.  Without further ado, let’s dive in!   Meta-Governance    Polygon has committed one of the largest single donations to the public goods treasury in Gitcoin history with a $1 million towards funding Public Goods, including $200,000 for upcoming Grants Round 12! Gitcoin is now also supporting grants checkout with Polygon.   Grants Round 12 will go live soon! Gitcoin’s biggest quarterly event is kicking off on December 1st and running through December 16th, 2021. On Wednesday, Dec 1st at 10:00 am MST Gitcoin will be hosting the GR12 Kick-Off event. Core Gitcoin contributors will present alongside key partners to celebrate the beginning of GR12 and showcase the many improvements we’re making to our flagship grants offering.   Elliot from Llama published the GitcoinDAO treasury report for October 2021 with some key highlights. The statements are split into transactions denoted in the governance token GTC and separate transactions in stablecoins.   The dGrant solution discussion started by Laurence on possible improvements to the Decentralized Grants Verification has moved on from the forum to the #dgrants-feedback channel on Discord.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     dExplorer (Bounty / Fund Bounty) FDD Workstream Q4 2021 Budget    Redistribute GTC to Individuals Who Could Not Claim Due to Error Gitcoin GR12 Matching Pool Allocations       Workstream Discussion   Public Goods Funding    Annika has been ramping up as a grants-ops lead. She published a proposal for Gitcoin GR12 Matching Pool Allocations to “discuss and finalize how funding allocations for the Gitcoin Grants Round 12 Matching Pool are distributed”. The proposal is currently live on Snapshot.   On top of the Ethereum Foundation’s announcement, a number of new funders have come in for GR12 including Chainlink, EPNS, and KlimaDAO. More to come next week!   The second Public Goods Twitter Space was hosted on Monday by Alisha and Lani, featuring Niran from Panvala. The event aims to help push the mission of public goods to a broader audience.     Moonshot Collective    The GreatestLARP continues! Help coordinate to stop Moloch while raising funds for public goods. We are mid Level 3, with 144 of 200 Molochs needed to open Level 4 minted. Wanna play? We expect to reach 200 Molochs minted sometime within the week, which will unlock The Final Boss. The GreatestLARP has already raised over $338,000 for public goods.   This week we launched our new blog. If you’d like to learn more about Moonshot Collective, check out our ‘Hello World’ post here.   This week we dogfooded Season 1 priorities Recruiter.Party, and Retroactive Public Goods Funding Starter Kit (Payback). Check out our demo videos on the Moonshot Collective Youtube.     Decentralize Gitcoin    Performance fixes have been implemented in the dGrants platform around blockchain data retrieval, indexed data retrieval from The Graph, and IPFS data retrieval resulting in a much more snappy feeling when browsing grants on dGrants.   The GrantRound contract that will be used for GR12 has been finalized and deployed.   We have added a few new features like a My Grants page and My Contributions page which will help give insight into your own actions on the platform.   We are finalizing the list of eligible grants that will be a part of the ‘Gitcoin Building’ Grant Round in GR12.   Migrating the Anti Sybil pipeline infrastructure and code from Bloc Science to the Gitcoin DAO is underway and making progress.   The DevOps sub-stream is beginning a discovery phase intended to learn what additions would have the highest immediate impact on the DAO based on needs across the board.     Fraud Detection & Defense (FDD)    Contributor payments for Epochs 1 & 2 have been paid using Gilden mass pay. Contributors receive an email notification with the transaction hash; with a gas cost of about $250 for the entire workstream we’re able to cover each biweekly payment.   Anti-Sybil ML:  Changing the name to Sybil Detection. This week Blockscience is delivering a refactored code while the ASOP were set up by the new DAO DevOps lead. The feature engineering squad identified new patterns from Github data and is developing processes and access policies to make it easier for new contributors to participate. Onchain Forensics work starts this week having accepted Trueblocks to help guide how we use onchain data to not only identify sybil behavior, but also to educate Gitcoin users about the transparency of their on-chain activities.    Research:  Added 2 squads this week. Risks & Threats will be studying sybil attacks and other threats to the grants mechanism. They will identify other threats and risks to the DAO as well. These learnings will be used to draft proposals to dive deeper into mitigation techniques. Growth & Experimentation will be looking at stream & squad governance and compensation policies working within GitcoinDAO to define and conduct experiments teaching us how to grow.    Policy:  The GitcoinDAO Appeals Panel now has over 10 members to hear out any appeals to decisions made by the FDD Grant Approvals and Disputes squads. The panel consists of industry experts from projects like BrightID, Idena, and 1Hive and are chosen for their expertise in identifying sybil behavior.    DAOops is spinning out of FDD as planned on the Q4 budget proposal. FDD is ready to send the funds to the multisig for DAOops providing a clean transition of responsibility and accountability. Gitcoin Holdings is working on a governance proposal to formalize a DAOops workstream consisting of:   CrossDAO Operations - Opt-in shared infrastructure services governed by the CrossStream DAOops Governance council with reps from each workstream, DAOops, and Gitcoin Holdings. The squads include Onboarding Hosts, DAO Tooling, and People Operations.   DAOServices - Conducts business for the DAO as a whole like legal and accounting work. Looking to be more clearly defined in the proposal being drafted to be ratified by the stewards.   Support offering contributor support, user support, steward support etc. The current User Support stream also hosts the knowledge base, knowledge acquisition incentives and translations & localization efforts.       Merch, Memes & Marketing    The Merch bounty for GR12 ends on Friday, we’re excited to reward the winners and get the art up on the schwag store. A couple of the designers from the bounty have been onboarded to the workstream and are continuing the work on the schwag pack for ETHDenver.   The first version of the Meme Museum is planned to launch during the next Memepalooza which will take place next Friday, Dec 3. Preparations for the event are also ongoing.   Our Notion got a revamp last week and we are working on creating header images and design elements to be used by the different initiatives in Notion and elsewhere. Work has also begun to create virtual backgrounds for meetings.     Upcoming Community Events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM EDT in Discord! We have been seeing great attendance and engagement.   Community Onboarding Call! New to Gitcoin? Every other Wednesday we’ll tell you all about how we’re organized and how to become an active contributor. The next one is Monday, December 6, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in. Current openings across the GitcoinDAO can be found here.     Key actions for this week:  Vote on the on-chain proposal for FDD Workstream Q4 2021 Budget. Vote on the proposal to ratify Gitcoin GR12 Matching Pool Allocations. Join the GR12 Kick-Off event Dec 1st at 10:00 am MST.  Thanks for reading! Last week’s edition ",
                    "links": [
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gitcoin.co/blog/polygon-commits-1-million-for-public-goods-gitcoin-launches-polygon-checkout/",
                        "https://gitcoin.co/blog/announcing-grants-round-12/",
                        "https://www.addevent.com/event/uF9624233",
                        "https://gov.gitcoin.co/u/Elliott",
                        "https://gov.gitcoin.co/t/gitcoin-financial-reporting/8867/2",
                        "https://drive.google.com/uc?id=1NOmC3UqLdmMNX4T3LEAX1uUme4GyTWdj&export=download",
                        "https://gov.gitcoin.co/t/discussion-dgrant-solution/9023",
                        "https://gov.gitcoin.co/u/lanlan3322",
                        "http://gitcoin.co/discord",
                        "https://gitcoin.co/issue/gitcoinco/creative/412/100026987",
                        "https://www.withtally.com/governance/gitcoin/proposal/10",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x2ccad330b1d12a8fd0c00835bf8cf2b84a2f51ff187bca36c37fddfab3ca47ab",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-Funding-80a3202a3a244c65b3fda08c0f7c7d60",
                        "https://gov.gitcoin.co/u/annika",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-gr12-matching-pool-allocations/9007",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x2ccad330b1d12a8fd0c00835bf8cf2b84a2f51ff187bca36c37fddfab3ca47ab",
                        "https://twitter.com/AyaMiyagotchi/status/1460621197935198209",
                        "https://twitter.com/f_shbiscuit/status/1463513718017314817?s=20",
                        "https://gov.gitcoin.co/u/alisha",
                        "https://gov.gitcoin.co/u/lanitrock/summary",
                        "https://twitter.com/niran",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://greatestlarp.com/",
                        "https://medium.com/moonshot-collective/hello-world-were-moonshot-collective-b17b3d5139fe",
                        "https://www.youtube.com/channel/UCfbOba7iD19HyrB9QbV6Uww",
                        "https://gitcoin.notion.site/Decentralize-Gitcoin-c3197f918bf640bc9809cd26d56c93f3",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://gitcoin.notion.site/Memes-Merch-Marketing-c1bd89fac8ab4569bf2a676df28025d8",
                        "https://gitcoin.co/issue/gitcoinco/creative/412/100026987",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://www.notion.so/gitcoin/06fad27dbd2d49468aa810c92f1f28c2?v=d403dc9f76144dcab232e3a18002494f",
                        "https://www.withtally.com/governance/gitcoin/proposal/10",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x2ccad330b1d12a8fd0c00835bf8cf2b84a2f51ff187bca36c37fddfab3ca47ab",
                        "https://www.addevent.com/event/uF9624233",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-20/9070",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-22/9286"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.65208633958634
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-22/9286",
            "title": "GitcoinDAO Digest #22 ",
            "index": 9286,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#1",
                    "likes": "4",
                    "time": "01/12/2021-17:29:04",
                    "content": " 1600×381 61.7 KB  GitcoinDAO Digest - Edition #22 Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading!  If you would like to receive this newsletter in your inbox, sign up here.  Without further ado, let’s dive in!   Meta-Governance    Nader published a proposal for a Partnership & Mutual Grant with Developer DAO. “The proposal, if passed, would issue 50,000 GTC for governance rights equating to 5% of Developer DAO when governance is live. The purpose of this alliance is to help ensure that Gitcoin and Developer DAO can work together to coordinate bringing more web2 developers into web3 than ever before through education and events, as well as supporting the creation and distribution of public goods.”   Owocki authored a thread titled Coordination.Party Kit that describes the Coordination Party Kit that Moonshot Collective is working on and aiming to launch in February at Schelling Point. The Kit is a “tool suite that helps recruit, recognize, reward, and retain contributors to DAOs.” If you would like to try out the CPKP in your own DAO, please join the coordination.party 2/17 launch Telegram group    A Community Based Roadmap for Sybil Detection Across Web 3 by Joe describes the problems of sybil attacks on the Gitcoin platform and how the FDD-workstream works towards solving these problems. The post ends with an exploration of the possibility of a “A Sybil Detection DAO” with collaboration between DAOs to combat attacks.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     Partnership & Mutual Grant with Developer DAO dCompass Q4 Budget request # FDD Workstream Q4 2021 Budget    Redistribute GTC to Individuals Who Could Not Claim Due to Error  # Gitcoin GR12 Matching Pool Allocations       Workstream Discussion    Public Goods Funding    Grants Round 12 goes live this week, with over $2m in matching pool funding from a variety of ecosystem partners like ENS, Ethereum Foundation, and NounsDAO   NounsDAO in particular has committed one of the largest single amounts of funding ever at 169 ETH, with a special NounsBot auction set to happen later this week   Moreover, PGF successfully set up over 10 rounds in total for GR12, including three cause rounds focusing on advocacy, climate, and longevity   The public library and public goods PR squads continue to push forward on helping promote and expand the discourse around public goods; Aya from the Ethereum Foundation and a number of other exciting speakers are coming up!   We’ve continued to solidify partnerships with groups like DeveloperDAO, Verses, and more.     Moonshot Collective    The GreatestLARP, a multi-level coordination game to fund public goods is down to the final level and we need you! Join us on Dec 6 for the kick-off party where we’ll come together to beat The Final Boss. Save the date here!   The GreatestLARP has already raised approximately $400K for public goods, with the opportunity to raise hundreds of thousands more.   How does it work? We must crowdfund 50 ETH to unlock Level 4’s final battle between Moloch and our ETHBot hero, enshrined as a 1:1 NFT. All proceeds fund public goods, but not only that: crowdfund participants own a portion of the NFT, based on how much they contribute. Let’s coordinate to take down Moloch!     Decentralize Gitcoin    Final bug fixes being pushed out in preparation for Grants Round 12 start.   ‘My Grants’ feature is done and merged, ‘My Contributions’ final review and will be merged soon.   The ‘Gitcoin Building Gitcoin’ grant round has been deployed to Polygon.   Grants are being created for the round on the dGrants production instance.   Working on an improved support process and grant review/approval process.     Fraud Detection & Defense (FDD)    The Sybil Detection pipeline presents a novel way for participatory self-governance for user-driven content moderation. Solving sybil-resistance and exporting it to any dapp developer will unlock quadratic voting and staking mechanisms across web 3.   Omnianalytics presented on an FDD contributor access management framework. “You’ve thrown a diverse group of highly motivated people onto an island with plenty of food, water, and raw materials and given them the mandate to build a city. Considering their backgrounds, the landscape and various hidden constraints, how should they coordinate to get things done?”  We, the Anti-Sybil FDD team, are the castaways. The resources are our smarts, motivation and the budget. The landscape is the currently available technology stack. The mandate is to build out a ML Anti-Sybil defense for the GitcoinDAO. The city we’re building is that Machine Learning pipeline and process.    Formal research on the motivation and profiling of sybil attackers began in the research initiative. Identifying the motivations behind these attacks will give us better insights into protecting quadratic funding.   In Q3, FDD took the initiative to ensure that contributors got paid and that the DAO mitigated potential issues which could be avoided. Now the process of finding out where these streams are best situated is beginning to take shape. The unspent funds for DAOops in Q4 will be sent to the new CrossStream DAOops multisig     Merch, Memes & Marketing    Memepalooza 4 will take place this upcoming Friday. The event is a 3-hour long meme creation-session with meme lords from the broader community joining forces to meme public goods, the open internet and the values of Gitcoin.   Memes.party, a website to celebrate meme lords and great memes, was demoed earlier this week and is set to launch on Friday at Memepalooza 4. Participants of Memepalooza will be the first to test out the new tool.   The schwag bounty put up by the workstream ended last Friday. We had over 20 people submit designs. After much deliberation by the MMM design-substream, three winners were chosen and announced on Discord. The 1st place winner was awarded 500 DAI and the two with 100DAI to the two runners up. All items will be up in the Gitcoin store shortly.     Upcoming community events    Memepalooza 4, the monthly meme design jam session hosted by the MMM-workstream is happening this Friday. Join the meme party in Discord at 2PM ET / 7PM UTC.   Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET in Discord! We have been seeing great attendance and engagement.   Community Onboarding Call! New to Gitcoin? Every other Wednesday we’ll tell you all about how we’re organized and how to become an active contributor. The next one is Monday, December 6, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in. Current openings across the GitcoinDAO can be found here.     Key actions for this week:  Vote on the dCompass Q4 Budget request on Tally. Check out Grants Round 12 and donate to your favorite projects!  Thanks for reading! Last week’s edition ",
                    "links": [
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/u/dabit3",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-developer-dao/9217",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/coordination-party-kit/9231",
                        "https://moonshotcollective.space/",
                        "http://schellingpoint.gitcoin.co/",
                        "https://t.me/+fN8W3Vv1tGthYjEx",
                        "https://gitcoin.co/blog/a-community-based-roadmap-for-sybil-detection-across-web-3/",
                        "https://gov.gitcoin.co/u/DisruptionJoe",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-developer-dao/9217/6",
                        "https://www.withtally.com/governance/gitcoin/proposal/11",
                        "https://www.withtally.com/governance/gitcoin/proposal/10",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x2ccad330b1d12a8fd0c00835bf8cf2b84a2f51ff187bca36c37fddfab3ca47ab",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-Funding-80a3202a3a244c65b3fda08c0f7c7d60",
                        "https://gitcoin.co/blog/announcing-grants-round-12/",
                        "https://discourse.nouns.wtf/t/proposal-a-very-nounish-gitcoinmas-nft-crossover-event-169-eth-to-crypto-public-goods/369",
                        "https://gitcoin.co/blog/announcing-grants-round-12/",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://greatestlarp.com/final-battle",
                        "https://www.addevent.com/event/Qu10410679",
                        "https://gitcoin.notion.site/Decentralize-Gitcoin-c3197f918bf640bc9809cd26d56c93f3",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://gitcoin.notion.site/Memes-Merch-Marketing-c1bd89fac8ab4569bf2a676df28025d8",
                        "https://www.addevent.com/event/ja10368883",
                        "https://gitcoin.co/issue/gitcoinco/creative/412/100026987",
                        "https://store.gitcoin.co/products/%F0%9F%9A%80-defiversal-hoodie",
                        "http://gitcoin.co/store",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/ja10368883",
                        "http://discord.gg/gitcoin",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://www.notion.so/gitcoin/06fad27dbd2d49468aa810c92f1f28c2?v=d403dc9f76144dcab232e3a18002494f",
                        "https://www.withtally.com/governance/gitcoin/proposal/11",
                        "https://gitcoin.co/grants/",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-21/9209",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-23/9370"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.685527070968247
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/12/2021-19:09:17",
                    "content": " All items will be up in the Gitcoin store shortly.  Heads up the link is http://store.gitcoin.co/ ! ",
                    "links": [
                        "http://store.gitcoin.co/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#3",
                    "likes": "0",
                    "time": "02/12/2021-01:50:33",
                    "content": "The store looks great!!! Is it supporting payment with ETH,DAI…? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#4",
                    "likes": "0",
                    "time": "02/12/2021-16:58:24",
                    "content": "yes it does support token payments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "599"
}