{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/schelling-point-amsterdam-information/10398",
            "title": "Schelling Point Amsterdam Information ",
            "index": 10398,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#1",
                    "likes": "4",
                    "time": "20/04/2022-19:54:56",
                    "content": "**Hi Frens !  Hello and thanks for signing up to come to Schelling Point Amsterdam! If you are receiving this email you are on the list of attendees. We are really excited about this year’s event! Here is what you need to know. TL;DR 1.Arrive Early - Come get your hands on some good coffee and get comfy. Transportation - Take the train (or a bike or scooter) to Grand Hotel Krasnapolsky - Uber will be slow/ expensive 3. What to Expect - Schelling Point is going to be fun (and it may just be a turning point for human civilization). As part of DevConnect there will be tons of side events, art shows after parties and cool stuff in town.  Schelling Point - Grand Hotel Krasnapolsky1920×1080 255 KB  Details: Arrive Early - Get to the venue in the morning before 9 to get a coffee and bring it with you into the room to your seat. We will have POAP for those who arrive early. And they are epic. Transportation -  Transit is the best way to get around. Its a short trip from the venue to the after party as well as likely being the fastest way to get to the venue from wherever you are staying. Bikes and scooters are easily accessible. If you want to feel like a local… take a bike in the worlds most bike friendly city. Can’t Make it? - If you can’t attend Schelling Point for whatever reason that is ok. Let us know if you signed up and can’t attend this year so we know how many people to expect. The Remote Experience : This year we are going to make the remote experience more interactive and interesting with discussion on Twitter, Discord and Telegram. There will be live streams of every talk at Schelling Point and ETH Denver on Youtube and Twitch that you will be able to watch directly on the website and more opportunities to be part of the event. So stay tuned to the website for more information https://schellingpoint.gitcoin.co/ After Party and Other Surprises: The afterparty will be at Lofi with doors at 7pm. Attendance is free and reserved for Schelling Point Attendees .  image1431×1099 113 KB  Check out this awesome guide of what to check out in the city while you are in town.    Notion    Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. A new tool that blends your everyday work apps into one. It's the all-in-one workspace for you and your team      Ok that’s it. Have a great time! Ben West The Schelling Point Team ",
                    "links": [
                        "https://lofi.amsterdam",
                        "https://gitcoin.notion.site/Schelling-Point-April-21-2022-a667496e31534fa9b7ded9a42d82458b",
                        "https://gitcoin.notion.site/Schelling-Point-April-21-2022-a667496e31534fa9b7ded9a42d82458b"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.549523955773956
                }
            ]
        }
    ],
    "group_index": "65"
}