{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/the-plateau-of-productivity/10269",
            "title": "The Plateau of Productivity \\xf0\\x9f\\x8c\\x84 ",
            "index": 10269,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "2",
                    "time": "30/03/2022-22:58:53",
                    "content": "In Hype Cycles - a tool for sensemaking I spoke a bit about the Garner Hype Cycle, which is a tool I’ve used throughout my career to keep an eye on emerging technologies and make bets for how I should spend the scarcest resource I have - my time & attention. Hype Cycles are a useful tool for thinking about technology cycles, and in this post I want to talk about how I use them to think about what I’ve seen during the last 4.5 years at Gitcoin. I especially want to talk about the The Great Bear, The Great Reset, The Great Revival. I think that this is how things have evolved through the history of Gitcoin.   Innovation Trigger - The Quadratic Funding Academic Paper is authored by @GlenWeyl @vbuterin and Zoe Hitzig.  Gitcoin adopts it with strong results.  Peak of Inflated Expectations - In 2019/2020, these was a lot of high expectations about QF on Gitcoin.  Grants has several blogs from Vitalik, glowing testimonials from people who used it to augment their income during the bear market, and lots of chatter about the future of QF.  Trough of Disillusionment -  In 2021, I think that reality hit us in a big way.  The Gitcoin team (at the time, centralized) had some turnover.  We realized that a centralized monolithic product was mispositioned to fund public goods in a decnetralized ecosystem.   We realized that a company was not the right vessel for Gitcoin Grants, that a DAO might be a better vessel.  We were busy launching that DAO and cultivating the Egregore around it.  We began to confront our technology, organizational, + other debt from the Great Bear.  These things weighed down Innovation on Grants 1.0, though Grants continued to see [strong growth]. (https://twitter.com/owocki/status/1507172975144886272) due to its investment in side rounds.  During this time, from the perspective of the community - the novelty of QF wore off and Grants rounds became somewhat routinely expected by the community.  Trough of Disillusionment - In 2022, we are further along in the trough of disillusionment, but the plateau of productivity is perhaps in sight.   Screen Shot 2022-03-30 at 4.42.31 PM1920×1277 84.4 KB  The thing I want to name is that Grants 1.0 is in maintenance mode, and Grants 2.0 has not launched yet.  The Gitcoin Product Collective has published a new vision for Grants 2.0 and will be executing in the coming months to build a solid foundation for Gitcoin Grants.  While Grants continues to grow modestly, Grants 2.0 is how we scale our impact 📈. I want to call this out explicitly because.  I think it’s ok to be in the Trough of Disillusionment.  We should be able to recognize we are in an in between state, and that that is a natural part of the lifecycle of a project or a market trend. The product teams need time to lay a solid foundation for Grants 2.0 before it starts innovating again. The DAO needs to create a solid foundation to establish itself.  From this solid foundation, it can begin to focus on creating massive innovating again. I think its useful to remind ourselves that Plateau of Productivity is ahead of the DAO (if it executes its product roadmap)  Over the past few months, people have shared some big ideas for what could be built on top of Grants 2.0:  Grants 2.0 is how we scale our impact 📈 How Soulbound Tokens Can Make Gitcoin Grants More Pluralistic Quadratic Funding x Effective Altruism Proof Of Impact 🌱 [Proposals Wanted] - #6 by nya-elimuai The ImpactDAO/ProtocolDAO Sandwich 🥪 - #4 by owocki A world where QF Enhances *Every* Income Governance via Curation in Gitcoin Grants may be Necessary  I am really excited about these innovations, and I want to see them happen. Here is my closing prompt to you all: What needs to be true to get Grants 2.0 fully to the plateau of productivity? ",
                    "links": [
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855",
                        "https://arxiv.org/pdf/1809.06421.pdf",
                        "https://medium.com/gitcoin/experiments-with-liberal-radicalism-ad68e02efd4",
                        "https://twitter.com/owocki/status/1507172975144886272",
                        "https://vitalik.ca/",
                        "https://gov.gitcoin.co/t/our-flagship-product-is-gitcoindao/10081",
                        "https://gov.gitcoin.co/t/the-gitcoin-gitcoindao-egregore-is-emerging/8200",
                        "https://twitter.com/owocki/status/1507172975144886272",
                        "https://gov.gitcoin.co/t/how-does-the-dao-prioritize-side-rounds/9827",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
                        "https://gov.gitcoin.co/t/how-soulbound-tokens-can-make-gitcoin-grants-more-pluralistic/10077",
                        "https://gov.gitcoin.co/t/quadratic-funding-x-effective-altruism/10016",
                        "https://gov.gitcoin.co/t/proof-of-impact-proposals-wanted/10179/6",
                        "https://gov.gitcoin.co/t/the-impactdao-protocoldao-sandwich/8944/4",
                        "https://gov.gitcoin.co/t/a-world-where-qf-enhances-every-income/10202",
                        "https://gov.gitcoin.co/t/governance-via-curation-in-gitcoin-grants-may-be-necessary/9365",
                        "https://gov.gitcoin.co/t/the-overton-window-for-grants-2-0/10461",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.978859189905701
                }
            ]
        }
    ],
    "group_index": "43"
}