{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/governance-in-review/10826",
            "title": "Governance in Review ",
            "index": 10826,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "governance"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#1",
                    "likes": "3",
                    "time": "06/06/2022-18:57:35",
                    "content": "I wanted to share some of my thoughts after S14 and really look at governance as an organic work of balance above everything else and how creating governance flows in a mindful and collaborative manner can evolve us to a new way of organizing. Naturally. \"What they tell you is that DAOs are decentralized autonomous organizations. Groups of humans organizing around a specific purpose, coordinating via an agreed-upon set of engagement rules enforced on a blockchain and sharing economic resources and/or protocol rules in the quest to fulfil said purpose. What they don’t tell you in the brochure is that humans organizing around a purpose, sharing resources and coordinating via an ever evolving agreed-upon set of rules is HARD. Just like a butterfly transforming from a fleshy, ground bound caterpillar, new forms of human organization take their time to evolve from the hairy situation we’ve progressively calcified ourselves into. The complexities of coordination, collaboration and co-creation are so multi-faceted, multi-layered and multi-coloured that they are as beautiful as they are infuriating. Evolving DAOs feels like building a house on quicksand. During an earthquake. In the rain. It’s all about balance. It’s an extreme exercise in balance above everything else.\" Full post on Mirror ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.452020202020202
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#2",
                    "likes": "3",
                    "time": "08/06/2022-01:00:21",
                    "content": "    Pop:  What they don’t tell you in the brochure is that humans organizing around a purpose, sharing resources and coordinating via an ever evolving agreed-upon set of rules is HARD.   totally agree with you, there is a cartoon in China which is One monk has water to drink, two monks carry water to drink, and three monks have no water to drink.  The cartoon 中国国产经典动画片 三个和尚 - YouTube ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.270833333333333
                }
            ]
        }
    ],
    "group_index": "130"
}