{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-should-vc-funded-projects-get-clr-matched-funding/2505",
            "title": "[Proposal] Should VC funded projects get CLR matched funding? ",
            "index": 2505,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/pet3rpan",
                    "index": "#1",
                    "likes": "21",
                    "time": "26/05/2021-20:05:40",
                    "content": " Should VC funding projects be allowed to benefit from CLR matched funding?  In my opinion, no. I believe that there are many more projects that are either pre-investor or pre-business-model-stage that can benefit much more from CLR matched funding. By limiting funding to pre-investor projects, I believe Gitcoin is able to:  Increase its impact with earlier stage public goods projects that in greater need of funding Achieve the same impact while becoming even more capital efficient (excess funding can be used to funneled towards other more productive uses)  I would not oppose Gitcoin efforts in helping/support investor-funded public goods / community-owned projects but do not believe CLR is the current appropriate avenue.  Discussion  Are investor funded projects no longer open source public goods?  Imo, you can take funding from investors and still be classified as a community owned public good to some degree. Community ownership exists on a spectrum here.   What classifies as ‘VC funded’?  A for profit entity with external funding from investors either public or privately.     Potential solutions:  Maybe require projects to opt-in in order to participate in CLR matched funding rounds - where the t&c would indicate that only non-investor funded projects can opt in. Manual moderation can be used to enforce this rule if broken.  ",
                    "links": [],
                    "GPT-summary": "The author of the post proposes that VC funded projects should not be allowed to benefit from CLR matched funding. They believe that pre-investor or pre-business-model-stage projects are in greater need of funding. The post also discusses the classification of VC funded projects and potential solutions to the issue. A 3rd party gives constructive criticism by asking questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Law and regulations",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.775
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/livethelifetv",
                    "index": "#2",
                    "likes": "1",
                    "time": "26/05/2021-20:16:36",
                    "content": "Valid point. Makes sense! In short, no. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#3",
                    "likes": "6",
                    "time": "26/05/2021-20:17:27",
                    "content": "Hey @pet3rpan! I concur with the no. There is no reason to stop funded projects from participating in the gitcoin community. Gitcoin has a lot to offer (outreach, community etc.) apart from CLR matching funding. And all projects should be able to get that. But as you also mentioned, well funded projects, be it VC or a token/ICO are already well on their way to build their products. CLR matching would not have as significant an impact there as it would in a project that is being bootstrapped or is just even starting.  Are investor funded projects no longer open source public goods?  Well it depends. Is it opensource? Can people learn from it? Use it? I honestly never liked the public good definition. For me gitcoin was always about funding opensource and at least for me it helps have a clear definition between what I believe should be and should not be funded.  What classifies as ‘VC funded’?  Probably VC funded is not the right term. “Funded” or “Well funded” would be the right term. Either via a VC round, or a token/ICO.  Maybe require projects to opt-in in order to participate in CLR matched funding rounds -  I really like the idea of opt-in CLR with a T&C specifying they need to not have a sustainable source of funding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.588010204081632
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#4",
                    "likes": "4",
                    "time": "26/05/2021-20:21:03",
                    "content": "Great points to bring up. I agree that VC funded projects should not get CLR matched funding so there can be more of a focus on funding early stage public goods. Some things to consider:   What happens if a project that received CLR matched funds then raises VC funding shortly after? Do any of the matched funds get returned? Would be great to have some expectations/guidelines in place   What if the team raised a very small amount of funding from investors? i.e. does any amount automatically disqualify them or is there a low $ threshold?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.171875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/JTraversa",
                    "index": "#5",
                    "likes": "3",
                    "time": "26/05/2021-20:30:19",
                    "content": "  What classifies as ‘VC funded’?  A for profit entity with external funding from investors either public or privately.     I’d reword this definition. Plenty of VC funded projects are non-profits so thats a separate topic (and visa-versa). I think everyone is going in the right direction. Though I think any arbitrary cut-off quickly becomes irrelevant. 250-500k to a project with a team in India might be “well funded”, but the same amount to an American or European team is an existential crisis. I’d elect to codify a rule against “funded” projects, and let the projects decide what that means. If a project that the community feels is “funded” elects to receive CLR matching, they could then be required to make a verifiable statement regarding where the funds specifically will be allocated and exactly the value they provide (value that otherwise might not be possible). This would avoid the issues of actually defining what “funded” means, while still adhering to the distribution and ethos we’re trying to establish. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.381802721088436
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Typto",
                    "index": "#6",
                    "likes": "0",
                    "time": "26/05/2021-20:35:08",
                    "content": "In my opinion no. We need to use these matching funds for public goods or early projects that have not yet entered the commercial stage. In fact, I realized this😂, so DAOSquare used all match funds in GR9 to launch a OVO Grants to support those public goods. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/thibauld",
                    "index": "#7",
                    "likes": "3",
                    "time": "26/05/2021-20:48:32",
                    "content": "Fully agree here. @linda raises good points though in that we need some well defined rules but I wouldn’t overthink it or try to find perfect rules. I’d rather aim for simplicity and handle the exceptions “manually”. Something like:  Projects who received more than $1M in external funding from investors cannot receive CLR matched funding. Grants are excluded from this calculation (not investment) as well as revenues (not investment). Projects can ask for an exception by exposing their case in this governance forum. Projects who received funding during or after receiving CLR matched funding don’t have to return funds but they are kindly invited to to pay-it-forward  and contribute to the next round(s) of gitcoin grants.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.333333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#8",
                    "likes": "3",
                    "time": "26/05/2021-22:19:30",
                    "content": "I’ve funded a number of projects/companies through my fund that have received grants in the past, so wanted to just make sure to bring that up since I don’t think that’s as much of an edge case anymore. I really like the pay-it-forward and contribute to next round(s) of gitcoin grants approach request. I also like requiring projects to opt-in in order to participate, fine with saying no VC funding (no arbitrary $ cutoff), and telling projects they can ask for an exception in the governance forum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.797619047619048
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#9",
                    "likes": "0",
                    "time": "26/05/2021-23:19:24",
                    "content": "I concur strongly with a no. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/walidmujahid",
                    "index": "#10",
                    "likes": "0",
                    "time": "27/05/2021-15:20:24",
                    "content": "    lefterisjp:  Probably VC funded is not the right term. “Funded” or “Well funded” would be the right term. Either via a VC round, or a token/ICO.   I agree that it should termed something like “Funded”, not just VC. And I concur with no. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.619047619047619
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kameir",
                    "index": "#11",
                    "likes": "1",
                    "time": "27/05/2021-20:55:18",
                    "content": "As usual, there’s not a binary answer to be had here. We are a VC in the space, and looked at more than seven hundred “blockchain” projects over the years, and many times the team will contribute to open source development, while also building a commercial application (we have even funded projects with single devs). The former should generally be community-driven, and governed, while the latter is best funded by commercial interest. The internet was largely build on open source technology, but most applications had commercial drivers. For some time to come, we will need to bring the two closer together, and bridge the gap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.814285714285714
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kasseen",
                    "index": "#12",
                    "likes": "0",
                    "time": "28/05/2021-00:19:12",
                    "content": "In my opinion, Heck No. I really don’t think they should either. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/androolloyd",
                    "index": "#13",
                    "likes": "1",
                    "time": "29/05/2021-16:00:12",
                    "content": "I believe they should, however we should have a cap on how much raised before we say no they can’t get matching funds. If you’ve received sub 500K then I think you should be still eligible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#14",
                    "likes": "1",
                    "time": "31/05/2021-10:16:59",
                    "content": "I agree there should be a limit. Or more like a proper definition of what “funded” means. 500k is indeed not much for a company. But it’s not easy to draw a clear cut line. Depends on their burn rate. This is why probably fund matching needs to be opt-in and there needs to be some sort of form filled in by each grantee. Heck we could even have a matching weight. So if say you are partly funded you can say then that you want 25% or 50% of matching to happen for your grant. (not sure of the technical difficulty of implementing this) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.270833333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/androolloyd",
                    "index": "#15",
                    "likes": "0",
                    "time": "31/05/2021-12:23:38",
                    "content": "Burn rate is a great point. Perhaps we could have a category where you are placed in based on funding metrics to today. Pre Seed/Seed stage companies generally need all the help they can as devs are costly as we all know. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jiajia",
                    "index": "#16",
                    "likes": "2",
                    "time": "03/06/2021-08:55:51",
                    "content": "Adding a bit different voice to the discussion.I wonder if there can be more non-zero sum framing in this discussion. In a purely hypothetical situation. Maybe a VC-funded project can give back to gitcoin community if they are in a good shape and win some kudos and loves. On the other hand, I wonder if a VC-funded project are experiencing some hardship maybe Gitcoin and give grants/matching grants in exchange for some equity/token - like of like a bridge round with some external valuations, and if the company turn out to survive the hard time and the equity/token turned out to be valuable, it might be able to diversify the source of income for Gitcoin. Maybe hard to execute legally, but just to throw the idea out there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.771520146520146
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Akita7",
                    "index": "#17",
                    "likes": "0",
                    "time": "11/06/2021-00:55:04",
                    "content": "For sure no, what is the use? The reasoning behind this stance has been elaborated upon quite extensively ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#18",
                    "likes": "1",
                    "time": "11/06/2021-01:22:16",
                    "content": "This discussion is great, thanks @pet3rpan for raising this issue  My short answer is no, Gitcoin should not match funding to the projects (which already are funded by VC). But I believe Gitcoin could add a new option for the grant like: already funded: yes  or no the default could be no, but for the projects which got VC fund, they also would like to get the exposure, and get the community support, so they could create grants without CLR match. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.420454545454546
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#20",
                    "likes": "2",
                    "time": "21/06/2021-16:29:50",
                    "content": "This is a super interesting discussion so far. In general, I think it’s fair to say that VC funded projects don’t necessarily need funding from Gitcoin to survive, and shouldn’t be a priority over things that are more clearly public goods. That said, I think the biggest question to me is, how we determine whether or not something was actually funded by VCs in the first place. It seems like projects that are less up front about their fundraising could easily end up getting an advantage over those that are transparent. Would it be worth thinking about slashing penalties of some kind here? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Figu3",
                    "index": "#21",
                    "likes": "1",
                    "time": "05/07/2021-16:51:43",
                    "content": "Was thinking of asking the question before realising Peter had been (much) faster. I totally agree with the fact that VC funded projects shouldn’t benefit from CLR matching. It is used to financially propel high user/fan base projects that don’t want or can’t benefit from external financing. This should always be the case. The questions is more about how do you police bad actors ? The idea of slashing is pretty cool, maybe with an external court ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.9818181818181815
                }
            ]
        }
    ],
    "group_index": "367"
}