{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/bear-market-vibes/10948",
            "title": "Bear Market Vibes ",
            "index": 10948,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "contributors"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#1",
                    "likes": "17",
                    "time": "16/06/2022-13:46:47",
                    "content": "I shared this with the WS leads, and I wanted to post here for everyone. This is not meant to scare folks, but to be a rallying cry for us to overcome adversity. Hey y’all - I know I have offered some sobering opinions on the current market conditions (in my TD updates, in my S14 budget reviews, and in my discussions with each of you)… the importance of us really focusing on launching (not just building, but launching) the protocol continue to mount. We need to keep our sights on turning into a lean protocol DAO which has immense impact. The linked doc from Electric Capital is a great insight into what one of the best web3 investors in the world is thinking/sharing. S15 is only 6 weeks away, budget will likely start to form in 4 weeks or less (scary right?). During S15, I am going to continue to be a large advocate for reducing duplicative work. Really focusing on the value we create as it pertains to our essential intents… and most importantly, moving us to build and launch our protocol. If we have the wrong people in roles, we need to fix it. If we have the wrong projects planned, we need to change it. If we aren’t sure how or where to cut (or even if you need to cut), I am here to be a sounding board. We are a team, we represent our DAO and we lead our community. As you all work through GR14, PLEASE take mental note on what’s working and what’s not. We will need to tighten our operational abilities, and consider cutting the “nice to haves.” This may mean fewer community calls, less expansion into new areas, and most of all it will mean ensuring we have the capital on hand to weather a global economic downturn. The DAOs economic strength is going to come from a constellation of next steps. Reducing costs is one area, treasury diversification is another. But we are working to weave in increasing depth of liquidity, increase volume of trades, increasing utility of GTC and exploring some passive yield generation opportunities. Let’s go into S15 really thinking about how to reduce burn in the right areas. Please let me know if I can help. -kyle PS - Our impact matters. It matters for the builders, the teams and the ecosystem as a whole. As we each look to refine our scope, let’s continue to prioritize those folks (adopters of our protocol, and those running grants rounds). We can always grow after we are done surviving. ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-22-2022/10972",
                        "https://gov.gitcoin.co/t/how-should-i-change-my-delegations/10828/12"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4945067558703915
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Viriya",
                    "index": "#2",
                    "likes": "1",
                    "time": "16/06/2022-18:03:58",
                    "content": "Appreciate you posting this Kyle. We’ll bring it to our next MMM WS sync. It’s an important context for contributors operating at the edges - I think it will encourage further focus and alignment on tough decisions moving forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.013888888888889
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#3",
                    "likes": "1",
                    "time": "16/06/2022-22:07:48",
                    "content": "Thank you for posting this Kyle. Fully agree with the sentiment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#4",
                    "likes": "0",
                    "time": "17/06/2022-00:10:58",
                    "content": "Fully agree. Time to get scrapy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#5",
                    "likes": "0",
                    "time": "17/06/2022-11:10:17",
                    "content": "I agree totally. Time to get scrappy. May I suggest a first step? Can the WS leads make preliminary lists of what is most likely on the bubble (in other words, the “nice to haves”) and publish those lists NOW? 6 - 4 = 2. Leaving 2 weeks for these difficult decisions is not enough. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.453125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/myceliumcoordinator",
                    "index": "#6",
                    "likes": "1",
                    "time": "07/07/2022-13:57:27",
                    "content": "I see from Gitcoin Treasury Runway Analysis that the DAO has a monthly spend of $1.2m, for a yearly spend of $14.4m.    Gitcoin Treasury Runway Analysis   2. Average Monthly Expenses - Season 14 budget indicated monthly spend of ~$1.2m.   What level of spend do you think is appropriate for the DAO to shoot for during the bear market @kyle ? ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-treasury-runway-analysis/11077/1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                }
            ]
        }
    ],
    "group_index": "136"
}