{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-aug-2022/8694",
            "title": "TLDR - What is Gitcoin? \\xf0\\x9f\\xa4\\x96 [Aug 2022] ",
            "index": 8694,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "97",
                    "time": "27/09/2021-16:54:37",
                    "content": "Post Updated August 2022. Other onboarding resources:  GitcoinDAO Primer Gitcoin Digest Lore book   Hi frens, This document is an overview of the Gitcoin ecosystem and what we are coordinating & building towards. It’s jam-packed with information and links to make it easier for contributors, stewards, delgators and community members to get up to speed and learn about our mission. The document is updated on a monthly basis as the DAO evolves and was last updated by @Fred in August 2022. For weekly updates make sure to check out the Gitcoin Digest!  TLDR The Purpose of Gitcoin is to empower communities to fund their shared needs. So far we’ve facilitated over $64mm of funding for public goods & are currently facilitating about $6mm/quarter. And we are just getting started!  The Essential Intents of Gitcoin 1. Protocol Adoption  Build a widely adopted, modular Grants protocol that creates a flourishing ecosystem of funding mechanisms. Build a widely adopted, modular Pluralism Passport protocol that creates a flourishing ecosystem of network effects around Decentralized Society.  2. Financial Sustainability  Have a comprehensive, diversified strategy for financial stability of the DAO in order to effectively achieve our mission.  3. DAO Organization  Create and promote clear and engaging rituals, communication channels, and messaging that build emergent shared context among GitcoinDAO’s contributors, stewards, and supporters.  4. Grants Program Success  Enable a successful grants protocol launch by dogfooding it internally and supporting ecosystems in adopting it. Continue to support the Ethereum ecosystem and public goods in web3 and beyond through Gitcoin-led rounds.    We believe that;  Open Source Software is a digital public good that creates $400bn/year in value, but the creators of OSS don’t have great ways to monetize their work on digital infrastructure.  Our goal is to correct this asymmetry.   We are missionaries. We believe that it’s all coordination. Public goods failures are coordination failures, and we see an opportunity to solve coordination failures with blockchains - a new supertool for solving coordination failures.  We know our edge. Blockchains are our super power. They give us a novel, immutable, global, programmable, transparent substrate for coordination to build upon. Our weapon of choice is novel mechanism designs deployed to decentralized blockchains.  We have momentum We are creating $6mm/quarter in funding for public goods and OSS devs. Vitalik Buterin once said “Gitcoin Grants is establishing itself as a significant pillar of the Ethereum ecosystem that more and more projects are relying on for some or all of their support.”  We are still emerging. We are still discovering new & innovative ways to solve coordination problems in a DAO-era world. We systematically discover or invent these mechanisms, and if we’re lucky + good, we scale them. We are the EVM whispers, the DAO cartographers, the internet citizens, and the chaos magicians of the internet of money. We are the homesteaders of the metaverse. We are the schelling point for the hopeful.  We build for human thriving. Our vision is to establish an empowering, open and collaborative space where individuals and communities can access resources in proportion to their value creation independent of their geographic location, education, background or offline identity. By creating collaborative, decentralized funding mechanisms, Gitcoin has become the natural choice for seeding and supporting digital public goods. Gitcoin enables building for the public, by the public by helping individuals and communities start, fund, and scale open source projects.  We convene the people We have been hosting virtual & physical events at the heart of Regenerative web3. Checkout our quarterly Schelling Point events, or our weekly DAO Vibes (hosted on Discord), or “Public Goods are Good” twitter spaces. By convening the people, we hope to build an Impact Network of people focusing on using Web3 for positive impact. We call those projects ImpactDAOS, and by studying ImpactDAOs we can build a webscale infrastructure for regeneration.  How we achieve our mission. Gitcoin is a mission, a community, and a product suite. If our mission is our focal point, our community is our lifeblood. Our a product - a double sided marketplace that connects digital creatives to the people who want to fund their work. And visa versa. So far we’ve created $64mm worth of funding for public goods and OSS devs. Specifically, the way we do that is:  Giving members opportunities to earn. Giving members opportunities to learn. Giving members opportunities to connect with one another & prospective career opportunities.   How do we do that? Product-wise, we are building coordination tools for a DAO based world. We do that with   Bounties - Gig-based work for web3 projects.  Hackathons - Build with the coolest web3 projects.  Grants - Crowdfunding for Open Source.  Community-wise, we do that by being mission-first, producing results, by creating vibes + cultivating a positively-self-referential internal culture. More on how we achieve our mission here.  The DAO that governs Gitcoin We believe that the consent of the governed is the only legitimate basis for government. This is why Gitcoin is governed by the community. (In order to make sure that Gitcoin is serving its community + founding mission first & foremost) In May 2021, GTC was released. GTC is a governance token with no economic value that governs Gitcoin.  What is Gitcoin?  Gitcoin is an ImpactDAO/ProtocolDAO hybrid. On a human layer, Gitcoin is an egregore - a group of humans who coordinate to achieve our mission. From a product perspective, we are building a suite of tools for DAO-era coordination of capital & culture. From a governance perspective, we are governed by GTC.  We are progressively decentralizing Gitcoin from a company to a DAO.  There are 3 important concepts to know to understand how to interact with Gitcoin;  Most of the action happens on Discord, Discourse, or on Twitter.  Stewards are ultimately responsible for governing Gitcoin.  Workstreams are the primary mechanism through which work is organized in the DAO.   Workstreams Workstreams are the way work is organized at Gitcoin. Workstreams have their own budget, leadership structure, tools, and processes on a per-workstream basis. Anyone can propose a workstream by following the proposal process. The current active workstreams are:   Moonshot Collective is the DAO rapid prototyping workstream  Public Goods is focused on our mission of funding public goods.  Fraud Detection & Defense is in charge of preventing fraud on Gitcoin Grants.  Memes, Merch, & Marketing is the DAO marketing division.  DAO Operations supports critical operation functions like accounting, hiring, and tooling  Gitcoin Product Collective is the home of product development for Grants 2.0  If you want to learn more about Gitcoin, read this post here.  Gitcoin’s Quarterly Cadence Gitcoin operates in a quarterly cadence. Quarterly Gitcoin Grants Rounds are our Metronome  Every quarter, the Gitcoin ecosystem revolves around a quarterly stacked event - a combination (1) Gitcoin Grants round, (2) Hackathon, (3) KERNEL block, and (4) Governance activity During each quarter, we achieve our mission by deploying millions of $$$ of funding to the community. Typically a quarter looks like this:  Plan for quarterly stacked event. Execute quarterly stacked event. Learn from the quarterly stacked event. Repeat  Our last quarterly event was GR14 (short for Grants Round 14), it started June 8th and ended June 23th. The next round will be GR15 and it starts Septemer 7th and goes until Septemer 22th.  Gitcoin is a vessel for humanity to get to the Quadratic Lands! Gitcoin is a vessel that we would like to take us to the Quadratic Lands - a place where open source software (and other public goods) are well maintained + healthy. In the quadratic lands, public goods are funded by quadratic funding + other web3 native funding mechanisms. The quadratic lands is a north star, we are still discovering where exactly it is and how to get there Help us find the quadratic lands by telling its story. Members of our community have created this song about the Quadratic Lands or and this visionary video.  How to GIT involved. As of September 2022, here is the way you can get involved in Gitcoin.  Read the weekly Gitcoin Digest updates (email sign-up). Get engaged on Discord, Discourse or on Twitter   Apply as a Contributor and explore our workstreams Use Gitcoin to earn, learn, or fund. (use links above) Follow the list of GitcoinDAO contributors on Twitter Attend our conference series Schelling Point  Explore further through the links below;  Gitcoin.co Gitcoin Jobs Gitcoin Tally Gitcoin Notion Gitcoin Twitter Gitcoin Discord Gitcoin Support Gitcoin Snapshot Gitcoin Schwag Store Gitcoin GTC Governance token      Testimonials Gitcoin Grants is establishing itself as a significant pillar of the Ethereum ecosystem that more and more projects are relying on for some or all of their support. ~Vitalik Buterin I LOVE IT…The community has been outstanding. I have made contact outside of slack w a couple of people. William Schwab was kind enough to ZOOM w me for an hour and tell me his story, letme pick his brain, and as he shared some valuable resources with me. - John Wilkinson KERNEL is the greatest thing to ever happen to my crypto/business/personal life. I have made plenty of new friends, connected with people who believe in me and want to work together on other projects, and of course learned a lot from other seedlings, mentors and speakers. - Ethan Chiasson Gitcoin gave me the first break into Ethereum and the crypto space. It helped me find bounties that I could work on and get paid in crypto. After my first ever bounty I got paid a lot and I felt euphoric. - Sebastian TF I am amazed on a daily basis at the incredible projects and communities in this space. The Gitcoin team and quadratic funding is an invaluable catalyst to bring it all to fruition. Thank you! - Hishamaru Konkon Gitcoin grants quadratic funding is not just for funds allocation, it’s also a great signaling tool! For the last few rounds, going to Grants | Gitcoin  has led me to discover a lot of really cool Ethereum projects I previously did not know about. - Vitalik Buterin What Gitcoin is doing with public goods funding is absolutely incredible. Nothing but respect to the team and the larger community for the contributions made. - Frobo Thanks to gitcoin it has helped us to discover our earliest talent and supercharged @KodaDot development. - Matej People ask me all the time how I got into Solidity and NFT dev. The answer is gitcoin! Beginning of the year I just started doing bounties for a bunch of different projects (@synthetix_io @akashnet_ @SovrynBTC etc) and found the NFT ones were my fave. Such a good way to learn! - sarasioux.et ",
                    "links": [
                        "https://gov.gitcoin.co/search?q=digest%20order%3Alatest",
                        "https://gov.gitcoin.co/t/future-history-of-the-open-internet-book/10324",
                        "https://gov.gitcoin.co/search?q=digest%20order%3Alatest",
                        "https://www.youtube.com/watch?v=KpXPym_m_wA",
                        "https://newsletter.banklesshq.com/p/know-thy-enemy-coordination-failures",
                        "https://vitalik.ca/general/2020/04/30/round5.html",
                        "https://twitter.com/TrustlessState/status/1418156116282904578",
                        "https://schellingpoint.gitcoin.co/",
                        "https://gov.gitcoin.co/t/lessons-about-impact-networks/10305",
                        "https://gov.gitcoin.co/t/the-impactdao-poster-book-is-here/10323",
                        "https://gov.gitcoin.co/t/a-vision-for-a-pluralistic-civilizational-scale-infrastructure-for-funding-public-goods/9503",
                        "https://gitcoin.co/results",
                        "https://gitcoin.co/earn",
                        "https://gitcoin.co/learn",
                        "https://gitcoin.co/connect",
                        "https://gitcoin.co/bounties/contributor",
                        "https://gitcoin.co/hackathons",
                        "https://gitcoin.co/grants",
                        "https://gov.gitcoin.co/t/how-we-achieve-our-mission/8760",
                        "https://gitcoin.co/blog/introducing-gtc-gitcoins-governance-token/",
                        "https://gov.gitcoin.co/t/the-impactdao-protocoldao-sandwich/8944/2",
                        "https://gov.gitcoin.co/t/the-gitcoin-gitcoindao-egregore-is-emerging/8200",
                        "https://gov.gitcoin.co/t/gitcoindao-meta-coordination-of-culture-capital/8437",
                        "https://gov.gitcoin.co/t/how-might-we-decentralize-gitcoin/8734",
                        "https://gitcoin.co/discord",
                        "https://gov.gitcoin.co",
                        "https://twitter.com/gitcoin",
                        "https://gitcoin.co/blog/introducing-the-community-stewards-program/",
                        "http://gitcoindao.com/",
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v2-updated/7860",
                        "https://www.notion.so/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://www.notion.so/Public-Goods-80a3202a3a244c65b3fda08c0f7c7d60",
                        "https://www.notion.so/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://www.notion.so/Merch-Memes-Marketing-c1bd89fac8ab4569bf2a676df28025d8",
                        "https://gitcoin.notion.site/DAO-Ops-84f425e281ae49579a2b4acf0bad5dd5",
                        "https://gitcoin.notion.site/Gitcoin-Product-Collective-f2860138cbb24505b5cb2d8576119a78",
                        "https://gov.gitcoin.co/t/the-gitcoin-gitcoindao-egregore-is-emerging/8200",
                        "https://gov.gitcoin.co/t/gitcoin-grants-is-our-metronome/9310",
                        "https://twitter.com/songadaymann/status/1397206547420356611",
                        "https://www.youtube.com/watch?v=mTU6J4WTPtk",
                        "https://gov.gitcoin.co/search?q=digest%20order%3Alatest",
                        "https://form.typeform.com/to/ttNCMt8w",
                        "https://gitcoin.co/discord",
                        "https://gov.gitcoin.co",
                        "https://twitter.com/gitcoin",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://gitcoin.co/",
                        "https://twitter.com/i/lists/1512065573026697218",
                        "https://schellingpoint.gitcoin.co/",
                        "https://gitcoin.co",
                        "https://gitcoin.co/jobs",
                        "https://www.withtally.com/governance/gitcoin",
                        "http://gitcoindao.com",
                        "https://twitter.com/gitcoin",
                        "https://gitcoin.co/discord",
                        "https://gitcoin.co/support",
                        "https://snapshot.org/#/gitcoindao.eth/",
                        "https://store.gitcoin.co",
                        "https://etherscan.io/token/0xde30da39c46104798bb5aa3fe8b9e0e1f348163f",
                        "https://vitalik.ca/general/2020/04/30/round5.html",
                        "https://gitcoin.co/grants/",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17/8897",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-23/9370",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-1-2022/9683",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-20/9070",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-22/9286",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-18/8947",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-formerly-week-in-governance/8844",
                        "https://gov.gitcoin.co/t/regen-cryptoeconomics-book-foreword-by-gitcoindao/9711",
                        "https://gov.gitcoin.co/t/a-brief-history-of-gitcoin-from-2017-2022/9431",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-21/9209",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-19/9003",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-15-formerly-week-in-governance/8806",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-13/8711",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24/9446",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-6-2022/9949",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-8-2022/10032",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-7-2022/9996",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-2-2022/9739",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-3-2022/9771",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-4-2022/9816",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17-2022/10597",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-10-2022/10209",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-19-2022/10737",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-11-2022/10277",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-18-2022/10660",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326",
                        "https://gov.gitcoin.co/t/poap-edition-gitcoindao-digest-13-2022/10363",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-14-2022/10414",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-15-2022/10453",
                        "https://gov.gitcoin.co/t/what-is-the-new-structure-of-gitcoin-forum-and-how-to-use-it/10750",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-20-2022/10789",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-21-2022/10911",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-22-2022/10972",
                        "https://gov.gitcoin.co/t/decentralizing-gitcoin-holdings-now-supermodular-xyz-s-work-within-gitcoindao/11069",
                        "https://gov.gitcoin.co/t/poap-edition-gitcoindao-digest-23-2022/11004",
                        "https://gov.gitcoin.co/t/gitcoin-ecosystem-flowchart/11173/2",
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442/17"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.878568745304282
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#2",
                    "likes": "31",
                    "time": "27/09/2021-17:10:52",
                    "content": "Great post, Useful links. Complete, fresh, easily understandable and readable. This post should be more visible!     owocki:  People ask me all the time how I got into Solidity and NFT dev. The answer is @gitcoin! Beginning of the year I just started doing bounties for a bunch of different projects (@synthetix_io @akashnet_ @SovrynBTC etc) and found the NFT ones were my fave. Such a good way to learn! - sarasioux.eth   I always enjoy to read some testimonials, thanks for sharing them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9043560606060606
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/vogue20033",
                    "index": "#11",
                    "likes": "5",
                    "time": "23/01/2022-03:31:10",
                    "content": "Thank you for the update @owocki This is more like Gitcoin/GitcoinDAO 101 maybe as a dQuest - dCompass @Huxwell is up to the task   I envisage this could be very useful for the DAO Onboarding for every dao-pplicants. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.2250000000000005
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#12",
                    "likes": "5",
                    "time": "10/02/2022-06:39:06",
                    "content": "Hi @owocki Glad to see the continuous update for what is Gitcoin, I am just curious what are the updates for Feb 2022. I guess it is the part of “how to GIT involved”, not sure other parts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.03125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#13",
                    "likes": "7",
                    "time": "10/02/2022-13:42:19",
                    "content": "mostly i’ve been updating the dates + funding amounts every month. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/vivek",
                    "index": "#14",
                    "likes": "9",
                    "time": "17/02/2022-16:01:03",
                    "content": "Growing open source is a lifelong mission. Glad to be a small part alongside you all. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Suede0619",
                    "index": "#15",
                    "likes": "2",
                    "time": "07/03/2022-17:53:33",
                    "content": "Thanks for the detailed mission summary  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/cizi31",
                    "index": "#16",
                    "likes": "1",
                    "time": "10/04/2022-15:06:28",
                    "content": "Thank you for the great summary  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nanopunkster",
                    "index": "#18",
                    "likes": "4",
                    "time": "20/04/2022-10:39:40",
                    "content": "Very useful piece of information. We are working on a GTC promo vids where the video simply explains how it works and how to join in. More people need to see this. Thank you Ser ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.483333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lovegithub520",
                    "index": "#19",
                    "likes": "2",
                    "time": "10/06/2022-09:35:09",
                    "content": "Very useful  information. We are working on a GTC promo vids where the video simply explains how it works and how to join in. More people need to see this. Thank you Sir ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.483333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/GreatGerwig",
                    "index": "#20",
                    "likes": "5",
                    "time": "15/07/2022-10:11:10",
                    "content": "    owocki:  We are the EVM whispers, the DAO cartographers, the internet citiziens, and the chaos magicians of the internet of money. We are the homesteaders of the metaverse. We are the schelling point for the hopeful .    I want this on a t-shirt. Hopefulness is everything. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/izkillaz",
                    "index": "#21",
                    "likes": "2",
                    "time": "04/08/2022-15:39:29",
                    "content": "Everything is all here! What you need to know and how to start with Gitcoin!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/romeonebun",
                    "index": "#22",
                    "likes": "3",
                    "time": "13/08/2022-15:41:17",
                    "content": "Hello Gitcoin DAO! For me Gitcoin is THE realm of experimentation with a positive impact. I really hope the vibes can continue in a way that doesn’t lead to the difficulties we had in the past.(large budgets, inneficiencies,  etc) Quadratic land vibes  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.068181818181818
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/rahulnkm",
                    "index": "#23",
                    "likes": "4",
                    "time": "17/08/2022-16:19:17",
                    "content": "Hey there, It’s quite undeniable that Gitcoin’s brand presence is central to the ReFi movement and in my opinion, this alone necessitates the long-term success of Gitcoin in the blockchain industry. Blockchain today is a highly financialized industry, far too often motivated by generating profit than impact and value. Gitcoin is the largest voice and a keystone to a different narrative forward. Gitcoin is hope. I wish the best for Gitcoin DAO and would like to contribute to the mission in any meaningful way.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4714285714285715
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pomor113",
                    "index": "#26",
                    "likes": "2",
                    "time": "06/09/2022-17:01:56",
                    "content": "Good to have new Gitcoin fundation guys. Keep it going  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.090909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/louisto",
                    "index": "#27",
                    "likes": "3",
                    "time": "24/09/2022-05:16:55",
                    "content": "OK, I think so! Very clearly about that ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.887499999999999
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/joel.miya",
                    "index": "#28",
                    "likes": "1",
                    "time": "27/10/2022-22:51:37",
                    "content": "very helpful tl;dr! Thank you for this Gitcoin overview! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Go2topkz",
                    "index": "#29",
                    "likes": "0",
                    "time": "08/11/2022-22:05:22",
                    "content": "Хороший пост отличный и понятный пост ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bitkhabar",
                    "index": "#30",
                    "likes": "0",
                    "time": "09/11/2022-01:38:47",
                    "content": "Thanks for complete information … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Mursh0620",
                    "index": "#31",
                    "likes": "0",
                    "time": "11/11/2022-20:40:52",
                    "content": "    vogue20033:  Thank you for the update @owocki   Thank you for the update @owocki ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/chelutaj",
                    "index": "#32",
                    "likes": "0",
                    "time": "12/11/2022-20:16:21",
                    "content": "Thank you  for info, very helpful   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/edenmichell",
                    "index": "#33",
                    "likes": "0",
                    "time": "15/11/2022-10:30:39",
                    "content": " thahk you for info! learned sth ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/paigexu522",
                    "index": "#34",
                    "likes": "1",
                    "time": "18/11/2022-19:54:58",
                    "content": "This is awesome! So glad to be part of the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/free2ride19",
                    "index": "#35",
                    "likes": "0",
                    "time": "21/11/2022-08:10:30",
                    "content": "Thank you for the great summary @free2ride19 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/swisscheese922",
                    "index": "#36",
                    "likes": "0",
                    "time": "27/11/2022-16:15:51",
                    "content": "Thanks for the summary of GitCoin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/xnxkillswitch",
                    "index": "#37",
                    "likes": "0",
                    "time": "06/12/2022-20:37:37",
                    "content": "Great post, thank u! Really clearefull ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Darasso",
                    "index": "#38",
                    "likes": "0",
                    "time": "12/12/2022-10:11:11",
                    "content": "Awesome! thank you Gitcoin! It is going to be great ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/PaigeDAO",
                    "index": "#39",
                    "likes": "2",
                    "time": "04/01/2023-18:52:41",
                    "content": "Wish I’d gotten to the Quadratic Lands sooner. But glad I’m here now! Thanks for this great post, chock full of info. Q: what does ‘dogfooding’ mean? (never seen the word used like that b4?) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Viriya",
                    "index": "#40",
                    "likes": "2",
                    "time": "06/01/2023-16:44:48",
                    "content": "Welcome, @PaigeDAO “Dogfooding” means consistently using our own product (as a legitimate user–so, in our current case, for the Gitcoin Grants Program) to figure out what works and what needs to be fixed both before launch and on an on-going basis. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/PaigeDAO",
                    "index": "#41",
                    "likes": "2",
                    "time": "07/01/2023-00:33:26",
                    "content": "Thank you. I would not have readily gleaned that! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#42",
                    "likes": "0",
                    "time": "16/01/2023-14:15:23",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "579"
}