{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/how-we-achieve-our-mission/8760",
            "title": "How we achieve our mission \\xf0\\x9f\\x8c\\xb1 ",
            "index": 8760,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "7",
                    "time": "07/10/2021-19:37:28",
                    "content": "Hi frens, Here are some thoughts on how we can create more impact towards our mission of more coordination & reduction of coordination failures (sometimes we also call this “build & fund public goods”).  Framing Gitcoin is in the DAO coordination space, and we’ve built a product suite that helps DAOs coordinate culture & capital. We envision a world in which there is many many DAOs…  Screen Shot 2021-10-07 at 12.58.00 PM1034×348 30.3 KB  with many many community members each  Screen Shot 2021-10-07 at 12.57.51 PM1069×349 71.7 KB  The job of our software suite is to help coordinate these DAOS & knowledge workers. One important part of this to understand is that not all knowledge workers are created equal: When DAOS want knowledge workers to join their DAO, they don’t want just ANY  knowledge worker to join their DAO - they want  knowledge workers who fit their values, working norms, skillsets, ambitions and other criteria. One way we can think about this is as a funnel.   Sourcing knowledge workers.  Selecting the right knowledge workers.  Selling them on your DAO.  Onboarding them to your DAO.  Retain them in your DAO.   Product Suite The tools that we’ve built to do this are:   Bounties - gig-based work for web3 projects.  Hackathons - Build w the coolest web3 projects.  Grants - Crowdfunding for Open Source.  KERNEL - A web3-native, community centric accelerator.  tip.party - a small, modular tool for engaging people for showing up.  Quadratic Diplomacy - a decentralized tool for engaging contributors.  When you position these products along the funnel above, you can see how they complement each other, this is what it looks like:  How do we read this graphic?   Bounties  and Hackathons  both help DAOs source, select, sell, onboard knowledge workers.  KERNEL helps DAOs source, select, sell, onboard knowledge workers.  Grants - helps DAOs onboard & retain knowledge workers to DAOs.  tip.party - helps DAOs source + select knowledge workers who are highly engaged.  Quadratic Diplomacy - helps DAOs onboard & retain knowledge workers to DAOs.  Hopefully as we deploy this product suite in the DAO ecosystem, we are able to help our partner DAOs better source, select, sell, onboard, and retain talent.  Screen Shot 2021-10-07 at 1.22.01 PM1060×425 95.8 KB   The view from a knowledge worker perspective… Why do knowledge workers engage with these products?  250k people have signed up to Gitcoin thus far because the product suite gives them …  … opportunities to earn. … opportunities to learn. … opportunities to connect with one another & prospective career opportunities.   Network Effects I’m a big believer in network effects.  The more DAOs that are in the Gitcoin network, the better the network is for community members of knowledge workers.  The more knowledge workers are in the network, the better it is for the DAOs in the network. As this flywheel spins, we’re able to create impact, pull more data, and create more legitimacy.  This flywheel will eventually become a perpetual motion machine that reinforces itself.   Culture I believe that culture is a high order bit we want to optimize for.  Culture is very big deal in the crypto space, and I think that the future of public goods something is likely something that is hip moreso than some coercive & staid government entity. The culture that I see within the DAO is mission-first, producing results, creates memes/vibes in community, but is somewhat chaordic + is still evolving heavily.  Results so far Since its launch in November 2017 , Gitcoin has helped 42,814 funders reach an audience of 223,538 earners. Gitcoin has facilitated 1,143,518 complete transactions to 9,378 unique earners.  Screen Shot 2021-10-07 at 1.03.40 PM922×281 17.6 KB   Feedback welcome. End to end this is how I see the investments in product creating results to our mission. I’m open to feedback though! Also note that I’m just one node in the Gitcoin network.  If you see this differently, please fork this post and propose your own. ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-meta-coordination-of-culture-capital/8437",
                        "https://gitcoin.co/explorer",
                        "https://gitcoin.co/hackathons",
                        "https://gitcoin.co/grants",
                        "http://kernel.community/",
                        "https://tip.party/",
                        "https://quadraticdiplomacy.com/",
                        "https://gitcoin.co/earn",
                        "https://gitcoin.co/learn",
                        "https://gitcoin.co/connect",
                        "https://newsletter.banklesshq.com/p/culture-eats-capital-for-breakfast",
                        "https://store.gitcoin.co",
                        "https://dmv.ny.gov/",
                        "https://media.consensys.net/gitcoin-joins-consensys-announces-pilot-projects-f5a0955de9d6",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-aug-2022/8694",
                        "https://gov.gitcoin.co/t/a-brief-history-of-gitcoin-from-2017-2022/9431",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-formerly-week-in-governance/8844",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-15-formerly-week-in-governance/8806"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.231190476190475
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lee0007",
                    "index": "#3",
                    "likes": "1",
                    "time": "14/10/2021-23:03:03",
                    "content": "    owocki:  Quadratic Diplomacy - helps DAOs onboard & retain knowledge workers to DAOs.   @owocki in undertaking a feasibility assessment for the development of  GitcoinDAO Ambassador program I would be keen to hear your thought about the role(s) Ambassadors may play  within quadratic diplomacy and to coordinate culture + capital     GitcoinDAO META: Coordination (of Culture + Capital)   If we can coordinate ourselves, then (and only then) we can help other DAOs coordinate, and spread coordination fractally outwards towards the world.   Love this call, so in relation to Gitcoin DAO Ambassadors what do you think could differentiate the responsibilities and opportunities for Ambassadors from the role of GitcoinDAO community contributors? Is there or should there be a difference? ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-formerly-week-in-governance/8844"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#4",
                    "likes": "2",
                    "time": "15/10/2021-04:52:25",
                    "content": "i think that ambassadors could be compensated partially with quadratic diplomacy perhaps. as far as coordinating culture and capital… i think a brainstorm might yield some more interesting ideas. than what i can…  but as a general rule i’d say that if ambassadors are pulling people into the orbit of gitcoin (see diagram below), and into the inner orbits of gitcoin, then they are doing great.  Screen Shot 2021-10-14 at 11.21.49 AM1146×868 78.5 KB   Love this call, so in relation to Gitcoin DAO Ambassadors what do you think could differentiate the responsibilities and opportunities for Ambassadors from the role of GitcoinDAO community contributors? Is there or should there be a difference?  thats a great question. im curious what @krrisis thinks on this… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.525
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#5",
                    "likes": "1",
                    "time": "15/10/2021-16:47:56",
                    "content": "I think dao ambassadors can be a subgroup of dao contributors, as soon as we start funding a full program for this. But at the same time all dao contributors are/could/should be our ambassadors in a way. Looking forward to learn more about your thoughts on such a potential program, @lee0007, I know @ceresstation reached out to you about this. My main thoughts on such a program is that it should be an integrated part of either the MMM workstream or the Public Goods funding Workstream, where in a way an ambassador/partnership program is already being built out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.635416666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lee0007",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/10/2021-21:05:02",
                    "content": "Cool thanks for the feedback gentlemen. Aware everyones busy I def. want to avoid duplication of effort and align with other projects (proposed and in the worx) which is my primary reason to be asking around, and looking to raise visibility. And theres clear support within FDD and Have been in touch and look forward to getting @ceresstation insight on this too, because a number of projects I’ve seen lurking the Public Goods streams and MMM align with my experience as an Aragon Ambassador. Brainstrom was def. on the to do list but not so easy for me as a new contributor to gather (let alone coordinate) a diverse representation of people. Instead leveraging existing gather spaces - like community calls and the forum to seek community input. The orbit infographic is super helpful to me and I will look to apply this high level overview in conjunction with the perspectives of each stream. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.974179292929294
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#7",
                    "likes": "2",
                    "time": "22/10/2021-08:27:59",
                    "content": "For me, there is difference between contributors and ambassadors. Like Kris said     krrisis:  dao ambassadors can be a subgroup of dao contributors   I agree with this. For example, anyone who contribute to GitcoinDAO, could/should/would be the contributors, but only the contributors who     owocki:  are pulling people into the orbit of gitcoin (see diagram below), and into the inner orbits of gitcoin   So ambassadors should be :  passionated resonated with the values/missions of GitcoinDAO be a GitcoinDAO evangelist  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "585"
}