{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/analyze-lifetime-gitcoin-grants-data-rounds-12/9594",
            "title": "Analyze Lifetime Gitcoin Grants Data Rounds-12 ",
            "index": 9594,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/mohamad1371",
                    "index": "#1",
                    "likes": "3",
                    "time": "01/01/2022-06:12:38",
                    "content": "hi guys. i have worked on data analysis of  Gitcoin Grants Data Rounds from GR1 to GR12. here is the Github link of my work: GitHub - mohamad1371/Analyze-Lifetime-Gitcoin-Grants-Data-Rounds--12: Analyze Lifetime Gitcoin Grants Data Rounds -12 i have told my whole story  of that analysis in that github link with graphs and numbers. here i say only the main conclusions, as i found:   the large growth from GR11 to GR12 (106%) is awesome, but keeping the ascending trend after this round is going to be harder.   57% of the grants in GR12 are not supported and finding the cause of this is so crucial   3 categories which have the most unique contributors and crowdfund in all rounds are dAPP Tech, community and Infra Tech. i found  that this happened because the most of grants are in this categories and it’s natural that they received more attention.   grants which are from north America, Europe and east Esia also received most contributions. i found that the number of contributions are high for this regions because the majority of grants are from this regions.   i found the Megawords of the grants with most contributions and see that this topics are speak louder: game, community, decentralization, liquidity, exchange, POAP, privacy and Thorchain.   finally i predicted this values for GR13:    number of unique contributions: 372919 amount of crowdfund: $4517640 match_amount: $5251383  thanks for your attention and wish best for Gitcoin Community. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.331179138321996
                }
            ]
        }
    ],
    "group_index": "652"
}