{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/connecting-dao-talent-with-jobs-using-techtrees-hiring-bounty-model/11586",
            "title": "Connecting DAO Talent with Jobs using Techtree's hiring bounty model ",
            "index": 11586,
            "category": [
                "\\xf0\\x9f\\xa4\\x9d Partnerships"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/andy_tt",
                    "index": "#1",
                    "likes": "2",
                    "time": "29/09/2022-14:11:31",
                    "content": "Hi GitCoin community, My name’s Andy and I’m the head of DAO product at Techtree, a startup company working on an bounty based value exchange platform.  About us Techtree is a platform, where users can monetize their personal assets such as personal networks, knowledge and reputation by helping other members of trusted networks (such as DAOs, VCs and their portcos, communities) they belong to. Our initial focus is one of key Web3 challenges - hiring. We believe we can scale the workforce of DAOs and žeb3 Communities by making it easy for their existing permanent workforce and larger community to refer talent to open positions while getting systemically rewarded. We are already working with a number of VCs and their portfolio companies as well as Web3 Projects and are excited to pilot the model with top DAOs to help grow their workforce.  Team and Investors   Founding team : Pawel, Stanislas, Laurence  DAO Head of product : Andy (author of this post) TechTree is backed by Notion Capital, Frontline Ventures, StakeDAO, Move Capital as well as the ex-CEO of Skype, ex-CTO of Workday, ex-CTO of Nutmeg, co-founder and ex-CFO of Monzo and ex-Head of Sales of Stackoverflow and additional great angel investors.   Successful Acquisitions & Bounties paid  Over 400k USD paid out in bounties Companies backed by top investors such as A16Z, Sequoia, Index, Northzone, NFX, Advent or ecosystems like MakerDAO or Solana have hired tech talent through us .   User base   Live:   Inflection.xyz - leading Web3 European Fund Tech Nation - Top UK growth programme whose alumni include almost 200 top tech companies including unicorns like Revolut, Monzo, Tessian, Paddle, Eliptic and many more   Waitlist / onboarding  VCs: Notion Capital, Polychain Capital, Frontline Ventures + 21 other VCs     Hiring Challenges in Web3 Effective, time and cost-efficient hiring of quality talent has been a challenge for Web3 space. A few most challenging issues are:  Slow and high cost to attract and hire Web3 Talent using agencies Low trust in jumping for Web2 to Web3 for many talented developers Apathy in potential candidates due to quantity-oriented hedging strategies by recruiters. No systemic flow of talent between DAOs, Web3 Communities and VC Portfolio companies   Techtree Bounty Boards and Talent Branches At the heart of Techtree are Talent Branches. It is a talent pool of referred talent accessible for its select members e.g. hiring parties in the GitCoin community. Talent can be referred by the community itself or can flow from other communities, DAOs and VCs based on candidate opt-in to get visible to other talent branches. Candidates apply directly to the Talent Branch generic roles or get referred via sharable bounty boards - a simple listing of open jobs with their corresponding bounties. Techtree talent branches are interoperable which means, opted in talent can be made visible to ecosystems creating one overarching talent network.  1662×1246 178 KB  Here are live examples of a talent branch and a bounty board  Clear bounty reward flow Techtree model offers tiered rewards depending on the role you play for getting to the candidate who gets hired (Creators, Sharer, Referrer rights) .  Untitled1280×413 4.78 KB  Additionally there’s a flat fee model. As Techtree we’re charging 15% on top of the bounty once talent gets hired. More information is available in the Mirror post here  Potential Benefits It’s all basically about effective hiring while rewarding community for help.  Hiring is faster and cheaper with a systemic hiring reward system empowering the community DAO members’ can start monetizing their personal networks Value is retained within the ecosystem instead of paying intermediaries Additional DAO revenue streams can be created by referring talent and collecting bounties within broader Web3 space You help build an ecosystem of Web3 talent flowing seamlessly across different DAOs, communities and VC portfolio companies   Future of the Project We are thinking of a number of features to include in the future releases. Here are some of them:  bounties locked in DAO native token (currently FIAT and USDC only) profit pools shared among communities as Techtree starts generating profit applying bounties to other ares including knowledge, sales, asset acquisition and more   What we ask of the community We are looking forward to hear from the community about current DAO hiring needs and the potential of running a pilot project to help make hiring more effective across different projects in the GitCoin ecosystem. To run a pilot project we:  Create GitCoin talent branch (or DAO-wide talent pool) Help projects that are currently hiring set up their bounties Actively promote the talent branch throughout Techtree network  Since we already have a huge pool of talent sourced from a number of active talent branches, talent can flow from in and be readily available to hiring managers in the DAO. We are of course more than happy to present Techtree to the community in more detail. Thank you for reading the post.  References: Techtree Website My mirror article detailing the Techtree Concept. ",
                    "links": [
                        "https://techtree.dev",
                        "https://www.linkedin.com/in/paweltomczuk/",
                        "https://www.linkedin.com/in/stanislas-de-roquemaurel-galitzine-a98b9a57/",
                        "https://www.linkedin.com/in/laurencesangardebrown/",
                        "https://www.linkedin.com/in/andrzejd",
                        "http://Inflection.xyz",
                        "https://talentpool.webflow.io/vc-applicants/inflection",
                        "https://techtree.dev/user/MAR119/techtrees-first-bounty-board",
                        "https://mirror.xyz/0xd1CAFfa9b6901489286D6c744DE7A10B0101a572/MqwOjZYBVfHY6LkDX-3v6kXVrH9jW71P-siY7HS5oHY",
                        "https://techtree.dev",
                        "https://mirror.xyz/0xd1CAFfa9b6901489286D6c744DE7A10B0101a572/MqwOjZYBVfHY6LkDX-3v6kXVrH9jW71P-siY7HS5oHY"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.914959595959596
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#2",
                    "likes": "1",
                    "time": "29/09/2022-20:12:29",
                    "content": "Tagging @safder for visibility ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/andy_tt",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/09/2022-07:48:20",
                    "content": "thanks @krrisis . Appreciated. We’re building a mycelium network of talent, where different ecosystems can share access to talent pools to fill needed positions more effectively and for a fraction of the cost. All that with a clear-cut system of rewards for their communities . Will be happy to answer any questions community might have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#4",
                    "likes": "2",
                    "time": "04/10/2022-05:24:01",
                    "content": "Thanks for the tag here @krrisis! This definitely sounds like an interesting way to increase referrals and encourage collectively growing a web3 talent pool. I’m not entirely convinced though that this is a problem needing to be solved at Gitcoin DAO, at least not in the current environment given that we’re not aggresively hiring. For the positions that we’ve had open in the past couple months, we haven’t really had too much difficulty sourcing good applicants. Would love to see this built out more and tested by others in the space before considering spending our resources (time/money) on this. Good luck! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.133928571428572
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/andy_tt",
                    "index": "#5",
                    "likes": "0",
                    "time": "04/10/2022-09:50:52",
                    "content": "Thanks for the comment @safder . So we are looking into 2 possible scenarios here : one that means to facilitate hiring, the other - create revenue by turning community and its personal network into DAO’s revenue stream. Here, we assume every community is a talent pool. Even with bear market, many companies, communities and ecosystems are looking to hire, which is especially visible with Web3 space as recently numbers reach 300% the normal hiring rate vs trad hiring market. When a talent branch is created, DAO can invite their community members to join the talent branch. This is possible through applying directly or referring others to generic roles, that the community can customize to fit most represented roles.  Talent branch owner can then set a bounty on the current talent pool in case of successful hire. As Techtree’s branches are meant to be interoperable (per individual opt-in) talent can be made available for other communities allowing DAO to generate revenue stream from bounties. We are also planning to introduce local paywall, so there will be a subscription paid to the branch owner, for other communities, VCs and ecosystems to get access to its talent. We are trying to establish the usability of both scenarios to DAOs at the moment. Talent branches cover both of them.  Is this perhaps of more interest to the community? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.744047619047619
                }
            ]
        }
    ],
    "group_index": "211"
}