{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-akita-akita-apy-deposit-into-compound-fork-based-loans/3761",
            "title": "[Proposal - Akita] $AKITA APY - Deposit into Compound Fork (Based Loans) ",
            "index": 3761,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/TheSpaniard",
                    "index": "#1",
                    "likes": "5",
                    "time": "29/05/2021-01:21:37",
                    "content": "Hi Team, I am one of the guys working with the ghouls of based.loans, a DE-FI lending fork of Compound Finance (the largest lending protocol) I have a more Degen idea than just burning tokens to raise value of $AKITA. Why not put all the $AKITA to work on Based Loans? It’s a Compound Finance fork, which was designed to target the Alt coin space for coins with high trading volume, high liquidity, and high number of holders. We decided to create markets for the highest traded dog coins on ETH main chain. Essentially the play is to Deposit $AKITA to based.loans to earn $BLO APY on $KISHU. This will reduce selling pressure and increase the price over time. P.S. The screenshot if from one of my personal wallets. Cheers, The Spaniard Based Loans ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing a new idea to put all the $AKITA to work on Based Loans, a DE-FI lending fork of Compound Finance. The proposal is to deposit $AKITA to based.loans to earn $BLO APY on $KISHU, which will reduce selling pressure and increase the price over time. The post also includes positive feedback from a third party and an advertisement for Based Loans.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.247916666666667
                }
            ]
        }
    ],
    "group_index": "400"
}