{
    "poll_list": [
        {
            "id": "QmUq5WsYE9ryLEbt4NnGsuGQgzX7n5eeB2edKogVGkTz83",
            "title": "FDD (aka. Anti-Fraud, Sybil, & Collusion) workstream allocation - Q3 2021 budget request",
            "discussion": "",
            "body": "This is a request to send 50,000 GTC to the FDD-WG multisig to fund their Q3 2021 budget and supply a reserve to ensure uninterrupted operation of the critical functions of the workstream.\n\nThis workstream has the primary mandate of defending the Gitcoin network against fraud, collusion, sybil attacks, and any other degradation of the system’s legitimacy. This extends to the legitimacy of the DAO tasked with shepherding the dGrants protocol as well.\n\n**Multisig Address & Keyholders**\n\nGnosis Safe address: 0xD4567069C5a1c1fc8261d8Ff5C0B1d98f069Cf47\n\nhttps://etherscan.io/address/0xD4567069C5a1c1fc8261d8Ff5C0B1d98f069Cf47\n\nWorkstream MultiSig is a Gnosis Safe 4/7 setup with the following keyholders who act as board members representing the four primary substreams and other key stakeholder groups.\n- Disruption Joe - Coordinator (Communications & Coordination)\n- Michael Zargham - Data Science (Anti-Sybil as a Service)\n- Angela Kreitenweis - (Research & Policy)\n- Trueblocks - Data & DevOps (Technology Operations)\n- Bob Jiang - Community Contributors\n- Andrew Penland - Academic Oversight\n- Lefteris Karapetsas - Gitcoin Users\n\nAll keyholders are confirmed as committed to the responsibilities outlined in the FDD-WG Multisig Keyholder Responsibilities document and have reviewed and approved this budget.\n\nSee the initial proposal on the governance forum [here](https://gov.gitcoin.co/t/proposal-fdd-wg-anti-fraud-sybil-collusion-q3-budget-request/8210). This proposal met the minimum (5) days of deliberation having been posted on 8/11/21.\n",
            "choices": [
                "FOR",
                "AGAINST"
            ],
            "scores": [
                2752410.086842846,
                1265.1063197686492
            ],
            "start": 1629221400,
            "end": 1629653400,
            "snapshot": "13043964",
            "state": "closed",
            "author": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "FDD-WG Q3 2021 Budget Proposal 2021 ",
            "date": "Proposed on: Aug 26th, 2021",
            "yes_votes": "6.77M",
            "no_votes": "0"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-fdd-wg-anti-fraud-sybil-collusion-q3-budget-request/8210",
            "title": "Proposal - FDD-WG (Anti-Fraud, Sybil, & Collusion) Q3 Budget Request ",
            "index": 8210,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "11",
                    "time": "11/08/2021-15:24:27",
                    "content": " FDD-WG Q3 2021 Budget Proposal 2021 (Anti-Sybil & Fraud) This is a request to send 50,000 GTC to the FDD-WG multisig to fund their Q3 2021 budget. This workstream has the primary mandate of defending the Gitcoin network against fraud, collusion, sybil attacks, and any other degradation of the system’s legitimacy. This extends to the legitimacy of the DAO tasked with shepherding the dGrants protocol as well.  Multisig Address & Keyholders Gnosis Safe address: 0xD4567069C5a1c1fc8261d8Ff5C0B1d98f069Cf47 Workstream MultiSig is a Gnosis Safe 4/7 setup with the following keyholders who act as board members representing the four primary substreams and other key stakeholder groups.  Disruption Joe - Coordinator (Communications & Coordination) Michael Zargham - Data Science (Anti-Sybil as a Service) Angela Kreitenweis - (Research & Policy) Trueblocks - Data & DevOps (Technology Operations) Bob Jiang - Community Contributors Andrew Penland - Academic Oversight Lefteris Karapetsas - Gitcoin Users  All keyholders are confirmed as committed to the responsibilities outlined in the FDD-WG Multisig Keyholder Responsibilities document and have reviewed and approved this budget.   1600×1101 201 KB   Diagram shows how the funding will move through the workstream to produce outcomes & accountability.  Q3 2021 Estimated Budget (8/15/21-11/15/2021) This initial budget request is set to double our estimated Quarterly budget to ensure that this workstream can properly function without issue in the instance of delayed votes, market downturns, & political issues. The budget will be used to ensure the continued success of the FDD-WG in defending the network and maintaining an active approach to mitigating future attacks. Funds will be spent transparently with excess being held in the workstream multisig as the workstream and DAO at large find solutions to efficiently streaming governance rewards to participants.     Category Action Groups # Contributors Est. Cost     AntiSybilaaS Blockscience, Human Evaluation of Models 15+ 6750   Comms & Coord Workstream & substream coordinator(s), grant approvals, community education, contributor onboarding, contributor vote whipping, SaaS. 20+ 6250   Data & DevOps Data engineering, DevOps, Documentation 5+ 5750   Multisig Keyholders Multisig transaction execution, steward vote whipping 7 1250   Research & Policy Open Science research coordination & participation, grant disputes, policy maintenance, reporting & analytics, legal consultation 20+ 5000   Workstream Totals Per quarter budget total 60-80 25000   Proposal ask Double our estimated quarterly budget to ensure that this workstream can properly function without issue in the instance of delayed votes, market downturns, & political issues.  50000    High-level estimates are based on a synthesis of analyses done by Disruption Joe & Michael Zargham.   1600×1326 187 KB    Expected Outcomes of FDD-WG Work The functions of the workstream as outlined above include:  Multisig Keyholders Oversee the work, vision, and ethics of the workstream. Executing multisig transactions and participating in required meetings. Working with other stewards to boost support for continued funding of the workstream.  Execute Authorization of Transactions | Funding allocated in a timely manner Represent Key Stakeholder Groups | Provide a voice for key stakeholders Decide Split of Total Funding to Sub-Streams | Monthly vote (Mechanism TBD)   Communication & Coordination Facilitate rough consensus for WG budget, Draft Budget proposals for gitcoinDAO, secure support from stewards, publish FDD-working group updates, support substreams with transparency/legibility, facilitate relationships with other GitcoinDAO working groups; moderate working group workspaces and forums.  Workstream coordinator | Hire Disruption Joe full-time to DAO Workstream Accounting | Establish payment standards and stream treasury management Community & Project Management | Establish standards for contributor participation Comms & Education | Create onboarding materials, governance brief, proposals, etc. Grant Approvals | < 48 hours approval time Whipping Votes | Pass the ratification for payouts to GR11   Research & Policy Engage in community discussions around GitcoinDAO, collect questions, collect data, design and execute exploratory data analysis to answer questions and publish legible digests to the community; operate a bounty program to make it easy for external researchers to participate.  Proposal Writing | Draft world class proposals setting an example for web 3 Collusion Research | Present new ideas for detection of fraud, sybil, or collusion flagging Policy Making | Develop a sanctions policy in line with Ostrom’s 8 principles Disputes/Appeals | Creation of fair appeals process   Anti-Sybil as a Service (Blockscience) Maintain and Operate semi-supervised machine learning algorithms; includes feature engineering, model selection, metaparameter optimization, cross validation, model supervision, model technical documentation, model usage documentation; collaborate with Data &DevOps; increase automation of standard reports; interpret & explain round results, collaborate with external sybil research teams eg proof of humanity and brightID; see existing process documentation.  ML Pipeline (Sybil) | Maintaining a fraud tax below 3% Model Validations | Evaluate the models against loss of function Feature Engineering | Develop method of continuous input for potential features Model Training | Ethically design the model to abstract the interest of the community Model Supervision (Human Oversight) | > 10 Active contributors   Data & DevOps Maintain a FDD-WG github (or radicle) organization, develop and maintain cloud infrastructure capable of storing data, permission access to this data and ensure private data is kept private, design, develop and deploy reporting infrastructure for the FDD-WG financial transparency, host a dashboard tracking budgets against expenditures, host and maintain the anti-sybil micro-service (with permissioned access). Collaborate with all DAO workstreams to eliminate redundant data.  Database Use & Maintenance | Setup & maintain a FDD-WG repository MicroService DevOps | Setup hosting of anti-sybil microservices Data & Code Access Control | Reliable permission access & ensure PII compliance Master Data Management | Setup documentation & reporting Reporting & Analytics (Transparency) | Community access to all non-PII data and comms  This diagram shows our high-frequency activities and level of technical expertise required for each. While recommending that Tech Operations should be an independent workstream, it is already being bootstrapped at a functional level. For more on the functions & responsibilities of the workstream see Jessica Zartler’s post mapping the current setup of the FDD-WG.  Additional Considerations for Funding FDD-WG Legitimacy in quadratic funding is dependent on sybil-resistance Quadratic Funding is based on Sybil-Resistance. Without unique users behind each account, the mechanism can and will be gamed. The current work started with the Gitcoin Holdings core team as they brought in Blockscience as contractors to help solve this problem. This budget will allow the continuation of this work and build on the upfront costs already paid for by Gitcoin Holdings. Continuity in processes which have proven to be successful This group has been working towards understanding the effect of sybil accounts on the grants mechanism since GR7. The fraud tax was introduced in GR9. Members of this workstream are responsible for taking the fraud tax from 6.6% to 2.1% as can be seen in the GR10 Governance Brief.  852×593 78 KB  Subjective decisions should not be connected to Gitcoin Holdings Inc Many of the decisions made require subjective decision making, strong governance processes, and some even include PII data. For these reasons it would be easier to allow Gitcoin Holdings to directly handle them, but with the goal being decentralization we propose it would be better for the DAO to fund the contractors and coordinators for this workstream. This moves the power away from Gitcoin Holdings and into the community. In addition, rewarding contributors creates decentralizing pressure on these processes. Hiring a full-time coordinator with a proven track record Disruption Joe has been with the Gitcoin Holdings team since the end of GR7. His primary responsibilities started as a growth marketer where he helped the team develop a growth plan in Q4 2020 and execute to achieve their growth OKRs for the first half of 2021. He has also led the Gitcoin team’s operations during grants rounds GR8, GR9, & GR10 including facilitating relationships with Blockscience & the TEC Open Science programs. Most importantly, he has been a core contributor to this workstream from the beginning. Setting a precedent for Gitcoin Holdings team members to “move to the DAO” is an important step for progressive decentralization. Review Gitcoin blog posts by Joe: GR10 Governance Brief | Community Outreach with MGD DAO Setting precedent and beginning experimentation for allocation of DAO rewards DAOs can fall into the trap of not finding the proper method to be able to sustainably activate the community. Allowing workstreams with trusted coordinators the freedom to find their best solutions will provide a catalyst for the cultural evolution of GitcoinDAO.  In Conclusion The DAO as a whole is still figuring out the mechanism design which will be used to facilitate contributor rewards going forward. These solutions should promote the best bottoms-up ideas and codify the rulesets after reaching quorum. They will allow the competitive advantage of rewarding contributions while maintaining legitimacy. This workstream needs the funding to protect both the grants mechanism and the GitcoinDAO while the DAO solves these complex issues. ",
                    "links": [
                        "https://gov.gitcoin.co/t/fraud-detection-defense-working-group-mapping/8122",
                        "https://gitcoin.co/blog/gitcoin-grants-round-10-governance-brief/",
                        "https://gitcoin.co/blog/gitcoin-grants-round-10-governance-brief/",
                        "https://gitcoin.co/blog/a-hands-on-approach-to-aligning-goals-incentives-with-meta-gamma-delta-dao/",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-8/8357",
                        "https://gov.gitcoin.co/t/proposal-fdd-workstream-season-13-budget-request/9826/36",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-7/8229",
                        "https://gov.gitcoin.co/t/proposal-request-to-fund-fdd-workstream-q4-2021-budget/8857/11",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-9/8422"
                    ],
                    "GPT-summary": "The post is a budget proposal for the FDD-WG workstream, which aims to defend the Gitcoin network against fraud, collusion, sybil attacks, and any other degradation of the system’s legitimacy. The proposal outlines the estimated budget, expected outcomes, and the functions of the workstream. The post also highlights the need for funding to protect both the grants mechanism and the GitcoinDAO while the DAO solves complex issues. The proposal does not ask for feedback or advertise the proposal, but it welcomes collaboration and constructive criticism.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Community and engagement",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.677470937302398
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/akrtws",
                    "index": "#2",
                    "likes": "7",
                    "time": "11/08/2021-15:53:04",
                    "content": "Honoured to serve as a multisig keyholder for this workstream. Defending the core mechanisms of Gitcoin QF is extremely relevant for our DAO: nobody cares if everything works smoothly, while damage in trust would be huge in case of a successful attack. With this workstream we have the opportunity to establish new processes for optimizing and governing the algorithms to secure our network - and to set a standard for policy-making in decentralized organizations. Thanks everyone for supporting this proposal! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.666035353535353
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#3",
                    "likes": "5",
                    "time": "12/08/2021-20:25:48",
                    "content": "Gitcoin is trying hard to fund opensource development through the gitcoin grants program. Quadratic funding is a really exciting notion and a cool experiment to see unfold over the various rounds as a way to achieve this goal. Unfortunately it also has many limitations and many of them are reolving around fraud, sybil and collusion. People cheating. I think this is a really really hard problem for gitcoin, and other protocols/systems where fraud/collusion can happen. So it is with great pleasure to try to do a small part in helping achieve this goal by by being a multisig signer. I will try to do my best to serve the workstream, and the gitcoin community and promise to seek a replacement if at some point the workload  becomes too much for me. Finally as with this proposal I would be getting a small amount of GTC as signer, I will also abstain from voting on it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.647222222222222
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#4",
                    "likes": "6",
                    "time": "13/08/2021-07:55:27",
                    "content": "I am glad to join FDD-WG workstream group. I believe it is right direction to fund open source software (for Ethereum infra and dApp), but like other industry, there are sybil attacking, collusions because people like to cheating the system and get money. So as FDD-WG member, I would support GitcoinDAO to achieve the genius goal (fund and grow the open source software). Our intension is not to fight any people, but help to grow the GitcoinDAO community. Let’s work together to buidl a beautiful future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.079081632653062
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#5",
                    "likes": "6",
                    "time": "13/08/2021-20:29:27",
                    "content": "Is this workstream full already? If there is any room, I got a few certification around Cybersecurity, Anti-Fraud, Reverse Engineering, MITRE ATT&CK Framework, ISO 27001 and 20000 Certified, Zero Trust Networks, also CCAK from Cloud Security Alliance (Certificate of Cloud Auditing Knowledge) GDPR and much more. I also have many hours around Ethical Hacking if a plus + If you guys need some help or 1more contributor, feel free to message me. Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#6",
                    "likes": "5",
                    "time": "16/08/2021-13:36:27",
                    "content": "It is working. Look for events on the calendar at gitcoindao.com The next monthly update and open call for contributors will be tomorrow at 3pm EST! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#7",
                    "likes": "2",
                    "time": "16/08/2021-20:18:09",
                    "content": "Thank you @DisruptionJoe! I am busy during the day tomorrow but I will try to be there with my cell phone. Edith: I just filled up the form! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#8",
                    "likes": "3",
                    "time": "17/08/2021-19:48:56",
                    "content": "Welcome Sirlupinwatson!  Your experience will be very valuable in this workstream. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#9",
                    "likes": "4",
                    "time": "02/09/2021-17:28:08",
                    "content": "We are very excited to see this proposal pass on Tally. Time to really dig in. The work has been going on for weeks (months) now and it will be great to reward some contributors. If you want to see what the status of the work we are doing is, you can always check at FDD.GitcoinDAO.com In the updates section of the page, you can see the recordings from the latest “Weekly Community Update” call. Another good spot is the “See all FDD openings here” on the mainpage where contributors, once approved by the DAO Contributor Success stream and onboarded, can easily apply to participate in many streams & squads! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.528645833333334
                }
            ]
        }
    ],
    "group_index": "551"
}