{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/introducing-the-fdd-review/11095",
            "title": "Introducing the FDD Review ",
            "index": 11095,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "FDD-Review",
                "stewards",
                "Grants2",
                "sybil",
                "FDD"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "12",
                    "time": "12/07/2022-10:15:45",
                    "content": " FDD Review List of Articles 1/11/23 - Public goods Legos: roadmap 12/21/22 - Passport scoring-as-a-service 12/8/22 - Anti-Sybil Legos 11/7/22 - Insights from GR15 Identity analysis 10/18/22 - FDD: some security & privacy issues in a protocol based grants system 9/16/22 - The Limits of Sybil Defense (and How Composability Might Help) 9/8/22 - Scaling Gitcoin Grant Reviews 8/29/22 - Decentralizing Sybil defense using Gitcoin data 8/2/22 - Closing the Gap Between Passport Trust Bonus and FDD Sybil Detection 7/11/22 - Rethinking FDD: Defending Against Fraud or Optimizing Capital Allocation.  Prior to the launch of FDD Review but still canonical 5/31/22 - The Grants 2.0 Funding Stack - Choose Your Own Algorithm 4/28/22 - Grant Reviewer Rewards Modeling 12/1/21 - A Community Based Roadmap for Sybil Resistance  Introduction to FDD Review This is an announcement to kickoff an communication series about FDD.  The intention is to update the community through the voice of an honest critic. The remit for this “honest critic” role is to point out areas where FDD is becoming misaligned with its stated goals and/or the values of the wider community, or is failing to adequately explain its internal processes to its various stakeholders. The aim of this is to provide transparency of FDD to the wider community and stimulate continuous FDD introspection and course-correction.  Why After a difficult restructuring and realignment sparked by the Season 14 Budget Request process, we learned that our communication was subpar. Poor external communication of our objectives and methods led to difficult budget negotiations. At the same time, poor internal communication allowed individual squads to become siloed, making high-level decision making difficult. Our hypothesis is that a dedicated role focused on high-level critical feedback that specifically aims to point out instances of misalignment or opacity will enable a positive feedback loop which continually improves the alignment of FDD both internally and externally and significantly improve our outcomes and accountability.  What An honest critic requires subject matter expertise, experience of participating in FDD processes, and an exceptional skill for communicating nuanced and technical information. The critic must be a passionate advocate for the subject matter but not wholly dependent on the financial success of the endeavor. Our critics are asked to keep a high-level overview of the stream as a whole and write regular posts for consumption within and outside FDD. These posts may clarify the purpose and the mechanics of the work done in FDDs squads, point out inefficiencies and misalignments between the work done by individual squads and the wider stream, and the instigate conversation to refocus the direction and priorities of the stream itself. Ultimately, the aim is to review and communicate the work of FDD in the context of its various stakeholders, users and the community at large. The writing should:  Inform FDD of potential blind spots and new perspectives Assist the community in understanding nuances and tradeoffs in FDD work Provide a space for communication around FDD priorities Point out new developments that FDD could consider implementing Provide a tighter feedback loop for FDD optimizations  The writing should not:  Be seen as the chosen direction of FDD Be censored or overly orchestrated by FDD Focus on existing alignments, rather it should focus on tradeoffs and prioritization Directly critique contributors effort or competency  This series of posts is an experiment we will run through 9/1 with renewal consideration at that time.  How Ideally, this will be a role for someone, or a small group of people, who have a solid understanding of the mission of FDD, but who are not employed by FDD full time. As well as being a dedicated role, anyone can participate by tagging an post with “FDD Review”. Select articles will be featured here.  Post Summaries Our first article proposes a rethink of FDD’s mission statement from one that focuses on “preventing fraud” to one that aims to “optimize capital allocation”. The argument is that flipping mindset from defensive and adversarial to constructive and positive will have greater overall positive impact on grant giving performance because it can cover non-Sybil inefficiencies, including those arising inside FDD. The post challenges the assumption that a Sybil free quadratic funding round will naturally optimally allocate capital. Stakeholders in funding rounds are looking for the best possible method of funding their shared needs. Is Sybil defense the only threat a community must consider? The tl;dr for this post is that FDD should stop asking “How do we stop fraud”? and start asking “How can we optimally allocate capital”? Article list moved to the top of this thread! ",
                    "links": [
                        "https://gov.gitcoin.co/t/passport-scoring-as-a-service/12419",
                        "https://gov.gitcoin.co/t/anti-sybil-legos/12265",
                        "https://gov.gitcoin.co/t/insights-from-gr15-identity-analysis/11866",
                        "https://gov.gitcoin.co/t/fdd-some-security-privacy-issues-in-a-protocol-based-grants-system/11678",
                        "https://gov.gitcoin.co/t/the-limits-of-sybil-defense-and-how-composability-might-help/11524",
                        "https://gov.gitcoin.co/t/scaling-gitcoin-grant-reviews/11460",
                        "https://gov.gitcoin.co/t/decentralizing-sybil-defense-using-gitcoin-data/11382",
                        "https://gov.gitcoin.co/t/closing-the-gap-between-fdd-and-gitcoin-passport-sybil-defenses/11218",
                        "https://gov.gitcoin.co/t/rethinking-fdd-defending-against-fraud-optimizing-capital-allocation/11090",
                        "https://gov.gitcoin.co/t/the-grants-2-0-funding-stack-choose-your-own-algorithm/10770",
                        "https://gov.gitcoin.co/t/gia-rewards-okr-report/10438",
                        "https://go.gitcoin.co/blog/a-community-based-roadmap-for-sybil-detection-across-web-3",
                        "https://gov.gitcoin.co/t/rethinking-fdd-defending-against-fraud-optimizing-capital-allocation/11090/4",
                        "https://gov.gitcoin.co/t/workstream-fraud-detection-and-defense-working-group-assemble/158/92",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-26-2022/11134",
                        "https://gov.gitcoin.co/t/rethinking-fdd-defending-against-fraud-optimizing-capital-allocation/11090/7",
                        "https://gov.gitcoin.co/t/web3-sybil-resistance-tool-competitive-landscape/12461/3",
                        "https://gov.gitcoin.co/t/rethinking-fdd-defending-against-fraud-optimizing-capital-allocation/11090/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5496184606354095
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/louisto",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/09/2022-05:19:10",
                    "content": "Copy that. Ok we understand clearly what you said ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "2",
                    "time": "23/02/2023-02:15:14",
                    "content": "Sharing the legos documentation here for followers  GitHub - Fraud-Detection-and-Defense/lego-docs: home for lego documentation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#4",
                    "likes": "1",
                    "time": "24/02/2023-11:49:20",
                    "content": "Hello, I believe that the Github resources deserve to be at least 10x more popular Reading glasses on  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                }
            ]
        }
    ],
    "group_index": "157"
}