{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/grant-appeal-metamail-project-dispute-in-gr15/11840",
            "title": "[Grant Appeal] MetaMail Project Dispute in GR15 ",
            "index": 11840,
            "category": [
                "\\xf0\\x9f\\x8c\\xb1 Grants"
            ],
            "tags": [
                "sybil",
                "FDD"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Gooong",
                    "index": "#1",
                    "likes": "1",
                    "time": "04/11/2022-01:53:58",
                    "content": "Hi, I am Suneal, the co-founder of MetaMail (grant page at MetaMail | Grants | Gitcoin). On Sep 28, MetaMail project was marked as “Sybil Ring Verified”/“Quid Pro Quo” and then closed (grant dispute page at Notion – The all-in-one workspace for your notes, tasks, wikis, and databases.). Our team thinks this is unreasonable and needs further discussion. We have tried to appeal but get no response so we want to discuss it here. Why is MetaMail marked as disputed?  At first the FDD team thought the project was a grant emulation because they observed that the project did not have enough activity in Twitter and Telegram. But later agreed that MetaMail is a real project. The main reason is that the MetaMail project is suspected to be involved in the Sybil Attack. According to Joe: “It was favored by wallets that signaled as sybil in a group of 4 grants that all received the same donations with an outlier large amount of sybil donations compared to the whole”.  What did the project actually do? MetaMail provides a totally free email service for web3 users. We are currently focusing on iterating the product so we don’t tweet frequently. We mainly collect user feedback in the Discord server. We had made a great progress, and MetaMail won the gold prize in EthShanghai Hackathon: https://twitter.com/ETHShanghai2022/status/1533744993256771584 We are sure our team did not participate in the Sybiling activity. We know the Gitcoin rule from the begining and never promised any airdrop/NFT/token/role to users. The three co-founders are developing this project part-time and didn’t pay themselves with the grant. Actually, the grant we received was all stored in Gnosis-safe (Safe) and every expense was recorded. We know it’s hard to prove the non-participation of Sybiling activity but the project has no incentive to do so. We suppose even minus the sybil donation, the project will match the funding cap. So we argue that the MetaMail project is the victim of the sybil attack. Our suggestion is ignoring these sybil donations in the quadratic matching and making the project back into GR16. Thank you for your hard work on reviewing grant projects. What you do ensures fairness and equity, which is significant to the health of Gitcoin. We really understand and appreciate your contributions. ",
                    "links": [
                        "https://www.notion.so/https-gitcoin-co-grants-6087-metamail-adbb153ab04940248084c1ec7843463a",
                        "https://twitter.com/ETHShanghai2022/status/1533744993256771584",
                        "https://gnosis-safe.io/app/eth:0x7cC252b3BDE15f7cdb9D4156C45198EF904c760A/home"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.73469387755102
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/joi",
                    "index": "#2",
                    "likes": "1",
                    "time": "04/11/2022-08:28:36",
                    "content": "MetaMail is a non-profit public-good project, totally free to use. It does not accept any investment. All R&D and operation costs are borne by the founding members. Any penny is crucial. I sincerely appeal to the gitcoin community to cancel the false accusation of MetaMail. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/gmkung",
                    "index": "#3",
                    "likes": "0",
                    "time": "06/01/2023-11:32:59",
                    "content": "@joi @Gooong, this is Guangmian from Kleros. I have read through the discussions here and on the FDD’s Notion page, and I’d like to ask if you would like to know if you are still exploring ways to acquit yourselves of the charges in this thread? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "234"
}