{
    "poll_list": [
        {
            "id": "0x6acb83e8757ea5421a23d4f5ef082cf9455d4bc79f414da99905070ea54e6f8a",
            "title": "Public Goods Funding Workstream Budget Request for Q1 2022",
            "discussion": "",
            "body": " This vote is looking to pass the Q1 budget for the Public Goods Funding Workstream (PGFW). \n\nThe top level KPI of the PGFW continues to be to increase the GMV of Gitcoin Grants and related public goods funding mechanisms, both by scaling the right people into grants ops related roles, and by forming relevant strategic partnerships to further solidify Gitcoin as a credibly neutral public goods funding mechanism.\n\nThe total amount requested is 100k GTC over these 3 key areas:\n1. Grassroots Community Efforts (20k GTC)\n2. Gitcoin Grants Operations (45k GTC)\n3. Community Partnerships (35k GTC)\n\nFor more details please see this post: https://gov.gitcoin.co/t/proposal-public-goods-are-good-pgf-q1-budget-request/9416 ",
            "choices": [
                "Yes, approve!",
                "No!"
            ],
            "scores": [
                8493980.975324001,
                12.943996993801958
            ],
            "start": 1641355200,
            "end": 1641960000,
            "snapshot": "13939849",
            "state": "closed",
            "author": "0x0CF30daf2Fb962Ed1d5D19C97F5f6651F3b691c1",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "Public Goods Funding Workstream Budget Q1 2022 ",
            "date": "Proposed on: Jan 12th, 2022",
            "yes_votes": "6.97M",
            "no_votes": "0"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-public-goods-are-good-pgf-q1-budget-request/9416",
            "title": "[Proposal] Public Goods Are Good: PGF Q1 Budget Request ",
            "index": 9416,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#1",
                    "likes": "17",
                    "time": "13/12/2021-15:41:53",
                    "content": " Summary The goal of the public goods funding workstream is to help increase the interest in public goods within the web3, and to increase the funding for and the usage of quadratic funding based systems. Over the last 6 months, we have made significant progress on both fronts, and we are requesting 100k GTC in Q1 to forward this mission as explained below.  The initial workstream proposal was successfully passed on 7th August 2021 through a snapshot vote, and allocated 45k GTC to instantiate PGF. As a refresher, in Q3 we proposed 4 key activities:  Help set up processes to manage the GitcoinDAO treasury Create grassroots efforts to increase community empowerment and participation Build a team for moderating shared governance spaces Scale the operations for and usage of Gitcoin Grants  Our top level KPI continues to be to increase the GMV of Gitcoin Grants and related public goods funding mechanisms, both by scaling the right people into grants ops related roles, and by forming relevant strategic partnerships to further solidify Gitcoin as a credibly neutral public goods funding mechanism.  Our Journey so far The following aims to explain what the Public Goods Funding (PGF) workstream has achieved in the last 24 weeks (as of 13 December) while spending ~25k GTC of a Q3 budget (55% of the budget thus far), and opting out of applying for a Q4 budget until we were ready to scale. We are now ready to double down on our activities much in the same way that Moonshot Collective did in Q4 with their 100k GTC request, and are requesting a top up of 100k GTC to scale the work we’re doing.  Q3-Q4 Summary Let’s start by talking about the initial goals as set out in our original budget.  Manage the GitcoinDAO treasury   After building out an initial strategy PGF handed off further work to CrossDAO ops, an emerging cross-workstream executive body built to help scale core functions of the DAO Treasury management is now being led by Shreyas from PGF alongside Christine from FDD, with input from other stakeholders and contributors   Grassroots efforts to increase community empowerment and participation   PGF has put forward a number of initiatives to foster a community that cares about public goods, including the Public Library and Public Goods Are Good  Many of our key contributors over the last 3-6 months have come through this work (probably ~20 total contributors providing measurable value across the DAO)   Moderating shared governance spaces   Moderation was scaled up by PGF as part of our launch, when spam was overloading channels; while there’s still work to do on moderation, looking at comparables by community size like Uniswap shows that we have achieved a huge improvement in signal / noise over a relatively short period CrossDAO ops is now helping to continue this initiative as part of “DAO support” as proposed, and passed, in this proposal    Getting community input on our grants rounds   Gitcoin Grants Round 12 (GR12) has been our largest yet, with over $3m in net-new funds raised for the matching pool, and 30% more contributions than GR11 Ongoing activities are in progress that are likely to raise $3-5m in additional funding prior to GR13 This is still a key PGF function and will continue to evolve as Holdings and the DAO merge   Continuing Activities and Proposed Budget In Q1, we are seeking to spin up and continue the following efforts for the public good:  Grassroots Community Efforts (20k GTC)  With the success of our existing programs, and some new ideas in waiting, we want to: 1. Continue to improve and grow the Public Library  Continue to have >20 attendees for >5 weeks Scale and standardize the onboarding process so we can keep quality high (Bhaumik has agreed to come on to help here) Grow the number of partnerships between the library and related communities (e.g. Crypto Culture and Society) Continue to invite on the most aligned thinkers on public goods like Griff Green (discussing token engineering public goods economies), Niran Babalola (on funding public goods), and Simona Pop (on designing for human thriving) Leverage our documented notes, recordings, and tweet summaries (sample 1, sample 2) to prepare detailed research on the state of public goods thinking in web3  2. Continue to expand the reach of Public Goods Are Good  These weekly Twitter Spaces were envisioned to help solidify Gitcoin and its parters key forces pushing forward Public Goods by interviewing folks who have presented in the library more formally, for a larger audience, following up each post with a summary (sample 1, session 2, session 3) Guests so far include Griff, Niran, Manu, and Aya. Other sessions with matching funders from ENS, Synthetix, NounsDAO, and more were aimed to coincide with Grants Round 12, holding with 10 total sessions taking place over 4 weeks to help drum up interest in Public Goods especially regarding the journeys of people behind these organizations.   Gitcoin Grants Operations (45k GTC)  As mentioned earlier, running grants ops through PGF is an evolution and formalization of the initial idea of “getting community input on our Grants rounds”. This initiative has been led principally by many across leadership, and in Q4 we managed to get >$3M for our matching pools. We also started new Thematic rounds for organizations focused on Advocacy, Climate, and Longevity:  Climate Change - $250k - Funding projects combatting climate change Longevity - $65k - Funding open science & longevity research Advocacy - $900k - Funding projects that defend digital human rights and help improve crypto regulation  We have also continued supporting Ecosystem rounds with our partners:  Uniswap - $50k - Supporting open source in Uniswap’s ecosystem led by Connor Polygon - $100k - Supporting open source in Polygon’s ecosystem led by Michael/Chris Forefront - $25k - Supporting open source in Forefront’s ecosystem led by Jihad ZKTech - $50k - Supporting open source in zk’s ecosystem led by Michael Synthetix - $75k - Supporting open source in Synthetix’s ecosystem led by Kyle/Annika Gitcoin Building Gitcoin - $25k - Funding projects building Gitcoin’s ecosystem led by Connor Finally, we have ongoing efforts to build relationships with other organizations that can begin to support our public goods funding efforts on their own (e.g. NounsDAO, Momus Collective, PleasrDAO)   Community Partnerships  (35k GTC) The goal is to work with organisations through token swaps, partnerships, and by incubating new ideas directly under PGF. Notable token swap proposals:   DeveloperDAO proposal - issue 50,000 GTC for governance rights equating to 5% of Developer DAO when governance is live to help ensure that Gitcoin and Developer DAO can work together to coordinate bringing more web2 developers into web3  PrimeDAO proposal - grant Gitcoin $250K USD worth of PrimeDAO’s $D2D governance token at a price of $0.50 per token for a total of 500K $D2D coins, equating to 0.5% of Prime DAO treasury to help ensure that Gitcoin and Prime can work together to build tooling for DAO2DAO coordination  Notable partnerships and incubations:  Gitcoin helped incubate and provide initial funding for Verses led by Jasmine Wang and hopes to continue public discourse around the kinds of values we want to see in web3 as it scales; several drops are in planning incuding with groups like Metagov and Fight for the Future. Gitcoin helped incubate and provide initial funding for 0xPARC alongside a number of other organizations to help further application level research (e.g. Dark Forest) Gitcoin partnered with Reboot to help run the a next iteration of its call for new kinds of public goods  Gitcoin has partnered with DreamDAO to help onboard the next generation of web3 creators  Efforts to Create a Public Goods Coalition  This initiative is currently nascent and was born out of an initial idea to create a public goods coalition, which any number of DAOs could join by pledging 1% of their treasury or an acceptable equivalent i.e. $5m. This work is currently underway and is helping to build the associated lore and narrative framing, an initial rough draft can be found here: Public Goods Coalition - HackMD  For the broader announcement, we want to “green pill” people into actively contributing to public goods, to achieve a “Matrix-style” awakening of the state of society and web3’s role in fixing it. More details coming soon!  If you have any questions about this budget proposal, please comment below! Edit: At the request of some comments below, I have increased the partnerships budget by 10k GTC to further scale the number of collaborations we pursue in Q1. Any unspent funds will be accounted for in a write up similar to the above for Q2/Q3. ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-treasury-vision/8254",
                        "https://www.notion.so/Public-Library-131a38f0899748abad12bf9973f2db74",
                        "https://twitter.com/gitcoin/status/1468469316546973697",
                        "https://gov.gitcoin.co/t/proposal-request-to-fund-fdd-workstream-q4-2021-budget/8857",
                        "https://twitter.com/patel0phone",
                        "https://www.notion.so/Public-Library-131a38f0899748abad12bf9973f2db74",
                        "https://twitter.com/BenWest/status/1466893094079672331",
                        "https://twitter.com/f_shbiscuit/status/1461169298529947648",
                        "https://twitter.com/GitcoinDAO/status/1460348498096779265",
                        "https://twitter.com/f_shbiscuit/status/1463513718017314817",
                        "https://twitter.com/f_shbiscuit/status/1466777155203833859",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-developer-dao/9217/9",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-prime-dao/9330",
                        "https://twitter.com/verses_xyz/status/1457872988045336581",
                        "https://twitter.com/0xPARC",
                        "https://gitcoin.co/blog/seeking-a-new-kind-of-public-good/",
                        "https://twitter.com/dreamdao_",
                        "https://hackmd.io/HoHQuj4zRXK8fkdghk4hrg",
                        "https://gov.gitcoin.co/t/gitcoin-dao-workstream-accountability-flow/9644/4",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-1-2022/9683",
                        "https://gov.gitcoin.co/t/2022-roadmap-2022-goals/9613/10",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kris-s-voter-guide/9895",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24/9446",
                        "https://gov.gitcoin.co/t/how-does-the-dao-prioritize-side-rounds/9827/3"
                    ],
                    "GPT-summary": "The post is a proposal for the Public Goods Funding workstream to request 100k GTC in Q1 to increase the funding and usage of quadratic funding based systems. The post explains the progress made in the last 24 weeks and the proposed budget for Q1. The post also mentions the initiatives taken by the Public Goods Funding workstream to foster a community that cares about public goods and the partnerships and collaborations with other organizations. The author invites comments and questions about the budget proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Identity and reputation systems",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.500710484951556
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/alisha",
                    "index": "#2",
                    "likes": "7",
                    "time": "14/12/2021-21:27:48",
                    "content": "    ceresstation:  help increase the interest in public goods within the web3, and to increase the funding for and the usage of quadratic funding based systems   This is an incredible overview of the work the PGF workstream has carried out over the past few months. I appreciate the level of detail in the proposal and believe this will serve the DAO well in terms of remaining accountable, and being able to track the impact of the PGF workstream going forward. Based on the momentum Grants Ops team has coming off GR12, and the continued growth of the Public Library and Public Goods are good, it is hard not to be incredibly excited about being involved in the PGF workstream in 2022. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.866666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/sidcode",
                    "index": "#3",
                    "likes": "4",
                    "time": "15/12/2021-19:51:04",
                    "content": "    ceresstation:  both by scaling the right people into grants ops related roles, and by forming relevant strategic partnerships to further solidify Gitcoin as a credibly neutral public goods funding mechanism.   This cogent proposal highlights the many wonderful moments that the contributors of the Public Goods Workstream have shared over the last six months. The workstream has become a unique space to conduct curious conversations around the mission of Gitcoin (building digital public goods) in all ways possible, and this will only continue to improve and grow in Q1 and beyond. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9149159663865545
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Yalor",
                    "index": "#4",
                    "likes": "4",
                    "time": "15/12/2021-19:51:14",
                    "content": "Essential work that definitely needs to be paid for, thanks for putting all this together for us to review @ceresstation You definitely have my vote  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/davidphelps",
                    "index": "#5",
                    "likes": "4",
                    "time": "15/12/2021-19:51:54",
                    "content": "everything about this is amazing—primedao and verses are two of the most exciting projects rn, and i owe so much to public library. lfg lfg lfg ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/phutchins",
                    "index": "#6",
                    "likes": "3",
                    "time": "15/12/2021-20:28:52",
                    "content": "Love the efforts that are going on here! The partnerships that come out of these efforts are so valuable in driving us forward as we build. I fully support this team and the requested budget. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/HelloShreyas",
                    "index": "#7",
                    "likes": "3",
                    "time": "16/12/2021-10:20:22",
                    "content": "@ceresstation, this is a great overview of the work done so far by the public goods workstream. Gitcoin DAO has built some of the best processes among the DAOs I have worked with. I support the 90k GTC budget for Q1. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#8",
                    "likes": "3",
                    "time": "16/12/2021-12:13:46",
                    "content": "What a fantastic overview of all things the Public Goods Funding workstream has already accomplished, thank you for putting so much effort in bringing transparency in how funds have been used and what you want to accomplish in the next quarter. This budget request is definitely a prime example of how other workstreams should apply for budget, accountability for the win. A few notes:     ceresstation:  The following aims to explain what the Public Goods Funding (PGF) workstream has achieved in the last 24 weeks (as of 13 December) while spending ~25k GTC of a Q3 budget (55% of the budget thus far), and opting out of applying for a Q4 budget until we were ready to scale.   This is impressive, especially if you see the impact this workstream already has had. Ideally I hope we can come to a point where we can just link to a sheet per workstream on how funds were exactly allocated (FDD is setting a good example here), but I know this is being worked on under DAO Operations. The fact that you did not even spend the Q3 (!) budget just yet deserves loads of praise in any case.     ceresstation:  Community Partnerships (25k GTC) Led by Scott/Vishnu, the goal is to work with organisations through token swaps, partnerships, and by incubating new ideas directly under PGF.   On this: I would propose to actually increase this part of the budget, at least double it. PGF has already proven to be accountable with funds (see above), and I think it would be good to have some reserves to support other public goods initiatives through partnerships and sponsoring, this will become increasingly important, especially if the market would go down again: we need to be there to support community initiatives that support public goods.  Ps. Public Goods are Good. Thanks to everyone in the Public Goods Funding workstream, and especially you Scott, you are a force of nature and have been moving mountains. I hope the community sees this, the DAO wouldn’t be here without you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.800106326422116
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#9",
                    "likes": "5",
                    "time": "16/12/2021-19:31:29",
                    "content": "Of course, this proposal is core to the mission, and I fully support it. I’d also note that it’s very well done and feels complete and well justified. The one thing I think is missing, though, is an overall view of how this particular budget relates to the larger budget of the DAO as a whole. If I am to make a vote as a steward of the DAO entire, I feel like I need this context. This proposal asks to scale up its budget, which I’m sure is justified, but does that come at the cost of other parts of the overall picture? Is this budget asking to increase the overall expenditures of the DAO as a whole, and are those types of increases part of the plan? What would happen if every workstream doubled its budget? Again, I’m sure everyone recognizes that I support this group as much as anyone else. “Public Good” is my mission as well. At least for me, though, I need to see this budget in a larger context. I’ll vote for it, regardless… Sorry if I missed it in the proposal, perhaps someone will correct me if I have. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.435416666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#10",
                    "likes": "5",
                    "time": "16/12/2021-21:42:29",
                    "content": "While all the workstreams are doing great things, I’ve been most impressed with the outcomes from this stream. Granted, their work is more easily measured than building dGrants or defending the network, but seriously great fundraising and innovation in partnerships. I also really love the vibes of their calls. Will vote yes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.238095238095237
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#11",
                    "likes": "2",
                    "time": "16/12/2021-22:58:35",
                    "content": "Thanks for sharing the work that has been done so far and what are the future efforts. I support the requested budget for Q1. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/AvsA",
                    "index": "#13",
                    "likes": "2",
                    "time": "17/12/2021-12:13:02",
                    "content": "I support this proposal. Great work that you did on the past and I think the work stream model is definitely working. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#14",
                    "likes": "2",
                    "time": "17/12/2021-16:57:36",
                    "content": "This got definitely my vote! Public Goods has made incredible progress since last few months, with amazing people… I hope we can keep on scaling and bring up with even more ideas in 2022! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Toby",
                    "index": "#15",
                    "likes": "2",
                    "time": "23/12/2021-15:12:01",
                    "content": "Very nice work crew, this is impressive ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.450000000000001
                }
            ]
        }
    ],
    "group_index": "629"
}