{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/dear-moonshot-collective-help-daos-level-up-gov-tooling-buidl-request-for-chain-agnostic-conviction-voting/10027",
            "title": "Dear Moonshot Collective \\xf0\\x9f\\x8c\\x9c Help DAOs Level Up Gov tooling: BUIDL Request for Chain Agnostic Conviction Voting ",
            "index": 10027,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/JessicaZartler",
                    "index": "#1",
                    "likes": "13",
                    "time": "08/03/2022-18:05:31",
                    "content": "    TL;DR  WTF is Conviction Voting? 1Hive built the first instance of a super handy tool called Conviction Voting.  If you haven’t heard of it, here’s the TL;DR tweet thread.   The Problem: Many DAOs (including Gitcoin) are struggling hard with the same problems: Insurmountable overhead with keeping up with and voting on every proposal, all or nothing (1 or 0 analog) funding proposals votes like this one where there is significant support but not quorum, last minute vote swings and other governance “attack” vectors that require time weighted voting to correct and more… A Solution: The DAO buidler tool box must have Conviction Voting to more efficiently distribute & decentralize funding proposals and visualize dynamic average consensus signals. The consent, rather than consensus based tool can help:  Increase operational efficiency Mitigates many governance “attack” vectors   Image by Jeff Emmett  “CV shifts the governance space from majoritarian decision making towards sufficient support for proposals, based on the amount of funds they are requesting.” Credit Jeff Emmett  image929×571 71.7 KB   (Addressing plutocracy will require SSIDs/DIDs to scale in a meaningful way - I’m sure it won’t be long!)  Oh and did I forget to mention it provides rich data streams of continuous preference signals?  Who Am I (Reputation Flags) I am a Founding member of the FDD Working Group, Token Engineering & Governance Researcher at BlockScience, Advisor & Course Author at the Token Engineering Academy, Trusted Seed Member of the CommonsStack, Ground Control at the Governauts & Founding Steward of the Token Engineering Commons. Why We Need Moonshot’s Support My colleague, TE OG @jeffemmett & I have been chatting with @owocki and several others about the need to expand and create a public good, chain agnostic version of this tool. I tried to rally some groups last year to fund/build this initiative but they all wanted their own version, to which the incredibly amazing, talented & busy lead engineer/developer of CV said, “Hey guys, I can’t support 20 versions, let’s build this in RUST.” To which the groups said, “If we fund it, we want our way.” So, this is where the heroes of Gitcoin DAO & Moonshot Collective come in -  the pan-ultimate supporters of public goods!   Okay, I it, Now What?  One note before I let you go - this tool is customizable:  image960×540 107 KB  So, we can build something for funding, for continuous general signaling or ranking like a continous TCR - we definitely would need lots of discussion and some research with developers to figure out what would be the best, high leverage lego version that multiple DAOs could build on. So, don’t be shy and let’s crank up the conversation on this thread - pass to your friends  and let’s get the VC in the pipeline for the MC, who can be a hero for all DAOs - and build the chain agnostic version of Conviction Voting that we all need!  HOORAY!!!  NOTE: @jeffemmett & I are available (limited bandwidth) to support R&D and would also love to see some resources (a few others / CV team) to continue to expand content/education/research/documentation of these concepts/tooling/R&D  Thank you so much for reading and in advance, for your thoughts & support!      INTERDIMENSIONAL LIBRARIANS ONLY PAST THIS POINT      Deep Library: Conviction Voting-Funding / Signaling (Dynamic Average Consensus)   On chain  Documentation Conviction Voting: Novel Continuous Decision making [Presentation on Conviction voting by one of its developers, David Llop (Sem Brestels)](RadicalxChange Barcelona - Conviction Voting presentation by Sem - YouTube) Social Sensor Fusion cadCAD Model Walkthrough   cadcad.org    cadCAD – A Python package for designing, testing and validating complex... At its core, cadCAD is a differential games engine that supports parameter sweeping and Monte Carlo analyses and can be easily integrated with other scientific computing Python modules and data science workflows.      Simple Voting Model Dynamic Average Consensus: A Brief History of Conviction Voting Tutorial on Dynamic Average Consensus: The Problem, Its Applications, and the Algorithms Distributed Maximum Likelihood using Dynamic Average Consensus Algorithm Implementations Github repo Aragon Conviction Funding Pilot (struggled because of gas prices back in the day, they had it on mainnet, most others are on xDAI - could also be built on ID chain for Bright ID) 1Hive Conviction Voting Discussion & Dapp Walk Through (a bit outdated but some good general overview) Token Engineering Commons Conviction Voting Test App Walk Through Conviction Voting Used as Ranking/Signaling for Allocating Grants in CommonsStack Community  Off Chain  Ceramic Version ",
                    "links": [
                        "https://twitter.com/commonsstack/status/1309211776425365510",
                        "https://gov.gitcoin.co/c/governance-proposals/5",
                        "https://twitter.com/muninn23/status/1501194712203640836",
                        "https://twitter.com/j0hnwang/status/1489756724613373956",
                        "https://twitter.com/jeffemmett",
                        "https://twitter.com/jeffemmett/status/1488924850085416962/photo/2",
                        "https://gov.gitcoin.co/t/workstream-fraud-detection-and-defense-working-group-assemble/158/18",
                        "https://block.science/",
                        "https://tokenengineeringcommunity.github.io/website/docs/academy-welcome/",
                        "https://medium.com/giveth/the-trusted-seed-of-the-commons-stack-5af6fb04cd30",
                        "https://commonsstack.org/",
                        "https://twitter.com/GovernanceDAO",
                        "http://tecommons.org/",
                        "https://twitter.com/jeffemmett/status/1500863021605916676",
                        "https://medium.com/giveth/conviction-voting-a-novel-continuous-decision-making-alternative-to-governance-aa746cfb9475",
                        "https://twitter.com/404ouch",
                        "https://www.youtube.com/watch?v=r4-G18YNogw&list=PLy6j39s17_jQfcxhI-64Dt9ttyu1HGv4q",
                        "https://github.com/BlockScience/conviction/blob/master/social-sensorfusion.pdf",
                        "https://www.youtube.com/watch?v=ZtVtBjcIlRw&t=77s",
                        "https://cadcad.org/",
                        "https://cadcad.org/",
                        "https://www.youtube.com/watch?v=WDkk3ZXoTn0",
                        "https://michaelzargham.medium.com/a-brief-history-of-conviction-voting-ad4ca4eb4aee",
                        "https://ieeexplore.ieee.org/document/8716798",
                        "https://arxiv.org/pdf/1803.03224.pdf",
                        "https://github.com/1Hive/conviction-voting-cadcad",
                        "https://aragon.org/blog/introducing-the-conviction-funding-pilot",
                        "https://www.youtube.com/watch?v=CSWCDbrOeXA&feature=youtu.be",
                        "https://www.youtube.com/watch?v=6ohUOlBwhek&list=PLusWL9gf0FITLhObprqjHSEnngieil6Kx",
                        "https://medium.com/commonsstack/cstk-token-holders-can-now-use-conviction-voting-on-xdai-5090fdc3b8ad",
                        "https://blog.ceramic.network/trust-minimized-off-chain-conviction-voting/amp/",
                        "https://gov.gitcoin.co/t/8-ideas-for-dao-work-maximum-coordination/10483",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-8-2022/10032",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-moonshot-collective-budget-request/10446"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.672129416282642
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "4",
                    "time": "08/03/2022-21:54:34",
                    "content": "Love the post. Love the idea. I think it fits in perfectly in the coordination party kit suite of tools. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.333333333333332
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jeffemmett",
                    "index": "#3",
                    "likes": "6",
                    "time": "08/03/2022-22:47:19",
                    "content": "To add to this (admittedly, with fewer memes ): Conviction Voting in its present form is geared towards easing fund allocations in DAOs, which is a great use case and is likely to ease some of these kinds of funding decisions.  It could also be augmented with quadratic conviction voting, or perhaps even quadratic downvoting on CV proposals, to provide the capability for a DAO to express negative sentiment towards CV proposals, if there was a concern that too many proposals were passing too easily.  There is still a wide design space to explore in the use of these new tools, and we’re interested to see how they can be iterated & improved! On top of CV for fund allocation, there are also discussions about a CV-variation called #ConvictionRanking, which could act more like a continuous TCR (token curated registry). If this were created with a ‘BYO token’ design, any DAO could plug in their native token and allow any token holder to surface & vote on anything they see needing improvement in the DAO.  It could be a sort of “digital suggestion box” which curates & surfaces the most popular sentiments for action in a continuous, distributed & asynchronous manner.  I got the sense that GitcoinDAO would benefit from such a tool (as well as vanilla Conviction Voting for fund allocation!) when I came across a tweet convo between @owocki & @DisruptionJoe: https://twitter.com/jeffemmett/status/1499784633747054592 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.244436553030304
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#4",
                    "likes": "4",
                    "time": "09/03/2022-00:12:32",
                    "content": "I very much support this suggestion/post. The people behind this idea have been working on these ideas for a very long time. Super interested to see this become better known. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.731944444444444
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#5",
                    "likes": "3",
                    "time": "09/03/2022-14:24:55",
                    "content": "Absolutely Jeff. I think this is not only aligned, but necessary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#6",
                    "likes": "4",
                    "time": "09/03/2022-19:27:46",
                    "content": "I  Conviction Voting and I  this post big time. Love this form of inter-DAO suggesting thru the forum! As a Commons Stacker, I’ve spent a lot of time with CV (and Jeff and Jess!) and I agree that it’s:  a necessary piece of the DAO tooling stack full of potential to liberate society from ills of static voting capable of increasing legitimacy & engagement in Gitcoin Steward voting  This last point I see as the major benefit to Gitcoin’s mission. So we must investigate it  1 concern is that the type of decisions that are ideal for CV (long game strategic/organizational direction decisions) might not match the type of decisions that Gitcoin Stewards vote on (regularly scheduled, short interval budgetary/steering decisions). It’s possible that CV could change the way stewards vote, could change the way Workstreams propose. But it’s also possible that the types of proposals & mode of interacting with them would be too disparate and CV would gather dust living in Gitcoin’s governance system. I’m curious to hear what @Pop thinks as steward engagement is truly her domain. Knowing where Gitcoin & Moonshot Collective are at, I don’t see us being focused on providing DAO tooling in the near future. It’s not a major mandate of Gitcoin’s mission. So in order to find alignment to put development work towards this we’d need to see why building chain-agnostic Conviction Voting helps serve the mission of Gitcoin (which is to provide Public Goods Funding infrastructure) thru achieving our current OKRs: 2022 Roadmap & 2022 Goals ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.441576086956522
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#7",
                    "likes": "3",
                    "time": "10/03/2022-00:20:14",
                    "content": "    loietaylor:  1 concern is that the type of decisions that are ideal for CV (long game strategic/organizational direction decisions) might not match the type of decisions that Gitcoin Stewards vote on (regularly scheduled, short interval budgetary/steering decisions). It’s possible that CV could change the way stewards vote, could change the way Workstreams propose. But it’s also possible that the types of proposals & mode of interacting with them would be too disparate and CV would gather dust living in Gitcoin’s governance system.   I see the CPK as a toolset. You might not use a hammer to screw in a socket, but you still need it in the tool kit! It would be up for the workstreams to decide when to use it.     loietaylor:  It’s not a major mandate of Gitcoin’s mission. So in order to find alignment to put development work towards this we’d need to see why building chain-agnostic Conviction Voting helps serve the mission of Gitcoin (which is to provide Public Goods Funding infrastructure) thru achieving our current OKRs   I see these tools as force multipliers. They enable ecosystems rather than individuals. It seems to me that the potential to improve resource allocation, especially to public goods, is vastly greater through core primitives than through pounding out product to achieve OKRs. Hence being named the Moonshot Collective and not the 3rd story shot collective  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.328125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#8",
                    "likes": "5",
                    "time": "16/03/2022-21:40:40",
                    "content": "I got familiar with conviction voting at the Token Engineering Commons and I am a big fan.  We should absolutely consider its application here at Gitcoin.  No matter if we can make it fit OKR boxes or not.  CV is like a real-time signalling mechanism.  One lessor known feature of CV is that votes have a half-life much like a radioactive element.  This metric gets set in advance and determines the period of time after-which, a vote begins decomposing.  Signals do not last forever.  I wonder if CV could be used to make steward voting more powerful and timely. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.234375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lthrift",
                    "index": "#9",
                    "likes": "5",
                    "time": "21/03/2022-03:43:08",
                    "content": "hi @JessicaZartler and @jeffemmett we at Moonshot Collective would like to dig in on this! What’s the best way to reach you? Feel free to ping me on Telegram @lthrift ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/JessicaZartler",
                    "index": "#10",
                    "likes": "3",
                    "time": "21/03/2022-14:08:06",
                    "content": "Thank you so much everyone for your thoughtful comments and feedback!  Sitting with all of this and meantime, @lthrift I’ve sent you a Telegram message and will add you to a Discord group with @Pop to get something on the calendar. Appreciate all of you weighing in and will keep you all posted on any developments or research discussions  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/JessicaZartler",
                    "index": "#11",
                    "likes": "0",
                    "time": "21/03/2022-14:55:05",
                    "content": "Adding to the Library… 1hive is continuing to explore innovations based on conviction voting – this is a lot like a conviction voting modulated proposal inverter - a mechanism that can be used to flow funds to regular contributors with more fluidity. Fluid proposals (Osmotic Funding) 🚰 · Discussion #536 · 1Hive/gardens · GitHub ",
                    "links": [
                        "https://github.com/1Hive/gardens/discussions/536"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jeffemmett",
                    "index": "#12",
                    "likes": "4",
                    "time": "21/03/2022-17:02:46",
                    "content": "I was just going to drop this link as well in response to @loietaylor’s point above. Osmotic Funding is an interesting modification of CV that may be more useful for continuous Operational Expenses (OpEx) like staff salaries or working group budgets, rather than more discrete proposals for Capital Expenses (CapEx) like one off projects, etc. There are several interesting use cases for variations of the CV tool - eager to see how & where they may find PMF in GitcoinDAO!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.732142857142858
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#13",
                    "likes": "1",
                    "time": "06/04/2022-12:50:26",
                    "content": "Quick update for everyone here: @lthrift and I met with @JessicaZartler and @jeffemmett to discuss what the most pressing application/POC might be in the context of GD. My view is that we should focus on something that enables a 20/80 split in voting for budgets where if a small % of a proposal is disputed, it can continue to be discussed vs either holding up the whole proposal or meaning the full amount gets passed even though some stewards may still have reservations around it or require further clarification. Next steps: @lthrift and I are synching to establish what work might look like for Moonshot/the research team ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.80952380952381
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/JessicaZartler",
                    "index": "#14",
                    "likes": "2",
                    "time": "06/04/2022-15:34:59",
                    "content": "Thank you so much @Pop @lthrift for your time and meeting with us  We agree that’s a great direction and would be a really cool tool for the space! To share a few more notes from the meeting - it could also (eventually) be a composite system where Gitcoin DAO uses Conviction Voting for proposal funding for Capital Expenses and develops a new Conviction Funding Flow mechanisms for flowing salaries & ongoing costs (Operational Expenses). FROM MEETING NOTES: An OpEx Conviction Funding Flow Tool would: -Removes the BINARY “funds” or ”no funds” of proposals, and moves towards sliding scale of funds unlocked - like a dam opening with proportional amounts of water flowing according to tokens. -w/ configuration to correlate staking/threshholds with %s of the budget, rather than all or nothing - i.e. stewards agree w/ 80% of the budget, 80% unlocked while discussing/debating the other 20% so work can keep going Here is documentation of a mechanism Sem from 1hive and some others have been working on, that may be useful for the developers in looking at what primitives/code exists for building a tool like this: Osmotic Funding Osmotic Funding · ETHGlobal Showcase GitHub - BlossomLabs/osmotic-funding: Superfluid + Conviction Voting Osmotic Funding | Grants | Gitcoin There are other flow funding tools i.e. Radicle Drips, but they don’t have a conviction voting mechanism, so would be a really interesting and incredibly useful for many DAOs to have a tool combining these primitives… Thank you again and look forward to next steps and supporting  ",
                    "links": [
                        "https://github.com/BlossomLabs/osmotic-funding",
                        "https://gitcoin.co/grants/4503/osmotic-funding"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.240665584415584
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/JessicaZartler",
                    "index": "#15",
                    "likes": "1",
                    "time": "07/04/2022-16:56:35",
                    "content": "@Pop @lthrift FYI Invitation to the TEC community to join the Luna Swarm research group at 1Hive - ⚛ Community - Token Engineering Commons Maybe a chance to combine efforts  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "5"
}