{
    "poll_list": [
        {
            "id": "0xc6655f1fb08259263693f9111a8cdaba6b726390e9dbb65eaa6ce41905ba297c",
            "title": "Withdraw $10MM of GTC to diversify our treasury and increase governance partners",
            "discussion": "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825/4",
            "body": "tl;dr: As we get closer to launching our protocol, we want to extend our governance participation to a few new partners by exchanging governance tokens with stable tokens. This will put the governance tokens into the hands of strategic partners who can help us improve our protocol while also diversifying our treasury to ensure we can continue our mission in a larger crypto winter.\n\n## Details\nIn January we discussed and agreed that diversifying our treasury to hedge against large market down turns would be in our best interest as it would also invite strategic partners to participate in our governance future. This vote is to formalize that intent and extend governance rights to those partners who have shown interest and are aligned to our mission.\n\nVoting Yes on this proposal will enable us to withdraw $10MM of GTC to be used for diversification of governing ownership. We will use the same gnosis safe from our past vote to diversify our treasury. The signers on that Multisig are:\n\n- Myself (Kyle)\n- Annika\n- Shreyas Hariharan\n- Kris\n- Simona\n- James / Fire Eyes\n\nThe full terms of the diversification can be found in the governance post and links below. Here is a quick summary:\n- 17.5% discount on 30day price average\n- 1 year lock up with a linear 1 year unlock there after (2 years fully unlocked).\n- We will use Hedgey to help facilitate the trade and lock up.\n\nHere are a few links to read more: \nSnapshot vote for previously passed TD (with gnosis safe details): https://snapshot.org/#/gitcoindao.eth/proposal/0x0eb45cfd31ddd2701af3d74ce38a9e87292fe42a6b40b26812ff9889b07daeb3\n\nTreasury Diversification rationale on the governance forums:\nhttps://gov.gitcoin.co/t/gitcoin-treasury-diversification/9698\n\nUpdate on terms:\nhttps://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825/4\n\nA No vote would be to reject the terms or the idea of diversifying. This will likely kill the effort entirely as the terms have already been negotiated and I dont think we have any more room to change them.\n\n",
            "choices": [
                "Yes - Proceed with TD",
                "No - No not proceed",
                "Abstain"
            ],
            "scores": [
                9862547.10833473,
                552.6721147769581,
                2104584.0185287995
            ],
            "start": 1660404060,
            "end": 1660942800,
            "snapshot": "15334159",
            "state": "closed",
            "author": "0xc2E2B715d9e302947Ec7e312fd2384b5a1296099",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "Withdraw $10MM of GTC to diversify our treasury an…",
            "date": "Proposed on: Aug 25th, 2022",
            "yes_votes": "6.19M",
            "no_votes": "0"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
            "title": "Treasury Diversification Part II - Welcoming Strategic Partners ",
            "index": 9825,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "stewards"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/schlabach",
                    "index": "#1",
                    "likes": "5",
                    "time": "04/02/2022-18:38:52",
                    "content": "Authors: Treasury Diversification Working Group As outlined in this forum post, the Treasury Diversification Working Group is proposing that Gitcoin diversify $15 million of its treasury into stablecoins. Please refer to the first forum post for more on the diversification and the rationale for it. This post is intended as a primer on what the Gitcoin team is looking for in strategic partners with this diversification. To express interest in participating in the diversification, please fill out this form, and optionally, share your interest on this forum post.  Why Collaborate with Gitcoin Gitcoin is a pillar of the Ethereum ecosystem, comprising key infrastructure and tooling that facilitates ecosystem growth, protocol / project development, and talent discovery. Strategic partners may find Gitcoin appealing for the following reasons:  One of Ethereum’s most premium and well recognized brands A source and funder of the space’s most innovative and valuable projects, Gitcoin stands to be a rich ground for the best talent, up-and-coming protocols, and top developer opportunities Through the impact DAO framework, Gitcoin will accrue project tokens derived from its funding operations, becoming a valuable metagovernance entity An ever-growing crucial tool for protocol expansion and growth, Gitcoin’s horizontal scaling can take projects from ideation to successful communities High integration and stickiness - Gitcoin partners with projects across multiple development touchpoints: accelerator, compensation tools, talent sourcing, bounties / bugging, and more   Characteristics of Ideal Strategic Partners Our goal with this treasury diversification is not only to add stablecoins to Gitcoin’s treasury, but also to get $GTC tokens in the hands of long-term, high value-add partners. With this diversification, we are looking to add a cohort of strategic partners. Below, we’ve attempted to paint a picture of what ideal strategic partners for Gitcoin look like. DAO-Native & Mission-Aligned Ideal strategic partners deeply understand Gitcoin and its mission. The best strategic partners are those who are already active in the DAO ecosystem and are DAO-native. At the same time, the optimal partners are thoughtful and open-minded and can provide helpful feedback and outside perspective to Gitcoin as it continues to grow. Strategic partners should be long-term thinkers who see the relationship with Gitcoin as a true partnership. All parties should be aligned and work together to ensure Gitcoin can continue to be a pillar in the DAO ecosystem not just for the months ahead but for years into the future. High Integrity Partners must operate with the highest integrity. The DAO and community will consider the partner’s track record in past deals. Would Gitcoin be proud to announce a partnership with the candidate? Have they conducted themselves with high integrity in the past? Value-add The ideal partner also has a clear value-add to Gitcoin. How have they helped drive their communities, portfolio companies, or DAOs forward? Have they partnered with other DAOs in the ecosystem? Will the partner be active in future governance at Gitcoin? Beyond those high-level questions, we have three partner traits we are specifically seeking with this diversification:   Public-Goods-Native: Partners who themselves have already expressed a track record or a clear interest in funding public goods for the long-term   Advocates: Partners with a platform who want to grow the narrative of public goods and can help storytell & advocate for the work we are doing at Gitcoin   Mechanism Designers: Partners who can help with protocol development and/or exploring novel mechanisms of regenerative crypto economics   Strategic partners may vary. While we would like the diversification to be as DAO-native and DAO-friendly as possible, we’re open to any type of partner so long as they meet the criteria above. Partners can consist of other DAOs, VCs, or individual contributors.  How to Express Interest in Becoming a Strategic Partner If you think you’re a good fit to partner with Gitcoin, please fill out this form. Optionally, you may also respond to this forum post with a comment. Your comment should include:  Who you are Why you’d make a good strategic partner for this diversification, including:  What value can/will you provide to Gitcoin? Do you have a track record of being a value-add investor or partner? What ‘characteristics of ideal partners’, as outlined above, do you have? What involvement have you had with Gitcoin thus far? Any additional information that’s relevant     Logistics of the Diversification Llama will build the smart contracts necessary to complete the treasury diversification. We’re still in development, but contracts should:  Allow the working group to whitelist partner addresses Allow partners to deposit DAI Allow the working group to set the vesting schedule for $GTC tokens Delegate $GTC voting power to partners while the tokens are still vesting Allow Gitcoin’s treasury to withdraw stables   Conflicts of Interest / Ethics Policy After collecting responses from potential strategic partners, the working group will have a Google Sheet with the list of candidates. Members of the working group will disclose any conflict of interest or financial interest in a strategic partner to the forum and recuse themselves from evaluation of said partner in cases of serious conflict. Additionally, no member of the working group (or Llama) will buy or sell GTC tokens until the treasury diversification is complete. In cases where such an action is unavoidable, the working group member will disclose the trade to the forum at least 24 hours before making the trade.  Updates on the Process As noted in the first forum post, we want this process to be done as transparently and with as much community input as possible, while still being thorough and efficient. At a minimum, we’ll share weekly updates on the original forum post about what we’ve accomplished and what our plans are for the upcoming week. We’ll also seek to get the community involved wherever possible - this may include running Twitter Spaces to get feedback on the process or to give partners a space to share their thoughts.  Disclaimer: This post has been provided for informational and discussion purposes only. It is not intended to, and does not, constitute legal, financial, business, or tax advice. This post should not be relied upon to provide any form of protections or business advice. No decision to buy, sell, exchange, or otherwise utilize any digital asset is recommended based on the content of this framework. Everyone is strongly urged to do their own research. ",
                    "links": [
                        "https://docs.google.com/forms/d/e/1FAIpQLScpCS8BMyp0M6VJ9OrDRWyYr1FaQqGdsHd94AS314dEUFxvmg/viewform",
                        "https://docs.google.com/forms/d/e/1FAIpQLScpCS8BMyp0M6VJ9OrDRWyYr1FaQqGdsHd94AS314dEUFxvmg/viewform",
                        "https://gov.gitcoin.co/t/gitcoin-treasury-diversification/9698",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-3-12-2022/10046",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-2-5-2022/9830",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-2-26-2022/9962",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-6-2022/9949",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-3-19-2022/10128",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-updates-thread/10231",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-2-14-2022/9888",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-11-2022/10277",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-updates-thread/10231/4",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-2-19-2022/9927",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-updates-thread/10231/5",
                        "https://gov.gitcoin.co/t/poap-edition-gitcoindao-digest-13-2022/10363",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-updates-thread/10231/6",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-updates-thread/10231/7",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-7-2022/9996",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-updates-thread/10231/8",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-8-2022/10032",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-3-5-2022/10012",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-10-2022/10209"
                    ],
                    "GPT-summary": "The Treasury Diversification Working Group is proposing that Gitcoin diversify $15 million of its treasury into stablecoins. This post explains what Gitcoin is looking for in strategic partners with this diversification and how to express interest in becoming a strategic partner. The post also outlines the characteristics of ideal strategic partners and the logistics of the diversification. The post invites feedback and community involvement in the process.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.152351190476191
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/02/2022-12:21:27",
                    "content": "It’s great to see the Gitcoin community moving forward with actively managing it’s treasury! Could be an opportunity to re-evaluate the proposal for $oneGTC and see how it could serve the purpose of this initiative ICHI has made a lot of progress since the proposal was discussed, and with it’s new product Angel Vaults it would be easier to understand the role $oneGTC has, and the benefits for Gitcoin community. I have shared this with the ICHI community, hope the working group finds this useful ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.430871212121212
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#3",
                    "likes": "1",
                    "time": "29/03/2022-16:04:24",
                    "content": "I know 1Hive has been experimenting with decentralized options strategies through Hedgey.  They keep scaling up the experiments suggesting they are successful.  I can connect you to the team if you want more info.    hedgey.finance    Hedgey - Custom Deals On Any Token Generate upfront stable coin yield using your native token. Hedgey is the first marketplace protocol for buying and selling custom DeFi offerings on any token.      ",
                    "links": [
                        "https://www.hedgey.finance/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#4",
                    "likes": "11",
                    "time": "11/08/2022-17:02:56",
                    "content": "Hey everyone, I want to revise this thread as we are making progress on the terms. We have negotiated details with a handful of great community partners to begin our Treasury Diversification process. Protocol Labs is one of the leading partners. We have already been working with Protocol Labs in a number of ways - Schelling Point, Impact certificates, IPFS data stores on Ceramic in passport, etc.  Here is the tl;dr Partners will be obtaining our governance token at a 17.5% discount on the 30 day price average. It will come with a one year lock up to ensure those participating actually stay for and use their governance tokens. After the 1 year lockup, tokens will be begin to unlock linearly over a year in the event these partners no longer want to participate in governance (after two years fully unlocked). Based on these terms, I am requesting $10MM from the treasury at a 30 day price average minus the discount (when submitting to tally). Once we have the GTC, we can move it into a Hedgey pool and lock participation to those who are whitelisted from the community (perhaps those with a moonshot bot ). I am optimistic that a few more folks may jump into the pool as most folks who have shown interest have said they want to see final numbers once the pool is established. Universally Gitcoin is loved, and our mission is appreciated.  Here are the next steps: 1 - Move to snapshot given the support in the original post 2 - Assuming Snapshot vote is approved, move to Tally to pull out GTC 3 - Move GTC to Hedgey pool with defined terms 4 - Pool would be open for 30 days to invite outside participants Let me know if you have any questions! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7734375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#5",
                    "likes": "2",
                    "time": "25/08/2022-21:05:54",
                    "content": "Just an update for everyone - given the recent successful Snapshot vote. I moved this to a vote on Tally to move GTC out of treasury (this will be live on Saturday Aug 27 for vote). Stay tuned for more details on the partners we plant o bring on in addition to Protocol Labs. ",
                    "links": [
                        "https://www.tally.xyz/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/34"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving update on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.732954545454546
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ballsyalchemist",
                    "index": "#6",
                    "likes": "3",
                    "time": "05/09/2022-15:12:54",
                    "content": "This is Yuki from Fenbushi Capital. We are looking forward to supporting the growth of Gitcoin and its builder community. We have been through many cycles of bear and bull and have witnessed the importance of a resilient and continuously innovating builder community. I believe that is exactly what Gitcoin helps to build and foster. Bear for the builder! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.770833333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#7",
                    "likes": "0",
                    "time": "12/09/2022-17:52:47",
                    "content": "Thanks @ballsyalchemist ! We are going to be setting up the smart contract to exchange the tokens this week! Stay tune for more info for the rest of the community too  -kyle ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.696428571428571
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/mantuesday",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/09/2022-07:37:19",
                    "content": "I see 4.2m GTC moved, so the price for each GTC is 4.2m GTC/10m USD = 2.38 USD/GTC? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#9",
                    "likes": "0",
                    "time": "14/09/2022-14:37:02",
                    "content": "The terms are here  Not exactly the same math - we requested some extra. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/mantuesday",
                    "index": "#10",
                    "likes": "0",
                    "time": "15/09/2022-03:50:19",
                    "content": "So we will average the price from August 26 to September 26 ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                }
            ]
        }
    ],
    "group_index": "676"
}