{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/tldr-how-gitcoin-grants-round-12-works/9333",
            "title": "TLDR - How Gitcoin Grants Round 12 Works ",
            "index": 9333,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "5",
                    "time": "04/12/2021-21:58:42",
                    "content": "if you got asked to contribute a gitcoin grant, and are wondering what this whole thing is + if its legit, you’re in the right place!  tldr Gitcoin’s mission is to build & fund digital public goods (Open Source Software, Journalism, Protocol Research, etc) Gitcoin Grants Round 12 is our twelfth quarterly crowdfund matching campaign, designed to create contributions for these causes. You can browse the grants at https://gitcoin.co/grants.  wtf is qf? Gitcoin Grants is built upon Quadratic Funding (QF). (well, a variant of it if you want to be technical about it) Quadratic Funding is a math formula that dictates that we match crowdfunding contributions based upon the number of unique contributors, NOT the amount they contributed. Its not as complicated as it sounds.   In plain english, QF IS powerful because it can mean that, for the most popular grants, a very small crowdfund contribution will be matched by a lot from the matching pool.  TLDR - its a more democratic way of running a matching crowdfund. Learn more about quadratic funding here.  who are the funders this round? Round 12 funders, in no particular order:  MoonshotBots GreatestLARP Polygon EPNS Badger Uniswap Forefront Rainbow Rolls (NFTP) ENS Synthetix Grants Chainlink Hashkey Stakefish Regen  Read more about where the matching money comes from.  how much money is in the round Round 12 Combined size of matching pools: >$2.5M Main Round  Main Round - $1M - Funding public goods, primarily in the Ethereum ecosystem  Ecosystem Rounds  Uniswap - $50k - Supporting open source in Uniswap’s ecosystem Polygon - $100k - Supporting open source in Polygon’s ecosystem Forefront - $25k - Supporting open source in Forefront’s ecosystem ZKTech - $50k - Supporting open source in zk’s ecosystem Synthetix - $75k - Supporting open source in Synthetix’s ecosystem Gitcoin Building Gitcoin - $25k - Funding projects building Gitcoin’s ecosystem  Cause Rounds  Climate Change - $250k - Funding projects combatting climate change Longevity - $65k (an additional $150k to $1M up in the air)- Funding open science & longevity research Advocacy - $900k - Funding projects that defend digital human rights   is this whole thing legit? You should DYOR on any project that asks you do move tokens around, anon.  Gitcoin Grants is no different. Here are some helpful resources:  Checkout https://gitcoin.co/results.  Coindesk: How DeFi ‘Degens’ Are Funding the Next Wave of Open-Source Development. Vitalik Buterins reviews of Gitcoin Grants Round 3 4 5 7 9. ICYMI, in the round 5 post Vitalik asserts “Gitcoin Grants is establishing itself as a significant pillar of the Ethereum ecosystem that more and more projects are relying on for some or all of their support.”. Read the “What is Gitcoin?” TLDR post.  Read about our founder or listen to him speak. Poke around our Governance Forum or Discord.  Google Gitcoin.  Ask what people around you think.   what should i do next? Browse some grants at https://gitcoin.co/grants and decide for yourself.  green pill me.  FD7hEILVIAISMg0860×1176 203 KB  Take the green pill, fund digital public goods at Grants | Gitcoin  no really, wtf is QF? Go to https://wtfisqf.com/ to find out.    ",
                    "links": [
                        "https://gitcoin.co/grants",
                        "https://ethresear.ch/t/pairwise-coordination-subsidies-a-new-quadratic-funding-design/5553",
                        "https://wtfisqf.com/?grant=&grant=&grant=&grant=&match=1000",
                        "https://gov.gitcoin.co/t/where-does-the-gitcoin-grants-matching-pool-money-come-from/9036",
                        "https://gitcoin.co/results",
                        "https://www.coindesk.com/markets/2020/12/30/how-defi-degens-are-funding-the-next-wave-of-open-source-development/",
                        "https://vitalik.ca/general/2019/10/24/gitcoin.html",
                        "https://vitalik.ca/general/2020/01/28/round4.html",
                        "https://vitalik.ca/general/2020/04/30/round5.html",
                        "https://vitalik.ca/general/2020/10/18/round7.html",
                        "https://vitalik.ca/general/2021/04/02/round9.html",
                        "https://vitalik.ca/general/2020/04/30/round5.html",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694/3",
                        "https://owocki.com/about-kevin-owocki/",
                        "https://owocki.com/public-speaking/",
                        "https://gov.gitcoin.co/",
                        "https://gitcoin.co/discord",
                        "https://www.google.com/search?q=gitcoin",
                        "https://twitter.com/intent/tweet?text=what%20do%20people%20think%20about%20@gitcoin",
                        "https://gitcoin.co/grants",
                        "https://gitcoin.co/grants",
                        "https://wtfisqf.com/",
                        "https://wtfisqf.com/",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-23/9370"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.314013317191283
                }
            ]
        }
    ],
    "group_index": "619"
}