{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/greenpill-podcast-season-2-digital-identity-sybil-resistance/11201",
            "title": "GreenPill Podcast Season 2 - Digital Identity & Sybil Resistance ",
            "index": 11201,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "education",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "6",
                    "time": "29/07/2022-19:12:26",
                    "content": "Hey everyone, As you may know, I run a podcast called Greenpill - how crypto can regenerate the world on the Bankless network. I wanted to let you all know that the podcast is moving into a thematic season about Digital Identity & Sybil Resistance, starting Thursday next week. Guests include: BrightID, Upala, Orca, Bryan Ford, Humannode, Chase Chapman, Ceramic, Disco, GoodDollar/ Spruce, PolygonID, Paula Berman, Idena, GovernorDAO, KYCDAO, WorldCoin, Unique Network, & more A lot of these guests are possible Gitcoin Passport integrations! More generally, I think that the episodes on digital identity & sybil resistance may be useful to GitcoinDAO as it advances Passport + improves its sybil resistance.  If you are interested in following along, you may to do so here. ",
                    "links": [
                        "https://availableon.com/greenpill",
                        "https://gov.gitcoin.co/t/knowledge-transfer-characterizing-the-sybil-resistance-problem/11235"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.759615384615384
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "2",
                    "time": "05/08/2022-02:48:48",
                    "content": "Season 2 episode 1 with Bryan Ford (Professor who has been studying sybil resistence for over 15 years) is up! Check it here => Sybil Resistance with Bryan Ford | Green Pill #33 - YouTube Episode Description  Professor Bryan Ford leads the Decentralized/Distributed Systems (DEDIS) lab at the Swiss Federal Institute of Technology in Lausanne (EPFL). He focuses broadly on building secure decentralized systems. Sybil resistance is at the heart of building a regenerative society, and Bryan’s lucid and critical approach to Web3 and digital identity helps us sharpen the Green Pill thesis. Take the green pill anon.  ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-digest-29-2022/11260"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.901785714285714
                }
            ]
        }
    ],
    "group_index": "171"
}