{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/how-to-pitch-your-project-on-gitcoin-grants/9898",
            "title": "How to Pitch Your Project on Gitcoin Grants ",
            "index": 9898,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/erich",
                    "index": "#1",
                    "likes": "9",
                    "time": "15/02/2022-21:18:17",
                    "content": "It is much easier to raise funds via Gitcoin Grants if potential contributors in the community understand your project. Of course, as a grant manager, you’ll have to update your grant description again and again. Your pitch has to be engaging and transparent to be fruitful.   What is Gitcoin Grants? By way of background, Gitcoin Grants is a Quadratic Funding program to fund non-profit projects in the Ethereum ecosystem and a diverse range of similar ecosystems, e.g., Uniswap and Polygon. Gitcoin also operates Quadratic Funding programs with communities that work on causes such as climate change and longevity.  The below guide to creating your grant description on Gitcoin centers around ten issues. If you can answer all ten questions concisely, you’ll probably be good to get meaningful support from the Gitcoin Grants community. I copied and adapted the guide from Guy Kawasaki’s “The Only 10 Slides You Need in Your Pitch.” Please feel free to discuss the guide in the comments. I’d be happy to update it as Gitcoin Grants evolves.   1. Title Pinpoint the organization name and web address; contact person name, title, and email address.  2. Problem and Opportunity Describe the pain that you’re alleviating. The goal is to get everyone buying into the utility of your product. Avoid looking like a solution searching for a problem. Minimize or eliminate citations of consulting studies about the future size of your market. When you’re not alleviating pain but enabling people to do things they could never do before, this is the time to paint a picture of the world that you’re envisioning.  3. Value Proposition Explain how you alleviate the pain and the meaning you make. Ensure that the readers understand what you build and your value proposition. The value proposition is not the place for an in-depth technical explanation. Instead, provide the gist of your project – for example, “We are an Ethereum rollup transaction price website. We have written software that searches all other rollup transaction price sites and aggregates their price quotes into one report.”  4. Underlying Magic Describe the technology, secret sauce, or magic behind your product. Minimize text. The more diagrams, schematics, and flowcharts, the better. With this one section, you must convince people that you have a technically viable idea. If you have a minimum viable product, working prototype, or demo, this is the time to include it. If you’re lucky, the readers will never get to the rest of your grant description.  5. Funding Model Explain how you raise funds. For example, who gives you grants/donations? Who pays you? What are your distribution channels? If you have a unique funding model, explain it analog to familiar ones. Also, this is your opportunity to drop the names of the entities already using your product.  6. Go-to-Market Plan Explain how you will reach the people utilizing your product and summarize your marketing leverage points. The goal is to convince the readers that you have an effective go-to-market strategy that won’t break the bank. (Resist the temptation to use “go viral” because that’s wishful thinking, not a plan.)  7. Competitive Analysis Provide a complete view of the competitive landscape. Too much is better than too little. Never dismiss your competition. Everyone - customers, investors, and partners - wants to hear why you’re good, not why the others are bad.  8. Management Team Describe the key players of your management team, board of directors, and board of advisers, as well as your significant financial supporters. It’s okay if you have less than a perfect team - if you were the cofounder of Ethereum or Signal, you would not need to raise grants. You only have to show that your education and work experience are relevant to the market you’re going after. But, of course, all organizations have holes - what’s important is whether you understand that there are holes and are willing to fix them.  9. Financial Projections and Key Metrics Provide a three-to-five-year forecast containing dollars and critical metrics, such as the number of people utilizing your products and conversion rate. Do a bottom-up forecast. Take into account long sales cycles and seasonality. Making people understand the underlying assumptions of your prediction is as essential as the numbers you’ve fabricated.  10. Current Status, Accomplishments to Date, Timeline, and Use of Funds Explain the current status of your product, what the near future looks like, and how you’ll use the grants you’re trying to raise. Moreover, share the details of your positive momentum and traction. Then use this section to close with a bias toward action. ",
                    "links": [
                        "https://www.radicalxchange.org/concepts/quadratic-funding/",
                        "https://gitcoin.co/grants/new",
                        "https://guykawasaki.com/the-only-10-slides-you-need-in-your-pitch/",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-6-2022/9949"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.857717803030303
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/clasikman",
                    "index": "#2",
                    "likes": "0",
                    "time": "16/02/2022-12:39:22",
                    "content": "@erich Nice to greet you. The points are perfect to have where to start. I only have a comment on point number 2, PROBLEM AND OPPORTUNITY, if we follow this point we return to the traditional model of stagnant education, which indicates  “Your problem is not the absence of the solution”.  I mean that in many grants there is not even a problem because everything is fine, but their proposal is for innovation, a field that is not occupied, a new implementation and that is how the most important inventions are created, many times it is born from madness and not so much about analyzing a problem. So perhaps it would be focusing more on the OPPORTUNITIES generated by the subsidy. It’s just my point of view. Greetings and a pleasure to participate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5814393939393945
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#3",
                    "likes": "3",
                    "time": "17/02/2022-06:59:32",
                    "content": "Hey @erich Thanks a lot for your promotion about grant! I’d invite all the grantees to answer one question before they create a new grant: Is the grant public goods?  what is public goods  If the answer is yes, move forward. Otherwise, you could join Discord to consult. ",
                    "links": [
                        "https://discord.gg/gitcoin"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.482954545454546
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/erich",
                    "index": "#4",
                    "likes": "1",
                    "time": "17/02/2022-12:20:28",
                    "content": "Thanks for the comment — I absolutely agree that “opportunities” might often be at least as compelling motivations as more apparent “problems” to build. The below paragraph from the guide already kind of captures that observation.     erich:  When you’re not alleviating pain but enabling people to do things they could never do before, this is the time to paint a picture of the world that you’re envisioning.   Does this need to be even more explicit? If so, how? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.28125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/clasikman",
                    "index": "#5",
                    "likes": "0",
                    "time": "19/02/2022-08:11:19",
                    "content": " When you’re not alleviating pain but enabling people to do things they could never do before, this is the time to paint a picture of the world that you’re envisioning.  like this is perfect Thank you for taking my comment into account, a pleasure to greet you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#6",
                    "likes": "2",
                    "time": "20/02/2022-22:37:34",
                    "content": "NICE! We need to inform people about this!  As the person that’s driving the review squad atm I can say that this post is like a breath of fresh air. We get a lot of incomplete grants, no MVP, no proposition, etc. We should post an official blog (before GR13) post about the grants that should include this information and maybe let remind people that they need to submit a maybe semi-finished project, not a incomplete one when they apply for a grant I can help out with this if ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.09375
                }
            ]
        }
    ],
    "group_index": "684"
}