{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/january-csdo-digest/13040",
            "title": "January CSDO Digest ",
            "index": 13040,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#1",
                    "likes": "3",
                    "time": "22/02/2023-19:51:57",
                    "content": "Many of you may know about our Cross-Stream DAO Operations, or CSDO, powerhouse team. If you don’t, CSDO is all about creating coherence. We provide the space and conditions for higher-stake cross-workstream decisions to be vetted and discussed, enabling our DAO to efficiently and responsibly fulfill its purpose. With all the world-regenerating we’re doing - from questioning the foundations of our knowledge to building scalable infrastructures for public good - it’s easy for things to get lost. That’s why we’re introducing this monthly CSDO Digest! We’ll be breaking down all the most important CSDO outcomes from every month, so let’s dive into January!  DAO-Wide Updates  Website Refresh MMM’s CoachJ shared an update on the timeline for the website update launch, and that can be expected in April!  Proposals  Budget Logic Update CSDO voted on a proposal surrounding our budgeting logic and proposed updates. For now, we will keep our current budget logic and do another ‘light’/’off’ season while continuing to evaluate & research where we are heading. During this process, we will be taking into account feedback from CSDO, steward council and other key decision makers. You can read the full passed proposal here.  Workstream Evaluations DAO Ops’ Saf brought forward a proposal for updating the workstream evaluation process, stating that the current format isn’t ideal for increasing accountability to stewards. This proposal didn’t pass, but discussions will be continued async and this topic will be brought back up at a future date. You can read the full proposal, which will be continued async, here.  Key Discussions & Thoughts  Essential Intents Review CSDO got together to workshop and rank their thoughts on each essential intent. These were the results: Protocol Adoption CSDO believed that we should keep this essential intent, but make minor changes. Grants Program Success CSDO believed that we should keep this essential intent, but make minor changes. Financial Sustainability CSDO believed that we should keep this essential intent, but reached a tie between making minor changes or leaving it as-is. DAO Organization CSDO believed that we should keep the spirit of this essential intent, but make major changes. Ultimately, CSDO decided to pause on this review after this exercise to focus on the “most important things.” You can check out the notes, voting breakdown, and workshopping exercise here.  Steward Council The Steward Council kicked off this month! Our elected Steward Council members began meeting to help advise on high-level and external matters impacting the DAO. You can check out all the notes and thoughts going on in our council in the Steward Council Notion Hub.  Other Discussions DAO Ops’ Kris asked for clarification on how to move forward with budget planning for Season 17 - do we want to keep our current budgeting process or switch to the new process proposed by Saf? The consensus around moving to the proposed budget process was positive, with the need to minimize any disruptions to workstreams as a key element in the success of the transition. The need for a bridge budget to cover the time between the transition was also flagged. Later in the month we changed course on this and decided to not move forward with this proposal but keep the existing logic. More under [hyperlink] decisions. DAO Ops’ Saf solicited a temp check to see if Pods are meeting the goals/vision that was originally set for them. The group seemed aligned on Pods not currently meeting their potential, but providing a valuable avenue for cross-stream information sharing. We decided to revert back to the logic of giving workstream updates, with a focus on cross stream collaboration. DAO tooling is looking into an updated discord logic for pods. MMM’s CoachJ asked for information surrounding sponsorship policies, budgeting, and approach. He wanted to better understand the DAO’s policies on sponsorships and how workstreams can appropriately budget for sponsorship opportunities. There will be further async discussion on this topic. GPC’s Kevin asked how CSDO & the DAO can better seek input from the broader community. We have received feedback that it’s hard to keep up with CSDO and the decision making process if you’re not in the meetings. DAO Ops’ Kris and PGF’s Scott will begin initially thinking about how we can further improve transparency, context-sharing, and feedback solicitation within CSDO and the DAO. MMM’s Laura wanted to better understand who is driving/owning the DAO strategy work that is being done right now. There are a number of docs going around related to DAO strategy, but understanding who the main driver is has been challenging. DAO Ops’ Kris volunteered to be the driver for this initiative, and Laura will continue adding feedback to the proposed strategy docs outlining missing key areas. PGF’s Janine re-ignited the discussion on the importance of bringing an experienced finance professional into the DAO. We are currently working with a fractional CFO, but are seeing a need for more strategic financial advice. Janine, GPC’s Olsen, and Foundation/GPC’s Kyle will be meeting to identify the problems we are hoping to solve with the addition of this role. FDD’s Joe solicited a temp check on how to spend the money they received from Aave Grants DAO. We currently do not have any written policies covering this scenario, and Joe will be putting his thoughts together in a Notion document to share with the rest of CSDO to get this started. Foundation/GPC’s Kyle asked if CSDO would permit using the CSDO gnosis safe to pay the upfront cost ($30k) for the Schelling Point space. This money will be repaid through funding from sponsors. There were no objections. DAO Ops’ Kris asked if we could pay the Steward Council members through the CSDO Gnosis Safe as these payments weren’t originally in DAO Ops’ budget. There were no objections, and moving forward DAO Ops will budget for these expenses. DAO Ops’ Jodi asked about the value in creating a single DAO-wide budget that reflects the spend of the entire organization. This has been a repeated ask from external stewards, but fully understanding the value that can be provided from this exercise still needs to be worked out. Jodi will continue to ideate on this and bring it back for further discussion.* PGF’s Janine got a temp check from the group on their thoughts surrounding the reorganization. The intention is to define a future-facing vision for the organization, then break it down into structure and identify where each workstream fits into that vision. The CSDO group will discuss this further in person at the team retreat. DAO Ops’ Jodi shared the results from the Community Health Survey that was shared with contributors. Next, DAO Ops will be meeting with Converge to discuss and analyze the results. This will inform DAO Ops’ S17 outcomes, as well as team retreat facilitation.* FDD’s Joe and Alex asked about the best place to introduce fraud/risk management & protection within product streams. Kyle, Olsen, and Nate pitched in aligned that allowing risk & product to work more closely will create aligned priorities and reduce tension across the product development lifecycle. MMM’s Laura gauged the group’s sentiment surrounding creating norms for moving difficult topics to the forum. DAO Ops will create this guidance to help reduce tensions and provide structure for contributors interested in having these types of conversations publicly.* Some initial suggestions included moderation questions the poster should ask themselves before posting and giving any impacted parties a heads up. DAO Ops’ Kris raised the question of workstreams requesting stables to pay contributors. There was tension within the group on this topic, as having stables provides the DAO with a safety net but may reduce psychological safety within the organization. For now, workstreams will not request stables until a long-term plan can be created around allowing this. For more information on how these discussions went, you can check out all of the CSDO Meeting Notes to read more, or the Gitcoin Transparency YouTube Channel to watch recordings of CSDO calls! *In light of DAO Ops getting dissolved in S18 some of these items will be put on hold, while we reevaluate our internal workings. And that’s it for this month! Keep checking back monthly for future editions of the CSDO Digest! ",
                    "links": [
                        "https://docs.google.com/document/d/1maTZC2Gwy9m5639x2CulKOwXEZEEB24xCCt85q3i8K8/edit#",
                        "https://www.notion.so/gitcoin/Budget-Logic-S17-9be6faed98304059a29e7eb577708ed6?pvs=4",
                        "https://www.notion.so/gitcoin/Evaluation-Workstreams-57081987011b478b981aa25f113d98c3?pvs=4",
                        "https://www.notion.so/gitcoin/CSDO-Sensemaking-2-fbd98dbf96c64c2eb6a141ce1cf4b546?pvs=4",
                        "https://www.notion.so/gitcoin/Steward-Council-23fbc9c6535f4a6dab7b53d884cc4062?pvs=4",
                        "https://www.notion.so/gitcoin/ae55433c4f834a249b6936f6f9aa8d18?v=1a740581545c4946970ba8985b0c225a",
                        "https://www.youtube.com/playlist?list=PLdGQKwXzBAceH-ewgFy9nRPbjAk_Rj5n7",
                        "https://gov.gitcoin.co/t/s17-proposal-dao-ops-budget-request-integrated/12741"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.744525138604086
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/chaselb",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/02/2023-10:09:30",
                    "content": "    kylejensen:  will keep our current budget logic   the google doc is private From this overview, I’m not really clear what is under CSDO’s decision-making power and what is supposed to be for the community. It seems as though the new Workstream Evaluation proposal was decided to be put on hold by the CSDO, but that seems faulty. How the community should evaluate workstreams, should be decided by the community (or community representatives), in collaboration with the workstreams. Right now it seems like the workstreams are drafting these new processes, and then will eventually present the final draft when they feel it is time to transition. This feels faulty. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.317775974025975
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/december-csdo-digest/12528",
            "title": "December CSDO Digest ",
            "index": 12528,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#1",
                    "likes": "1",
                    "time": "09/01/2023-20:23:01",
                    "content": "Many of you may know about our Cross-Stream DAO Operations, or CSDO, powerhouse team. If you don’t, CSDO is a group of workstream & initiative leads that come together to ensure alignment, transparency, and integrity across the DAO. These troopers do everything from starting important conversations to ratifying organization-changing proposals, each one aligned with our essential intents & purpose and aiming to make Gitcoin a better place to work. With all the world-regenerating we’re doing - from questioning the foundations of our knowledge to building scalable infrastructures for public good - it’s easy for things to get lost. That’s why we’re introducing this monthly CSDO Digest! We’ll be breaking down all the most important CSDO outcomes from every month, so let’s dive into December!  DAO-Wide Updates FDD Contributor Sorana started an internal audit to better track & understand DAO Spending! Based on her findings, DAO Ops will share recommendations to workstreams on best practices.  Proposals  CSDO Charter v1 v1 of the CSDO Charter, proposed and driven by DAO Ops’ Kris, has been ratified. The CSDO charter aims to address and solve tensions felt in certain key areas, such as:  A lack of shared ownership, not enough accountability for next steps Not enough real/‘essential’ DAO strategizing as a team, not going deep enough No shared vision for what CSDO is  The new charter, which consists of the CSDO charter, CSDO Operating Rhythm, and a CSDO Member Role charter, works to ensure alignment and agreement on what CSDO is, to emphasize our shared ownership and need for time allocation, and decide on a rhythm and content for strategic calls. You can view the passed proposal here.  Redesigning Budgets DAO Ops’ Saf created a proposal around redesigning the current budgeting process. CSDO members have been soliciting feedback from Stewards on the redesigned budgeting process proposal, and Saf continues to integrate feedback and modify the proposal as these discussions happen. You can view the work in progress proposal here.  DAO Business Model Framework Audit There is a proposal to conduct an audit and analysis of the DAO’s business model framework! The goal here is to create a 1-pager explaining GTC’s business model. This proposal did not pass, and you can view it here.  DAO Strategy Foundation/GPC’s Kyle, PGF’s Scott, as well as multiple others across the DAO, have all been working toward better understanding Gitcoin’s strategy and synthesizing their thoughts into documents. CSDO is hoping to collect their thoughts and understand the highest priority areas of disagreements for discussion in upcoming strategy calls. You can view the work in progress proposal here.  Key Discussions & Thoughts Team retreat planning is in progress! DAO Ops’ Jodi is working on refining the numbers and nailing down lodging, programming, etc. Further details will be shared as they develop, including dates, location, timing, and cost (to the DAO). Workstreams have already confirmed expected contributor participation. GPC’s Kevin shared the midpoint of a polis poll going around right now. Some of the majority opinions so far include consensus around the GTC protocol earning revenue with fees, enabling round operators to opt in to enabling fees, and Gitcoin continuing to fund its own public goods! This poll will be sent to a few more Stewards, and more updates on this will be shared as they come. MMM’s CoachJ shared some details about the rebranding and renaming work MMM is doing, and asked for feedback on their current strategy for soliciting feedback on their ideas. MMM will continue to work on this initiative, and expect to share their thoughts with GPC & PGF in the new year. From there, they will solicit feedback from a wider audience, including DAO Core and external community members. You can watch the recordings of MMM’s calls with the community on this on our Youtube Channel or read their forum post here. DAO Ops’ Kris solicited feedback for topics CSDO wants to see on the agenda for the next Steward Council meeting happening on 1/9. This led into a larger discussion around improving & systematizing the Steward onboarding flow to provide Stewards with deeper context into what’s currently happening in the DAO. PGF’s Janine shared an update on the simulated rounds they conducted, which went well! PGF is conducting a retro this week, and is aiming to be operationally confident with the new system by March. PGF’s Janine brought up the concern about transparency gaps with workstreams. With pods, the opportunities for workstreams to share their progress and work has become limited. The hope is to find a weekly space to share these updates and maintain awareness across the DAO. DAO Ops’ Kris got a pulse check on cleaning up the DAO Core role to more accurately reflect current DAO Core members. There were no objections, but led to a short discussion about generally re-analyzing the server’s structure given the introduction of pods. DAO Ops’ Jodi solicited CSDO’s feedback on the draft of a contributor health survey that will be launching January 10th. This survey is intended to help us identify strategic actions to improve operations and culture. For more information on how these discussions went, you can check out all of the CSDO Meeting Notes to read more, or the Gitcoin Transparency YouTube Channel to watch recordings of CSDO calls! And that’s it for this month! Keep checking back monthly for future editions of the CSDO Digest! ",
                    "links": [
                        "https://www.notion.so/gitcoin/Redesigning-Budgets-da17ccbeb62b4fac81d683efc4ae483f",
                        "https://www.notion.so/gitcoin/Business-Model-Framework-Audit-65d6da6a5a554c79a7f899207e67c1b0",
                        "https://www.notion.so/gitcoin/DAO-Strategy-dcbfd8d34fab4a5ab5e55e28c017486e",
                        "https://www.youtube.com/playlist?list=PLdGQKwXzBAcfBWgBVqQQQUj5cyi6PBwlJ",
                        "https://gov.gitcoin.co/t/discussion-series-evolving-the-gitcoin-brand-naming-our-protocols-products/12500",
                        "https://www.notion.so/gitcoin/ae55433c4f834a249b6936f6f9aa8d18?v=1a740581545c4946970ba8985b0c225a",
                        "https://www.youtube.com/playlist?list=PLdGQKwXzBAceH-ewgFy9nRPbjAk_Rj5n7",
                        "https://gov.gitcoin.co/t/s17-proposal-dao-ops-budget-request-integrated/12741"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.917327787560839
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/november-csdo-digest/12338",
            "title": "November CSDO Digest ",
            "index": 12338,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#1",
                    "likes": "4",
                    "time": "13/12/2022-20:38:43",
                    "content": "Many of you may know about our Cross-Stream DAO Operations, or CSDO, powerhouse team. If you don’t, CSDO is a group of workstream & initiative leads that come together to cultivate coherence across the DAO. With all the world-regenerating we’re doing it’s easy for things to get lost. In our monthly CSDO Digest we’ll break down all the most important CSDO outcomes from every month, so let’s dive into November!  DAO-Wide Updates During November, we held a Stewards Council election! The Stewards Council is a group of nominated Stewards tasked with reviewing budget proposals, coordinating high-level decisions that impact the DAO as a whole, and ensuring a collective vision for Gitcoin. All the nominations were submitted by Workstream Leads, after which we did the first quadratic voting ever on Snapshot!. You can get more details about the process and results of the election from our blog post. You can also check out the full proposal for the V2 of the Stewards Council here.  Proposals  Pods Pods were ratified, and will become a new method of collaboration within the DAO! Pods are an experiment in cross-workstream collaboration. They are a meme to help us codify the best practices of cross-workstream collaboration and to help give this networked work 1) a home outside of the individual workstreams and 2) a consistent voice within the DAO. You can get the full rundown of Pods and how they work on their notion page. You can read the full passed proposal here.  Budgets The S16 Budgets went live on Tally! This is the last step for workstreams in the current budgeting process. Here are the budgets for each workstream:  GPC  Tally Snapshot   DAO Ops  Tally Snapshot   PGF  Tally Snapshot   MMM  Tally Snapshot   FDD  Tally Snapshot     Key Discussions & Thoughts A decision was made to conduct salary evaluations and reporting across the DAO - Stewards have been expressing increasing amounts of concerns over the DAO’s financial stability in a worsening bear market, and a report demonstrating that our budgets align with the market and are consistent across workstreams will help during next budgeting season. DAO Ops’ Saf will be reaching out to workstreams for salary data, and comparing to data on OpenComp. PGF’s Janine highlighted PGF’s efforts in getting community input on the strategy of the Grants Program in the community-driven Protocol future. There is a tradeoff between ensuring as many voices as possible are heard, and creating factions within the community with competing interests, so how we approach these conversations is highly strategic.You can relisten to the DAO Vibes session here. MMM’s CoachJ is driving the development of a “Single Source of Truth” resource for contributors so that everyone has the information they need to do their jobs. Better information sharing at MMM has been game-changing to their team, and applying those learnings across the DAO are very welcomed. While there were initial concerns from the PGF team about a potential partnership, PGF’s Ben West’ thinking here is that the mentioned company will spend this money anyways - so why not make it a democratic and community-driven process? PGF will be developing a statement on this partnership to share with the community and a strategy doc outlining how/why we choose to pursue partnerships with certain orgs and not others. The $500k has been committed for the year, but the round won’t be run until we are more comfortable with potential impacts on brand/community. Work continues on the DAO Operating System, an initiative that impacts all workstreams in the DAO. You can check out this miro board to see what we’re doing to ensure operational efficiency at every level of the organization. FDD’s Joe shared the workstreams thoughts and insights surrounding economic risk balancing. They highlighted what we currently do vs what we could be doing. You can see their thoughts on this miro board. PGF’s Janine is continuing work on a pre-eth Denver retreat for external Gitcoin supporters. We’ll be hosting an IRL retreat before the Schelling Point Conference and EthDenver for core community members who have supported Gitcoin historically, been champions of public goods for the good of our broader community, and leaders who want to commit to funding and fostering projects in their community with positive sum games with a priority around protocol partners. With the newly-found cheaper location, ticket sales, and just a few sponsors, we should be able to cover the full cost of the event. Note: This event is not intended for contributors, and instead is focused on external Gitcoin supporters. We are working on doing something separate for Gitcoin contributors. For more information on how these discussions went, you can check out all of the CSDO Meeting Notes to read more, or the Gitcoin Transparency YouTube Channel to watch recordings of CSDO calls! And that’s it for this month! Keep checking back monthly for future editions of the CSDO Digest! ",
                    "links": [
                        "https://snapshot.org/#/gitcoingov.eth/proposal/0x5543373d5748b4145b3a8a2cf8ecbf105fcb14d9b136f49134cd51bb4b8f6c75",
                        "https://go.gitcoin.co/blog/gitcoin-announces-the-results-of-the-first-ever-quadratically-elected-steward-council",
                        "https://gov.gitcoin.co/t/proposal-v2-of-the-steward-council/11639",
                        "https://www.notion.so/gitcoin/Pods-957596edb1b94236a3d76c7eae10c17d",
                        "https://www.notion.so/gitcoin/Pods-b2f019d9c5fa4944a9782b02cd511585",
                        "https://www.tally.xyz/gov/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/40",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x974724227df2dcd1659379651886364eee441c24ff96ed0e0b2ee6395712408d",
                        "https://www.tally.xyz/gov/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/41",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x08bc5d61cf0e939b333187625eb2f3dce3a630a328db2b76f4776107cf6612c3",
                        "https://www.tally.xyz/gov/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/42",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x63e139b75e52843ce6af2e684101025ba2f88edf80775397927a875d9617b789",
                        "https://www.tally.xyz/gov/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/43",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x35010aec1b8a754dc250ac714c6b3c7337663d1d82a601537eb72f3afee99249",
                        "https://www.tally.xyz/gov/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/44",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xc49ae9a62e6b0ad1652adc115886a0a245d52c0035238bb9bcb9e055cb51c568",
                        "https://www.youtube.com/watch?v=wy4OUh2jiMQ",
                        "https://miro.com/app/board/uXjVPDpwv9o=/",
                        "https://miro.com/app/board/uXjVPI9Cv44=/",
                        "https://www.notion.so/gitcoin/ae55433c4f834a249b6936f6f9aa8d18?v=1a740581545c4946970ba8985b0c225a",
                        "https://www.youtube.com/playlist?list=PLdGQKwXzBAceH-ewgFy9nRPbjAk_Rj5n7",
                        "https://gov.gitcoin.co/t/digest-46-gitcoin-x-unicef-alpha-round-has-surpassed-25k-in-donations-with-one-week-to-go/12360"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.06418910950161
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Vega",
                    "index": "#2",
                    "likes": "1",
                    "time": "14/12/2022-05:27:40",
                    "content": " a report demonstrating that our budgets align with the market and are consistent across workstreams will help during next budgeting season.  Wait - Let me get this straight – You all decided to commission a report to show that your budgets align with the market, before even analyzing the data that would show if that is true or not?  How is that possibly legitimate?  Why not start with a market analysis and then decide the conclusion based upon that information? If you all were sincere in comparing Gitcoin’s spend to other projects, you would have said something like “We have heard the stewards feedback about budgets and will be launching an initiative to further digest the feedback along with market data, with the intention of creating financial stability for the DAO, and will be adjusting spend accordingly”. A charade of a market analysis to justify the current cost structure with a preordained outcome only harms Gitcoin.  DAO Ops’ Saf will be reaching out to workstreams for salary data, and comparing to data on OpenComp.  Does OpenComp have a large dataset of public goods DAO compensation data on it?  If not, which comparables will you be using for the analysis?  Will you be comparing compensation data to massively profitable for-profit orgs, or to non-profits?  Stewards have been expressing increasing amounts of concerns over the DAO’s financial stability  If financial stability of the DAO is the primary concern of the Stewards, do you have any plans to actually address the financial stability of the DAO? ",
                    "links": [
                        "https://gov.gitcoin.co/t/improving-dao-community-relations-long/12484",
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442/9",
                        "https://gov.gitcoin.co/t/contributor-compensation-audit/12750/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.470864661654136
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Vega",
                    "index": "#3",
                    "likes": "1",
                    "time": "14/12/2022-05:31:41",
                    "content": "@griff What would make a legitimate budget analysis in your opinion? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Salvador",
                    "index": "#4",
                    "likes": "1",
                    "time": "14/12/2022-17:31:34",
                    "content": "    kylejensen:  Pods were ratified, and will become a new method of collaboration within the DAO! Pods are an experiment in cross-workstream collaboration. They are a meme to help us codify the best practices of cross-workstream collaboration and to help give this networked work 1) a home outside of the individual workstreams and 2) a consistent voice within the DAO.   Are there any plans to shift the budgeting process to focus on PODS instead of workstreams? Workstreams are so large and unwieldy its hard to evaluate their massive budgets against the many outcomes they create.  PODS as defined by Orca seem like they’d be a much smaller and less unwieldy unit to evaluate in budgeting season. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.762003148366785
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#5",
                    "likes": "0",
                    "time": "14/12/2022-19:41:13",
                    "content": "Hello, thank you for the thoughtful feedback! Tagging @krrisis as he would be best suited to answer your questions here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#6",
                    "likes": "0",
                    "time": "14/12/2022-19:41:49",
                    "content": "Tagging @safder for visibility ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#7",
                    "likes": "1",
                    "time": "15/12/2022-16:53:21",
                    "content": "    Vega:  Wait - Let me get this straight – You all decided to commission a report to show that your budgets align with the market, before even analyzing the data that would show if that is true or not? How is that possibly legitimate? Why not start with a market analysis and then decide the conclusion based upon that information?   This was phrased poorly in the write up. The review consists of two parts. Part 1 - Have the workstreams spent the funds they received as planned and have clear accounting of how it was spent? Part 2 - Have the workstreams gone through the compensation leveling review that Saf has done with a few workstreams already. Yes, this uses open comp. I do not know of any analysis looking at whether our salary levels are in line with other non-profit grants giving DAOs. I have a hunch that there are only a few and we are aware of them, therefore making an analysis of the market in this way somewhat unnecessary. I doubt your intention is to argue about a few hundred dollars or even a few thousand for a contributor to audit workstreams in this fashion. I am hearing that you are concerned that Gitcoin is paying contributors more than is necessary. Additionally, I’m hearing frustration at thinking that this report was a backwards analysis generated to validate our current pay rates. Is this correct? If I have accurately articulated your concerns, then your concerns are totally valid, but likely unrelated to the analysis/report reference here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.971590909090909
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#8",
                    "likes": "0",
                    "time": "15/12/2022-17:06:38",
                    "content": "    Salvador:  Are there any plans to shift the budgeting process to focus on PODS instead of workstreams? Workstreams are so large and unwieldy its hard to evaluate their massive budgets against the many outcomes they create. PODS as defined by Orca  seem like they’d be a much smaller and less unwieldy unit to evaluate in budgeting season.   Nothing that is clearly articulated and agreed as a likely path at this time, but we have had many conversations about the future direction and financial sustainability of Gitcoin. We are primarily focused now on launching the Grants Protocol successfully. As this happens over the next few months, we will begin really diving into the hard choices and changes that will need to be made to best support the ongoing success of Gitcoin. The conversations are happening now, but it is a very risky move to make major changes before the protocol is successfully launched. Here is a little more on the state of the DAO. Gitcoin Updates summarized ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-updates-summarized/12337"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.904017857142857
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#9",
                    "likes": "0",
                    "time": "20/12/2022-22:25:55",
                    "content": "Really appreciate the concerns voiced here and very stoked that we have engaged Stewards to keep us accountable on the decisions being made at CSDO!     Vega:  Wait - Let me get this straight – You all decided to commission a report to show that your budgets align with the market, before even analyzing the data that would show if that is true or not? How is that possibly legitimate? Why not start with a market analysis and then decide the conclusion based upon that information?   Market analysis is included as a part of this report, and conclusions will be drawn based on this information, as you suggest! Sorry this wasn’t more clear.     Vega:  A charade of a market analysis to justify the current cost structure with a preordained outcome only harms Gitcoin.   The market analysis intends to show that our resource allocation, which consists >90% of contributor compensation, is responsible and in-line with the labour market. What it doesn’t show is that the resources being deployed are in fact necessary and the most efficient way to achieve our shared goals. This is currently done through our quarterly budgeting process, where workstreams demonstrate how resources were used in the previous season, and how they will be deployed in the next. We acknowledge that the existing budgeting process doesn’t make it very simple for Stewards to engage with the direction-setting process, and as such we hope to also have a redesigned budgeting process for next season’s funding requests.     Vega:  Does OpenComp have a large dataset of public goods DAO compensation data on it? If not, which comparables will you be using for the analysis? Will you be comparing compensation data to massively profitable for-profit orgs, or to non-profits?   The dataset of “Public Goods DAOs” isn’t large enough to be a legitimate benchmark, however OpenComp uses data from thousands of data sources (employers) in a variety of industries. We are not benchmarking to FAANG/high CoL area tech-company salaries, but we also don’t think non-profits’ notoriously exploitative pay models are something we should aspire to match. We hire highly talented contributors who are value-aligned and often giving up higher-paying (and often more stable/predictable) opportunities in other industries to work at Gitcoin. We believe they should all be compensated fairly, and benchmarking comp to a large, nation-wide (US because this is where a large majority of our team is based) database is the best way to ensure fairness while being responsible with our use of treasury. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.759628851540616
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Vega",
                    "index": "#10",
                    "likes": "0",
                    "time": "27/12/2022-22:54:32",
                    "content": "    DisruptionJoe:  Additionally, I’m hearing frustration at thinking that this report was a backwards analysis generated to validate our current pay rates. Is this correct?   It is wrong that this analysis doesn’t attempt to figure out a sustainable pay model, only justify the current pay rates.  It is also wrong that the community was not consulted on the pay models.  It is wrong that the analysis is designed backwards to justify the status quo.     safder:  we also don’t think non-profits’ notoriously exploitative pay models are something we should aspire to match.   Who decided that non-profit pay models are exploitative?  Is that a position of Gitcoin?  Was the community of GTC holders consulted on this decision?    If not, what give this position legitimacy?     safder:  We believe they should all be compensated fairly   As a GTC holder, I believe GitcoinDAO should stop fucking up its enormous lead from years ago when Vitalik blessed it and deliver a protocol that distributes value at scale.   The protocol should accrue value at a scale that justifies it’s $130 million market cap (which used to be over $ 1 billion, and is declining week by week).  And contributors to Gitcoin can be rewarded with generous pay when you do so (but not beforehand). The recent protocol alpha rounds are a good start.  But they’re just a start.     safder:  The dataset of “Public Goods DAOs” isn’t large enough to be a legitimate benchmark   According to this post it looks like there are plenty of other public goods funding DAOs!  And many of them are WAY more capital efficient than GitcoinDAO.  I hope you include those in your analysis. I hope this analysis is scrapped altogether or reworked to be legitimate. The market is going to be bear for a while.  I don’t see anything on gov.gitcoin.co that makes me think people who work on Gitcoin have a serious plan for getting through the bear market.  This downward spiral is NOT GOOD.  gtc_usd.jpeg1560×804 62.2 KB  ",
                    "links": [
                        "http://gov.gitcoin.co",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/0/0302f952f5ef0db101f158ac79356e38cc091848.png",
                        "https://gov.gitcoin.co/t/contributor-compensation-audit/12750/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.796807359307359
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#11",
                    "likes": "1",
                    "time": "02/01/2023-10:04:03",
                    "content": "    Vega:  It is wrong that this analysis doesn’t attempt to figure out a sustainable pay model, only justify the current pay rates. It is also wrong that the community was not consulted on the pay models. It is wrong that the analysis is designed backwards to justify the status quo.   It sounds like your answer here is YES, you do think that the analysis was done in a backwards way to justify the current pay rates. (For clarification, I was not involved in this and was not countering your argument, only seeking to make sure I/others understand.) I do agree that something like connecting pay to GTC price would be a potentially useful consideration. Maybe something like half the pay in USDC and half paid in GTC at whatever price it is so salaries adjust with the value of GTC? Is that the type of solution you might be suggesting?     Vega:  The market is going to be bear for a while. I don’t see anything on gov.gitcoin.co that makes me think people who work on Gitcoin have a serious plan for getting through the bear market. This downward spiral is NOT GOOD.   Part of what you are experiencing is caused by how much time and effort went into operating grants rounds GR15 and prior. This season the DAO is focused on launching the protocol. This is largely why we voted to scrap the old cGrants platform and fully move to the protocol even over having a GR16 round in December. It gave us time to deep dive in workshopping and understanding these deeper problems which we are acutely aware of, but have not been able to prioritize. We have been able to use the extra time to meaningfully work on these issues. Personally, I respect both the ability of the community to help with the brainstorming process AND the need to have people closest to the problem be the ones working on it. Until we share where we are at with our business planning for 2023, it will be difficult for you to judge how well the time has been spent. However, I don’t see any problems with us working out ideas between people close to them, then sharing with broader and broader segments of the community. We absolutely do know the urgency of the problem of this downward spiral. The number one problem to solve is launching the protocol. Number 2 is how do we ensure it’s continued success.  Image 2023-01-02 at 10.38.27 AM1346×1040 117 KB  Lately I’ve seen a lot of people suggesting that Giveth is a better model for paying the contributors because they have launched many products. How would you connect that as being true while also looking at their token?  Image 2023-01-02 at 10.06.29 AM1662×1363 84.8 KB  Here is Uniswap. Our weekly average high was around $14 (not a daily high that was a parabolic liquidity spike squeeze with a little fomo reflexivity on top). This shows me that an established project like uniswap at a 6-8:1 devaluation so forth. We are closer to a 10:1. Polygon is the best I could find sitting at about a 2-3:1  Image 2023-01-02 at 10.08.31 AM1649×1583 110 KB  We all know AND USE the Graph GRT which is sitting around 20-40:1  Image 2023-01-02 at 10.48.24 AM1643×1483 100 KB  My point here being. What do we define as success? If we are talking about a team maintaining market value, how does one suggest that the pay structure of the Giveth team is desirable when they have suffered a 60-90:1 devaluation? While I agree with your point about the analysis being done in a way that could have been better. It seems like there are 2 issues you are discussing here.  The argument with the incorrect articulation of the analysis and it’s purpose. For this, I feel there isn’t a need to push it further because it specifically was the straw man incorrect articulation that is being argued. This does bring us to the real issue which is point 2… How might we justify the 2023 business plan for Gitcoin as whole. Including pay rates, budget processes, and revenue/growth forecasting, etc.? For this, lets continue the conversation in the thread linked here.  One question: Have you attended any of our steward calls or DAOvibes/Community calls? I’m not able to decipher how much is based on us not publicly documenting as much as we should or could vs making the wrong decisions. Knowing how much you are able to use what we are making available could inform us on how to improve these efforts. ",
                    "links": [
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/2/278948afd3c6b278809b7b76e49f6ffdcc197ef4.jpeg",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/b/bea83b15b37d5a58b920b66e6def5166a1bb4278.jpeg",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/4/46b79589a842c6a8ded1890819ce4598e628de4b.jpeg",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/b/b9190d7f3a9339cd0dbf566e39c721a92937956b.jpeg",
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.446237646001797
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Vega",
                    "index": "#12",
                    "likes": "0",
                    "time": "02/01/2023-15:23:02",
                    "content": "    DisruptionJoe:  Lately I’ve seen a lot of people suggesting that Giveth is a better model for paying the contributors because they have launched many products. How would you connect that as being true while also looking at their token?   We know from this thread that Giveth spends roughly 10x less monthly than Gitcoin, so it’s 10x less vulnerable to running out of runway due to a downturn. It’s also much newer than Gitcoin, and hasn’t had the benefit of being blessed by Vitalik with blog posts on vitalik.ca. (To add insult to injury, Giveth seems to be shipping protocols much faster than Gitcoin on way less budget.)    Is Gitcoin over its skis? should we hold spending flat while addressing unavoidable risks?   Giveth spends around $120k a month with 40+ paid contributors, ~50% being full time, and GTC is spending 10x that, but it is not an org 10x the size. We are very inefficient with our resources IMO, and can do more with less, but there is no motivation to move that direction, because it is hard!        DisruptionJoe:  My point here being. What do we define as success?   I think that this post covers a good success case:    A BULL/BEAR case for Gitcoin/GTC in 2023   GTC In my opinion, the bull case for GTC basically boils down to:  Grants will be successful & have $billions/year in capital going through it. Passport will be the foundation of a new sybil resistant economy in web3. Governance rights to manage these systems will somehow become valuable. GitcoinDAO will survive to get to that point.    The official purpose and essential intents are a good goal post as well.    Update: GitcoinDAO's Adopted Purpose and Essential Intents   The Purpose of Gitcoin To empower communities to fund their shared needs. The Essential Intents of Gitcoin  Protocol Adoption   Build a widely adopted, modular Grants protocol that creates a flourishing ecosystem of funding mechanisms. Build a widely adopted, modular Pluralism Passport protocol that creates a flourishing ecosystem of network effects around Decentralized Society.   Financial Sustainability   Have a comprehensive, diversified strategy for financial stability of the DAO in order to effectively achieve our mission.   DAO Organization   Create and promote clear and engaging rituals, communication channels, and messaging that build emergent shared context among GitcoinDAO’s contributors, stewards, and supporters.   Grants Program Success   Enable a successful grants protocol launch by dogfooding it internally and supporting ecosystems in adopting it. Continue to support the Ethereum ecosystem and public goods in web3 and beyond through Gitcoin-led rounds.         DisruptionJoe:  One question: Have you attended any of our steward calls or DAOvibes/Community calls? I’m not able to decipher how much is based on us not publicly documenting as much as we should or could vs making the wrong decisions. Knowing how much you are able to use what we are making available could inform us on how to improve these efforts.   I’ve attended DAO vibes as a lurker, but not stewards calls. How do I get into those? It’s pretty clear to me Gitcoin is bloated, wasteful, and ineffective.  It’s spending $1million/month and not meeting it’s own stated essential intents, and the market downtrend is clear.  When confronted with this feedback, there is SO MUCH JUSTIFYING OF THE STATUS QUO that comes from insiders,  I don’t think my attending these calls will (and making me an insider too) will change any of my opinions.  It’s much more scalable for insiders to start responding to the market than to convert all of the market to insiders. I want so badly to be bullish on GTC, but what I see on the governance forums is not promising. ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442/1",
                        "https://gov.gitcoin.co/t/update-gitcoindaos-adopted-purpose-and-essential-intents/10984/1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.644698077263866
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#13",
                    "likes": "3",
                    "time": "02/01/2023-15:37:02",
                    "content": "    Vega:  We know from this thread that Giveth spends roughly 10x less monthly than Gitcoin, so it’s 10x less vulnerable to running out of runway due to a downturn. It’s also much newer than Gitcoin, and hasn’t had the benefit of being blessed by Vitalik with blog posts on vitalik.ca. (To add insult to injury, Giveth seems to be shipping protocols much faster than Gitcoin on way less budget.)   Right. I get all those arguments, but I don’t understand when you connect it to the token price because the opposite of the desired effect is happening. The market seems to think that all the shipping and lower production costs of Giveth aren’t worth it. I’d like to understand how you decide that our model for payment is wrong. (I agree that it is not optimal.) Perhaps you are saying that the head start and early Vitalik endorsements are entirely responsible for Gitcoin having lost an order of magnitude less value on the market than Giveth? I tend to think the macro-environment is driving all of it, but relative changes do matter. BTW. Per your last paragraph, this IS NOT JUSTIFICATION. It is attempting to understand logic with an inherent paradox.     Vega:  I think that this post covers a good success case:    A BULL/BEAR case for Gitcoin/GTC in 2023   GTC In my opinion, the bull case for GTC basically boils down to:  Grants will be successful & have $billions/year in capital going through it. Passport will be the foundation of a new sybil resistant economy in web3. Governance rights to manage these systems will somehow become valuable. GitcoinDAO will survive to get to that point.    The official purpose and essential intents are a good goal post as well.   I do highly agree with the Bull/Bear case post being great. Everyone should read it and we should move the continuation of the 2023 business plan there. The essential intents are good, but even in the exercises we did to create them we didn’t follow the guidelines.    A model for Gitcoin sustainability   To me, none of these are very good as essential intent because they are not clear and achievable. They are too high-level. Here are my suggestions for how we can use these intents to clearly move Gitcoin toward sustainability. I would slightly change the buckets Bucket 1 - Launch and grow the components of a successful Grants 2 flagship protocol A successful grants 2.0 protocol is each of the components having been launched with well documented SDKs and clear growth metrics. The components include the fixed and modular components. Fixed components include the grants registry, the identity registry, and the round manager (pool registry). The round manager is where communities can choose their own “funding stack” of modular components. Standards, protocols, modular design, and composability all benefit evolutionary systems because it limits the design space so new builders can experiment where the most impact is available. A funding stack includes the user and grant moderation (regulation), the funding mechanism, and the discoverability of grants on the Gitcoin UI (only because it will be the only one at launch). These spaces are what will create the most innovative solutions. Here are my essential intents for this objective.  Launch the grants registry, user registry, and pool registry (3 binary goals)  If these are completed it means we hit our base goal of shipping a flagship product (Could clear up the wording to indicate actual usage, but I don’t think semantics are the issue here)   Identify and set growth targets for each to use during season 15 (ie. 10k Passport non-sybil passport holders, 5000 grants on registry, $50 million in pooled funds)  Clear growth goals to be assigned to workstreams for accountability   Identify and set growth targets for 1 click funding stack permutations available (ie. 12 funding stack permutations)  The value proposition is that GTC will catalyze an increase in the accessible experimentation surface for any community to fund their shared needs. Growing this experimentation surface can be measured by permutations available on the Gitcoin UI for easy use by any community.    Bucket 2 - Improve the sustainability of Gitcoin The sustainability of Gitcoin requires capital contributors to continue seeing the velocity of GTC lower and innovative solutions shipped. This means the communication from contributors to stewards who control funding decisions is delivered in an effective way and that the contributors efforts are substantial. To do this Gitcoin must create a portfolio diversification thesis, a value capture thesis, and the roadmaps and tools to implement them. Diversification is simple actions and tools which can be handles by a delegated authority with oversight. Roadmaps and implementation are simply design and engineering. Value capture is unexplained at this point. Here I will attempt to connect this to my long intro. GTCs sole utility should be investing in workstreams, structured and unstructured, via Gitcoin governance. Gitcoin should use quadratic weighted staking to reward people for governance participation. The key is that the staked GTC would not only be eligible for voting to direct funding in GitcoinDAO, but it would also be used to participate in the governance of the components of the grants 2.0 protocol. Each component of the funding stack could launch its own token for economic rights without governance (or with some portion) of the participation in governance. For example, Gitcoin Passport would fuse with the sybil detection DAO concept and launch a token economy to incentivize the acceleration of network effects in its adoption. It could reward stamp providers used by reader apps based on how many uses the reader gets or by funds passed through it’s resistance algorithm. It could reward sybil hunters and data scientists in a model contest. The grants and pool registries could do the same in their own way. Then Gitcoin could invest in the first solutions available for the composable components such as a decentralized grant review protocol or a revenue generating business consulting communities on using the protocol. If this sounds familiar, it is the roadmap of ethereum ecosystem expansion. Gitcoin currently has a huge information asymmetry we can collectively take advantage of to bring sustainability. We are building a city and have first dibs on ownership of the public utilities (decentralized grants eligibility reviews) and private businesses (UI generation and round consultation as a service). The best part is the monopolies are ethical because they are openly accessible through Gitcoin. Maybe we monopolize most solutions and SALSA tax their value into future rounds… That said, here are my other essential intents:  Have > 2 years of runway in stablecoins & runway time is INCREASING  An R(n) growth rate over 1 means sustainability   Investments in Gitcoin built or used businesses & protocols > Gitcoin investments in non-gitcoin built or used businesses & protocols  Means we invest at least $100k in our own dogfooded solutions (ie workstreams become value capture factories)   Improve steward satisfaction score from x to y  Implication of needed communication & process fixes around this role   Improve contributor satisfaction score from a to b  Implication of needed improvements self scored by those in the role    In conclusion My intention here is to share my personal perspective and influence others’ thinking. I don’t intend to prescribe what is correct or incorrect, but rather to share the perspective I hold. I am HIGHLY aligned with the essential intents already proposed and would vote to ratify them to the DAO today.   As you can see here and even here, I’m pro-exploration of different and better models. I’d love to connect if you have time. I really do appreciate you and other community members participating in the discussion.  dm me and I can send a calendly link. ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-model-for-gitcoin-sustainability/10757/1",
                        "https://gov.gitcoin.co/t/the-new-grants-protocol-flywheel/11769",
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442/19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8641443001443
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#14",
                    "likes": "2",
                    "time": "04/01/2023-14:47:44",
                    "content": "    Vega:  I’ve attended DAO vibes as a lurker, but not stewards calls. How do I get into those?   You can apply to become a Steward by applying here     Vega:  When confronted with this feedback, there is SO MUCH JUSTIFYING OF THE STATUS QUO that comes from insiders, I don’t think my attending these calls will (and making me an insider too) will change any of my opinions. It’s much more scalable for insiders to start responding to the market than to convert all of the market to insiders.   I think Joe & Saf really went above and beyond to respond to some of your criticism outlined above so I will not add to this. The tl;dr of their responses to me is: “Gitcoin is working extremely hard to launch its protocols, to be transparent, and to be efficient as a DAO. We know however we have a lot of work to do and appreciate your feedback.” And I hope this message comes across. Being an ‘insider’ gives you another opportunity to share constructive feedback by having more direct access to all the things happening within Gitcoin, which can help you truly a difference, which might be useful, as you clearly feel we are not doing a great job. So, welcome! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.420138888888889
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Vega",
                    "index": "#15",
                    "likes": "2",
                    "time": "04/01/2023-19:16:24",
                    "content": "    krrisis:  Being an ‘insider’ gives you another opportunity to share constructive feedback by having more direct access to all the things happening within Gitcoin, which can help you truly a difference, which might be useful, as you clearly feel we are not doing a great job. So, welcome!   I don’t think you understood my point here =>     Vega:  I don’t think my attending these calls will (and making me an insider too) will change any of my opinions. It’s much more scalable for insiders to start responding to the market than to convert all of the market to insiders.   So let me try again. Trying to convert any critics into insiders is a fundamentally flawed way of operating a DAO. There is a great Bankless podcast on this that just live-streamed yesterday.  Here is a timestamped video explaining why.   And here is a screenshot of that timestamped spot.  bankless1546×934 83.5 KB  Let me again restate my core point: Trying to convert any critics into insiders is a fundamentally flawed way of operating a DAO. I will now expand this into it’s reasoning: The more Gitcoin insiders 1. have “Material Non Public Information” and the more 2. Gitcoin insiders are making decisions with their agency on behalf of GTC holders, the more the risks accrue to the project. Now that we’ve revisited this first principle, lets revisit my core objection above. Gitcoin insiders commissioned …     kylejensen:  a report demonstrating that our budgets align with the market and are consistent across workstreams will help during next budgeting season.   Do you see now why it is deeply problematic that Gitcoin insiders are fixing their own salary analysis to justify it in budgeting season without consulting GTC holders about the parameters of this analysis?   This is a centralization risk and you are creating misalignment between GTC holders (who have little context but have a vested interest in seeing the DAO perform) and insiders (who make contextual decisions on behalf of the DAO and want higher compensation from the DAO). Here is a great tweet from @lefterisjp that makes this critical point: https://twitter.com/LefterisJP/status/1521758439348838400      krrisis:  Being an ‘insider’ gives you another opportunity to share constructive feedback by having more direct access to all the things happening within Gitcoin, which can help you truly a difference, which might be useful, as you clearly feel we are not doing a great job. So, welcome!   With this foundation of knowledge, I will repeat my asks:  I don’t think my attending these calls will (and making me an insider too) will change any of my opinions. It’s much more scalable for insiders to start responding to the market than to convert all of the market to insiders.  Please reconsider this way of operating Please put the parameters of the salary analysis in front of GTC holders.  ",
                    "links": [
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/9/9a6e28ec7e214da91db1b9fac6a51648427fd0d4.jpeg",
                        "https://twitter.com/LefterisJP/status/1521758439348838400",
                        "https://gov.gitcoin.co/t/improving-dao-community-relations-long/12484/5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.590725806451613
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/february-csdo-digest/13140",
            "title": "February CSDO Digest ",
            "index": 13140,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#1",
                    "likes": "3",
                    "time": "01/03/2023-16:34:36",
                    "content": "Many of you may know about our Cross-Stream DAO Operations, or CSDO, powerhouse team. If you don’t, CSDO is all about creating coherence. We provide the space and conditions for higher-stake cross-workstream decisions to be vetted and discussed, enabling our DAO to efficiently and responsibly fulfill its purpose. With all the world-regenerating we’re doing - from questioning the foundations of our knowledge to building scalable infrastructures for public good - it’s easy for things to get lost. That’s why we’re introducing this monthly CSDO Digest! We’ll be breaking down all the most important CSDO outcomes from every month, so let’s dive into February!  DAO-Wide Updates  DAO Ops Dissolution In S17, DAO Ops will be dissolving and some of its remaining initiatives will be moving into new workstreams or CSDO. These changes include:  Using the CSDO budget to cover Steward Council payments, Moving People Ops’ coordination into CSDO and sunsetting the Thursday Gathering Hour calls after February 23rd, Moving professional development coordination into workstreams, and Transitioning Support into the Allo workstream.  CSDO was aligned in agreement on all these changes. You can find more info on the dissolving of the DAO Ops workstream, as well as the full conversation that led to this decision, here.  Proposals  Budget Proposals Budget Proposals for Season 17 are getting posted to Tally! You can read each workstream’s integrated budgets (linked below) to get more information on fund allocations, and don’t forget to vote! Allo Budget Proposal Passport Budget Proposal MMM Budget Proposal PGF Budget Proposal DAO Ops Budget Proposal FDD Budget Proposal  Key Discussions & Thoughts  Most Important Things CSDO spent a strategy meeting discussing the 3 “most important things” the DAO should be focusing on over the next one to six months. The first most important thing for the DAO is the Allo protocol. Getting the protocol launched is the top priority, with efforts surrounding the protocol’s success being a close second. The second most important thing for the DAO is the grants program, and the third is Passport. These will be the top areas of focus as we move through the next few months. You can check out the notes, Miro exercise, and call recording here.  Grants Stack / Allo Protocol Allo’s Nate walked the group through a status update on the Grants Stack / Allo roadmap! Future focuses include work on payouts contracts, developer community engagement, and creating a project reputation system. Contributors from MMM, Allo, & PGF will be syncing to define the user experience and next steps for launch. You can check out the roadmap as well as get a wealth of information on Grants Stack & Allo Protocol here. Foundation/Passport’s Kyle shared the Allo Protocol & Grants Stack readiness guide, which outlines their progress and the upcoming steps and announcements being done to get Allo Protocol and the Grants Stack ready for launch. You can take a look at the guide here.  Other Discussions Foundation/Passport’s Kyle raised the question to define when a workstream is no longer a workstream, given some workstreams are winding down. The discussion led to the understanding that most workstreams will naturally slow down as the work is moved to new homes, but a special emphasis needs to be placed on retaining best practices honed by the original workstreams. FDD’s Alex brought up the topic of “guilds” and best-practice as workstreams begin to dissolve. The idea of “guilds” and “communities of practice” have been popping up all over the DAO, and will become a larger topic of discussion in the future. Foundation/Passport’s Kyle raised the question of how to incorporate the feedback received from the Steward Council during Monday’s call. There have been some proactive efforts thus far, but more could be done. The group will be discussing this further in person at the retreat. FDD’s Joe started a discussion about transition partners to help the contributors of winding-down workstreams settle into their new homes. His suggestion was a WS lead take responsibility for the smooth transition, and help ease the contributors in. This conversation will be continuing asynchronously and throughout ETH Denver. FDD’s Alex shared FDD’s efforts to better understand how workstreams are sourcing and using data. As FDD dissolves, they hope to provide better data support to workstreams on a closer level. Reach out to Alex with any data questions you have! For more information on how these discussions went, you can check out all of the CSDO Meeting Notes to read more, or the Gitcoin Transparency YouTube Channel to watch recordings of CSDO calls! And that’s it for this month! Keep checking back monthly for future editions of the CSDO Digest! ",
                    "links": [
                        "https://gov.gitcoin.co/t/s17-proposal-dao-ops-budget-request-integrated/12741",
                        "https://www.tally.xyz/gov/gitcoin",
                        "https://gov.gitcoin.co/t/s17-proposal-integrated-gitcoin-allo-budget-request/12920",
                        "https://gov.gitcoin.co/t/s17-proposal-integrated-gitcoin-passport-budget-request/12727",
                        "https://gov.gitcoin.co/t/s17-proposal-integrated-mmm-budget-request/12733",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-gitcoin-public-goods-funding-budget-request/12742",
                        "https://gov.gitcoin.co/t/s17-proposal-dao-ops-budget-request-integrated/12741",
                        "https://gov.gitcoin.co/t/s17-proposal-integrated-fdd-budget-request/12738",
                        "https://www.notion.so/gitcoin/CSDO-Sensemaking-4-1e1cf2c07d194c1185406423de9d4664?pvs=4",
                        "https://www.notion.so/gitcoin/Grants-Stack-Allo-b650b50c91d14e43adacae14f3f2bd53?pvs=4",
                        "https://docs.google.com/document/d/1peEaDucPbbEyJJpdjwd0LmsPWJGU9duOYHKtGZL8d2Q/edit#heading=h.d1ez7f7gqwab",
                        "https://www.notion.so/gitcoin/ae55433c4f834a249b6936f6f9aa8d18?v=1a740581545c4946970ba8985b0c225a",
                        "https://www.youtube.com/playlist?list=PLdGQKwXzBAceH-ewgFy9nRPbjAk_Rj5n7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.272412393640843
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/chaselb",
                    "index": "#2",
                    "likes": "1",
                    "time": "02/03/2023-08:41:36",
                    "content": "Thank you for this! This summary was valuable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#3",
                    "likes": "0",
                    "time": "03/03/2023-04:58:45",
                    "content": "+1 to the value here. Thanks Kyle! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "265"
}