{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/articulating-gitcoindaos-impact-on-the-world/9994",
            "title": "Articulating GitcoinDAO's Impact on the World \\xf0\\x9f\\x8c\\x8e ",
            "index": 9994,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "12",
                    "time": "02/03/2022-21:09:46",
                    "content": "I wanted to take a moment and articulate the foundations of GitcoinDAO’s Impact on the World . In some of my recent writing, I’ve identified ImpactDAOS as a fundamental atomic building block of Regenerative CryptoEconomics.  ImpactDAOS are any DAO that have a positive externality to the world. In articulating our own Impact in this post, I hope we set an example that inspires other DAOs to do so too. And that doing so allows us to more fully understand our traction so far, as well as provide tangible articulations of areas where we could double down + create more impact.  1 - Social I think that first and most foundationally, GitcoinDAO is a social & memetic schelling point for people who want to use crypto to create a better world. The outcomes of this social substrate are numerous - you will see them at (1) ETHDenver, (2) Schelling Point, (3) Twitter spaces (4) other media, and in many other corners of the ecosystem.  Hopefully the tangible output of this is social connections & awareness of crypto for public good at the social layer of the ecosystem.  2 - Financial Secondarily, Gitcoin is a place for people who are using crypto to create a better world to receive financial capital. The primary mechanism for that is Quadratic Funding via Gitcoin Grants, but there are others. The outcomes of this financial substrate are numerous.  You can view the full list of supported projects here, but some highlights include prominent projects like: Uniswap, Yearn Finance, 1inch exchange, Prsymatic labs, walletconnect, etc. You can see a visual of our financial impact on https://gitcoin.co/results:   3 - Intellectual The third level of impact is intellectual - we are the largest implementation of Quadratic Funding in the world.  (There are others who are doing amazing work here too!) Because of this, GitcoinDAO is a place where ideas from QF theorists come in contact with reality, allowing us to push forward QF as a mechanism both inside of web3 and outside of web3. If GitcoinDAO is successful, there could also be secondary effects here in the form of more sybil resistence in the ecosystem.  4 - Experiential Because the last Gitcoin Grants round had such high resolution data - about 474k transactions in it, we now have a deeper understanding of which projects in the community the values. The goal of each QF round is to create a high resolution picture of our collective intelligence. Here is what the preference map for GR13 looked like.  Each node in the network is a user or a grant, and each edge is a transaction.  With this data set, we have a deeper understanding of what projects everday community members care about, a novel wisdom arising from the experiential capital of collective action.  Summary If we are to visualize these forms of capital via the 8 forms of capital (pictured below)…  1G70pyAnQfPm8gc8JyMATPoFqMBK-GOzQM1rskZC-xQbHijPx5HX3xQVb2yPeAKRVYEhJkdp4oh6-jZ7Y7FGstXVL698xoB70QztqmJ5eFBQIj3GNHpeUnhq8Q1Exi3jRneJTm6l780×488 107 KB  … If we were to try and stack these foundations of GitcoinDAO’s impact on the world, this is what I think it looks like:  Screen Shot 2022-03-02 at 10.55.42 PM1064×642 148 KB  I find that these visualizations to be useful when thinking about GitcoinDAO’s impact on the world. If GitcoinDAO were to go away one day, then I am comforted to know that the social, intellectual, experiential, and financial impacts that we’ve had on our mission would continue to propagate outwards into the ecosystem already. Obviously, the DAO has plans to increase it’s impact by launching a Grants 2.0 protocol, and has ambitions to do more volume in the future than in the past. But we should be proud of the the progress we’ve made so far.  It provides a floor on our impact on the world. ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-mission-vision/9421",
                        "https://greenpill.party/",
                        "https://wtfisqf.com/",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/coordination-party-kit/9231",
                        "https://docs.google.com/spreadsheets/d/1OsJ_nmN9mN-i_9h3Yj2mDfjvtsP1qvv3B1zcpER62dk/edit",
                        "https://gitcoin.co/results",
                        "https://gitcoin.co/results",
                        "https://twitter.com/glenweyl/status/1498785796492382208",
                        "https://www.economist.com/letters/2021/12/11/letters-to-the-editor",
                        "https://twitter.com/dtstimulus/status/1305838829245329408",
                        "https://proofofpersonhood.com/",
                        "https://twitter.com/owocki/status/1474746190314958849",
                        "http://www.appleseedpermaculture.com/8-forms-of-capital/",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/our-flagship-product-is-gitcoindao/10081",
                        "https://gov.gitcoin.co/t/passing-the-torch/10971",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://gov.gitcoin.co/t/roadmap-to-gtc-utility/10546/8",
                        "https://gov.gitcoin.co/t/discussion-gitcoin-visual-identity-branding/10023/4",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-8-2022/10032",
                        "https://gov.gitcoin.co/t/gitcoindao-as-a-generator-function-for-coordination/10078",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.838893097643098
                }
            ]
        }
    ],
    "group_index": "691"
}