{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/a-dao-has-no-ceo/9852",
            "title": "A DAO has no CEO ",
            "index": 9852,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "24",
                    "time": "08/02/2022-23:52:44",
                    "content": "Things are evolving fast at GitcoinDAO and our impact is growing. You love to see it. Gitcoin has a long history by crypto standards - having been around since 2017. Gitcoin Grants has been around since Jan 2019 and has run 12 rounds so far. GitcoinDAO has been around since May 2021. As we go through the Build/Measure/Learn Loop every Quarter, we learn more about our environment, ourselves, and how to accomplish our mission & live by our values. Every Grants Round I learn something new (sometimes the hard way  ). One thing that I’m continually sensing & internalizing over time is that my role has evolved as Gitcoin Holdings (the legal entity that launched the DAO) has evolved & as the DAO has grown. My role on May 24th 2021 was to be CEO/Founder of Gitcoin. After May 25 2021, as the DAO began to take shape and Gitcoin Holdings “parent”ed the DAO for the first few months, a separation occurred - I remained CEO/Founder of Gitcoin Holdings, but only a participant in the DAO. In all sincerity, I have always imagined that I’d ultimately be but one stakeholder of the DAO – with no root access. There are contradictions in this,  I’ve wanted to do so as soon as possible, but also not until it is responsible to do so. Gitcoin Grants is still run on the centralized platform I foolishly built centralized in 2017-2020. Whereas the DAO intends to build a completely decentralized Grants experience.  Im a big believer that part of the art of life is a constant readjustment to our surroundings, and so I am trying to embrace this change. In navigating this specific case, I seek to “build in public” - which is why you might see my research notes appear on gov.gitcoin.co (or wacky ideas on twitter) - to share this context. In this case - As I’ve studied how GitcoinDAO builds legitimacy and how that legitimacy is distributed to actors who act on behalf of the DAO, and as the DAO has gone through its own growth, the following thought is starting to crystalize: GitcoinDAO was created by Gitcoin Holdings, but it is not Gitcoin Holdings – in seeking decentralization of governance, computation, development, and economics - we should seek to separate the two as much as possible. As soon as I accept this extremely inconvenient truth, it starts to force several other hard downstream implications & questions:   DAOs don’t have CEOs. There is no legitimacy in authority, and control (or perception of control) is a liability if we are to go where I think we are going.   I of course remain completely committed to GitcoinDAO & it’s mission, but in what ways does tactical retreat from being involved in operations/decision making of the DAO serve the greater strategic direction of the DAO? How can I (and the others at Gitcoin Holdings) begin to separate ourselves from the DAO, such that we create space that allows the next generation of Leaders to emerge within & around GitcoinDAO?   How can we do so in such a way that if they fail, we are there to pick them up & reorient things? I can’t help but have the parent in me when I ask “How can we give them the psychological safety to try & experiment & learn, but also not make them complacent?”   How can we do these things without entrenching those new leaders over the long term? How do we create a culture where we always seek to decentralize power? Where we always seek to hire someone smarter than us & empower them to be the next generation of leadership in a beautiful decentralized fractal of growth & impact.   How can we do so in such a way that is otherwise responsible to our stakeholders?   What are the biggest areas of centralization debt & how can we pay them down as quickly & responsibly as possible?  Of course there is the centralized platform, but what else?   I do not have answers to these questions yet, but I would like to find them. C G Jung once said “To ask the right question is already half of the solution of a problem.” Two bits of context I might add:  Some of these questions are extremely hard not only professionally (there is no playbook for this) but personally. It is not an overstatement to say that Gitcoin’s mission has been my a large part of my waking life since 2017, and I must admit that Gitcoin is a big part of my identity - The last time I left a project I cofounded & scaled to millions of users I got extremely emo about it, and I’m trying not to do the same this time. TLDR - this transition is hard for me! I’m not going anywhere.  I love this mission & this DAO - and I’ll be here (in the role of Founder, but without wearing any CEO hat) as much as the DAO needs me.  Open to thoughts, either reply publicly below or DM me to share privately. ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-brief-history-of-gitcoin-from-2017-2022/9431",
                        "https://gov.gitcoin.co/t/gitcoin-grants-is-our-metronome/9310",
                        "https://twitter.com/owocki/status/1459903812135579655",
                        "http://gov.gitcoin.co",
                        "https://twitter.com/owocki/status/1459577744476585992",
                        "https://gov.gitcoin.co/t/building-gitcoindaos-legitimacy/9649",
                        "https://gov.gitcoin.co/t/consent-of-the-governed-and-legitimacy-by-process-in-gitcoindao/9778",
                        "https://gov.gitcoin.co/t/consent-of-the-governed-and-legitimacy-by-process-in-gitcoindao/9778/3",
                        "https://vitalik.ca/general/2019/05/09/control_as_liability.html",
                        "https://twitter.com/owocki/status/1463000229033111557",
                        "https://owocki.com/on-identity/",
                        "https://gov.gitcoin.co/t/wartime-dao-peacetime-dao/10228",
                        "https://gov.gitcoin.co/t/gitcoindao-starting-conditions-are-different-than-other-daos/10603",
                        "https://gov.gitcoin.co/t/gitcoindaos-final-form-maximum-coordination/10605",
                        "https://gov.gitcoin.co/t/where-is-the-fire-around-this-fire/10664",
                        "https://gov.gitcoin.co/t/hiring-freeze/10542",
                        "https://gov.gitcoin.co/t/gitcoin-state-of-the-dao-sep-2022/11540",
                        "https://gov.gitcoin.co/t/passing-the-torch/10971",
                        "https://gov.gitcoin.co/t/dao-compensation-sustainability/10604",
                        "https://gov.gitcoin.co/t/decentralizing-gitcoin-holdings-work-within-gitcoindao/11069/4",
                        "https://gov.gitcoin.co/t/discussion-series-what-does-gitcoin-look-like-if-we-are-successful-in-achieving-our-essential-intents/11209",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17-2022/10597",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862",
                        "https://gov.gitcoin.co/t/wartime-dao-peacetime-dao/10228/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.245816297899632
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/reza",
                    "index": "#2",
                    "likes": "2",
                    "time": "09/02/2022-12:29:31",
                    "content": "If you’re into books, I recommend reading “The Dream Machine: J.C.R. Licklider and the Revolution That Made Computing Personal”. This book provides an interesting history of how DARPA, IPTO, and various universities contributed/created personal computers, essentially liberating computers and people from the tyranny of big thick mainframes to what we take granted nowadays, sort of a decentralizing/democritizing movement. I hope you find answers for your questions(especially the 4th q) or at least get some valuable context on this. I’m personally fascinated by how the incumbent head of the IPTO was involved in directing the research and at the same time mentoring his successor and getting himself replaced by the next head. They ran the office for max 2 years, the first year was dedicated to directing research and funds allocation, and the final year choosing and mentoring the next head while doing the first year’s chores. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.133333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/cojocaru",
                    "index": "#3",
                    "likes": "3",
                    "time": "09/02/2022-13:13:22",
                    "content": "Thank you Kevin for your role in Gitcoin. We need you and will need you for very long. So be well cause we need you around. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.675000000000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/JonisJon",
                    "index": "#4",
                    "likes": "4",
                    "time": "14/02/2022-21:04:19",
                    "content": "Hey All - Jon co-founder of ShapeShift here, and now active community member of the ShapeShift DAO (but holding no formal role anymore) - I think I have some good insight to share on this topic and I think both Gitcoin and ShapeShift are in similar situations and have a lot to learn from each other on this subject. @owocki  -  a few thoughts on your thread from my perspective from decentralizing ShapeShift and going through some very similar questions and situations as I think you are dealing with in Gitcoin:     owocki:  DAOs don’t have CEOs. There is no legitimacy in authority, and control (or perception of control) is a liability if we are to go where I think we are going   Yes, DAO’s don’t have (or at least shouldn’t have) CEO’s, there are many important reasons for this, but on its base level it is critical that any true decentralized org evolves into one with many different leaders leading in different ways, with no single points of failure, and not get entrenched into a traditional power structure with a singular person (a “CEO”) having too much control over any high level aspects of the community and org.     owocki:  I of course remain completely committed to GitcoinDAO & it’s mission, but in what ways does tactical retreat from being involved in operations/decision making of the DAO serve the greater strategic direction of the DAO? How can I (and the others at Gitcoin Holdings) begin to separate ourselves from the DAO, such that we create space that allows the next generation of Leaders to emerge within & around GitcoinDAO?   I think that the degree to which you have a “tactical retreat” from operations/decision making will depend on where you are in the decentralization process and what you think is best for the community. I will say it is never easier to take a step back in this way when you are used to running the operations of a project that you have put so much of your heart and soul into, but part of the whole idea with DAOifying and decentralizing is that you recognize over time the whole of the DAO needs to become stronger and more resilient than any particular part of it (including you or myself and Erik in the case of ShapeShift DAO). There will never be a “right time” from your perspective, and the only way to get to where you need to go is at some point to rip the band aid off and let the community start taking over many important aspects of what you currently do on a daily basis. This is ultimately what we did at ShapeShift by handing over the majority of the authority of the DAO very quickly, and it has worked out better than I ever expected. So IMO, as painful as it may seem, the sooner you start to step back, the better for Gitcoin.     owocki:   How can we do so in such a way that if they fail, we are there to pick them up & reorient things? I can’t help but have the parent in me when I ask “How can we give them the psychological safety to try & experiment & learn, but also not make them complacent?”    I think you can do this by staying an involved and influential community member, active in discussions and there to advise and assist as needed, while at the same time being clear that these decisions are no longer yours and empowering the community around you to step up and take them on. You are too involved to not be around to help when something goes wrong, so my guess and my experience with the ShapeShift DAO is this will happen quite naturally as you step back more. That being said it is always a careful balance of being there to help, but also not offering too much help/allowing others to fail in order to learn, if the guard rails you put up are too strong the new contributors will never really grow and flourish. Better to let some things falter/fail in the short term, in order to empower the DAO that much more over the long term.     owocki:   How can we do these things without entrenching those new leaders over the long term? How do we create a culture where we always seek to decentralize power? Where we always seek to hire someone smarter than us & empower them to be the next generation of leadership in a beautiful decentralized fractal of growth & impact.    This is a great question and a difficult one to answer, but ultimately I think you do this by putting the right processes and community culture into place as much as you can. At the ShapeShift DAO something that has really helped us on this front is making sure any elected/funded position or group is always term limited (usually between 4-6 months right now for us) - this can evolve for the needs of the community, but I think this works really well because it constantly forces the discussion on a regular basis of if this person/group is delivering the value to the DAO token holders want to see, as well as forcing the discussion if someone else could deliver better. I think the biggest danger to DAOs is putting anyone into a position of power that is indefinite and then can simply become entrenched. Having a culture of terms and review seems to help a lot with this from my experience so far.     owocki:   How can we do so in such a way that is otherwise responsible to our stakeholders?    This depends on who you are defining as stakeholders, but generally I think the best thing you can do for all stakeholders (in particular Gitcoin tokeholders) is setup the right processes for resiliency and take a step back as soon as possible for the benefit of the long term of everyone.     owocki:   What are the biggest areas of centralization debt & how can we pay them down as quickly & responsibly as possible? Of course there is the centralized platform, but what else?    You likely have a better view towards this than anyone and I would say once you start to step back one of the best thing you can do is write up roadmaps and ideas for the places you see as most centralized and help creates targets the community should progressively work on to eliminate those things over time. This is where you can help lead on this front without being “the leader” at the same time.     owocki:  Two bits of context I might add:  Some of these questions are extremely hard not only professionally (there is no playbook for this) but personally. It is not an overstatement to say that Gitcoin’s mission has been my a large part of my waking life since 2017, and I must admit that Gitcoin is a big part of my identity - The last time I left a project I cofounded & scaled to millions of users I got extremely emo about it, and I’m trying not to do the same this time. TLDR - this transition is hard for me! I’m not going anywhere. I love this mission & this DAO - and I’ll be here (in the role of Founder, but without wearing any CEO hat) as much as the DAO needs me.    I totally understand on your bits of context as well, having founded and worked on ShapeShift for the last 8ish years now, I have had a similar problem where it became such a large part of my identity that letting go of important aspects of it was quite difficult. I was both excited and terrified at the same time at this prospect of decentralizing but I am also a firm believer that once you make that decision the best thing you can do for the community is fully commit and start removing yourself as “essential” as quickly as possible. The timing will never feel right and it will always be uncomfortable, but I do believe the sooner you can do that, the better it will work out for everyone in the community (including you). Something I learned early up in my entrepreneurship career is that one of the hardest and most important skills is learning to constantly replace yourself and I think that is perhaps even more important in DAO land. You may even find that removing yourself from a lot of the day to day operations actually frees you up to deliver even more value to the community with higher level strategic/vision that you can deliver as a community member on a regular basis, I have personally found this the case with my transition to my non-formal role in the ShapeShift DAO and being able to “come up for air” out of the operational weeds has me more motivated and excited to be part of such a thing than at any point over the last number of years. Overall, my advice is basically “rip the band aid off” and find a way to start removing yourself as an essential point of failure as soon as reasonably possible, I think you will find the rewards are well worth it and you may find yourself enjoying the change far more than you expect once you get over the initial terrifying period . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.598579603267103
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#5",
                    "likes": "0",
                    "time": "14/02/2022-23:01:06",
                    "content": "    JonisJon:  At the ShapeShift DAO something that has really helped us on this front is making sure any elected/funded position or group is always term limited (usually between 4-6 months right now for us) - this can evolve for the needs of the community, but I think this works really well because it constantly forces the discussion on a regular basis of if this person/group is delivering the value to the DAO token holders want to see, as well as forcing the discussion if someone else could deliver better.   Did you do token grants with vesting schedules at ShapeShift? If so, how did you make these two elements work in concert - wanting to incentivize people to stay to earn their grant and even using cliff dates vs the value of getting fresh perspectives and not entrenching leaders? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.832142857142857
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/JonisJon",
                    "index": "#6",
                    "likes": "2",
                    "time": "17/02/2022-18:12:08",
                    "content": "When we initially decentralized former ShapeShift employees were given 3 year vesting streams based primarily on their tenure and contributions to the centralized company, the goal was for this to also serve as an ongoing reason to keep participating in the ShapeShift DAO. I would say this has been moderately successful, it has helped build a core nucleus for ShapeShift DAO of contributors and helped establish various workstreams and the overall culture of the DAO, even if some of those folks have not stuck around (we have also seen some folks leave and come back already primarily because of their stream.) Moving forward the DAO is experimenting with different types of mechanisms, including new fox streams for core engineering contributors which have 6 months cliffs and revocability directly from the DAO treasury if a contributor leaves, this serves as a great new long term incentive to bring on new contributors and perspectives. Overall I think these mechanisms are working quite well, but we of course will continue to experiment and evolve. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.877840909090909
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#7",
                    "likes": "2",
                    "time": "10/03/2022-22:21:53",
                    "content": "    JonisJon:  At the ShapeShift DAO something that has really helped us on this front is making sure any elected/funded position or group is always term limited (usually between 4-6 months right now for us)   4-6mo terms feels very short. Gitcoin for example operates on a quarterly basis with our Grants rounds. This means we could have some one observe 2 Rounds at max, and then have to rotate out. I am big believer that experience brings efficiency. the number of times I have heard “we should do this…” and then also “we tried that 6mos ago, here was the result. Has something changed that might make this time more successful?” Without keepers of history we are doomed to repeat the same msitakes.     JonisJon:  I think the biggest danger to DAOs is putting anyone into a position of power that is indefinite and then can simply become entrenched.   I do also whole heartedly agree with this. As Kevin has stepped away from decision making, his leadership has encouraged more and more local ownership and team decisions. Candidly there is still a theme of major milestones we are working towards are Kevin’s ideas. This has always been a great benefit to Gitcoin, but at some point having diversity in major initiative drivers will be really healthy.     JonisJon:  Moving forward the DAO is experimenting with different types of mechanisms, including new fox streams for core engineering contributors which have 6 months cliffs and revocability directly from the DAO treasury if a contributor leaves, this serves as a great new long term incentive to bring on new contributors and perspectives.   FWIW, this felt very contradictory to some of the details you mentioned in the first post on timelines for folks. I would love to learn more about compensation/incentivization models you all are dabbling with. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.26586719731881
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/JonisJon",
                    "index": "#8",
                    "likes": "0",
                    "time": "16/03/2022-01:28:20",
                    "content": "    kyle:  4-6mo terms feels very short. Gitcoin for example operates on a quarterly basis with our Grants rounds. This means we could have some one observe 2 Rounds at max, and then have to rotate out. I am big believer that experience brings efficiency. the number of times I have heard “we should do this…” and then also “we tried that 6mos ago, here was the result. Has something changed that might make this time more successful?” Without keepers of history we are doomed to repeat the same msitakes.   The actual term length can be widely variable based on the needs of the particular DAO, and I think it is also rational to gradually increase term for various workstream leaders, I expect ShapeShift DAO will move up to 1 year+ terms for long stream contributors in various cases as trust is built with the community. The important thing is just having a standard of term lengths which come up for renewal (in whatever length works best for the DAO) that force the conversation of whether it should be renewed and not requiring removal to always be an active process.     kyle:  FWIW, this felt very contradictory to some of the details you mentioned in the first post on timelines for folks. I would love to learn more about compensation/incentivization models you all are dabbling with.   Not sure what was contradictory but happy to discuss more! Here is a example of the engineering workstreams’ latest proposal for an idea of what the DAO played around with recently: Snapshot ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.178819444444445
                }
            ]
        }
    ],
    "group_index": "679"
}