{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/the-blue-ocean/9868",
            "title": "The Blue Ocean \\xf0\\x9f\\x8c\\x8a ",
            "index": 9868,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "6",
                    "time": "10/02/2022-05:38:40",
                    "content": " 1600×1130 84.4 KB  Blue ocean is a slang term referring to the uncontested market space of an unknown industry or innovation. Unexplored and untainted by competition, ‘blue oceans’ are vast, deep, and powerful in terms of opportunity and growth. I want to talk about a blue ocean (an uncontested market space) that I think is going to be very important one day: The Internet of Jobs. The Internet of Jobs (IoJ) is what happens when web3 collides with the timeless exchange of labor for money in the digital realm. It creates a new and improved labor marketplace that integrates value transfer as a native feature, allowing our relationship with labor to be peer-to-peer and less reliant on central intermediaries with unilateral control. Gitcoin is obviously in the business of helping developers (and others working on public goods) git coins. It would behoove us to explore this blue ocean because we will discover opportunities that will help our community git more coins in better ways.  Making Sense of the Blue Ocean There are two ways to explore this territory:  a priori: reasoning or knowledge which proceeds from theoretical deduction rather than from observation or experience empirically: verifiable by observation or experience rather than theory or pure logic.  What follows is deductions that I’ve made about the IoJ with a combination of these two methods. The IoJ is not the gig economy. The IoJ is not skeuomorphic to the old ways that we’ve worked, it is something new. Because hiring depends on reputation, the IoJ will grow with the growth of decentralized identity protocols.  These protocols will enable 1000s of new market participants to build their web3-equivilent of a resume, enabling them all to earn a living in a web3 native way. The IoJ will not just be one to one economic relationships. The IoJ will contain many to many economic relationships. The IoJ is how web3 goes mainstream. For 97% of humanity, their financial lives are their jobs, not their investments. The IoJ will unbundle what it means to have a job into its composite parts, and allow a la carte access to each of them from anywhere.  Earning Learning Creating an Impact Connecting Hiring  The IoJ is a reflection of the work that we do at Gitcoin. I think of this like a funnel,  How many developers can we source new opportunities for? How many can we help select an opportunity that is a fit for them? How can we help funding opportunities sell themselves to developers? How can we help developers sell their work to funders? How can we onboard them into ecosystems to produce positive impact? Once they are earning in these ecosystems, how can we retain them?   BUIDLing In the Blue Ocean A handful of Gitcoin’s products are all already deployed in the Blue Ocean.  Gitcoin Hackathons Gitcoin Grants Gitcoin KERNEL  And there is already work underway at the Moonshot Collective to introduce other Gitcoin tools in this blue ocean.  Proof of Personhood Passport  Coordination Kit dRecruiter  I am curious what IoJ tools people are excited about, and what blue ocean opportunities the DAO is interested in pursuing. Please comment below if you have feedback or comments. ",
                    "links": [
                        "https://proofofpersonhood.com/",
                        "https://gov.gitcoin.co/t/coordination-party-kit/9231",
                        "https://twitter.com/owocki/status/1491239578253946882",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-11-2022/10277",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-6-2022/9949",
                        "https://gov.gitcoin.co/t/moonshot-collective-internet-of-jobs/10250/4",
                        "https://gov.gitcoin.co/t/retreat-2022-impressions/9944/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.632598409342595
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#3",
                    "likes": "1",
                    "time": "29/03/2022-05:41:01",
                    "content": "Super excited about this future. But we may want to revise the way we talk about it - “Internet of Jobs”. Did you see the recent Bankless newsletter with this graphic?  image1113×296 43.7 KB  They have DAOs to the right of the Internet of Jobs. I think many people associate that phrase, the internet of jobs, with an existing concept or state that is already here, vs what you are conveying in a web3 context. Just something to consider as we explore this area. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0671768707483
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tayken",
                    "index": "#4",
                    "likes": "2",
                    "time": "14/05/2022-13:36:57",
                    "content": "Interesting… have heard similar framing concerns when using IoE (Education). I think IoJ/E are still useful depending on the audience/context. IoDAOs may be where we hope to land, but we still need bridges (metaphoric + memetic + technical) to help us get there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                }
            ]
        }
    ],
    "group_index": "683"
}