{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/an-evolutionary-lens-on-web3-open-source-software/10293",
            "title": "An Evolutionary Lens on Web3/Open Source Software \\xf0\\x9f\\x94\\x8e ",
            "index": 10293,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "8",
                    "time": "02/04/2022-04:32:14",
                    "content": "One of the coolest things about open source projects is how they evolve. Open source software has a deep evolutionary history. The open source ecosystem has evolved massively over the last 30 years.  This includes both:  Macro-evolution - OSS ecosystem (and all of it’s subniches) maturing together Micro-evolution - each individual project maturing (or dying)  If you study the source history of many of these projects, can you even see many compelling visuals of how code patches flow between branches. This is the beating heart of our digital infrastructure, being built before our eyes!  git-model@2x1150×1524 122 KB  All web3 projects are open source.  What can we learn from the rich history of Open Source projects to teach us about what web3 can learn from how they’ve evolve?  How can we be inspired to write protocols that will survive & thrive, instead of protocols that are an evolution dead end? In open source, we’ve seen that just having decent documentation, open source code, + offering forkability, a project (or an ecosystem) can evolve in many interesting & meaningful directions over time. Take linux for example:  44218-linuxdistrotimeline-7.21965×1417 179 KB  Over time, Linux has evolved to occupy many different niches.  Linux is used on  desktops cloud servers mobile phones embedded devices.  Here are some stats on Linux’ proliferation:  In 2021, the lines of code submitted to the Linux Git repository reached 27.8 million. In 2021, 100% of the world’s top 500 supercomputers run on Linux. Out of the top 25 websites in the world, only 2 aren’t using Linux. 96.3% of the world’s top 1 million servers run on Linux. 90% of all cloud infrastructure operates on Linux and practically all the best cloud hosts use it.  Open Source Fork-ability has allowed evolution in Linux, and that has served Linux well!  What Web3 can learn from Open Source? I’ve been exploring an evolutionary perspective on web3, and I want to share it here. I’m of the opinion that Linux was successful because it had  Utility Interoperability Open source Forkability Great documentation A thriving developer community Adoption network effects  How can web3 take what’s great about Open Source, and add to it? Lets take a look at how the web3 ecosystem has evolved over time visually and see what it’s size/scale/scope is. This is a photoshopped tree of life which has been modified to frame the birth & growth of web3 in an evolutionary perspective.  ( click here to view the discussion about this visual on twitter)* As the cliche goes: all models are wrong, but some are useful. I think this model is useful because it helps convey a few concepts:  the byzantine generals problem was the innovation trigger An evolutionary perspective (from simplicity to more complexity & diversity):  the bitcoin whitepaper created the first branch of open source money from there, layers of evolution happened on top of that in the form of BTC forks. once ethereum launched, a smart contract ecosystem began to evolve. upon that, an DEFI ecosystem & NFT ecosystem launched around the same time as an ecosystem of L2s & alt L1s further growth continues   evolution is not omnidirectional.  it expands in many different directions. in nature, projects compete for scarce resources (energy) evolve according to natural selection.  in web3, projects compete for scarce resources (capital, attention) evolve according to memetic selection. not every project (organism) makes it - over time, certain projects are evolutionary dead ends.  caught in bear markets (extinction events). as groups of organisms (or projects) begin to co-habitate in the same evolutionary niche, they begin to co-evolve - either forming parasitic or symbiotic relationships.  One thing I think is neat about how web3 has grown is that it takes what made traditional open source work:  Utility Interoperability Open source Forkability Great documentation A thriving developer community Adoption network effects  & it adds a global coordination layer & a global incentivization layer on top of it.  This has led to some speculatular evolution over the years. Thanks for reading to the end.  Id love your feedback on this post! Here are some prompts to facilitate further conversation:  What are your favorite software evolution stories? What can we learn from the rich history of Open Source projects to teach us about what web3 can learn from how they’ve evolve?  How can we be inspired to write protocols that will survive & thrive, instead of protocols that are an evolution dead end? Grants 1.0 has evolved over the years but ultimately has been deprecated into maintenance mode.  What can Grants 2.0 learn from the most successful open source projects? How can this a macro-evolutionary perspective inform which projects Gitcoin works with? (see How does the DAO prioritize side rounds? ) It’s cool to think about how Gitcoin could be a connective tissue to help many of these projects with their evolution in the future. A world where QF Enhances *Every* Income is a world in which many of these evolutionary strands of code are running Gitcoin Aqueduct s.  It would serve the GitoinDAO well to know which projects are opening up new evolutionary niches (and the riches within those niches), and prioritize those. Were in a cambrian explosion of finance and every shitcoin launch & implosion is just speed running the evolution until we get to the crypto-equivalent of mammals?  ",
                    "links": [
                        "https://evogeneao.s3.amazonaws.com/images/tree_of_life/tree-of-life_2000.png",
                        "https://twitter.com/owocki/status/1509939046230872068",
                        "https://twitter.com/owocki/status/1509939046230872068",
                        "https://twitter.com/owocki/status/1473647014906773504",
                        "https://gov.gitcoin.co/t/how-does-the-dao-prioritize-side-rounds/9827",
                        "https://gov.gitcoin.co/t/a-world-where-qf-enhances-every-income/10202",
                        "https://gov.gitcoin.co/t/gitcoin-aqueduct/9684",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.039389722831281
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "3",
                    "time": "02/04/2022-04:34:10",
                    "content": "a few twitter threads to stimulate further convo   twitter.com    Ξwocki (🤖,💚) @owocki  PSA: were in a cambrian explosion of finance and every shitcoin launch & implosion is just speed running the evolution until we get to the crypto-equivalent of mammals 🙂   9:35 AM - 18 Jan 2022           73                7              twitter.com   simona pop 🔥 @Sim_Pop  The evolution of crowd - group - network.  It's all about communication & value flows - a progression from passive audiences to active cells in resilient metaorganisms.   6:21 AM - 16 Aug 2021           202                68              twitter.com    Ξwocki (🤖,💚) @owocki  a cambrian explosion of web3🌎 vegetable forks & PFP NFTs in all directions evolution running its course not natural selection, memetic selection can we just speedrun this till we get to the web3 equivalent of mammals, mycelial networks, & rich forest canopies brimming w life⁉️🌱   6:51 AM - 9 Mar 2022           85                7              twitter.com    Ξwocki (🤖,💚) @owocki  here u r anon 👉👈  in the 4th season of the game of coins 🪙  in a cambrian explosion of dApps 🌱 a 3d chess game between memes ♟ in a quest for the optimal money lego🧱👑 at the inflection point where coordination wins ✨  & here u r 🖤  not realizing the game has changed 🚗🏃‍♂️   5:30 AM - 9 Mar 2022           31                1              twitter.com    Ξwocki (🤖,💚) @owocki  has anyone written about what dao to dao relationships have to learn about the evolution of multi-cellular life on earth?  I’ve been researching this subject and I have thots I may type up if no one else has.   Biomimicry ftw 🌱   3:17 PM - 7 Feb 2022           109                6            ",
                    "links": [
                        "https://twitter.com/owocki/status/1483493156314222594",
                        "https://twitter.com/owocki/status/1483493156314222594",
                        "https://twitter.com/owocki/status/1483493156314222594",
                        "https://twitter.com/Sim_Pop/status/1427259142545281026",
                        "https://twitter.com/Sim_Pop/status/1427259142545281026",
                        "https://twitter.com/Sim_Pop/status/1427259142545281026",
                        "https://twitter.com/Sim_Pop/status/1427259142545281026",
                        "https://twitter.com/owocki/status/1501571285779824641",
                        "https://twitter.com/owocki/status/1501571285779824641",
                        "https://twitter.com/owocki/status/1501571285779824641",
                        "https://twitter.com/owocki/status/1501571285779824641",
                        "https://twitter.com/owocki/status/1501550874396700679",
                        "https://twitter.com/owocki/status/1501550874396700679",
                        "https://twitter.com/owocki/status/1501550874396700679",
                        "https://twitter.com/owocki/status/1501550874396700679",
                        "https://twitter.com/owocki/status/1490827007936335872",
                        "https://twitter.com/owocki/status/1490827007936335872",
                        "https://twitter.com/owocki/status/1490827007936335872",
                        "https://twitter.com/owocki/status/1490827007936335872"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.4624999999999995
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tayken",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/04/2022-20:42:06",
                    "content": "I dig! Plenty of parallels with @metadreamer and @tracheopteryx Nature (i.e. og mother degen) can teach us everything we need to know.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "48"
}