{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/opening-new-options-to-grants-and-defi-projects/4409",
            "title": "Opening new options to Grants and defi projects ",
            "index": 4409,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/MoonBoy96",
                    "index": "#1",
                    "likes": "2",
                    "time": "31/05/2021-17:27:02",
                    "content": "We all have an idea of the real value of different crypto currencies. Not only more people getting into the crypto environment, most of them start to notice the blockchain technology. Growing every single day, DAOs, blockchain, and Bitcoin are here to stay. With that being said nowadays, loans on crypto to trade are easiest and quicker than never. Being able to ask for a loan and locking the payment of that loan on the same block allowing the borrower to have a guarantee of the loan being paid back. I can deploy a smart contract where automatically allow the developers of the grant allocate the loan  to wherever they need the most. Obviously  I am looking for a developer where we can work together, to make this a reality and bring more attention, and people to the new era. If you are interested, do not hesitate to reach me, if you think you can improve it, please do not hesitate to get back to me. The revolution has begun. ",
                    "links": [],
                    "GPT-summary": "The author is proposing a new idea for loans on crypto to trade, where the borrower can guarantee the loan being paid back by locking the payment on the same block. The author is looking for a developer to work together to make this a reality and bring more attention to the new era of blockchain technology. A 3rd party giving constructive criticism or interested in collaborating on the proposal may reach out to the author.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.989877769289534
                }
            ]
        }
    ],
    "group_index": "423"
}