{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/we-need-a-better-system-for-how-things-go-to-snapshot/5215",
            "title": "We need a better system for how things go to Snapshot ",
            "index": 5215,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/wschwab",
                    "index": "#1",
                    "likes": "14",
                    "time": "06/06/2021-12:40:33",
                    "content": "Watching proposals over here convinces me that we need a better process (or any process at all) for how things go to proposals on Snapshot. I’m not going to discuss AKITA right now just because I don’t want to get bogged down with it, and will instead pick a different example: Snapshot The proposal calls a vote on whether or not there should be multiple communities to support multiple languages, at least as I read it. What would this mean if it passed? Would the Gitcoin team be obligated to implement the portal described in the description? Who would need to do the translations? I suspect there is general confusion over what the DAO can and cannot govern. I know I’m confused about that. I think there should also be some kind of process before proposals go to Snapshot, to review them, make sure they’re clear, make sure what is being voted on is something in the purview of the DAO. I could make a Snapshot proposal voting if pineapple is a legit topping for pizza, but I do not think that pizza toppings are in scope for the DAO, nor can the DAO enforce its decisions on pizza eaters worldwide. I might make that proposal just to make a point. I think this should optimally turn into a concrete suggestion which is then voted on, something like:  a nomination for a review team a decision on what quorum would be needed to put something in Snapshot what a proposal should look like what can and can’t be done with a proposal  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.411768353174603
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/walidmujahid",
                    "index": "#2",
                    "likes": "4",
                    "time": "06/06/2021-17:29:59",
                    "content": "I feel you are making a false equivalence between your pineapple proposal and language community proposal, but I digress. I personally would have thought proposals would be well discussed here on discourse before being put on snapshot. Maybe that should be enforced somehow?     wschwab:  What would this mean if it passed? Would the Gitcoin team be obligated to implement the portal described in the description? Who would need to do the translations?   Maybe I should not have assumed this, but I would have thought the people who voted for a proposal would be directly involved, one way or the other, in implementing that proposal. There are examples in the past where issues and new aspects of Gitcoin were organically introduced with minimal involvement from the Gitcoin core team besides maintainer reviews -e.g, mini-clr. I see no reason why not to put in place rule that if you propose something or voted on it, then you should be expected to work on it. I do not know how a review team will work, so I will wait to see more ideas. But I feel that steps for producing a concrete proposal should include the following as part of the discussion period before even going on to snapshot:  A list of committed people who will implement, organise, or manage whatever is being proposed should it be voted into existence A clear timeline if relevant How this will affect other areas in Gitcoin, be it the community, time resources taken away from something else, and overall what effects that are expected in the long or short terms.  If there is a review team, then they would take in consideration all of the above before moving it to snapshot. In my opinion, if a proposal does not have people willing to implement it, organise or manage it into existence once positively voted on, then it is no different than just sending a suggestion the core team or posting on the Github issue explorer expecting someone else to do the work. The only difference here, in such a case, is you just have people voting with their tokens showing their sentiment. Maybe that is the purpose of this DAO, but I think it should be more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.154064685314685
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wschwab",
                    "index": "#3",
                    "likes": "2",
                    "time": "06/06/2021-19:05:56",
                    "content": " I feel you are making a false equivalence between your pineapple proposal and language community proposal, but I digress.  I might have not been clear enough: I didn’t mean to equate the two! I think the language proposal is rooted in a very relevant and beneficial idea, whereas the pineapple proposal is not. The only point I was trying to make with the pineapple was that in the current setup, anybody can make any proposal, which makes for a chaotic Snapshot situation. The point I was trying to make with the multi-language proposal was not limited to it, nor a specific criticism of it. If anything, I was more familiar with it because I’m trying to follow the different threads discussing (in English) the creation of subcommunities around language since it appears to me to be very needed. I think the same point can be made about a number of proposals, including the recent 7-option proposal which I didn’t want to single out because I thought there was a non-trivial chance of the thread getting thrown off course. To directly comment on your bullet points, I think your first lines up with mine, I think the second (timeline) is a valuable addition, and same with the third. Apologies if I came across as disrespectful of the multi-lingual proposal! I think Gitcoin needs something like it, and look forward to seeing it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.276968344155844
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/walidmujahid",
                    "index": "#4",
                    "likes": "1",
                    "time": "06/06/2021-20:44:22",
                    "content": "    wschwab:  Apologies if I came across as disrespectful of the multi-lingual proposal! I think Gitcoin needs something like it, and look forward to seeing it.   No worries. Thank you for explaining, I understand now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#5",
                    "likes": "3",
                    "time": "07/06/2021-00:27:28",
                    "content": "Strongly agree with this @wschwab, right now, it looks like the community has ratified that anything that hasn’t been up on the forum for at least 7 days prior can be removed from Snapshot (including the pineapple question you posed which is great btw). So in short, topics on the forum can lead to formal workstreams, which lead to formal proposals, which lead to snapshot votes, all within around a week. This has been added to the process document here:     GTC Governance v0 🤖 Meta-Governance       This document is a suggested process for developing and advancing Gitcoin Community Proposals. It is a living document intended to be owned, modified and enforced by stewards and the overall community.  Before we get started, please note that if you have support questions,  our Discord here is the place to ask, comments not related to the proposal in this thread will be removed:     Governance Roles Right now there are two main roles in Gitcoin governance: stewards and delegates.  Becoming a ste…     The general confusion over what the DAO can and can’t govern definitely needs to be resolved and I’d argue that’s an even trickier question. Right now, Gitcoin Grants related topics are the main scope but anyone can propose other topics if they so choose and try to steer the community in that direction at will, so long as they fit into an existing workstream. I’d love to see hard rules implemented on what to do with topics that extend beyond existing workstreams. Would you be willing to potentially spin up a review team to enforce as a start some of the rules mentioned above, but to your point, to help spin up new rules that might be helpful? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.688701298701298
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wschwab",
                    "index": "#6",
                    "likes": "4",
                    "time": "07/06/2021-06:09:14",
                    "content": "    ceresstation:  Would you be willing to potentially spin up a review team to enforce as a start some of the rules mentioned above, but to your point, to help spin up new rules that might be helpful?   I wish I had the capacity to take lead on this, but unfortunately I simply don’t right now. I can offer being a part of the process and trying to help streamline wherever I can, but in terms of actually getting the people and getting it off the ground, I don’t think I can spearhead it. One potential suggestion to get this going would be getting the top 5 delegates to champion this. I think it’s fair to say that the level of delegation they have received is a fair proxy for saying they have community trust, and that their positions as Stewards makes it fair for them to convene about this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.363365800865801
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tux",
                    "index": "#8",
                    "likes": "2",
                    "time": "08/06/2021-03:59:32",
                    "content": "I also think that we need a better system, and also the 1k GTC to make proposals is very very low ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#9",
                    "likes": "3",
                    "time": "08/06/2021-04:53:44",
                    "content": "Maybe we can add a mandatory field for new proposal like forum link (linked back to this forum) in snapshot. So for the reviewers/voters they could know this is a new proposal created and discussed in forum very well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.590909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wschwab",
                    "index": "#10",
                    "likes": "2",
                    "time": "08/06/2021-05:56:18",
                    "content": "While I think this is a great idea, I don’t think it solves the whole issue by itself. (I’m not saying you meant it to, just wanted to put this here for the sake of clarity.) I think we still need a preliminary vetting process and clearer comms around proposals going to Snapshot. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/walidmujahid",
                    "index": "#11",
                    "likes": "0",
                    "time": "11/06/2021-15:54:09",
                    "content": "    tux:  I also think that we need a better system, and also the 1k GTC to make proposals is very very low   Maybe. I think it is too soon to judge that. I think a vetting process like what @wschwab is proposing is the solution for the current problem. If raising the GTC to make proposals is needed in the future, then for sure, at that time let us do that. I do not know how it would look after people become more active in workstreams and earn more GTC, but perhaps at that time we can see what the average amount of GTC people have, and raise the limit to that. For now, I think we should not rise the barrier too high. Vetting proposals is the best solution at the moment I think. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.307575757575758
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wschwab",
                    "index": "#12",
                    "likes": "1",
                    "time": "13/06/2021-07:37:42",
                    "content": "I’ve been thinking about this, and I actually am beginning to think that @tux 's idea of upping the minimum to make a proposal may be the simplest vetting process. If the minimum were, say, 50k, it would basically ensure that either one of the major delegates is on board or that a coalition is formed. I think both of those are fine. I’m pulling 50k out of thin air - I don’t have any specific data point that says 50k is the right number, and I’m certainly open to suggestions. I feel like this would be a far simpler process than creating and implementing a formal vetting process. What do you say @walidmujahid ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.290550595238095
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/walidmujahid",
                    "index": "#13",
                    "likes": "1",
                    "time": "13/06/2021-15:08:16",
                    "content": "    wschwab:  If the minimum were, say, 50k, it would basically ensure that either one of the major delegates is on board or that a coalition is formed. I think both of those are fine. I’m pulling 50k out of thin air - I don’t have any specific data point that says 50k is the right number, and I’m certainly open to suggestions. I feel like this would be a far simpler process than creating and implementing a formal vetting process. What do you say @walidmujahid ?   If you put it that way, then yes, it kind of does sound simplest. I need to think about it more and maybe see what other people have to say. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.836309523809524
                }
            ]
        }
    ],
    "group_index": "451"
}