{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/is-gitcoin-over-its-skis-should-we-hold-spending-flat-while-addressing-unavoidable-risks/11870",
            "title": "Is Gitcoin over its skis? should we hold spending flat while addressing unavoidable risks? ",
            "index": 11870,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "stewards"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#1",
                    "likes": "10",
                    "time": "07/11/2022-20:27:03",
                    "content": "In today’s Steward’s call, I raised the question of whether Gitcoin might be “over our skis”. In this post, I’d like to explain my question and offer some evidence in support of the hypothesis that we are actually “over our skis.” Skiing?  The metaphor to be over one’s skis refers to emphasizing a course of action to such an extent that it constrains freedom of maneuver - implicitly in conditions in which one might want to be able to change direction.  When you lean far forward when skiing downhill, you pretty much can only go in one direction. The more “over your skis” you are, the faster you go. Why not lean forward? My impression as a part-time contributor and committed fan and steward for Gitcoin is that we have a lot of momentum that we have generated by largely achieving our founder’s initial vision. Gitcoin has helped to fund nearly $70 million of public goods!  And in so doing it has cemented relationships across the crypto ecosystem.  After all projects like ENS started in part as Gitcoin grantees! Maybe even more importantly - this success has helped Gitcoin to gather a team with deep experience and a breathtaking breadth of capabilities, from protocol developers to community builders, data scientists, meme lords, customer support professionals, and partnership leads able to find and close strategic commitments, and many more.  The talents and diversity of the team inspire me. So it is understandable that this team and DAO are confident that we can transition from being a destination site for the funding of public goods into a provider of protocols and other software and the necessary data science and communities to enable communities to fund their own shared needs.  I share that confidence. But - there be risks here Enough preamble - what’s the issue?  Why shouldn’t we lean forward? A few risks come to mind:  We have not proven product market fit for the protocols:  On the one hand, Gitcoin passport adoption appears strong and we have had extensive conversations with development partners and others. These data points suggest that our approach to protocol development is at least approximately correct. On the other hand, we have not truly proven product market fit until we see broader inbound adoption and until partners start to succeed. Note that we have our first partner rollout starting shortly - when Fantom uses a part of the Gitcoin protocol starting in mid-November, so at least for the initial components that are ready for them to use, we will learn more very shortly.  We have not proven our ability to deliver on time, on quality, the protocol software:  Even if we have absolutely correctly scoped the ongoing development work and so we have figured out product-market fit - we cannot be sure that the protocols will be delivered on time, on quality quite yet.  In particular, when we examine the development streams of the Gitcoin Product Collective we see signs that both increase confidence and signs that temper optimism. The team is building largely in public and following practices that from the outside seem to make a lot of sense. Also, the design work and user interviews that have been conducted are amongst the most thorough I have seen in my career. On the other hand, I have not seen a burn-down chart and when probed a little bit on their ability to do estimation, the teams have very openly indicated that they are not yet at a point where they are comfortable using points per sprint to estimate team capacity, obviously an important part of estimating timelines.  The process is not yet mature.  We are not ‘DevReling’ successfully quite yet:  There is a lot of conversation about DevRel within Gitcoin.  I view this as extremely healthy.  Many if not all workstreams are doing something to prepare for a future in which developers and other technical decision-makers will be more crucial for our success than they have been in the past. That said, again, we have yet to prove we know where to find our new personas.  I would like here in particular to highlight the planned work of MMM at testing out persona funnels in season 16, Grant Ops planning to work with GPC to hire DevRel help, and the plan by DAO Ops to grow a technical support capability. Plus, FDD is leaping towards decentralizing aspects of itself via an OpenData community. All great plans. And yet - finding the right mix and starting to tune and further align these efforts for scale takes time and we are just getting going in building our DevRel motion.  Macro uncertainty:  Last but not least, the macro environment is not great.  The regulatory environment in the United States seems to be broadly negative for web3 innovation.  Could this uncertainty impact a further downturn in the value of GTC?  While we have diversified our treasury somewhat, currently we do not have a revenue stream to help solidify our runway which stands at approximately 2.5 years. For every 50% downturn in GTC our runway drops by approximately 37.5% - or 11.25 months - if, as I understand it, our treasury is approximately 25% in stablecoins now. Regain balance, avoid a fall If we are over our skis a bit, it may be prudent to reduce speed and derisk the business while minimizing the ongoing reduction of our runway.  During S16 more conclusive signs of product market fit, our ability to deliver software on time and on quality, DevRel success, and even revenues will hopefully emerge, in which case we will have further derisked our transition to a protocol future. In that case, we can get back on our skis and accelerate.  The opportunity and our mission will be there for us. I would suggest that we hold ask workstream leads to hold budgets flat during S16.  By S17 we will have addressed some of the risks that only time and effort can address and will be in a better position to make informed resource allocation decisions. ",
                    "links": [
                        "https://gov.gitcoin.co/t/web3-crowdfunding-tool-competitive-landscape/12266",
                        "https://gov.gitcoin.co/t/s16-proposal-draft-public-goods-funding-budget-request/11819/17",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-dao-ops-budget-request/12741/20",
                        "https://gov.gitcoin.co/t/v2-of-the-steward-council-nomination-thread-and-election-update/12057/8",
                        "https://gov.gitcoin.co/t/digest-43-gitcoin-x-unicef-partnership-alpha-rounds-upcoming-twitter-spaces-and-more/12110",
                        "https://gov.gitcoin.co/t/introducing-stewards-governance/41/231",
                        "https://gov.gitcoin.co/t/s16-proposal-draft-dao-operations-budget-request/11811/9"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.717232811990876
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "4",
                    "time": "08/11/2022-04:47:46",
                    "content": "I mostly agree with everything said in this post. One thing to note is that my estimations of the runway and budget were napkin math from 2 weeks ago when the price of GTC was around $1.60. It would be great to be given an overview that is more precise AND incorporates the amount in the treasury vester in addition to the current treasury contract. We likely have closer to 4-5 years runway with $8 million in stables. That said, I did think that the agreement to not have metrics and a lighter checkin was that workstreams would stay at the same budgets. The amount of overall increase has caught me off guard. On one hand, I’m seeing strong support for it. On the other, we might be over our skis  I’m mostly concerned about the lack of a holistic vision and strategy for the DAO. There are big strategic questions which need answering to know that the work being done this season is “the right work”. I’ve attempted to outline these concerns here: From Gitcoin Driven to Community Driven ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.266941391941392
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/myceliumcoordinator",
                    "index": "#3",
                    "likes": "4",
                    "time": "12/11/2022-23:49:56",
                    "content": "    DisruptionJoe:  We likely have closer to 4-5 years runway with $8 million in stables.   I think this is a mistaken way to think about this! Gitcoin’s burn is $1million/month.  At $8m in stables, Gitcoin has 8 months in runway. With 45million GTC worth $1.50 a peace in treasury, there COULD be an additional $67million in runway provided.  BUT this assumes $67million in buy pressure for GTC to offset the $67million in sell pressure that would be caused by those 45million GTC hitting the market.  I’m not sure that this is something GitcoinDAO can necessarily count on. I think Gitcoin has 8 months in guaranteed runway.  And lots of more runway if GTC remains healthy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#4",
                    "likes": "2",
                    "time": "14/11/2022-15:58:20",
                    "content": "Really well put in my opinion.  Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#5",
                    "likes": "3",
                    "time": "15/11/2022-16:15:07",
                    "content": "    myceliumcoordinator:  With 45million GTC worth $1.50 a peace in treasury, there COULD be an additional $67million in runway provided. BUT this assumes $67million in buy pressure for GTC to offset the $67million in sell pressure that would be caused by those 45million GTC hitting the market. I’m not sure that this is something GitcoinDAO can necessarily count on. I think Gitcoin has 8 months in guaranteed runway. And lots of more runway if GTC remains healthy.   This is a very important point. The market cap is only $25 Mil, and circulating supply is around 14M GTC. The GTC we have is 3 x the circulating supply, if released, will likely put a lot of downward pressure on the price. How can we start to reduce our spending!?! There has to be a hard line on budgets, it’s the only way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.639166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#6",
                    "likes": "4",
                    "time": "15/11/2022-17:14:01",
                    "content": "    griff:  How can we start to reduce our spending!?! There has to be a hard line on budgets, it’s the only way.   Idk if this is the right approach, my 2cents are that a sort of DAO audit can be performed if the SC and stakeholders believe it will help. Maybe it will be really cool for Gitcoin DAO to be the first DAO audited professionally( ofc in the right ethos and more non-corp like). Internal audits do serve a purpose and it’s not like a lot of people from the corporate world aren’t working in DAOs atm. Maybe there are workstreams who are more efficient and handle their budget more carefully than others, they should be rewarded for this if so  and they could possibly help others WS with treasury management. Atm, idk if this information is clearly visible to everyone though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.826587301587302
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#7",
                    "likes": "2",
                    "time": "20/11/2022-16:31:31",
                    "content": "Internal audit? This is honestly just more scope. We can talk about and think about spending less money… or we can just rip off the bandaid and do it. We have a cold winter ahead and we are burning thru our resources like they are infinite. Everyone else in the space is making cuts for a good reason, we need to follow suit. Giveth spends around $120k a month with 40+ paid contributors, ~50% being full time, and GTC is spending 10x that, but it is not an org 10x the size. We are very inefficient with our resources IMO, and can do more with less, but there is no motivation to move that direction, because it is hard! We have to accept the Macro reality and think long term. Going a little slower now will allow us to go further overall. ",
                    "links": [
                        "https://gov.gitcoin.co/t/digest-43-gitcoin-x-unicef-partnership-alpha-rounds-upcoming-twitter-spaces-and-more/12110",
                        "https://gov.gitcoin.co/t/november-csdo-digest/12338/12"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.438194444444444
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#8",
                    "likes": "2",
                    "time": "20/11/2022-20:09:19",
                    "content": "Ah, sorry, I am not a big stakeholder here.I do agree with the sentiment shared here and believe that in retrospective GItcoin DAO has spent funds of redundant stuff, attracted grifters, etc…that’s why I proposed an audit. Like how do we know which are the areas/WS that actually need budget cuts  I really care about Gitcoin’s mission and still support it even if I am no longer getting paid by the DAO in any way. Giveth and Gitcoin are two of the coolest projects in web3 and people know it!  PGs are the future, but it’s sad to see that nowadays you can’t tell you is a real PG supporter and who is a “wolf in PG clothing”  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.527777777777778
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/myceliumcoordinator",
                    "index": "#9",
                    "likes": "1",
                    "time": "21/11/2022-05:31:50",
                    "content": "    griff:  The GTC we have is 3 x the circulating supply, if released, will likely put a lot of downward pressure on the price.   It looks like there is millions of dollars per day of volume for GTC.  I’m not sure this is true. Since its a very important question, I tried to get the llama team to include this in their treasury runway analysis  but my comments were ignored.   Giveth spends around $120k a month with 40+ paid contributors, ~50% being full time, and GTC is spending 10x that, but it is not an org 10x the size.  This feels like something that could be a good learning for Gitcoin.  Giveth has shipped a handful of protocols in the last 9 months.  How is it that Giveth is shipping so much faster than Gitcoin on much less resources?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.946296296296296
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#10",
                    "likes": "2",
                    "time": "21/11/2022-17:24:01",
                    "content": "As you know @myceliumcoordinator - it isn’t trivial to judge the velocity of a project.  What tools would you use to compare the speed of development in Gitcoin vs. Giveth for example? I see in Gitcoin’s Grants Protocol and Passport well-thought-through projects that have spent a lot of time and effort addressing the needs of development partners with the help of extensive product management and design resources. Nonetheless, it is hard to know that development is moving in the right direction before the code is shipped and being used. In short - I think you touch on something crucial which is how to metric the pace of development - as well as whether it is focused on the right features and capabilities. For community health of a contributor community, the CNCF offers a powerful though not very opinionated or simple to use for comparative analysis Grafana-based environment called Devstats:  https://devstats.cncf.io/ It isn’t perfect however perhaps if there isn’t already such an initiative it could be useful to have a similar set of tools & metrics (starting w/ a fork) for web3 open-source projects.  It could also help us all to rally behind signs of product development momentum. ",
                    "links": [
                        "https://gov.gitcoin.co/t/digest-43-gitcoin-x-unicef-partnership-alpha-rounds-upcoming-twitter-spaces-and-more/12110"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.405812324929972
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/myceliumcoordinator",
                    "index": "#11",
                    "likes": "3",
                    "time": "22/11/2022-02:54:16",
                    "content": " Costs GitcoinDAO launched in May 2021 on a budget of $1million/month, for a total cost of $17million. Giveth launched in Dec 2021 on $100k/mo, for a total cost to date of $1.1million.  Lets assume they were working on their products for 6 months before their launch, and bring the total to $1.7million (exactly 10x less than what GitcoinDAO’s spent)  Outcomes GitcoinDAO launched in May 2021 and has so far shipped  Passport (sort of, as Passport only starts to lay the foundation to prevent sybil attacks).  Conviction Voting (sort of, it was later abandoned) anything else?  Giveth launched Dec 2021 and has so far shipped:  it’s crowdfunding platform GIVPower GIVEconomy GIVGarden GIVFarm GIVBacks GIVStream Giveth Angel Vault  Of course the number of launched protocols is only one way to compare the two outcomes.  I don’t know of an analytics tool for Giveth, but if you scroll through the Giveth crowdfunding platform you will see many projects with $10k+ raised, some with $100k+.  Compare this to $0 raised on Gitcoin’s protocols so far.  Summary Gitcoin is clearly running on the momentum that it inherited from before DAO launch, not on it’s own product team’s merits (yet).     epowell101:  As you know @myceliumcoordinator - it isn’t trivial to judge the velocity of a project. What tools would you use to compare the speed of development in Gitcoin vs. Giveth for example?   Gitcoin’s products cost 10x more to develop and are still being out-executed by other web3 crowdfunding projects (in this case we are discussing Giveth, but similar analysis’ could be run on other competitors).  Just look at the data above. That is worth it IF the quality of Gitcoin’s products is supreme.  But it is not worth it if the quality of Gitcoin’s eventual product is not good or if the research doesnt lead to creating more value in a big enough market that people switch (reaching product/market fit).  It’s not worth it if the product doesnt catch on and so the “heat” inherited around Gitcoin dissipates and GTC falls to $0.     epowell101:  I see in Gitcoin’s Grants Protocol and Passport well-thought-through projects that have spent a lot of time and effort addressing the needs of development partners with the help of extensive product management and design resources. Nonetheless, it is hard to know that development is moving in the right direction before the code is shipped and being used.   I agree. I hope that Gitcoin’s protocols reach product market fit and gain a lot of adoption in early 2023.  I also hope that someone can eventually explain to me what the utility of GTC is.  Otherwise all of this expensive research was for naught. Thanks for listening  ",
                    "links": [
                        "https://giveth.io/",
                        "https://gov.gitcoin.co/t/the-utility-of-gtc/10071",
                        "https://gov.gitcoin.co/t/digest-43-gitcoin-x-unicef-partnership-alpha-rounds-upcoming-twitter-spaces-and-more/12110"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.330191798941799
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/alexdwagner",
                    "index": "#12",
                    "likes": "3",
                    "time": "22/11/2022-20:26:10",
                    "content": "I think that it’s worth considering that, since Gitcoin’s inception, the org has been running a grants round for every quarter and has distributed ~$60m to grantees thus far. So if Giveth is shipping more protocols faster, it may be for the reason that they haven’t been running a centralized grants program every quarter which has launched projects like ENS, Uniswap, and the like. Might be obvious that Gitcoin’s protocols are being built to empower the web3 community to run their own grants rounds but it seems to me, as an MMM contributor, that much care must be had to transition from cGrants to dGrants, as well as creating protocols that people will actually adopt and use. I’m thinking this is a bigger lift than creating a protocol from scratch. More like steering a very big boat into harbor in rocky waters, must be done carefully and slowly. Also, we are running alpha rounds on alpha and beta versions protocols until the official launch. I think it would be good to include the impact of Gitcoin grants rounds and the programs that Gitcoin runs that unite the web3 community and kickstart massive projects that become a core part of the web3 ecosystem. I do think it’s good that people are asking the hard questions around reigning in costs at the DAO, and will continue to follow this thread. That’s my understanding/perspective as a part-time MMM contributor, and guy who owns shipping the Gitcoin Digest. If I got any details wrong here, please correct me! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.578703703703703
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#13",
                    "likes": "5",
                    "time": "23/11/2022-01:32:35",
                    "content": "    myceliumcoordinator:  GitcoinDAO launched in May 2021 and has so far shipped  Passport (sort of, as Passport only starts to lay the foundation to prevent sybil attacks).  Conviction Voting  (sort of, it was later abandoned) anything else?    folks, I think this post might be glossing over some core metrics and I suspect is striving to draw a comparison which does not follow.   I was reticent to respond to this post, but I feel a couple more details might provide a balanced picture and help us flip the trajectory. Fair warning, I am a new part-time contributor at Gitcoin, but I am a steward, and I have purchased or earned every single GTC I use to vote.  This is my point of view: I contribute at Gitcoin because the problem Gitcoin is trying to solve speaks to me. But, I purchase and hold GTC because the organization has delivered $72M in funding since inception, the organization has put zero effort into cost offsets, and because by external non-profit benchmarks, costs remain largely in control. Wait what? I though there was a lot of hoopla about out-of-control costs and how Gitcoin was burning through piles of cash?!?   While I think points raised by @lefterisjp and @griff  are valid - I disagree with the conclusions and suggested actions.  More on that in a moment.  But, back to costs. For reference, Charitywatch (a respected charitable giving rating agency) grants an “A” rating for charitable / non profit organizations that spend 25% or less on operations.     myceliumcoordinator:  GitcoinDAO launched in May 2021 on a budget of $1million/month, for a total cost of $17million.   Using $17M as a total operating costs (assuming this is about right), and using ~$70M as funding delivered, Gitcoin has an operational efficiency of around 24%.   That is pretty damn good for new kind of organization that is still building three new software platforms, designing a massive marketing push to leverage those platforms, all while in an exceptionally expensive developer market.  We do have to keep an eye on this ratio especially if we push off / reduce seasonal scope or round results do not deliver. The latent potential and cost offset is where I draw a distinction to conclusions from @lefteris and @griff.  Systemic focus on costs (which we do not do, but should) is critically important for Gitcoin reputation and for driving out waste - recognizing that DAOs are not efficient.  Additionally, market instability and a continued bear market has a high impact/unknown probability risk for the runway. I think we do have to address the runway question given the impact risk.  But given the current runway is sufficient to carry the DAO into the next bull (assuming 3 years left of a four year bear cycle), I would not suggest drastic cost cutting next season.  What would make sense is to design in a series of incremental cost cuts that could be triggered in the event that runway drops to predefined levels.  Asking workstreams to design-in contingency plans allows them to continue developing the aggressive launch plans - but gives them warning that if times get worse, action (they designate) is going to be taken. The other side of that equation is income - the latent potential.  I do not know that the DAO has any hard plans to capture significant value from the workstreams, the platform, or our brand (FDD might be the exception?).  I would look for the DAO to develop a series of income producing building blocks that we could quantifiably hit/miss season on season so we can flip this scrip on this cost/runway discussion. I do think building plans for cost reduction is time well spent, but I would argue it is equally important to figure out how to build the treasury so that we can  increase budgets.  And this looks like super-juicy-ripe whitespace to me. ",
                    "links": [
                        "https://www.charitywatch.org/our-charity-rating-process"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.499174468941911
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/myceliumcoordinator",
                    "index": "#14",
                    "likes": "1",
                    "time": "23/11/2022-15:06:27",
                    "content": "    shawn16400:  But given the current runway is sufficient to carry the DAO into the next bull   This is NOT true.  It is dangerous and negligent to spread the mistruth that Gitcoin has enough runway to carry it through the next bull. A drop in GTC at any time (which happens all the time in bear markets) would severely decrease the DAO’s runway. Please please read this comment from above in the thread.     myceliumcoordinator:  Gitcoin’s burn is $1million/month. At $8m in stables, Gitcoin has 8 months in runway. With 45million GTC worth $1.50 a peace in treasury, there COULD be an additional $67million in runway provided. BUT this assumes $67million in buy pressure for GTC to offset the $67million in sell pressure that would be caused by those 45million GTC hitting the market. I’m not sure that this is something GitcoinDAO can necessarily count on. I think Gitcoin has 8 months in guaranteed runway. And lots of more runway if GTC remains healthy.   This EXACT reciprocal relationship between a project’s prospects and their native token is what caused FTT/FTX to collapse.  FTT was on FTX’s balance sheet, and a loss in confidence in one causes a lack of runway in the other, causing a runaway downward spiral! For this reason I think Gitcoin/GTC should be extremely careful about relying on GTC for runway!      shawn16400:  Using $17M as a total operating costs (assuming this is about right), and using ~$70M as funding delivered, Gitcoin has an operational efficiency of around 24%.   From http://gitcoin.co/results, Gitcoin as an organization has delivered $70m across all of its business lines and including before the DAO launch.  The post-DAO launch Grants amount is much less.   http://gitcoin.co/results is down right now so I cant get the actual amount.     shawn16400:  For reference, Charitywatch (a respected charitable giving rating agency) grants an “A” rating for charitable / non profit organizations that spend 25% or less on operations.   Per http://gitcoin.co/results, GItcoinDAO spends about $3million/quarter and delivers between $2million - $5million/quarter in funding for public goods.  Looks to me that Gitcoin’s actual rating depending on the quarter is a D or a C.      alexdwagner:  I think that it’s worth considering that, since Gitcoin’s inception, the org has been running a grants round for every quarter and has distributed ~$60m to grantees thus far. So if Giveth is shipping more protocols faster, it may be for the reason that they haven’t been running a centralized grants program every quarter which has launched projects like ENS, Uniswap, and the like.   A few things: Let’s reduce our hubris a bit:  Gitcoin didn’t launch ENS, Uniswap, it merely contributed some auxiliary funding in their early days.  Gitcoin should be proud it supported those projects early, but it should avoid alienating those projects by making hubristic claims like “we launched this”.  Gitcoin also failed to capture any upside in these projects, which is a problem for Gitcoin’s own viability. From http://gitcoin.co/results, Gitcoin as an organization has delivered $70m across all of its business lines and including before the DAO launch.  The post-DAO launch Grants amount is much less.   http://gitcoin.co/results is down right now so I cant get the actual amount. Giveth is 1/10th the cost of Gitcoin.  Are you suggesting that the other 9/10ths of the cost structure difference ($1million - $100k/mo = $900k/mo), is due to running a centralized grants program 1x/quarter?  That seems far fetched to me.  I do think it’s good that people are asking the hard questions around reigning in costs at the DAO, and will continue to follow this thread.  I don’t think anyone is actually answering the hard questions though.  Thats a problem.     shawn16400:  recognizing that DAOs are not efficient   This is a generalization.  Giveth IS efficient.  It’d be great if instead of being defensive about Gitcoin’s own performance in launching it’s protocols and giving it’s token utility, people were actually asking @griff what his secret was.  Griff, I’d love to see a post about how Giveth is organized and how it ships so much on so little.  Also @griff do you know how much money has been moved on Giveth? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.336513251133787
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/myceliumcoordinator",
                    "index": "#15",
                    "likes": "1",
                    "time": "23/11/2022-15:16:01",
                    "content": "Here is another example of a successful web3 crowdfunding platform: https://clr.fund/ CLRFund has delivered a live QF protocol on $15k/mo in opex and regularly runs large QF rounds, including the following from the last 6 months:  a $300k ethbogota round  a $350k ethstaker round   ",
                    "links": [
                        "https://xdai.colony.io/colony/clr/",
                        "https://ethcolombia.clr.fund/#/projects",
                        "https://blog.clr.fund/350k-eth-staking-qf-round/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.437905844155844
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#16",
                    "likes": "6",
                    "time": "23/11/2022-17:04:34",
                    "content": "Thanks for the discussion, it is important to illustrate the differing views so that participants can find the cogent points that speak to them.     myceliumcoordinator:  This is NOT true. It is dangerous and negligent to spread the mistruth that Gitcoin has enough runway to carry it through the next bull.   I will try to be more clear.  I agree we need to plan for a downturn, any mature business should have contingency plans for high impact/moderate (or higher) probability events.  Given we don’t know the probability of an extended bear market, planning for this is prudent, which is why I state:     shawn16400:  What would make sense is to design in a series of incremental cost cuts that could be triggered in the event that runway drops to predefined levels. Asking workstreams to design-in contingency plans allows them to continue developing the aggressive launch plans - but gives them warning that if times get worse, action (they designate) is going to be taken.   I also agree that the way crypto valuates magic internet money is kind of cringy - but the math is pretty basic.  Assuming price is consistent, and assuming we don’t do something dumb like dumping 45M GTC on the market all at once, we have the treasury to carry us into the next 5 years as you describe.  if the price drops, see the point above.     myceliumcoordinator:  From http://gitcoin.co/results, Gitcoin as an organization has delivered $70m across all of its business lines and including before the DAO launch. The post-DAO launch Grants amount is much less. http://gitcoin.co/results is down right now so I cant get the actual amount.   Lets hope the data clears up this misinformation.  If we agree to use the DAO launch as a starting point for cost and income - you are correct, we cannot use the $72M which is listed at http://gitcoin.co/results and we do need to back out the prior quarters income before DAO launch.  I did not calculate out the exact amount, but when I eyeballed the relevant quarters - I guessed total income post-DAO launch at about ~$70M.  Which is why I listed it as below:     shawn16400:  Using $17M as a total operating costs (assuming this is about right), and using ~$70M as funding delivered, Gitcoin has an operational efficiency of around 24%.   If you determine a significantly different amount based on the data - cool, lets plug it in and see what the results are.     myceliumcoordinator:  Per http://gitcoin.co/results, GItcoinDAO spends about $3million/quarter and delivers between $2million - $5million/quarter in funding for public goods. Looks to me that Gitcoin’s actual rating depending on the quarter is a D or a C.   I do think it is helpful to have data-based discussions using impartial and informed metrics.  With that information symmetry, we can have clear eyed discussion that recognizes opinion vs. fact that ideally reduces decisions based on emotional appeals and hyperbole.   Your statement above is a great illustration of that in practice.  Do we evaluate this metric every other year (as charity watch does) or do we need a closer to real time metric as you suggest?  Given we are in build mode - what is the right ratio of spending vs. funding?  Should we strive to be an “A” or is “C” more appropriate?   Should this metric drastically improve post protocol launch?     myceliumcoordinator:  This is a generalization. Giveth IS efficient. It’d be great if instead of being defensive about Gitcoin’s own performance in launching it’s protocols and giving it’s token utility, people were actually asking @griff what his secret was.   Yes, stating DAOs are inefficient is a generalization - and I have no hard data. But… I am feeling pretty confident about that generalization.    Speaking for myself, I am not trying to be defensive and my apologies if I came across that way.  I have a different point of view and I am trying to articulate that point of view using logic and data.  I do admit, I am a sarcastic troll by nature - but I try to keep that in check.  Most of the time. to summarize my key points:  Based on external metrics, spending does not look out of control Runway projections do not lead me to drastic cost cutting Gitcoin should develop “in case of fire - break glass” plans in case runway is impacted Gitcoin must build concrete plans to grow income and the treasury I spent waaaaay to much time on this  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.667916981607457
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#17",
                    "likes": "4",
                    "time": "27/11/2022-02:51:47",
                    "content": "    myceliumcoordinator:  It looks like there is millions of dollars per day of volume for GTC. I’m not sure this is true.   GTC circulating supply is 14,211,563 GTC according to Coingecko and the DAO has supposedly ~45 Million GTC the volume is not relevant here, as that is just GTC being passed back and forth. The 45M GTC needs to hit the market slowly.     myceliumcoordinator:  This feels like something that could be a good learning for Gitcoin. Giveth has shipped a handful of protocols in the last 9 months. How is it that Giveth is shipping so much faster than Gitcoin on much less resources?   We don’t hire Americans, as American tech wages are outrageous, we hire people in Latin America, the Middle East and South East Asia that are intrinsically motivated by our mission. Also, we spun out a group called GeneralMagic.io that contracts out to other Impact DAOs for their primary income so that we can modulate our resources without having to hire more people full time when we only need them for a month or two, and we don’t have to hire expensive contractors to do work either (we have GM as high quality low cost contractors that don’t need much training since they spun out of Giveth). For smart contracts, we grew our talent internally and avoid using custom contracts when possible, but when we do, they are audited by my friends at a large discount… I am very lucky to be good friends with some very high profile solidity auditors, that believe in the Giveth vision.     myceliumcoordinator:  Also @griff do you know how much money has been moved on Giveth?   We have seen 1.1M donated on Giveth in the last 11 months. This is all organic, from individual donors, we haven’t ever had donations from large protocols or foundations. We are only recently starting up a fundraising team. This seems to be the secret sauce of Gitcoin that Giveth lacks… a very strong and professional fundraising team. Maybe it is a place where we need to hire Americans and better networked Ethereum OGs… We will see.     shawn16400:  I also agree that the way crypto valuates magic internet money is kind of cringy - but the math is pretty basic. Assuming price is consistent, and assuming we don’t do something dumb like dumping 45M GTC on the market all at once, we have the treasury to carry us into the next 5 years as you describe. if the price drops, see the point above.   The math is basic, but not simple and it doesn’t give us any where near 5 years runway (which would require $60 Mil at our current burn). For every GTC we payout that hits the market, there needs to be new demand for GTC that didn’t exist before, or it lowers the GTC price, lowering the value of the GTC we hold. Since most of the liquidity is on centralized exchanges, its hard to know measure the impact of our spending, but it will be huge. Maybe the next few million GTC can dump on the market without a huge impact, but there is a huge elephant in the room:  What is creating demand for GTC right now? What is supposed to create demand for GTC in the future? This is a critical issue! Also, we are not in a vacuum,  there are a lot of other vested and locked GTC that will also get unlocked that can hurt the GTC price. That 8 mil in stables was raised by selling GTC right? When does that GTC that was sold unlock? What about the original investors, when does their GTC unlock? Who is providing the liquidity on the exchanges? Have we made deals with market makers? What do those deals look like? So many things can hurt the GTC price, especially in this market. We need to cut back our spending. What if we said we can never spend more then the # of GTC that we spend this quarter (around 2 Mil) + any revenue generated… If we tie the GTC price to our budget, that would actually give us 5+ years of runway. ",
                    "links": [
                        "https://gov.gitcoin.co/t/web3-crowdfunding-tool-competitive-landscape/12266"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.553474953617811
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/llllvvuu",
                    "index": "#18",
                    "likes": "2",
                    "time": "05/12/2022-03:47:37",
                    "content": "My 2c:  Tokens indeed shouldn’t be counted in runway. A traditional company has infinite “tokens” in its “treasury”. Hindsight is 20/20 in terms of whether we should have diversified more earlier, but now that we are here it is worth clarifying that tokens are like an at-the-money offering in a worsening bear market, not a balance sheet asset. Although the DAO is aiming to have utility/revenue, that doesn’t preclude donation as a valid  way to fund operations. As someone noted above, typical charities have overhead for this purpose. That said, I don’t have good insight into how the sponsorship situation is now, and I expect many companies/protocol treasuries will tighten belts here too given that previously wealthy sponsors in crypto may not be feeling so wealthy now. It’s very possible that many contributors aren’t in it for the money and that cost-reduction to preserve the long-term vision given current circumstances would be understandable. It’s worth understanding more about the sentiment here.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.377777777777778
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#19",
                    "likes": "3",
                    "time": "05/12/2022-14:12:20",
                    "content": "I would love to see us set a real budget, and reduce the overhead of all these proposals every quarter… Issues to address:  There is way too much work being done to justify the work stream budgets There is no connection between GTC Price and our spending There is no clear incentive for work streams to optimize their spending There is no DAO global budget (currently we spend ~$1M/month)  Let’s simplify things: #1 Set an overall budget in terms of GTC and DAI for 2023 #2 Divide it up by quarter #3 Divide it up by working group #4 Each working group lives within their means, and optimizes accordingly. If there is a project to create token demand, I think there can be some one-off extra proposals on top of things, but until there is real demand for our token, we are living on borrowed time, and regular operations should be restricted from growth and connected to the GTC Price to maintain our runway. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.704545454545454
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#21",
                    "likes": "2",
                    "time": "05/12/2022-17:44:48",
                    "content": "Thanks for these thoughts Griff, Know that we’re working on a new budgeting flow proposal as we speak, so this will help inform this. My main question that comes up here is on #1: How do you identify an overall budget? What are the benchmarks to compare to? We’ve discussed this approach before internally, but it is a very tough nut to crack. For now we have tried to set a budget that reflects the actual needs of our DAO. But as discussed during our Steward call, let’s definitely set up some time soon to dive in deeper here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.998421717171717
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kriak.eth",
                    "index": "#22",
                    "likes": "0",
                    "time": "05/12/2022-18:00:45",
                    "content": "I strongly support this approach and consideration.  We must view our budget natively with GTC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#23",
                    "likes": "3",
                    "time": "06/12/2022-01:41:08",
                    "content": "I very much agree with having some parameters on DAO-wide budget – but will also add that today’s stewards call reinforced for me that we need to get bigger picture thinking on financial sustainability than just “what is our budget”. To me, the existential question of “how does Gitcoin live on in perpetuity?” is still very much outstanding. The token price – the DAO’s lone source of funding, beyond its small pool of stables – has gone down by >75% this year, and we are only just entering a bear market in which it’s not unfathomable to imagine that Governance Tokens, as a construct, could become all but obliterated. Some thoughts:   There is no precedent for any company, let alone a DAO, to live off appreciation of its perceived value while having no plan to bring in meaningful revenue. My impression is that the future ability to live off token utility & resulting demand alone is the default assumption DAO folks are working under when it comes to Gitcoin’s future. I think we need to get real here – while it’s certainly possible, it’s a monumental & unprecedented feat, but is being taken as a given. What would need to be true for the utility ideas @kyle  lays out here to play out, and what does the timeline look like? What are the risks? If the token drops by another 75%, what is the plan?   Alternatively, is Gitcoin a public good and should Gitcoin itself be receiving grant funding (e.g., from corporations, from governments even) to cover its operating expenses?   Alternatively yet, is there any viable path to Gitcoin making sufficient revenue to cover its opex (or even a portion of its opex) and not needing to pull from the treasury so much?   To me, these are the types of questions we need to be boldly & confidently declaring a unified view on as Stewards & Workstream Leads. Not having a clear plan here is the biggest thing that keeps me up at night regarding Gitcoin’s future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.850768555116382
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#24",
                    "likes": "3",
                    "time": "06/12/2022-06:17:01",
                    "content": "GTC holder Gitcoin user and tech employee here To me, the problem is not the $1 million dollars a month/mo spend, a budget, its that GTC holders don’t really see much from the spend. I’ve been following the project since DAO launch.  For $3 million per quarter, the community gets a clunky round on the old Grant platform that almost works.  Forward progress has not been visible. The protocols have been incubating for 18 months since DAO launch and are supposedly starting to launch soon but who knows how long until they hit product market fit, there’s no real updates on GTC utility either.  In the gov forum, there does not seem to be a recognition of the sense of urgency that the bear market has created!  And dApps like GIVETH are showing much more can be done on much less. There is a common saying in tech product management that you can have product done high speed, high scope, or high quality (choose 2 of 3).  So you can have  high speed, high scope, but not high quality high quality, high speed, but not high scope high scope, high quality, but not high speed  I really hope that when the protocols launch it turns out Gitcoin’s product development is high quality, because I dont think it has been high speed.  I also dont think it’s much more high scope than dApps like Giveth [it was noted above that Giveth has shipped 6 products, maybe Giveth is higher scope]. We won’t know until the product hits product market fit or not though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.560677083333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/llllvvuu",
                    "index": "#25",
                    "likes": "2",
                    "time": "06/12/2022-23:30:11",
                    "content": "    annika:   Alternatively, is Gitcoin a public good and should Gitcoin itself be receiving grant funding (e.g., from corporations, from governments even) to cover its operating expenses?    IMHO yes. This is not incompatible with Gitcoin providing services/value to tokenholders. Indeed it’s not unusual at all for nonprofits to have revenue from both donations and sales.     annika:  Alternatively yet, is there any viable path to Gitcoin making sufficient revenue to cover its opex (or even a portion of its opex) and not needing to pull from the treasury so much?   Also support investigating this. “Revenue” is a more specific and clear-minded way to approach “utility” IMHO. In fact, one could argue that they are equivalent, i.e. asking people to hold a token to access “utility” is equivalent to asking for payment (revenue) to access said utility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#26",
                    "likes": "2",
                    "time": "08/12/2022-00:09:13",
                    "content": "Yes, I tried to make this point above.  You’ve made it more clear IMO.  There is enormous pressure to deliver a protocol & passport with proven product market fit ASAP. So far the signs are good, with rounds launching from Unicef, Fantom, and now Optimism. And Passport is being rapidly adopted and extended by the community into use cases such as gating communities and more. That said, the fundamental problem that we are basing our runway at Gitcoin on GTC remains.  Even IF we are successfully performing a forward flip on a highwire - it’s not clear whether we will be sustainable. With that in mind, a few approaches are ongoing that we could perhaps help to boost:  Budget improvements.  As discussed on this week’s steward call, DAO Ops is working on revising Gitcoin budgeting.  As I am also suggesting directly to them, perhaps every workstream should do zero based budgeting as an exercise.  Also up for discussion is whether to denominate all budgets in GTC and then insist on paying people in GTC, thereby tying everyone more directly to GTC success.  I think @griff for eg is especially credible on this and related subjects (see above).  For the zero based budget scenario I think workstreams would be compelled to look at more high leverage approaches like the way Giveth spun out GeneralMagic for eg and relying on external communities.  This exercise might also encourage each workstream to look more immediately at revenues. Discussions about GTC utility.  These discussions are also ongoing however somewhat behind the scenes.  Perhaps they need to be more front and center at least in steward conversations.  Put the stewards to work to think them through, solicit feedback from the broader community and so on?   Again, if we request zero based budgeting it might escalate the importance of revenue generation / utility creation as well.  Some of the interesting ideas I’ve heard discussed for eg could see GTC play a role in helping to protect and market grants rounds - via staking.  I do think discussing revenues vs. GTC utility itself could be useful as well.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0793103448275865
                }
            ]
        }
    ],
    "group_index": "236"
}