{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-building-gitcoin-using-quadratic-funding-for-subtraction/13015",
            "title": "Gitcoin Building Gitcoin: Using Quadratic Funding for Subtraction ",
            "index": 13015,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#1",
                    "likes": "11",
                    "time": "20/02/2023-16:24:37",
                    "content": "Thanks to @kevin.olsen for thoughts and help in drafting these ideas. Gitcoin has made massive progress over the last few months in becoming more community-first, and high agency between protocol launches and broader changes to the DAO’s overall structure. As it starts to plan for the next stage of development though, it would be worth considering one more step forward towards a subtraction mindset: post-S17, Gitcoin should leverage quadratic funding rounds for funding its own shared needs, both when it comes to (a) external creative (including developer) communities and (b) meaningful portions (>20%) of internal team budgets. Why does this matter? As many stewards have noted, Gitcoin currently spends a lot on its core operations, and does so without a lot of immediate accountability. A lot of the DAO’s time is still focused internally instead of engaging and rallying the broader ecosystem around the kind of change they want to see. Fortunately, Gitcoin already has tooling that helps enable the community to get directly involved: Allo protocol. By running Gitcoin Community rounds the DAO can not only empower more people to get involved in governance, but also build more empathy around where the current tooling is successful and where it needs improvement. Some areas we already know there are gaps (and progress being made) include:  Overall usability of protocols Prevalence of fraud in rounds Consistency / reliability of funding for grantees Robustness of the current QF implementation vs. alternatives Impacts of operational policies (e.g. clawbacks)  In the process of solving these issues for one DAO we can solve them for others, and in turn value is being put through the protocol every step of the way rather than taken from it. What would a Gitcoin Building Gitcoin round look like? To keep things simple, a first experiment on this front could involve funding developers that want to build modules on top of the protocol (maybe dominance assurance contracts, QV, streaming payouts, etc), and a separate pool could be for grassroots community efforts that are currently missing across the DAO (incentivised DAO citizens support, discord integrations, community activations and grassroots marketing). These pools could mirror the first “application” and “community” pools Gitcoin Grants started with years ago; rounds that helped make the Ethereum ecosystem what it is today. Applications could be scoped to only include a few key projects to start, for example a maximum of 10-15 of the highest leverage projects decided on by CSDO or a similarly informed body. Donors in these rounds could be restricted to funding in GTC to truly ensure that those donating are aligned with the efforts of Gitcoin and not griefing the system (although this won’t stop all attacks). Round runbooks created by PGF could be used to help rotate who is responsible for running these rounds, and ensure that there are no gaps in how the process is being documented. Who’s already doing this? Nouns. Projects like Nouns already run similar experiments and are all the better for it: votes go through Agora and smaller “workstream” proposals go through Prop House. The result is that the Nouns community is able to learn from the tools they build every step of the way and embrace a truly open source spirit. Memetically, Nouns has become one of the strongest projects out there and is starting to think deeply about how its treasury and tools could make an impact. Juicebox. Juicebox runs all of its development through a core treasury powered using their protocol. Everyone building is on equal footing and gains stake cooperatively based on their contributions, and it empowers people to first give contributions and then find value later. These examples were chosen not only because they’re strong projects, but because they’re projects we should be empowered by the way we work to engage closely with and collaborate with. Currently with our workstream structure this is challenging. What are the risks? There are honestly a decent number of very real concerns with this approach. Quadratic funding still has a number of issues like the ones mentioned above, and if ramped up too quickly it could counter-intuitively slow development as a result. This is why these experiments should start small, and fund non-core efforts while eventually further supplementing the core team. If this is successful, more of the DAO’s operational expenses and funding allocation decisions could be shifted over this way. Fundamentally though, there’s no better way to learn than to experience these problems head on. If we’re hesitant about experimenting in this way, we should take the time to reflect inward and ask if these concerns are felt by the broader community. ",
                    "links": [
                        "https://prop.house",
                        "https://juicebox.money/@juicebox",
                        "https://info.juicebox.money/dev/build/getting-started/",
                        "https://gov.gitcoin.co/t/refactoring-gitcoin-what-falls-between-the-cracks/13026"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8373737373737375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "4",
                    "time": "21/02/2023-14:02:52",
                    "content": "Yes. Yes. Yes. +10 We might even consider the context and reference point each group has to create better outcomes. A few examples:  Operations is likely context heavy and may be best done as a quadratic vote by DAO contributors. Maybe JokeDAO is a model for proposing work. Empowering our community might include DevRel, Open Data, and program manager training. It would be interesting to see how a dedicated body select eligible projects would change results. Maybe the Open Data Community would be best suited to select data projects which can be proposed by anyone? Maybe not? Experimenting at stages BEFORE voting. How do we ideate a best proposal? How do we create eligibility criteria.  Most of these questions don’t have objective answers unless you take a stand on the “efficiency vs innovation” tradeoff. Therefore, some level of expertise guiding eligibility of grants in this domain, as opposed to any token holder, seems like a good middle ground. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.714285714285715
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#3",
                    "likes": "5",
                    "time": "21/02/2023-14:28:54",
                    "content": "This is great @ceresstation. Thanks for posting! I’m very supportive of this and see the Gitcoin building Gitcoin rounds as an invitation to bottoms-up coordination that’s been absent from our DAO. I’ve put some more thoughts around this really enables us to improve and evolve in a post I just put up here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.4
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#4",
                    "likes": "7",
                    "time": "22/02/2023-12:08:07",
                    "content": "    ceresstation:  Impacts of operational policies (e.g. clawbacks)   I see two issues with this approach:  My interpretation is that quadratic funding is a kind of popularity contest.  Projects that do well, do pretty well, but a lot of projects don’t get much funding.  Risk is that fundamental efforts inside the DAO don’t get funded.  But we do stand a pretty good chance of winning the contest if supported by influencers. Accountability is already a challenge in the DAO - I think the clawback could be interesting to address the issue.  NET: I love this direction.  I think this approach gets us closer to a thin DAO focused on supporting the protocol post stabilization and opens up the protocol to a plurality of service providers, and the workstream / subdao is but one option.   Add to that a tri/bicameral governance structure of round operators / stewards / insiders and it could get really interesting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.403846153846153
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#5",
                    "likes": "6",
                    "time": "23/02/2023-02:46:53",
                    "content": "I’m a huge fan of this idea. The best way for us to find better ways to make QF work successfully for our grantees is by dogfooding it ourselves. I would push for retrospective QF rounds that are minimally curated and run on a regular, frequent basis (maybe every two weeks). This would allow funds to flow places where value is already being created and carries less risk. It would incentivize more community members to meaningfully contribute to Gitcoin and provide a way for community members who are already contributing to receive some rewards. Lastly, it really incentivizes being public about the work you’re doing which naturally creates more accountability.     ceresstation:  Fundamentally though, there’s no better way to learn than to experience these problems head on. If we’re hesitant about experimenting in this way, we should take the time to reflect inward and ask if these concerns are felt by the broader community.   Well said I think by dogfooding ourselves we would more readily experience the inconsistencies in QF. One pattern I see over and over again is grantees who earn a lot in one round (sometimes over $100k) then earn much less the next round. Grantees almost always have to seek additional sources of funding outside of Gitcoin and only think of us as ‘legroom’ and rarely a primary funding source. What would have to be true for us to be a source of stable, consistent income for more projects? The inconsistency in QF may be smoothed out by Dominance Assurance Contracts because if donors see a project they supported in the past isn’t reaching the amount it needs this quarter, they will be more likely to fund it. Plus, it could also reduce overfunding and overall make QF a source of more stable income for more participants. Internal to Gitcoin, DAC’s will help prevent launching projects that receive some support but not enough to take off. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9467592592592595
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#6",
                    "likes": "7",
                    "time": "23/02/2023-18:41:45",
                    "content": "So I think this is the interesting part of this approach actually. Even in your response you’ve identified a key problem here which is the fact that popularity definitely impacts quadratic funding results (I’d actually argue that this problem extends to lots of democratic systems more broadly). The question is then: how do we adjust our instance of the protocol to mitigate these concerns, because they’re certainly concerns others in the community have voiced. I don’t actually know what the right solution is here (although I have ideas) but we’re in the right direction by identifying the problem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.840097402597403
                }
            ]
        }
    ],
    "group_index": "328"
}