{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/knowledge-transfer-who-is-a-cofounder-of-gitcoin/11371",
            "title": "Knowledge Transfer: Who is a cofounder of Gitcoin? ",
            "index": 11371,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "10",
                    "time": "26/08/2022-17:47:08",
                    "content": "The founding of Ethereum is famously chaotic, with many people claiming to be cofounders at various times of the project.  Apparently there is not good documentation of who Vitalik offered this title to, and it has led to people trying to leverage the social capital of the title ‘cofounder of Ethereum’ in order to boost their own social capital illegitimately. I am writing this post to proactively document the agreements I’ve made with people over the years with various parties about their ability to use the title ‘CoFounder of Gitcoin’.  I hope this post will help those associated with Gitcoin to have clarity about who is a cofounder of Gitcoin and who is not, which will provide preventative clarity to the question.  Phase 0 - Pre-Consensys When Gitcoin was being built in Summer 2017, I briefly partnered with Nathan Sobo to build Gitcoin.  Nathan’s engagement only lasted for 2-3 weeks, and he signed over all rights to the project to me at that time.   Nathan is great, and I really enjoyed working with him, but Nathan is not presently a cofounder of Gitcoin.  Phase 1 - Consensys When Gitcoin joined Consensys, I offered the title of cofounder to the first 4 people that I hired in June 2018, on the terms that they worked full time at the project for 4 years full time. Here is an email that was sent to all 4 of these people, to document this arrangement.  Screen Shot 2022-08-26 at 11.50.21 AM1920×779 56.5 KB  None of these 4 people ended up staying for 4 years at Gitcoin, and so per the terms laid out, they may not use the title Cofounder of Gitcoin any longer.  Phase 2 - Gitcoin Holdings Around the time Gitcoin spun out of Consensys and became Gitcoin Holdings, I offered the title of “cofounder of Gitcoin” to Scott Moore and Kyle Weiss, on the same terms as the Phase 1 - that they stayed working at Gitcoin full time for 4 years from their start date. As far as I know, both of these individuals are still working on GitcoinDAO full time, and per the terms that I offered, they are permitted to use the title as long as they remain full time employed as of 4 years from their start date. Scott joined Gitcoin full time May 2018.  4 years from that is May 2022. Kyle joined Gitcoin November 2020.  4 years from that is November 2024.  Phase 3 - Gitcoin DAO As Gitcoin is now a DAO that is disaffiliated from supermodular.xyz, it is now up to the governance process to define how they gate the titles of people associated with the DAO, including the cofounder title.  Summary TLDR  There are many people who have made important contributions to Gitcoin over the years, but not all of them are cofounders of Gitcoin.  These people may use the title “early contributor to Gitcoin” or “early team member of Gitcoin”.  I would be supportive of a project to discover, specify, verify, and recognize those contributions so they are preserved and celebrated in posterity. As of August 2022, my interpretation of the above history & neutral reading of these agreements is that Kevin Owocki, Kyle Weiss, and Scott Moore are the current cofounders of Gitcoin. The DAO owns this now + I defer to DAO governance on the future history of this state.  I hope this post helps document the history here for posterity. ",
                    "links": [
                        "https://www.linkedin.com/in/nathan-sobo-92b46720/",
                        "https://media.consensys.net/gitcoin-joins-consensys-announces-pilot-projects-f5a0955de9d6",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/d/dc7507785e90a2f55502d62bfe66b83463566648.jpeg",
                        "https://decrypt.co/66541/ethereum-gitcoin-raises-11-million-spins-out-consensys",
                        "https://gov.gitcoin.co/t/gitcoin-digest-31-2022/11392"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.063131313131313
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#2",
                    "likes": "2",
                    "time": "27/08/2022-07:24:08",
                    "content": "Interesting post      owocki:  I would be supportive of a project to discover, specify, verify, and recognize those contributions so they are preserved and celebrated in posterity.   Hmm, I wonder which workstream should be empowered to conduct this discovery, Daoops I guess. I think that everyone agrees that you, Scott and Kyle are the co-funders of Gitcoin(and we should all thank you for creating it   ), but just as an example I believe that @DisruptionJoe @annika  are clearly co-funders of the DAO judging by their knowledge, involvement and leadership skills. I wonder if this is the logic here, or if it’s only about who co-funded Gitcoin org and/or the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.45
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "8",
                    "time": "29/08/2022-11:02:11",
                    "content": "I don’t lay any claim to this title, but thank you for your recognition. I am happy and privileged to have been an early contributor to Gitcoin DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#4",
                    "likes": "10",
                    "time": "31/08/2022-17:35:21",
                    "content": "Someone privately asked me why I asked Scott/Kyle to be cofounders, noting that it is rare for new cofounders to join a project after it’s been alive for a few years.   I’m answering here to daylight the thought process. In general, I believe that projects (especially those whose starting market fit is different than their final market fit) evolve over time and that there are different phases of leadership throughout the growth/evolution of the project.  Someone can be a leader in Phase 1 and not scale to Phase 2, likewise if you have someone who joins and is adept in a team of 50, they may not be adept at the phase in which there are 5 contributors.  I expect cofounders to (0) have a foundational impact (1) persevere through tough times (2) scale from phase to phase, which is why the 4 year term was attached to the offers above. Specifically to Kyle/Scott, my offer of the title of cofounder came at different times of existential crisis for Gitcoin, where they were well positioned to solve the existential crisis and followed through to get the project through the crisis (which is the literal definition of founding an adept organization: establishing or originating an institution or organization).   Scott: During The Great Bear, the primary existential threat to Gitcoin was being shut down by our primary funder, Consensys.  Dozens of projects were shut down by Consensys during this time.  The way we stayed ahead of the great bear was to make sure we were generating revenue and market traction, and Scott was an integral part of this - taking us from $0/mo in revenue to around $100k/mo in revenue (depending on the month).  I’ve been told that great founding teams are 1 part product, 1 part sales, and 1 part operations, and Scott was prettymuch the sales leg of that tripod in the 2019-2020 era.  Kyle: Kyle joined at the end of The Great Bear, a time when morale was very very low, the product + operations teams were in shambles insofar as no forward progress could really get made.  We were failing to iterate to keep up with the market, failing to spin out of Consensys, failing to raise money, and this meant that the status quo, current course & speed, was a slow death and fade into irrelevance.  Previous leadership had either failed to scale or sometimes outright quiet quit their designated leadership role at Gitcoin, so I could not turn to them.  In at least one case we had issues that were even deeper than that.   Kyle joined in Q4 2020 in order to help solve some of these “morale” problems, but quickly grew into a leadership role, helped turn the team, hire new talent, and figure out “what would have to be true” for us to avoid the slow death and fade into irrelevance\" course and figure out Gitcoin’s next chapter.  Kyle was the “ops” part of the tripod.  Ultimately, these were judgement calls that were up to leadership and highly situational and contextual to Gitcoin’s history as a company from 2017-2021. I hope this history/context is useful, and again - its up to the DAO governance to figure out what to do with this information in the future. ",
                    "links": [
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855",
                        "https://en.wikipedia.org/wiki/Quiet_quitting",
                        "https://avc.com/2013/08/mba-mondays-turning-your-team/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.739064558629776
                }
            ]
        }
    ],
    "group_index": "190"
}