{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/building-momentum-around-grants-2-0/10709",
            "title": "Building Momentum Around Grants 2.0 \\xf0\\x9f\\x9a\\x80 ",
            "index": 10709,
            "category": [
                "\\xf0\\x9f\\x8c\\xb1 Grants"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "2",
                    "time": "25/05/2022-21:47:02",
                    "content": "Since the hard conversations around S14 budgeting, it seems to have become clear to many of the DAO memberes that Grants 2.0 is existential to the DAO.  I can really feel a shift in momentum in the last 2 weeks.  I have been very impressed to see that momentum around Grants 2.0 has been picking up over the last few weeks. What I’ve observed: 0. @lthrift and @kevin.olsen have been doing a Grants 2.0 roadshow - showing off the strategy and architecture.  Weekly demos of the round manager, grant hub, and dpopp for the last 2 weeks.  (here is the latest)  Grants 2.0 is being proposed as major part of the daos essential intent for the next 12-18 months I’ve seen many workstreams re-orienting their roadmaps around Grants 2.0.  I wanted to start this thread to ask the question:  What would have to be true for the DAO to really begin to see momentum around Grants 2.0? What would have to be true for the DAO to build momentum around Grants 2.0? What would have to be true for the DAO to create great software => become a market leader => get to sustainability (and beyond it, to thriving) => handsomely reward its constituents => repeat (the virtuous cycle I personally think the DAO should be aiming)?  ",
                    "links": [
                        "https://gov.gitcoin.co/t/proposal-community-input-on-gitcoindao-s-draft-purpose-essential-intents/10662"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Change to proposal pipeline"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.072916666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "1",
                    "time": "25/05/2022-21:47:54",
                    "content": "    owocki:  What would have to be true for the DAO to really begin to see momentum around Grants 2.0? What would have to be true for the DAO to build momentum around Grants 2.0?   I would suggest that people set aside time to watch the weekly demos + provide comments on them  on a weekly basis.  No better way to understand the progress than to watch the demos (or, when available, dogfood yourself).  And the builders could use the positive feedback on their builds! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.111742424242425
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "2",
                    "time": "25/05/2022-22:00:20",
                    "content": "These are the two cadences I really see working well now.  weekly cycles of product demos  Screen Shot 2022-05-25 at 3.58.20 PM1238×288 53 KB   quarterly cycle of feedback with the market  Screen Shot 2022-05-25 at 3.58.26 PM2170×368 118 KB  Would love to build on top of this cadence with more rituals that create momentum.  As the draft essential intent says we should “Create and promote clear and engaging rituals, communication channels, and messaging that build shared context among GitcoinDAO’s contributors, stewards, and supporters.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.571428571428571
                }
            ]
        }
    ],
    "group_index": "115"
}