{
    "poll_list": [
        {
            "id": "0x6cf2d1e9d1f00ed74d296b719c46327d66a1af2be5275c3eb545f878d8890614",
            "title": "dCompass S13 funding request",
            "discussion": "",
            "body": "TLDR:\nThe dCompass workstream is requesting a total of 38k GTC for Season 13.\nThe focus for this season will be on:\n- Rewarding users going through pathways & quests\n- Beta release & deployment on mainnet and Polygon\n- Onboarding new projects, DAOs and protocols\n\n*Season 13 budget request*\nWe’re requesting a total of 38k GTC that will be used to compensate contributors and to handle various expenses such as the smart contract audits and the infrastructure costs (Ceramic Node and a few other instances running on AWS).\n\nSuccess metrics and KPIs\nOur workstream is successful if we have a decent MVP deployed in a production environment at the end of Season 13.\n\nSome KPIs\n- Get at least 6 projects to purchase a sponsor pass\n- Create pathways and quests with at least a total of $100K rewards distributed\n- Get at least 1000 users that engage with a project, pathway or quest",
            "choices": [
                "Fund dCompass as requested",
                "Don't fund dCompass as requested"
            ],
            "scores": [
                4018883.760088044,
                1674.8621483665927
            ],
            "start": 1645207240,
            "end": 1645556400,
            "snapshot": "14231546",
            "state": "closed",
            "author": "0xc2E2B715d9e302947Ec7e312fd2384b5a1296099",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "id": "0x93d337378cc8c6c507b88ebb518ddd57f772bb010b75cb9daaae03974eeacfdb",
            "title": "Fraud Defense & Detection (FDD) S13 budget request",
            "discussion": "",
            "body": "Workstream Mandate: Defend Gitcoin (Grants, DAO, & future products) from threats to its legitimacy, credible neutrality, and sustainability.\n\nFDD is requesting $879,000 (93,500 GTC*) to fund Season 13 (S13) and replenish its reserves for S14.\n\nHigh Level Budget Breakdown\nSeason 13 Budget Total = $596,295 = 74.1k GTC ($8.05/GTC*)\nPLUS Season 14 Reserves = $596,295\nTotal Needed = $1,192,590\nMNUS Current Reserves = $313,000\nTotal Amount requested at this time = $879,590 =109,265 GTC ($8.05/GTC*)\n*Prices last updated 2/16/22\n\nThe GTC total will be adjusted based on the current market value at the time this proposal is moved to Snapshot and to Tally. The vote will be to send $879,590 in GTC at the current price when moved to Tally or the 20 day moving average (whichever is lower).\n\nFDD Season 13 (Q1) 2022 Budget 8\n\n*TL;DR*\n\nSeason 13 Financials\nSeason 13 is $155k increase = 34% budget increase\nSeason 13 Round Deliverables:\n\nWe currently have 18 outcomes for the next 90 days. Each outcome has 3 measurable key results that will determine if we achieved the outcome.\n*Ground Control (Operations)*\n - 90% of decisions for mid-season budget changes and new proposals will go through our FDD Operating System rather than just Disruption Joe\n- Disruption Joe will participate in our “source council 2” rather than having a workstream lead salary\nLong term metric goals will be set to define the health of our initiatives\n\n*Sybil Defenders*\n- GitcoinDAO will run the end to end operational processes of the anti-sybil ml pipeline reducing our dependence on Blockscience\n- A simulation software will be developed to let us better anticipate attacks and possibly increase training opportunities for the ml models\nA human evaluations app built for effective training, improved inter-reviewer reliability at a lower cost per evaluation, and continuous data insights\n- Work will continue on our long term vision A Community Based Roadmap for Sybil Detection Across Web 3 1\nWe will gain soft commitments and technical requirements from 3 partners to a sybil data sharing network built with a web 3 ethos & ethics\n\n*Grants Investigation Agency (GIA)*\n- We are using the GIA tool built last round to review the estimated 7-800 new grant applications that come in.\n- Our goals include increasing the number of reviewers per grant, lower the cost per review, and define a mechanism design that will allow us to open up the review process to anyone via staking of GTC\nBuilding the decentralized appeals integration and testing it\nReviewing and updating ALL of the grant eligibility policy documentation\n\nThis budget was reviewed by many stakeholders including the FDD Multisig Oversight Council, other workstream leads, and some Gitcoin Holdings team members. One question that came up multiple times was “If you had to slash $x from your budget, do you know what you would cut?” The answer is yes. However, it wouldn’t be to the benefit of Gitcoin. We could operationally function at half this budget for GR13, but we wouldn’t be doing anything to build scalability into our tech or our processes.",
            "choices": [
                "Fund FDD as requested",
                "Do not fund FDD as request"
            ],
            "scores": [
                2902493.432814721,
                450105.311
            ],
            "start": 1645037582,
            "end": 1645470000,
            "snapshot": "14212732",
            "state": "closed",
            "author": "0xc2E2B715d9e302947Ec7e312fd2384b5a1296099",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "Gitcoin FDD S13 funding request ratification",
            "date": "Proposed on: Mar 6th, 2022",
            "yes_votes": "5.29M",
            "no_votes": "0"
        },
        {
            "title": "Gitcoin dCompass S13 funding request ratification",
            "date": "Proposed on: Mar 5th, 2022",
            "yes_votes": "5.63M",
            "no_votes": "0"
        },
        {
            "title": "Canceled proposal: Fraud Defence &amp; Detection (FDD)…",
            "date": "Proposed on: Feb 22nd, 2022",
            "yes_votes": "320.96",
            "no_votes": "27"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-fdd-workstream-season-13-budget-request/9826",
            "title": "[Proposal] FDD Workstream Season 13 Budget Request ",
            "index": 9826,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "20",
                    "time": "04/02/2022-19:21:13",
                    "content": " FDD Workstream Season 13 Budget Proposal Workstream Mandate: Defend Gitcoin (Grants, DAO, & future products) from threats to its legitimacy, credible neutrality, and sustainability. FDD is requesting $879,000 (93,500 GTC*) to fund Season 13 (S13) and replenish its reserves for S14.  High Level Budget Breakdown Season 13 Budget Total = $596,295 = 63.5k GTC ($9.40/GTC*) PLUS Season 14 Reserves = $596,295 Total Needed = $1,192,590 MNUS Current Reserves = $313,000 Total Amount requested at this time = $879,590 =93,500 GTC ($9.40/GTC*) *Prices last updated 2/9/22 The GTC total will be adjusted based on the current market value at the time this proposal is moved to Snapshot and to Tally. The vote will be to send $879,590 in GTC at the current price when moved to Tally or the 20 day moving average (whichever is lower). FDD Season 13 (Q1) 2022 Budget   TL;DR Season 12 Financials  FDD made approximately $70k via good treasury management in S12 $40k over budget was intentional as we spent ½ of what we gained in treasury management efficiency. Total Season 12 (Q4) spend was $440,000. Bi-weekly payments were made to contributors in a transparent manner.  Season 12 Accomplishments   Sybil attack rate jumped from around 6% of total contributions in GR11 to 26% in GR12 and FDD flagged 114,000 of them The anti-sybil ml pipeline had a 140% flagging efficiency rate meaning we detected 140% of what human evaluators alone would have detected. Increased human evaluations completed to over 6,000 - a 320% increase! Built GIA software, tested on disputes, ran data analysis, and will be using it for all grant reviews in GR13. (This is better than comments on a notion page ie. previous system) GIA test had 53 participants - A huge decentralization compared to 5-10 hired evaluators Specifications made for a decentralized appeals system using Celeste or Kleros  Detailed Season 12 Review: State of FDD - Season 12 Review Season 13 Financials  Season 13 is $155k increase = 34% budget increase  Season 13 Round Deliverables  We currently have 18 outcomes for the next 90 days. Each outcome has 3 measurable key results that will determine if we achieved the outcome. Ground Control (Operations)    90% of decisions for mid-season budget changes and new proposals will go through our FDD Operating System rather than just Disruption Joe   Disruption Joe will participate in our “source council” rather than having a workstream lead salary Long term metric goals will be set to define the health of our initiatives   Sybil Defenders  GitcoinDAO will run the end to end operational processes of the anti-sybil ml pipeline reducing our dependence on Blockscience A simulation software will be developed to let us better anticipate attacks and possibly increase training opportunities for the ml models A human evaluations app built for effective training, improved inter-reviewer reliability at a lower cost per evaluation, and continuous data insights Work will continue on our long term vision A Community Based Roadmap for Sybil Detection Across Web 3  We will gain soft commitments and technical requirements from 3 partners to a sybil data sharing network built with a web 3 ethos & ethics   Grants Investigation Agency (GIA)  We are using the GIA tool built last round to review the estimated 7-800 new grant applications that come in. Our goals include increasing the number of reviewers per grant, lower the cost per review, and define a mechanism design that will allow us to open up the review process to anyone via staking of GTC Building the decentralized appeals integration and testing it Reviewing and updating ALL of the grant eligibility policy documentation    This budget was reviewed by many stakeholders including the FDD Multisig Oversight Council, other workstream leads, and some Gitcoin Holdings team members. One question that came up multiple times was “If you had to slash $x from your budget, do you know what you would cut?” The answer is yes. However, it wouldn’t be to the benefit of Gitcoin. We could operationally function at half this budget for GR13, but we wouldn’t be doing anything to build scalability into our tech or our processes. Seeing the total donations increase round over round (S11 = $1.61m / 16.6 users to S12 = $3.2m / 27.2k users) at 50 - 100%, an increase of 34% to our budget seems justified. Especially considering the rate at which the sybil attacks are increasing (300-400%) and the complexity added to the grant eligibility process via side rounds.  Milestone Report Full details here: FDD Season 13 Budget Request Details  Season 13 Top Level OKRs  Sybil Defenders - Legitimacy  Gitcoin OKR: Decentralization FDD Objective: Build a community driven anti-sybil pipeline KR 1: # of contributors to the open-source feature engineering pipeline during season x KR 2: (Cost / Human Evaluation) goes down while maintaining inter-reviewer reliability KR 3: # of ecosystem data partners  Grants Investigation Agency - Credible Neutrality  Gitcoin OKR: Scalability FDD Objective: Increase participation, transparency, and legitimacy in Grant Eligibility process KR 1: Average reviewers per grant KR 2: Total number of reviewers during season x KR 3: Grant time to activation during review period  Ground Control - Sustainability  Gitcoin OKR: Decentralization FDD Objective: Be able to measure FDD health & increase the score KR 1: Contributor satisfaction metric go up KR 2: GIA execution score go up KR 3: Sybil Defense execution score go up  Each of these top level OKRs has a mandate steward driving FDD to achieve them along with 2 of our multisig oversight group who are assigned as their designated Subject Matter Expert Zone (SME Zone). The top level OKRs provide semi-constant metrics we can use to see FDD progress over the course of 12-18 months. We ran almost 15 hours of strategy workshops to determine which outcomes we needed to achieve during Season 13 to achieve consistent results on our top level OKRs. (Some of which still need to be baselined during S13) Outcome owners then selected their Key Results to indicate success over the next 90 days for each chosen outcome. This process was part of our new FDD Operating System (FDD OS) which will allow us to create hierarchies of work while removing hierarchies of people.  Financials Season 12 Budget  Season 12 Funds Spent to Date $416,613 as of 2/1/22. There is one more weekly epoch left to pay contributors meaning our total spend for the defense portion of the Q4 budget proposal will be $40-45k over budget. This is a conscious decision made by the workstream to use part of the earnings from strong treasury management to start new initiatives, improve a few ongoing ones, and fund the transition to the FDD-OS v1.0 governance model.  Funds Carried Over From Season 12 $313k will be carried over from Season 12. This includes $278k in reserves plus $35k in treasury management gains.  Budget Increase From Season 12 to Season 13 FDD will have spent $440k on defense in Season 12. The Season 13 ask is for $595k which is a $150k (34%) increase. Season 13 Budget  Current Contributors FDD had 8 full time contributors going into Season 12. After spinning out other workstreams, we now have 6. With our effort to pay a base to all source council members for FDD, we will be at 9 FT for Season 13. Format Below: Name (Outcomes owned)  Workstream Lead Disruption Joe (Payments / FDD OS / ASOP Transfer / SDW Discovery)  Mandate Stewards Ground Control (Ops): SirLupinWatson (Contributor Experience / Human Evaluations) Sybil Defense: Omnianalytics: (Data Analysis / Community Model / Trust Bonus Update) Grants Investigation Agency: David Dyor (Policy / Appeals)  Source Council Includes all above plus all squad drivers (outcome owners) Nollied (Data Storage Layer/Matrix/GIA Development) Kishorditya (Mandate Delivery) Waka (Contributor CAP Table Modeling) Zer8 (GIA Reviews) BFA (GIA Rewards) The average Source Council member will make $90,000 USD annually as a combination of:  $500 Base (Flat amount paid weekly) $500 Coordinape ($500/ SC member distributed via Coordinape) $100 Participation (Show up for Weekly Update / Report Payments on Time) $250 For each outcome owned $250 Mandate Steward Bonus $500 Workstream Lead Bonus 10% SC Bonus paid quarterly based on OKR completion  In our modeling, the top 3 earners would make an annual income of $150k, $120k, and $109k as workstream lead and mandate stewards with 2 or 3 outcomes owned. The bottom three who only own one outcome each would earn $49k, $57k, and $58k. This is highly aligned with their levels of participation and skills needed for their various positions within the workstream.  Contributors FDD had 61 total contributors in Season 12. 20 are currently “trial” contributors. The first season a contributor participates is their trial season. During their trial season, they are not able to make proposals to the source council. FDD will not be hiring on a “full time” or “part time” basis during season 13. Our source council could all be considered full time. Regular contributors range from 1-4 hours per quarter up to 30+ hours per week.  Notable Achievements A full review of Season 12 Accomplishments can be found here: State of FDD - Season 12 Review Table of Contents:  Direction - Objectives & Key Results  Sybil Defenders Grants Investigation Agency Ground Control   Financials  FDD Q4 2021 (Season 12) Budget Current Holdings Value Provided   Decentralization  Decision Making with FDD-OS v1.0 Source Council Roles Positions Phasing Out the Stream Lead Role   Season 12 Accomplishments  Anti-Sybil Policy Research Operations User Support Evolution   Proposal Body  High Level Budget Breakdown Season 13 Budget Total = $596,295 = 63.5k GTC ($9.40/GTC*) PLUS Season 14 Reserves = $596,295 Total Needed = $1,192,590 MNUS Current Reserves = $313,000 Total Amount requested at this time = $879,590 =93,500 GTC ($9.40/GTC*) *Prices last updated 2/9/22 The GTC total will be adjusted based on the current market value at the time this proposal is moved to Snapshot and to Tally. The vote will be to send $879,590 in GTC at the current price when moved to Tally or the 20 day moving average (whichever is lower). FDD Season 13 (Q1) 2022 Budget  Multisig Address & Keyholders Gnosis Safe address: 0xD4567069C5a1c1fc8261d8Ff5C0B1d98f069Cf47 Workstream MultiSig is a Gnosis Safe 4/7 setup with the following keyholders who act as board members or oversight to the actions of this stream. Each multisig keyholder has a responsibility to work with a mandate steward leading our top level goals in their “Subject Matter Expert Zone”. (Many are skilled in multiple zones but are only assigned to one to ensure their ability to keep up with the dynamic changes and help guide our work.)   Disruption Joe (Workstream Lead)  Operations / Collaborative Design / Mechanism Design / Growth Former Gitcoin Holdings Grants Ops - First to leave company for DAO    Michael Zargham (Ops)  ML / Fraud Detection / Ethics / Systems Design Gitcoin Steward / Blockscience CEO / cadCAD    Angela Kreitenweis/Conectopia (Ops) -  Mechanism Design / DAO Comp / Research / Policy Gitcoin Steward / Token Engineering Academy    Trueblocks (Sybil)  Data Analytics / On-chain data / Commons Management Gitcoin Steward / Trueblocks LLC    Armand Brunelle (Sybil)  ML / Software Development / Contributor Experience Gitcoin Steward / FDD Contributor, Mandate Steward, Source Council    Bob Jiang (Grants)  Scrum/Agile / Chinese Ecosystem / Customer Support Gitcoin Steward / Former FDD / Gitcoin User Support Lead / ENS Steward    Annika Lewis (Grants)  Venture Capital / Operations / Strategy PGF Workstream Leadership / Grants Program Lead    All multisig keyholders are represented by their LLC and are not personally connected or liable for actions of the FDD or GitcoinDAO. All keyholders are confirmed as committed to the responsibilities outlined in the FDD-WG Multisig Keyholder Responsibilities 1 document. This budget request as per established norms for FDD budget requests is set to double our estimated quarterly budget for defensive measures to ensure that this workstream can properly function without issue in the instance of delayed votes, market downturns, & political issues.  In Conclusion: From Disruption Joe FDD has been in the process of progressively decentralizing itself while learning to balance efficiency and decentralization. Our new FDD Operating System allows us to continue removing authority given (top-down) to authority recognized (bottom-up). Our model is built to follow core principles of subsidiarity and parpolity. FDD is a single customer entity with the mandate of defending Gitcoin from threats to its legitimacy, credible neutrality, and sustainability. We are working hard to not only defend Gitcoin, but to do so in a way that what we build is modular, composable, and extendable to the rest of the DAO and web 3. The structure we are built on should be sustainable as long as its output is positive-sum. As the FDD workstream lead, I intend to continue this role as a participant after releasing my workstream lead rights to our source council and the processes of the FDD OS over the next 2-3 quarters. I intend to leave FDD with a structure that will efficiently produce its intended outcomes and adapt to changing circumstances. Most importantly it will dissipate when it is no longer needed just as my leadership role will dissipate when our structure is sustainable. Web 2 and all of human history was built on a finite amount of resources which could represent value. This perverted the incentives causing people to create collective entities (corporations / governments / institutions) which exist for a purpose when they are created, but would turn parasitic when that purpose was no longer needed. They would continue to exist for the sake of existing with embedded growth obligations causing the good-natured individuals to turn a blind eye to the dystopia their collective decisions would cause. We now have infinite scarcity to represent the values we truly care about. It is now more profitable to cooperate than to compete. Therefore, the incentives guiding Gitcoin to a solarpunk future include us investing in our values and moving our investments as our needs change. When an entity no longer has a purpose, it no longer needs to exist because the composable structure DAOs are building IS the future of work. Individuals no longer need to turn a blind eye to the parasitic or cancerous nature of their employer. They will simply exit. This will happen either gracefully or tragically, but it will happen. I hope that my role in FDD will be an example of the former. I hope to model this transition in the near future and continue to serve the greater purpose of Gitcoin - To build and fund the public good ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1-AYF28k2tyv0-eDhfqcLdqymCRcp6CdTsDgkflsAqMU/edit?usp=sharing",
                        "https://hackmd.io/@bsci-gitcoin/HJdaK6yoY",
                        "https://medium.com/block-science/gitcoin-grants-round-12-evaluation-results-bf01fe4c9641",
                        "https://gia-testing.ethelo.net/page/welcome-to-the-gia",
                        "https://docs.google.com/document/d/1fg5FOINQx1jf6ao8OiPbjmYkM1TMFzUb9ipz2Afzwpo/edit?usp=sharing",
                        "https://gitcoin.notion.site/FDD-Source-Council-Pay-Model-cb5e03cc0f2a4752b698370b7622dcfa",
                        "https://gitcoin.co/blog/a-community-based-roadmap-for-sybil-detection-across-web-3/",
                        "https://docs.google.com/presentation/d/1J8CZrd0hb60sSc3uDj1891urMwZwlrSGspA3xyrTOIA/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1-AYF28k2tyv0-eDhfqcLdqymCRcp6CdTsDgkflsAqMU/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/14vrj34-A-LwIPBGLTeWbOVdVuG8Jl2o1UZYeKp-zrl0/edit?usp=sharing",
                        "https://docs.google.com/document/d/1fg5FOINQx1jf6ao8OiPbjmYkM1TMFzUb9ipz2Afzwpo/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/14vrj34-A-LwIPBGLTeWbOVdVuG8Jl2o1UZYeKp-zrl0/edit?usp=sharing",
                        "https://docs.google.com/document/d/18k7I7hkhyldFqzrRZLc9uBshDWpwFtVyV9Bkk8V0jjk/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/data-analysis-for-season-14-budget-proposals/10456/6",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Community and engagement",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.398307793093069
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/akrtws",
                    "index": "#2",
                    "likes": "7",
                    "time": "06/02/2022-14:26:52",
                    "content": "Thanks for this extensive overview @DisruptionJoe . The FDD machinery to defend Gitcoin turns out to be a vital component of our infrastructure, and I’m impressed by the results this workstream team delivered. We had several rounds of reviews for the new season, including a critical assessment of the objectives, available here. As multisig keyholder, I fully support the proposal for Season 13. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1477272727272725
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#3",
                    "likes": "7",
                    "time": "07/02/2022-17:12:31",
                    "content": "I really appreciate you putting such detail into this proposal Joe. I’ve been part of the fdd for a few seasons now and I am one hundred percent committed to supporting the fdd.  Let’s keep this momentum going.  I think the team keeps getting stronger and with the organizational changes like Notion overhaul and compensation systems being integrated we are building a foundation for success. I think this proposed budget recognizes the importance of solid dao systems, in addition to our Mission-First focus.  As our dao and fdd get more established we become even more capable.  The fdd is growing and this proposed budget will ensure we can keep the mission growing as well. David Dyor / blazingthirdeye ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.972222222222222
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#4",
                    "likes": "7",
                    "time": "07/02/2022-18:13:59",
                    "content": "I can honestly say that the FDD is really succeeding in decentralization and empowerment, as well as being avantgarde from a governance and implementation standpoint. Actually, I’m the living example that this workstream is successful in it’s progressive decentralization. Started here as a simple reviewer 6 months ago, gained trust, had some web 3 experience, got even more involved and became squad lead. After 5 months I was proposed a Source Council role. This has been one of the most fulfilling, exciting and innovative parts of my journey in web 3.0 until now and I have explored a lot of frontiers and DAOs until the present moment. From a growth and innovation perspective the FDD is the place to be  , joking, but not really. Seeing the FDD evolve in this way and being part of it is amazing. From GR12 to GR13, the FDD has managed to become more efficient at protecting from Sybil attacks, more decentralized all while experimenting and innovating… These being said, I hope that my skills, vision and values can continue to add value to the FDD and I can’t wait for GR13 to begin  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.732142857142858
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tigress",
                    "index": "#5",
                    "likes": "5",
                    "time": "07/02/2022-19:20:31",
                    "content": "    DisruptionJoe:  Individuals no longer need to turn a blind eye to the parasitic or cancerous nature of their employer. They will simply exit.   This is what I did end of January 2022… simply exited web2. And now I am starting to become a contributor of FDD. And yet, also within this future of work, that we are now perceiving as our presence, we need to carefully balance simplicity and the right amount of structure to function as our backbone. Soft front, strong back. Looking forward to supporting the FDD OS and Contributor Experience. Thank you all for the trust upfront  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.213203463203463
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Alex-moore2021",
                    "index": "#6",
                    "likes": "4",
                    "time": "07/02/2022-23:03:48",
                    "content": "Killer work Joe. I learn alot from your posts.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lee0007",
                    "index": "#7",
                    "likes": "4",
                    "time": "08/02/2022-02:41:11",
                    "content": "As always impressed by your detailed and thorough proposals @DisruptionJoe. Sorry, I was unable to join the team at this time but I 100% support your leadership and path to decentralise and empower your team. Results speak for themselves. Keep up the amazing work FDD  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kishoraditya",
                    "index": "#8",
                    "likes": "4",
                    "time": "08/02/2022-04:54:04",
                    "content": "Awesome work @DisruptionJoe and the whole stream! The granularity given into the thought for the next Q is really great! Been a part of FDD for half a year now, and I really love the discussions phase that everything goes through before finalizing things, that part, specifically, makes me believe in the direction we are moving to realize the decentralized future! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.845238095238095
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/anneconnelly",
                    "index": "#9",
                    "likes": "5",
                    "time": "08/02/2022-05:04:25",
                    "content": "Looks great @DisruptionJoe - thanks for the detail in the request. It’s very helpful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#10",
                    "likes": "5",
                    "time": "08/02/2022-13:21:37",
                    "content": "Love the “source council” experiment, Joe One more comment is “would you share the KR scores every month?” (like the OKR tool) There are detailed plan and clear squad in FDD work stream, and clear OKR settings. So as multi-sig holder, definitely I would support FDD for season 13. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#11",
                    "likes": "4",
                    "time": "08/02/2022-14:07:09",
                    "content": "Yes Bob. In our FDD Weekly Update meetings (which are open to everyone to watch) each outcome owner covers their recent accomplishments, what they are working on this week, their issues, blockers and shoutouts. Each 90 day KR is self judged by the outcome owner as Green = gonna hit it, Yellow = at risk, Red = Don’t think we can make it. The 90 day krs are used for a bonus portion of source council pay that is dependent on all of the OKRs being hit. For example, if we complete 80% of the OKRs, then we all get 80% of our potential bonus amount. This incentivizes individual outcome owners to report accurately and the other source council members to step up to help where there are issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#12",
                    "likes": "1",
                    "time": "09/02/2022-04:09:58",
                    "content": "    DisruptionJoe:  Sybil attack rate  jumped from around 6% of total contributions in GR11 to 26% in GR12 and FDD flagged 114,000 of them   This is a huge increase. Were there materially large changes to the Algos that we are using to detect these? Have we gone back through GR11 data to see if the new algo would catch missed sybil in GR11?     DisruptionJoe:  We currently have 18 outcomes for the next 90 days   This is pretty immense (the number of outcomes you are driving towards). There are only 12 listed in the proposal, are there another 6 missing from the proposal? There is an interesting evolution of FDD that is unlike other workstreams. When I look at PGF, which is arguably the heart and soul of the DAO, they are modeling much of their work off of a similar ethos to what Peter Pan has talked about.  The entire DAO will be organized as sub-DAOs and ideally two-pizza teams:  PGF has three/four “sub-DAOs” (lets call them sub streams) that have less than 5 people per sub stream who are compensated. This structure lacks the same level of anti fragility, but also offers accountability on outcome with more budget efficiency. (more on this below)     DisruptionJoe:  Disruption Joe will participate in our “source council ” rather than having a workstream lead salary   I really like the council idea and commend you for trying this out. The Incentivization on showing up on time is a great way to align participant incentives to the outcomes you want (punctual attendance to run efficient meetings!) This approach seems like it would create an accounting nightmare though. The complexity in tracking and paying people feels rather burden some. This is my opinion on the cumbersome accounting, but I am interested in seeing how this works out. As I dig into the roadmap you have linked and outlined, this summary at the top really stands out:  The FDD workstream budget was approved and began to decentralize the process by having the community take over responsibility of approving grant eligibility, paying contributors to evaluate grants and accounts flagged as sybil by the ML algorithm, and even paying the contracts to SMEs guiding the machine learning efforts The future of sybil detection includes a “community data lake” with anonymized data allowing data scientists anywhere to compete to find the best models using an open-source feature engineering pipeline. Sybil accounts will be detected across Ethereum addresses, DIDs, and Gitcoin accounts. Eventually, meta-models will give even greater insights.  This was the dream we had for the workstream in its inception, and reading this blog post was a great and inspiring refresher of the dreams we held when launching the workstream.  I am really torn on if now is the right time for us to expand to the great vision this budget is advocating for (and if we should be paying for three teams to build ML models, for anti fragile and evaluation purposes) Frankly, It’s a moonshot. Going straight from crawl, to run… scaling immensely to hit strides, build out the data lake, scale ML teams, all while creating an operating system and operations layer to manage it all. when is the right time for FDD to seek additional customers to validate this vision? This vision was born based on a single team’s needs (Gitcoin’s Grants development team) and continuing to fund it without confirmation on a broader market need feels like we are gold plating a system that is for a single customer. I am interested in acting in good faith and continuing to fund as is for S13, but I would request more feedback before funding in S14. I am also happy to help as much as I can to make intros and help validate this as I love the vision!     DisruptionJoe:  We are using the GIA tool built last round to review the estimated 7-800 new grant applications that come in.   this is another example where we are building and scaling without stopping to evaluate how to solve the problem from first principles. For example, have we considered requiring 25 DAI to be staked per new grant request to help increase the fraud tax on this process? If so, apologizes for throwing stones, I do worry that scale has been the default state for FDD (in many cases for good reason, as it reduces fragility).     DisruptionJoe:  We could operationally function at half this budget for GR13, but we wouldn’t be doing anything to build scalability into our tech or our processes.   When I review the budget, It looks like roughly $596K is budgeted for, but your request is asking for twice this (roughly) - why the reserves? Further, there are folks that seem to potentially be getting double paid on the ground control budget. Here is my take as a single steward who has tried to really dig in and understand the proposal.  The Ground Control work seems like it may be duplicative. As some of that work is being covered/compensated by DAO Ops. I would strike most of that budget if I am being prudent. I would also deny the reserves. FDD has been a great steward of the budgets it has received and the reserves feel unnecessary. GIA seems like the wrong solution to the problem, but I would leave that $75K budget intact with the hopes of us partnering with GPG to build in a staking model in GR14, or another software based hurdle (recognizing a change for GR13 is likely too aggressive). Sybil Defenders budget seems pretty heavy, but I am not an expert in how to cut there. Knowing BlockScience is at least half the cost here, it would be great to get the model owned by the DAO so that those funds could be re appropriated… right now it feels like we are double paying, but I am fine with that if there is an end in sight. I would advocate strongly that we do not continue to fund the Block Science requirement in S14 as we would have funded all the work necessary for the community to take this over in S13. I would also leave Source Council as is as I really appreciate the though that went into crafting the experiment. It seems to be a primary funding mechanism for contributions and I would love to see how it evolves and what FDD learns.  Given this, I would personally like to see a budget request closer to $555K. With $313K in reserves, an actual request of $275K (35K GTC) feels more than sufficient even with some price volatility. This assumes that in S14, we can reduce costs as the “double payment” for BSCI and Community run models goes away, the GIA work is hopefully greatly reduced (if GPG can help build staking into grant creation or some other software deterrent to the deluge of new spammy grants), and DAO Ops continues to support and fund work that FDD relies on (DevOps, Consulting, Accounting, etc.) ",
                    "links": [
                        "https://pet3rpan.mirror.xyz/5nsl1Xnr-BwmNAPoNeMlghPiTFMhxNg4zE7suaR0sXc",
                        "https://gitcoin.notion.site/FDD-Source-Council-Pay-Model-cb5e03cc0f2a4752b698370b7622dcfa",
                        "https://gitcoin.co/blog/a-community-based-roadmap-for-sybil-detection-across-web-3/",
                        "https://docs.google.com/spreadsheets/d/14vrj34-A-LwIPBGLTeWbOVdVuG8Jl2o1UZYeKp-zrl0/edit#gid=1381529984",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kyles-voter-guide/9856/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.049863488783943
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#13",
                    "likes": "4",
                    "time": "09/02/2022-12:53:35",
                    "content": "    kyle:  Were there materially large changes to the Algos that we are using to detect these? Have we gone back through GR11 data to see if the new algo would catch missed sybil in GR11?   No. There was some code refactoring for performance but no substantial updates to the code. Although we did increase our number of human evaluations up to 6,000 which lets us know that our statistical validation of the model is more accurate.     kyle:  This is pretty immense (the number of outcomes you are driving towards). There are only 12 listed in the proposal, are there another 6 missing from the proposal?   There are 18 listed here in the budget request details. This is 3 top level outcomes with nested OKRs for outcomes owned by individual squads (each of which could grow to be it’s own subdao). The average top level goal has an “essential intent” for the “subdao” which is a guiding statement for the next 12 - 18 months. For example, Grants Investigation agency has an essential intent of “Increasing legitimacy and transparency in the grant eligibility processes”. This has 3 metrics which can tell us if we are improving quarter to quarter. Both the essential intent and these metrics will be reviewed each quarter to determine if the direction is still appropriate. Then, within the Grants Investigation Agency, there are 5 outcomes that bubbled up from our strategy sessions. Each of these outcomes has a driver. They selected their KRs for us to measure their success over the next 90 days. Each of these subdaos (grants, sybil, ops) easily has a 2 pizza team. The core of each is small with maybe 6-10 key contributors. The reason FDD has such large contributor numbers is because we have the human evaluations and grants reviews which pay a large number of people relatively small amounts.     kyle:  PGF has three/four “sub-DAOs” (lets call them sub streams) that have less than 5 people per sub stream who are compensated. This structure lacks the same level of anti fragility, but also offers accountability on outcome with more budget efficiency.   FDD basically has 3 subdaos each with 3 source council members (Full time) and maybe 3-4 part time contributors. This seems the same to me. I think our difference is that we structured in a way that contributors that participate in any one of the 3 subdaos can easily bounce between the 3. I think the Peter Pan one is basically what we mimic and are moving to as seen in our roadmap of progressive decentralization. I think it is also important to understand that this can be fractal.     kyle:  I am really torn on if now is the right time for us to expand to the great vision this budget is advocating for (and if we should be paying for three teams to build ML models, for anti fragile and evaluation purposes) Frankly, It’s a moonshot. Going straight from crawl, to run… scaling immensely to hit strides, build out the data lake, scale ML teams, all while creating an operating system and operations layer to manage it all.   Why else are we here? Governments and institutions no longer pay for the moonshots and R/D needed for public infrastructure. A sybil defense network is a base level public good for the metaverse. It’s like having a fire dept. Unless your town is super small, you need one. Additionally, all the advancements made by the big ones will be open source and free for the smaller town fire departments to build upon. In the modular, extendable, plug-in architecture we are discussing for dGrants with aqueducts driving the donations, defending the legitimacy and credible neutrality of a round through sybil detection and grant curation is the most likely reason any org will have to create an aqueduct next to the goodness of their collective hearts. Less abstract - Yes, we are moving all the blockscience work to be run by the DAO. Yes, we are funding 2 distinct models right now. Yes, we need them if we want to scale. One is entirely focused on being the main one we operationalize during the round. The other is figuring out how to get unknown community contributors to be able to participate at various access levels to collaboratively build and update the features and eventually the model itself. Sure, we could save money by not running these in parallel, but why would we do that? We are building public goods that the world needs. It is public infrastructure that won’t get funded anywhere else which will enable a cambrian explosion of innovation in how we allocate resources. The idea that we should “cut the fat” because we CAN run the operations on a smaller budget rather than take the moonshot that could solve the problem properly is the mindset and incentive model that drove web 2 to be extractive. imho. We, Gitcoin, users and stakeholders are here to build a better way. Once this is built, the business model is not that of web 2. (Finding customers and extraction) The business model is that the matching pool will grow through aqueducts and donations  which choose Gitcoin because we can offer the turn key services with legitimacy. The treasury will grow via more people recognizing our values and seeing that groups like FDD, Moonshot, PGF, etc deliver. We turn their capital into public good. They can either donate and lose their capital or they can participate by holding GTC and letting the DAO catalyze their capital into impact. The gitcoin stakeholders will grow as the many subdaos mature. Some will have customers, some will need governance, some will find their role being closer to knowing how to solve problems rather than solving problems. https://gov.gitcoin.co/t/the-gitcoin-anti-sybil-flywheel/9417     kyle:  This vision was born based on a single team’s needs (Gitcoin’s Grants development team) and continuing to fund it without confirmation on a broader market need feels like we are gold plating a system that is for a single customer.   Yes it is. The mandate of FDD is to defend Gitcoin. When Gitcoin no longer needs this service, or doesn’t want it from us, then it should simply dissappear. However, the people who are participating as contributors can continue to organize. I’ve been told we shouldn’t be looking for customers or thinking about our own business models in the past, but it seems like the thinking around that is coming around the corner now. (Probably, because it is inevitable for every subdao) Sybil detection across web 3 will require it’s own incentive mechanism at some point rather than relying on Gitcoin funding it. How do we get that conversation started? (One of our sybil outcomes is to get buy in from community partners to share data for features in a community data lake)     kyle:  this is another example where we are building and scaling without stopping to evaluate how to solve the problem from first principles. For example, have we considered requiring 25 DAI to be staked per new grant request to help increase the fraud tax on this process? If so, apologizes for throwing stones, I do worry that scale has been the default state for FDD   Yes. We did consider it and still are considering it. (It says that further down in the tl;dr.) Staking and any incentive design choice can have 2nd and 3rd order effects we might not foresee. Therefore, we have been doing the research to know that we are making the best decisions we can before making them.     kyle:  It looks like roughly $596K is budgeted for, but your request is asking for twice this (roughly) - why the reserves?   Yes. We have done the reserves every budget and explain in the budget that part of our work is mission critical and we don’t want to be unable to perform due to political hiccups or other unknown issues that might come up. I don’t think a 6 month budget, especially after having done this and not only been responsible, but made gains ($70k) through treasury management. (Only GTC, Eth, stables)     kyle:  Further, there are folks that seem to potentially be getting double paid on the ground control budget.   There is one person who was moved to DAOops who is getting a weekly amount from this stream. How many streams can you assign to that person without increasing their pay? Are there others?     kyle:  The Ground Control work seems like it may be duplicative. As some of that work is being covered/compensated by DAO Ops. I would strike most of that budget if I am being prudent.   Exactly what part of the Ground Control budget is duplicative? I’ll list them all here to make it easier to discuss. (Format = Outcome Name (Outcome owner) | S13 Outcome Budget Total = % of FDD S13 Total Budget) Payments (Joe) | $6.5k = 1.1% Contributors are paid on-time and understand how their payments work This $500/wk is going to the person handling all of FDD payments. FDD OS (Joe) | $10k = 1.7% Contributors all have a voice in a self managing system We need someone to drive the operationalizing of having this system. Initial setup and organization first. Tracking steps and creating runbooks for it to work. Plus some expert guidance and help here and there. Contributor UX (SirL) | $14k = 2.3% Contributors understand their role, responsibilities, know how to show up and put a participation “Level Required” effort toward the mission This is NOT duplicative to the GitcoinDAO onboarding as FDD has certain info, needs, and rituals we have with our contributors. Learnings from FDD have been brought into other streams before too. Mandate Delivery (Kish) | $14k = 2.5% FDD effectiveness in delivering on its mandate is easy to communicate FDD needs to know how well its outcome owners are performing and how well it is doing on delivering it’s mandate. If the models we create work, then the rest of the DAO could use them Contributor CAP (Waka) | $4k = 0.7% Model and simulation is available to analyze collective decision outcome variations For us to launch bottoms up initiatives, this is critical info. Data Storage Layer (Nollied) | $22k = 3.7% Contributors can easily access data without compromising security I think this one is obvious, it would probably spin off to DAOops soon, but FDD needs it and DAOops didn’t include it in their budget nor did they start a conversation with us about it. We can’t just not perform our core function because another stream “should” own the work. Data Analytics (Omni) | $10k = 1.7% Collect and repurpose data analysis for continuous insights Right now we are doing a lot of one-off analysis that get used once and then thrown out. Kevin had a bounty for data analysis on grants. We could take the great code people write and collect it to setup dashboards to run a data report after every round with the same set of insights people found in the bounty rather than look at it once and forget it. Overall, I don’t see anything overlapping except the one person who we should discuss in the payments.     kyle:  I would also deny the reserves. FDD has been a great steward of the budgets it has received and the reserves feel unnecessary.   I would not deny the reserves. In fact, I’d recommend that every workstream participating in CSDO guidelines add reserves to their budgets.     kyle:  GIA seems like the wrong solution to the problem, but I would leave that $75K budget intact with the hopes of us partnering with GPG to build in a staking model in GR14, or another software based hurdle (recognizing a change for GR13 is likely too aggressive).   There are two problems here. Staking solves one of them, GIA software solves another. Staking, how might we raise the cost of fraud for registering sybil grants? or HMW decrease likelihood of sybil attackers making new grants? GIA software, how might we dynamically let communities determine and update the inclusion criteria for an ecosystem, cause, or round, and then curate grants according to the dynamic policy? or HMW allow self curation of criteria and grants by the community?     kyle:  Sybil Defenders budget seems pretty heavy, but I am not an expert in how to cut there. Knowing BlockScience is at least half the cost here, it would be great to get the model owned by the DAO so that those funds could be re appropriated… right now it feels like we are double paying, but I am fine with that if there is an end in sight. I would advocate strongly that we do not continue to fund the Block Science requirement in S14 as we would have funded all the work necessary for the community to take this over in S13.   This is our plan going forward. However, we may want to continue working with Blockscience in other ways.     kyle:  I would also leave Source Council as is as I really appreciate the though that went into crafting the experiment. It seems to be a primary funding mechanism for contributions and I would love to see how it evolves and what FDD learns.   Awesome. We are very excited to do this.     kyle:  Given this, I would personally like to see a budget request closer to $555K. With $313K in reserves, an actual request of $275K (35K GTC) feels more than sufficient even with some price volatility.   I appreciate your feedback but for reasons listed above I don’t agree. Our defense budget is rising by 34% while the round totals are rising at 50-100%. We are also still early and investing in a better future. Your recommendation seems to be to cut all the innovation and only fund the items needed to operationally run a round. I think a good goal for FDD is to continue to lower our rate of budget growth. Last round was 50%, this one 34%. To do this while supporting defense of Gitcoin Grants which is growing at an exponential pace seems to be a good place to be. I’d encourage stewards to look at what we set out to do and if we achieve those goals. FDD has been incredibly transparent and has set very clear top level goal metrics to improve round over round and clear OKRs for each outcome funded to keep us accountable. ",
                    "links": [
                        "https://gov.gitcoin.co/t/the-gitcoin-anti-sybil-flywheel/9417",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kyles-voter-guide/9856/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.693900329828901
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#14",
                    "likes": "4",
                    "time": "09/02/2022-17:29:14",
                    "content": "Big fan of the work that is being done by this group. The little window I have had into this workstream through working on the GIA project has inspired me by what is possible in this space. What a great breakdown of all that is involved Joe. Couldn’t support this more. Can’t wait to see all the epic stuff coming from this team in the season ahead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.010416666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#15",
                    "likes": "5",
                    "time": "09/02/2022-17:32:09",
                    "content": "    kyle:  GIA seems like the wrong solution to the problem, but I would leave that $75K budget intact with the hopes of us partnering with GPG to build in a staking model in GR14, or another software based hurdle (recognizing a change for GR13 is likely too aggressive).   I see the logic of a staking model but I worry that would create additional friction for donations when we are trying to reduce friction and onboard more people. Also this doesn’t address the subtlety of decisions that are not cut and dry. There is still a need for reviewers and having a process to do the review that is transparent and inclusive Reduces the pressure and responsibility on any small group of individuals. It also provides a model for greater decentralization of this kind of process and provides opportunities for meaningful participation for DAO members. Of course I’m biased because I’m involved in the project but I wanted to add more context for discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9907407407407405
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/vgk",
                    "index": "#16",
                    "likes": "6",
                    "time": "09/02/2022-17:54:21",
                    "content": "FDD is vital to Gitcoin and Joe is a public good. Love this thorough overview - it has my support. Thanks for putting this together! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.550000000000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#17",
                    "likes": "6",
                    "time": "09/02/2022-18:42:01",
                    "content": "Joe is a public good  Maybe even a public great ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Yalor",
                    "index": "#18",
                    "likes": "3",
                    "time": "09/02/2022-22:57:12",
                    "content": "Chiming in here on the latest FDD budget, some of the numbers that have been presented are truly impressive  great work here team.  Increased human evaluations completed to over 6,000 - a 320% increase!  Sybil attack rate jumped from around 6% of total contributions in GR11 to 26% in GR12 and FDD flagged 114,000 of them  We currently have 18 outcomes for the next 90 days. Each outcome has 3 measurable key results that will determine if we achieved the outcome.  Regarding this specific portion of the proposal:  Season 13 is $155k increase = 34% budget increase  Given that the work-stream has proven it’s responsibility with the previous budget and has delivered on all it’s stated goals to date I would say the 34% increase is well justified, based on the overall decrease from the 50% increase of the last season.  I think a good goal for FDD is to continue to lower our rate of budget growth. Last round was 50%, this one 34%. To do this while supporting defense of Gitcoin Grants which is growing at an exponential pace seems to be a good place to be.  Complexity builds, sybil attacks are increasing, thus the size of the team and the value of their work is increasing. We must keep that in mind as we scale up.  an increase of 34% to our budget seems justified. Especially considering the rate at which the sybil attacks are increasing (300-400%)  Personally I think this is essential ecosystem infrastructure and we need to double down on these efforts to ensure that we are keeping the contributors well compensated for their work, while keeping an eye towards the progressive decentralization of the work-streams, which @DisruptionJoe has been doing a kick-ass job at thus far  My feeling is that we need to trust the work-stream leads and rally behind them at this time, approve the budget set out so that they can keep driving towards their goals. I don’t see any double spending as far as mentioned for contributors and furthermore if that were the case I’m positive we could solve with a simple policy of base wages from a single stream or a flexible compensation plan that utilized coordinape or some other such tool. It is common in this space for people transitioning from one team to another to have a honeymoon period where they receive rewards for contributing on multiple fronts, but that needs to be evaluated on a case by case basis as some people are simply capable of doing more and deserve to be compensated at such a rate. Again I leave that decision up to the work-stream leads to solve internally and I don’t intent to review all their deliverables. They will self regulate their budget and have autonomy in how to apply it, or the entire fluid nature of the DAO and it’s work-streams will revert back into some draconian accounting nightmare from the Web2 era. FDD deserves the full budget requested and the reserves, to cut the budget at this time and reduce the spend simply because we can work at half capacity seems to work against our goals of pushing towards high impact outcomes and providing equitable compensation for this diverse group of contributors who have clearly proven their worth to the DAO. In terms of moving towards a more sustainable and incentive driven approach to funding this stream, I think it’s a bit to early to introduce anything like that, but when the time is right trust me I will be at the ready to bring the right supportive partners & orgs into a discussion about this topic and it’s overarching utility to the entire grants ecosystem. I know @DisruptionJoe has already applied some of his early thinking around this for review from members of the MetaCartel and our associated grant pipelines, FDD has been committed to defending Gitcoin in it’s mission to Fund Public Goods and we must continue supporting the efforts of their contributors as they scale up their operations and streamline their contributor incentive mechanisms. Thanks for all the work you guys do, & the thoughtful comments on it by others in this thread  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.592080642490479
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#19",
                    "likes": "4",
                    "time": "09/02/2022-23:56:48",
                    "content": "    DisruptionJoe:  Sybil detection across web 3 will require it’s own incentive mechanism at some point rather than relying on Gitcoin funding it. How do we get that conversation started?   I love this question, and I think tools like dPoPP may help. Also, introducing staking on identity (even outside of dPoPP) could offer an income source that also incentives participants to hunt for Sybils. I would love to brainstorm more of this.     DisruptionJoe:  How many streams can you assign to that person without increasing their pay?   I don’t think this pay is a problem as well as each workstream understands its happening. I was under the impression contributions form DAO Ops were also covering this work. I am fine with splitting payments (and making sure a fair total salary is in place). I am less interested in each workstream negotiating with people what they believe is a full time compensation just to find out later they are getting paid by others as well. Now, this is really tricky when we evaluate the performance of individuals who may be participating in other DAOs as well. It’s rare any one person can work two FT jobs, and deliver results as if they were.     DisruptionJoe:  I would not deny the reserves. In fact, I’d recommend that every workstream participating in CSDO guidelines add reserves to their budgets.   I understand we differ here. No other WS is requesting this, and this tells me it is not a DAO wide norm, but something unique to FDD. I am down to chat about this at CSDO and see if we want to adopt a new standard like this in the future.     DisruptionJoe:  GIA software, how might we dynamically let communities determine and update the inclusion criteria for an ecosystem, cause, or round, and then curate grants according to the dynamic policy?   This is really great. I didn’t realize this was a capability of the system. Have we used GIA to do this yet, or is this future state we are talking about?     DisruptionJoe:  Our defense budget is rising by 34% while the round totals are rising at 50-100%. We are also still early and investing in a better future. Your recommendation seems to be to cut all the innovation and only fund the items needed to operationally run a round.   I think we better aligned in the other thread, but just for folks here. I am actually not calling for any budget reduction, I am advocating for the elimination of the reserves and using some of the current reserves. I do think the comparison to round size and your budgets is a red herring. Other Workstreams have not grown in the same way, despite being the ones who are running, marketing, programmatically supporting the rounds.  I appreciate that I am a single voice, and I am highly supportive if other stewards want to fund as is. I am merely calling out adjustments I would like to see in order to support the proposal. (and trying to seek context for myself and the benefit of others). I have learned a lot about FDD as part of this review, and I am more excited for the work that is happening as a result. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7267223989162765
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#20",
                    "likes": "5",
                    "time": "10/02/2022-13:03:22",
                    "content": "    kyle:  Now, this is really tricky when we evaluate the performance of individuals who may be participating in other DAOs as well.   That is why there should be clear and measurable outcomes. I don’t need to worry about whether that person is also working for another DAO if I have onboarded well and leveled up an individuals access to opportunities. They are delivering or not delivering. Now of course we will ask and in FDD I work to coach the outcome owners to assess this BEFORE commiting. One advantage of the way FDD works is an outcome owner can say, “you seem great, we have 4 hours a week available for you” then they can determine if that person fits within a week or two. Imagine you own the outcome of going through all the current grant eligibility policy and deduping/updating it. When you present your weekly accomplishments to all of FDD on Monday, you will probably want to update your team to be successful. There is also a DAO vibe similar to the old saying, “Only look in your neighbors cup to see if they have enough.”     kyle:  This is really great. I didn’t realize this was a capability of the system. Have we used GIA to do this yet, or is this future state we are talking about?   This round we are moving from using GIA for the disputes only, to using it for all the approvals of new grants. Next round we will probably focus on dynamic criteria to adapt it for side rounds. Another cool part of that is we could use it for other things too. Things like filtering proposals, community assessment of work quality, and even reviews of new DAO contributor applications.     kyle:  I think we better aligned in the other thread, but just for folks here. I am actually not calling for any budget reduction, I am advocating for the elimination of the reserves and using some of the current reserves.   We have a clear difference of opinion here, but aren’t as far off as I initially thought we were. I do believe that FDD has a norm of receiving the reserves. I’d argue that instead of a brand new steward (lol) pushing us to change our norms, we use your suggestion and have CSDO discuss and present a unified solution prior to Season 14. This seems reasonable to me because we have:  a proven track record of not abusing the reserves in the past $70k in treasury management gains last season (more than the entire DAO combined) High transparency - Perhaps the most transparency of any workstream (DAOops, which uses our system or maybe moonshot, but it is onchain rather than human readable)      kyle:  I have learned a lot about FDD as part of this review, and I am more excited for the work that is happening as a result.   Honestly, thank you for your time. I felt a little blindsided at first because we didn’t discuss this before getting to the public forum, but I think you made the right decision to post this and follow up on every thread. It is a good example of the behavior we would like to see from all stewards! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.886500509294627
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/akrtws",
                    "index": "#21",
                    "likes": "8",
                    "time": "10/02/2022-13:53:16",
                    "content": "    kyle:  when is the right time for FDD to seek additional customers to validate this vision?       DisruptionJoe:  A sybil defense network is a base level public good for the metaverse. It’s like having a fire dept.      The Gitcoin Anti-Sybil Flywheel   What I think is super interesting is the possibility that we could one day export the sybil resistence created on Gitcoin to the rest of the ecosystem via something like a decentralized version of Proof Of Personhood Passport  - basically enabling dApps to see how sybil resistence a user is in 1 API call.       The Gitcoin Anti-Sybil Flywheel 🤖 Meta-Governance       There is a large opportunity to promote sybil resistence in the web3 ecosystem that I believe that Gitcoin is uniquely positioned to help with.   Why this matters By promoting sybil resistence (sockpuppet account resistence), we could move the ecosystem from 1-person-1-vote or 1-cpu-1-vote systems to 1-human-1-vote systems.  This unlocks   quadratic funding quadratic voting Gini coefficient measurements UBI one-person-one-vote DAOs data collectives sybil resistant airdrops & other use cases we h…     In fact, Sybill resistance is vital to many DAOs, and many are struggling how to protect their decision making and reward systems! Proves a) the value produced in FDD work stream - and b) yes, agree - let’s explore how to make this a building block for Web3, and (yes!) a component in Gitcoin value streams and token utility. I support that FDD work stream aims for the moonshot version because of the opportunities here - and I’m looking forward to see progress towards a PoPP in upcoming seasons!     DisruptionJoe:  We, Gitcoin, users and stakeholders are here to build a better way. Once this is built, the business model is not that of web 2. (Finding customers and extraction)   Couldn’t agree more!  ",
                    "links": [
                        "https://proofofpersonhood.com/",
                        "https://gov.gitcoin.co/t/the-gitcoin-anti-sybil-flywheel/9417",
                        "https://en.wikipedia.org/wiki/Sybil_attack"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.434027777777778
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Huxwell",
                    "index": "#22",
                    "likes": "7",
                    "time": "10/02/2022-19:21:40",
                    "content": "I support this proposal and I’m looking forward to collaborate with the GIA for the review process in dCompass! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#23",
                    "likes": "8",
                    "time": "10/02/2022-20:44:57",
                    "content": "Thank you Huxwell! We also look forward to collaborating with dCompass. One of my OKRs is to actually create a training quest in dCompass and that surely will give us insights that may prove valuable for the review process.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#24",
                    "likes": "6",
                    "time": "10/02/2022-22:50:19",
                    "content": "Great discussion going on here that is answering questions for many.  Thank you Kyle for challenging the fdd to be fully accountable to the the community and ensuring the excess gets trimmed. It is pushback like that which make for an accurate and lean budget.  Every workstream should be trying to provide and solicit feedback like this imo.  I have a few thoughts and comments provided below.  Looking forward to seeing you around and sharing the latest fdd news.     kyle:  For example, have we considered requiring 25 DAI to be staked per new grant request to help increase the fraud tax on this process?   Yes we have considered it.  The idea first arose when thinking about how to hold folks accountable for ‘bad’ or exploitative behaviour as dao members.  This got expanded to ecosystem participants.  By taking a stake from new grant applicants (AND potentially EVERY dao member) we now have an ability to incentivize and shape behaviors within the dao.  But carrying out these types of thought experiments has a cost.  It seems like the FDD is being told “No you are not meant to be innovating.  Your budget is inflated because of un-needed  R&D” while in the very next breath we are being asked “where is the innovation?” And although such discussions about innovation happen regularly we are mostly focused on carrying out the mission as inherited from Gitcoin inc.  We simply lack the people needed to successfully complete the mission while conducting major R & D.  But we are continuously growing and filling out gaps in our range of sme.  The targeted strategy sessions guided us as a team toward filtering out the weak results from our future goals. The fact FDD has been a great steward of its budgets demonstrates competence and responsibility.  This should be reason to increase the FDD budget not decrease it.  The FDD is good with its treasury and they are eager to enlarge the mission focus.  I want to see the FDD continue to grow and improve.  It was said PGF might be the heart and soul of Gitcoin.  Ouch.  Well maybe that would make the FDD the liver?  We filter out the junk? Either way, it is hard for me to label any one group as the ‘heart’ of Gitcoin.  It is more of a vibe or a philosophy.  But I do know the FDD team is stronger than ever, and ready to carry out the Gitcoin mission. Full support for this budget.   And a sweet dCompass quest. Joe is a public ‘great’ (nice one Ben) and we are living in the proof.  The Dao is maturing nicely.  Membership is growing and the folks i’m seeing are very qualified. Full support for this budget.  Bias disclaimer:  I am part of this crew. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0983177361853835
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#25",
                    "likes": "5",
                    "time": "11/02/2022-06:42:44",
                    "content": "    kyle:  this is another example where we are building and scaling without stopping to evaluate how to solve the problem from first principles. For example, have we considered requiring 25 DAI to be staked per new grant request to help increase the fraud tax on this process? If so, apologizes for throwing stones, I do worry that scale has been the default state for FDD (in many cases for good reason, as it reduces fragility).   staking in the process will have no more of an effect than an increased gas price. it’s an interesting idea, but ultimately a sybil attacker already has to front a large amount for gas. although, it would be worth simulating the affects of such a mechanism. i will keep this in mind as we progress with the matrix (red team) squad.     kyle:  The Ground Control work seems like it may be duplicative. As some of that work is being covered/compensated by DAO Ops. I would strike most of that budget if I am being prudent.   exactly what is duplicative? the data storage layer is part of ground control, the function of which has been pushed off for a very long time. also, DAO Ops has proven to be too coarse to actually have a tangible impact in FDD… bubble-up emergence of organization is more affective in both the short and long term (isn’t this what the DAO wants to facilitate…?) pragmatism (natural selection) rules, not downward imposed idealistic solutions.     kyle:  GIA seems like the wrong solution to the problem, but I would leave that $75K budget intact with the hopes of us partnering with GPG to build in a staking model in GR14, or another software based hurdle (recognizing a change for GR13 is likely too aggressive).   do you know what the GIA even is? it’s goal is to decentralize and cut costs in the long term. maybe we aren’t communicating it’s function properly (@David_Dyor and i just discussed writing up an article to sum everything up), but simply dismissing it as the “wrong solution” seems naive…     kyle:  Sybil Defenders budget seems pretty heavy, but I am not an expert in how to cut there.   i do somewhat agree. i have been vocal about my discontent with the sybil problem and relying on DID/sybil as a crutch. we had an enlightening exchange with glen weyl (QF paper author) about this. however i still think your reasoning isn’t very well thought out. the double-paying you are referring to is the growing pains of offboarding this responsibility onto the DAO. @omnianalytics is running the initiative to offload our sybil ML process partially onto the community (open source) in collaboration with the data storage layer squad that I lead, which will alleviate a lot of funding in the future.     kyle:  This assumes that in S14, we can reduce costs as the “double payment” for BSCI and Community run models goes away, the GIA work is hopefully greatly reduced (if GPG can help build staking into grant creation or some other software deterrent to the deluge of new spammy grants), and DAO Ops continues to support and fund work that FDD relies on (DevOps, Consulting, Accounting, etc.)   again… staking is not a very well thought out solution, slashing GIA will only harm the ecosystem and make the review process:  take significantly longer require a good deal of human training/inconsistent grant reviews cost more to pay for human expert grant reviews the same amount of centralized (if not – more) inhibit our ability to do finer grained data analysis of the grant-reviewal process  ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.555533296490744
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/maerg",
                    "index": "#26",
                    "likes": "5",
                    "time": "11/02/2022-12:49:04",
                    "content": "Once again, there is a great discussion on another FDD proposal; which is consistent with FDDs values to provide an immense amount of transparency to their operations. I am supportive of this proposal. FDD is leading the efforts of progressive decentralization within the Gitcoin DAO community. FDD provides a great amount of Workstream structure for the other Workstreams to follow. I agree with @DisruptionJoe here;     DisruptionJoe:   a proven track record of not abusing the reserves in the past $70k in treasury management gains last season (more than the entire DAO combined) High transparency - Perhaps the most transparency of any workstream (DAOops, which uses our system or maybe moonshot, but it is onchain rather than human readable)    But also I think what @kyle mentions here is incredibly important. I think there is a need to have a detailed conversation on Workstream treasury management moving forward. I think FDDs practices are proven healthy for the Gitcoin DAO in general, and there should be a learning, trial & error process for all the workstreams to implement and improve what FDD puts on the table as an example.     kyle:  I understand we differ here. No other WS is requesting this, and this tells me it is not a DAO-wide norm, but something unique to FDD. I am down to chat about this at CSDO and see if we want to adopt a new standard like this in the future.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.065936539306104
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Doggfather92",
                    "index": "#27",
                    "likes": "1",
                    "time": "11/02/2022-18:42:11",
                    "content": "FDD is a place where I’ve learned and developed a lot so far, it offers transparency and is open for anyone who’s eager to be involved in activities and technology that will shape the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#28",
                    "likes": "2",
                    "time": "11/02/2022-20:13:01",
                    "content": "    nollied:  staking in the process will have no more of an effect than an increased gas price. it’s an interesting idea, but ultimately a sybil attacker already has to front a large amount for gas.   This is incorrect. There is currently no financial hurdle to create a grant as they are not on-chain. Staking would add a component of financial commitment while we wait to have on-chain grants.     nollied:  DAO Ops has proven to be too coarse to actually have a tangible impact in FDD   I would love to understand this more and see where we / DAO Ops can do better. There is often a natural tension between “best for the DAO” and “best for my workstream” that we should be constantly evaluating.     nollied:  do you know what the GIA even is?   I likely don’t have enough context! It was presented as a tool to allow for programmatic reviews and that it was necessary to build due to the volume of grants being created. The old joke of spending thousands to design a space pen versus just grabbing a pencil came to mind here. I would love to learn more. I have really enjoyed the conversation, and learning this has sparked for me and others. This is exactly the outcome I have hoped for. I also don’t mind that I am in the minority with my opinion. This is why we have lots of stewards. Thank you all for the discussion! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.219122023809524
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#29",
                    "likes": "2",
                    "time": "12/02/2022-02:23:33",
                    "content": "    kyle:  This is incorrect. There is currently no financial hurdle to create a grant as they are not on-chain. Staking would add a component of financial commitment while we wait to have on-chain grants.   i didn’t say it costs gas to create a grant… the “fraud tax” that you mentioned is in reference to gas costs for contributions & the splitting of funds into separate wallets…in order for you to donate to any grant it costs gas, not only that but sybil accounts have to split their money to other wallets somehow. how else would they do this without paying gas?     kyle:  I likely don’t have enough context! It was presented as a tool to allow for programmatic reviews and that it was necessary to build due to the volume of grants being created. The old joke of spending thousands to design a space pen versus just grabbing a pencil came to mind here. I would love to learn more.   i’m not sure what you mean by “programmatic reviews”. but it’s basically just taking the criteria that human reviewers usually base their decisions off of, turn them into criteria with “pass” or “fail” buttons for each one, which makes it easier for humans to review faster, more consistently, and with lower barrier to entry. it’s basically just a nicer google forms setup curated for the grant review process. alongside this, there is also all of the usual grant review processes that existed before, hence the larger budget, we just rebranded it all to “GIA”. your space pen/pencil joke is still lacking a sense of reality with respect to GIA/FDD-policy. GR12 was great, and our human reviewers learned a lot, but their path was a little inefficient. a closer analogy would be that we found our way home from school, but walked an extra 2 miles due to some inefficient path choices. now, were leveraging our experience to take turns that get us home quicker. this was used for our GR12 pilot: https://gia-testing.ethelo.net/page/welcome-to-the-gia ———————— my recommendation for you is to seek context before making very impactful budgetary decisions. this is partially FDD’s fault as a workstream, and it’s something that myself and others are trying to push towards communicating context better. maybe try to participate a little more, especially when it seems like things don’t make sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.143145161290322
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#30",
                    "likes": "1",
                    "time": "14/02/2022-23:34:59",
                    "content": "The GIA is a tool that would allow us to further decentralize the grant review process and would make the community own it more and more over time while leveraging the knowledge of the participants . It’s very interesting and allows for a lot of experimentation with low costs  We imagine a future in which the GIA will be self funded with a grant on Gitcoin and the reviewers will be incetivised that way and maybe create their own sub DAO hybrid, idk I appreciate the time and thought you have give to our beloved FDD btw, these are very good conversations to have and they could lead to very constructive things. During GR12 we accomplished a lot here at the FDD(haha, I’m part of the stream, how could I not be biased), we actually delivered and defended the DAO while maintaining credible neutrality. We experimented and decentralized all of the squads and even the core structure that we used in GR12 and evolved to this format for GR13. The OS that Joe presented is really an innovation and I think this is quite “unique” in GItcoin DAO.  We have also been the home of research related to descentralization, reward systems and governance systems. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.716176470588236
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#31",
                    "likes": "0",
                    "time": "15/02/2022-04:32:40",
                    "content": "Thank you for this massively detailed proposal Joe. I think I’ve now (re)read all of the comments, plus also the comments under @kyle’s voter guide. As always extremely impressed and inspired by the level of detail put in your proposals, I think the thoroughness of your approach & transparency can and should be an inspiration for any DAO. I’ve spent quite a few days on mulling over whether I should abstain from voting or vote no - the way it currently stands I will probably vote no on the current budget. The main reasons for this are 1) the reserves which are requested and 2) the investments in innovation and governance within this workstream, which increase complexity and imo reduces effectiveness, at least at this point in our DAO’s timeline. When I read the comments here - except for Kyle’s, who went for a hardcore deep dive - I think it shows that many people are supportive for one of two reasons: either they are a part of FDD and for this reason might be biased and/or see things I am missing, or they are stewards who appreciate the thoroughness of the FDD proposal and for this reason are supportive of the proposal, without actually understanding in detail what you are proposing and why. It shows we still have a long way to go to incentivize Stewards to dive in and allocate enough time for these crucial decisions, and hopefully @Pop’s council proposal (WIP) will help on that level. Both of these observations are very subjective and I am sure might rub some people the wrong way. I for my part can honestly say that I do not understand all of it, and it is one of the many reasons I am/was hesitating to vote, I simply do not have the time available to dig even deeper. However, because of the large amount being requested, reading kyle’s observations combined with my own observations of the workings of FDD as a daily and full-time contributor within the DAO, and especially point 1) & 2) above I will probably vote no on this iteration of the budget. Some more detail on my logic here: 1) Reserves     DisruptionJoe:  we don’t want to be unable to perform due to political hiccups   FDD is the only workstream who has been ‘saving up’ and I think the argumentation shows we mainly need to work on getting rid of internal politics (which indeed do exist! and are very frustrating) and get better at DAOing. However, allowing these (enormous) reserves is counterproductive: it is basically saying that our governance mechanisms of allocating budgets are not working / cannot be trusted. To be honest I agree with that point  The answer however imo is not to keep doing this & have funds ready to allow spinning out as a standalone DAO or to cease collaboration, but to work more on / invest more in the operations of the DAO as a whole, and improve our communication & governance mechanisms, as we have one shared/joint mission. 2) Innovation / Governance Working within the DAO Operations Workstream I can say that there is a lot we need to do when it comes to effective governance, transparency and incentivization, there’s room for massive amounts of improvement & growth, and FDD has been leading the way here, because no one else was. However, I do not think these initiatives should be developed under FDD, they belong mostly under DAOops, which now exists and is slowly scaling. This is not a question of centralization, it is even the opposite to me, as DAO Operations was created to service shared needs of the entire DAO. With certain elements of this proposal we are actually working towards a centralization of power within one workstream, and I think we are too early in the process of our own DAO (and all DAOs) to move this fast. Personally I think it could endanger the focus on the mission of Gitcoin, which is to build and fund public goods, not to become the most effective DAO. Ideally one day we’ll be both. I think the work of FDD is mission-critical, so I would vote 100% yes on a budget that is considerably reduced. I trust the calculations by Kyle make sense, which brings us to a budget around 35K GTC on top of what is already available. I think this leaves plenty of room for innovation (also on topics of governance, eg the source council) and might be a signal for FDD to focus even more on its core mission, streamline for simplicity and effectiveness, and a signal for DAOops that it needs to really and urgently invest in better governance and incentivization modelling for the entirety of GitcoinDAO. What you want to achieve within the boundaries of the budget that will remain - which is still around 50K GTC (!) counting the built-up reserves is still very ambitious.     DisruptionJoe:  It’s like having a fire dept. Unless your town is super small, you need one. Additionally, all the advancements made by the big ones will be open source and free for the smaller town fire departments to build upon.   I do believe every major city indeed needs its own fire department, and we have one, but we are not a big city just yet, we are a big name, but counting active (and effective) contributors, we are still a ‘baby DAO’, and we have already spent a lot of time on reducing internal politics aligning, in challenging times and a long-distance context, simplicity is key in order to continue on that path. The vision for FDD is fantastic and I hope building a ‘sybil defense network for the metaverse’ is where we will arrive at. But let’s first make sure our city is thriving, viable & regenerative, before its fire department becomes a city on itself. Note: I hope this feedback is useful and is interpreted the way it is intended: some constructive thoughts to help us achieve both our medium & long term goals, without stifling innovation or demotivating you or other contributors. I believe in moonshots and I believe even more in the need for a decentralized world, but I’ve also first-hand seen the risks & failures of bringing too many layers of complexity too soon. I will not have the time to respond to comments on this in the way that Kyle has done above and under his summary because of Ethdenver and a number of other reasons. We can however discuss irl and will definitely read any comments if they appear here. ",
                    "links": [
                        "https://gov.gitcoin.co/t/the-steward-council-formation-mandate/9843/2",
                        "https://gov.gitcoin.co/t/proposal-dao-operations-workstream-budget-q1-2022/9488",
                        "https://gov.gitcoin.co/t/proposal-dao-operations-workstream-budget-q1-2022/9488",
                        "https://gitcoin.co/mission",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kyles-voter-guide/9856/3",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kyles-voter-guide/9856",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kris-s-voter-guide/9895"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.909083581349206
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#32",
                    "likes": "2",
                    "time": "15/02/2022-16:22:46",
                    "content": "    krrisis:  I think the thoroughness of your approach & transparency can and should be an inspiration for any DAO.   Thank you. That means a lot!     krrisis:  either they are a part of FDD and for this reason might be biased and/or see things I am missing, or they are stewards who appreciate the thoroughness of the FDD proposal and for this reason are supportive of the proposal, without actually understanding in detail what you are proposing and why.   I think you are underestimating our Stewards. Some might have skimmed it, but take @akrtws for example. She is part of our multisig as a steward providing oversight of our workstream and is not a paid contributor of FDD. (FDD set ourselves up with a 4/7 multisig designed to represent our stakeholders and provide an additional layer of oversight which the other streams haven’t done.) She participated in a 2 hour overview session giving very tough criticisms and then had multiple one on one discussions with myself and other contributors. After responding to her and other multisig keyholder critiques, we eventually got to this final request. To say that she, or @bobjiang and other stewards are not fulfilling their duty if they support this budget request is not necessarily the case.     krrisis:  I for my part can honestly say that I do not understand all of it, and it is one of the many reasons I am/was hesitating to vote, I simply do not have the time available to dig even deeper   You have over 700k GTC delegated to you. I think it is your duty to understand it.     krrisis:  FDD is the only workstream who has been ‘saving up’ and I think the argumentation shows we mainly need to work on getting rid of internal politics (which indeed do exist! and are very frustrating)   So you agree that mission critical work might be susceptible to these issues?     krrisis:  However, allowing these (enormous) reserves is counterproductive: it is basically saying that our governance mechanisms of allocating budgets are not working / cannot be trusted. To be honest I agree with that point    It is not new and we are not “saving up” we simply ask for one quarter of funding extra as we have been since the first budget proposal. If we were “saving up”, we wouldn’t explicitly be showing that we are topping up what we currently have to make sure we continue to have 1 season worth of reserves.     krrisis:  The answer however imo is not to keep doing this & have funds ready to allow spinning out as a standalone DAO or to cease collaboration   FDD is not spinning itself out as a standalone DAO. We have no interest of doing that. We may incubate projects that end up having a broader application potential than our mandate in which case we would support them spinning out. A community data collective for sybil detection for example. I am 100% focused on serving FDD’s mandate which is defending Gitcoin against threats to its legitimacy, credible neutrality, and sustainability. I fundamentally disagree that reserves for one season, another 90 days, makes it so FDD isn’t accountable for its results. Additionally, I will be bringing a proposal to CSDO before next season to establish a norm around reserves for all workstreams. Quite frankly, I’m a little shocked that you, as the person responsible for contributor experience, feel as though the way to achieve accountability is by putting contributors financial stability and mental safety at a higher risk than necessary. 90 days of extra funding is not going to strip workstreams of accountability imho.     krrisis:  FDD has been leading the way here, because no one else was   Or because we can’t supply legitimacy and credible neutrality without having a solid foundation. It would be wise to think of our need for proper governance structure as part of our mandate.     krrisis:  However, I do not think these initiatives should be developed under FDD, they belong mostly under DAOops   I agree that DAOops should own this for GitcoinDAO as a whole, but each stream does need to manage its own internal governance. We are explicitly working to do this well. This is less than 4% of our total budget. Whether or not a workstream explicitly identifies these needs in their budget does not mean it isn’t executing and paying for them. Secondly, our governance process says that after 5 days on the governance forum and 5 steward comments, the proposal should move to snapshot. Even after getting the required amount of comments, our proposal is still not on snapshot 5 days later. (I could post, but I’m trying to go along with some hard work by @Pop to improve steward comms.) The reason for this delay was cited as stewards requesting more time to review the proposals. No steward posted these requests on the governance forum or in the Stewards channel in Discord.  Now, I am NOT accusing anyone of wrongdoing, but you could see how with you being the only steward who has commented during this delay period, one could be see this as delaying the vote so you could post this critique. For this reason I think you should ABSTAIN from voting on this proposal. Additionally, it shows the need for multiple workstreams to be actively involved in governance.     krrisis:  With certain elements of this proposal we are actually working towards a centralization of power within one workstream   Please say more? How does FDD managing its own internal governance centralize power for all of GitcoinDAO?     krrisis:  Personally I think it could endanger the focus on the mission of Gitcoin, which is to build and fund public goods, not to become the most effective DAO.   Not sure how you make this connection.     krrisis:  Personally I think it could endanger the focus on the mission of Gitcoin, which is to build and fund public goods, not to become the most effective DAO.       krrisis:  I think this leaves plenty of room for innovation (also on topics of governance, eg the source council) and might be a signal for FDD to focus even more on its core mission, streamline for simplicity and effectiveness   How do you reconcile these two sentences? In one you state that we should not focus on becoming the most effective DAO, then you say that FDD should focus on streamlining our focus for simplicity and effectiveness. Gitcoin has Top Level OKRs and one of them is decentralization. How do you come to the conclusion that FDD should focus on efficiency in the decentralization and efficiency tradeoff?     krrisis:  I do believe every major city indeed needs its own fire department, and we have one, but we are not a big city just yet   You know what stops little towns from becoming big cities… when they burn down.     krrisis:  But let’s first make sure our city is thriving, viable & regenerative, before its fire department becomes a city on itself.   How about we build all parts of the system to be regenerative individually and collectively. That is alignment.     krrisis:  but I’ve also first-hand seen the risks & failures of bringing too many layers of complexity too soon.   The thesis of your criticism has not had anything to do with the introduction of complexity or the speed at which it is introduced. It has been about whether reserves are justified and who should own certain functions. ",
                    "links": [
                        "https://gitcoin.co/mission",
                        "https://gitcoin.co/mission",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kris-s-voter-guide/9895/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.760533430812686
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#33",
                    "likes": "6",
                    "time": "15/02/2022-18:16:03",
                    "content": "    krrisis:  I think it shows that many people are supportive for one of two reasons: either they are a part of FDD and for this reason might be biased and/or see things I am missing, or they are stewards who appreciate the thoroughness of the FDD proposal and for this reason are supportive of the   This sentence implies the FDD gets supported for a couple reasons that are not related to mission-first activity of fraud detection & defence.  This statement is unsettling on several levels.  Mostly it hints we are losing focus of the mission.  Funding public goods & oss.  Is this really suggesting the workstream dedicated to protecting the funding is only supported because 1)fdd members want to get paid and 2) Stewards like Joe’s writing ?  Well I like to think people support the fdd because they don’t want funds going to bad actors.  The fact Joe is a good writer only helps communicate the granular details to voters.  This feels like somebody accusing an political party of gaining support only because they have a nice brochure.  The brochure is just a proxy for the platform and ideology.     krrisis:  However, allowing these (enormous) reserves is counterproductive: it is basically saying that our governance mechanisms of allocating budgets are not working / cannot be trusted. To be honest I agree with that point  The answer however imo is not to keep doing this & have funds ready to allow spinning out as a standalone DAO or to cease collaboration, but to work more on / invest more in the operations of the DAO as a whole, and improve our communication & governance mechanisms, as we have one shared/joint mission.       krrisis:  FDD is the only workstream who has been ‘saving up’   The talk around the FDD GR13 budget is illuminating.  I see issues similar to the issues at hand when considering numerous grant applications from 1 large Dao.  It is all about financial connection and accountability.  Are the sub-daos routing money back to the parent dao?  Are Gitcoin Dao workstreams routing funds to the greater Dao somehow?  How is profit shared from each parent & sub dao?  Now these issues are confronting GC as we debate budgets.  I would like to know how much and by what manner Gitcoin GPG/LLC exerts control over those workstreams it funds.  I was fairly surprised to learn that not all workstreams get equal support from the core. Kris said the support shown by FDD members somehow means there is a lack of non-workstream member support.  This is a reach imo.  Something about correlation not equal to causation comes to mind.  For Kris this translates into a reason he likely won’t support the budget.  Did I land in bizzaro world somehow?  Aren’t dedicated workstream participants a reason to increase budgets not decrease them?  Personally want I the most leaned-in contributors to get the most budget and power. Some workstreams get direct funding from the GPG?  say what?!?  I had no idea. Some workstreams actively manage their treasury to create revenue.  Nicely done! (but here comes the tax collector.  The benefits of great treasury management should be awarded mainly to the workstream that created it imo. I could see allocating 20% back to the parent dao maybe.) Some workstreams are thinking of spinning off into an independent dao.  whoa.  Feels like this is quite a divisive idea.  Are we Gitcoin a nebulous group of linked mini-daos with narrow scopes?  Or are we Gitcoin Dao - Funder of OSS and its Developers?  I sure hope for the latter, but Ostrom seems to favor the former.  Please educate me on why this is better. Responsibility for innovation at Gitcoin is uncertain.  Nobody seems to know who should push the innovation envelope beyond MSC.  I think innovation is one of those org-wide topics that deserves org-wide guidance.  In the absence of wide-spread guidance this responsibility falls on each workstream.  I argue it is the workstream folks who are best suited to guide innovation within their stream’s mandate.  FDD should guide FDD innovation.  PGF should guide their own innovation.  And so on.  Would be great to get some input from the greater Steward group and GPG but until  then we got you covered.  The FDD has some innovation ideas evolved from many rounds of successful mission completion.  Please don’t cancel these goals.  It is too sudden and drastic imo.  If there is some dissent, let’s discuss and shift some of these goals as the group deems proper.  The suggestion to cut-off the innovation arm of the FDD comes without warning, without time to prepare for the transition and without thought of the FDD staff that are involved in these areas.  If anything, cut the weakest innovation ideas, not the program itself.  I’d love to see a Gitcoin survey about which areas of innovation are most favoured by the community.  There are likely innovative experiments happening in workstreams that we don’t even know about yet. Above all, I want to heartily thank Kyle, Kris and Joe for their time detail and commitment to Gitcoin.  You folks demonstrate the ‘leaned-in’ behavior I try to mimic.  The energy you three are giving the program is so admirable.  Yes it is push-back, but that is what will make us lean and agile.  Thank you <3.  Also thank you to all the other commenters and folks dedicated to prudent money management at Gitcoin.  We need you all. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166799928926795
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#34",
                    "likes": "5",
                    "time": "16/02/2022-04:25:23",
                    "content": "I’ve decided to vote yes on this proposal even though I have reservations. In particular, the increase in the budget given that the budget is being driven from the ground up is concerning. I realize this is probably the only way for the budget to be driven, given the early nature of the process, but a bottom-up budget that increases at this rate, I am sure everyone would agree, is unsustainable. In the future, I will probably vote against a budget increase of this size (for any of the streams) without a much clearer “from-the-top” feeling for how it fits into the larger DAO’s mission / planning. EDITED: I should have said how amazed I am with Joe’s energy, his positive attitude, his attention to details, and the huge amount of work he’s already put in. Nothing I say above is reflective of my thoughts on Decentrazation Joe or any of the team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.796969696969697
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#35",
                    "likes": "6",
                    "time": "16/02/2022-20:38:22",
                    "content": "The FDD proposal is now on Snapshot here. Before stewards vote, I’d like to offer a point of reconciliation in a hope to sway those pushing for a no vote. I’d like to offer a compromise to address the core reasons expressed for voting no after a nice heart to heart in Denver yesterday with @krrisis and a few shorter discussions with @kyle the past week. ASK - I’d like you to be ok with our 90 days of reserves on this budget and vote YES as is There isn’t a fundamental issue with the Season 13 budget at this point, but with the reserves. The arguments against have not been about whether FDD is getting results and executing. They come from a place of concern with our rate of growth and the DAOs overall ability to assess the effectiveness of a workstream’s efforts. Combine this with the concern that the DAO as a whole hasn’t figured out how to prioritize budget between all of the workstreams. I agree with these observations. I will address one at a time, then follow with my argument for the reserves. Compromise 1 - We address the core issue of budget growth and rate of budget growth by agreeing that “structured streams” have a capped rate of budget growth (w/ specific CSDO override mechanism if needed) During Season 13 we will work together to formulate a percentage cap to the allowable growth rate cap for structured streams. We will also formally set the requirements for being a “structured” or “semi-structured” stream and the benefits a workstream may receive for participating in CSDO governance. Compromise 2 - We will collaborate to improve the DAOs overall ability to assess the effectiveness of a workstream’s efforts The FDD Mandate Delivery squad is tasked with determining the effectiveness and health of FDD initiatives. While I believe each workstream should be able to track this on their own, it would be great to take the learnings from our effort which is needed sooner because of our mission critical functions, then collaborate to design a framework to be owned by DAOops in the future. This could include spinning out this squad to DAOops for Season 14 or simply reducing these efforts from around 4% of FDD total budget to < 1%. Compromise 3 -  We collaborate to figure out a framework to prioritize budget between all of the workstreams One steward, @tjayrush has suggested we put a % of total budget on all the budget requests. We did this within FDD as you can see on our FDD Season 13 Budget Proposal Details, but couldn’t do it with the entire DAO. We can collaborate on a framework for providing this context to the entire DAO in the future. As for this budget proposal, FDD is only asking for 60-70k GTC for season 13 (depending on GTC price).  This is not the largest seasonal budget request, or the second largest. However, solving sybil resistance (ensuring each vote is a unique human) and grant eligibility (community curation of consent to participate) are the two of the most important problems for Gitcoin to solve. Because of the importance of these efforts, it seems that our relative prioritization is reasonable for this season before we agree to the new framework. My argument on why reserves are reasonable I believe not having reserves is both operationally a potential problem, but also detrimental to contributors mental health and financial stability. I think we are all in agreement that the workstreams could still be held accountable even if they have more than 90 days of operating budget at a time. My argument is that ALL workstreams should have at least 90 days of runway at a any given time. We shouldn’t back them into a corner. With the current system, contributors can only plan expectations of an income for 90 days at the beginning of a season. At the end, they might only be able to plan a few weeks or days into the future. (Right now for example, most workstreams would be in the red if they actually executed and uses the budget they requested for Season 12.) With my suggestion, even in the last days of the season, a structured workstream would benefit from having 90 days of financial stability at the end of each quarter rather than at the beginning. Yes, it is an assumption that they will execute. I think this is reasonable as we can set the requirements for being a structured workstream to include a level of earning this trust. (Maybe after a first trial season, they get this right?) I’d encourage us to assess whether this would be appropriate for all workstreams during the upcoming season and before s14 proposals as part of this compromise. Thank you both for your attention, professionalism, and honest feedback. ",
                    "links": [
                        "https://docs.google.com/presentation/d/1J8CZrd0hb60sSc3uDj1891urMwZwlrSGspA3xyrTOIA/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7291146353646365
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#36",
                    "likes": "0",
                    "time": "17/02/2022-06:30:11",
                    "content": "I did support FDD workstream S13 budget request, the reasons are:  All budgets spent are clear and tracked (e.g last 2 seasons), this is fundamental trust.   Q3 budget proposal Q3 budget total Q4 budget proposal Q4 budget total   innovation for structure/governance/decentralization   Source council GIA  Finally, I am appreciated Kyle and Kris to comment the S13 budget proposal, and they are valid and specific feedbacks. (At the same time, it makes GitcoinDAO’s issues visible like the corporations between workstreams etc) #AllPublicGoods are good ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1TnXswN7_sneWgc-kElibr-MQVqTOoA5iTgjxwtNUuu4/edit#gid=2076643926",
                        "https://gov.gitcoin.co/t/proposal-request-to-fund-fdd-workstream-q4-2021-budget/8857",
                        "https://docs.google.com/spreadsheets/d/1-AYF28k2tyv0-eDhfqcLdqymCRcp6CdTsDgkflsAqMU/edit#gid=20969645",
                        "https://gitcoin.notion.site/FDD-Source-Council-Pay-Model-cb5e03cc0f2a4752b698370b7622dcfa",
                        "https://gia-testing.ethelo.net/page/welcome-to-the-gia"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#37",
                    "likes": "1",
                    "time": "17/02/2022-17:26:18",
                    "content": "Holy molly guys, I wanted to respond to this topic earlier but could not find the time and since then it has exploded with comments. Before saying anything else I want to express my disappointment at this statement directed at @krrisis.     DisruptionJoe:  You have over 700k GTC delegated to you. I think it is your duty to understand it.   As a steward with lots of GTC delegated to me too who is actually trying to put as much of my free time as possible reading through proposals and voting and keeping up to date with what’s happening I find this really unfair. I have spent quite a few hours per week on this DAO since its inception, and wasted lots of gas in proposals and votes and multisig actions. All of this without receiving a wei in compensation for my time. Not even gas rebates. Having GTC delegated to me does not pay me in any way for my time which is quite very limited. So no I don’t think it’s my, or any other steward’s duty to do anything unless we start getting paid and also have a contractual relation with the DAO. I realize this is quite different to the view I had when I first started being a steward but I had seriously underestimated the amount of pro bono work this would require when the DAO was starting.  Amount of funds Now for the proposal itself. I also find it really hard to be asked to judge how much money other people should get from the DAO, how much their work is worth when all of this judgement on my and fellow delegates side is supposed to be pro bono. For the amount of funds the salaries look high to me as a European but I understand probably are okay for American standards. Reserves For the reserves I also find it really weird a given workstream of the DAO would need any sort of reserves. So long as the DAO has funds, the workstreams would be funded by the DAO as long as they do their work. Having reserves sounds like FDD wants to spin into its own organization completely which I find alarming. I think this may outline a politics and communication problem inside the Gitcoin DAO. I would much rather prefer to see Gitcoin DAO as a whole figure out a way to make sure all its employees have no disruptions in their payments through a common and unified approach rather than have a single workstream have such big reserves. FDD Peformance Review I am always on and reading in the discord ocassionally and have read all the material provided here. It is my impression that FDD is doing a good job and is helping Gitcoin grants a lot. The ideas  pushed by @kyle about having another customer too sound also interesting. What I would also like to see though is a performance review of the FDD made by another workstream or DAO member. Since all the material I have read are actually made by FDD they could be biased. So would be nice to see an independent performance review. This is more of a comment on all workstreams though, not just FDD. It would be nice to have some kind of formal review process to which all workstreams would fall under. And the result of this review would be created by a person/group external to the reviewed workstream and would be perhaps easier to read by the stewards who would know. I am under the impression that FDD is doing a good job.  In closing I have not yet made up my mind completely on how I will vote as there is some things I have doubts for as mentioned above. An extra question to @DisruptionJoe as I am not 100% sure which number I should look for in the spreadsheets but how long can this conversaion and voting drag on? How long do you have reserves for to pay the team? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.461670918367347
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/akrtws",
                    "index": "#38",
                    "likes": "1",
                    "time": "17/02/2022-19:57:06",
                    "content": "    lefterisjp:  Having GTC delegated to me does not pay me in any way for my time which is quite very limited. So no I don’t think it’s my, or any other steward’s duty to do anything unless we start getting paid and also have a contractual relation with the DAO. I realize this is quite different to the view I had when I first started being a steward but I had seriously underestimated the amount of pro bono work this would require when the DAO was starting.   Valid point, same here. Being a steward/multisig keyholder is not sustainable in the current set up.   But let’s not punish FDD for this problem, since it’s not their mistake. I’m grateful that this discussion is coming up, and I’ll be glad to see the roles evolve.     lefterisjp:  For the reserves I also find it really weird a given workstream of the DAO would need any sort of reserves. So long as the DAO has funds, the workstreams would be funded by the DAO as long as they do their work.   The voting on the this season’s FDD budget is pending because of this discussion. Proves that there can be situations when a buffer is needed. I think it’s smart to prepare for such situations, because there’s a risk of loosing really critical contributors due to such delays - be it at FDD or any other work stream.     lefterisjp:  I would much rather prefer to see Gitcoin DAO as a whole figure out a way to make sure all its employees have no disruptions in their payments through a common and unified approach rather than have a single workstream have such big reserves.   Valid route to solve this issue, let’s address it.     lefterisjp:  What I would also like to see though is a performance review of the FDD made by another workstream or DAO member. Since all the material I have read are actually made by FDD they could be biased. So would be nice to see an independent performance review.   Yes to that - adds to the need to further develop Gitcoin DAO roles. Many of the issues mentioned in this whole discussion (role definitions, reserves, timelines, reviewing process) are caused by the fact that the organisational set up obviously didn’t keep pace with the workstreams’ development. What if you were an ambitious, skilled contributor watching the DAO fail to assess a proposal properly and as a result your proposal was turned down in the voting? You’d probably look for a better place to invest your time. Let’s not make steward/multisig issues the problem of a workstream. And please let’s not punish FDD or any other Gitcoin DAO workstream for being fast and ambitious. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.31084656084656
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#39",
                    "likes": "2",
                    "time": "17/02/2022-20:15:00",
                    "content": "    akrtws:  Let’s not make steward/multisig issues the problem of a workstream. And please let’s not punish FDD or any other Gitcoin DAO workstream for being fast and ambitious.   Absolutely. If my response sounded overall negative or trying to punish FDD in any way, that was not my intention. I simply have some questions and some things I would like to see further change in the DAO as a whole. The DAO stuff are more about in the long run and definitely not a blocker for this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.364583333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#40",
                    "likes": "4",
                    "time": "18/02/2022-21:27:24",
                    "content": "Thank you for your feedback. I know you take your role very seriously. You went above and beyond in the last two quarters as a multisig keyholder for FDD and Gitcoin as a whole.     lefterisjp:  s a steward with lots of GTC delegated to me too who is actually trying to put as much of my free time as possible reading through proposals and voting and keeping up to date with what’s happening I find this really unfair.   You are right. It is unfair and I didn’t mean to offend you or Kris. @akrtws was able to articulate the dynamics of the workstream pace of innovation and the DAO as a whole being mismatched and not providing the stewards with the tools needed to execute their responsibilities. (There is also the example of @Zargham who accepted responsibility as an FDD multisig keyholder and chose not to be a GitcoinDAO steward accepting delegations because the time commitment to FDD was as much as he could responsibly handle. I am not saying that to criticize as we are all learning together, but instead trying to highlight other modes of operation that might help us better achieve our mission.) This workstream reporting was something FDD identified in Q3 last year as a threat to Gitcoin and started to look into, but then was told it was “out of our scope” and pushed to spin out the initiatives that are supposed to be handling this. In talking with @griff this week, it seems like smaller workstreams might help. Perhaps in S14, FDD could dissolve and leave sybil defense and grants eligibility as individual workstreams, but for this season I think it is best to move forward as is. We have a lot of work to do with 3 weeks until the next grants round starts. To update structure now would be very tough.     lefterisjp:  For the amount of funds the salaries look high to me as a European but I understand probably are okay for American standards.   There are 9 on the source council receiving full time pay. I’d recommend looking at a startup “Sr. Business Manager” or “Operations Director” for my role. (I will be paid as part of the source council and even got docked $100 this week for not reporting my payments on time… ) For the other higher paid on the source council you might look at “Systems Architect” “Sr. Software Developer” “Data Operations Director” “Machine Learning Engineer”. For these, I would argue we are paying lower than US market value even though a DAO should pay more imho. We are able to do this because of the passion, preferred working style, and other benefits of being a part of this community which our contributors enjoy. For the lower side, < $70k is under the line where people are able to start saving in the US. You can see on the chart in the presentation slide deck that three of 9 would be under this level. This is ok because the people who only hold one outcome and are at this level are newer to FDD or having their first try at owning an outcome.     lefterisjp:  For the reserves I also find it really weird a given workstream of the DAO would need any sort of reserves. So long as the DAO has funds, the workstreams would be funded by the DAO as long as they do their work. Having reserves sounds like FDD wants to spin into its own organization completely which I find alarming. I think this may outline a politics and communication problem inside the Gitcoin DAO.   I assure you that FDD has no intention of spinning out of Gitcoin. We don’t want another customer at that level because the collective decision making structure that is FDD has a mandate specific to Gitcoin. If that need were to no longer exist, it would dissolve rather than find a customer. I do see the potential for subDAOs of Sybil, FDD, and GitcoinDAO being great revenue opportunities. In fact, I pitched a Sybil Detection DAO at Metapod 2 days ago and got 2nd place, followed by at least 10 dms asking how to use the services. (One of the outcomes we are working on is building the community data warehouse for our sybil defense work. What if we used the same architecture for a data collective that preserved privacy and was governed by the community?)     lefterisjp:  An extra question to @DisruptionJoe as I am not 100% sure which number I should look for in the spreadsheets but how long can this conversaion and voting drag on? How long do you have reserves for to pay the team?   Because we have the reserves from our last budget (Plus another $30k from treasury management gains) we are able to push this decision for a month or two if needed.) Overall Lefteris, I think solving sybil defense and the community consent of which grants are eligible on the platform are two of the biggest problems Gitcoin needs to solve. As much as we need marketing, PR, and operations for today, we need to solve those for tomorrow. Here is what Kyle listed for streams with my adjustment for FDD to compare Season budget amounts rather than total requests (reserves issue separate) MMM - 30K GTC (likely another 20K funded by Holdings right now) PGF - 100K GTC (likely another 30K is funded by Holdings right now) FDD - 63K GTC (No funding by Holdings right now) DAO Ops - 40K GTC (likely another 30K is funded by Holdings right now) dGrants - 0 GTC (On Hold) dCompass - 38K GTC (No funding by Holdings right now) MSC - 130K GTC (likely another 20K is funded by Holdings right now) Please consider the total amounts Gitcoin spends on each workstream including the subsidies from Holdings before making your decision. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.522541291291291
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#41",
                    "likes": "4",
                    "time": "21/02/2022-11:46:18",
                    "content": "Thank you for your detailed response Joe. I had a further look at the different fundings of the other workstreams and the work you guys have done and your plans. I still have some reserves and would hope to see more communication done between the different parts of the Gitcoin DAO but I voted in the snapshot in favor of the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.645833333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#42",
                    "likes": "2",
                    "time": "21/02/2022-14:39:20",
                    "content": "    DisruptionJoe:  With the current system, contributors can only plan expectations of an income for 90 days at the beginning of a season   I appreciate your thoughts on this. It is my opinion that this ^^ is actually the default we want, but there should be some safety net where if budgets take longer to process, those who are performing do not suffer (this is likely the case for much “thinner” workstreams). I am interested in DAOs disrupting the status quo of “I have a stable paycheck even if I don’t deliver results for the DAO (barring legitimate reasons).” I would love to align on a reasonable reserve for all workstreams as part of S13 execution, and the concession has me really conflicted. A no vote feels harsh given the timelines it takes for budgets to be approved, and that is something I want to lean into as well during S13. (ie, should it take 15 days to get budgets approved, and if so, how do we make sure the budgets are approved with enough time to confirm operations and sort out differences). I will likely abstain from the vote, and not vote no as I also want to act in good faith with the concessions being offered here. I agree it is a bit unfair for the entire workstream to be without funding while process runs and I would not want to create a culture of anxiety around the budgeting process. I also dont think we should tie the outcomes of a large workstream all together (ie, is Ground Control is not performing, and Sybil is… Should all funding be withheld?). I look forward to discussing more and I am optimistic we may see some bigger changes ahead of S14. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.641071428571428
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#43",
                    "likes": "0",
                    "time": "21/02/2022-15:58:22",
                    "content": "    kyle:  I appreciate your thoughts on this. It is my opinion that this ^^ is actually the default we want, but there should be some safety net where if budgets take longer to process, those who are performing do not suffer (this is likely the case for much “thinner” workstreams). I am interested in DAOs disrupting the status quo of “I have a stable paycheck even if I don’t deliver results for the DAO (barring legitimate reasons).”   I suppose in this case having a reserve could or would be the solution to support our contributor and reduce the stress/anxiety over payments that must be done/past due     krrisis:  I think it shows that many people are supportive for one of two reasons: either they are a part of FDD and for this reason might be biased and/or see things I am missing, or they are stewards who appreciate the thoroughness of the FDD proposal and for this reason are supportive of the   The Steward mandate is to get a voice for/from your delegate and them with your judgement split the decision (With of course your understanding of the requested form/proposal/budget At this point, doing a restructuration of the FDD Ground control or the FDD as a hole, is quite a bit late in the process. Gitcoin Grants Round 13 is starting in less 20 days and I think we should keep the workstream as it is. Summarizing this post, I would like to clearly see from the steward who are going to vote no or oppose to this proposal, state in a few bullets points what should we change and why ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.268229166666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#44",
                    "likes": "6",
                    "time": "21/02/2022-16:38:48",
                    "content": "As a quick update, I voted No on this as opposed to abstaining so that we could meet the threshold as I believe ensuring the community’s will is more important than my single concerns (knowing my no vote will push us past quorum, but not block the progress). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.911904761904761
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#45",
                    "likes": "6",
                    "time": "28/02/2022-17:59:28",
                    "content": "No votes shouldn’t count towards quorum… that seems like a flaw in the system honestly. Maybe I should start a moratorium… h/t to Vlad, Gun, and Dino RE: Reserves Just to throw my hat in the ring here… I would advocate for ALL work streams to have budget for continuing their work if Governance is slow… If we don’t do that, there are 2 options: #1 (most likely) Individuals step up and take on risk to continue the work, either by paying people out of their own pocket or by working with the risk of not being paid. #2 Critical infrastructure fails. This is not good business. We need a solution that doesn’t allow for either of those options. Until another solution emerges, having a reserve for each work stream is just smart and real, Governance in DAOs is slow and unpredictable, and a prudent work stream lead should prepare for funding issues if they are stewarding critical infrastructure. A Reserve creates a buffer for the Work stream to continue or transition as needed without having to pause payments. People have bills to pay and we need to create a safety net so they can continue to work and pay those bills even if the unexpected happens. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.320578231292517
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-dcompass-season-13-budget-request/9794",
            "title": "[Proposal] dCompass - Season 13 budget request ",
            "index": 9794,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Huxwell",
                    "index": "#1",
                    "likes": "10",
                    "time": "31/01/2022-20:46:56",
                    "content": " TLDR: The dCompass workstream is requesting a total of 38k GTC for Season 13. The focus for this season will be on:  Rewarding users going through pathways & quests Beta release & deployment on mainnet and Polygon Onboarding new projects, DAOs and protocols   Milestone Report: Q4 2021 Retrospective and January 2022 update    [PROPOSAL] - Integrate dCompass within dGitcoin to build dQuests & dKnowledge 📜 Proposal Discussion       Hey everyone, after 3 months of hard work from the dCompass and Gitcoin contributors we have some updates to share.  Q4 2021 retrospective  Contributors: 5 full-time & 6 part-time  Funds spent: 11 859 GTC  Funds carrying over the next quarter: 14 286 GTC  Have the actions of the workstream brought back value into the DAO/treasury?  Not yet but we do expect to generate value and revenue by the end of Season 13.  Milestone 1 & 2 achievements  - [v] = success      [x] = failure  [v] Enable user to …      Proposal body: Season 13 roadmap   dCompass - PROJECT  Project Sponsor Pass (stake required to submit a project for review) If any, display all the smart contracts of a project ERC20 allocation and distribution for pathway and quest creation Claim ERC20, ERC701 and ERC1155 rewards Public profile page & browse profiles by pathway & quests progress(eg: query all users that completed the Gitcoin Grants 101 pathway) Performance, additional datastore to act as a caching layer such as ThreadDB or PostgreSQL Smart contract audits, mandatory before going to production and we’d appreciate any advice from the community on our contracts. Beta launch on mainnet and Polygon + research and potential deployment on other scaling solutions Responsiveness  Website - WIP (about, features, values, go to dapp) Allow users to choose between uploading a markdown file or use the Gitbook integration for pathway & quest guides    Gitcoin Knowledge Base - PROJECT While working on the v1 of the Gitcoin Knowledge Base with FAQs and translations, we realized a pain point that could serve the Gitcoin DAO Community greatly by addressing one of the main problems; contributor onboarding. By working with Workstream and Squad leads for the last month on the Gitcoin Knowledge Base, we started to prepare Handbooks, which are one-stop information hubs for Workstreams that include introductions to workstream squads and step-by-step instructions on how to contribute to each workstream squad. We’ll focus on creating 3 handbooks as an example for other workstreams and Gitcoin products:  Handbook for the Moonshot Collective Workstream Handbook for the FDD Workstream Handbook for the Gitcoin Grants (what is gtc grants, cGrants vs dGrants, contribute to a grant) Translations of the Handbooks     dKnowledge - SQUAD  Integrate Moonshot Collective developer pathway to dCompass dApp Integrate FDD contributor pathway to dCompass dApp Integrate Gitcoin grants pathway to dCompass dApp Content curation and guide creation for pathways & quests Preparation of Blog Articles to standardize the use of Handbooks across DAOops    Success metrics and KPIs I would consider our workstream successful if we have a decent MVP deployed in a production environment at the end of Season 13. Some KPIs  Get at least 6 projects to purchase a sponsor pass Create pathways and quests with at least a total of $100K rewards distributed Get at least 1000 users that engage with a project, pathway or quest  Season 13 budget request We’re requesting a total of 38k GTC that will be used to compensate contributors and to handle various expenses such as the smart contract audits and the infrastructure costs (Ceramic Node and a few other instances running on AWS).  Capture d’écran 2022-01-31 2142071162×579 13.5 KB   Vote  FOR - If you vote “yes”, the dCompass Workstream will continue to exist within the Decentralize Gitcoin Workstream , and the proposed budget above will be allocated to the multisig of the dCompass Workstream 0x756239E5B7D2aa6F3DA0594B296952121Fb71606. AGAINST - If you vote “no”, the dCompass Workstream won’t be funded or supported by the Gitcoin DAO anymore, and the requested budget won’t be allocated. ",
                    "links": [
                        "https://github.com/Discovery-Labs/dCompass/tree/main/packages/hardhat/contracts",
                        "https://dcompass.webflow.io/",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-4-2022/9816",
                        "https://gov.gitcoin.co/t/discussion-dcompass-release-plan-and-beyond/10356/6",
                        "https://gov.gitcoin.co/t/3-layers-to-a-dao-to-dao-partnership/10657"
                    ],
                    "GPT-summary": "The post is a proposal for the dCompass workstream to receive a budget of 38k GTC for Season 13. The proposal outlines the focus for the season, including rewarding users, beta release and deployment, and onboarding new projects. The post also includes a retrospective of Q4 2021 and achievements of Milestones 1 and 2. The proposal also discusses the dCompass project, Gitcoin Knowledge Base project, and dKnowledge squad. The post ends with a vote for or against the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Change to proposal pipeline",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 4.787732537732538
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#2",
                    "likes": "3",
                    "time": "01/02/2022-13:44:17",
                    "content": "Listening to BBB Big Buck Bunny this morning  When this will be live on snapshot?     Huxwell:  Project Sponsor Pass   Interesting, do you have more info about the Sponsor Project Pass? Looking great! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 7.136363636363637
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Huxwell",
                    "index": "#3",
                    "likes": "5",
                    "time": "01/02/2022-15:44:27",
                    "content": "I would say in about a week if everything goes well. The last step for submitting a project is to choose the sponsor pass plan. Then those projects will be reviewed by the dCompass community and if approved they get the Sponsor Pass NFT and we take their staked tokens.  image1744×937 33.1 KB  It will certainly change so we’re open to feedback regarding the pricing and features. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Huxwell",
                    "index": "#4",
                    "likes": "3",
                    "time": "07/02/2022-10:02:57",
                    "content": "Thanks to @matthewcarano here’s a demo video of the dCompass dApp! The feedback is always more than welcome! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.916666666666668
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#5",
                    "likes": "3",
                    "time": "08/02/2022-19:25:38",
                    "content": "Thanks Huxwell for the comments on the other thread., I figured I would move the conversation over here. It sounds like you are interested in updating the branding to denote this is a Gitcoin Project, which I appreciate. Given Gitcoin is funding this work, showing ties and branding that gives this You also have mentioned there is the intention to eventually launch this protocol as a unique community/DAO. We are forming some precedent in how we launch new DAOs from Gitcoin, with the goal of making sure Gitcoin, as the funding partner, is able to participate in the upside in any growth that dCompass. Have you given consideration to what it might mean to offer upside to Gitcoin (the community and DAO)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9524147727272725
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Huxwell",
                    "index": "#6",
                    "likes": "4",
                    "time": "09/02/2022-10:26:13",
                    "content": "    kyle:  You also have mentioned there is the intention to eventually launch this protocol as a unique community/DAO.   Yes the idea of creating our own DAO is something we had since the beginning and that was briefly discussed with @owocki during the first meeting about decentralizing quests. It’s a mid-term goal (6 months or 1 year) but it is important to start having those conversations to avoid creating chaotic situations when the time comes.     kyle:  We are forming some precedent in how we launch new DAOs from Gitcoin, with the goal of making sure Gitcoin, as the funding partner, is able to participate in the upside in any growth that dCompass. Have you given consideration to what it might mean to offer upside to Gitcoin (the community and DAO)?   Here’s what we have in mind so far:  On pathway & quest creation, there will be a 15% fee on the rewards allocated where 5% will go to the Gitcoin treasury. A token swap, so Gitcoin will always have a big say about the project.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.158574380165289
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/maerg",
                    "index": "#7",
                    "likes": "4",
                    "time": "09/02/2022-13:28:12",
                    "content": "Hi Kyle, As @Huxwell mentioned we intend to make sure that our mission, values & goals are aligned with Gitcoin DAO and the Gitcoin community. Currently, we are a group of builders, and we are structuring the coordination between our working groups. We are putting a lot of effort to make sure we have the core structure today to progressively decentralize in the future. As Cali mentioned, we talked with @owocki about revenue(fee) sharing, and a potential Token Swap before the launch. In addition to those, we have been talking with @beist to align our business model and pricing to benefit GitcoinDAO as much as possible - we are trying to build a structure where we can funnel more sponsors to the Gitcoin Hackathons via dCompass dApp. Other than the monetary value that we can add, we are building funnels to ease onboarding for the GitcoinDAO through pathways & quests; working with @DisruptionJoe, the FDD workstream, and the MC to create the initial onboarding structures. Having that said, we are a part of the GitcoinDAO family and we would love to discuss these in detail to make sure the DAOs support to dCompass is justified and we have the necessary structure set for GitcoinDAO to play a great role in the future of dCompass. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.191666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#8",
                    "likes": "4",
                    "time": "09/02/2022-16:41:49",
                    "content": "I’m very in support of this proposal. With a small budget they executed and are about to drop a critical piece of web 3 infrastructure. They are an example of decentralization in action. Please fund this stream and do not delay! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#9",
                    "likes": "3",
                    "time": "09/02/2022-17:29:33",
                    "content": "Thanks so much for the info. This is helpful to know these conversations are in flight. Assuming they continue in good faith and when the workstream is interested in spinning out we have involvement from the DAO at large (not just Owocki), I am supportive of funding the workstream. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.720238095238095
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/maerg",
                    "index": "#10",
                    "likes": "3",
                    "time": "11/02/2022-12:52:50",
                    "content": "Thank you @kyle Sorry for not adding these details to our forum post. We learn as we go! And, we will make sure to prepare documentation to detail these initiatives and share it with you all. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#11",
                    "likes": "3",
                    "time": "15/02/2022-06:32:22",
                    "content": "Adding a comment here to make sure dCompass can move this proposal asap to Snapshot. I will probably abstain from voting on this proposal because I’ve seen dCompass struggle to be fully integrated within GitcoinDAO, or even within the DGitcoin Workstream. I don’t think this is per se a bad thing, knowing that the goal is to become a separate DAO within the year. However I do think investing in better and more communication within the DAO would be a good thing. The forking away without warning from the Gitcoin Discord was in that context a sign that better communication is needed. Even if in the future you become a separate DAO, good communication within that DAO will be key, so just passing this on as a note. I hope we’ll be able to collaborate in S13 on how we can get there together, and I hope I’ll personally find more time to jump on calls to discuss these pain points and figure out how to facilitate better. Most important point why I will abstain is a lack of time to really dive deep into what DCompass has accomplished & wants to accomplish. What I do know is that both @Huxwell & @maerg are two massively competent, hard-working & talented contributors who believe deeply in the mission of Gitcoin & decentralization, so hopefully other stewards will have time to dive deeper (missing at least one comment at time of writing). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.255000000000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#12",
                    "likes": "2",
                    "time": "17/02/2022-06:49:31",
                    "content": "dCompass comes from GitcoinDAO, dQuest. This is a great experiment to gamelize the knowledge and quest on Gitcoin. I will support the continuous experiment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#13",
                    "likes": "3",
                    "time": "17/02/2022-14:08:50",
                    "content": "@Huxwell great job putting together this budget request! I’m personally very invested in the education space and I think we can afford to give you the space to experiment and try to build new ways to engage developers in a scalable manner. Suggestions  there might be some open source education material that would like to work with us on this, I noticed free code camp coming up with a Web3 education course  I’d like to see dCompass featured at ETHGlobal as a learning pathway for Scaffold-ETH (since this is an existing pathway) if you’d like some curriculum development work I can offer some time to help build this out perhaps collaborating with places like Bankless Academy (i think there were some initial conversations), Secureum, buildspace might help. I’d imagine these organisations could have a free version/trial version on dCompass and dCompass could help provide referrals to these more advanced courses  Curious about  I’d like to see where the project is managed, I couldn’t find it on Notion how would you keep the Gitcoin Knowledge Base present considering that GitcoinDAO is constantly evolving how the proposed DAO will interact with overall regenerative economics ecosystem (@Aleborda21)  Otherwise it’s tentatively a yes from me ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.762987012987013
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#14",
                    "likes": "2",
                    "time": "21/02/2022-11:58:32",
                    "content": "I like what this workstream has put out so far with the budget they have and especially compared to other streams the request for funding is not extraordinary so I will support it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 4.760416666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Huxwell",
                    "index": "#15",
                    "likes": "6",
                    "time": "04/04/2022-12:44:42",
                    "content": "Season 13 milestone report Contributors : 4 full-time & 2 part-time Funds spent to date from S13 fund allocation: 9221 GTC (21.4% of the dCompass treasury) Notable achievements for the quarter so far:   Big improvements on the product organization, kudos to Eli our scrum master   As a quest creator I want to configure how the rewards of the quest are distributed to the adventurers  Capture d’écran 2022-04-04 1631021897×992 61.4 KB    As an adventurer I want to complete a quiz so that I can claim the various rewards  image1906×998 36.8 KB   image1911×987 76.2 KB    Claim quest rewards transaction example on a testnet & NFT Reward on opensea   As a visitor I want to see a list of users that completed a quest  image1918×881 31.2 KB   Staging app to allow anyone to test and play with the first quests on testnets will be deployed during this week.  Achieved S13 roadmap goals so far:  Project Sponsor Pass (stake required to submit a project for review) ERC20 allocation and distribution for pathway and quest creation Claim ERC20, ERC721 and ERC1155 rewards Performance, additional datastore to act as a caching layer such as ThreadDB or PostgreSQL   Blockers in moving towards goals (if any): No blockers but we’re planning to attend multiple events to demo dCompass during devconnect and announce an official release of the MVP. Have any of actions of the workstream brought back value into the DAO/treasury (and if so, what?) Not yet but we do expect to generate value and revenue by the end of Season 13, post devconnect/official release. ",
                    "links": [
                        "https://trello.com/c/uUgRKeC3/4-5-as-an-adventurer-i-want-to-complete-a-quiz-so-that-i-can-claim-the-various-rewards",
                        "https://rinkeby.etherscan.io/tx/0xa03ecd1cd91d360739350d6e60d829d335dc261315d33a0a425e32270bc70f5c",
                        "https://testnets.opensea.io/assets/0xad66eccb5dc5a9d00a820fcf898fa72061539d52/1",
                        "https://trello.com/c/oD0aZqr1/9-8-as-a-visitor-i-want-to-see-a-list-of-users-that-completed-a-quest",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.431818181818182
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Huxwell",
                    "index": "#16",
                    "likes": "2",
                    "time": "14/04/2022-21:12:52",
                    "content": "Here’s the staging app with a bit of delay! https://dcompass-staging.herokuapp.com/ Anyone that has some Rinkeby ETH should be able to go through the Gitcoin Grants pathway and complete the quest to claim the rewards. Let us now if you’re having issues or any feedback to provide. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-mmm-season-13-budget-request/9818",
            "title": "[Proposal] MMM Season 13 Budget Request ",
            "index": 9818,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#1",
                    "likes": "9",
                    "time": "03/02/2022-20:04:06",
                    "content": " TLDR The MMM workstream is requesting a total of 30k GTC for Season 13. The focus for this season will be on:  Building Gitcoin’s lean, mean web3 marketing machine Shaping and grow a leading web3 brand Supporting GitcoinDAO & Workstream initiatives   Progress so far The goal of the MMM Workstream is to increase the awareness, engagement, and impact of Gitcoin, its Workstreams and its mission. We accomplish this by building sustainable channels, campaigns & content. If we’re successful, we will help establish Gitcoin as the world’s preeminent community of web3 builders, building for the public good. MMM was created in July 2021, in true bottoms-up fashion, via a Gitcoin grant. It has grown over the past 8 months to become a fully fledged Workstream with 6 core contributors and a talented, growing community of dozens of marketing personnel around the globe. Over the past quarter specifically, MMM has grown and evolved its mission significantly, from running grassroots meme & merch projects to where it’s now well-positioned to create & own the bulk of Gitcoin’s core events, products, and campaigns. This past quarter, the MMM Workstream focused on building out a team of contributors, setting up scalable structures and delivering on the initiatives outlined in our previous Workstream budget. The following are notable deliverables from our Q4 budget period: GitcoinDAO Digest:  The GitcoinDAO’s official weekly newsletter which aggregates updates from Workstream leaders and contributors across the GitcoinDAO ecosystem. Contains links and clear call to actions for both Stewards and contributors. Each edition is posted on the forum and via email. A succinct version is also posted on Twitter.  Social media channels:  Includes Twitter presence and external communication via @Gitcoin & @GitcoinDAO. The MMM Workstream assists with comms for other Workstreams as well, including designs and hosting for the regular “Public Goods Are Good” Twitter Spaces hosted by Alisha & Lani and regular comms for the Moonshot Collective.  Steward Report Cards  The Steward Report Cards provides the most valuable metrics on engagement for each Steward in the Gitcoin DAO. The back-end received a large upgrade as a stepping stone for the larger v2.0 upgrade that’s in the works. We’re exploring ways to provide deeper insight into both Stewards and Workstream through a collaboration with the Stewards Council initiative.  Memes.party  A MMM development project launched in Q4 to aggregate and curate great memes on the topic of Digital Public Goods, Web3 and the culture and values of Gitcoin. A version 2 of the site with added features is currently in development.  GitcoinDAO Primer  A short, ELI5 description of the GitcoinDAO vision and mission that will be used for onboarding & education for new contributors to find their way and get involved with GitcoinDAO.  Other items:  The MMM Workstream continues to engage the community through bounties, community building, and virtual events such as Memepalooza. We have created over 500 memes, numerous POAPs and merchandise to expand the reaches of the Gitcoin brand. We’ve also worked closely with the onboarding team and other DAO-wide initiatives to assist with design, branding and marketing needs.  Treasury:  Funds spent to date from Q4 budget: 18,000 GTC Funds to be carried over to Q1: 10,000 GTC, 2 ETH, 2,411 DAI  Continuing Activities and Proposed Budget In the upcoming Season 13, MMM will take another significant step forward by establishing specific objectives for 4 key areas: Channels & growth, Brand, Workstream marketing, and Team management/health. This Season 13 budget request is designed to align with these goals and is split into 7 key areas: MMManagement, Software & tools, Events, Development, Brand & design, Content, and Growth. This Season, we are formally adopting OKRs for Workstream priority setting and planning, with 4 key objectives laid out below. Our formal budget requests will follow these objectives and key activities. Objective 1: Build Gitcoin’s lean, mean web3 marketing machine Examples of key activities that support this objective:  Revamp the welcome email program, retention program and enable “abandoned” cart email Perform an a SEO and keyword analysis to identify top ranking goals, and create a content program and calendar that aligns to this Create web analytics tracking for GR13 to track conversions and make a tracking template for all marketing activities.  Objective 2: Shape and grow a leading web3 brand Examples of key activities that support this objective:  Develop and publish brand perceptions to focus marketing campaign content & Brand Guide to ensure our visual & written content is consistent across all marketing and brand design. Create pilot co-marketing project to create foundation for future partnerships Launch “Can Devs Do Something” meetup in 5 cities with at least 120 participants & create a forkable program that allows community to host their own decentralized global meetups Shape Gitcoin’s external perception & grow our global media presence, potentially by hiring and onboarding a leading Web3 PR agency  Objective 3: Support GitcoinDAO & Workstream initiatives Examples of key activities that support this objective:  Expand connections and collaborations with Workstreams, and ensure every Workstream has a designated marketing point of contact Establish a streamlined marketing resourcing request process Host and promote community-building virtual events such as weekly contributor meetups, happy hours, community hangouts etc Create and promote digest of key DAO activities to increase stakeholder understanding & engagement  Objective 4: Grow & support team health and accountability Examples of key activities that support this objective:  Recruit 3 top contributors - core and project-based. Ensure clear process for posting & completing work and prompt contributor compensation Propose, refine and gain approval for 2022 Q1 marketing plan including budget, OKRs and project plan All core contributors create & publish accountabilities, and receive regular performance feedback from peers and workstream leads Empower contributors to start and lead grassroots initiatives with minimal ongoing management  Clarification re: organizational changes: For the past several months, Gitcoin has had two marketing teams: one run by Sean MacMannis in Gitcoin Holdings, and the Gitcoin DAO’s MMM workstream. We plan to consolidate into one team in the current quarter. All marketing headcount and resourcing related to non-revenue generating products that are currently being staffed/subsidized by Gitcoin Holdings, will move into GitcoinDAO. We anticipate that all core marketing contributors will move to the DAO on or around April 1, 2022 as part of this organizational alignment. Therefore, this budget request includes only one month of compensation for the following 3 core contributors: Sean MacMannis, Fred Mannen, and Jonas Jahnsson. Future budgets are expected to increase as a result.  Budget Breakdown MMManagement | 13k GTC  MMM-Workstream stewardship  Team ops, coordination and management, onboarding, treasury management and accounting   Cross Workstream collaborations & project management Cross-DAO collaborations  Software and tools | 2k GTC  Marketing SaaS & tools Gas costs  Events and community engagement | 4k GTC  Developer meetups Contests and bounties Virtual events  Development | 8k GTC  Steward report cards v.2 - adding metrics & functionalities DAOMart - A novel way of rewarding delegators and contributors with merch & NFTs Memes.party v.2 - Aggregating, editing and sharing regen memes to boost our message  Brand & design | 8k GTC  Full-time design lead (TBH, expected April 1, 2022) Retained PR agency (expected March 1, 2022) Part-time design contributors POAP design bounties  Content | 3k GTC  Gitcoin DAO Digest Blog posts Social media marketing  Growth | 2k GTC  SEO Audit Experimental acquisition campaigns   MMMbudgetseason131920×1080 73.7 KB  On behalf of the MMM Workstream, we’re proposing a budget of 40,000 GTC covering Season 13 from February 1 - April 30, 2022. Our current Workstream treasury balance is 10,000 GTC.  Therefore, our request to the stewards is for 30,000 GTC for Season 13 (0.6% of the current GitcoinDAO treasury). Thank you for your review. If you have any questions or feedback about this budget proposal, please comment below. Signed by the MMM Workstream co-leads, Brittney, Fred & Sean ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-1-2022/9683",
                        "https://twitter.com/gitcoin",
                        "https://twitter.com/GitcoinDAO/",
                        "https://trello.com/b/qDaciNgF/moonshot-collective",
                        "https://www.daostewards.xyz/",
                        "https://gov.gitcoin.co/t/introducing-the-steward-council/9485",
                        "http://memes.party/",
                        "https://primer-gitcoindao.vercel.app/",
                        "https://gnosis-safe.io/app/eth:0xC23DA3Ca9300571B9CF43298228353cbb3E1b4c0/balances",
                        "https://gov.gitcoin.co/t/introducing-stewards-governance/41/211",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110"
                    ],
                    "GPT-summary": "The MMM Workstream is requesting a budget of 30k GTC for Season 13 to build Gitcoin's web3 marketing machine, grow the brand, support GitcoinDAO and Workstream initiatives, and improve team health and accountability. The proposal outlines the progress made so far, notable deliverables from the previous quarter, and the objectives and key activities for the upcoming season. The post invites feedback and questions from the readers.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Identity and reputation systems",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.406949433545178
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#2",
                    "likes": "4",
                    "time": "08/02/2022-03:58:31",
                    "content": "I’m supportive of this proposal and appreciative of the work that MMM workstream is doing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/anneconnelly",
                    "index": "#3",
                    "likes": "5",
                    "time": "08/02/2022-04:54:17",
                    "content": "The primer looks great folks! Keep up the good work! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.6875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/02/2022-19:07:45",
                    "content": "    seanmac:   Steward report cards v.2 - adding metrics & functionalities DAOMart - A novel way of rewarding delegators and contributors with merch & NFTs    I wonder if the DAO Mart is needed - Gitcoin has a swag store, are their more needs that the existing store cannot meet? I would love to see the dev effort go into the steward report cards, all else equal.     seanmac:  Retained PR agency (expected March 1, 2022)   which agency are we considering?  This Budget overall seems really sensible, and I love the outcomes (OKRs) listed. I am supportive pending some questions on DAO Mart ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.444444444444444
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#5",
                    "likes": "0",
                    "time": "09/02/2022-00:01:38",
                    "content": "Thanks for your feedback on the budget proposal overall and DAO Mart, Kyle. We’ll keep that in mind. On building our proposed work with a PR agency, we’re leaning toward working with Yap Global. We received an updated proposal from them, which I’d be happy to share if you’re interested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/02/2022-04:17:47",
                    "content": "    seanmac:  We received an updated proposal from them, which I’d be happy to share if you’re interested.   I would love to review, mostly as someone who is interested in learning the details of what services to expect from a PR agency. I don’t feel it appropriate for me to judge the work outlined as I trust you and the rest of the team on HOW to achieve your OKRs  I see my role as offering a sounding board on budget requests, sharing other market knowledge of what others are doing and what I see as potential blindspots in the plans for consideration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.671875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#7",
                    "likes": "5",
                    "time": "09/02/2022-23:26:22",
                    "content": "I’m very happy with the direction Brittney, Fred, & Sean are taking this stream! Fund them! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Huxwell",
                    "index": "#9",
                    "likes": "3",
                    "time": "10/02/2022-19:11:02",
                    "content": "I support this proposal and the MMM workstream for the great contributions made and those that are yet to come! MMM has become a voice for the DAO by organizing various events and Twitter Spaces. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#10",
                    "likes": "6",
                    "time": "15/02/2022-05:23:59",
                    "content": "Thanks for this detailed proposal! I will vote yes on this proposal, below some thoughts that popped up while reading this:     seanmac:  The GitcoinDAO’s official weekly newsletter   Very happy we have this, I think it’s a crucial element in informing the community. I think for the next quarter we can further invest in streamlining the process of creation, and we should definitely make time to look into the data. How many people read this? Who makes it until the end? In marketing terms how can we grow the audience & engagement to improve the ROI?      seanmac:  Social media channels:   Very much looking forward to seeing this become a more integrated whole. The goal of the two twitter separate accounts have become less clear imo (as mentioned to Sean), if the main account also starts sending ‘vibe’ tweets, what is the ‘raison d’être’ for the vibes/dao account? If none, we could close it down. But I hope we don’t and will just spend more time on defining both, would love to be involved, hope I’ll find the time to dive (back) in in Q1/Q2  Ps. @angel-fire is a genius ‘vibes shitposter’, let’s make sure we never lose her      seanmac:  Memes.party   Here I hope we can work more towards an event that actually creates output that suppports Gitcoin’s mission, even if it’s just by creating memes that are actually ‘going places’. I think more time should be spent on the format and objective & quantifiable outputs, without taking away the fun - see the earlier discussion we had (end of Q3) on ‘gemes’.     seanmac:  GitcoinDAO Primer   Tbh I think this is an example of how we still work too much in silos, as this project - although it looks beautiful - ‘competes’ with at least two other projects within the DAO. Hopefully we can further join forces in Q1.     seanmac:  Revamp the welcome email program   Definitely clear collaboration should happen here with the onboarding team within DAOops to ensure we don’t confuse our audience (as discussed).     seanmac:  Objective 2: Shape and grow a leading web3 brand   I think an important part of this could be clearly defining who we want to reach and where we should focus most. I read ‘Can do devs something’ under this, but are we sure this does not create too much overlap with what the hackathon&events team is doing? Is this in collaboration with them? A general note/thought on this: what is the overarching communication strategy for the DAO and how can we formulate MMM’s mission better ? Who does Gitcoin want to reach in the coming year? And how do we measure success? (without becoming too corporate-y or rigid) I think more work on our DAOs mission and short-term & long-term objectives is needed for this, and this goes beyond just the scope of MMM. However, I’ve seen you bring in this bigger picture view Sean, and massively appreciated this, so I think we are moving in the right direction here. Combined with @seedphrase & @Fred’s limitless energy, talent and collaborative, open spirit I think you are a power team that can move mountains. MMM is a beacon of positive, playful energy within the DAO and I hope you’ll keep on bringing that. Looking forward to see what’s coming next! Edit: extra notes after re-reading other comments plus budget breakdown: 1/ I agree with Kyle’s thoughts on DAOMart and I hope we can merge the work done here with the Gitcoin Store which already exists and improve upon it. The goal of DAOMart was to boost stewards’ engagement, I think this can be done within the existing store, and I hope the next steps for the latter will be talked through thoroughly with @Pop, who’s working  on steward engagement. 2/ PR agency: what will their role be exactly and how much experience do they have in the DAO world? 3/ Blog posts, I hope we’ll heavily invest in a number of on-call copywriters because this is definitely needed, so much to review. Also I’d set as an internal goal to beat @owocki when it comes to ‘proactive’ quality content producing, this forum is a treasure trove for leadership thoughts on DAOs & Gitcoin’s mission - we need more Owockis in '22 & imo this content should find lives beyond a governance forum to get more eyes on it. I’d personally move more funds towards content and taka away a bit from development. (see DAOMart comment) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.015209453845818
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#11",
                    "likes": "2",
                    "time": "21/02/2022-12:00:07",
                    "content": "Thank you for your detailed proposal and your work. I voted in support of the funding proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#12",
                    "likes": "3",
                    "time": "07/04/2022-00:43:08",
                    "content": "    krrisis:  I’d set as an internal goal to beat @owocki when it comes to ‘proactive’ quality content producing, this forum is a treasure trove for leadership thoughts on DAOs & Gitcoin’s mission - we need more Owockis in '22   Very delayed  This will have to be a goal for Season 14, def not going to get there in 13 when it comes to posts.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                }
            ]
        }
    ],
    "group_index": "673"
}