{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-stewards-collection-get-more-support-for-public-goods/7366",
            "title": "Proposal: Stewards Collection - Get more support for public goods ",
            "index": 7366,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Typto",
                    "index": "#1",
                    "likes": "4",
                    "time": "26/06/2021-06:33:11",
                    "content": " What Gitcoin has a collection feature. Anyone can package their donated projects into a collection and show them in Gitcoin Grants page or promote it in social circles. It’s a great way to showcase and spread those great projects. Let’s continue to expand it to better help those public goods: Stewards Collection.  Why Gitcoin’s stewards are some of the most reputable people in the crypto space. Their values are perfectly aligned with Gitcoin’s vision, and they are responsible and discerning. So their collections can garner a larger consensus, which can lead to more support for public goods that are valuable. But, although now we can see the collection of each steward’s collection, they are scattered and not at their maximum effectiveness. If there are a collection created by all stewards together, it would be more valuable and meaningful. In addition perhaps this could also go some way towards solving the problem of profit projects getting more support in Gitcoin Grants.  How Here’s an immature implementation:  Collect donation records from each steward to form a list (because stewards need donate first) Stewards discuss it and create a final collection (each steward needs to write a reason for the recommendation) Top the Gitcoin Grant page (including those public goods and reasons for recommendation) Promote it   Lastly In terms of the overall number of people involved in Gitcoin Grant, people are more aware of those profit projects. It will take the efforts of all Gitcoin community co-builders to get more people to know, understand, and support those public goods. Let’s start with stewards. As a steward, I’m willing to work towards that! Hope to have your support! and if you have any suggestions, please comment! ",
                    "links": [],
                    "GPT-summary": "The author proposes the creation of a Stewards Collection to showcase and promote public goods on Gitcoin Grants. The proposal suggests that a collection created by all stewards together would be more valuable and meaningful. The author provides an immature implementation plan and invites feedback and suggestions. A 3rd party could provide constructive criticism, extend the proposal, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Identity and reputation systems",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.664574032738095
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#2",
                    "likes": "0",
                    "time": "26/06/2021-15:02:22",
                    "content": "    Typto:  Gitcoin’s stewards are some of the most reputable people in the crypto space. Their values are perfectly aligned with Gitcoin’s vision, and they are responsible and discerning.   Hi @Typto, I like what you are saying      Typto:  If there are a collection created by all stewards together, it would be more valuable and meaningful.   This could be a really nice and funny project to do. Building up a collection all together! Great Idea! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.840277777777778
                }
            ]
        }
    ],
    "group_index": "506"
}