{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/the-future-of-moonshot-collective/11604",
            "title": "The Future of Moonshot Collective ",
            "index": 11604,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/michaelgreen06",
                    "index": "#1",
                    "likes": "6",
                    "time": "04/10/2022-13:56:07",
                    "content": "  The future of Moonshot Collective    TL;DR The Moonshot Collective (MC) workstream has transformed dramatically from the initial launch in May 2021. Given the current state of affairs, we have determined the best path forward is to merge MC with the Gitcoin Product Collective (GPC) workstream. This merge brings a lot of benefits to the DAO with very little downside.  How We Got Here The Moonshot Collective workstream was launched in May of 2021 by Kevin Owocki and Austin Griffith. The initial purpose of the workstream was to “build dApps that govern and grow funding for public goods.” Austin & Kevin initially led the workstream, which produced a few successful projects (Moonshot Bots, Marshot Bots, Optimism Partnership, Multidropper, Greatest Larp, etc). Many of the Moonshots (Tip.party, Pay.party, Recruiter.party etc) we worked on were unable to find product market fit right away. When the bear market hit, we could not afford to take any more Moonshots and had to shift our focus to advancing the DAO’s essential intents.  Where We’re at Now At the time of writing, MC’s primary focus areas are:  Drive adoption of the Grants and Passport protocols by building modules that meet the needs of key design partners. (Essential Intent = Protocol Adoption) Make the protocols more approachable by being the first community to build on top of them and provide feedback of our building experiences to the protocol teams. (Essential Intent = Protocol Adoption) Increase the utility of the Gitcoin governance token (GTC) by experimenting with ways to integrate it into the core protocols. (Essential Intent = Financial Sustainability) Mobilize MC talent to GPC teams to help enhance their capacity in delivering the core protocols. (Essential Intent = Protocol Adoption)   Why Merge? Our current areas of focus cause us to spend most of our time working on/with the core protocols. Merging with the team (GPC) that is building these protocols provides numerous benefits:  Clear Ownership  Ownership & maintenance responsibilities for the things MC built was previously unclear. Merging MC & GPC eliminates this confusion by giving MC members shared ownership over a specific domain (Grants Hub, Round Manager or Passport) within GPC, that is responsible for ownership & maintenance.   Reduce Operational Overhead  Running two separate workstreams results in twice as much operational overhead. All operations work within GPC is currently handled by the workstream leads, which often forces them to deprioritize important protocol work. Merging MC & GPC enables the GPC workstream leads to delegate operational work to the MC operations lead, and gives them space to utilize their time more effectively.   Stronger Leadership  Merging MC with GPC gives MC contributors access to a seasoned software engineering leader (Kevin Olsen) who can help guide them on best practices to follow when building on the protocols.   Reduce Silos  MC’s current and future work has key dependencies on each of the protocol teams. Bringing our teams together will reduce silos and improve the efficiency of MC building on/with the protocols.   Stronger Together  MC already has talented builders contributing and adding value to GPC. Merging the teams formalizes this arrangement and brings in the rest of the MC team to add even more value to GPC. The addition of these builders increases GPC’s capacity for development and results in a stronger, more capable workstream that can bring products to market at a faster pace.   Clear Direction  Merging MC with GPC provides more structure and purpose for MC. This structure & purpose enables us to focus on building impactful things instead of spending time & effort trying to figure out what we should be focusing on.   More DAO Native Development  GPC is currently working with an outside software development firm (Focused Labs) to build Round Manager (RM). This merge enables MC members to fill the gaps on the RM team so we can end our reliance on an external team.   Reduce Redundancy  MC & GPC currently have very similar communities of builders. Merging the two workstreams allows us to combine our communities to form a bigger, stronger community and reduce duplicative community management work.     Possible Downsides There are many benefits to this merge, but there are also some possible downsides:  Centralization  As a workstream grows, it could become more challenging to manage in a decentralized way and hierarchy may creep in.  Merging MC with GPC increases the workstream from 16 contributors to 23, a 44% increase in size.   It may be challenging to get funding for a larger workstream due to the sticker shock of the total funding request.  In reality, the total ask from the treasury is likely to be lower than if the two workstreams requested funding separately.     Loss of Autonomy  MC members that are accustomed to having full ownership of how and when they work will have to adjust to a new way of working within GPC. GPC teams work in a highly collaborative team environment and MC members will be expected to work in this same way.   Loss of social capital  MC could lose the recognition and community that are associated with its brand. MC will likely not be known as MC anymore.     What will the merge look like? The MC team will formally merge with GPC in Season 16. MC members will join existing teams within GPC. See Figure 1 for a detailed view of the new structure of GPC. Our focus will be building the core protocols and essential features/modules on top of the protocols.  1122×1600 189 KB  Figure 1. The new structure of GPC after it merges with MC.  Stay in touch! Join MC for our last community call on Wednesday October 19 at 3:05pm UTC. We will be celebrating all the successes and failures of MC from the last 17 months. Rumor is, there may even be a poap  If you want to stay up to date with what we are doing inside of GPC, make sure you join the GPC Discord Channel for regular updates.  What do you think? The current members of the MC & GPC workstreams are all in favor of this merge for the reasons listed above. We are really close to the problem though, and want to get feedback from the outside community. What did we miss? Why do you think this is a good idea? Why do you think this is a bad idea? Please let us know your thoughts! ",
                    "links": [
                        "https://gov.gitcoin.co/t/workstream-dapp-prototyping-the-moonshot-collective/130",
                        "https://gov.gitcoin.co/t/update-gitcoindaos-adopted-purpose-and-essential-intents/10984",
                        "https://discord.gg/U9hMNWqs",
                        "https://gov.gitcoin.co/t/s16-proposal-integrated-gitcoin-product-collective-budget-request/11814",
                        "https://gov.gitcoin.co/t/gitcoin-digest-36-reflecting-on-gr15-and-looking-to-s16-plus-dev-con-and-schelling-point-in-bogota/11610"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.823215740352837
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/alexdwagner",
                    "index": "#2",
                    "likes": "2",
                    "time": "04/10/2022-14:29:29",
                    "content": "Fwiw, I think this is a great idea. Thank you for writing the post! MC’s reasons for merging w GPC are clear and the upsides look to significantly outweigh any downsides, especially when thinking about the continued development of Round Manager, Grants Hub and Passport and getting PMF for these projects. Onward and upward  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2749999999999995
                }
            ]
        }
    ],
    "group_index": "213"
}