{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-gitcoin-needs-to-be-more-developer-led/12530",
            "title": "[Proposal] Gitcoin needs to be more developer-led ",
            "index": 12530,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#1",
                    "likes": "4",
                    "time": "09/01/2023-22:13:24",
                    "content": "[Background] Since publishing A BULL/BEAR case for Gitcoin/GTC in 2023 I have gotten to know many of you.  Thank you for reaching out on DMs with comments and feedback.  It has helped me and my colleagues understand GTC and the opportunity behind it. [Hypothesis] Based off of the information I have gathered in the past several weeks; I have a hypothesis I want to share with you.  To be successful as a ProtocolDAO, Gitcoin needs to be more developer-led.  [Observations] This hypothesis is based on the following observations: 1 Gitcoin says it’s a protocolDAO, and that it’s protocols are launching soon. Developers will be the primary people building on the protocols  BUT  I don’t see any evidence of developer engagement or developer leadership anywhere. 2 Gitcoin has a workstream called the Gitcoin Product Group ( [S15 Proposal] - Gitcoin Product Collective Workstream Proposal & Budget Request ) BUT the only people who engage from that workstream are the managers, not the individual contributors who are building the protocols. 3 If you look at successful API companies in web2 or successful developer communities in web3, they are almost always places where developers hang out and socialize.  There are almost never sales driven cultures in these organizations, they are always product or developer oriented cultures. [Proposal] Who are the developers who work on Gitcoin? I don’t know!   These pictures are what Github shows.  I think that to be successful, Gitcoin needs to treat developers like rock stars.  190627sor-0153-16353769651920×1279 286 KB  Like music, Software development is an art.  Gitcoin should valorize it’s developers like they are rock stars.  And it should cheer them on as they ship code the way you’d cheer for a rock ballad. To build a more developer oriented culture, Gitcoin should treat it’s GPG developers like rock stars.  Invite them on stage to tell us about the protocols.  Ask them about the technology, ask them about the design choices, invite them to give demos.  Ask them what they are dreaming up next.  Build their leadership muscles. Trust them to lead. To build a more developer oriented culture, Gitcoin should treat it’s ecosystem developers like rock stars.  Give them great tools and documentation to do their job.  Inspire them with whats possible now that they have Grants Stack.  Show up where they hang out & build relationships with them.  Have an amazing outbound developer engagement strategy with generous prizes at hackathons for the best builds.  Get hands on with them. Listen to their feedback and fix the problems that they point out.  EEA+sketch1372×1184 74.5 KB   t6b2x3y2oe6v1o7eu0531078×600 424 KB  [Summary] To be successful as a ProtocolDAO, Gitcoin needs to be more developer-led. Building a more developer friendly culture is not to say that other skillsets are unimportant (all skills are welcomed).  Building a more developer friendly culture is a recognition that a strong developer culture is a key to success in web3.    This rising tide for developers will lift all boats at Gitcoin! I propose that Gitcoin:  create a Developer Relations workstream. shift it’s culture to amplify the contributions of developers.  ",
                    "links": [
                        "https://gov.gitcoin.co/t/s15-proposal-gitcoin-product-collective-workstream-proposal-budget-request/11058",
                        "https://github.com/orgs/gitcoinco/people",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/5/542ee3a2d2849a37295d39ae322575608b190758.jpeg",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/b/b5043d0cb5e91d9f8aeee1aedf3ff9fbdfa3ccb0.jpeg",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/5/5a086b4bac3990c43762cb1e8d7f304b034a3d6e.png",
                        "https://gov.gitcoin.co/t/thought-experiment-dao-strategy-and-subtraction/12534/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.713037634408602
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#2",
                    "likes": "2",
                    "time": "10/01/2023-19:18:28",
                    "content": "Thanks for the feedback! I agree (and ltos of others do as well!). We just brought on our first Developer Experience lead to help define and shape this problem space. His name is Zakk and I am excited for you to me thim. As for timeline, we are trying to build a stable base to welcome developers to ahead of EthDenver. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/carlosjmelgar",
                    "index": "#3",
                    "likes": "1",
                    "time": "10/01/2023-19:26:02",
                    "content": "These are great points that I, as a grantee, wouldn’t have considered. There is a huge gap between final users and devs. I’ve also experienced this at web3 companies I worked at and tried to include the devs in streams and spaces as a shout out. This post definitely created a sense of appreciation for their work. I hope to meet devs at the nect conference I attend ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#4",
                    "likes": "3",
                    "time": "11/01/2023-14:22:42",
                    "content": "I love this post (again @a33titude killing it on the forums) And, I’m super excited to get to intro @0xZakk as our head of devrel. I’m way bullish on Zakk and think he’s going to help us build an awesome dev community around our protocols and products. And as your post really highlights, help us shine the spotlight on the dev here internally who make this whole thing happen. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.863095238095238
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/gravityblast",
                    "index": "#5",
                    "likes": "1",
                    "time": "11/01/2023-23:03:53",
                    "content": "Hey @a33titude I’m Andrea, engineering team lead at GrantsHub. Great post, I agree with you and we’ll do the best to improve this part! Feel free to connect with me in discord as well. And welcome @0xZakk! perfect timing  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.200000000000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/0xZakk",
                    "index": "#6",
                    "likes": "2",
                    "time": "11/01/2023-23:22:15",
                    "content": "Hey @a33titude would love to find a time to discuss these ideas further! You’ve clearly articulated a couple of ideas that have been discussed a bunch within Gitcoin and I’d love to dive into these a little further. I’ve sent you a friend request on Discord. We can coordinate a time to chat there or feel free to shoot me an email at zakk@gitcoin.co. Looking forward to chatting soon ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/thelostone-mc",
                    "index": "#7",
                    "likes": "3",
                    "time": "12/01/2023-09:30:41",
                    "content": "Haha yeah, that’s a pretty solid callout @a33titude ! We likely should up our game with the developer engagement + leadership front. Let me see if I can take a stab and making our efforts more public and have the community weigh in on how we build a solution A quick intro ! thelostone-mc here who’s the engineering lead for the grants-round. But yeah I do love you calling us out and giving us a nudge to try something different. Will likely hit you up for some thoughts on this as well @0xZakk ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                }
            ]
        }
    ],
    "group_index": "289"
}