{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/assorted-musings-on-quadratic-lands/3381",
            "title": "Assorted Musings on Quadratic Lands ",
            "index": 3381,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "4",
                    "time": "28/05/2021-02:56:40",
                    "content": "A few weeks ago, I was gifted an amazing Quadratic Lands painting by @artbynelly and I spent a lot of the weekend thereafter just staring at the painting, just sort of gawking what kind of world we were co-creating in the Ethereum space.  EzrJhWcXsAA6pc1970×1200 225 KB  I wrote down some of those modes of thinking.  I’d like to share them with you all today.  New possibilities One of the coolest things I  think about the Ethereum space is it’s ability to enable “what if’s” that were previously not possible.   What if you could change the laws of economic gravity?   What if the world was filled with transparent Economic Games that cannot be changed on you?   What if democracy was digitally native? If public goods were funded?   What if society was organized around peers creating the actualization of human potential for each other.   What the world was less unequal; not because those at the top were dragged down, but because those who were at the bottom were elevated.   What if blockchain technology was used, but not for speculative “rich get richer” type games, but for the actualization of potential for the 95% of humanity that’s financial lives are their jobs - not investments.    The Meme of the Moment The Internet of Value is built by programmable money. Now that humanity can program their virtues & their vices into indestructible digital contracts & unstoppable markets, what types of marketplaces will be built on this technology? It seems without question that this moment in history is arriving contemporaneously with profound global turmoil. With the decline of the Industrial World comes the decay of citizen’s faith in their Industrial Institutions. We are observing a decentralized & pervasive breakdown of the social fabric of Industrial Age capitalism. In its stead, we witness the rise of a digital economy with increasing influence - both social & economic. As the organizing mechanisms for society shift from the Industrial Age to Information Age, we may witness profoundly rapid global changes in humanity’s behaviour. There is a concept in design called Skeumorphism - which describes when a computer program contains User Interface objects that mimic their real-world counterparts (like the trash can on your PC having an icon of a physical trash can). To what degree will our digital age be Skeumorphic to the old world? How often will it resemble the economy of our Industrial Era grandparents? How often will it be wildly different? Societies design systems which mirror their own communication structure. As our communication patterns shift online and orgically evolve in it’s new medium, new systems will evolve to support digital societies. Some of these new institutions will be Skeumorphic, some of them will not be Skeumorphic. Some will be profoundly novel in ways we cannot anticipate. In other words: Strap in; the world is about to change. A lot. As we cross this horizon, it seems obvious to me that the 21th century belongs to digitally-native institutions. We all have a faint understanding that these Institutions will not resemble those that our parents relied upon, but we can’t tangibly predict what new Institutions look like until we already rely upon them. There are a handfuls of us who are living the bleeding edge of the internet, leveraging programmable global money creating the economy of tomorrow; what kind of civilization will we build? I sure hope that we use web3 technology to make a utopian future instead of a dystopian one. But this hope begs the question; what even is utopia? If an utopian society is an imagined place or state of things in which everything is perfect; then whose imagination are we living in exactly?  What would a better world even look like? It strikes me that defining what a utopia could look like, especially if we are to avoid pitfalls that have befallen those who have tried before us, is a monumental task. So let me try to de-risk this by submitting to you that:   I will provide one voice to this discussion, with the recognition that the direction that this space ultimately goes will be the aggregation of the visions of the entire community.   The mechanism, aggregation(everyones opinions) => QF => TRUE QL is how we arrive at the true QL.   I am one voice, but also someone who has thought a lot about the QL.   It is okay to have a north star that seems unachievable today. We can iterate; we can try again and again and come up short. That’s okay, because seeking a better world is not just a means to an end, it’s an end in itself.    My own take What follows is my subjective and interpretation of what this world could look like: We could start by evaluating the society that we’ve inherited from the Industrial Age. The thread that I want to pull is this: We live in an unequal world. What kind of society would you design, if you had to live the rest of your life as a random person in the society you made?  1600×802 130 KB  If I could program an economy, it would simply be a world where as many people climb as high as possible on this pyramid for as long as possible  1278×956 142 KB  We can (and should) haggle about the amount of individual agency each citizen has (or doesn’t have) to define their own climbing of said pyramid. Is an entrepreneur who built the latest unicorn lucky, good, or were they aided by society and their privilege at every turn? In exactly what scenario is a person who is suffering responsible for their circumstances versus predestined by socioeconomic status and family dynamics at birth? We can (and should) haggle about how exactly to trade the 95% percentile’s self-actualization for the 10th percentile’s physiological needs, that is probably an important system design question for a group of humans designing the next organizing principles for humanity to have.  Iterating Towards Coordination So how do humans organize themselves to coordinate? One way that humans decide how to route resources is through markets. Supply & demand in an equilibrium that keeps a flow of goods from producers to consumers. Private goods, like the kind of stuff you can buy on Amazon.com, are commonly produced with markets. Another way that humans route resources is through nation-state governments. In this system, Governments impose taxes on the population, and provide them with national defense, roads & bridges, and maybe an array of social services, or so the theory goes. Public goods, the kind of benefits that derive implicitly from being ruled by a government, are delivered this way.  As civilization marches into the Information age, these resource routing mechanisms are being reconfigured. The mechanisms for delivering private goods will change, and so will the mechanisms for delivering public goods & services. The filtering mechanism for human coordination used to be geographic. We traded with those in our immediate social environment. Now that the internet has created the ability to communicate with anyone worldwide instantly, we have seen a dramatic increase in our ability to send information. But it has not created the kind of organic trust, across borders, which has historically existed in geographic societies. What if we could transport trust across the internet. We could extend trust past the Dunbars number - the suggested cognitive limit to the number of people with whom one can maintain stable social relationships  1248×792 109 KB  Steve Jobs once said “Technology is a bicycle for the mind”. There are 7 billion humans on planet earth, and if humans can fit 450 other humans in their extended network then our implicit trust must extend by 4 degrees of connection (450**3.7). What if we could increase the average humans ability to maintain stable social relationships by 100x, to 45k, it would only take 2.1 degrees of connection (45000**2.1) to build implicit trust among all of humanity. If that was possible we could begin to build new systems that embed the incentives of market participants to better create goods and services that benefit the group. We could create a bento box of incentives; instead of just focusing on now me/future me, we could build systems that focus on future us.  1024×959 75.7 KB  What if the world was a giant prisoner’s dilemma game, where we all just have to decide to coordinate instead of defect? There are ways of engineering trust into groups of humans. We can do it. We have the technology.  95% of humanity’s financial lives is their jobs not their investments. Are we leaving upside on the table by only targeting the top 5% of the global population with this technology? I think the answer is most certainly yes. Software engineering is a path to a middle class life for 1000s of humans these days. What if we could teach them software skills, they could help us build this space. And we could bring them into the financial sovereignty that was not possible in their old worlds?  First, Do No Harm It is worth noting that a lot of these ideas have been tried before. Before it became a platform for misinformation campaigns by foreign governments, Facebook’s mission was to connect the world. Before they became an advertising platform that sold their users attention, they were a community tool. Harvey Dent (Two Face) from the Batman series puts it this way: “You either die a hero, or you live long enough to see yourself become the villain.” One reason I have hope that this time it will be different is: With Ethereum, we have transparent economic games where the rules can’t be changed on you. Even by their creators. That gives me a lot of hope. If we can program our values into our money, its important that those values stay chiseled into the money, and there isn’t a rootkit in there somewhere that the next Mark Zuckerberg can use to rent-seek on everyone and become a billionaire. In political philosophy, the phrase consent of the governed refers to the idea that a government’s legitimacy and moral right to use state power is only justified and lawful when consented to by the people or society over which that political power is exercised. This theory of consent is historically contrasted to the divine right of kings and had often been invoked against the legitimacy of colonialism. [Wikipedia] I would like to see the users of the internet of money be the owners of the internet of money. There is no better way to create the consent of the governed than to have the governed be the governors of the system. Of course there are problems with this. The average everyday citizen does not have the time to understand & study civic problems, nor is voter turnout particularly high. I have high hopes for Liquid Democracy - a form of delegative democracy whereby an electorate has the option of vesting voting power in delegates as well as voting directly themselves. If the users of a system can set a delegate for their voting power to someone they trust, and revoke it at any time – that seems like a great way to manage the consent of the governed for these internet systems. Especially if these systems have a default delegation rate. Even a system has high voter participation, it still may be subject to capture. There is actually a law of economics that states that systems of humans tend to trend towards capture - This is called the Matthew effect of accumulated advantage, and it’s sometimes summarized as “the rich get richer and the poor get poorer”. The concept is applicable to matters of fame or status, but may also be applied literally to cumulative advantage of economic capital. I believe that this is something we want to unwind. If it is an immutable law of economics as is gravity an immutable law of physics, then even then we can find ways to transcend it. An airplane can still fly, despite gravity, right? For this, I have high hopes in Quadratic Voting. Quadratic voting is a collective decision-making procedure which involves individuals allocating votes to express the degree of their preferences, rather than just the direction of their preferences. QV is designed such that - When citizens want to express strongly a degree of preference, then it is very costly. As the number of votes spent by any one individual on a direction increases, the cost of that vote increases exponentially.  This voting system is designed to avoid capture by rich individuals and radial individuals. Just as the laws of physics can be worked around, we have just found a way to work around economic gravity.  The Exponential Accelerating Pace of Change One of the coolest things about the Ethereum space is how the growth compounds to accelerate innovation. The thing that makes this work is composability. All of the different pieces of this Internet of Value are designed to work together. If legos are how a child builds a plastic toy house, money legos are how the Ethereum community will build a new financial system. I remember when DAI came out. Until then, all crypto tokens were wildly volatile. But now, the Gitcoin team could use a token, defined by the ERC20 interface, and just assume that 1 DAI = $1. Then cDAI came out. It had the same properties of DAI, but it could generate yield. And we could 1 click add it to Gitcoin. Then MolochDAO came out. And we could pool our DAI to contribute to projects together. From 2017 to 2021, a hundred projects launched, and the surface area for innovation grows exponentially every time a new one launches. By combining these money legos, we can build faster & more confidently than ever before. This is the reason that 3 20-something hackers can walk into an ETH hackathon and build something in a weekend that in TradFi would have taken 1000 people and $10million dollars to build. This pace of change is profoundly new, and the awesome momentum of it will only be obvious in hindsight.  Coordination is a Choice As an individual who is surveying the progress at ground zero of the Ethereum space, I can confidently say: A better world is possible. I might even go so far as to say a better world is inevitable. But - as I stated above, the above are simply my views on the way the world could change for the better. But I am one voice in a community of thousands and a world of millions; it will be the aggregation of our preferences and choices that will steer the world. That’s the magic of quadratic funding.  It aggregates everyones preferences in an efficient way, and thats why I think it can be the vessel to take us to the quadratic lands.  All coordination is a choice. We must know how to avoid coordination failures. We must create coordination. The builders must BUIDL it. The artists must paint the picture. The writers must chart the course. The financiers must finance the expeditation. And to everyone else: if we meme it, they will come.  https___bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com_public_images_e5cf7c00-20d8-463c-9964-270f82078e91_500x1069500×1069 137 KB  ",
                    "links": [
                        "http://Amazon.com",
                        "https://en.wikipedia.org/wiki/Consent_of_the_governed",
                        "https://newsletter.banklesshq.com/p/know-thy-enemy-coordination-failures",
                        "https://twitter.com/owocki/status/1382854617344610304"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.710472756595752
                }
            ]
        }
    ],
    "group_index": "389"
}