{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/should-we-increase-quorum/13031",
            "title": "Should we increase quorum? ",
            "index": 13031,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "quorum",
                "governance",
                "stewards"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "2",
                    "time": "21/02/2023-20:37:22",
                    "content": "Continuing the discussion from Gitcoin DAO Governance Process v3:    Gitcoin DAO Governance Process v3   Quorum In order for a proposal to succeed, a minimum of 2.5 million GTC must participate in the vote. Any changes to quorum requirements must be ratified by the community. Each vote DOES require a quorum or the vote is not considered valid. It is the proposal creator’s responsibility to ensure they are soliciting votes from the community and reach quorum.   There are multiple pairs of delegates who could pass a vote with only their votes. Perhaps we should up the quorum with our next governance update.  Image 2023-02-21 at 2.31.36 PM2750×1734 386 KB  ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v3/10358/1",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/2/249e0aac845ed9091a486165a59f582cf8e422d2.jpeg"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#2",
                    "likes": "1",
                    "time": "22/02/2023-02:44:23",
                    "content": "I want to get a GCP together for the governor changes that we have been Exploring with the folks at Scopelift. A couple of thoughts, the threshold of 1MM is too high IMO. It should be closer to 250k or 500k The threshold higher may be okay, but we also might get into a situation where folks may be less active. right now, I feel like I have to vote on everything, even if I am aligned with the sentiment… its kind of wasteful IMO. So, I could either way on raising or lowering it. I think the important thing is that if its a contentious vote, we need a way to “activate” people. The quorum doesn’t matter in that regard. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1848214285714285
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/vikrant6661",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/02/2023-03:04:14",
                    "content": "“I think the important thing is that if its a contentious vote, we need a way to “activate” people. The quorum doesn’t matter in that regard”. Well said. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#4",
                    "likes": "1",
                    "time": "22/02/2023-11:42:18",
                    "content": "Hey @DisruptionJoe For context, the purpose of quorum is specifically to avoid the situation where a minority number of members convene and make decisions in the absence of the majority of the members.  Historically quorum defaults to 50% of the organization unless otherwise stipulated.  Often, there are other safeguards put in place like who can call the meeting, when are meetings held, how much notice is required before a meeting can convene, etc. In our case, we could interpret that as 50% of the average number of tokens cast, and at Gitcoin that is between 5M to 6M tokens.   But practically, Gitcoin has the 5 day posting period which acts as our primary safeguard.  Presumably - if a “drain the treasury and give it all to me” post were to be posted, there would be enough time to react to the proposal.  If it did happen to pass, the secondary safeguard would be the Tally vote which triggers the wallet action. Net: I don’t see the need for it, but I could be convinced given the change would be a low lift/risk.     kyle:  I feel like I have to vote on everything, even if I am aligned with the sentiment… its kind of wasteful IMO.   I do not quite understand the point point, but I would be interested in learn more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.522321428571429
                }
            ]
        }
    ],
    "group_index": "330"
}