{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/expected-timeline-for-completion-ratification-and-payout-of-gr11-matching-funds/8673",
            "title": "Expected Timeline for Completion, Ratification, and Payout of GR11 Matching Funds ",
            "index": 8673,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "5",
                    "time": "24/09/2021-23:02:14",
                    "content": "Now that GR11 has ended, the completion work for the round begins. Here is what needs to be done and when grant creators can expect payouts. Estimated Timeline for Round Resolution  Final run of Anti-Sybil ML pipeline - 9/27 All grant disputes resolved - 9/28 Posting of GR11 Governance Brief - 9/30 Posting of Blockscience Anti-Sybil ML debrief - 9/30 Posting of official proposal requesting steward ratification of GR11 results - 9/30 Posting of snapshot vote requesting steward ratification of GR11 results - 10/7 Payout of matching funds from community multisig to GR11 grant creators - 10/14-20  Note: There is a 5 day minimum deliberation period after posting a proposal and after posting a snapshot vote. Also, a new program will return unclaimed matching funds to the community multisig 90 days after the payout period begins. Here is what is happens during the completion phase of the round First, the machine learning tool for detecting sybil accounts will do a final run on Monday, the 28th. Once done, the true fraud tax number will be available. Current estimate is 0.18% which is down from GR10 which came in at 0.8%. At the same time, resolutions for all open grant disputes will be determined. The Fraud Detection & Defense (FDD) workstream will publish the Governance Brief including:  True fraud tax amount Any sanctions taken Grant Disputes and Resolutions Any appeals within the round  Example: GR10 Governance Brief Blockscience will post a review of the machine learning results Example: GR10 Round Results Evaluation FDD workstream will publish the ratification proposal Example: GR10 Round Results Ratification Proposal The Public Goods Funding workstream will post the snapshot vote Example: GR10 Round Ratification Snapshot Vote Gitcoin Holdings will launch the non-custodial GR11 payout contract. (Reviewed and approved by Public Goods Funders League) The community multisig keyholders will execute the payment to the GR11 payout contract. The contract will return unclaimed matching funds to the community multisig 90 days after it is launched. Find more info on the FDD & PG workstreams at GitcoinDAO.com ",
                    "links": [
                        "https://gitcoin.co/blog/gitcoin-grants-round-10-governance-brief/",
                        "https://medium.com/block-science/evaluating-the-anti-fraud-results-for-gitcoin-round-10-cec9277ce5b2",
                        "https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-10-and-formally-request-the-community-multi-sig-holders-to-payout-matching-allocations/7832",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmdLNbbE4CHPwyhfsqjj1qzst2NFjXS6Ax3moqWwgVWjQa",
                        "http://www.GitcoinDAO.com",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-13/8711"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.089751683501683
                }
            ]
        }
    ],
    "group_index": "578"
}