{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/decentralized-autonomous-food-marketplace/7464",
            "title": "Decentralized autonomous food marketplace ",
            "index": 7464,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/jrepusseau",
                    "index": "#1",
                    "likes": "0",
                    "time": "28/06/2021-18:00:27",
                    "content": "Hi Gitcoin community, I’m working on a decentralized autonomous food marketplace run by  farmers, couriers, token holders and developers. Anyone can contribute to the marketplace, any interested buyer will be able to stake tokens in his nearby farm group, buy directly to food producers and once a week withdraw products or order for at home delivery. Decentralization will help farmer to manage and sell their products as digital asset, give incentives for couriers to offer delivery services and eliminate third parties needed for trust or plateform reliability. I just write a small proposal really incomplete about this project, I’m still studying and  I take all advices from the structure, technical parts, DAO governance, market analysis,  grammar and translations typos , to continue further. LilyDAO_Projetproposal_EN Have a good day, Peace and love, Jules ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jrepusseau",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/07/2021-15:00:45",
                    "content": "[Last edit 11/07] Hi wonderful people, I have reviewed and corrected biggest part of the project threre you can find the lastest version of the project here. I try to my best to build the best marketplace system economically and sustainable for local agriculture and responsible consimer by making good use of NFT marketplace and stacking pool technologies. Please kindly consider my project update, it’s important for me to progress, so don’t hesitate to build critics. LilyDAO Have a good day, Love and Peace, Jules ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                }
            ]
        }
    ],
    "group_index": "511"
}