{
    "poll_list": [
        {
            "id": "QmZbt14YZBzLtx4umQ9hxSwxZFRsV8BNr9VV7dGoKRsDLT",
            "title": "MMM (Merch, Memes & Marketing) Q4 2021 budget request",
            "discussion": "",
            "body": "Through this proposal, the MMM-Workstream is requesting a governance reward budget of 28,000 GTC to be deployed for Q4 2021 in service of Gitcoin DAO and its wider community.\n\nThe MMM-Workstream has the goal to use Merch, Memes, and Marketing to promote public goods with unique projects that generates curiosity, hype and engagement around Gitcoin DAO and its core mission. MMM also exists as a cross functional group to create synergetic effects by collaborating with other workstreams. The medium-term goal is to create a lightweight way for creative talent to work with Gitcoin DAO with the least amount of friction and get compensated fairly for it. MMM will work towards incentivizing and rewarding contributors for their work in order to meet the demands of the community and deliver a consistent, high-quality service.\n\nRead the entire proposal and budget breakdown [here](https://gov.gitcoin.co/t/proposal-merch-memes-marketing-workstream-budget-request/8562)\n\nGnosis Safe address: \n[0xC23DA3Ca9300571B9CF43298228353cbb3E1b4c0](https://etherscan.io/address/0xC23DA3Ca9300571B9CF43298228353cbb3E1b4c0)   \n\n\nAll spending of funds will be shared and logged transparently in a public spreadsheet and managed by a public 2 of 3 Gnosis Safe multisig with the following keyholders:  \n\n- @Seedphrase (Brittney) - Steward\n- @Fred (Fred) - Advisor\n- @Ceresstation (Scott) - Steward\n\nSee the initial proposal on the governance forum [here](https://gov.gitcoin.co/t/proposal-merch-memes-marketing-workstream-budget-request/8562). This proposal met the minimum (5) days of deliberation having been posted on 09/13/21 and received input from at least 5 Stewards.",
            "choices": [
                "For",
                "Against"
            ],
            "scores": [
                2384503.2621166524,
                374.91233150386097
            ],
            "start": 1633377600,
            "end": 1633809600,
            "snapshot": "13354549",
            "state": "closed",
            "author": "0x7E052Ef7B4bB7E5A45F331128AFadB1E589deaF1",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "MMM Q4 2021 Budget Proposal ",
            "date": "Proposed on: Oct 22nd, 2021",
            "yes_votes": "3.64M",
            "no_votes": "0"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-merch-memes-marketing-workstream-budget-request/8562",
            "title": "Proposal- \\xe2\\x93\\x82\\xef\\xb8\\x8f\\xe2\\x93\\x82\\xef\\xb8\\x8f\\xe2\\x93\\x82\\xef\\xb8\\x8f (Merch, Memes & Marketing) Workstream Budget Request ",
            "index": 8562,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/seedphrase",
                    "index": "#1",
                    "likes": "19",
                    "time": "13/09/2021-20:37:35",
                    "content": "Hi everyone! On behalf of the MMM-Workstream, we’re proposing the following budget to deliver on our mandate, following up from the Workstream proposal. Through this proposal, the MMM-Workstream is requesting a governance reward budget of 28,000 GTC to be deployed for Q4 2021 in service of Gitcoin DAO and its wider community. The MMM-Workstream has the goal to use Merch, Memes, and Marketing to promote public goods with unique projects that generates curiosity, hype and engagement around Gitcoin DAO and its core mission. MMM also exists as a cross functional group to create synergetic effects by collaborating with other workstreams. The medium-term goal is to create a lightweight way for creative talent to work with Gitcoin DAO with the least amount of friction and get compensated fairly for it. MMM will work towards incentivizing and rewarding contributors for their work in order to meet the demands of the community and deliver a consistent, high-quality service. We believe that sharing ownership over creative work will help people feel more involved, promote understanding of Gitcoin’s mission and create a welcoming atmosphere to incentivise taking part in the creation of digital public goods. MMM would eventually grow to take on the mandate of being the design, marketing and communications arm of Gitcoin DAO. The core team of the MMM-Workstream consists of:  Brittney @seedphrase (Steward) Fred @fred (Advisor) Kris @krrisis (Advisor) Sid @sidcode (Ops) QZ @fishbiscuit (Ops) Edward @hapob (Designer) Jan @mckennedy (Designer)  All work will be carried out in the open on the MMM Notion page which also serves as a workspace for MMM contributors.  Mandate  Merch Schwag: The MMM-Workstream plans to merge and decentralize the existing Gitcoin Schwag Store by hosting bounties to help facilitate the creation of unique apparel by, and for the community. DAOMart: MMM are building a novel way to incentivise delegation of GTC towards governance by creating a marketplace with exclusive merch drops and NFTs. The DAOmart will host limited runs of fun, limited edition clothing pieces and art objects with a focus on intention & sustainability to promote Public Goods and rep the Gitcoin DAO and its workstreams. The project is currently in development in collaboration with developers the Moonshot Collective. A part of the budget is set aside for the initial merch production as we seek to build up a supplier and artist network that is sustainable, ethical, and carbon neutral. Meanwhile, new forms of merch will be explored that could help supplement the budget of MMM in the future.  Memes The MMM meme factory is here to provide a steady stream of high-end memes and visuals that help explain complex ideas and values of Gitcoin DAO and its Workstreams. We are also creating opportunities for the broader community to get compensated for awesome memes through bounties, contests and events. Meme Museum: The workstream will produce an ever increasing amount of great memes on the topic of public goods, the open internet and the values Gitcoin DAO represents. The Meme Museum is an effort to celebrate these and make them easy for anyone to find and re-use.  Marketing We aim to grow the overall marketing capability of the Gitcoin DAO by providing design and development work, content and product marketing that increase attention and spark engagement both internally and externally. We will collaborate with other workstreams and the broader community in order to drive engagement and value for the greater, public good. Governance Visuals: A set of visuals that explain different parts of Gitcoin DAO, for example the Gitcoin DAO Governance Process, Stewards and to improve general onboarding. We also plan to design header arts and infographics for the other workstreams to live on Discourse and Notion. Steward Report Cards: In order to make informed decisions as a delegate in a liquid democracy it is important to have information on each Stewards readily available. The Steward Report Cards project is an attempt to improve upon this by displaying important metrics, stats and overall “health” of each individual Steward of Gitcoin DAO. The cards will also function as a way for Stewards to track their involvement in the DAO and better track their performance. Memepalooza: We ran our first community collaborative creation event on 31st August in collaboration with Moonshot Collective. The event was a success with meme lords from all parts of the world contributing to over 100 awesome memes. At the end of the event we leveraged the Quadratic Diplomacy tool to reward individuals who stood out in terms of participation and quality of memes. We intend to run monthly Memepaloozas as an event with the broader community to celebrate the creation of memes and bring participants closer together. Twitter: Populate and maintain the Gitcoin DAO Twitter (@GitcoinDAO) with a steady flow of great memes and information from the DAO.  Measuring Success MMM is structured to be an inclusive funnel for designers, meme lords, developers and other creatives as an easy way of being onboarded to Gitcoin DAO. The measuring of success for the MMM Workstream aligns with the ideas brought up in the discussion on What are the KPIs that GitcoinDAO Optimizes for. We strive to deepen coordination and develop interconnectedness by supporting the growth of other Workstreams thru collaboration of design ideas and marketing of their projects. Quantifiable aspects of our work look like: Memes  Twitter analytics for memes posted on the platform such as account following and amount of retweets from prominent accounts. Growing number of community members contributing and producing memes Growing number of returning contributors  Merch  Diversity and quality of artists Qualitative feedback Revenue from merch Sustainably/ethically sourced merch Minimal Carbon footprint  Marketing  Performance marketing Supporting GR grantees: grantees that approach us see a bump in their grants received/ donations Supporting virtual events + hackathons: helping see an overall bump in hackathon participation Participate as a cross-functional group with other projects and DAOs. Network of quality artists, designers, memelords and suppliers New members onboarded through the success squad   Budget Breakdown      *** MMM also received a grant which will be distributed to the contributors of the workstream according to their work done in Q3. There was a delay in using these funds as we have been focusing on establishing our core operational team. All spending of funds will be shared and logged transparently in a public spreadsheet and managed by a public 2 of 3 Gnosis Safe multisig (seen here: 0xC23DA3Ca9300571B9CF43298228353cbb3E1b4c0). The current signers of the multisig are @seedphrase, @fred and @ceresstation. It’s possible that all funds may not be used during this period, these will then be rolled over to the next quarter or be sent back to the treasury. Feedback and comments on this budget are encouraged. Thanks so much! Signed, @seedphrase, @fred, @sidcode, @krrisis,  @fishbiscuit, @hapob, @mckennedy And the rest of the contributors to the MMM workstream! ",
                    "links": [
                        "https://www.notion.so/gitcoin/MMM-Merch-Memes-Market-c1bd89fac8ab4569bf2a676df28025d8",
                        "https://store.gitcoin.co/",
                        "https://github.com/karbafoo/daomart-admin",
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v2-updated/7860/19",
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v2-updated/7860/19",
                        "https://gov.gitcoin.co/t/introducing-stewards-governance/41",
                        "https://ipfs.io/ipfs/QmdxorvFgZeHj1NP1vo5oqEbcJVqfgXkiDNYMScB8hknSB",
                        "https://hackmd.io/@p4jJv-s3QGywtFjheoMIEg/HJXI4GClY",
                        "https://drive.google.com/drive/folders/1ejL-WzR02Yo286kGGmXwSCXwFg4blGVh?usp=sharing",
                        "https://www.youtube.com/watch?v=HPsV5fQxI2k",
                        "https://twitter.com/gitcoindao",
                        "https://gov.gitcoin.co/t/what-are-the-kpis-that-gitcoindao-optimizes-for/8497",
                        "https://ipfs.io/ipfs/QmXxvJgXZKECHcRbEjsWfnm3ZcArp1vaKVqyg6vZtAsyKp",
                        "https://gitcoin.co/grants/2820/mmm-merch-memes-marketing",
                        "https://etherscan.io/address/0xC23DA3Ca9300571B9CF43298228353cbb3E1b4c0",
                        "https://gov.gitcoin.co/t/introducing-steward-report-cards/8712",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-13/8711",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-12/8629",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-15-formerly-week-in-governance/8806",
                        "https://gov.gitcoin.co/t/proposal-mmm-season-13-budget-request/9818",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-14/8758"
                    ],
                    "GPT-summary": "The post is a proposal from the MMM-Workstream requesting a governance reward budget of 28,000 GTC to be deployed for Q4 2021 in service of Gitcoin DAO and its wider community. The proposal outlines the goals of the MMM-Workstream, which is to use Merch, Memes, and Marketing to promote public goods with unique projects that generate curiosity, hype, and engagement around Gitcoin DAO and its core mission. The post also details the breakdown of the budget and the different projects that the MMM-Workstream plans to undertake. The author encourages feedback and comments on the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.904920860389611
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "10",
                    "time": "15/09/2021-14:37:46",
                    "content": "I fully support this stream receiving funding. They have been going through the same things the other streams have over the last few months and their effort has been great. I can’t wait to see what they will get done with the ability to award their contributors! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.675
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/thelostone-mc",
                    "index": "#3",
                    "likes": "4",
                    "time": "17/09/2021-12:32:37",
                    "content": "Would it be possible to get more insight on the deadline for stuff like Steward Report Cards? That way it becomes easier to measure success. Governance Visuals Just out of curiosity,  is there an on-demand basis / is there a list of what would be needed to build out? Would this team also help out other workstreams in their visuals?  Memes  What’s the end goal we are looking for here ? Are we using this as a stepping stone to get more traction to the DAO AKA by providing engagement. Is there a doc that would measure the success of this ? Would it make sense to capture what the target (an actual number) we want to achieve here.  That way if MMM hits that, renewing the proposal becomes a lot easier ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.053571428571428
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/olasquare271",
                    "index": "#4",
                    "likes": "3",
                    "time": "18/09/2021-16:08:53",
                    "content": "So much of enthusiasm in MMM Project, I hope there request should be granted due their feasible way of functionality. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Billionaira",
                    "index": "#5",
                    "likes": "4",
                    "time": "19/09/2021-21:01:13",
                    "content": "Great innovative from the MMM team. The proposal should be granted ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seedphrase",
                    "index": "#8",
                    "likes": "4",
                    "time": "21/09/2021-11:49:35",
                    "content": "Hi! Yes absolutely! Governance Visuals We’ve created five visuals on the governance process that aims to explain the more complex topics outlined in the document. We will expand this educational effort with additional visuals that further explain the Gitcoin DAO structure as a whole. We plan to create visuals that will assist with onboarding new community members and workstream contributors as well as working on ways to help new Stewards get a bird’s eye view of the various tools used in governance, like Discourse, Notion, Discord/Telegram/, Snapshot and Tally. We’re also looking into how to clarify and make the Gitcoin DAO treasury and workstream economics more transparent. MMM is set up to become the Design and marketing arm of Gitcoin DAO, so producing visuals, designs, memes and marketing concepts for the other workstreams is definitely part of our mission. We’ve set up a Request-typeform accessible from our Notion page for anyone in the DAO to request tasks from MMM. MMM and Moonshot Collective have begun working together on various projects and we look forward to growing these cross-workstream collaborations going forward. Steward Report Cards Our team has been in flux this past quarter which stalled the development of the Steward Report Cards. We’ve set up an internal MMM-Development substream with the Moonshot Collective to source developers and work on these Memeshots (MMM x MC).  We aim to have the Steward Report Cards go live on the site by the end of Q3.  Memes In a similar way to the Governance visuals, memes can be a great way of distilling down complex ideas and concepts into quick, easy-to-digest graphics. We do plan to track engagement on social media as outlined in the budget, we also see the memes as tools used internally to strengthen the community and push forward the core values and mission of Gitcoin DAO. For now we don’t have target numbers and feel like we need time to observe the growth of the Gitcoin DAO in order to outline accurate growth metrics. ",
                    "links": [
                        "https://www.notion.so/gitcoin/Merch-Memes-Marketing-c1bd89fac8ab4569bf2a676df28025d8"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.584040404040404
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/hapob",
                    "index": "#9",
                    "likes": "2",
                    "time": "21/09/2021-16:01:41",
                    "content": "Thank you very much everyone  for your support, ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#10",
                    "likes": "5",
                    "time": "29/09/2021-08:32:24",
                    "content": "Absolutely I support MMM workstream. So for creators, and designers, it is a lot of fun in this workstream.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/dexter",
                    "index": "#11",
                    "likes": "4",
                    "time": "29/09/2021-18:00:12",
                    "content": "I’m in full support of this proposal - easing entry into the gitcoin/public goods world is likely to be a big driver of new voices and ideas. MMM is the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.486363636363636
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#12",
                    "likes": "3",
                    "time": "04/10/2021-13:34:55",
                    "content": "Hello, Thank you for your proposal. I have a few asks. As per comments in another budget proposal I will say the same thing here:  Can you use $ amounts along with the GTC amounts? It’s much easier to comprehend and analyze the proposal and especially the budget breakdown if you do this. In the budget breakdown could you do somehow include allocation of man-hours and expected cost per man hour? Essentially what I would like to be able to see is how many people will work on this, for how long and how much are they supposed to be paid.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#13",
                    "likes": "2",
                    "time": "04/10/2021-16:29:59",
                    "content": "Agree with this - the more detail in numbers, the better delegates will feel about supporting and knowing what to expect from the work being put in and how it’s mapped to resource. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#14",
                    "likes": "3",
                    "time": "04/10/2021-16:37:23",
                    "content": "I agree with the proposed budget plan.  Full support for the MMM and thanks for the enjoyable Meme-A-palooza last week!  Very fun. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.44
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wyx",
                    "index": "#15",
                    "likes": "1",
                    "time": "04/10/2021-16:37:28",
                    "content": "Really love the work done on steward report cards- would also love to see whatever features get added. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seedphrase",
                    "index": "#16",
                    "likes": "5",
                    "time": "04/10/2021-17:56:03",
                    "content": "Hi Thanks for your questions  The figures outlined in our budget is based on compensation presented in the other workstream budgets. Contributors of MMM will get compensated in GTC for their work, and as GTC is solely a governance token we cannot present the figures in terms of monetary value. Right now we are accounting for 5-6 part-time roles as substream leads as well as individual contributors (developers, designers, memelords, etc). We believe that the breakdown fairly justifies the funding needed for the projects and operations of the workstream over the next quarter. All activity of the multisig will be accounted for publicly. Tokens in MMM treasury that have not been touched during the timeframe of the budget will either be sent back to the GitcoinDAO treasury or rolled over to the next quarterly budget if passed by governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.530357142857143
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#17",
                    "likes": "5",
                    "time": "05/10/2021-11:30:09",
                    "content": "This proposal has met the requirements to move forward and a snapshot proposal is now live at:  MMM (Merch, Memes & Marketing) Q4 2021 budget request  Please get your votes in before October 9th! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.852272727272727
                }
            ]
        }
    ],
    "group_index": "573"
}