{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/ama-with-me-kevin-owocki/45",
            "title": "AMA with me - Kevin Owocki ",
            "index": 45,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "9",
                    "time": "07/05/2021-01:54:24",
                    "content": "Hi all, I’m one of the team members at the Gitcoin core development company, Kevin Owocki. I was wondering what questions the community has for us.  Feel free to AMA. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Hhhzsss",
                    "index": "#2",
                    "likes": "2",
                    "time": "26/05/2021-03:40:13",
                    "content": "I’m new here so it’s a bit adjusting. Can you make a move quickly understand? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.174242424242424
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Vendittav",
                    "index": "#3",
                    "likes": "0",
                    "time": "27/05/2021-08:17:28",
                    "content": "We will see what happined i want the best wishes for be gitcoin the best ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/quadlands",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/05/2021-09:28:20",
                    "content": "Hi @owocki, Do you have any experience personally or of witnessing others propose to an incumbent organisation that they should become a DAO? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#5",
                    "likes": "1",
                    "time": "27/05/2021-14:33:05",
                    "content": "i do not; but in a way this is similar to whats happening with gitcoin growing gitcoindao now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/zkwaffles",
                    "index": "#6",
                    "likes": "0",
                    "time": "27/05/2021-14:50:48",
                    "content": "Hey @owocki , ccho  great job with the launch, it just might be the most egalitarian and transparent launch of any DAO to date, congrats to you and the team curious about your vision for gitcoindao… more specifically what might the future look like for less experienced (not quite steward level) contributors? working groups? forum discussions and proposals? I’m sure there are a lot of people wanting to pitch in down the road cheers, zk ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.487654320987655
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/quadlands",
                    "index": "#7",
                    "likes": "1",
                    "time": "27/05/2021-14:52:23",
                    "content": "Thanks for your reply @owocki. It will be interesting to see what gitcoindao inspires. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#8",
                    "likes": "5",
                    "time": "28/05/2021-01:34:32",
                    "content": "hi @zkwaffles thanks for stopping by.  curious about your vision for gitcoindao…  basically the idea is for gitcoindao to be a schelling point for the hopeful; for those who want to build a vessel that can go to the quadratic lands - the promised land of digital democracy and public goods being funded. tangibly that means creating a DAO of DAOs - a generator function (a function that generates other functions) that generates projects/DAOs/companies that fund public goods. this is of course new framing of what we’ve been doing for a very long time => $39.8m in Results | Gitcoin . coordinating builders & funders to build/fund the open web.  more specifically what might the future look like for less experienced (not quite steward level) contributors? working groups? forum discussions and proposals? I’m sure there are a lot of people wanting to pitch in down the road the workstreams that i’ve seen proposed from the community      [Workstream] Fraud Detection and Defense Working Group Assemble! Sybil Defenders       It began with a call…   [image]  Gitcoin was under attack…   [image]  With the weapons of knowledge, many from the ecosystem came to defend…   [image]  They built a machine learning algorithm to flag fraud…   [image]  But algorithms must be tuned to serve the needs of the community, else we risk punishing the innocent…   [image]  And now, the Gitcoin Galaxy needs your help to decide friend or foe… the best of machine learning with the social discretion of humans, to restore peace and justice to …         Workstream Suggestion: DeFi Treasury Management Public Goods Funding       Hey Gitcoiners,  I suggest that we put together a Workstream around how to effectively manage the Gitcoin treasury.  Using DeFi protocols we can extend the treasury’s capital and maximize the impact of public goods funding.  We have some heavy hitters of the DeFi space who have stood up to be Stewards so I am confident we can put together a good strategy to effectively tackle this.  This also happens to co-inside with some work we are doing at PleasrDAO.  I think having a strategy in effect in t…         [Workstream] dApp *Prototyping* (the Moonshot Collective) Special Projects       ( Watch the video of the Moonshot Announcement at ETHcc 2021 here - Kevin Owocki : It's all Coordination - YouTube )   Hey hey hey Gitcoin community,  We are Austin Griffith and Kevin Owocki - both BUIDLers and frands from the Colorado ecosystem.  Austin and Kevin have worked together in a few diff capacities in the past.   Austin and Kevin met through the EIP 1337 working group back in 2018, where Austin built the first MVP of EIP 1337 which was later part of an early Gitcoin Grants Prototype. A…         [Workstream] Public Goods Funding and Treasury Management Public Goods Funding       Hey all!  Over the last few years, Gitcoin has been building solutions around how we fund the public goods we care about, most successfully using quadratic funding, a novel mechanism designed by Vitalik, Glen Weyl, and Zoe Hitzig in 2018.  The way this mechanism works is simple, projects in Ethereum can list themselves as public goods in need of funding, and participants can democratically allocate funds from a community managed matching pool by donating some of their own money. By its design, q…         Workstream suggestion: I need a better name for this 🧙 🧙‍♀️ Workstream Discussion       One common thread that I see in all of Gitcoin’s initiatives is a dedication to trying to rally around and create positive-sum games. The original bounties platform sought to create win-win situations between those who needed work and those who wanted to supply it, reducing coordination costs and enhancing ecosystem efficiency. Grants seeks to make giving funds fun, and create a positive-sum game around funding the ecosystem. KERNEL looks at educating from a holistic perspective, and seeks to tr…         [Workstream] Decentralize Gitcoin Progressive Decentralization (Technical)       Hey Gitcoin Community,  Philip Hutchins here to propose a new workstream focused on decentralizing the core Gitcoin platform: the Decentralize Gitcoin Workstream! This post serves as my resume for the lead position and as a means for you to hold me accountable to the high bar you would expect from a workstream this critical to Gitcoin.  Though I am relatively new to Gitcoin, I am definitely not new to open source or the decentralization space. My intro to crypto and decentralization was when I j…     all have different proposals about what types of community members should get involved, so id probably start there to learn about how you can get involved also if u come hang out on the community call tomorrow we can just chill + see what ideas come up there https://twitter.com/gitcoin/status/1397977519895236617 ",
                    "links": [
                        "https://gov.gitcoin.co/t/anti-fraud-collusion-detection-workstream-assemble/158",
                        "https://gov.gitcoin.co/t/workstream-suggestion-defi-treasury-management/204",
                        "https://gov.gitcoin.co/t/workstream-suggestion-public-goods-prototyping/130",
                        "https://youtu.be/KpXPym_m_wA?t=644",
                        "https://twitter.com/austingriffith",
                        "https://twitter.com/owocki",
                        "https://github.com/austintgriffith/token-subscription",
                        "https://gov.gitcoin.co/t/workstream-suggestion-public-goods-funding/129",
                        "https://arxiv.org/abs/1809.06421",
                        "https://gov.gitcoin.co/t/workstream-suggestion-i-need-a-better-name-for-this/972",
                        "https://gov.gitcoin.co/t/workstream-suggestion-decentralize-gitcoin/180",
                        "https://www.linkedin.com/in/philiphutchins/",
                        "https://twitter.com/gitcoin/status/1397977519895236617"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.727215007215007
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/quadlands",
                    "index": "#9",
                    "likes": "0",
                    "time": "28/05/2021-21:01:26",
                    "content": "@owocki Is there a place on this forum for sharing project ideas? Or are we more focused governance here? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#10",
                    "likes": "3",
                    "time": "29/05/2021-04:32:05",
                    "content": "@ceresstation @Yalor wut u guys think?  id love to have a projtect pitches & demos section that @austingriffith and i can rap with ppl on ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lingkaixiao",
                    "index": "#11",
                    "likes": "0",
                    "time": "01/06/2021-03:58:26",
                    "content": "what other functions come out behind,for the better development of blockchain  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#12",
                    "likes": "1",
                    "time": "01/06/2021-13:00:40",
                    "content": "i dont understand the question ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Cryptolord38",
                    "index": "#13",
                    "likes": "1",
                    "time": "09/06/2021-22:30:38",
                    "content": "Seriously looking forward to this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/amishmanish",
                    "index": "#14",
                    "likes": "1",
                    "time": "10/06/2021-12:53:36",
                    "content": "Congrats on what you are doing @owocki. In the long term, what do you think the funding sources for incentivizing Open source development can be? How about some sort of an alumi-donations from projects that get funded by Gitcoin DAO and gain success. Maybe some kind of voluntary equity model from those founders?? (Sorry if this sound more like an idea wrapped in a question, LOL) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.28125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#15",
                    "likes": "1",
                    "time": "10/06/2021-15:46:36",
                    "content": "thats an interesting suggestion. you should perhaps pitch it over on Workstream Suggestion: Public Goods *Prototyping* ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ioannistsil",
                    "index": "#16",
                    "likes": "0",
                    "time": "10/06/2021-15:53:23",
                    "content": "what are the advantages of gitcoin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#17",
                    "likes": "2",
                    "time": "10/06/2021-16:26:27",
                    "content": "earn/learn/connect for software devs in web3 browse around on http://gitcoin.co/ and see for yourself! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "428"
}