{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/add-a-testnet-token-faucet-feature-to-gitcoin/11511",
            "title": "Add a testnet token faucet feature to Gitcoin ",
            "index": 11511,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "sybil",
                "passport",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/thibauld",
                    "index": "#1",
                    "likes": "3",
                    "time": "14/09/2022-15:05:32",
                    "content": "Hi there guys  Today, it’s always a PITA to get testnet tokens (like Goerli ETH). To the degree that, personally, I ended up “buying” (!!) some Goerli ETH to someone who had a bunch… to save time and preserve my mental health  The problem is that faucets are being emptied by bots all the time so faucet providers restrict in extreme ways how many tokens can be withdrawn because, besides a google captcha, they don’t know how to fight bots. This seems like something that’s right in Gitcoin’s alley! We could add a faucet feature to gitcoin to help devs access the most “popular” testnet tokens without having to wait days to amass barely 1 testnet ETH  Basically, the faucet would be “Gitcoin passport protected”. Each passported user could withdraw up to 10 testnet ETH per month for example, immediately, no questions asked  Given the amount of devs on Gitcoin, I think it would be very successful and would on-board many devs on Gitcoin passport. Wdyt? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.628571428571428
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/thibauld",
                    "index": "#2",
                    "likes": "1",
                    "time": "14/09/2022-15:11:52",
                    "content": "[IDEA Update] we could also make the withdraw rule even more efficient to prevent the faucet to be emptied too fast and to benefit the community of GTC holders: “You cannot retrieve more testnet tokens than you have GTC tokens in your wallet, with an upper limit of 100 testnet tokens” That’s only an example that needs to be refined but you get the idea: “The faucet is reserved to the Gitcoin community. All you need is to be passported and hold some GTC” Less open but totally fair imho. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/castall",
                    "index": "#3",
                    "likes": "1",
                    "time": "24/10/2022-02:29:03",
                    "content": "Unitap exists for this purpose. They are also open to faucets that are gated by holding certain tokens–so we could ask for a faucet specifically for the Gitcoin community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                }
            ]
        }
    ],
    "group_index": "201"
}