{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/help-needed-for-getting-our-climate-solutions-project-through-fdd/10990",
            "title": "Help needed for getting our 'Climate Solutions' project through FDD ",
            "index": 10990,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "FDD"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/tze42",
                    "index": "#1",
                    "likes": "0",
                    "time": "22/06/2022-12:31:29",
                    "content": "Hi everyone, first I would like to say that the work Gitcoin does for the space is absolutely awesome and I think that many projects wouldn’t exist without it.  Unfortunately, we are currently struggling to get the “7Energy - Energy Communities without Banks” through the FDD process. It is, despite all explanations I provided via email and through the appeal process, rejected. The reasons given are:  It has a project token: This isn’t correct. It uses ofc tokens within the DAO to be and stay decentralized. It also uses 3rd party stablecoins to arrange the P2P payment for energy exchange between the DAO members. It isn’t a public good (non-exclusive, non-rivalrous): Again this isn’t correct. The code is open source and available on Github. The text on website and documentation is also open source. Everyone can join or leave the DAO or take the code and start a new one. The DAO is unter control of the lab10 collective: Again, not correct, because the lab10 collective only pays for server and domain bills and this is a good thing, because otherwise the project wouldn’t be existing.     7Energy - Energy Communities without Banks | Grants    7Energy - Energy Communities without Banks | Grants Energy communities are quickly becoming the resilient backbone of the renewable energy transition away from fossil fuels and they are one of the real life blockchain applications many are waiting for.   We have developed a proof-of-concept for an...       Github: GitHub - d10r/7energy-contracts: EVM smart contracts eines einfachen Abrechnungssystems für Energiegemeinschaften Website: https://7energy.at DAO Access (atm on Kovan for testing): https://dao.7energy.at I don’t know what the specific task of the FDD process is, but by name, I would assume it is sybil detection and obvious non-compliance to be a public good project. Now that #GR14 is almost over, I’m more than unhappy that we had so far such an ordeal to go through and it really hurts to see Climate Solutions projects like ours being rejected. It is really hard to connect real world use cases like energy communities with blockchain applications and this project is the result of many years being in the space and knowing the energy regulation very well. Some of you with a similar experience for sure know what I’m talking about. I don’t know if it is the process or the person looking at our project, but it looks as if the FDD process should be revised, to avoid the rejection of fully eligible projects in the future. The process is also very bumpy and it would be so much easier to have just a ticketing system with the option of a personal conversation to clarify misunderstandings steming from writing. Currently projects also need to monitor the status, there is no notification and the rejection is the first thing you get then as email. PS: We talked about the project at ETHPrague - in case you are interested to watch it. Energy communities building a Solarpunk future: Thomas Zeinzinger, Peter Grassberger - Energy communities building a Solarpunk future - YouTube Best, Thomas @griff @auryn @owocki ",
                    "links": [
                        "https://gitcoin.co/grants/6239/7energy-energy-communities-without-banks",
                        "https://github.com/d10r/7energy-contracts",
                        "https://7energy.at",
                        "https://dao.7energy.at",
                        "https://youtu.be/UtBtGACPv1E"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9726116686343955
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/abitrolly",
                    "index": "#2",
                    "likes": "1",
                    "time": "23/06/2022-14:34:43",
                    "content": "Hi @tze42. If the project was approved, I would have a lot of questions. From you post above, I get that there is some formal unfairness about your project, but I don’t get what your real project is about, because its landing page is all in German https://7energy.at/ You say that the code is open source and provide the link GitHub - d10r/7energy-contracts: EVM smart contracts eines einfachen Abrechnungssystems für Energiegemeinschaften but the link is absent from the main website of the project. The GitHub also doesn’t backlink to the website, so there is no public evidence that these are related. You say that the lab10 just pays for the server and don’t own anything, and that contradicts with their copyright in the website footer. I don’t want to say that there is anything bad going on. Just that these things alone, without analysis of your blockchain economy proposal with oracle resistance to tampering etc. are  very suspicious for a good project. ",
                    "links": [
                        "https://github.com/d10r/7energy-contracts"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.575396825396826
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "1",
                    "time": "23/06/2022-19:35:14",
                    "content": "These things absolutely are the reasons as are outlined on the public page where the discussion has taken place. Gitcoin Appeals The grant was turned on yesterday due to the climate round owner allowing projects which are not open source AND the finding that the original review citing a token were not correct. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.208333333333334
                }
            ]
        }
    ],
    "group_index": "143"
}