{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/akita-sale-stream-implementation-make-it-a-scheduled-liquidity-pool/4717",
            "title": "Akita Sale/Stream implementation: make it a scheduled liquidity pool! ",
            "index": 4717,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/AvsA",
                    "index": "#1",
                    "likes": "11",
                    "time": "02/06/2021-15:00:24",
                    "content": "This proposal came too late to be one of the options in the Akita, a path forward poll, which at the moment is leading with “Sell 10%, stream 90%” and “Liquidate 100%” so I will propose it as a further discussion on the merits of how to implement it. This was posted on June 1st as a twitter thread and gathered some positive feedback from many of the community representatives.  The issue with the two main proposals   There’s not enough market depth to liquidate all Akita tokens without losing a lot of value for Gitcoin. Even if there are serious doubts about the long term viability of the Akita community, we have a responsibility to maximize the value gained for Gitcoin.   Locking Akita on Sablier doesn’t put that capital to good use, and if the market crashes and recovers and crashes again during before the stream is over, then there was a missed opportunity.    The Proposed Implementation   Sell 10% of Akita in any exchange, put it in the Gitcoin treasury   Sell yet another 10% into ETH.   Create a Scheduled Balancer pool with the 10% ETH obtained in step 2 and all the remaining Akita.   Set up the pool controller to programmatically change the ratio over a period P so that it inverts from a 10% ETH 90% AKITA into a 90% ETH and 10% AKITA   Those types of pools are usually called Liquidity Bootstrapping Pools and are often used to launch new tokens that don’t have liquidity. In this case, the token has launched but it would still bootstrap the liquidity. You can read more about LBPs on this article about Radicle.  The end result is that:   At the end of the period, Gitcoin will have sold most of their Akita, at a fairer market price, similarly to a Dollar Cost Averaging strategy   Akita community gets a much more liquid market, a “billion” dollars deep (emphasis on the air quotes). This will reduce the impact any single seller can have on the final price.   All trades that are executed against this pool will earn fees for Gitcoin, so in periods of high volatility Gitcoin is leveraging its massive Akita Holdings to generate Yield   There will be a constant sell pressure on Akita, but it’s one that is scheduled and known    Variants and Risks Balancer Pools are quite flexible and we could do other options like having a pool that starts at 91% Akita, 3% GTC, 3% ETH and 3% DAI. Or we could add all the dog tokens into a big billion dollar pile of dog poo money. Pools also don’t necessarily need to be locked: we can add a smart controller so that Gitcoin DAO can accelerate the schedule at a later vote, or simply change it completely and use the Pie DAO so that ratios can be changed at the will of GTC holders. Also, at any point, Gitcoin could vote to take the liquidity out of its own pool and receive it in either token of the pool. It’s also important to note that LBPs are different than just selling a token: the pool wants to keep a constant ratio at all times to reach its target, be it 10%, 25% or 90%. So it means that the pool will both sell and buy akita for ETH to keep the target ratio–that’s how AMMs work. A LBP changes that target ratio slowly over time, but it also is reacting to the market in real time. It means that, if akita drops to near 0, then the pool will automatically be buying akita with ETH until it reaches the desired balance, so almost ETH would be drained from the pool. But that ETH came from the Akita sale in the step 2, and the end result would be the same if the strategy was to stream or liquidate it anyway. On the other hand, if the market goes up again, that will mean the pool will start selling the cheap akita it bought back to ETH (plus the fees it got during the period) which is why pools make money from volatility. Disclaimer: I work for Balancer labs, but if the community wants to they can use other solutions. Balancer also has a “LBP referral program” but I am perfectly willing to either not claim it or to donate the BAL gained to Gitcoin.  Period P This proposal leaves the P period open. The ending date of this poll is after the resolution of the “Akita - a path forward” poll so votes should take this in consideration.   Long stream: a LBP of duration of 2 years   Intermediary: make the LBP last 1 year   Liquidation: a short LBP over 1 week   LBP in another platform or other configuration   No LBP: just use sablier or dump it all in uniswap, depending on the results   ",
                    "links": [
                        "https://medium.com/balancer-protocol/radicles-new-record-lbp-sale-shows-that-lbps-are-here-to-stay-4c81e15a4d4d"
                    ],
                    "GPT-summary": "The author proposes a new implementation for the Akita Sale/Stream, which involves creating a scheduled liquidity pool. The proposal aims to maximize the value gained for Gitcoin while also providing a more liquid market for the Akita community. The post includes details on the proposed implementation, variants, and risks. The proposal received positive feedback from many community representatives, and the author leaves the period P open for further discussion. The post also includes a disclaimer that the author works for Balancer labs, but other solutions can be used.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.396666004063963
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/06/2021-15:29:01",
                    "content": "Thanks for writing this up @AvsA! By the way, if you haven’t signed up already we’d love to have you formally as a steward      Introducing Stewards Governance 🤖 Meta-Governance       Over the last two rounds of Gitcoin Grants, we’ve brought in a number of grantees and contributors in the community to help us think about how to better fund digital public goods and serve the web3 community, whether by stopping sybil attacks, improving grants discoverability, or more precisely defining the kinds of public goods that can be funded.  Through those conversations, we’ve learned a lot about what we’re doing well, and what we could improve on. One comment that came up frequently was …     @HelloShreyas @androolloyd curious to get your thoughts on how these would intersect with your proposals! ",
                    "links": [
                        "https://gitcoin.co/blog/gitcoin-grants-round-8-governance-brief/",
                        "https://gitcoin.co/blog/gitcoin-grants-round-9-governance-brief/",
                        "https://en.wikipedia.org/wiki/Sybil_attack",
                        "https://en.wikipedia.org/wiki/Public_good_(economics)"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.965909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#3",
                    "likes": "3",
                    "time": "02/06/2021-15:47:43",
                    "content": "Shared my thoughts on Twitter https://twitter.com/ljxie/status/1400116505581428743  I like this approach a lot more than just liquidating or burning all of the tokens. It’s up there for me along with @HelloShreyas’ proposal. Definitely think it’s worth putting into a formal proposal  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#4",
                    "likes": "2",
                    "time": "02/06/2021-16:20:22",
                    "content": "I also like this proposal a lot. It is a more concrete plan on how we can sell 100% in a constructive way. With such an implementation I am also inclined to go for the sell 100% with the period being up for discussion.   twitter.com    Lefteris Karapetsas | Hiring for @rotkiapp @LefterisJP    @avsa @HelloShreyas @ljxie @owocki @austingriffith @hudsonjameson @androolloyd @AndreCronjeTech As mentioned earlier today, after some back&forth I also like this proposal a lot. It is a more concrete plan on how we can sell 100% in a constructive way. With such an implementation I am also inclined to go for the sell 100% with the period being up for discussion.       Alex Van de Sande (avsa.eth) @avsa  But even if gitcoin wanted to sell it there’s no liquidity for it. They’d need to sell it slowly, something preprogrammed, something that increases the liquidity of the token.   Shit I figured it out: they need an LBP!    5:55 PM - 1 Jun 2021           1            ",
                    "links": [
                        "https://twitter.com/LefterisJP/status/1400124946127462400",
                        "https://twitter.com/LefterisJP/status/1400124946127462400",
                        "https://twitter.com/avsa/status/1399887361518018563",
                        "https://twitter.com/LefterisJP/status/1400124946127462400"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Mantarochen",
                    "index": "#5",
                    "likes": "4",
                    "time": "02/06/2021-17:42:09",
                    "content": "Here my reply from Twitter: This approach would cause Akita to literally gain no more price increases until Gitcoins entire Akita amount is gone. It would make Akita almost a stablecoin until day X. As soon as all investors find out about this, they will leave the token instantly and dump the price right away. Beside the fact that this approach would still severely damage the investment of 46,000+ holders who are not willing to start Daytrading EVEN if this idea worked… It would obviously dump Gitcoins Akitatokens as well instantly. TL;DR it would not work anyways. The news would spread fast. The entire community already knows about Gitcoin and the current process of finalizing a decision. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.055357142857143
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Klemah",
                    "index": "#6",
                    "likes": "13",
                    "time": "02/06/2021-18:51:06",
                    "content": "Hello! I am the lead dev for the AKITA community. I’d like to speak on behalf of my dear colleagues and all the members of our community who put their trust in us.     AvsA:  Locking Akita on Sablier doesn’t put that capital to good use, and if the market crashes and recovers and crashes again during before the stream is over, then there was a missed opportunity.   I could not disagree with this more. You seem to completely forget about the fact that the market could also go up, increasing Gitcoin’s gains significantly. AKITA has seen a big increase in price (20x +) twice in just five months. We are working hard on releasing products for AKITA, which are expected to go live at the beginning of July. I expect those releases to increase the price of AKITA again over the next months and years. Although the sablier proposal is not the one we wanted originally and we still think other options are better (like Relic’s proposal or Vitalik’s original proposal), we are ready to accept a compromise there. The reason why is because the sablier option does not kill our project. Unless I misunderstood something - the scheduled balancer would kill AKITA. Just like @Mantarochen explained in his answer above, people will start selling as soon as news of this becomes public. This is bad for AKITA - for obvious reasons. It might seem like a meme coin to you, but to us, it’s a family of 45,000 holders.  It has been our lives for the past few months. This proposal would hurt all holders, many of whom would lose all their investments. We never asked to be a part of this and would like to seek a more peaceful solution. This is also bad for Gitcoin - I understand your goal is to try to take as much money from our project as possible. I do not like it one bit - no point pretending I do. We find it extremely unfair. SHIB’s tokens were burned - why not ours? I can however put myself in your shoes, and I do not understand why you would go ahead with this proposal. You would get a moderate sum of money from the initial sell - just like with @HelloShreyas’s proposal - but contrary to his proposal, yours just will not bring any money to Gitcoin whatsoever after that initial sell.  Let me elaborate on this last point. In the AKITA community, we have a pledge of trust, honesty and openness. We are open about everything we do, and always let the community know about where we are going. This means we will be honest with the community about the future of the coin. After a proposal is decided on, we will be issuing an official announcement in all our groups, letting people know about the decision that was made. Try to put yourself in an AKITA holder’s shoes. He or she will read something like this: If AKITA’s value increases, a whale will automatically sell until it gets back to its old price. However, if AKITA’s value decreases, the whale will certainly not buy to get it back to its old price. How could an investor not sell after reading this? This is a stablecoin but without the benefits of stability. It will just never increase in value. AKITA investors will dump massively if such a proposal were to pass. It would kill the AKITA project. The team is strong, and I trust we would be able to move on to another project together. What worries me more is the 45,000 holders of our token who would lose a lot of their money for some and all of their money for most. It would not give much money to Gitcoin either. I bet your scheduled liquidity pool will wait a long time with its trillions of AKITA tokens, waiting for the token, now dead, to go back up in value, which it never will.  I sincerely hope you will consider the concern I share with this message. This concern is shared by the whole AKITA team. The AKITA community supports @HelloShreyas’s proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5510673966556325
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Velucxa",
                    "index": "#7",
                    "likes": "0",
                    "time": "04/06/2021-09:00:11",
                    "content": "This thread special for Akita Inu or other Akita? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.580357142857143
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#8",
                    "likes": "0",
                    "time": "07/06/2021-00:30:46",
                    "content": "Now that we have a final decision to sell all of the AKITA the community holds, @AvsA I’d like to ask that you and @androolloyd try to take some time to put together the details of how the LBP will work. Similar to what was mentioned on Twitter, I think a buyback program is the most sensible way to frame this, and with that framing in mind I think we should consider offering some good faith measures in how we sell such that price isn’t crushed and True Akita Believers TM can participate in taking the project to where the core team ostensibly wants it to be. Some options:   Let Akita supply liquidity to the LBP and we will give them equivalent tokens to double what they provide in good faith (facilitates selling)   Set a discount to market such that participants who help us help themselves   Offer some kind of intangible olive branch to any devs in their community to get involved in and educated on Ethereum cc @austingriffith   Would love to hear any thoughts / feedback on whether these could be part of how participation in the LBP works! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/FABSCO",
                    "index": "#9",
                    "likes": "0",
                    "time": "07/06/2021-09:17:54",
                    "content": "AGRRED, 100%. Whatever i get free , i should use it for for the betterment of those people who are the owner. not to destroy them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/AvsA",
                    "index": "#10",
                    "likes": "0",
                    "time": "09/06/2021-12:59:15",
                    "content": "    Klemah:  If AKITA’s value increases, a whale will automatically sell until it gets back to its old price. However, if AKITA’s value decreases, the whale will certainly not buy to get it back to its old price.   Just wanted to reply to @klemah’s point here: this is the opposite of how a pool works. If the pool 90:10 pool has 1 million dollars in ether and 9 million in Akita, it means that if Akita starts going down, the pool will start buying Akita until the equilibrium is back at 9:1. In other words, a pool that has 1 million in the other token is one that is willing to use all that money to buy Akita as it drops down, and if Akita goes to 0 then so will the ether side. That’s the main difference between a smart pool and a stream: the latter only sells, while the former sells and buys. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.047852474323062
                }
            ]
        }
    ],
    "group_index": "437"
}