{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-implementation-of-a-decentralized-bounty-platform-progressive-decentralization-workstream/9292",
            "title": "[Proposal] Implementation of a Decentralized Bounty Platform - Progressive Decentralization Workstream ",
            "index": 9292,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/ethanl",
                    "index": "#1",
                    "likes": "8",
                    "time": "02/12/2021-06:30:53",
                    "content": " Decentralized Bounty Platform Proposal to Gitcoin Bounty boards are centralized repositories of discrete tasks with an associated price tag for each job. De-bounty Platform (DB) is an interface to monitor the off-chain development progress of freelancers, and react to pre-set milestones with on-chain logic set by bounty providers. Bounties will be automatically delivered via a smart-escrow.  Abstract & Motivation Bounty boards have the potential to become the de facto form of labor organization in the cryptosphere by creating open labor markets. This is as DAOs are proliferating at an unprecedented rate and are able to derive high value from bounty boards: Opposed to hiring, DAOs typically utilize bounties to incentivize the community to complete various tasks in the form of tech development, design, PR content, metaverse building, etc. DAOs require platforms to manage these bounty interactions to help build trust between two, previously unfamiliar, people/entities. This proposal outlines a plan for Gitcoin to implement a decentralized bounty platform parallel to their existing bounty platform. This “de-bounty” platform (DB) will utilize Gitcoin bounty platform’s frontend and EthSign Smart Agreement’s backend to automatically fulfill the agreement outlined in bounties in a trustless manner. The intention of this proposal is to provide freelancers and bounty issuers with a decentralized means of issuing job bounties and automating compensation once the job is complete —opposed to Gitcoin’s existing centralized workflow. The reduction of potential bias from centralized entities —repo owners & maintainers— via pre-set job terms and smart escrow enables freelancers and bounty issuers to enjoy more frictionless, trustless interactions. This proposal is in-line with the directives outlined in the following Progressive Decentralization governance workstream. DB Features Include:  Decentralized escrow service of bounty rewards Automated payment execution triggered by API Project milestones management dashboard On-chain records that provide a solid foundation for an identity verification & credit system Diverse bounty categories (technical development, operational tasks, DAO-related etc.)   De-Bounty Platform (DB) Specifications See Gitcoin Proposal: De-Bounty Platform Specifications for details on DB’s workflow and features.  Road Map For this Development Phase 1 - 1.5 months, 4000 GTC Functionality  Front End  DID Integration (Torus, Metamask, etc) Project Management Dashboard IPFS + Arweave website Adapt Gitcoin front-end and UX to accommodate interaction with smart-escrow   Back End  Integrate Ethsign Smart Agreement Credit score for users based on on-chain record    Phase 2 - 1.5 months, 2000 GTC  User testing using Gitcoin DAO’s and EthSign’s communities Creation of Moderator DAO to be a jury-based dispute resolution system  Additional Features:  Multi-user claiming from the same bounty Integration of Discord Bot Plugin, a plug-and-play bot that facilitates issuer-freelancer communication, and allows for bounty creation, editing, listing, claiming, removal within Discord communities. Users are linked to their respective bounty URL to manage the bounty.   Drawbacks The largest drawback of DB is the issue of resolving disputes as bounty issuers must close the job repo determining whether the pre-set job term was met; this is especially true for complicated or non-binary jobs. DB includes a Moderator DAO to act as a jury-based dispute resolution system. Additionally, DB will assign credit scores, based on past job interactions pulled from on-chain records, to both bounty issuers and freelancers to discourage bad actors.  Implementation  Budget & Timeline: 6000 GTC from Gitcoin DAO. Use of funds: 2 contracted frontend developers and 1 smart contract developer over 3 months to integrate Gitcoin’s frontend with EthSign Smart Agreement’s existing backend, and to test the platform. Requests from Gitcoin: Access to code and design assets pertaining to Gitcoin bounty platform’s frontend to create a Gitcoin-EthSign co-branded frontend. Assistance in creating and distributing PR materials relating to overviewing DB. Access to Gitcoin’s DAO community for user testing.  Voting Yes - I agree to the above proposal to implement a decentralized bounty platform parallel to Gitcoin’s existing bounty platform interface that monitor’s the off-chain development progress of freelancers and reacts to a pre-set milestones with on-chain logic set by bounty providers. This proposal will be executed by EthSign’s development team, and funded according to the “Budget and Timeline” above. No - I disagree to the above proposal and do not support the implementation of a decentralized bounty platform. ",
                    "links": [
                        "https://www.notion.so/0465799913564578aa627e13e9e7221e",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-23/9370",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24/9446",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-1-2022/9683"
                    ],
                    "GPT-summary": "The post is a proposal for the implementation of a decentralized bounty platform parallel to Gitcoin's existing bounty platform. The proposal outlines the features of the platform, the roadmap for development, and the budget and timeline for implementation. The post explains the motivation behind the proposal and how it aligns with the directives of the Progressive Decentralization governance workstream. The post also mentions the drawbacks of the proposed platform and how they will be addressed. The post does not advertise the proposal explicitly, but it does request access to Gitcoin's DAO community for user testing.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.235014005602241
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Xin",
                    "index": "#2",
                    "likes": "5",
                    "time": "02/12/2021-17:33:23",
                    "content": "Hi there, this is Xin, founder of EthSign. We are building operating system for DAOs, bounty board is one of the most important part in DAO toolkits. Onchain escrow contract eliminate security concerns, which will be a big help in scaling Gitcoin bounty board, make it to be a common good that adopted by other projects and DAOs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.979166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pfed-prog",
                    "index": "#3",
                    "likes": "5",
                    "time": "02/12/2021-17:40:07",
                    "content": "Personally, I have encountered bounties which are impossible to accomplish. The goal of the issuer is to say that the final product is not completed, hence, you will not receive a payment at all. I think establishing milestones would help to some extent, especially for organizations with low-med reputation. But, yes from a position of a developer that has received bounties from Ceramic, Badger, Parsiq and Reflexer, I am for this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/php",
                    "index": "#4",
                    "likes": "2",
                    "time": "02/12/2021-22:09:55",
                    "content": "Hi, The idea is great and the design is feasible. Will you also be able to provide some document link of EthSign backend, or some details about the contracted developers?  So the roadmap details can be easier to understand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#5",
                    "likes": "4",
                    "time": "03/12/2021-02:19:38",
                    "content": "Hey all! Connor from Gitcoin Core here. Quick disclaimer and for context: I’ve been part of a few discussions between Gitcoin and EthSign, the first back before GitcoinDAO was launched. Initially we spoke about using their Web3 enabled agreement signing product, and that evolved into discussions around how their tooling could be used to build a decentralized bounties platform. While we have not partnered together yet on anything officially, I’ve watched the EthSign team and platform grow significantly over the past year. Gitcoin’s first product launched in 2017 was bounties, and it remains a core part of the platform (+ backbone of hackathons and virtual events). The DAO is primarily focused on Gitcoin Grants, and I believe most of us agree the top priority is launching a permissionless decentralized quadratic funding platform, and turning cGrants into dGrants. I think the same should be done for cBounties to dBounties, but currently our teams and workstreams don’t have the bandwidth to focus on it yet. With the explosion of DAOs, there is a great opportunity for the first (or best) open and decentralized bounty protocol to get widely adopted. Something that can integrate with Discord, gov forms, snapshot/tally, etc. With trustless escrow, verifiable milestones, arbitration, little to no fees. The current Gitcoin bounty platform is a bit outdated and sluggish, but the brand name and community are powerful. I believe this will take some time and warrants more discussion and fine-tuning, but if the DAO thinks it’s worth funding, I’d love to see what the EthSign team can build in collaboration with Gitcoin. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.024166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#6",
                    "likes": "3",
                    "time": "03/12/2021-02:50:51",
                    "content": "you’re right. The goal for this proposal is to split huge bounty to small ones, and submission with payment step by step. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.726190476190476
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#7",
                    "likes": "3",
                    "time": "03/12/2021-03:21:20",
                    "content": "    ethanl:  This “de-bounty” platform (DB) will utilize Gitcoin bounty platform’s frontend and EthSign Smart Agreement’s backend to automatically fulfill the agreement outlined in bounties in a trustless manner.   thanks for the proposal. i appreciate the thought in the system design. Gitcoin used to use the bounties.network protocol in a similar approach, but ultimately abandoned the flow as the gas fees and legitimacy of simply have funds in escrow were highly discouraging. funders could remove funds the same way they can today. i wonder if you have considered how to combat this? ie, which L2 you would propose?     ethanl:  opposed to Gitcoin’s existing centralized workflow   you also mention that this approach would offer a decentralized alternative, do you have any other organizations that are interested in using this beyond Gitcoin? Any thoughts yet of audits and review of the smart contracts escrow setup? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.456785714285715
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jxu",
                    "index": "#8",
                    "likes": "3",
                    "time": "05/12/2021-08:23:26",
                    "content": "Hey, I’m Jack, the co-founder and tech lead of EthSign.  funders could remove funds the same way they can today. i wonder if you have considered how to combat this?  If we are referring to the funders being able to withdraw funds, we have a system in place where withdraws by the funder before the job deadline requires explicit authorization from the freelancer in the form of an ECDSA signature, which can be transmitted off-chain.  gas fees  We can be present on any L2 network with Chainlink presence. We are also able to function on L2s without Chainlink but that would take away the automated execution (will require manual triggers) and off-chain data acquisition capabilities. On a second thought, we can also pivot to Gelato if necessary but that will require some rewrites.  do you have any other organizations that are interested in using this beyond Gitcoin?  We are working on integrating both our smart agreement product (what’s said here) and our PDF signing product with a few finance platforms and DAOs.  Any thoughts yet of audits and review of the smart contracts escrow setup?  Yes, an audit is most definitely required, especially when we deal with money. However, we would like to request an audit after we can get a preliminary code-lock as any change in code requires a new audit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.663311688311689
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jxu",
                    "index": "#9",
                    "likes": "2",
                    "time": "05/12/2021-08:27:15",
                    "content": "This is correct, we are able to accommodate staged (for the lack of a better term) data sources and payouts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jxu",
                    "index": "#10",
                    "likes": "0",
                    "time": "05/12/2021-08:29:06",
                    "content": "We have some basic documentation here (sorry, can’t send links): https://docs.ethsign.xyz/about-ethsign-smart-agreement/introduction It’s by no means complete but should provide a decent overview. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.708333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Xin",
                    "index": "#11",
                    "likes": "2",
                    "time": "05/12/2021-18:44:52",
                    "content": "Technical walkthrough for EthSign Smart Agreement: DocSend ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                }
            ]
        }
    ],
    "group_index": "616"
}