{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/how-might-we-decentralize-gitcoin-grants-discovery/6874",
            "title": "How might we decentralize Gitcoin Grants Discovery? ",
            "index": 6874,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "7",
                    "time": "18/06/2021-19:44:52",
                    "content": "hey all, we recently discovered that the projects that are more highly visible on gitcoin grants are more likely to be funded. because of that, im trying to figure out how to enable more discoverability on gitcoin grants for great projects.  what we are doing so far.  sorting algorithms right now the grants explorer  has the following sort options:  Screen Shot 2021-06-18 at 1.39.15 PM628×848 43.8 KB   collections and we’ve also launched collections which are basically a way for anyone to sort their favorite projects + enable easy browsing of them  Screen Shot 2021-06-18 at 1.40.42 PM1826×1246 332 KB   what could we do in the future? in the future, it is envisioned that gitcoin grants will be completely decentralized and as part of that @ phutchins @ceresstation and others are considering what type of ways we can solicit community input on which grants should be highly visible on the site. i’ve started a twitter thread to facilitate discussion on these ideas, but I wanted to open up a post about this on the governance forums so that we can design together. open to suggestions.  if you have an idea, post it below! ",
                    "links": [
                        "https://gitcoin.co/grants/explorer/",
                        "https://gitcoin.co/grants/explorer/collections",
                        "https://gov.gitcoin.co/t/workstream-suggestion-decentralize-gitcoin/180",
                        "https://gov.gitcoin.co/u/phutchins",
                        "https://twitter.com/owocki/status/1405512789444071428"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.121957671957672
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "2",
                    "time": "18/06/2021-19:46:04",
                    "content": "one way we might do this without building any new product (eg in GR10) is if you all tell me which COLLECTIONS of grant should be featured. this is something the core team has historically (eg before the DAO launched) done, and i truly think the stewards should have the privilege of doing it from here on out (these are the collections (💰$700k Match LIVE!) Grants | Gitcoin? ) if you are a steward, and feel strongly that a specific collection should be featured pls LMK. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.740151515151515
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/martz",
                    "index": "#4",
                    "likes": "0",
                    "time": "18/06/2021-20:39:01",
                    "content": "   Women in Blockchain    Women in Blockchain All grants related to women's initiatives.      ",
                    "links": [
                        "https://gitcoin.co/grants/explorer/collections?collection_id=1218"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Spugpow",
                    "index": "#7",
                    "likes": "1",
                    "time": "22/06/2021-07:45:49",
                    "content": "I mentioned it in the Twitter thread, but I’ll post here for visibility: I think it would be good to see what collections a project is part of on the project page itself, ordered by the collections’ popularity. That way a user can see that a decentralized ID is part of a collection with other IDs for example, and they can click through to the collection to find other projects they might be interested in. Basically, make collections discoverable from grants as much as grants are discoverable from collections. It would also be nice if projects could self-organize by adding tags to categorize themselves. Then users could click on the tags to see what other projects had put themselves in the same category, or find similar projects by putting tags in the search bar. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.763888888888888
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Spugpow",
                    "index": "#8",
                    "likes": "2",
                    "time": "22/06/2021-08:16:32",
                    "content": "It would be cool to adopt this suggestion, and make collections themselves the recipients of quadratic matching. Then you could surface collections using the same algorithms you use for projects. ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-1/7424"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/markop",
                    "index": "#9",
                    "likes": "1",
                    "time": "24/06/2021-16:58:54",
                    "content": "Looking from the user perspective I believe that Gitcoin offers plenty of ways for them to search, filter, and find the grants they want to fund. I agree that a lot of times great grants get buried down the list but whatever we do to bring them up we are the ones enforcing that, thus making other grants come into their place (there’s always gonna be someone at the bottom). This is a usability and UX research topic and something that need to be worked on deeply understanding existing user profiles and their interactions on the site in order to provide simple solutions targeting their specific needs and solving the bigger problem. Personally, I just take an hour or two and simply go throug  e v e r y   s i n g l e    g r a n t  and decide which ones to add to cart. But my path, intentions and motivations are not the same as to others. Therefore, I suggest doing more research and tracking site metrics, looking for dropoffs, and finding ways maybe through browsing the site to encourage further discovery (suggestions, similar grants, people who viewed also viewed etc. / just thinking out loud). I didn’t offer an explicit solution but hope this helped a bit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.406481481481481
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Alunara",
                    "index": "#10",
                    "likes": "1",
                    "time": "27/06/2021-00:05:57",
                    "content": "As a developer I like the sorting algorithms, but they’re a bit nerdy and I suspect >95% of the users don’t see them or don’t care too much about them. Even if people do see and use them they might not know what is best and they’ll probably try different ones at random. The collections are also a great idea, but one of the downsides to them is that if I for example have a grant I’m basically begging the popular folks to include my grant in their collection. You’ll be highly dependent on your existing social networking skills, and as a developer that is not to great at pitching himself it’s extremely difficult to get a proper footing. This is also why I started out with Grandiose, where my goal is to make finding grants fun without relying too much on social networking skills or possible biased algorithms. Instead, I’d prefer to explore grants while doing fun little games that don’t rely on different ordering or networking. I’m currently taking a small break playing World of Warcraft, and this game also makes the most mundane and borings tasks fun. With Grandiose I aim to do the same, by making exploration fun and non-biased without the user having to think about anything at all. I’ve started out with a Tinder like system of swiping and aim to re-implement collections as I think there’s much more to them than simply being shared with others. Other things we could try to ‘gamify’ exploration is by introducing mini-games such as memory or other games that allow grants the opportunity to be seen without some kind of ranking or sorting algorithm. Another venture would be multiplayer kind of games with leaderboards, but we’ll have to be wary that it doesn’t simply become a popularity contest again but with extra steps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6103571428571435
                }
            ]
        }
    ],
    "group_index": "490"
}