{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/messari-governor-note-decentralizing-gitcoin/11776",
            "title": "Messari Governor Note: Decentralizing Gitcoin ",
            "index": 11776,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/joel.miya",
                    "index": "#1",
                    "likes": "9",
                    "time": "28/10/2022-14:15:28",
                    "content": "gm Gitcoin Community! I’m an analyst on the Messari Governor team, and we’ve been covering Gitcoin governance as part of our daily workflow since Messari Governor launched about a year ago. Due to the level of engagement and thoughtful discussion happening on the GR16 Structure proposal forum post, I decided to write an analysis on this proposal and Gitcoin’s transition to a decentralized protocol. I really enjoyed writing about the intricacies of this proposal and learning more about how Gitcoin plans to become a decentralized protocol. In the spirit of public goods, Messari has unlocked my analysis from behind the paywall and made it FREE for everyone to read! Check out the full analysis here: Governor Note: Decentralizing Gitcoin. Enjoy! Teaser I hope you enjoy reading the full article on Messari, but if don’t want to make the click, here’s a quick teaser of the first part of the article: Governor Note: Decentralizing Gitcoin Key Insights  The GR16 Structure proposal stems from the Gitcoin DAO contributors’ overwhelming workload. Contributor workload needs to be reduced to successfully launch the Gitcoin Protocol in early 2023. Previous Gitcoin grantees are allowed to re-apply and raise additional quadratic grant funding. Notably, 141 previous grantees have raised over $5,000 in multiple rounds. Since March 2022, the Gitcoin Grants Program has been slowly decentralizing by introducing future Gitcoin Protocol modules.  Introduction Gitcoin is transitioning from a centralized grants (c-grants) program to a decentralized grants protocol, Gitcoin Grants 2.0. This transition was first announced on the Gitcoin Forum on Mar. 1, 2022, and Gitcoin began to implement and test various grants 2.0 modules in Grant Round (GR) 13. Gitcoin aims to transition the centralized monolith grants 1.0 program into a forkable, modular decentralized protocol, which aligns with Gitcoin’s values of building open-source public goods for the benefit of the broader Web3 community. To date, the grants 2.0 transition process, scale, and complexity of running a normal GR has put the Gitcoin DAO contributors under significant strain. The associated challenges include GR operations, effectively handling fraud and Sybil attacks with the current manual processes, and the tech debt and fragility of the c-grants legacy product. Thus, Janine Leger, Gitcoin Grants Program Lead, proposed the following options on behalf of the Gitcoin DAO’s leadership:  Sunset c-grants and not run GR16 in Q4 2022, and move forward with plans to launch the Gitcoin Protocol in Q1 2023. Run a small GR16 c-grants round in Q4 2022 and postpone the Q1 2023 launch of the Gitcoin Protocol.  Grants 2.0 Transition The proposal clearly stated the benefits and risks that both proposed options brought to Gitcoin stakeholders.  Ooki - Repurposed for Gitcoin Gov Note v11920×1080 227 KB  The DAO’s leadership was leaning towards option one, immediately sunsetting the c-grants and not running GR16 in Q4 2022, because they want to fully focus on a successful protocol launch in Q1 2023. However, the Gitcoin community raised some concerns about both options in the forum discussion which led to Annika Lewis proposing a third option. The proposed third option was to run a Main Round for only GR16 and GR17 and push the Gitcoin Protocol launch to Q2 2023. Annika also suggested redefining which protocols could participate in these Main Rounds to be as inclusive as possible until the Gitcoin Protocol was able to launch. This proposed option aimed to address two key recurring concerns from the Gitcoin community: GR16 is less than two months away and sunsetting GR16 would disappoint funders and possibly hurt grantees that are reliant on Gitcoin quadratic grant funding. Further, the potential of Gitcoin not launching the Gitcoin Protocol in Q1 2023 would damage Gitcoin’s credibility. Based on Annika’s experience, this proposed third option should reduce the GR operational workload by approximately 80% and allow the Gitcoin DAO contributors more time to focus on the launch of the Gitcoin Protocol. Regarding the importance of running GR16 for existing grantees, Umar Khan quantified the importance of running a GR16 based on the number of grantees that raised over $5,000 of quadratic grant funding over the past year (GR12 to GR15). Khan’s analysis highlights that many previous grantees rely on recurring quadratic grant funding for their project’s financial runway.  $5K Multiple Rounds Grantees v11600×900 115 KB  … To finish reading this Governor Note head over to Messari. ",
                    "links": [
                        "https://messari.io/article/governor-note-decentralizing-gitcoin?utm_source=gov_gitcoin&utm_medium=organic_social&utm_campaign=decentralizing_gitcoin",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624/21",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624/38",
                        "https://messari.io/article/governor-note-decentralizing-gitcoin?utm_source=gov_gitcoin&utm_medium=organic_social&utm_campaign=decentralizing_gitcoin",
                        "https://gov.gitcoin.co/t/gitcoin-digest-40-s16-budget-requests-everscale-hackathon-and-the-fantom-alpha-round/11836"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6034482758620685
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/11/2022-00:35:35",
                    "content": "Thank you so much for putting this together and sharing here @joel.miya This report is detailed and neutral - very helpful if anyone wants to get caught up! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/joel.miya",
                    "index": "#3",
                    "likes": "1",
                    "time": "01/11/2022-15:37:34",
                    "content": "Thank you @connor! Feel free to send us any feedback from the community and if you would like to see these types of reports more often! We would love to know how to keep bringing value or just demo the Gitcoin Governor page to the Gitcoin team or broader community! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.749999999999999
                }
            ]
        }
    ],
    "group_index": "228"
}