{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/3-layers-to-a-dao-to-dao-partnership/10657",
            "title": "3 layers to a DAO to DAO partnership ",
            "index": 10657,
            "category": [
                "\\xf0\\x9f\\xa4\\x9d Partnerships"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "6",
                    "time": "20/05/2022-15:00:55",
                    "content": "I keep getting pulled onto calls with DAOs who want to partner with Gitcoin.   I want to lay out how I think about these things + solicit feedback from the DAO. IMO there are 3 layers to a DAO to DAO partnership.  They go in order from more casual to more serious (from less commitment to more commitment).  Social interoperability Product/Technology interoperability Governance Rights interoperability  More about these layers:  1. Social interoperability In this stage, there are strong relationships being built between members of each DAO across-DAO.  DAO members might be invited to speak at Gitcoin events like Schelling Point or our Public Goods are Good twitter spaces, or DAO Vibes.  This is the relationship/rapport/trust building stage of of a DAO to DAO partnership.  2. Product/Technology interoperability The product/technology interop stage is when the DAOs start to invest resources into seriously building Practical Pluralism between the products of each system. Examples of this I’ve seen at GitcoinDAO.  Gitcoin leverages Proof of Humanity or BrightID or Idena for Gitcoin Grants Gitcoin launches a podcast on the bankless network. I’m sure there are many others.   3. Governance Rights interoperability The Governance Rights interoperability stage is when the governance rights of each DAO is extended to the other DAO, likely via a Mutual Grant. Past examples of this  Gitcoins incubation of KERNEL. Gitcoins mutual grant with DeveloperDAO. Gitcoins incubation of dComipass.   Summary One thing I think is really important about web3 is Practical Pluralism.  Instead of web2 companies elbowing out each other for market share, web3 networks of DAOs are fundamentally modular + interoperable.  I fantasize about a world in which the Ethereum ecosystem becomes a DAO of DAOs that all rises and falls together, building a beautiful world of immense utility from a diverse fauna of protocols that serve our shared mission. Feedback welcome. ",
                    "links": [
                        "https://gov.gitcoin.co/t/practical-pluralism-essay-draft-req-for-feedback/10462/2",
                        "https://www.proofofhumanity.id/",
                        "https://www.brightid.org/",
                        "https://www.idena.io/",
                        "http://greenpill.party/",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347/7",
                        "https://gov.gitcoin.co/t/kernel-evolves-a-new-leaf-for-gitcoin-dao/9912",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-developer-dao/9217",
                        "https://gov.gitcoin.co/t/proposal-dcompass-season-13-budget-request/9794",
                        "https://gov.gitcoin.co/t/practical-pluralism-essay-draft-req-for-feedback/10462/2",
                        "https://gov.gitcoin.co/t/gitcoin-radicle-public-goods-alliance-temp-check/10825/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9601449275362315
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/polarpunklabs",
                    "index": "#2",
                    "likes": "0",
                    "time": "21/05/2022-21:57:32",
                    "content": "I think it is to Gitcoin’s credit that it does not see itself in an adversarial relationship with other DAOs, but instead operates in a kind of curated collaboration. In order to differentiate the wider Web3 commons from the inherited economic structures of constant competition we need to have porous borders. As a Bankless listener I especially appreciate how your podcast has slotted in there because in my mind there is a shared ethos with the Bankless crew. So yes, it’s great and please keep it up! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.395833333333334
                }
            ]
        }
    ],
    "group_index": "108"
}