{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/knowledge-transfer-gitcoin-grants-wall-of-love/11569",
            "title": "Knowledge Transfer: Gitcoin Grants Wall of Love ",
            "index": 11569,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "2",
                    "time": "25/09/2022-18:23:02",
                    "content": "At Messari Mainnet this year, a Gitcoin contributor recently asked me where the “wall of love” for grants went, and asked if there was any plans to bring it back.  So I am typing this post up to answer as much of that question as I can publicly.  What was the Wall of Love?  Input Back in Gitcoin Grants 4-6, there used to be a “comment” feature on the grants checkout page, wherein in addition to leaving some funds for each grant, you could leave a comment of encouragement for the grant owner. For Grants round 5-6, there was the ability to prefill these comments with basic messages like  “ keep up the great work” “ love the mission of your project” “ Great Job” “ i appreciate you” Custom messages you input.  I can’t find a screenshot of this UI anywhere, so youll all have to just imagine what it looked like.  Output The results of such input from contributor were then displayed on the grant’s “wall”, right above the newsfeed.  Here are a few sample \"Wall of Love\"s  Rotki   Screen Shot 2022-09-25 at 12.13.38 PM1150×712 99.6 KB   Prysm   Screen Shot 2022-09-25 at 12.14.33 PM850×860 60.3 KB   WalletConnect   Screen Shot 2022-09-25 at 12.15.04 PM836×902 73.8 KB   Yearn Finance   Screen Shot 2022-09-25 at 12.16.03 PM844×904 71.9 KB   Gitcoin Grants Core team fund  (which has since been deactivated post-DAO transition)  Screen Shot 2022-09-25 at 12.19.07 PM814×874 69.5 KB   Summary As you can see above, the wall of love was a feature that allowed “social capital” to flow alongside the “financial capital” in Gitcoin Grants. Users were prompted to input a message for each grant owner upon checkout, which was used to generate a wall of love on each grant. Most wall of love comments were short prefilled comments, but there was a long tail of comments that were custom and sometimes a bit more thoughtful. If anyone contributing to GitcoinDAO, who has metabase access, wants to see the wall of love for a grant, they can do so here. The wall of love was deprecated due to the churn and turmoil of the Great Bear and Great Reset of 2020. Most of the DAO contributors involved in Gitcoin today were not around for the Wall of Love. This post is pureful for informational purposes and knowledge transfer purposes. ",
                    "links": [
                        "https://gitcoin.co/grants/24/prysm-by-prysmatic-labs",
                        "https://gitcoin.co/grants/275/walletconnect-2",
                        "https://gitcoin.co/grants/416/iearnfinance",
                        "https://gitcoin.co/grants/86/gitcoin-grants-core-team-dev-fund",
                        "https://twitter.com/owocki/status/1516734601334607874",
                        "https://metabase.gitcoin.co/question/1244?grant_id=416",
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.422784391534392
                }
            ]
        }
    ],
    "group_index": "208"
}