{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/discussion-series-future-of-the-grants-program/11252",
            "title": "[Discussion Series] Future of the Grants Program ",
            "index": 11252,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "Grants2"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#1",
                    "likes": "19",
                    "time": "09/08/2022-18:11:56",
                    "content": "Last week, @kyle kicked off a discussion series on what the next 12-18 months might mean for Gitcoin if we are successful. This post is intended to follow on that, diving into the long-term future of the grants program. It seeks to surface conversations we are beginning to have in the DAO, in an attempt to continually build in public. I’d like to call out fellow DAO contributors @connor @lthrift @nategosselin @ceresstation @kevin.olsen @J9leger who co-wrote and/or deeply contributed to much of this thinking.  Context Gitcoin Grants is at a critical turning point. We’re evolving from a small, mostly-centralized group running a quarterly grants program into a large DAO managing & maintaining both a grants program as well as a modular protocol. In the last six months, we’ve focused largely on kicking off protocol development and defining what the different components of the protocol will entail. A major question for Gitcoin as we look ahead is what the Program entails, and what the Protocol entails. This includes questions around how we should restructure the rounds we run today. These are large questions that will require multiple perspectives, but this doc exists to give us a starting point for the discussion. It is one point of view that should not be taken as the “final decision”, but rather as a jumping off point while we navigate this new Protocol and Program territory.  Where we’ve come from Gitcoin Grants has evolved substantially since its launch three years ago. In the very early days, Gitcoin Grants was focused on two things – and since those early days, Gitcoin Grants has become much more than its two original focus areas. Let’s revisit where both of those stand today.  1. Funding Open Source in the Ethereum Ecosystem At the genesis of Gitcoin Grants in early 2019, this question was posed:  Today, open source and the Ethereum ecosystem are still deeply embedded in the veins of the Gitcoin community – but they now are far from the only communities we serve with our Grants program. Over the past few rounds, we have expanded beyond just open source – and beyond just Ethereum – and into funding public goods both on other chains, as well as in the real world through our Ecosystem & Cause Rounds. With our Ecosystem Rounds, we’ve helped over 20 unique groups fund their shared needs – from individual projects like Lootverse & Polygon, to collaborations like the ZK Tech & Open Gaming rounds. With Cause Rounds, which represent Gitcoin grants’ first material expansion beyond just software, Gitcoin Grants is now providing funding to entirely off-chain projects, many of which are onboarding to crypto for the first time with our program. Cause Rounds now account for roughly a third of our program.  2. Experimenting with Quadratic Funding (aka Liberal Radicalism)  Gitcoin Grants has effectively been synonymous with Quadratic Funding since day one, and a big part of who we are has involved implementing Zoe, Glen, and Vitalik’s vision in the real world. Over the past fourteen rounds, we’ve experimented with many configurations of QF – from having just one large pool, to a pool sub-divided into percentage-based categories, to running eighteen unique QF pools in tandem in GR14. We are the largest QF deployment in the world – now distributing over $5M entirely via QF each quarter – and we have proven that there is product-market fit here from funders, community donors, and grantees alike. We have also seen other projects begin to focus on enabling QF for communities in light of our success.  Where we are today In today’s world, we effectively have an inextricably coupled tech product + program + services, where Gitcoin is the only operator of our legacy platform (dubbed “cGrants”, for “Centralized Grants”) and anyone wishing to fund grants using our technology needs to go through us. Since early 2019, Gitcoin has been running our quarterly grants program. This program has become our flagship product, the thing for which Gitcoin is most well-known and is where the majority of our resources have been focused over the past couple years. This program involves two-week grants rounds which run each March, June, September, and December. Today’s program, which has evolved in the ways described above, currently consists of three round types, all running at the same time on cGrants:   Main Round — one large matching pool (in recent rounds, ~$1M) funded by many partners, distributed using QF to all projects on the platform with an Ethereum payout address   Cause Rounds — individual matching pools for specific social causes (e.g., Climate, DEI, Longevity) typically funded by many partners, distributed using QF to projects working on that cause   Ecosystem Rounds — individual matching pools for specific Web3 ecosystems (e.g, Polygon, Web3 Social), typically funded by one or a few organizations, distributed using QF to projects who meets the funders’ eligibility criteria   Running a program centrally can only scale so much. As the DAO revealed earlier this year in announcing Grants 2.0, we are moving towards becoming a protocol DAO. In addition to offering our protocol permissionlessly for others to use, the Gitcoin Grants program itself will soon run on top of that protocol. The remainder of this post is intended to outline a vision for the future state we are working towards.  The Big Vision Gitcoin’s purpose is to empower communities to fund their shared needs.  Today, the Gitcoin Grants program accomplishes that on a small scale. Our ambition with this new protocol & program delineation is to be able to accomplish this vision on a much larger scale, funding tens if not hundreds of millions of dollars in shared needs. We aspire to provide the mechanisms to help communities – whether they be DAOs, companies, countries, cities, not-for-profits, groups of friends – fund their collective needs in the way that is right for them. For some communities, this might look like picking up our grants protocol and reference interfaces and running with it themselves. For others, it might involve Gitcoin providing some hands-on operational support. And for some communities, this might involve using Quadratic Funding as the sole mechanism, as with our program today. For others, this might look like experimenting with a combination of direct grants + retroactive public goods funding + MACI QF – all of which we’ll offer as money legos within our protocol. In all cases, we aspire to be a trusted resource on the journey – to provide the toolkit these communities need in order to effectively distribute funding, based on their terms. In addition, we aspire to continue to intentionally fund areas that meet the Gitcoin community’s perception of humanity’s shared needs – this will be the continuation of our Grants Program, which will run on top of the new Protocol. So, in this future state, the Gitcoin Grants Program is just one of many programs that run on top of our Gitcoin-built technology – and is a program that we hope will inspire others to start their own, too.  1592×894 232 KB  And, finally, we envision a world, for grantees, where access to grants funding & early-stage funding at large is much less disparate. Blockchains provide the opportunity to build a unified grants registry, a one-stop-shop source of truth where both institutional funders & individual funders alike can access data – depending on permissions a grantee sets – on all of the projects out there looking for funding.  Deconstructing our Future Grants Components In the future state, we envision separating the product, program, and services components of Gitcoin Grants into distinct efforts. The protocol will programmatically enable the goals of many grant programs, inclusive of the Gitcoin Grants program.  1. Grants 2.0 Protocol (i.e. the product) This is the decentralized, permissionless protocol for running grants programs. As outlined in the initial Grants 2.0 forum post, the Gitcoin Grants protocol will be open source, modular, and decentralized – any community can create a grant program using our dApp front-end (or by interacting with the protocol directly), and then running it themselves. When the grants protocol is launched, matching funders don’t operationally need the Gitcoin Grants program anymore. Anyone, anywhere can stand up a grants program anytime – they aren’t bound to Gitcoin’s quadratic funding construct, nor are they bound to our quarterly grants round cadence. So, what does the protocol change? The protocol represents a few substantial shifts:   Gitcoin moving beyond just QF, and into grants tooling at large. The protocol is, in short, a software stack to run & manage your entire grants program by yourself – without Gitcoin’s help. Today, the Gitcoin Grants program is 100% quadratic funding-focused. With the protocol, QF is but one module, one funding lego that exists among many.   The ability for anyone at all to use it. By virtue of the protocol being truly permissionless, anyone can use it without needing to go through Gitcoin as a gatekeeper – today, we have the ability to hand-pick which matching funders engage with the program. With the protocol, as with anything open-source, the maintainer (Gitcoin) will not have authority over who uses it or what it is used for.   The ability to fund anything – not just public goods. Again, by virtue of this protocol being truly permissionless, those using the protocol can use it to fund whatever they want – not just public goods. Today, in our program, we explicitly focus – and always have focused – on funding public goods.    2. Gitcoin Grants Program In the early days of the protocol, the Gitcoin Grants Program is likely to be a super-user of the protocol – given our current scale, we expect to be the largest implementation on the protocol in the near-term. With the move to the protocol, we plan to gradually ramp down on running so many rounds ourselves, and will instead focus the Program on key areas where the DAO aspires to have an impact. Today, as described above, the program funds the shared needs of Web3 communities (Main Round / Ecosystem Rounds) and of humanity at large (Cause Rounds). As we look ahead, we have three objectives for the program in mind:   To grow Gitcoin’s brand. The quarterly grants rounds have become a schelling point for Web3 and have been extremely effective in developing our brand and bringing in funders. We see no reason this shouldn’t continue.   To have an impact, on the DAO’s terms. At the heart of Gitcoin since day one has been funding public goods, and maintaining a program allows us to continue to direct pools of capital specifically towards projects that meet the public good ethos – or whatever ethos the DAO decides is most important to fund – in spite of the protocol itself being entirely permissionless and, in theory, funding anything.   To drive protocol interest. As with any piece of technology, the protocol is something that will mature gradually over time, becoming easier to use self-serve as it gets built out. Continuing to run a program is a way we can hand-hold early users of the protocol and enable them, with an eye to them using the protocol more independently in the long-term.   We also see an opportunity for the program to become financially self-sustaining – which, today, it is not. As we evolve the program direction and where it is headed, we’ll explore business models that could make the program more long-term sustainable. To reiterate the “where we’ve come from section” above, the three objectives above move us further along the journey we’ve already implicitly begun in starting to move away from just “fund open source / public goods in the Ethereum ecosystem” and “serve as a testing ground for QF” as core objectives. While both remain core to our ethos, we are building towards something bigger.  3. Services Looking ahead, we aspire to be a trusted partner that helps communities in deploying their funds using our protocol. We will do this through the Services we offer – by understanding the efficacy of funding models better than anyone else, we can effectively advise funders on how they might deploy capital and help them in deploying that capital through our protocol. Today, the program & services are inextricably coupled. To run a QF round in the Gitcoin program, given that our platform is centralized, you need Gitcoin’s help operationally – there is no way to run grants through our platform without the PGF team’s involvement. Although we have not charged for our Services to date, receiving service from us has been a requirement to use the Gitcoin Grants Program, given that there has been no self-serve way to engage with the program due to its tech limitations. In the “programs-as-trees” analogy, services can be thought of as a watering service. The services we offer are Gitcoin helping you water your garden, so that your program can become the most thriving, fruit-bearing tree it can become. And these services would be completely optional – if you chose to water your own tree, and just use the protocol yourself, you could absolutely do so.  What does this mean for GR15? In Grants Round 15, we will still be running the Gitcoin Grants Program as usual on our cGrants platform. As we prepare for a protocol future, we will de-couple the Main Round from the Ecosystem / Cause Rounds. De-coupling starts to move us in the direction of what living in a protocol world will look like – wherein anyone can stand up any sort of round permissionlessly. What this means, tactically speaking for GR15, is that grantees will be able to be eligible for a specific Ecosystem or Cause Round, as long as they meet that round’s eligibility criteria – even if they don’t meet the Gitcoin Main Round criteria. Today, the Main Round criteria include not having raised VC funding over $500k, not having a token, not selling NFTs, being open source, and generally being a public good. We have received feedback from some of our funding partners that this is more restrictive than they would like to be, and this is the first step in our journey to enable permissionless funding of shared needs more broadly than just what we as Gitcoin prescribe as “public goods” based on our (imperfect) working definition. More to come in the upcoming GR15 Governance Brief.  Next Steps We would like to solicit feedback from DAO contributors, grantees, and funders alike as we crystallize this vision and more clearly define what the Program & Protocol will look like in the future. We will continue to provide updates on the journey as pieces get built out and tested. ",
                    "links": [
                        "https://gitcoin.co/blog/gitcoin-grants/",
                        "https://gitcoin.co/blog/gitcoin-grants/",
                        "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3243656",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://twitter.com/owocki/status/1551618547482103809?s=20&t=Urrt7gvglQCvg-yK4nj7LA",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624",
                        "https://gov.gitcoin.co/t/gitcoin-digest-29-2022/11260",
                        "https://gov.gitcoin.co/t/discussion-feedback-request-grants-protocol-alpha-round-eligibility/11873"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.580761220451942
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#2",
                    "likes": "5",
                    "time": "10/08/2022-14:41:24",
                    "content": "Thanks @annika and everyone else who has been thinking about this. I love the direction we are contemplating!  What this means, tactically speaking for GR15, is that grantees will be able to be eligible for a specific Ecosystem or Cause Round, as long as they meet that round’s eligibility criteria – even if they don’t meet the Gitcoin Main Round criteria.  Having the capability to define round level eligibility has been requested for a while, and is an awesome first step into this future.     annika:  by understanding the efficacy of funding models better than anyone else, we can effectively advise funders on how they might deploy capital and help them in deploying that capital through our protocol.   I want to call out that this is really one of the unsung heroes of our future. Gitcoin today is largely a one (very large) trick pony when it comes to grants funding. Luckily the QF mechanism has proven to be one of the most democratically fair way to distribute funds. Imagine if you don’t need the consensus of the commons and instead want to fund using a different method. In theory, Gitcoin should be experts in helping you understand hte pros and cons of deploying that capital. We will have the expertise to offer insights (to the world) on how effective capital distribution has been. Further, imagine if we could track the impact projects had, and tie that back to the funding model used… We can actually evaluate “are the grants the community choose ‘better’ than the grants chosen by VCs, Grants programs, etc.?” I am excited for our skillset to grow into the data analysis and insights generation too! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1701046798029555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Viriya",
                    "index": "#3",
                    "likes": "6",
                    "time": "10/08/2022-17:37:31",
                    "content": "Absolutely loved the thought and work that went into this. A great summary. This, naturally, stood out to me as one of the pieces I see MMM aligning and directly contributing to in future seasons:     annika:  To grow Gitcoin’s brand. The quarterly grants rounds have become a schelling point for Web3 and have been extremely effective in developing our brand and bringing in funders. We see no reason this shouldn’t continue.   MMM is currently working on Gitcoin’s overall brand narrative and how the protocols fit into the vision for Gitcoin. Your post helped outline a lot of what has already been discussed by our branding team (and I’m sure that’s not a coincidence lol). All that said, I believe that it would be helpful to define a Grants Program narrative that is heavily values-centric and continue to lean in and rally around our vision for a regen future. Our protocols will be neutral but our Program should be explicit in its stance/embody our community’s stance for a flourishing future for humanity, imo. I wanted to plant the seed here for future discussions as MMM builds out a marketing strategy for Grants Round growth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                }
            ]
        }
    ],
    "group_index": "181"
}