{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-spam-dust-donations/2791",
            "title": "[Proposal] Spam dust donations ",
            "index": 2791,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Crisgarner",
                    "index": "#1",
                    "likes": "16",
                    "time": "27/05/2021-04:26:02",
                    "content": "As some accounts are farming trying to farm future airdrops, spamming grants with really small amounts. Can we do something about it? It occurs to me two things:  disable alerts for donations lower than X. upgrade grants contracts and prevent dust amounts (that way if they want to spam farm at least a donation is significant to the grants).  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.78125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#2",
                    "likes": "5",
                    "time": "30/05/2021-14:49:24",
                    "content": "These are great suggestions. We have talked about trying to “increase the price of forgery” (ie, set the min contribution to $1 USD), but there are a lot of complications with us doing that (ie, unintended consequences with smaller tokens, conversion accuracy requirements at checkout, etc.). I love the idea on at least changing the threshold on notification! Let’s see if we can get that in for GR10. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.15625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#4",
                    "likes": "2",
                    "time": "18/06/2021-04:37:59",
                    "content": "Agree with the proposal for without notification for some donations (e.g less than 1 USD). This should be configurable for grant owner. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Eobaker",
                    "index": "#5",
                    "likes": "1",
                    "time": "24/06/2021-06:59:03",
                    "content": "Very good idea  are airdrops completely random?     Crisgarner:  It occurs to me two things:  disable alerts for donations lower than X. upgrade grants contracts and prevent dust amounts (that way if they want to spam farm at least a donation is significant to the grants    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.60625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/blockchaindude108",
                    "index": "#6",
                    "likes": "0",
                    "time": "01/09/2021-10:34:54",
                    "content": "Hey @Crisgarner, maybe it would be interesting to communicate to the “influencers” that they can promote these also. Nearly every channel and project i saw, which showed something about gitcoin or was involved in GR´s, said in their channels, its better to spend a small amount than a big amount, because of the QF formula, but the formula was mostly not more described, how it works. i think, like for me, the most contributors which saw these, were thinking its better to spend less than more for each specific project. Maybe there is some kind of confusion, even for me also. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.055555555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/diederisch",
                    "index": "#7",
                    "likes": "0",
                    "time": "01/09/2021-11:11:10",
                    "content": "Hello everyone! I am one of these guys, who came here, spend some minimal donations to many projects and did, “what i was told to”… the thing is - in my eyes Gitcoin is much much more as it appears to be. I am no webdeveloper or programmer, but thanks of gitcoin i am doing quests and get in touch with the crypto- and blockchainworld in a playful way. The structure that Gitcoin evolves regarding on our societystructure is indicatory.  In the end: When i came in touch with Gitcoin (and i just understood it only partitionally) i realised that if there is a gateway to this world i want to live in, than Gitcoin is giving a direction to. It depends how we will continue, but i thought to invite more people to Gitcoin, making it more public, builting groups and show them how they need to work…  in my eyes Gitcoin is the best tool i ever saw, to focus our energy so that every participant get the best out of it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.925619834710743
                }
            ]
        }
    ],
    "group_index": "372"
}