{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/web3-sybil-resistance-tool-competitive-landscape/12461",
            "title": "Web3 Sybil Resistance Tool Competitive Landscape ",
            "index": 12461,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "sybil",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#1",
                    "likes": "8",
                    "time": "30/12/2022-15:46:42",
                    "content": "Following the success of my post Web3 Crowdfunding Tool Competitive Landscape post I have decided to do a similar one for Gitcoin Passport. As I mentioned in my A BULL/BEAR case for Gitcoin/GTC in 2023 post, the most positive outlook I can imagine for Gitcoin Passport is:  Passport will be the foundation of a new sybil resistant economy in web3.  In order to understand if that is on track or not, I created this table of the competitive outlook. Here is the competitive landscape for Sybil Tools in web3:     - Circles UBI POAP KYC-DAO Idena BrightID Proof Of Humanity Worldcoin Gitcoin Passport     Mechanism Web of Trust Web of Trust Nation State ID Presence/Intelligence Testing Web of Trust Web of Trust Biometric Aggregator of other mechanisms   Traction 100k users 1million wallets Not launched 3k validated identities 65K+ sponsored users / 15 Apps Integrated 17k users 700k users 100k users   Notable Integrations $CIRCLES ~ ~ ~ Gitcoin, Rabbithole, Unitap, & others  $UBI, easy on-chain integration ~ Snapshot, Gitcoin Grants   Pros ~ ~ ~ ~ ~ ~ Distribution worldwide, scale, simple mechanism Integration with Gitcoin Grants, Pluralistic Approach   Cons ~ Not specifically a sybil tool Nation State IDs not likely to be seen as legitimate in blockchain communities. ~ ~ ~ Brand Not clear if it actually solves for sybil resistence, how well it scales across identities,   Comments Backed by Gnosis Not specifically a sybil resistance tool, but could be useful for sybil resistance ~ ~ Backed by Vitalik, lengthy thread on Gitcoin/BrightID Aura here  Forking Soon, Backed by Vitalik  Backed by Silicon Valley Luminaries     I was not able to find all information for all of the tools so please comment below if there is something I missed or got wrong. Some trends I observed while doing this analysis:  The tools with good developer docs seemed to have more apps built on top of them. The tools with built in economics (eg Passport & Gitcoin Grants, Proof of Humanity & UBI, Worldcoin & Worldcoin airdrop) seemed to have the most distribution. There are a lot of web of trust based tools. While many of these tools claimed to solve sybil resistance, none of them really had easy to use tools that allowed you to inspect whether it was working or not (except BrightID and their Aura tool)  I think that the web3 sybil resistance ecosystem is small but growing, with no clear winner yet.  It seems to me it’s anyone’s game to create an ecosystem that has exponential growth and runaway value. It’s possible that there will be multiple winners.   These are the scenarios I am considering:  There is 1 winner. There is 1 winner for creating sybil resistant identities (user centered use cases) and another 1 winner for making those identities easy to use with things like Sign In With Ethereum (developer centric use case). There are multiple winners in each of those categories. Because of the composability of this space, “winner” is too zero-sum of a mentality.  All of these apps will rise and fall together.   This is what I would like to see in 2023:  Passport will be the foundation of a new sybil resistant economy in web3.  Is Gitcoin Passport on track for this outcome?  Why or why not?  Which projects in the above list should Gitcoin try to emulate or integrate with? ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442",
                        "https://joincircles.net/",
                        "https://poap.xyz/",
                        "https://kycdao.xyz/",
                        "https://www.idena.io/",
                        "https://www.brightid.org/",
                        "https://proofofhumanity.xyz/",
                        "https://worldcoin.org/",
                        "https://passport.gitcoin.co/",
                        "https://twitter.com/koeppelmann/status/1563089304775061504",
                        "https://dune.com/greywizard/sgc-work",
                        "https://apps.brightid.org/",
                        "https://twitter.com/VitalikButerin/status/1288545712343527425",
                        "https://gov.gitcoin.co/t/what-can-we-learn-from-brightids-aura-sybil-defense-software/11159",
                        "https://ubi-alliance.medium.com/vitalik-buterin-supporting-proof-of-humanity-16339af97104",
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442/9"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/castall",
                    "index": "#2",
                    "likes": "2",
                    "time": "30/12/2022-21:30:35",
                    "content": "I love to see research like this. More points of interest about BrightID/Aura   There is a snapshot BrightID strategy.  SongADAO is using it.   BrightID Aura has a Soulbound Token standard   BrightID & Aura are happy to be stamps in Gitcoin Passport .  BrightID has always positioned itself as a stamp, not a wallet or passport.   BrightID has social recovery which we’d like to bring to Gitcoin Passport.  Maybe Gitcoin Passport could help bring (decentralized) institutional recovery (e.g. recover with Gitcoin, Giveth, etc. – like social recovery but with semi-trusted orgs).   BrightID would like to bring its privacy tech to Gitcoin Passport so users can avoid cross-linking or doxxing. (See this post.)   Aura at its core is a decentralized tool for experts appointing other experts. The experts can operate in any domain.  We’d like to add Gitcoin as an energy team to allow independent Sybil hunters to help Gitcoin and learn to use its legos.   I’m looking forward to much more collaboration between Gitcoin and BrightID in 2023. ",
                    "links": [
                        "https://gov.gitcoin.co/t/passport-scoring-as-a-service/12419/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.245370370370371
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "3",
                    "time": "02/01/2023-15:23:04",
                    "content": "    a33titude:  While many of these tools claimed to solve sybil resistance, none of them really had easy to use tools that allowed you to inspect whether it was working or not (except BrightID and their Aura tool)   Very true. This is where the sybil scoring legos we are building with FDD will come into play. Think of each individual analysis as having a boolean output. The exploratory analysis of these has primarily been done and funded by FDD/Gitcoin in the past. Now we have built up the Open Data Community to split this cost with other orgs. Our hackathon in October was 100% Gitcoin funded prizes. The upcoming one in January is 39% Gitcoin funded! We also clarified the specifications to include containerization and a boolean output. For more on the anti-sybil legos see the articles here. When you envision this productized where the interface for a fraud analyst or round operator can utilize the many legos beneath the surface, here are a few ways to think of it:  As a fraud analyst, I want to be able to suggest  wallet/passport/grant and see how it relates to it’s relevant sybil analysis legos. As a fraud analyst, I want to be able to upload a list of wallets/passports/grants and get an output with the rows being the identifier and the columns being the boolean output of each lego. As a fraud analyst, I want to be able to select which analysis legos are executed for my list to save on computation costs.  We have a much more detailed article coming out this week really sharing the vision along with the start of the hackathon which have rewards for both the exploratory analysis discovering new analysis legos and the building of legos, contanerization/standardization of known analysis. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.266296897546898
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#4",
                    "likes": "1",
                    "time": "04/01/2023-04:40:14",
                    "content": "    DisruptionJoe:  Think of each individual analysis as having a boolean output   Am I correct in presuming the boolean output is whether the user is a sybil attacker or not?     DisruptionJoe:  When you envision this productized where the interface for a fraud analyst or round operator can utilize the many legos beneath the surface, here are a few ways to think of it:   Is there any place I can read about the holistic 2023 roadmap for Passport?  Or see wireframes of what it will look like at the end of 2023?  I get bits and pieces here and there, it would be great to see something holistic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#5",
                    "likes": "1",
                    "time": "04/01/2023-10:51:56",
                    "content": "    a33titude:  Am I correct in presuming the boolean output is whether the user is a sybil attacker or not?   We would be lucky to have that! Unfortunately, it turns out that there is no one analysis that says for sure that user is sybil. Instead, we have many of these “legos” that say a user is likely sybil via a combination of multiple signals.  if a user is triggering specific known combinations If they pass a threshold score from an ML model.  The model looks at all these outputs against our “Thor & Loki” datasets (read: for sure not sybil & for sure sybil)  We then choose a threshold whereby we deem the users most likely sybil. This method aims to minimize false positives even over avoiding false negatives.  Here is a comment from a past budget discussion where I explained how any one signal is not sufficient on its own. [Proposal] FDD Season 14 Budget Request - #12 by DisruptionJoe     a33titude:  Is there any place I can read about the holistic 2023 roadmap for Passport? Or see wireframes of what it will look like at the end of 2023? I get bits and pieces here and there, it would be great to see something holistic.   My team at FDD is working with the GPC Passport team to do a few specific things.  In November we provided 4 models for scoring they could use for preventative sybil defense. These one score to rule them all models aren’t as good as customized scores per use case, but it is more scalable and we are studying how well it works. We performed analysis to estimate the effectiveness of the Snapshot & Bankless integrations and fine new “legos” specific to their use cases. We created a topology model and recommendations for which stamps to prioritize to solve sybil resistance. The GPC team is thinking about UX and has final say for what is prioritized. At this point, they seem to be leaning towards a steward voting model to determine which stamps are included. (I believe this is a mistake because the purpose of passport is to solve sybil resistance, not to be a popularity contest, but we hope stewards will take FDD recommendations.) We are documenting and building pipelines for best way to extract data from ceramic and join with other data such as onchain signals.  Here is a view of priorities from the cross-functional passport pod priorities for this season.  Image 2023-01-04 at 11.47.08 AM2254×1133 208 KB  ",
                    "links": [
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/a/ad6af5ffc98ae52b00542b5f699ba1dfb2f9628f.jpeg"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.961980920314254
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/web3-crowdfunding-tool-competitive-landscape/12266",
            "title": "Web3 Crowdfunding Tool Competitive Landscape ",
            "index": 12266,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#1",
                    "likes": "6",
                    "time": "08/12/2022-15:35:40",
                    "content": "While reading through this thread, I organized my thoughts by putting together an analysis of the web3 crowdfunding landscape. I am sharing it in case it is useful to others in the DAO.  Hopefully this helps inform some of the conversations on the governance forum about Gitcoin’s competitive positioning.  (NOTE: It is unclear to me how much these tools will compete vs cooperate as the market matures )     Project CLRFund Giveth Protocol Guild Mirror Juicebox Gitcoin     What are they? QF Protocol + Program Crowdfunding Multitool a collective of 128 Ethereum core protocol contributors publishing platform + crowdfunding tool Crowdfunding Platfrom QF Protocol + Program + Sybil tool   Unique Selling Proposition or Niche MACI, First QF Protocol on market Most expansive featureset + advanced mechanism design Network, Simplicity, Content x Crowdfunding Easy capital formation for any DAO First QF tool to market   Monthly Burn $15k/mo $100k/mo $0k/mo (volunteer run) undiscolosed $150k/mo $1million/mo   Total Impact $900k $1.1m $5m $80m $100m+ $72m   FDV N/A $20m N/A $50m $2m $175m    Are there any tools I missed?  Does the comparison above yield any insights? I am open to your comments and feedback. ",
                    "links": [
                        "https://clr.fund/#/",
                        "https://giveth.io/",
                        "https://protocol-guild.readthedocs.io/en/latest/",
                        "https://mirror.xyz/",
                        "https://juicebox.money/",
                        "https://gitcoin.co",
                        "https://twitter.com/clrfund",
                        "https://gov.gitcoin.co/t/is-gitcoin-over-its-skis-should-we-hold-spending-flat-while-addressing-unavoidable-risks/11870/17",
                        "https://etherscan.io/address/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9",
                        "https://juicebox.money/projects?tab=all",
                        "https://gitcoin.co/results",
                        "https://www.coingecko.com/en/coins/giveth",
                        "https://www.coingecko.com/en/coins/mirror-protocol",
                        "https://www.coingecko.com/en/coins/juicebox",
                        "https://www.coingecko.com/en/coins/gitcoin",
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442/9",
                        "https://gov.gitcoin.co/t/digest-48-how-do-we-make-gitcoin-sustainable/12498",
                        "https://gov.gitcoin.co/t/web3-sybil-resistance-tool-competitive-landscape/12461",
                        "https://gov.gitcoin.co/t/november-csdo-digest/12338/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2310606060606055
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/michaelgreen06",
                    "index": "#2",
                    "likes": "3",
                    "time": "09/12/2022-03:00:55",
                    "content": "Thanks so much for posting this @a33titude!! It’s really helpful to see all of these metrics side by side. I’m curious about Giveth Total Impact #. In the post you link, @griff says they’ve done $1.1m in the last 11months. I imagine their total lifetime value is larger than this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3828125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/12/2022-21:44:09",
                    "content": "Great work.  I’m not sure I would put the USP exactly that way.  For me - when Gitcoin was running rounds - it was more about the largest & most secured rounds without requiring KYC.  Others in Gitcoin’s MMM and elsewhere could word that better.  Now that Gitcoin is rapidly becoming a protocol it is attempting to both deliver the best protocols & related software (like passport) to enable a community to fund its own needs AND to also deliver to these communities attention from supporters and funders.  A good example is the just launched Unicef round:  https://go.gitcoin.co/blog/unicefs-alpha-round-grantee-showcase Do you think that there may be winner take all dynamics here?  For example, thanks to a double side market - and Gitcoin possibly being ahead in delivering high-quality protocols plus having a huge community of supporters? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.703125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#4",
                    "likes": "3",
                    "time": "14/12/2022-21:42:04",
                    "content": "    epowell101:  Do you think that there may be winner take all dynamics here?   I do not know.     epowell101:  For example, thanks to a double side market - and Gitcoin possibly being ahead in delivering high-quality protocols plus having a huge community of supporters?   I do think Gitcoin does have a huge community of supporters but I do not think Gitcoin is ahead in delivering high quality protocols.  Most of the competitors in this list have protocols that have done higher volume of support for public goods than Gitcoin’s protocols have (in some cases much higher). CLRFund is ahead on privacy aware quadratic funding, and Giveth has more advanced mechanism design & faster shipping than Gitcoin does.     epowell101:  Great work. I’m not sure I would put the USP exactly that way.   Feel free to fork my post and update it where you think I got it wrong!  As a GTC enthusiast, I would find comfort in the idea that people who work on GitcoinDAO are taking their competition seriously! I don’t want Gitcoin to be to web3 crowdfunding what MySpace was to social networking (an early market leader that could not keep up with an evolving market). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.857539682539683
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/QuadraticLander",
                    "index": "#5",
                    "likes": "1",
                    "time": "30/12/2022-00:16:10",
                    "content": "do u think that coordinAPE is a competitor? the way they reward compensation peer 2 peer feels very similar to how quadratic funding works IMO. peers vote on who gets funded, and then there is an airdrop. but the things they fund are people, not causes (grants)  co_cover1132×1044 79.5 KB  and coordinAPE are used by lots of DAOs  co_test2124×914 158 KB  i wonder if many of the projects that might use Grants 2.0 already have their needs serviced by something like coordinAPE. ",
                    "links": [
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/0/090f6fd8f1589976f1a67214e979ecb0ed26f180.jpeg",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/f/f1d71c59746fef98b8eb271207d89376061733f7.jpeg"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#6",
                    "likes": "2",
                    "time": "02/01/2023-10:57:13",
                    "content": "I do think most people are missing the bigger picture which is that these are all tools for us to make group decisions that are immediately reflected in the payment action. We are trying to find ways for groups of people to decide how to (re)distribute some amount of funds. This is why I believe sybil defense is our most important investment after the protocol launches along with DevOps. To have fair collective decision making, you need to be able to trust that there aren’t fake ballots and you need a community of analysts and builders to continually identify and validate problem and build solutions. I’m thinking more and more that GTC should either be used to make the Gitcoin identity as strong as can be (cheaper to defend than to attack) OR strictly for governing the DAO & Grants program. The latter option is still difficult because there is a lot of resistance to the DAO investing in business on the protocol rather than only giving grants. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.977777777777778
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/alexalombardo",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/01/2023-17:33:45",
                    "content": "this is more of a mechanism not determined by QF but by the community itself and there isn’t any donor amplification; their POD is more in shifting the way orgs think about compensation and providing tools to do so, not the actual funding mechanism; very values aligned with Gitcoin though ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/alexalombardo",
                    "index": "#8",
                    "likes": "3",
                    "time": "02/01/2023-17:43:53",
                    "content": "Would add Nouns / Prop House in as well Also think it’s important to also consider web2 tools here - more traditional ones that could potentially incorporate new funding mechanisms down the line; also, web2 crowdfunding platforms have users who would potentially be interested in switching to Gitcoin if the interface were easy enough Here was some early competitive analysis MMM did from a marketing/positioning standpoint: Grants Protocol Positioning Other competitors to consider - Republic, Radius, Questbook One note on Mirror - feels like an outlier because of their creator content focus; including it would suggest need to include other creator content driven platforms ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.589225589225589
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/QuadraticLander",
                    "index": "#9",
                    "likes": "0",
                    "time": "02/01/2023-22:16:02",
                    "content": "    alexalombardo:  Would add Nouns / Prop House in as well Also think it’s important to also consider web2 tools here - more traditional ones that could potentially incorporate new funding mechanisms down the line; also, web2 crowdfunding platforms have users who would potentially be interested in switching to Gitcoin if the interface were easy enough Here was some early competitive analysis MMM did from a marketing/positioning standpoint: Grants Protocol Positioning    This is great, thank you for sharing!     alexalombardo:  this is more of a mechanism not determined by QF but by the community itself and there isn’t any donor amplification;   In my opinion this feels like a distinction without difference. Grants protocol (and it’s associated round manager protocols; which could be QF or QV or any other type of voting mechanism) and CoordinAPE are both ways to distribute tokens within a ecosystem to those who are delivering the most value to that ecosystem. The competition is zero sum in that a token that goes through coordinape does not go through Gitcoin + visa versa. And CoordinAPE is already being used by hundreds of project already. Whereas Grants Protocol is used by 1 or 2.     alexalombardo:  their POD is more in shifting the way orgs think about compensation and providing tools to do so   Can you elaborate?  Isnt this similar to what Gitcoin does? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2053170594837255
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#10",
                    "likes": "1",
                    "time": "03/01/2023-02:34:42",
                    "content": "    DisruptionJoe:  I’m thinking more and more that GTC should either be used to make the Gitcoin identity as strong as can be (cheaper to defend than to attack) OR strictly for governing the DAO & Grants program. The latter option is still difficult because there is a lot of resistance to the DAO investing in business on the protocol rather than only giving grants.   Where can I read more about the decision for the DAO to not invest in projects?  Is decision that why the Mutual Grants thread went dead? Gitcoin Grants has many notable and very successful alumni.  It would be something to add to the Bull Case for Gitcoin if Gitcoin got upside in future alumni. ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.336805555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/alexalombardo",
                    "index": "#11",
                    "likes": "0",
                    "time": "07/01/2023-06:28:59",
                    "content": "As I mentioned, Gitcoin and Coordinape are very values and visions aligned, and at the high level yes they distribute value in an ecosystem, but the tools are very different. Coordinape’s facilitate the distribution of funds within a community - compensation tools for specific projects (or “epochs”) defined and budgeted for by the community. Gitcoin’s program and now protocols foster new, more democratic funding opportunities - enabling program managers to run and scale their own grants programs end to end, encouraging donors to discover projects to invest in, and empowering builders/project owners to build reputation and apply for funding. Yes, the tools are similar in that they make coordination easier, but you would not use them for the same objective. I would use Coordinape if I’m a contributor to a DAO and want to get paid (again, this is current state Coordinape tools - as they expand their offering this might change), whereas I’d participate in Gitcoin Grants (or in future, a program operated on the protocol) as a donor if I want to invest/signal my support, as a builder/project owner if I want to get my project funded, or as a round operator if I want to run my own round. Plus our protocols being open and permissionless make it possible for devs to build on top of them. Additionally, our protocols have been in closed beta - but more than hundreds of projects have gone through our program (most notably Uniswap) and we’ve facilitated $72MM in funding. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.840082644628099
                }
            ]
        }
    ],
    "group_index": "261"
}