{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/fdd-ml-data-thoughts/8508",
            "title": "FDD ML - data thoughts ",
            "index": 8508,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/php",
                    "index": "#1",
                    "likes": "3",
                    "time": "07/09/2021-08:26:10",
                    "content": "Just 2 gwei for Mid/Long term, being from a Data Mining/Analytics/Governance background,  I will touch Reporting &Analytics, Data Operation/privacy and ML. (I had short meetings with a few stream people, still think writing something broad will be useful for me to get hands dirty later. Now I‘ll start short term task proposals in Notion) How important ML might be, it needs to start from operation (business) and provide action to impact the operation. Then it come down to people, data, asset linked by processes.  image954×683 8.92 KB  Not going to quote more complex methodologies, they will work fine with good understanding of operation. Everything Data Modeling can and should be designed in this approach: Business Understanding⇒Data Understanding⇒Data Modeling/Product⇒Use in Business⇒Next Cycle Therefore, my thoughts about data governance: decision may swing as we go forward, but data should be categorised, store and archive of data keep at a non-exhaustive level, functional can be outsourced or cost of owning given back to user themselves: For example, email subscription can potentially be implemented using an ETH address - email mapping, which can be a third party API or an ENS-like-fashion; we simply don’t have to keep user email which is just a channel to send notifications, the same as websites don’t keep user passwords and just need a hash. All types of data product (dashboard, ML model, collation tool etc), can focus on: process and reward for sharing good practices, attendance of training. Because however automated it can be, human is still behind the evolving daily operations. Facilitating - for quadratic funding/FDD we need to know the nature of transactions, hence the lowest level of data. Once GR settled - shall we retain the full history? At least we can anonymize the data or move old datafrom db to encrypted files etc. Be good to hear your thoughts! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.471965020576132
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/php",
                    "index": "#2",
                    "likes": "2",
                    "time": "07/09/2021-08:44:42",
                    "content": "Some questions - how do we choose which data tools to use? Most likely, the answer lies differently within each L2 streams, or with each person. Efficiency/security and ability to port/migrate might be the main reasons. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#3",
                    "likes": "1",
                    "time": "07/09/2021-14:46:10",
                    "content": "Thanks for your post @php! Welcome in the FDD Team by the way! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                }
            ]
        }
    ],
    "group_index": "568"
}