{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/moving-on-to-commonwealth-im/8799",
            "title": "Moving on to Commonwealth.im ",
            "index": 8799,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/wyx",
                    "index": "#1",
                    "likes": "2",
                    "time": "12/10/2021-22:32:44",
                    "content": "Disclosure: I work at Commonwealth. Hey everyone, As per @DisruptionJoe 's suggestion, I’m putting this here. Summary The MMM workstream should engage in discussions with Commonwealth on potentially migrating from Discourse to Commonwealth. Motivation Discourse can’t accommodate a lot of the governance tooling that Gitcoin is working on is working on, such as the steward report cards, and seasonal POAPs for contributors, etc. In that sense, I think it makes sense to explore Commonwealth forums as a replacement for Discourse. Commonwealth as a tl;dr is Discourse but better since it’s crypto native. We already have dYdX and Edgeware on the platform. Here is a 1 pager that goes more into detail: Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. Pros:  Explore migration to a platform that is more crypto-native and can better integrate with Gitcoin  Cons:  Nothing  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#2",
                    "likes": "1",
                    "time": "12/10/2021-23:06:02",
                    "content": "Hi! Are there any reason you think a migration would benefit the MMM-Workstream specifically and not any of the other Workstreams? Can you describe a specific example of how MMM (or other workstreams) would directly benefit from moving from Discourse to this platform? You mention the Steward Report Cards, how would these be improved? For clarity: The MMM-Workstream is using Notion and Discord to coordinate. Discourse is used by the MMM-Workstream to post proposals and as a way to signal the release of GitcoinDAO-wide tools, like the Steward Report Cards. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wyx",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/10/2021-23:19:22",
                    "content": "Hey fred, Notion and Discord would continue. Discourse would be replaced by Commonwealth. I think the MMM workstream should be in charge of deciding the viability since they’re developing the tools that would most benefit from this migration from Discourse to Commonwealth. An interesting thing that could be developed is say I hover over a steward’s profile pic in the Commonwealth forum, and I’m able to see a mini steward report card. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                }
            ]
        }
    ],
    "group_index": "590"
}