{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/supermodular-xyz-2023-roadmap/12263",
            "title": "SuperModular.xyz 2023 roadmap \\xf0\\x9f\\x97\\xba ",
            "index": 12263,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "4",
                    "time": "08/12/2022-05:24:08",
                    "content": "Hi Gitcoin frens from SuperModular.xyz (fka Gitcoin Holdings), Can you believe its been 6 months since Passing the Torch!??!  And 5 months since we stopped any lingering work related within Gitcoin!?? I’ve put up a post detailing an early preview of SuperModular.xyz 's 2023 roadmap.  It’s just a draft, not final.  Feedback welcome! Feel free to check it out over on community.supermodular.xyz (oh and feel free to say hi):   SuperModular.xyz Community – 8 Dec 22    2023 roadmap early preview- SuperModular Incubation Program (SIPS) ☕️ SIPS is the SuperModular Incubation Program. (Important disclaimer: this is an early preview and could be subject to change until finalized)   Goals We aim to extend & repeat the market success of Gitcoin.  By extending & repeating our market...      ",
                    "links": [
                        "https://gov.gitcoin.co/t/decentralizing-gitcoin-holdings-now-supermodular-xyz-s-work-within-gitcoindao/11069",
                        "https://supermodular.xyz",
                        "https://community.supermodular.xyz/t/the-big-introduce-yourself-thread/11/14",
                        "https://community.supermodular.xyz/t/2023-roadmap-early-preview-supermodular-incubation-program-sips/106",
                        "https://community.supermodular.xyz/t/2023-roadmap-early-preview-supermodular-incubation-program-sips/106",
                        "https://gov.gitcoin.co/t/systematic-exploration-of-the-coordination-mechanism-design-space/12616/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.196969696969696
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Colton",
                    "index": "#2",
                    "likes": "1",
                    "time": "15/12/2022-12:50:00",
                    "content": "I love this. It looks like a very thoughtful design. The monthly demos could be a good way of helping devs network. Those personal connections can lead to more incubator projects and having a good network of web3 frens will help weather the crypto winter. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.433333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "4",
                    "time": "18/01/2023-13:47:18",
                    "content": "(x-post on community.supermodular.xyz) Hi everyone from SuperModular. Here is a short update on what we’re up to in 2023.  Our Purpose Everything we do at Supermodular is grounded in our purpose.  Our purpose is to cultivate a more regenerative digital frontier.  Our Roadmap We just unveiled our 2023 SuperModular Roadmap Preview. Our roadmap is T shaped.  Part of it goes BROAD on building a movement. Part of it goes DEEP on building software.  Broad - movement building How do we create a movement for regenerative crypto?  How do we educate people and route them to regenerative crypto projects?  How do we design a category and show off category kings like SuperModular & it’s alumni (like Gitcoin and KERNEL)?  How do we act like live players until a formula to achieve our purpose appears?  We continue to do Greenpill podcasts.  This recent one on the Grants Alpha Round on Greenpill 1/17 may interest you! We continue to do public speaking.  This recent talk at Plurality Summit heavily features Gitcoin Grants, so it might interest the DAO! We just signed a LOI to help co-produce Schelling Point Denver 2023. We are building a soup to nuts educational funnel for from new to web3 to regen web3. We are experimening with other new ways of making regen crypto a movement.  This might mean a greenpill course or audiobook, or supporting local greenpill meetups across the world. More here. We will have lots of fun new supermodular swag at ETHDenver.  Looking forward to attending schelling point and giving you all some!   DEEP on building software  We are launching https://buidlbox.io/ at ETHDenver. (Buidlbox used to be known as Gitcoin Hackathons) We are working with Protocol Labs on http://hypercerts.xyz/, which is launching on top of Grants Stack on ETHDenver. We are building on top of grants stack.  Much of this work is new form factors for Quadratic Funding.   Quadratic Funding Social Network in Lenster  Quadratic Funding Social Network in Discord   Some of the work is just taking QF and putting it in new places.  We’re building Simple Grants, a web2/fiat grants tool.  Once this ships, we have leads to run rounds for (1) the democratic party (2) a town in Africa, also the state of Colorado (3) web2 Open Source.   Some other work is extending Grants Stack.  A QV fork of Allocation Protocol. A tool for sorting/contacting winners of a Grants Round       Things I’d LIKE to build in 2023. This is work that we’ve not yet gotten traction on yet but would like to.  a L2/block builder/block proposer/ MEV tool that funds public goods with its fee generation web3 SAAS tools (long live EIP 1337) that give DAOS easy tools to generate subscription revenue Map the metacrisis at https://www.metacrisisdao.com/  We’d love to build on top of Passport.  But we’re not sure what/where/how to do that yet. A product hunt for web3.  What if we built this on top of Grants Stack and/or used the Grants Stack Data to surface the best new projects? One area of BIG opportunity we see is to fork Allocation Protocol and build many different coordination mechanisms on top of it.  Taking Gitcoin Grants Stack from QF => a pluralism of practical coordination mechanisms.  We could do a hyperparameter sweep of whats possible in web3 human coordination and achieve MAXIMUM COORDINATION!!! QF for communities I’m in:  stuff like moonshot bots, SACKS, boulder blockchain   Summary This is a TLDR of what Supermodular has been up to. If this is helpful to you please  the post so I know to continue making updates like this.  If so, I think quarterly updates might be a good cadence. ",
                    "links": [
                        "https://supermodular.xyz/",
                        "https://community.supermodular.xyz/t/2023-roadmap-early-preview-supermodular-incubation-program-sips/106",
                        "https://www.playbigger.com/media/how-to-be-a-category-king",
                        "https://community.supermodular.xyz/t/the-regen-movement-needs-live-players/160",
                        "https://greenpill.party/",
                        "https://community.supermodular.xyz/t/greenpill-episode-drop-gitcoin-alpha-round-janine-leger-connor-oday-and-nate-gosselin/234",
                        "https://owocki.com/making-pluralism-practical-%f0%9f%8c%88/",
                        "https://community.supermodular.xyz/t/sip-cohort-2-opportunity-1-regen-web3-educational-research-funnel/81",
                        "https://buidlbox.io/",
                        "http://hypercerts.xyz/",
                        "https://community.supermodular.xyz/t/new-form-factors-for-quadratic-funding/165",
                        "https://community.supermodular.xyz/t/sip-cohort-2-opportunity-2-quadratic-funding-social-network/94",
                        "https://community.supermodular.xyz/t/sip-cohort-2-opportunity-2-quadratic-funding-social-network/94",
                        "https://community.supermodular.xyz/t/sip-cohort-2-opportunity-3-web2-5-simplegrants-platform/95",
                        "https://www.metacrisisdao.com/",
                        "https://medium.com/giveth/coordination-mechanisms-notes-from-a-conversation-with-griff-green-kevin-owocki-af95f3e831b1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.724264705882352
                }
            ]
        }
    ],
    "group_index": "259"
}