{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/routing-your-request-to-work-with-gitcoindao/11290",
            "title": "Routing your request to work with GitcoinDAO \\xf0\\x9f\\x94\\x80 ",
            "index": 11290,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "contributors",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "12",
                    "time": "15/08/2022-13:28:20",
                    "content": "From time to time, people slide into my DMs asking if they can do some work with GitcoinDAO. These requests vary in nature, sometimes people want to sponsor a matching round.  Sometimes people want Gitcoin to join a twitter spaces.  Sometimes they are partnership requests. But in almost all cases, I cannot field the requests because I’ve disaffiliated from DAO leadership. So I am creating this gov post to help route these requests.  My goal for this post is to (1) get these requests out of my DMs + get them to where DAO members can see them (2) route them to who can actually help. Here is an easy 3 step process to route your request:  1. Verify that this request matches the essential intents of Gitcion Everything at Gitcoin revolves around this purpose (100 year vision) and essential intents (12-18 months vision). From this post:    Update: GitcoinDAO's Adopted Purpose and Essential Intents   The Purpose of Gitcoin To empower communities to fund their shared needs. The Essential Intents of Gitcoin  Protocol Adoption  Build a widely adopted, modular Grants protocol that creates a flourishing ecosystem of funding mechanisms. Build a widely adopted, modular Pluralism Passport protocol that creates a flourishing ecosystem of network effects around Decentralized Society.   Financial Sustainability  Have a comprehensive, diversified strategy for financial stability of the DAO in order to effectively achieve our mission.   DAO Organization  Create and promote clear and engaging rituals, communication channels, and messaging that build emergent shared context among GitcoinDAO’s contributors, stewards, and supporters.   Grants Program Success  Enable a successful grants protocol launch by dogfooding it internally and supporting ecosystems in adopting it. Continue to support the Ethereum ecosystem and public goods in web3 and beyond through Gitcoin-led rounds.      If your inquiry does not match this purpose/essential intent it is not likely to be actioned.  2. Contact someone at GitcoinDAO that can help For DAO Operations, please contact @krisis @Jodi @Kyle For Fraud Defense/Grant Approvals/Data Science, please contact @DisruptionJoe @tigress For Partnerships or grants round sponsorships please contact @ceresstation @benwest @vgk For Grant operations please contact @annika @J9leger For marketing, please contact @CoachJonathan For public speaking inquiries, please email speakers@gitcoin.co For Gitcoin Foundation matters please contact @kyle For integrations in Gitcoin passport please contact @erich or @brent For product inquiries please contact @lthrift @kevin.olsen @GTChase To create a grant application please submit it on the product directly at http://gitcoin.co/grants by clicking ‘Create Grant’.  This post covers how to make your grant successful. For support please go to https://support.gitcoin.co/ or email support@gitcoin.co. For general inquiries, or if you’re not sure who to contact, please comment on this post and ask. (Note for members of GitcoinDAO, if i missed the mark in this “routing table” feel free to edit the post directly to fix)  3. Engage in the DAO If you engage in the governance forum https://gov.gitcoin.co or the discord https://gitcoin.co/discord that is a great way to get to know Gitcoin.  The DAO also hosts weekly calls which you can find on the calendar at https://gitcoindao.com/  Requests from engaged community members are usually prioritized over “drive by BD” engagements. ",
                    "links": [
                        "https://gov.gitcoin.co/t/update-gitcoindaos-adopted-purpose-and-essential-intents/10984",
                        "https://gov.gitcoin.co/t/update-gitcoindaos-adopted-purpose-and-essential-intents/10984/1",
                        "https://gitcoin.co/blog/how-to-maximize-your-matching-with-gitcoin-grants/",
                        "https://gov.gitcoin.co/t/gitcoin-digest-32-2022/11446"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.655555555555556
                }
            ]
        }
    ],
    "group_index": "184"
}