{
    "poll_list": [
        {
            "id": "0xe0c6d911e8c06e8ed28071ebfe84d8dfa90c1381dbfc0f3a6ccdb96ec3147de6",
            "title": "Ratify the Results of Grants Round 13 and Formally Request the Community Multisig to Payout Matching Allocations",
            "discussion": "",
            "body": "We ask our Community Stewards to ratify the GR13 payout amounts as being correct, fair, and abiding to community norms, including the judgments and sanctions made by the Fraud Detection & Defense workstream.\n\nFor further info & final GR13 results, see this forum post: https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-13-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/10278/8\n\nPlease vote FOR or AGAINST.\n\nFOR: Ratify the round results\nYou ratify the results as reported by Gitcoin Holdings & the Fraud Detection & Defense workstream and request the keyholders of the community multisig to payout funds according to the GR13 final payout amounts through the non-custodial GR13 deployment contract.\n\nAGAINST: Request further deliberation\nYou do not ratify the results and request keyholders of the community multi-sig wallet to delay payment until further notice.",
            "choices": [
                "FOR",
                "AGAINST"
            ],
            "scores": [
                3402722.627297879,
                14.640199999999968
            ],
            "start": 1649339067,
            "end": 1649771100,
            "snapshot": "14539071",
            "state": "closed",
            "author": "0x894Aa5F1E45454677A8560ddE3B45Cb5C427Ef92",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-13-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/10278",
            "title": "[Proposal] Ratify the Results of Grants Round 13 and Formally Request the Community Multisig Holders to Payout Matching Allocations ",
            "index": 10278,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#1",
                    "likes": "11",
                    "time": "01/04/2022-00:28:17",
                    "content": "We ask our Community Stewards to ratify the GR13 payout amounts as being correct, fair, and abiding to community norms, including the judgments and sanctions made by the Fraud Detection & Defense workstream. The full list of final results & payout amounts can be found here. We would like to suggest voting on Snapshot to begin on Tuesday, April 5th in advance of payouts being made on Friday, April 15th.  Options to vote on:  Ratify the round results  You ratify the results as reported by Gitcoin Holdings & the Fraud Detection & Defense workstream and request the keyholders of the community multisig to payout funds according to the GR13 final payout amounts through the non-custodial GR13 deployment contract.  Request further deliberation  You do not ratify the results and request keyholders of the community multi-sig wallet to delay payment until further notice.  TLDR from the GR13 Results Post:   Grants Round 13 (GR13) ran from March 9-24, 2022   Over $4.6M will be distributed to public goods as part of the round, of which $3.2M came from the combined matching pools and $1.4M was contributed by the community.   GR13 featured 13 rounds:  The main round Nine ecosystem rounds: ENS, Radicle, NFT Ecosystem, Uniswap, ZKTech, Polygon, Open Gaming, Algorand and Olympus Three cause rounds: Climate Solutions, Human Longevity, and Support for Ukraine    In GR13, we continued on the same main pool structure as GR12 – in GR12, the community chose to pilot a single pool approach with a 2.5% maximum cap for the main round rather than a category-based setup. GR13 featured the same structure, which again was largely successful in distributing funding to a broad set of projects.   In both GR12 and GR13 side round matching pools had approximately double the total funds as the main pool. We’re excited to see continued momentum with supporting ecosystem & cause rounds as we head into GR14.   Also, stay tuned for FDD’s upcoming Governance Brief for a sybil detection overview. For questions, comments, or concerns on any of the above, please comment below or join the Gitcoin Discord . ",
                    "links": [
                        "https://gitcoin.co/blog/grants-round-13-round-results-recap/",
                        "https://discord.gg/cD6RKWjZ6g",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326"
                    ],
                    "GPT-summary": "The author of the proposal is asking the community to ratify the results of Grants Round 13 and formally request the community multisig holders to payout matching allocations. The post provides details about the grants round, including the amount of funds distributed and the structure of the pools. The author suggests two options for voting on the proposal and invites questions, comments, or concerns. The post does not contain any advertising or collaboration requests.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.1457403273809526
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/04/2022-16:12:11",
                    "content": "It looks okay to me. Thank you for your hard work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "3",
                    "time": "05/04/2022-17:22:31",
                    "content": "Here is the G13 Governance Brief. GR13 Governance Brief ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#4",
                    "likes": "0",
                    "time": "06/04/2022-02:04:02",
                    "content": "Thank @annika for your hard working. The final results look good to me Thank FDD team and all of the team members coordinations ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/KrisJ",
                    "index": "#5",
                    "likes": "0",
                    "time": "06/04/2022-06:52:38",
                    "content": "Looked through the results, really glad to see healthy allocations to some really great projects this round. Nothing looks out of place to me. I support the allocations as outlined. Great work as always! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.6
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/04/2022-01:13:13",
                    "content": "I support ratifying the round results.  Thanks @annika for sharing these results and congrats to the entire team on another successful GR! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.171875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#7",
                    "likes": "0",
                    "time": "07/04/2022-03:14:26",
                    "content": "I support ratification of the GR13 results. Great job making it happen everyone! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/JTraversa",
                    "index": "#8",
                    "likes": "0",
                    "time": "07/04/2022-07:00:06",
                    "content": "Likewise  and thanks for all the extra effort from the team wrangling cats yet again. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#9",
                    "likes": "1",
                    "time": "07/04/2022-17:41:00",
                    "content": "Thanks for the brief! This also looks good to me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/OmnistratMatt",
                    "index": "#10",
                    "likes": "0",
                    "time": "07/04/2022-21:26:23",
                    "content": "I read there was a $30K cap on matching funds. What am I missing in the rules? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#11",
                    "likes": "1",
                    "time": "10/04/2022-14:52:54",
                    "content": "Heya, check this out: [Proposal] Gitcoin GR13 Matching Pool Allocations This might be where the $30k number came up in your mind, but it was just an example. The idea was really the 2.5% cap instead. Hope it helps!  Option 1: Main Pool @ 2.5%  Stick to exactly what we did in GR12. No individual grant’s matching contribution amount shall exceed 2.5% of the overall matching pool fund (i.e., $30K of the $1.2M pool). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.930555555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#12",
                    "likes": "1",
                    "time": "10/04/2022-17:15:33",
                    "content": "Just to clarify here - yes the core idea here is the 2.5% cap as @Fishbiscuit suggests, but $30K actually wasn’t just an example: $30K was the maximum any grant could raise in the main round in GR13 (2.5% * $1.2M main round pool = $30,000). That said, a grant could have raised funds from multiple rounds - for example, the Main Round and an Ecosystem or Cause Round (e.g., the Polygon Round, the Climate Round, etc.) which is why many have total match amounts well over $30K in the ‘Totals’ tab. To see the $30K cap in action in the results, go to the ‘Round-by-Round’ tab and scroll down to row 168 - you can see that the top grants in ‘gr13-gitcoin-main’ all have exactly $30,000 in matching. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.145424836601307
                }
            ]
        }
    ],
    "group_index": "45"
}