{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/where-is-the-fire-around-this-fire/10664",
            "title": "Where is the Fire Around this Fire? \\xf0\\x9f\\x94\\xa5 ",
            "index": 10664,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "11",
                    "time": "21/05/2022-01:49:57",
                    "content": "In 2016, I published an essay entitled WHERE IS THE FIRE AROUND THIS FIRE?.   Here it is:   A few years ago, I was at a small bluegrass music festival in the mountains of Colorado.  Nestled in a ridge next to a winding river, you could see a square mile of tents during the day, and you could see the milky way after the sun went down.  Late at night, after the music had ended, the festival attendees would circle around campfires near their tents for warmth. Our camp was visible on a stretch of path coming from a main throughway of the makeshift town.  An attendee wandered off the path towards our campfire, and joined a circle of 7 of us sitting quietly around the campfire.  After about 15 seconds, he proclaimed “Where is the fire around this fire?” and then wandered off.  I grabbed my friend who I was camping with, and we followed him.  To other campfires; that had live music, drinking, laughter, games, dancing, or storytelling.  We all had campfires, but those other camps had fire around their fires.  Sometimes I remember that guy who wandered into our camp and asked “Where is the fire around this fire?”.  I think of this story, in particular, when I meet an engineer who is on a team that has all of the things that people often think are prerequisites for a startup; capital, a ping pong table, an office, a roadmap, and a handful of engineers.  But are lacking in intangibles like a sense of purpose, trust between team members, trust in leadership, accountability, commitment, or attention to results. I’ve been on teams that have had fire, and those that have had a fire around their fire.  With the gift of hindsight, I always look at the former as times in which I should have moved on sooner.  And the latter; a time at which I reached an apex of happiness, self-actualization, impact, or learning. Is there a fire around your fire?   This story is from 2012 but the blog post was published in 2016.  Those were simpler times.  When the flaws with the epoch of web2 were not so readily apparant to us all.  Before pestilence ravaged the land. .  Before heartbleed.  Before we were all so goddamn angry and so polarized all of the fucking time.  It is now 2022, and wow have things changed. Here we are - We are all building web3 - a decentralized, untamperable, open source, programmable, financial system. Hopefully a better financial system.  Imagine a decentralized, untamperable, open source, programmable resource allocation system for humanity that  is better for us Solarpunks because it is regenerative. is better for cypherpunks because it is more privacy & sovereignty preserving. is more lunarpunk because it is both privacy preserving & regenerative.  One way we’ve talked about this in the past is “The Quadratic Lands” - a place where we’ve rewritten the laws of economics for the better:      But the question remains “how do we get there?”.  How will we build the vessel to the Quadratic Lands? As Gitcoin seesaws between building this vessel & traveling in it, back and forth between the bull market & bear market, between its north stars of more impact & more decentralization, and between pragmatism and idealism, it has been a pleasure to see it grow, learn, and begin to grow up + make decisions on it’s own.  It has been a pleasure to get to know many of you individually - so many people here have enriched my life in so many ways, I can’t help but brim with gratitude to each of you. As the market turns bearish, and as we have to have hard discussions with one another, please remember that Gitcoin has survived a bear market before.  It has high Lindy.   Lindy just means “the longer a period something has survived to exist or be used in the present, it is also likely to have a longer remaining life expectancy”. The Lindy effect is probabilistic way of determining from the outside whether something is going to survive. But it is not the only indicator.   twitter.com    Matt Huang @matthuang  The most important long-term fundamental indicator for crypto/Web3 is the quality of talent inflows.  Not only are the inflows still strong despite a jittery market… but they appear to be accelerating as many Web2 stock packages are down 50-80%.  “The Great Migration of 2022”   9:11 AM - 15 May 2022           1.4K                218            The primary indicator is people.  Talented people follow purpose.  Talent follows opportunity.  talent pursues it’s apex of happiness, self-actualization, impact, or learning. It is with that in mind that I must say that I hope we keep the fire around the fire. And if we can’t do that, I hope we can keep the fire burning. Because it’s not just the GitcoinDAO fire that we are keeping alive.    It’s the mission.  It’s the impact.   twitter.com    Ξwocki (🤖,💚) @owocki  Bull Market Gitcoin Grants is hella fun, but dont forget about Bear Market Gitcoin Grants!  Bear Market Gitcoin Grants aims to be a Pilot Light for the ecosystem through the long bear market.   10:42 AM - 11 Mar 2021           18            If we want to be a pilot light for the ecosystem, we have to find a way through the bear market. Because the QF Mechanism is an artery to an entire network of projects & people who depend on us.  Screen Shot 2022-05-20 at 7.23.33 PM1920×1074 112 KB  Some of those projects will really need the funding from Gitcoin Grants’s community during the bear market.   twitter.com    Lefteris Karapetsas | Hiring for @rotkiapp @LefterisJP  🐻You know it's a bear market when token projects are going back to @gitcoin / @GitcoinDAO for funding.  💩   5:25 AM - 19 May 2022           62              twitter.com    Ξwocki (🤖,💚) @owocki  @LefterisJP @gitcoin @GitcoinDAO im pretty proud of this.  bear markets is when projects need the funding to keep BUIDLing   5:25 AM - 19 May 2022           17            I don’t expect that everyone will stick around the GitcoinDAO campfire.  And I don’t begrude those who will leave.  There are plenty of good reasons to leave.  Maybe you will take a peace of our mission, skills, relationships you got from Gitcoin with you where you go. There are also plenty of good reasons to stay.  The pay might not be as good.  The hours might be longer.  The glory will be delayed, gratification no longer instant.  There will be hard times.  But the mission will remain at the center.  And the momentum towards Grants 2.0 is starting to build.  We are starting to figure out what we want to be when we grow up. The most important thing is that you decide if you want to stay and keep contributing.  You know whats best for you + your priorities.  I do have one small ask tho: if you do decide to stay or a small part of you does stay, please do keep the fire burning + if you can, the fire around the fire burning. Fire requires oxygen + fuel and it gives off heat.  It needs to be fed & cared for.  If it is, fire is a schelling point . Around it a beautiful culture of music, drinking, laughter, games, dancing, or storytelling can grow.  And it can evolve.  It can shrink.  It can then grow again. A DAO is not dissimilar. Our mission is the spark, and the QF protocol DAO around it is a crypto economic schelling point.  Around it a beautiful culture can grow.  It will evolve.  It can generate true companionship, learning, growth - it can be a place to come of age - both individually and for the ecosystem.  But only if we choose it. Whatever direction the DAO goes, I hope there is fire around the fire.  And if we can’t do that, I hope we can keep the pilot light alive.  And if we can’t do that, I hope that some of the fire from GitcoinDAO is carried forward in each of you in whatever you do next.  Screen Shot 2022-05-20 at 7.03.56 PM910×598 277 KB  ",
                    "links": [
                        "https://greenpill.party",
                        "https://twitter.com/owocki/status/1496519714952130570",
                        "https://www.youtube.com/watch?v=mTU6J4WTPtk",
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855",
                        "https://en.wikipedia.org/wiki/Lindy_effect",
                        "https://twitter.com/matthuang/status/1525871531070435328",
                        "https://twitter.com/matthuang/status/1525871531070435328",
                        "https://twitter.com/matthuang/status/1525871531070435328",
                        "https://twitter.com/matthuang/status/1525871531070435328",
                        "https://twitter.com/owocki/status/1370082730860408833",
                        "https://twitter.com/owocki/status/1370082730860408833",
                        "https://twitter.com/owocki/status/1370082730860408833",
                        "https://twitter.com/owocki/status/1370082730860408833",
                        "https://twitter.com/LefterisJP/status/1527264240578486276",
                        "https://twitter.com/LefterisJP/status/1527264240578486276",
                        "https://twitter.com/LefterisJP/status/1527264240578486276",
                        "https://twitter.com/LefterisJP/status/1527264240578486276",
                        "https://twitter.com/owocki/status/1527283389996277761",
                        "https://twitter.com/owocki/status/1527283389996277761",
                        "https://twitter.com/owocki/status/1527283389996277761",
                        "https://twitter.com/owocki/status/1527283389996277761",
                        "https://gov.gitcoin.co/t/proposal-for-a-weekly-grants-2-0-progress-thread/10612",
                        "https://gov.gitcoin.co/t/the-impactdao-protocoldao-sandwich/8944",
                        "https://gov.gitcoin.co/t/the-gitcoin-gitcoindao-egregore-is-emerging/8200",
                        "https://gov.gitcoin.co/t/gitcoindaos-final-form-maximum-coordination/10605",
                        "https://gov.gitcoin.co/t/roadmap-to-gtc-utility/10546",
                        "https://gov.gitcoin.co/t/lessons-about-impact-networks/10305",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://gov.gitcoin.co/t/8-ideas-for-dao-work-maximum-coordination/10483",
                        "https://gov.gitcoin.co/t/a-dao-has-no-ceo/9852",
                        "https://gov.gitcoin.co/t/gitcoindao-as-a-generator-function-for-coordination/10078",
                        "https://gov.gitcoin.co/t/gitcoindao-meta-coordination-of-culture-capital/8437",
                        "https://primer.gitcoindao.com/",
                        "https://gov.gitcoin.co/t/tldr-reinventing-organizations-teal/10638",
                        "https://gov.gitcoin.co/t/harnessing-collective-intelligence-for-workstreams-with-radicalxchange-voice/10024/6",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-19-2022/10737"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.037857991681522
                }
            ]
        }
    ],
    "group_index": "110"
}