{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/community-created-quadratic-voting-nft-to-fund-public-goods/7390",
            "title": "Community-Created Quadratic Voting NFT to Fund Public Goods! ",
            "index": 7390,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/haywyer",
                    "index": "#1",
                    "likes": "6",
                    "time": "26/06/2021-19:30:06",
                    "content": "In 2017, a social experiment was launched on Reddit in the form of a subreddit called “place”, which contained a collaborative pixel art canvas, where a user could place a pixel every five minutes. The resulting artwork (and time lapse Reddit Place (/r/place) - FULL 72h (90fps) TIMELAPSE - YouTube) was both stunning and an insightful look at social cooperation on the internet. I think it would be extremely interesting to create a pixel art canvas that utilizes quadratic voting to determine pixel color and in which the 90% of funds used in voting are directed to Gitcoin’s treasury to fund grants, and 10% go to the creators. The artwork could ultimately be listed as well and sold for the same purposes. I haven’t made an official proposal yet, because I’m interested in getting feedback on this idea. Let me know as well if this is something you might be interested in contributing to. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.064814814814815
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/zyks678",
                    "index": "#2",
                    "likes": "2",
                    "time": "27/06/2021-02:54:36",
                    "content": "This is a very good proposal, NFT is a very good trend, and we should embrace it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.549999999999999
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#3",
                    "likes": "2",
                    "time": "27/06/2021-15:52:32",
                    "content": "Hey @haywyer, if you haven’t already I’d highly encourage you to check out moonshotcollective.space and join the workstream @owocki and @austingriffith have put together for building out these kinds of experients. Love the idea here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/haywyer",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/06/2021-20:30:22",
                    "content": "thanks @ceresstation , I will check it out! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "508"
}