{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/the-gitcoin-gitcoindao-egregore-is-emerging/8200",
            "title": "The Gitcoin/GitcoinDAO Egregore is Emerging ",
            "index": 8200,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "36",
                    "time": "10/08/2021-17:20:46",
                    "content": "This post is designed to provide some food for thought on GitcoinDAO - where it’s been, where it is not, and where it’s going. I’ll propose some ways of thinking about Gitcoin that I think will hopefully help us separate signal from noise, & help us focus on what’s most important - achievement of our mission of building digital public goods Warning: This post packs my 4 yr of xp in working on Gitcoin down to 6-7 pages.  Itsa 10-15 min read.  Disclaimer Not financial or tax advice. This post is strictly educational and is not investment advice or a solicitation to buy or sell any assets or to make any financial decisions. This newsletter is not tax advice. Talk to your accountant. Do your own research.  The Gitcoin Egregore  (an Egregore - a shared psychic manifestation occurring when any group of humans shares a common motivation) This post is an attempt at sketching the Gitcoin Egregore in as much detail as possible. Anon asks “What’s an Egregore?” Great question, anon. From Wikipedia:  Egregore is an occult concept representing a distinct non-physical entity that arises from a collective group of people. Historically, the concept referred to angelic beings, or watchers, and the specific rituals and practices associated with them, namely within Enochian traditions.   More contemporarily, the concept has referred to a psychic manifestation, or thoughtform, occurring when any group shares a common motivation—being made up of, and influencing, the thoughts of the group. The symbiotic relationship between an egregore and its group has been compared to the more recent, non-occult concepts of the corporation (as a juridical person or legal entity) and the meme.   What’s the most Essential? Being Mission-first. In thinking about what’s truly important for Gitcoin and the communities it serves, I’ve been reading a lot about Essentialism recently.  Basically the art of doing less stuff, but doing more important stuff. The idea is that by focusing on less things, but doing more important things, and by doing a better job of them, we can create more impact. For me, the impact that I want to see us create is stated in Gitcoin’s mission - to build and fund digital public goods; to support Open Source and Open Economies.   All of this has prompted the question what is truly essential for us to scale our ability to achieve our mission? I’d love to share my 002 wei on what is truly important.  That being said, please know that these are just my opinions.  I am one node in the Gitcoin DAO network. This is data designed to share my sense-making, sharpen my own thinking, and to cross-pollinate ideas to/from others. Others should propose their egregore and/or their most important thing.  If you disagree with my thinking, you should fork & extend my thinking!  The 3 big Optimization Problems As an engineer, I think a lot about optimization problems.  In computer science and economics, an optimization problem is the problem of finding the best solution from all feasible solutions.  It’s the process of finding a global maxima by traversing a design space. These are the three big optimization problems I think Gitcoin/GitcoinDAO could focus on to achieve its mission.  1. Ecosystem Impact. How much positive ecosystem impact are we having? Basically, how many builders are we supporting?  How many builders have we helped find new earning, learning, connection opportunities in the Open Internet?  How many builders have quit their corporate jobs to work on open source?  How many are staying in the ecosystem because they are partially or fully supported by Gitcoin? I think of this like a funnel,  How many developers can we source new opportunities for? How many can we help select an opportunity that is a fit for them? How can we help funding opportunities sell themselves to developers?  How can we help developers sell their work to funders? How can we onboard them into ecosystems to produce positive impact? Once they are earning in these ecosystems, how can we retain them?   Screen Shot 2021-08-10 at 10.24.03 AM922×810 21.2 KB   2. Interconnectedness I am a big believer that It’s all coordination.  That as human beings , we are interconnected and interdependent on each other for survival.  How can we align our incentives better?  How can we deepen our ability to coordinate?  Surely if we can solve this, we can get closer to achieving our mission. As a way of aligning incentives and truly deepening our ecosystem impact, I envision a DAO of DAOs - a mesh network of interconnected projects that all rise and fall in utility together.  This DAO of DAOs would deeply interoperate with each other from a software/culture and perhaps even by swapping governance rights with each other.  Screen Shot 2021-08-10 at 10.29.38 AM1180×984 74 KB   3. Decentralization I am extremely proud that when Gitcoin launched in 2017, we were focused on our core mission of economically empowering software engineers to build/fund public goods.  We ignored the trend of the time, which was to write a lengthy whitepaper and do an ICO. As a result, we have had a ton of positive impact on the world.  It was an amazing feeling at EthCC to have 2 dozen hackers from across the ecosystem come up to me to shake my hand and say “hey Gitcoin had an impact on my life, awesome.”.   It feels great to have helped facilitate the delivery of $26mm to OSS devs across the world. But, the negative result of the 2017 tradeoff is that Gitcoin has some centralization debt.  In the 2017-2020 market cycle we swept decentralization under the rug to focus on impact. Given that Gitcoin has now had a positive impact, there is now actually something to govern.  We want to adhere to ecosystem best practices  Antifragility - Would Gitcoin’s impact and mission endure if Kevin got hit by a bus? Credible Neutrality - Are Gitcoin’s software & governance systems credibly neutral - eg are the mechanisms provably fair to all parties?  Right now the answer to these questions is no.  So I believe that now it is time to pay down that decentralization debt and make Gitcoin more credibly neutral and antifragile. That means finding practical and regulatorily compliant ways of decentralizing the governance of the network, computation of the network, development of the network, and the economics of the network.  Screen Shot 2021-08-10 at 10.36.06 AM1130×818 17.5 KB   How do we get there?  Network Effects I’m a big believer in network effects.  The more funders that are available in the Gitcoin network, the better the network is for community members.  The more community members are in the network, the better it is for funders. As this flywheel spins, we’re able to create impact, pull more data, and create more legitimacy.   Events One of the ways we’ve been successful in getting more people using Gitcoin is by running hackathons, KERNEL programs, and Grants Rounds.  Each of these products  (1) solve a problem for network participants and (2) support our core mission in their own way, and together they spin the flywheel of Gitcoin network effects by giving community members and funders a reason to deeply engage with Gitcoin at least once per quarter. Right now these events are running through Gitcoin (the company), but it’s possible that one day these can be run through the DAO.  Screen Shot 2021-08-10 at 1.59.09 PM1878×778 68.4 KB  Fun design prompt:  “What would dEvents on the Gitcoin network look like?”.  Governance Over the past 2-3 months, since the DAO launched, we have seen the emergence of a new group of leaders in the DAO ecosystem.  These leaders have been granted the governance rights of the network, laying the ethical foundation for a group of decision makers to make decisions with high legitimacy about how to action initiatives that support our shared mission.  E2ey1M8UUAYFRpR2070×1596 136 KB  Consent of the governed is the only legitimate basis for governance. Gitcoin’s choice to decentralize our platform’s governance to a DAO will fully empower the community to govern itself. We aim to depart from the extractive networks that have been built in web2.  The Facebook’s, the Uber’s, the Upwork’s of the world all worked really hard to attract us in their early days, and then when they became inevitable via their network effects, they worked hard to trap us and to extract from us. By building a DAO that is governed by users that it serves, we aim to break this extractive pattern.  In GitcoinDAO, we hope to attract members and then enable them, which will allow us to grow larger, faster, and be a better force for good in the world.  kyle_chart1000×563 35.5 KB   DAO Workstreams We have also seen the launch of several workstreams within the DAO, each proposed by individual community members of their own volition, focused on their own ends.   Decentralize Gitcoin - a group of builders focused on decentralizing Gitcoin’s software stack, starting with Grants.  Moonshot collective - a group of builders focused on rapid prototyping software tools for the DAO and for the ecosystem.  Anti Fraud - a group of community members focused on preventing fraud in Quadratic Funding  Stewards - the group focused on governing GitcoinDAO end-to-end.  Public goods funding/treasury management - the workstream focused on an infinite time horizon for our mission  MMM - a decentralized memes, merch, and marketing workstream.  With the advent of these workstreams, a structure has emerged:  Screen Shot 2021-08-10 at 8.24.16 AM632×540 20 KB  Through the course of these workstreams running for the last 3 months, we’ve begun to see the emergence of software built in a new way. The first (and in many ways most important) thing to be built by the DAO has been dGrants -a decentralized version of Gitcoin Grants.  Screen Shot 2021-08-10 at 8.16.47 PM1122×708 70.9 KB  Note that the products built in the DAO are the first Gitcoin products to not be built in the centralized monorepo.  They are products that instead are built through the DAO, and they leverage the principles of  Simplicity - products that do ONE THING and do it WELL. Antifragility - Well-documented Decentralized products that our community can run and fork without us. Modularity - products that easily unix-style interoperate with each other.  And perhaps most important for adherents to Conway’s Law - which states that any organization that designs a system will produce a design whose structure is a copy of the organization’s communication structure, Teams are funded by the DAO and spun up 1:1 with each modular product they create. That is a big departure from the products built in the HoldingCo from 2017-2021, which were  monolithic not forkable cumbersome to maintain or even unmaintained high in overhead to managing/maintaining all bundled together, and right now Hackathons subsidizes everything else.  One of my big realizations in Q2 2021 is the way the HoldingCo built software in 2017-2021 WILL NOT SCALE.  We were moving too slow with too high overhead.  We needed a new way to build software and a new coordination mechanism to build to DAO-first in a Simple, Modular, AntiFragile way, and that’s where the Moonshot Collective and Decentralize Gitcoin workstreams come in.  Screen Shot 2021-08-10 at 8.16.53 PM1134×914 105 KB  What I think  is super cool about building software in this way is how scalable it is.  Through the Moonshot Collective we’ve seen a half dozen new projects spring up, each with their own decentralized, modular, approach to solving a problem that exists in GitcoinDAO.  dKudos, dQuests - a decentralized version of Gitcoins existing tools. NFT Dance Off - a  tokenized dance off project that funds public goods Quadratic Trust - a project that leverages Quadratic Funding where the funding is your social capital not financial capital dPopp - a decentralized Sybil resistance aggregator Quadratic Diplomacy - a p2p tool for communities to fund each other.  The Moonshot Collective and Decentralize Gitcoin workstreams provide a scalable and decentralized way for the Gitcoin ecosystem to buidl software for itself. But arguably, we should not be stopping at building new software in a decentralized way.  Screen Shot 2021-08-10 at 8.18.32 PM1920×1379 130 KB  I think our model of GitcoinDAO of DAOs could be further extended if Gitcoin was to swap governance rights with other projects in the ecosystem, thus enhancing the interconnectedness of Gitcoin to the ecosystem and the ecosystem back to Gitcoin.  This allows us to interconnect with the ecosystem in a deeper way than has been done in the past.  Roadmap There’s an old cliche that “Rome wasn’t built in a day”. The same is true of Decentralized Gitcoin.  It’ll take time for this opportunity to unfurl.  There will be setbacks, there will be breakthroughs.  There will be tears of sorrow and there will be tears of joy.  In the end, we will prevail because our mission is worth it.  Screen Shot 2021-08-10 at 10.54.39 AM1454×946 68.8 KB   Where to from here?  Roughly, I envision growth in the following phases:  phase 1 - stabilize governance phase 2 - expand impact & begin to scale phase 3 - become fully antifragile & scale impact  I would love to work with the ecosystem stewards on defining specifics of what these phases look like.  Ultimately it is up to the stewards to make binding decisions about how the network is governed (which means the substance and form of proposals that shape these phases) - I am here only to advise and to LARP as visionary. Speaking of vision, I’d love to share some ideas of what the world looks like if we succeed.  Long term, What does it look like if we get this right? Here are a few assorted upside visions for how this could all play out. I present these scenarios to you to sharpen our thinking about GitcoinDAO and its place in the world over the long term.  GitcoinDAO could have a MASSIVE positive impact on the world one day, and thinking about that today can help us to coordinate to make that happen and to coordinate to avoid pitfalls.  Screen Shot 2021-08-12 at 6.43.07 AM1920×1065 140 KB  Please keep in mind as you read these visions that we would need to coordinate to get to any of them - all coordination is a choice - and no outcome is guaranteed.  A -large experiment in Quadratic Funding Quadratic Funding is at the heart of our mission to build/fund public goods.  Having   run 10 rounds of Gitcoin Grants worth $13mm, experimented with taking QF to main street partnered with Open Collective to take QF to web2 building a decentralized Grants protocol  We are one of the largest experiments in Quadratic Funding in the world, which will hopefully help inspire others to build QF tools (or other public goods funding tools) Another positive externality from the QF work we’ve done is the data.  There is a ton of great data about what public goods are valued by the communities they serve, which could be useful in many different places. Some stats:   In Q2 2021, Gitcoin facilitated $5.0m in value transfer. That’s about $2.3k/hour, for every hour during Q2 ($10521/business-hour).  Since its 11/2017 launch , Gitcoin has helped 33,266 funders reach an audience of 187,659 earners. Gitcoin has facilitated 679,296 complete transactions to 9,114 unique earners (as of Aug 2021)   Screen Shot 2021-08-12 at 3.25.56 PM1760×1006 87.5 KB   Screen Shot 2021-08-12 at 3.25.37 PM1658×614 65.9 KB  Here is an example dataset that shows the 250k contributions from the contribution graph (grants/users are nodes, edges are transactions) from GR10:  Screen Shot 2021-08-11 at 11.43.46 AM1920×1540 147 KB   B. A funnel of developers for the web3 ecosystem. If you want to build a developer ecosystem, then you’re going to need access to developers.  Everyone and their brother is building a blockchain-based ecosystem, and there aren’t enough developers to go around. What if we could build a giant funnel of developers who are entering the ecosystem and learning, earning, and connecting with each other along the way?!?  C. We are funding open source software. Open Source Software creates $500bn/year in economic value.  But software engineers who work on it don’t have a business model, so many don’t work on open source software. What if we could flip the script and offer the ability for 10000s of software engineers to work for the open internet?  D. A story of “What comes next for web3 after DeFi” At ETHcc this year, Vitalik spoke at length about what comes after DeFi in the Ethereum space. How timely, We are just starting to meme the idea of Regen Finance into the world! I think that public goods funding is possibly one of the great 10x use cases of Ethereum.  After all we’ve got programmable money, and we value public goods, could we not build economic systems that fund public goods?  E. Pump the network effects of the web3 social graph One of the reasons that web2 applications have not been able to be disrupted by web3 yet is their network effects. There are simple too many drivers on Uber, too many workers on LinkedIn, too many eyeballs on Facebook for a web3 solution to be meaningful. But that can change with the introduction of Decentralized Reputation tools like Ceramic Network and SpruceID. For the first time ever, user identity can be transportable across networks.  You can take your identity from web3 dApp 1 to web3 dApp2. This is a BIG deal for disrupting the network effects of web2 apps.  If Gitcoin were to jumpstart the web3 social graphs network effects by uploading its millions of transactions worth of data (in a way consistent with its privacy policy of course), it could jumpstart the web3 social network.  We need to decentralize Gitcoin’s database anyway, so why not?  F. Catalyze the solving of ALL Coordination Failures OK this is the biggest idea, and it’s a little META.  But just for fun, hear me out.  Evvdt4eUYAAxWzt512×512 50.2 KB  The Greatest LARP is the fight against Moloch - the God of Coordination Failure.   Moloch is the reason why coordination failures like open source funding, climate change, fake news, and 100s of other systemic problems exists Here is a first principles argument for how solving Open Source Funding could help solve dozens of other coordination failures and help us slay the God of Coordination Failure, Moloch:  1. Coordination Failures are THE most important unsolved problem Coordination Failures, like the underfunding of Open Source Software or the prevention of climate change – are the “deep why” behind my web3 community members’ participation in the web3 space.  2. Web3 is a big deal. With Web3, we have new tools to solve Coordination Failures Web3 in a transparent programmable immutable global economic substrate, upon which coordination mechanisms will be built.  3. Software is Eating the World. We are riding the wave. At a time when “software is eating the world”, solving software-based coordination problems is where we start solving global coordination problems. If we can start with solving coordination failures within software ecosystems, we can create a model for the rest of the world to reinvent the funding of public goods and therefore create momentum for solving all sorts of coordination problems.  4. We start by solving Web3 Coordination Failures A possible vision for how to solve software-based coordination problems:  GItcoinDAO is building a generator function – a function that generates other functions – for solving coordination problems. GitcoinDAO is being dogfooded with its first two coordination tools – Gitcoin Grants and Gitcoin Hackathons.  The end result is a DAO of DAOs, an interconnected fabric of DAOs with aligned incentives and dozens of coordination tools that enhance inter-DAO coordination and intra-DAO coordination.  Screen Shot 2021-08-10 at 9.25.00 PM2362×1370 237 KB   G. A moonshot collective Ive been having a lot of fun running Moonshot Collective with Austin Griffith. Not only is it a lot of fun to hang out with other builders – it’s an amazing privilege and opportunity to be sitting at the intersection of so much talent, capital, and opportunities. What do we want to do with that? Let’s launch some moonshots!!  Checkout the launch announcement to get all the details.  Basically the idea is to create Coordination Tools that accelerate GitcoinDAO, other DAOs, and the space at large – and to channel more great developers into Gitcoin while we do it. Here’s some of the moonshots that the 100s of active builders in the Moonshot Collective have been pitching:  A LinkedIn Recruiter Killer where users own their own data but sell access to their contact info via a cryptographic protocol. A p2p DAO workstream reward mechanism.  Say you’ve got a DAO and 100 people working for it, this tool helps you decide who to reward for providing value in a decentralized (and convenient) interface. A partnerships marketplace.  If the future is a DAO of DAOs, they gotta find each other somewhere   A decentralized Sybil Resistance Aggregator which could serve as The web3modal of Digital Identity  Quadratic Trust - Quadratic Funding but with Social Clout instead of Money as the scarce resource. An NFT dance off tool where the proceeds go to funding goods Quadratic voting at the base layer of a DAO. Solutions for employment in a DAO, and determining how we entice “A Players” to join a DAO versus a tech firm? Constituent Management for DAOs - A way for “protocol politicians” to engage with people who delegate to them. A way to pull a coder of your specific choosing “down from the sky” for an instant mentoring session. There are dozens more pitches floating around, check out our backlog hereTrello   These are projects that the community has been working on in a decentralized manner.   While the projects themselves are an output of the Moonshot Collective, the actual process is an end in itself.  Screen Shot 2021-08-11 at 11.44.12 AM1624×1066 101 KB  We are moving each of these projects through an iteration loop of Hypothesis => Experiment => Results => Learning (repeat if successful, shut it down if not). Along the way, GitcoinDAO is bringing Capital, Talent, and Ideas to the table.  And Austin Griffith’s Scaffold.eth is being leveraged to make sure that the rapid prototyping is ACTUALLY RAPID!.  Screen Shot 2021-08-11 at 11.44.21 AM1752×1098 138 KB  The end result is a generalized innovation machine to build coordination tools, to market validate them, and (if successful), eventually grow and decentralize them.  BIG IDEA ALERT - Right now Gitcoin is known for Gitcoin Grants, which is based on a really powerful coordination mechanism, quadratic funding.  But what if instead of building ONE coordination mechanism, we built a generalized generator function of ALL coordination!!!   If GitcoinDAO can successfully be a Schelling point for builders of all types of coordination tools, then we could help solve some of the systemic coordination problems in the world.  H - A Crypto-Native United Nations Warning: This outcome is perhaps the least defined and the most hand wavey.  But I am providing it anyway to stimulate discussion. Given that Gitcoin is at the center of public goods, and has a wide basis of distribution of its tokens (tokens were dropped to the ETH community, Zcash community, a dozens of communities - including L1s, L2s, DEFI projects, and many other stripes – each whom have done hackathons/grants rounds with Gitcoin), GitcoinDAO has a potential to have a diverse set of candidates who have a stake in it. Gitcoin’s mission is global.  If you are a member of the crypto ecosystem, or of planet Earth, then you are consuming digital public goods and public goods respectively. If you zoom out and think about it, there is an inclusivity to that that is extremely profound. For GLOBAL public goods, the world perhaps need a modern (webscale) Schelling point to coordinate around some of the biggest problems that exist in coordination in the world today. One possible outcome is that Gitcoin becomes a kind of Crypto-UN.   This is perhaps far fetched, but Imagine a place where diverse sets of actors come together to coordinate – that can mean it’s where they find developers/creatives, they practice diplomacy (perhaps in the form of Governance rights swaps), they find live players who can work in their ecosystem, or perhaps engage in a way that is positive sum but has not been invented yet  After all, Ethereum is a hotbed of coordination, it is possible that the optimal webscale coordination mechanisms for global coordination have not been invented yet. Of course its sort of silly to call this outcome a “Crypto-Era United Nations”, which is a totally skeumorphic way of thinking about this problem space.  After all, we don’t call cars “modern horse and buggy-carts”.  This all begs the question “what diplomacy is in 2021+?”.  After all, the UN was built in the early to mid 1900s, and diplomacy in the Industrial age is certainly not how diplomacy will be practiced in the Information Age. BIG IDEA - If we truly believe It’s all Coordination, then it would make sense that we believe there will emerge a Schelling point - a common ground where different ecosystem actors can come together to practice diplomacy and coordinate deeply with each other.  I - EPCOT of the Metaverse  epcot-monorail-5x2900×360 89.8 KB  Do you know about EPCOT? No, not the one at Disney. I’m talking about the Experimental Prototype Community of Tomorrow. Not the one with flying cars and space ships, and all of the relics of early 1900s “tomorrow”. I’m talking about the EPCOT of the Metaverse.  A vision of tomorrow that is rooted in the minds of modern day web3.0 enthusiasts. BIG IDEA - Web3 is the bleeding edge, and Gitcoin is a Schelling point for builders, capital, and ideas to come together and build the future.   When I think about how this could all play out over the next 20 years, I can imagine that Gitcoin becomes a generator of new technology, * new coordination tools*, new art.  With all of that luscious entropy that will be a part of the metaverse, we could be an accelerant for an open-source values-aligned corner of the metaverse.   We could build a bat cave full of cool gadgets for metaverse goers.  Feedback welcome Like I said at the top, this is my 002 wei on what is truly important for Gitcoin and some straw man examples of how things could play out.  Please know that these are just my opinions – I am one node in the Gitcoin DAO network. This post is data designed to inform others’ thinking, and it is merely a way of sharpening my thinking and cross-pollinating ideas.   Others (and especially Stewards) please feel free to share your egregore, your most important thing, or your vision for this project.  If you disagree with my thinking, you should fork and replace and/or extend my thinking! Feedback welcome!   More Egregore Art An Egregore is a shared psychic manifestation occuring when any group of humans shares a common motivation. Just for fun, and to spur some imagination in the responses, I’m leaving you with some art that has inspired me while writing this post   Matt Chu -Egregore   The Daily Bestiary -The Egregore    Lightcode - The Egregore   Information Fields    Saatchi Art  ",
                    "links": [
                        "https://mattchu.co.uk/e-egregore",
                        "https://en.wikipedia.org/wiki/Egregore",
                        "https://en.wikipedia.org/wiki/Egregore",
                        "https://www.amazon.com/Essentialism-Disciplined-Pursuit-Greg-McKeown/dp/0804137382",
                        "https://gitcoin.co/mission",
                        "https://gitcoin.co/mission",
                        "https://gitcoin.co/mission",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/3/3c923874e44cb341daa71430aacc07d371655756.png",
                        "https://www.youtube.com/watch?v=KpXPym_m_wA",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/f/f80c6b49ef4bbaaa87ec5133cf7ab9b75db9c5db.png",
                        "https://gitcoin.co/mission",
                        "https://gitcoin.co/results",
                        "https://nakamoto.com/credible-neutrality/",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/6/66330e1ed7aac9d69caa31f0f333e72f53ff0a97.png",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/b/bd8d829d230715ad15fa342cce5959dc7e77e86c.png",
                        "https://en.wikipedia.org/wiki/Consent_of_the_governed",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/f/fed1cc939fa980d0b8007a64c081d6cb582e64fb.jpeg",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/9/9d60b6e395cb65b780d52471aaa3be773a009c63.png",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/b/bd356646e1c1260adaa3e2a6392af913c379779a.png",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/2/21e4e573518f2f5164ad0f683e82fb9264f55f01.jpeg",
                        "https://github.com/gitcoinco/web",
                        "https://en.wikipedia.org/wiki/Conway%27s_law",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/5/53f4ba34eedb14f7d70694989606ea642a94e62f.jpeg",
                        "https://moonshotcollective.space",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/e/e11f1139dec3fd410e7cd61a5002f5676faa3c49.jpeg",
                        "https://gitcoin.co/mission",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/4/473c9de2bc173069cdd5b4ba2089151d4b0bb7d0.jpeg",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/1/1025f3944518f2c9995f99f49066a6224bd8b20b.jpeg",
                        "https://wtfisqf.com/",
                        "https://gitcoin.co/results",
                        "https://medium.com/@katiebrenjohnson/downtown-stimulus-program-review-e89f67e29f4f",
                        "http://fundoss.org/",
                        "https://gov.gitcoin.co/t/how-to-contribute-to-decentralize-gitcoin/7157",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/9/9959f10174837b8764b7d636111634535d334ab4.png",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/d/d8fc3cb87f22193a3a124451d8fa29946421ef78.png",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/b/b93b504bbd644de04ba94a5608965d85d34faaf8.jpeg",
                        "https://gitcoin.co/learn",
                        "https://gitcoin.co/earn",
                        "https://gitcoin.co/connect",
                        "https://www.youtube.com/watch?v=rVcADOjLimA",
                        "https://www.youtube.com/watch?v=oLsb7clrXMQ",
                        "https://www.coindesk.com/defi-degens-funding-next-wave-open-source",
                        "https://www.investopedia.com/terms/n/network-effect.asp#:~:text=The%20network%20effect%20is%20a,of%20a%20good%20or%20service.&text=Initially%2C%20there%20were%20few%20users,military%20and%20some%20research%20scientists.",
                        "https://gov.gitcoin.co/t/request-for-proposal-decentralize-gitcoin-profiles/8116",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/6/68757e66a809ee95d6e9b286b63abf4997eb7a58.jpeg",
                        "https://www.youtube.com/watch?v=903tHM4RA9k",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/3/3322d4704ade1ce5ff7407f9a908207e08cdd5bb.jpeg",
                        "https://moonshotcollective.space",
                        "https://www.youtube.com/watch?v=KpXPym_m_wA",
                        "https://twitter.com/owocki/status/1420378124416524294",
                        "https://trello.com/invite/b/qDaciNgF/a5baf02df6aeb4260038a8d616d007bf/moonshot-collective",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/8/811cc378330e61ec044319c7d4702a929ec7ccfc.png",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/b/b5d24f20b4ef640c655345d2ff1b8445909cf3a2.jpeg",
                        "https://www.youtube.com/watch?v=903tHM4RA9k",
                        "https://en.wikipedia.org/wiki/Skeuomorph",
                        "https://www.youtube.com/watch?v=KpXPym_m_wA",
                        "https://en.wikipedia.org/wiki/Focal_point_(game_theory)#:~:text=In%20game%20theory%2C%20a%20focal,Strategy%20of%20Conflict%20(1960).",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/e/ef42e95877f7f1ec1e4234132739fa40d5e42f6d.webp",
                        "https://en.wikipedia.org/wiki/Egregore",
                        "https://en.wikipedia.org/wiki/Egregore",
                        "https://mattchu.co.uk/e-egregore",
                        "https://dailybestiary.blogspot.com/",
                        "https://dailybestiary.blogspot.com/2016/07/egregore.html",
                        "https://soundcloud.com/sskwanofficial/lightcode-the-egregore",
                        "https://tinyspeckoflight.com/information-what-is-an-egregore-good-or-bad/",
                        "https://www.saatchiart.com/print/Painting-Egregore/50937/3335567/view",
                        "https://gov.gitcoin.co/t/gtc-getting-to-know-gtc-summary-in-chinese/8353",
                        "https://gov.gitcoin.co/t/gitcoindao-the-gitcoin-gitcoindao-egregore-is-emerging-chinese-version/8364",
                        "https://gov.gitcoin.co/t/proposal-issue-clr-fund-a-40k-gtc-grant/8240/2",
                        "https://gov.gitcoin.co/t/a-brief-history-of-gitcoin-from-2017-2022/9431",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-7/8229",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-8/8357",
                        "https://gov.gitcoin.co/t/the-plateau-of-productivity/10269",
                        "https://gov.gitcoin.co/t/the-impactdao-protocoldao-sandwich/8944",
                        "https://gov.gitcoin.co/t/what-are-the-kpis-that-gitcoindao-optimizes-for/8497",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-aug-2022/8694",
                        "https://gov.gitcoin.co/t/ama-april-2022/10273/6",
                        "https://gov.gitcoin.co/t/where-is-the-fire-around-this-fire/10664",
                        "https://gov.gitcoin.co/t/our-flagship-product-is-gitcoindao/10081/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.883239790079154
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ntnsndr",
                    "index": "#2",
                    "likes": "9",
                    "time": "11/08/2021-02:15:45",
                    "content": "Thanks for this reflection and update, @owocki. It’s really good to know how things look and feel to you—although you’re one node, you’re sitting at a place with high visibility, and as someone with much lower visibility, it’s helpful to check my perceptions against yours. I think the interconnectedness logic you describe here is really interesting, while also potentially scary. Interesting in the sense of enabling lots of things. Scary in the sense of inhibiting the capacity of Gitcoin itself to have the kind of dynamism and range of motion that has made it successful. If it is being pulled in many different directions by diverse projects in its ecosystem, will it be able to continue flourishing? In the legacy of cooperatives, institutional co-ownership like this tends to work best when the business is relatively stable in its purpose, and that purpose is narrow and clearly defined. The costs of governance rise quickly if the cooperative is less clearly defined, and member entities are diverse in their interests and purposes. So, one question: Does Gitcoin’s purpose and direction feel stable and set, or is it something that needs to wiggle-room to evolve? Another way of framing this is to ask: What is the relative voice between workstreams and co-governing DAOs? For the project to remain vibrant and creative, I think finding a way to distinguish a) the stable infrastructure that the sub-DAOs govern through GitcoinDAO, and b) the vibrant core experimentation and development efforts like Moonshot’s work, which may before long start to scare off some child DAOs of the ecosystem who fear innovation puts their stake at risk. Anyway, thanks again for these reflections, and looking forward to more discussion here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.159259259259259
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "6",
                    "time": "11/08/2021-02:31:34",
                    "content": "Thank you for the thoughtful post Nathan.     ntnsndr:  If it is being pulled in many different directions by diverse projects in its ecosystem, will it be able to continue flourishing?   I think this is a really important question and I thank you for bringing it up. For me, the dependant variable is “what is the interface between GitcoinDAO and these other DAOs?  How big is its surface area?”  In my mind, the relationship looks like this:  GitcoinDAO supplies devs and dev reward tools to the other DAO, thus enriching the other DAO’s dev community. The other DAO supplies whatever their core asset is (eg, for BanklessDAO writers, for Radicle, p2p dev tools), thus enriching GitcoinDAO in the area of the other DAO’s expertise. There is an exchange of governance rights, which enables (and perhaps obligates) each DAO to participate in each other’s governance – creating antifragility in each DAO itself (everyone likes to have a squatter at the gym right? or a friend they can confide in)    What is the relative voice between workstreams and co-governing DAOs?   Hmm this interface doesnt feel like a workstream thing. I think that GTC token holders (or those whom they have delegated to) will have the most influence on sub-DAOs or sister-DAOs. Perhaps one way to reframe the question of relative voice might be “Of the 50mm in the GTC treasury, where should it all go and on what time frame?”   Does Gitcoin’s purpose and direction feel stable and set, or is it something that needs to wiggle-room to evolve?   Here are the three phases of maturity I think GitcoinDAO will see. phase 1 - stabilize governance phase 2 - expand impact & begin to scale phase 3 - become fully antifragile & scale impact  That said, I welcome a diverse set of perspectives on this question and so I think I will leave this question to others to grok and answer! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.834033613445379
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/andajun",
                    "index": "#4",
                    "likes": "2",
                    "time": "11/08/2021-02:56:27",
                    "content": "It’s a great article. You have a lot of ideas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nya-elimuai",
                    "index": "#5",
                    "likes": "7",
                    "time": "11/08/2021-20:31:56",
                    "content": "    owocki:  For me, the impact that I want to see us create is stated in Gitcoin’s mission - to build and fund digital public goods; to support Open Source and Open Economies.   @owocki An idea: Have you taken the time to sit down and write a list of current Gitcoin activities that do not fall within any of the three goals (Open Internet, Open Source, Open Economies)? I imagine that some of the activities that were initiated back in 2017 have become less relevant for the mission in 2021. You know this better than any of us, but perhaps some of the Gitcoin activities today are needlessly complex, and perhaps they are no longer necessary for achieving the mission. In my experience, stripping away complexity on a regular basis can be a good way to free up time/resources for more essential and mission-aligned activities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.469444444444445
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#6",
                    "likes": "5",
                    "time": "11/08/2021-20:36:53",
                    "content": "its a good exercise to ponder. so far – we’ve shut down a handful of things that werent working (gitcoin labs, codefund, bounties universe, our ENS subdomain handler, faucet, bounty requests, etc) and have plans to decentralize many of our tools that have gone uncared for (quests, kudos, avatar bulder, profiles, etc – more details here) for now, the core team is focusing on Gitcoin Grants + Hackathons.  as more operations are moved to the DAO we will need a scalable way of executing work (but only the important work – with important being defined by the stewards). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.635802469135802
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Developer-piyush",
                    "index": "#7",
                    "likes": "2",
                    "time": "12/08/2021-16:17:02",
                    "content": "    owocki:  Egregore   Thanks @owocki This is so great article with lots of new ideas that will impact this world in a huge way! I would like to have some thought on The Egregore, as per my understanding Egregore refers to group of individuals that have some psychic match in goals, thinking, enthusiasm etc. I would like to add some of my thought on this:   What if we can build a community of people where they can interact, build teams, communicate, explore, have competitions etc… Ex: Music concert: To arrange very excellent music concert team needs musicians, lyricist, managers etc…  Now through the following community of group of individuals steward can help to form a team of such individuals and managers. This will result in helping all the artists and can shake this world with so much of talents!   This is not only about music concerts: this can be applied to everywhere education, finance, sports, concerts, film industry, health, fitness and what not. This will also help individuals to explore as much as they can in the community!   As we all know sometimes human nature wants to do a lot in life but due to lack of collaboration skills and unable to build friendship with smarter people, results in lack of talent to this world and with time this world loses lots of bright minds… Following community will help to consume every talent and give individuals power to do something for themselves as well as for this world. I will write more on this with time.  After having my finances in place i will launch something like this in my country soon and then will expand this to other countries. This idea came to my mind after i saw lot of students being stucked in a cycle like me and unable to explore themselves in a right way and ultimately results in depression and self doubt! This community will also take the group of individuals to different places where they will meet high profile individuals, explore greatness of world and help them to see more of themselves. Thank you PIYUSH CHOUDHARY Profession: University Student ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.786415584415585
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wizardjuan",
                    "index": "#8",
                    "likes": "5",
                    "time": "12/08/2021-18:35:34",
                    "content": "Thank you @owocki for clearly communicating Gitcoin’s mission, the evolution from Gitcoin to the DAO and where things currently stand. As someone new to this community, this is highly valuable information! As I said, I am new here and really excited that I’ve stumbled across this corner of the ethereum community. This is the first time that I’ve come into contact with other like minded individuals concerned with the more civic applications of distributed ledger technology and all that it entails. It’s also the first time that I’ve seen philosophers quoted and not just lame copy pasta content. We’re talking the likes of heavy hitters such as Benedict Anderson and Hannah Arendt. Honestly, I’m floored and want a seat at this table in whatever shape or form that takes and to whomever will host me. I hope to be useful cause I think I found the best table in the entire place. Thinking big with mighty aspirations, I like it a lot and believe it to be critical to our collective future. Zooming in this past week I’ve had the chance to check out what Gitcoin is up to on a more granular level. Reading your writing @owocki and having spent, however limited, time in some workstreams this week, I am impressed with the enthusiasm and progress that’s being made. As Gitcoin continues to decentralize and we see sub-DAOs or DAOs of DAOs, I am wondering if it would be effective to utilize the communication strategies of another DAO - MakerDAO. Instead of providing a lengthy explanation I’ll just link the thread here from one of Makers community members; https://twitter.com/Davidutro/status/1422549028760219651 Excuse me if this has already been discussed or if I’m missing any key information. Other, more meta open-ended questions, that I’m asking myself reading through this post are; the importance of thinking about the intended outcome of one’s efforts. As it relates to crypto, I can’t help but think about the original cypherpunks and their libertarian intentions. An adversarial stance towards the state and towards their institutions. COVID-19 has proved that global coordination is not only important, it’s essential for the future survival of the human species. As does climate change. Without entirely going down the rabbit hole, point being, it’s interesting to think about all the possible applications of distributed ledger technology from another political stand point - one that seeks to improve our decision making capabilities in solving problems that are of the public interest. Or another topic that I’ve seen discussed in this community; regenerative finance vs extractive finance. Incredible. I feel lucky to have been directed to this community and hope to throw my hat in the ring in a meaningful way. Thanks for all the food for thought and looking forward to more. LFG! - JohnSzcz ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.890407647907647
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#9",
                    "likes": "4",
                    "time": "17/08/2021-09:14:11",
                    "content": "Hi all! We will be hosting an AMA with @Owocki this Friday on this post and the discussion it has generated.  Share your questions in advance on the #ama-egregore-channel on Discord: Gitcoin  Event details can be found here: AddEvent ",
                    "links": [
                        "https://www.addevent.com/event/Xc8147874"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/sophyjennb",
                    "index": "#10",
                    "likes": "1",
                    "time": "22/08/2021-13:08:53",
                    "content": "Well written. Very educative, insightful and informative. Thanks for this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ],
    "group_index": "550"
}