{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-program-alpha-round-grantee-invite-lists-eligibility-criteria/12538",
            "title": "Gitcoin Program Alpha Round Grantee Invite Lists & Eligibility Criteria ",
            "index": 12538,
            "category": [
                "\\xf0\\x9f\\x8c\\xb1 Grants"
            ],
            "tags": [
                "grant-eligibili",
                "Grants2",
                "grants"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/koday",
                    "index": "#1",
                    "likes": "7",
                    "time": "11/01/2023-00:05:32",
                    "content": "***Note: If you think your grant might be eligible for one of these rounds, reference the Open Source Software & ETH Infra invited grant list or the climate grant list and look for your grant. Please check the inbox of your email associated with the grant for your invite with links and info on how to apply. Please verify you meet all eligibility criteria for your round or your application may not be accepted. If you no longer have access to that email, please reach out to me @kierano on Telegram. The first Gitcoin Program Alpha QF rounds on the Grants Protocol will run from January 17th to January 31st, and will only be open to a subset of existing grantees. The full governance post and discussion around the structure of these rounds can be found here. The summary of the post is:  Governance has approved the decision to sunset cGrants and transition to the Grants Protocol We’ll run an Alpha Round on the protocol in January with the goal of testing the product while supporting established grantees The Alpha Round will consist of 3 separate matching pools: Web3 Open Source Software, Ethereum Infrastructure, and Climate Solutions These rounds will only be open to a subset of existing grantees supporting a maximum of 300 projects We’ve considered many different options for which grantees to include and will invite 40 grantees in the climate round with 10 additional bundled projects, ~250 in the OSS round, and ~30 in the Eth Infrastructure round  Projects that qualify based on the criteria set out in the post have been invited to apply for the Alpha Rounds, but acceptance is not guaranteed and grants must meet the additional round criteria required for each round. The Web3 Open Source Software Round will consist of grantees who met the funding requirements outlined in the linked governance post above in addition to the following:  Be an open-source project with meaningful Github activity in the prior 3 months that has demonstrated work completed towards the project’s mission. Primarily focused on developing on top of or advancing the broader Ethereum and/or Web3 industry.  There were a total of 234 grants invited to this round - to see the full list of grants invited to the OSS round, please reference this spreadsheet. The Ethereum Infrastructure Round is focused on grantees who are building projects in direct support of the Ethereum ecosystem. This includes areas like core client devs, tooling providers, developer education, and those showcasing the power of critical ecosystem ideas. Additionally, grants should be open source if they are software related. Similar to the OSS round, grants were invited to apply based on the GR14 and GR15 funding criteria outlined in the governance post linked above. There were 32 grants invited to this round - to see the full list of grants invited to the ETH Infra round, please reference the 2nd tab in this spreadsheet. The Climate Solutions Round will feature 40 individual climate projects from GR15 that were invited because they received the most support based on the number of unique contributors and 10 bundled use cases for the remaining GR15 projects working in Renewable Energy, Carbon Markets, Verification Infrastructure, Oceans & Forest, Agriculture, Community Engagement, Creative Works, Climate Research, Climate Advocacy & Activism, and Emerging Markets and Indigenous Communities. To see the full list of grants invited to the Climate Solutions round, please see this document. Once again - If you are the owner of one of the grants on the OSS, ETH Infra, or Climate Solutions grant lists, please check the inbox of your email associated with the grant for your invite with links and info on how to apply, or reach out to me @kierano on Telegram. We could not be more excited to run these Alpha Rounds and continue our mission of funding public goods! ",
                    "links": [
                        "https://docs.google.com/document/d/1TOiFR9RzCtTJWy98XNrfKH-QOnw2bwbBwyN4INV2wVs/edit?usp=sharing",
                        "https://docs.google.com/document/d/1I4U3RA-q9ZW_Mtlz-EiFtj4YZTkPEwebQSKbEZlCfdY/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/discussion-feedback-request-grants-protocol-alpha-round-eligibility/11873",
                        "https://gov.gitcoin.co/t/discussion-feedback-request-grants-protocol-alpha-round-eligibility/11873",
                        "https://docs.google.com/spreadsheets/d/1dD6NeofEKvSMMEXmqjU8dtDqS_pfEdiBpCcBpqIan5A/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1dD6NeofEKvSMMEXmqjU8dtDqS_pfEdiBpCcBpqIan5A/edit?usp=sharing",
                        "https://docs.google.com/document/d/1TOiFR9RzCtTJWy98XNrfKH-QOnw2bwbBwyN4INV2wVs/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/gitcoin-program-alpha-round-post-op-writeup/13043",
                        "https://gov.gitcoin.co/t/proposal-ratify-the-results-of-january-s-alpha-rounds-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/13277"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#2",
                    "likes": "2",
                    "time": "12/01/2023-07:26:00",
                    "content": "Thanks for putting this together and getting it out @koday! Excited to get these rounds kicked off  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#3",
                    "likes": "3",
                    "time": "13/01/2023-03:28:55",
                    "content": "Looks awesome, great work putting this together! Do we have a sense of what % of grantees accepted the invite since it went out? Is there a minimum threshold we need before we’ll formally start a given round? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/koday",
                    "index": "#4",
                    "likes": "3",
                    "time": "16/01/2023-21:41:52",
                    "content": "We’re up to 100 applications for OSS, ~22 for ETH Infra, and I believe the eligible climate grantees are nearly 100% onboarded (@M0nkeyFl0wer would have those numbers handy). Regarding your 2nd question - we’re doing some manual outreach via Twitter/Telegram (as email isn’t the best and some of the emails we have on file from cGrants are old) in order to get as many applications as possible from the invited list. However, once the round is created on the protocol the start date & time is hard set and there’s nothing we could do to change that short of creating a new round - so no minimum application threshold or anything. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.726957070707071
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#5",
                    "likes": "3",
                    "time": "16/01/2023-22:06:43",
                    "content": "yep all 40 individual grantees and the 10 bundles of grantees for the climate solutions round are all approved on round manager as of this morning. 🫱🏼‍🫲🏽 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Dahabnz",
                    "index": "#6",
                    "likes": "0",
                    "time": "21/01/2023-07:37:03",
                    "content": "This is a great resource considering all the questions in discord. Just need to let people know that the $10 min for Fantom is only for the poap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                }
            ]
        }
    ],
    "group_index": "293"
}