{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/knowledge-sharing-gitcoin-grant-and-grant-status-introduction/10318",
            "title": "[knowledge sharing] Gitcoin Grant and Grant status introduction ",
            "index": 10318,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#1",
                    "likes": "1",
                    "time": "07/04/2022-01:56:14",
                    "content": " Gitcoin grant advices based on my  observations  What is Gitcoin Grant In gitcoin support knowledge base, there is a definition for what is gitcoin grant.  What are Grants Rounds? In short, to support people and organizations that are building public goods. That is, people & orgs who are building software, tools, media and other artifacts that are freely available AND create positive externalities to the world. Many people think of Gitcoin as a meta public good – a public good that enables other public goods (+builders of public goods!) to spawn, grow and thrive. DAOs and other ecosystem builders see Gitcoin’s quarterly grants rounds as an opportunity to partner regularly with the broader web3 community to fund the most impactful projects & builders. Over the past 13 quarters, Gitcoin’s grants rounds have collectively raised over $40 million. refer to GR13 results  How Grants work There are 2 funding flows for grants:  one is from the contributors (your donation), which will go to the grantee’s wallet directly and instantly   the other is from Gitcoin matching pool, which will have a final calculation based on Quadratic Funding rule (https://wtfisqf.com/) after Grant Round.    So let’s say you (as donors) donated $100 to the grant, and then the grantee (grant owner) will get your $100 once the transactions succeeded. But the grantee will get matching fund (which is est. on the checkout) after grant round.  What questions the Gitcoin users have There are some FAQs from Gitcoin users for the grant, you can find them from Gitcoin support knowledge base.   Some Grant issues examples - in the beginning of GR13, some grantees didn’t know why their grants are inactive. - some grants are not in matching round grants - for the denied grants, the grantees didn’t know next steps clearly. - for the appealed grants, the grantees didn’t know the status. - removing tags, the grantees didn’t get notifications for the reasons.   Grants status Based on above issues we can see, there are several statuses for the grants, and I would introduce a bit here (please correct me if I am wrong, I am not the grant guru):   new - This is a “virtual” status, without mapping a real status in the database. The new grants are inactive and invisible from web UI.  inactive - The grant is inactive after being created by default. Once the grant is approved, it should be changed to be active. The grant could be set to inactive by the review team after reported and confirmed.  opt in for clr - Eligible to get matching funds from the matching pool. By default the grant is in clr status after approval, but the grantees could de-select clr matching by themselves.  cancel (removed) - The grant will be canceled (removed) from the database.  If you have any comments for gitcoin grant, just leave here. We (user support team) are here for you! ",
                    "links": [
                        "https://gitcoin.co/blog/gr13-results/",
                        "https://wtfisqf.com/",
                        "https://support.gitcoin.co/gitcoin-grants/grantee-questions"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.085648148148149
                }
            ]
        }
    ],
    "group_index": "55"
}