{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/what-would-a-lean-effective-gitcoin-look-like/10540",
            "title": "What would a Lean/Effective Gitcoin look like? \\xe2\\x8f\\xb3 ",
            "index": 10540,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "contributors"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "19",
                    "time": "08/05/2022-18:44:09",
                    "content": "I want to highlight a trend in the comments I’ve seen from stewards over the last week of budgeting season.  The main trend I see is a complaint about a lack of lean-ness and a lack of effectiveness. Here are some comments:  Kyle Weiss    Treasury Diversification Working Group Updates Thread   The bear is here and it’s only going to get worse over the next 6-12mos. Crypto markets are tied closer to the US stock market than they have ever been (and global markets), and the US Fed doesn’t give a shit if they tank the stock market trying to get inflation under control. The general sentiment is that Investors across Web3 are slowing investment and feel like they can wait ~8mos to scoop up a lot of “good deals” as token prices, valuations and shitty projects are going to die out over the next 6-12mos. This news is not all doomsday for Gitcoin though! Gitcoin has an incredible brand and deep reason for existing that is of interest to many of the folks I have had a chance to chat with. there are headwinds though as money is tightening, and scrutiny is finally being applied to most funding decisions (ie, folks are asking about longevity of projects and roadmaps again!). It’s through these conversations and conversations with other DAOs, and protocols that I have learned and deeply believe Gitcoin is not in a position to fuck around - we need to really focus on the core thesis that we are a protocol DAO with great impact (funding for public goods). gets on soap box for impact Season after season we have failed to really make progress on our Protocol development, but continue to grow budgets. To top it off GR13 shrank quite dramatically, likely due to market sentiment. This trend will continue and we will continue to see funding dry up where it was once bountiful. Our community needs us to survive and to thrive, web3 needs us to survive. Gitcoin is the light that fuels the ecosystem through bear markets and we can only do that with funding ourselves, and an eye towards the most important thing (advancing our protocol to make grants permissionless and pervasive).    Anonymous Steward  I was going to bring up in the call today but transparently I am concerned about dao long term funding sustainability given many $500k-$1m requests for 1 season which ends up around $5m total for the season and each season only seems to be getting larger with requests  I have not gotten permission from this Steward to quote them by name, but they are in the top 15.  Austin Griffith Austin told me at ETHAmsterdam 2022 that he felt like we were not meeting our moment (“youre fucking it up”).  Software projects at Gitcoin that he’s seen typically take too long to ship, have too much overhead, and when they come out, come out buggy or otherwise miss the market. Gitcoin is routinely beaten to market (or otherwise out-executed) by projects with massively less resources (money, clout, people) than us.  Lefteris   twitter.com    Lefteris Karapetsas | Hiring for @rotkiapp @LefterisJP  A DAO without a clear goal is just a fat cow filled with cash to be milked by subgroups each with its own idea of what the goal of the DAO should be.  The more generic the stated goal of the DAO the easier to fall into this trap.   12:47 AM - 4 May 2022           232                24             My view My view is this:  Gitcoin is unfortunately a ProtocolDAO without a Protocol. The DAO spends millions of dollars in tokens on things that just don’t have ROI. The DAO has a habit of starting many projects in many different directions.  The DAO workstreams regularly start projects that are “a few weeks away” from shipping, but drag on for months or just never ship. Because the workstream proposals are so large/dense, and stewards have little context, it is hard for these project owners to be held accountable.  These are precarious positions to be in at the start (middle) of a bear market. I believe in Gitcoin’s mission.  I think that stewarding an open source project is a lot like gardening.  I’ve been pulling a lot of weeds in my home garden.  I consider posts like this to be like weeding our garden.  I believe in Gitcoin, and I believe that by pulling at these weeds, we can have our execution meet our moment. What would have to be true to have a more lean/effective Gitcoin that is focused on achieving its mission?  What would have to be true to get the protocol shipped + used by the world? What would have to be true for us to be comfortable with the long term sustainability of Gitcoin?  How would we act differently in times of scarcity vs the times of relative abundance that we’ve seen over the last year? ",
                    "links": [
                        "https://twitter.com/LefterisJP/status/1521758439348838400",
                        "https://twitter.com/LefterisJP/status/1521758439348838400",
                        "https://twitter.com/LefterisJP/status/1521758439348838400",
                        "https://twitter.com/LefterisJP/status/1521758439348838400",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17-2022/10597",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-x2-kernel-budget-request-of-49k-gtc/10444/30",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-x2-kernel-budget-request-of-49k-gtc/10444/28"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.505654761904761
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#2",
                    "likes": "5",
                    "time": "09/05/2022-15:24:45",
                    "content": "I have to agree. I think the honeymoon is over. We rely on GTC for funding… and GTC’s price is not doing well… we need to really focus our distribution of GTC to the WGs that can have an impact there… either by bringing Revenue into the DAO (not holdings) or creating demand for GTC… If you aren’t supporting that at least indirectly, then I don’t think we should approve the budget. :-/ It sucks but we shouldn’t send GTC to be sold into the market right now just to support public goods or build out a larger WG to try new projects… We need to really respect the market conditions and tighten up our spending this quarter. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.111038961038961
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lunacat",
                    "index": "#3",
                    "likes": "5",
                    "time": "09/05/2022-16:17:25",
                    "content": "Yes, everything this.  I’ve been following the budget proposals closely for past few cycles, and it is clear that workstreams do not remotely appreciate how GTC is set up for a rapidly approaching death spiral in this market.  The requests are not tethered to reality and continually increase despite very little return to the outward facing Gitcoin product.  Funding personnel reviews, meme parties, random new hires, and developer larks is not acceptable in this current market and do not align with Gitcoin’s stated mission of developing public goods.  I am very concerned that R14 will pale in comparison to R13, which itself was down from R12.  This is not a good place to be in and shows just how much the workstreams have taken eye off the ball during the times of plenty. GTC must be given more utility, or the market will not continue to support the constant downward pressure put on GTC by the workstreams.  Giveth is a fantastic example of how Gitcoin could bootstrap a simple staking mechanism, that should be explored immediately.  Additionally, workstreams must be vetted far more critically, and the leads should not take offense when stewards express very real concerns over just how much they are paying themselves for work of questionable utility.  Hopefully these are growing pains, but Gitcoin is no longer just the small little group of friends, and frankly needs to grow up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9642068001443
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#4",
                    "likes": "3",
                    "time": "09/05/2022-16:36:55",
                    "content": "A few relevant posts to the discussion above:  Abundance & Scarcity The overton window for Grants 2.0 ⏳ Roadmap to GTC Utility ⚡️ Wartime DAO / Peacetime DAO  The workstream leads at GitcoinDAO met last Friday, at a session moderated by Sam Spurlin, to talk about Purpose & Essential Intent.  They landed on four essential intent’s for S14.   These were the major categories:  Improve Coordination Intra Gitcoin DAO Gitcoin Grants 2.0 (Protocol) Grow Grants GMV Financial Sustainability  It sounds like Sam is facilitating another session to get to a place where the DAO can formally ratify these (or other) essential intent’s for S14.   I can post more about that when it happens. ",
                    "links": [
                        "https://gov.gitcoin.co/t/the-overton-window-for-grants-2-0/10461",
                        "https://gov.gitcoin.co/t/roadmap-to-gtc-utility/10546",
                        "https://gov.gitcoin.co/t/wartime-dao-peacetime-dao/10228"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.289772727272727
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#5",
                    "likes": "6",
                    "time": "09/05/2022-16:39:21",
                    "content": "    Lunacat:  Giveth is a fantastic example of how Gitcoin could bootstrap a simple staking mechanism, that should be explored immediately.   It’s crazy to me to see how beautiful, feature-rich, & effective Giveth 2.0 is.  And it’s hopefully a source of inspiration to Gitcoin to see that it was built with under $500k in funding.     Lunacat:  Additionally, workstreams… should not take offense when stewards express very real concerns over just how much they are paying themselves for work of questionable utility.   Strongly agree here.  We should collaborate to make this a cultural norm.   twitter.com    Ξwocki (🤖,💚) @owocki  @DisruptionJoe @krrisis @schellingpoint_ @Sim_Pop @notscottmoore @blockchainjames @ljxie @gitcoin Holding people accountable to outcomes != being brutal to them personally   Focus on outcomes; don’t get personal   5:39 AM - 21 Apr 2022           9                1            ",
                    "links": [
                        "https://twitter.com/owocki/status/1517541158280433664",
                        "https://twitter.com/owocki/status/1517541158280433664",
                        "https://twitter.com/owocki/status/1517541158280433664"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.343589743589744
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lunacat",
                    "index": "#6",
                    "likes": "3",
                    "time": "09/05/2022-22:12:14",
                    "content": "Kevin, why do you think chatter on this forum dies whenever someone broaches topic of GTC?  I fear people are overly sensitive to [overblown] concerns over poorly understood securities laws… meanwhile, the core contributors to GitcoinDAO rely entirely on funding from the very token that they do not like to speak about.  How to change this?  I ask this directly as you are still very much the thought leader for the collective, and - like it or not - I think you have to play a role in forcing this critical conversation for the long term health of the DAO… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1312500000000005
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#7",
                    "likes": "5",
                    "time": "10/05/2022-04:01:56",
                    "content": "    Lunacat:  I ask this directly as you are still very much the thought leader for the collective, and - like it or not - I think you have to play a role in forcing this critical conversation for the long term health of the DAO   I would beg to differ on Kevin’s role lately   But much of your thoughts are ones I share as well (though I dont always vocalize it).     Lunacat:  why do you think chatter on this forum dies whenever someone broaches topic of GTC? I fear people are overly sensitive to [overblown] concerns over poorly understood securities laws…   I agree that we need to be focused on utility for GTC. Utility for a token does not make it a security, promising an economic return will. This is why these things are interwoven at times (more utility may mean more value… more value may mean a higher price and invite unhealthy speculation). You are spot on @Lunacat that S14 has the potential to be wildly out of control without more prudence on spending. I can assure you that many of the stewards (myself included) are evaluating the results of workstreams after giving them blank checks for nearly a year now. I think in S14 you will start to see a couple workstreams really focus on our Grants Protocol and GTC utility. IMO, the Grants 2.0 protocol is needed before we can build any “real” utility into GTC. Others have built gimicky “utility” and we have tried to stay away from this trend. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.526999999999999
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#8",
                    "likes": "4",
                    "time": "10/05/2022-07:18:20",
                    "content": "as you all mentioned, i agree that it’s important GTC be given more utility. it would bring stability and lubricate the economy. however, paying contributors 100% in GTC might not be a good idea. another thing we should be focusing on is cross-chain relationships. locking ourself into the ethereum ecosystem has the potential to cause longer-term problems. algorand nearly got rugged and i have been trying to push for us to collaborate more as it seems now is a better time than ever. diversification is always good.     Lunacat:  I fear people are overly sensitive to [overblown] concerns over poorly understood securities laws…   i’m no lawyer, but there are some valid concerns on this front especially in the current state of GTC and holdings transitioning most of their staff into the DAO. this could be a red flag. doesn’t it kinda feel like Gitcoin DAO is converging towards a corporation with subsidiaries? functionally they’re similar (and getting closer), just with a bit more of a new-age-y culture and more exposure to risk of litigation for the contributors (?). ",
                    "links": [
                        "https://discord.com/channels/562828676480237578/972406033332961320/972406035237208124",
                        "https://forum.algorand.org/t/evolving-algorand-governance/6646/10?u=nollied",
                        "https://twitter.com/nolliechain/status/1496914664768229383?s=20&t=INiTAl0fHvw_Hf1j1nKT2w"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.352941176470588
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#9",
                    "likes": "4",
                    "time": "11/05/2022-04:00:24",
                    "content": "    kyle:  I agree that we need to be focused on utility for GTC   Just wanted to make sure people saw it, but here are a couple posts about GTC utility that have come up in the last week or so.     Roadmap to GTC Utility ️ 🤖 Meta-Governance       I have seen a few threads about “What does GTC do?” and so I want to synthesize the latest thinking on the roadmap.  IMPORTANT: Nothing in this thread constitutes a promise to build anything.  It is up to DAO Governance to ratify what it wants to build/fund.  As you recall from the launch post, GTC is governance token that can be used to ratify proposals via the Governance process.  “GTC is a governance token used to oversee the Gitcoin ecosystem. It has no claim on financial rights.”  But what …         GTC Conviction Voting dApp => GTC Utility 🤖 Meta-Governance       Hello Gitcoin!   I’m 0xDarni, aka Daniele  If you want to play with the demo as @owocki suggested, first you need to mint some test-GTC on Rinkeby.  Looks like I cannot post links, so here is the contract address: 0x961D0F9a9519434DF0F950c191bE5010bcCe177b  Edit: I just got permissions to post links, so here’s the contract!  We created a simple ERC-20 just for this with a public mint method, etherscan on Rinkeby is all you need    I’d welcome replies (or other posts) about how to build more GTC utility. ",
                    "links": [
                        "https://gitcoin.co/blog/introducing-gtc-gitcoins-governance-token/",
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v3/10358",
                        "https://gov.gitcoin.co/t/gtc-conviction-voting-dapp-gtc-utility/10523/2",
                        "https://rinkeby.etherscan.io/address/0x961D0F9a9519434DF0F950c191bE5010bcCe177b#writeContract"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.110576923076923
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#11",
                    "likes": "3",
                    "time": "16/05/2022-12:30:58",
                    "content": "Some comments from @lefterisjp on this subject:   twitter.com    Lefteris Karapetsas | Hiring for @rotkiapp @LefterisJP  @Sim_Pop @owocki Evolving, while the original problem is not solved does not bring clarity in any way.  The problem of funding opensource is not solved. Widening the scope of the DAO beyond that does not help but does exactly the opposite.   7:56 AM - 15 May 2022           3              twitter.com    Lefteris Karapetsas | Hiring for @rotkiapp @LefterisJP  @owocki @Sim_Pop There is a big difference between the goals of \"Fund public goods\", and \"Create an efficient funding mechanism\".  Goal 1 is too broad.  Gitcoin needs to switch from a social DAO with grand stated goals to become a lean product development team/DAO to accomplish Grants 2.0 / QF.   8:51 AM - 15 May 2022           2            ",
                    "links": [
                        "https://twitter.com/LefterisJP/status/1526116395154644992",
                        "https://twitter.com/LefterisJP/status/1526116395154644992",
                        "https://twitter.com/LefterisJP/status/1526116395154644992",
                        "https://twitter.com/LefterisJP/status/1526176592208318466",
                        "https://twitter.com/LefterisJP/status/1526176592208318466",
                        "https://twitter.com/LefterisJP/status/1526176592208318466",
                        "https://twitter.com/LefterisJP/status/1526176592208318466"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.585648148148148
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/spirobel",
                    "index": "#12",
                    "likes": "0",
                    "time": "17/06/2022-08:00:09",
                    "content": "    owocki:  How would we act differently in times of scarcity vs the times of relative abundance that we’ve seen over the last year?   This whole data collection and KYC thing is not cool. I understand QF needs that, but it is just not a cool thing because it introduces so much friction and data security risks. It also excludes people that cant do KYC. not nice. Wish there was something like gitcoin but without QF and all this data collection. Maybe rethink if QF is really a good idea or if there are alternatives that dont require such strong sybill resistance. Which kind of alternatives have you explored? so much friction could be reduced by getting rid of QF. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.647435897435898
                }
            ]
        }
    ],
    "group_index": "90"
}