{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/reconsideration-on-climate-solutions-cause-round/10982",
            "title": "Reconsideration on Climate Solutions cause round ",
            "index": 10982,
            "category": [
                "\\xf0\\x9f\\x8c\\xb1 Grants"
            ],
            "tags": [
                "regen",
                "stewards",
                "Grants2",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/hbesso31",
                    "index": "#1",
                    "likes": "3",
                    "time": "21/06/2022-19:51:52",
                    "content": " Should Commoning be considered a Climate Solution? First of all, I and the Urbanika team are deeply grateful for Gitcoin to exist and for the contributions of all those maintaining and constantly improving it. We, as GTC holders believe that Gitcoin outstands as a DAO due to its true bottom-up way of building and decision-making. This is the reason that I have decided to open this topic as a way to search for an open conversation regarding if commoning is considered a way to tackle climate crisis. Let me elaborate. At the beginning of #GG14, Urbánika applied to be part of the Climate Cause round, however it was not chosen as a grant to fit in there. A ticket was openned, and the only tag that was approved besides Main, was Education. Gitcoin DAO, in all its right, has not recognized Urbánika as fitting the Climate Cause round. We contend that the climate crisis and socio-ecological regeneration lie at the heart of both the Urbanika project and the international urban commons movement it aims to support. There is broad agreement in the scientific community that staying within a just operating space for humanity and non-humans alike will require more than technical solutions; it will require fundamental cultural and institutional transformations. Commoning, as a paradigm that transcends the diad of State and Market in approaching the issue of equitable and sustainable governance of shared resources, and as a deeply relational concept that recognizes and affirms the interdependence of all life, directly addressess this challenge. Furthermore, commonification of services (e.g. food, housing, energy, transport) is considered a core strategy for sustainability transformations by many scholars and practitioners, and will be framed as such in the Urbanika project. Drawing on the work of Elinor Ostrom, David Bollier and other commons scholars, including those focusing on ecological regeneration and more-than-human perspectives, all while imbuing it with a contemporary solarpunk aesthetic, the Urbanika immersive and educational film series will engage and empower citizens to re-shape their cities into urban commons using a vernacular approach; it will take people from being passive observers to regen activists. It is for these reasons that we would appreciate if the Gitcoin DAO team would reconsider their decision and support the eligibility of Urbanika for the climate solution round. We have found many supporters along GG14 and have been amazed at the number of people wanting to see urban crypto-commoning unfold through an engaging solarpunk experience. Your support will enable us to launch the first episodes of Urbanika without our budget flat-lining. Would you please reconsider this? ",
                    "links": [
                        "https://docs.google.com/document/d/1jplc1wp08Ny6s5z0uKn4WTJiiwKInxPCEnnQh1ynqps/edit?usp=sharing"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.671048280423281
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/hbesso31",
                    "index": "#2",
                    "likes": "0",
                    "time": "21/06/2022-19:55:55",
                    "content": "@griff @DisruptionJoe @jeffemmett would you be so kidn to take a look and comment at this topic, please? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#4",
                    "likes": "1",
                    "time": "22/06/2022-10:18:51",
                    "content": "Hi and thanks for the primer on “commoning”  While I find it very helpful to understand how you see it should fit as a public good, the issue here isn’t in the domain of our grants eligbility team at Gitcoin. We are responsible for:  Determining if a grant should be allowed on the platform at all Determining if a grant should be allowed in the “main” round which is community curated through FDD  We are not responsible for determining if a grant belongs in other rounds. “Side rounds” have a matching pool funder who determines the eligibility policy and enforcement method. For this Climate round @M0nkeyFl0wer is the liason to the round owner. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.434027777777778
                }
            ]
        }
    ],
    "group_index": "141"
}