{
    "poll_list": [
        {
            "id": "0xa6fa6cae4e3c341f4b65a580779e3e66430e02b8979e54c49536fce583cb3735",
            "title": "Memes, Merch and Marketing (MMM) S13 budget request",
            "discussion": "",
            "body": "The MMM workstream is requesting a total of 30k GTC for Season 13.\nThe focus for this season will be on:\n- Building Gitcoin’s lean, mean web3 marketing machine\n- Shaping and grow a leading web3 brand\n- Supporting GitcoinDAO & Workstream initiatives\n\nIn the upcoming Season 13, MMM will take another significant step forward by establishing specific objectives for 4 key areas: Channels & growth, Brand, Workstream marketing, and Team management/health. This Season 13 budget request is designed to align with these goals and is split into 7 key areas: MMManagement, Software & tools, Events, Development, Brand & design, Content, and Growth.\n\nThis Season, we are formally adopting OKRs for Workstream priority setting and planning, with 4 key objectives laid out below. Our formal budget requests will follow these objectives and key activities.\n\n*Objective 1: Build Gitcoin’s lean, mean web3 marketing machine\nExamples of key activities that support this objective:*\n- Revamp the welcome email program, retention program and enable “abandoned” cart email\n- Perform an a SEO and keyword analysis to identify top ranking goals, and create a content program and calendar that aligns to this\n- Create web analytics tracking for GR13 to track conversions and make a tracking template for all marketing activities.\n\n*Objective 2: Shape and grow a leading web3 brand\nExamples of key activities that support this objective:*\n- Develop and publish brand perceptions to focus marketing campaign content & Brand Guide to ensure our visual & written content is consistent across all marketing and brand design.\n- Create pilot co-marketing project to create foundation for future partnerships\n- Launch “Can Devs Do Something” meetup in 5 cities with at least 120 participants & create a forkable program that allows community to host their own decentralized global meetups\nShape Gitcoin’s external perception & grow our global media presence, potentially by hiring and onboarding a leading Web3 PR agency\n\n*Objective 3: Support GitcoinDAO & Workstream initiatives\nExamples of key activities that support this objective:*\n- Expand connections and collaborations with Workstreams, and ensure every Workstream has a designated marketing point of contact\n- Establish a streamlined marketing resourcing request process\n- Host and promote community-building virtual events such as weekly contributor meetups, happy hours, community hangouts etc\n- Create and promote digest of key DAO activities to increase stakeholder understanding & engagement\n\n*Objective 4: Grow & support team health and accountability\nExamples of key activities that support this objective:*\n- Recruit 3 top contributors - core and project-based. Ensure clear process for posting & completing work and prompt contributor compensation\n- Propose, refine and gain approval for 2022 Q1 marketing plan including budget, OKRs and project plan\n- All core contributors create & publish accountabilities, and receive regular performance feedback from peers and workstream leads\n- Empower contributors to start and lead grassroots initiatives with minimal ongoing management",
            "choices": [
                "Fund MMM as requested",
                "Do not fund MMM as requested"
            ],
            "scores": [
                6269536.744739529,
                103.22999999800015
            ],
            "start": 1645039438,
            "end": 1645470000,
            "snapshot": "14218932",
            "state": "closed",
            "author": "0xc2E2B715d9e302947Ec7e312fd2384b5a1296099",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "MMM S13 - Funding request",
            "date": "Proposed on: Mar 4th, 2022",
            "yes_votes": "8.14M",
            "no_votes": "0"
        },
        {
            "title": "Canceled proposal: MMM S13 - Funding request",
            "date": "Proposed on: Feb 24th, 2022",
            "yes_votes": "0",
            "no_votes": "27"
        }
    ],
    "discourse_list": [],
    "group_index": "698"
}