{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
            "title": "Grants 2.0 is how we scale our impact \\xf0\\x9f\\x93\\x88 ",
            "index": 10015,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "15",
                    "time": "06/03/2022-18:29:49",
                    "content": " TLDR  Grants 1.0 is centralized & therefore has an upper limit to its growth. Grants 1.0 is going into maintenance mode. We can reduce fragility & scale our impact with Grants 2.0 I explore what that world looks like & attempt to build common understanding & consensus about that direction. Thanks to everyone whos helped us get to this point of understanding of our impact.   Grants 2.0 is how we scale our impact   Hi everyone, This post is about why I think GitcoinDAO should considering going all-in on Grants 2.0.  All-in on Grants 2.0  In explaining why, I want to talk first about Grants 1.0. It’s not the future. It’s open source but it’s not decentralized.  It’s not forkable.  It’s not well documented.  It’s primary instance is hosted by a centralized company on AWS in Oregon. Because of these things, it can’t be the future of GitcoinDAOs Impact. To drive home the immediacy of this point, I want to highlight this line from the recent Grants 2.0 Vision post by @lthrift @kevin.olsen (VP Product, VP Engineering at Gitcoin Holdings respectively) :  Starting immediately after GR13 the Gitcoin.co  web application will effectively go into maintenance mode.  For those of us skilled at reading between the lines, this is kind of a big deal. The application that has powered $52mm worth of OSS funding so far, through 13 rounds is going into maintenance mode! While in maintenance mode, new features for this codebase will not be considered (though bug reports will triaged). That’s kind of a big deal.   It definitely marks the beginning of the end of an era. So why do this now?  Why make a first move towards retiring the primary application behind Gitcoin Grants?  Reason 1 - Grants 1.0 has an upper limit to its impact. The primary reason is that we are fully coming to grips with the fact that we are turning Gitcoin Grants into GitcoinDAO.  The DAO launched, it ran a few rounds of Gitcoin Grants, now the Foundation is here.  It’s time to seriously come to terms with the fact that we can decentralize the governance of GitcoinDAO all we want, if we dont get serious about decentralizing its computation,  we will not be on track to fully orient Grants out of the DAO. Increasingly we cannot ignore the inconvenient truth that Grants 1.0 is misposiitioned for the world in which we are going.  It is mispositioned because it was built for a different time.  It was our 0 to 1 playground, built in a time when great decentralized tooling for hosting, indexing, code + data were not available, and laden with the tech & product debt of an organization trying to find it’s footing during The Great Bear and The Great Reset . It was built as a centralized monolith by a centralized company.  And the future of public goods funding on Gitcoin involves  Gitcoin Grants going from 0 to 1 to 1 to 10. Gitcoin Grants going from a centralized monolith to decentralized, modular, and forkable protocol maintained by a DAO.   Side Effects: Other Features of the monolith Note: Gitcoin Grant is just one product of the monolith.  For the avoidance of doubt, here are the modules of the monolith, and what their futures:  Gitcoin Grants - moving to Gitcoin Grants 2.0. Gitcoin Hackathons/bounties - still being run out of the maintenance mode monolith. Gitcoin Kudos/Quests - being retired or forked & decentralized. KERNEL - being spun out. Gitcoin Profiles - TBD but likely to be exited to ceramic data stores and POPP    Reason 2 - to make headspace for Grants 2.0 A primary reason is that it allows us all to move our focus from the current operating modes (relying on Gitcoin Holdings) to focusing on whats next, launching Gitcoin Grants 2.0 & riding it to our next phase of growth.  So whats next? So now that we’ve decided to retire the monolith, whats next? If one is focused on scaling GitcoinDAO’s impact for the world, how they do that?  And why is Grants 2.0 an important part of that? This is where this post intersects with my work in Articulating GitcoinDAO’s Impact on the World. As you may remember, that post explores the following question:  What is GitcoinDAO’s impact on the world?  and comes up with the following visual diagram of Gitcoin DAO’s present impact in 4 different vectors:  Screen Shot 2022-03-02 at 10.55.42 PM1064×642 148 KB  The cultural, social, financial, intellectual, experiental capital exports of GitcoinDAO  How do we get to our next phase? I think our next phase of impact really hinges on whether Gitcoin Grants 2.0 is successful.  The Base Case I the base case for our ultimate impact is for the DAO to become something like a FWB or a Seed Club - a social club where you go to build & fund digital public goods.     We want to be at the intersection of theory and action, there are many places to discuss the progress being made in web3, but we also want to bring that progress to life. Of course, we hope to see Gitcoin Grants as it exists today grow linearly via side rounds, aqueducts, and strong brand awareness in the next few seasons.  But there are limits to how it can grow in the product’s Grants 1.0 form.  And there are non-negligible financial overhead, intellectual overhead, centralization risks, and other overhead & fragility that are risks to continuing to operate Grants 1.0. The base case is trafficking in Social & Cultural Capital, as growth of our Intellectual, Experiential, and Financial impact tapers off. .  The Plus Case The plus case is the base++ case. In the plus case, Gitcoin Grants 2.0 unlocks  Exponentially more Financial Capital Exponentially more Intellectual Capital Exponentially more Experiental Capital   Screen Shot 2022-03-23 at 3.48.47 PM1752×1060 127 KB   1. Exponentially more Financial Capital In Gitcoin Grants 1.0, which was a centralized monolith which required you to contact us to run a round.   We (or later, DAO workstreams) would staff an account manager who would make sure your round goes well. This is an effective way of linearly scaling Grants. In Gitcoin Grants 2.0, anyone can fork the codebase + accompanying documentation, ingest Grants from the registry, and run a QF round of their own.  They will be able to select different matching schemes (QF or not) or identity schemes, or aesthetic/branding options, that are right for their community.  They will be well supported with documentation about how to make their rounds successful.  A no-code option would allow anyone to do this without technical skills. Grants 2.0 could allow us to exponentially scale Grants.  Grants 1.0 was Gitcoin Holdings fishing for you.    Grants 2.0 is GitcoinDAO teaching you to fish.     2. Exponentially more Intellectual Capital One thing I’m really excited about in Grants 2.0 is how much it could support the creation of more intellectual capital - especially learnings about different QF mechanisms (but maybe other mechanisms - I’ve got my eye on Effective Altruism + Retroactive Public Goods Funding right now - both promising non-QF mechanisms for doing good). To understand why I’m so excited, lets look at this diagram.  fLTzUgQ8zK5zC3vXgcp8STSz8GT2BfKgvPj2IVzHtdnyzaezrQCiFB38G71-UJgm0axtGWImIVWBMTIwXY0SYiXMM9MPiIP2HtNMBLFDLDhJheqxD_8mQbA_2xy7AsK9c6tIiJrv1380×646 73.8 KB  Gitcoin Grants 2.0 = decentralized registry with an ecosystem of diff forkable funding mechanisms competing to deploy matching pools. The goal is to create an environment where the community can test different public goods funding mechanisms on top of a deeply liquid registry of grants. We want  to speedrun the “hill climbing problem” of finding optimal democratic mechanisms for funding public goods.   3. Exponentially more Experiential Capital Here is what the preference map for GR13 looked like. Each node in the network is a user or a grant, and each edge is a transaction.  With this data set, we have a deeper understanding of what projects everday community members care about, a novel wisdom arising from the experiential capital of collective action. There is an embodied intelligence in the Ethereum community’s funding preferences, and I imagine a world in which we are able to pull high resolution insights from this dataset.  As Audrey Tang puts it, we want to “be a channel for greater combinations of strength & intelligence to come together”. This embodied intelligence could grow to critical mass within the Web3/Crypto communities, but also we could expand it outwards to the rest of the world.   A meta-public good, a public good that supports other public goods.  Screen Shot 2022-03-06 at 10.05.11 AM748×708 242 KB  If we can create the wordpress of QF, we can scale the impact of QF exponentially.  Wordpress made anyone a blogger, Grants 2.0 could make anyone into a QF ecosystem builder.  I can’t tell you how many times I run into community leaders at ETHDenver this year who’s building an ecosystem who would love to have an easy to use Grants/QF product dropped into their lap.  In Closing  It is my strong recommendation that the DAO embrace Grants 2.0 My general feeling is this:  We have great momentum into The Great Reset & Also The Great Revival, but I do worry that we are only on track to create only the base case of impact. To be clear: The base case (the case in which we export social & culture capital (memes/stories) about public goods) wouldnt be so bad at all.  Its so rewarding to create social schelling points for the world to come together & build/fund public goods. But the base case isnt our fullest potential.  I believe that QF is a core money lego, like AMMs, or gnosis safes, or MolochDAOs.  I think there is a legitimate opportunity to ride that insight to create exponentially more social, culture, intellectual, financial, and experiential capital for our stakeholders & for the world. My feeling is if we want the plus case, we have to build consensus on that, coordinate to pay down our centralization debt, launch Grants 2.0, make it great, scale it, teach it, watch it fly.  Getting good at building software as a DAO Building software is hard enough itself.  Doing it as a DAO is unknown art (some would say, impossible). There have been false starts so far. I am extremely thankful to those who have tried their hands at implementations of Grants in the past.  From the initial launch, to Gitcoin Grants Round 1 to Grants Round 13, to experimenting with side rounds, and dGrants Alpha.  We have learned a lot from these efforts.  They have informed the direction for Grants 2.0. One day, I hope to see large complex & mission-critical software projects run out of DAOs.  Until then, Holdings is happy to pinch hit. For now, if you would like to help Grants 2.0 be successful, please reach out to @lthrift and @kevin.olsen to see how you/your group can help.  If you have questions about Grants 2.0, I invite you to bring them to an upcoming DAOVibes or comment below. ",
                    "links": [
                        "https://github.com/gitcoinco/web/",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "http://gitcoin.co/",
                        "https://gitcoin.co/results",
                        "https://gitcoin.co/blog/introducing-gtc-gitcoins-governance-token/",
                        "https://gov.gitcoin.co/t/proposal-the-gitcoin-foundation-a-proposal-to-represent-the-gitcoin-dao-irl-by-a-cayman-islands-foundation/9983",
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855",
                        "https://github.com/gitcoinco/web/",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/kernel-evolves-a-new-leaf-for-gitcoin-dao/9912",
                        "https://proofofpersonhood.com/",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/articulating-gitcoindaos-impact-on-the-world/9994",
                        "https://gov.gitcoin.co/t/gitcoin-aqueduct/9684",
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855/2",
                        "https://schellingpoint.gitcoin.co/",
                        "https://twitter.com/josephdelong/status/1486826871195152386",
                        "https://gov.gitcoin.co/t/decentralize-gitcoin-workstream-budget-request/8121",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://gov.gitcoin.co/t/a-world-where-qf-enhances-every-income/10202",
                        "https://gov.gitcoin.co/t/the-overton-window-for-grants-2-0/10461",
                        "https://gov.gitcoin.co/t/the-plateau-of-productivity/10269",
                        "https://gov.gitcoin.co/t/gitcoin-product-collective-how-to-map-software-teams-to-workstreams/10204",
                        "https://gov.gitcoin.co/t/gitcoindaos-final-form-maximum-coordination/10605",
                        "https://gov.gitcoin.co/t/prepping-cgrants-for-its-final-voyage/10777",
                        "https://gov.gitcoin.co/t/proposal-gr14-round-structure-grants-eligibility-update/10632",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-8-2022/10032",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-11-2022/10277",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://gov.gitcoin.co/t/impact-certificates-proposals-wanted/10499",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522",
                        "https://gov.gitcoin.co/t/roadmap-to-network-utility/10546"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.639579138561697
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#2",
                    "likes": "6",
                    "time": "07/03/2022-16:49:45",
                    "content": "    owocki:  especially learnings about different QF mechanisms (but maybe other mechanisms - I’ve got my eye on Effective Altruism + Retroactive Public Goods Funding right now - both promising non-QF mechanisms for doing good) .   i LOVE that we are going into this discovery space. Quadratic Funding is a fantastic mechanism for public goods funding but it is just 1. It’s a brainchild from a Vitalik post, if I understand the history correctly. What other communities or leaders have these ideas simmering, that would love to see their version of community funding turned into a platform/protocol that’s accessible in the age of digital economics? Communities hold so much wisdom about how they should be governed, how they should be sustained, how redistribution of wealth should happen for them. I have a friend from Tijuana who observed the ways that Mexican extended families and neighborhoods created lending pools, and decided to build that as an app (tanda dot io). This is genius because he was taking a structure that the on-the-ground community was already familiar with, that was at risk of being left behind with their parent’s generation, and propelling it fwd to something the young people would continue to use. I’d love to see Gitcoin having it’s own story arcs like this. Find community economic tool, research it, turn it into an ethereum-supported app in a way that expands its impact while decentralizing/democratizing it. How do we start that? R&D groups within the DAO focused on community economic tools? Does this already exist? Do i just need to hang out in the Public Goods Funding workstream more?  What about bounties for folks who take an idea surfaced in that research and build out POCs? Or alternately, a pipeline from that thinktank/research group to Moonshot Collective who is already set up to POC-ify such ideas?     owocki:  We (or later, DAO workstreams) would staff an account manager who would make sure your round goes well.   This is getting me excited about a DAO-native version of this role: a grants round maestro for hire. I think the impact of Gitcoin Grants would expand in the direction you’re talking about in this post if we had a pool of folks who had done the role of being an account mgr for a grants round, maybe by shadowing one of our staff or going thru a mentorship program, but they aren’t a gitcoin staff person themself. They would be a free agent who we as the DAO put some effort into training, in exchange for the agreement that they would pay it forward by remaining in the ethereum public goods ecosystem & helping future users of GG run their own instances/matching rounds ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.879578754578755
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/pandeyanujk",
                    "index": "#3",
                    "likes": "1",
                    "time": "29/03/2022-06:28:30",
                    "content": "@owocki thanks for writing this short & vital post! Really looking forward to Grants 2.0. I like the name “the dGrants” (or something that signifies the decentralized part) as opposed to the version #s.  This is because the latter clarifies within its name the key difference between the two grant software. It’s a hard problem that will require diverse ways of looking at the solution space for use cases such as grant discovery mechanism, fund distribution & fund matching varieties, dispute resolution among others. What an amazing time to be part of the DAO to witness this massive shift & participate to add value! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/TyHagler",
                    "index": "#4",
                    "likes": "2",
                    "time": "13/04/2022-12:33:59",
                    "content": "@lthrift @kevin.olsen We have a growing community of medical technology professionals with an emerging use case for Grants 2.0 to be applied to healthcare innovation. The proof-of-person requirements have been a barrier for adoption, however. What is the best way for us to connect and chat further? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lthrift",
                    "index": "#5",
                    "likes": "3",
                    "time": "13/04/2022-14:08:13",
                    "content": "Super interesting! Can you shoot us an email with some more details in your use case? lindsey@gitcoin.co and kevinolsen@gitcoin.co ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.430555555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#6",
                    "likes": "6",
                    "time": "15/04/2022-16:13:32",
                    "content": "Here is my working list of what I’d love to see built on top of a thriving grants 2.0 developer ecosystem, in case its interesting to anyone  pairwise QF, MACI QF, retroactive public goods funding, dominance assurance contracts, or effective altruism x proof of impact on top of it. pub/sub interop with any/all other grants programs out there.  We could do this through a combination of  great documentation great devrel gitcoin hackathons holdings would be interested in building some of this software.  Per our convo on the call this am @nategosselin @lthrift @kevin.olsen ",
                    "links": [
                        "https://gov.gitcoin.co/t/proof-of-impact-proposals-wanted/10179"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1625000000000005
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#7",
                    "likes": "1",
                    "time": "27/04/2022-14:20:07",
                    "content": "Amazing! I can’t wait to download, install and create a new round! I always love to focus on the end goal and the truth is that Grants 2.0 will become one of the most empowering tools out there! I guess we will have thousands of people with a similar mindset in the beginning! There is no shortage of ideas wrt to creating a new QF round! \" This is an amazing solution and I’m sure that the implementation will be supported by everyone! We have a lot of brainpower and also beautiful souls in the DAO  and figuring out ways to help them manifest their visions is really altruistic! I still need to digest and figure out all these moving parts here and how could the FDD and the GIA initiative within the FDD help protect Grants 2.0 from threats to legitimacy, credible neutrality, and sustainability. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.681818181818182
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Alis0r",
                    "index": "#8",
                    "likes": "0",
                    "time": "06/05/2022-08:16:43",
                    "content": "    owocki:  Grants 2.0 is GitcoinDAO teaching you to fish.     Grants 2.0 is GitcoinDAO teaching you to fish.  Amazing! Have you got precise impact priorities per year? You have “preferences” as Gitcoin? On what do you think would be very important to concentrate your funding efforts to create impact on what you want to see different in the world? Example 1st year would like to focus on Environment :carbon farming and offsetting Social justice : fair working conditions Food soveregnity : local commonal regenerative farming Social Networking : decentralized socials Human Evolution: decentralized communities of practice (s) Conflic Resolution : Inter-culture learning for Web3  Economy evolution : circular design products (R&S), regenerative BMs — The choice of priorities could be based on data concerning majory global challenges but also other criterias, based on other data coming from the bottom-up. Could for example do some “surveys” to ask to people what they would like to see different in their territories and on the planet. I suggest as economic efficiency also to “pair” different proposals having shared elements, this would create several advantajes:  enlargement of the project team and its competences promoting collaboration VS competition supporting redistribution promoting networking It can be optional to accept the “merging”.  I also suggest testing grants funding schemes, specifically dedicated to tests for most innovative ideas so to do not waste money — so if you see a proposal that’s quite “out of line” maybe you can fund it to develop a preliminary test — than to be funded by a second round. I know this makes the thing more complex but it’s more efficient in my view, also because you can follow different innovation trends and measure impact at stages. It would be good also to allow people embedding some impact creation methodologies per thematic within their grants requests, so they design the proposal in order to impact and they haven’t got to “adapt” it in the executive process to some impact creation — giving them the opportunity to individuate impact indicators to which to refer in the proposal design phase could make the process of impacting smoother. I don’t know if you have but are there standard procedures for grants’ management and programming in your environment? I guess so, if you could make this also intelligible as a sort of final objectives list for grants seekers — maybe you could start attracting the kind of grant seekers able to create the impact you want to also outside of your environment ---- to scale the impact, I mean ;D. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8417892156862745
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/llllvvuu",
                    "index": "#9",
                    "likes": "1",
                    "time": "26/08/2022-17:41:55",
                    "content": "Something that’s really exciting about this is it brings us one step closer to getting adopted by small municipalities (somehow I feel a strong urge to say “exit liquidity” ). They have a lot of tools in place already such as money (taxes), passports, and - as much as I hate to say - surveillance data that can be used to compute plural pairwise coefficients and perform FDD. At the same time, they will have extremely stringent standards and requirements, as well as massive risk that comes from scale (both in number of people, and amount of funding). It also begs the question of whether we need to go hard on chain-agnostic and/or token-agnostic to get massive adoption. Overall an exciting challenge that will test the flexibility and forkability of our modular system and repository of modules ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.819444444444445
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shahid1956",
                    "index": "#10",
                    "likes": "0",
                    "time": "06/09/2022-10:19:43",
                    "content": "Very amazing. I am also excited. More users will be involved on gitcoin platform  in future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0687500000000005
                }
            ]
        }
    ],
    "group_index": "1"
}