{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/improving-dao-community-relations-long/12484",
            "title": "Improving DAO-Community Relations (Long) ",
            "index": 12484,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "contributors",
                "stewards",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/chaselb",
                    "index": "#1",
                    "likes": "7",
                    "time": "04/01/2023-00:52:48",
                    "content": " Intro Through my (admittedly nascent) experience in the forum, I have a noticed a growing trend of what appears to be community and DAO misalignment, concern, and/or confusion (see here, here, here). I think part of this misalignment is caused by a legitimate concern of the DAOs finances, runway, and deliverables, and for those with limited context, a perception that the DAO internally is not doing too much to alleviate this concern. By better serving this context to its community, as well as by clarifying the nature of the relationship between DAO and community, I believe GitcoinDAO can form a healthier DAO-community relationship, and benefit better from the community’s collective intelligence and support. Below I synthesize all known sources of information (to my knowledge), what type of context they provide, and how easy it is to find. I also provide information on all of the different roles within the DAO community (both implicit and explicit, to the best of my knowledge), as well as the access given to these roles, and how likely they are to be able to find it. Finally, I provide suggestions on how context might be provided in better ways and how communication may be improved. Please feel free to suggest any edits or thoughts!  Sources of Information  Discord The discord is open to anyone, with even more permissions granted to those given the DAOCitizen role, which is pretty easy to earn (a short introduction of yourself will do it). I would consider this the most basic entrance into the community, along with the forum.   More info  Able to generally discuss the DAO and plans of the DAO Overall though, the discord chat is relatively inactive, with many questions going unanswered, and real discussion being infrequent Weekly DAOVibes call, although the topic of the call is predetermined. No general community townhall or anything of the sort There is also no channel or official avenue to ask questions/offer suggestions to internal DAO contributors as a community member There are, however, channels open to community members for each specific workstream, however, the activeness of these channels just depends Overall, I’d consider the discord a pretty low-context source of information. Not too much engagement there, with the exception of the DAO Vibes call which occurs regularly and has 10+ people show up and engage every week    Forum The forum is also open to anyone. It’s also pretty easy to find as a community member.  Less conversational than discord Where official proposals and Gitcoin documents are presented to the community Difficult to navigate. Since anyone can post, it’s hard to figure out what’s an important, ratified document, and what’s just a discussion/suggestion/opinion  Gitcoin Digest   The Gitcoin Digest is a weekly summary of everything happening in the Gitcoin DAO  It’ll note forum posts with a lot of attention It’ll highlight open proposals or recently finished proposals and their results It will highlight external DAO announcements, like the announcement of a milestone in one of the products A pretty good community resource that provides quick and solid context, but not really sufficient for a community member looking to dive deeper into the operations and performance of the DAO internally This resource is well advertised   CSDO Monthly Digest   A monthly summary of the decisions and discussions of the primary internal governing body of Gitcoin  This digest is new (started within the last couple of months) and gives deeper context on the inner operations and work of the DAO Provides link to CSDO calls and meeting notes    Notion The notion has a treasure trove of information on the DAO and its internal operations and direction: it’s where all of the workstreams do their project management and note-taking (to my understanding), but figuring out how to get to all of this information is a bit…difficult. Home page   Provides summary of the DAO. History, purpose, essential intents, and links to workstreams as well as the Steward Council.  A bit confusing, since at the top the purported mission is different than the purpose stated later on (I believe this is due to the fact that the TL;DR post that is featured at the top was written before the new purpose of the DAO was created) Although links to workstreams are provided, there is no quick explanation on what workstreams actually are, nor is there a direct link explaining what workstreams are, and what role they serve in the DAO Furthermore, there is no direct link on the homepage to the CSDO, which is an important governing body in the DAO (more on that later)   CSDO page   Explains what the CSDO is, why it was formed, and how it operates  Contains list of past meeting notes (which also contain links to meeting recordings) Contains link to database of CSDO decisions, but not super obvious to get there unless you already have context   CSDO Decisions   A database of all proposals made through CSDO, as well as which ones have failed/passed  Just a database, no explanation or link to an explanation to how these proposals are brought up and passed   Steward Council Page   No explanation or link to an explanation on what the Steward Council is, or even what a Steward is  Meeting notes on previous calls are available from this page, but it’s not obvious what they are It feels like a page built for internals, or people with high context already, as opposed to a page supposed to be giving context in a transparent manner   Governance Hub   A database of all important forum posts for getting context on GitcoinDAO  The closest thing we have to a wiki Not super readable    Calls DAOVibes   Weekly call open to all community members.  Limited in topic and scope. Rarely touches on internal DAO operations, mostly a call for getting feedback from the community or informing the community about a specific topic Call is recorded (audio only for right now)   All Stewards   A monthly call for all of the stewards.  Workstreams DO give operational updates here, so is a pretty good place for gaining context on the DAOs progress Call is not recorded (or at least the recording isn’t shared openly) (EDIT: Calls are now recorded) Meeting notes are available   Steward Council   A monthly call for the stewards on the stewards council (see below for more info)  Provides even more context and allows high influence stewards (as elected by the community) to ask questions and offer suggestions to DAO Contributors Meeting notes are available First call has not happened yet, so it might be recorded (EDIT: Calls are recorded)   CSDO   Weekly call for CSDO body (more info on them below)  Calls are recorded Thorough meeting notes are taken and posted in Notion Best way to gain in depth context on DAO Internals, though is time-intensive    DAO Roles Within the DAO, there are various roles, some both explicit and implicit, with varying levels of access and levels of context. Below is a summary of these different roles, ranked from least context to most context Community Members (DAOCitizen)   Info  Have access to weekly DAOVibes call Have access to a privileged DAOCitizen channel in discord as well as workstream specific channels (many of which aren’t too active) Have access to forum (can post and read) Have access to public CSDO calls   Token Holders   Info  Can vote/delegate Otherwise have the same context as non-token holders I think a lot of the frustration and confusion comes from this category, because they have token, and thus feel invested in the DAO’s direction, but typically don’t have as much context as the below groups, and that context is actually pretty hard to get   Stewards - Link   Info  Stewards initially was set up for cGrants round management (see below), but now that cGrants is being deprecated, it’s unclear what the role of stewards are (at least through the forum post as shown below)   What are stewards? - Setting grants round categories and sizes (how much funding should go to a matching pool for core infrastructure as compared to community or media?) - Determining what kinds of public goods we care about (e.g. is an open source project with VC funding still a public good?) - Defining what kind of behavior counts as a sybil-attack or collusion (when is collusion just squads vibing) - Finding credibly neutral ways to display grantees so that everyone has an equal shot at being funded   Have access to a monthly stewards call (see above “Sources of Info”) Have access to a good amount of context, and actually have an explicit onboarding process to get this context  Even still, as a new steward myself, it took some time to get situated with how GitcoinDAO works (particularly the internal dynamics, like CSDO and what they do)   Stewards Council - Link   Info  Elected from a workstream defined list of stewards Meets twice a month with workstream representatives and thus should have pretty high context considering they should get updated by workstreams bi-monthly   Core Contributors   Info  These are members of workstreams There is also some different categories within this role, but they aren’t super clear (trusted vs full-time vs part-time?) They have a lot of context: internal DAO communication channels on discord plus all of the above   CSDO - Link   Info  Each workstream gets two members Is the governing body of cross-stream operations within the DAO They have the most context  Unclear where their power stops and community power begins  Except for budgets. Budgets and treasury are very clearly community decisions      Conclusion/Suggestions Overall, GitcoinDAO does a fairly good job of working in public. A LOT of information is available not just to token holders or community members, but to the public at large. The problem comes in trying to find all of this information and parse through it. I’m sure many community members don’t even know all of this information is available to them. Right now, the best avenue to get context in the DAO is to become a Steward. But Stewardship suffers from the following problems:  Isn’t advertised widely Implies some form of responsibility (what if I’m just looking for context but don’t yet feel comfortable voting?)  Here are some suggestions for making it easier to obtain context within GitcoinDAO, and thus hopefully improve understanding and communication between GitcoinDAO and its community  Add some more context to the GitcoinDAO homepage: What are workstreams? What is CSDO? What is a steward? What is the role of a GitcoinDAO community member?  Some of this information is on linked forum posts, but I feel like this basic info should be right on the homepage   Form a Community Member Onboarding Checklist (similar to the Steward Onboarding Checklist) Advertise the CSDO digest in the Gitcoin digest Whenever a forum post is discussed in CSDO, comment a link to the CSDO meeting notes on that forum post  Long-term:  Create a very readable Gitcoin wiki (EDIT: MMM has a working draft) to host all relevant information, as opposed to having it scattered among forum posts Clarify the relationship and decision-making dynamic between the core DAO and the community Create some sort of formatted town-hall call with the community, where the community can pose questions to the stewards and/or core DAO  Let me know your thoughts and if I missed anything. ",
                    "links": [
                        "https://gov.gitcoin.co/t/discussion-series-evolving-the-gitcoin-brand-introduction-overview/12164/6",
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442",
                        "https://gov.gitcoin.co/search?q=Digest",
                        "https://gov.gitcoin.co/search?q=CSDO%20Digest%20%40kylejensen%20%23governancevision",
                        "https://www.notion.so/GitcoinDAO-c91514f88cd34bf2847b82e26b9977d7",
                        "https://www.notion.so/1ab473386f74461c80b9409d0d400f0e",
                        "https://www.notion.so/dc117e21ea71400ea448cd9924230a71",
                        "https://www.notion.so/23fbc9c6535f4a6dab7b53d884cc4062",
                        "https://www.notion.so/55cc1b9289d548039d0cf2c802a0a0b2",
                        "https://www.youtube.com/@gitcointransparency",
                        "https://www.youtube.com/@gitcointransparency/streams",
                        "https://www.youtube.com/@gitcointransparency/streams",
                        "https://www.youtube.com/@gitcointransparency/streams",
                        "https://gov.gitcoin.co/t/introducing-stewards-governance/41",
                        "https://www.notion.so/f967d8d83e0a47aeb8a61564112233eb",
                        "https://gov.gitcoin.co/t/proposal-v2-of-the-steward-council/11639",
                        "https://www.notion.so/1ab473386f74461c80b9409d0d400f0e",
                        "https://gitcoin.notion.site/Gitcoin-Community-Hub-f3b76b0142c143ca928d087ea6dd2945",
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442/17",
                        "https://gov.gitcoin.co/t/csdo-charter-v1/12490/2",
                        "https://gov.gitcoin.co/t/experiments-and-learnings-in-community-engagement/12529"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.79464417696125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/alexdwagner",
                    "index": "#2",
                    "likes": "4",
                    "time": "04/01/2023-01:32:27",
                    "content": "This is a great post, Chase. I agree that clarity and context is needed and I think your audit here is valuable and thorough. I would love to be a part of a team to address this issue, and to help more transparency and context for the community. cc’ing @garysheng in case he hasn’t already seen this  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#3",
                    "likes": "2",
                    "time": "04/01/2023-04:05:09",
                    "content": "Thanks for listing out these sources of information @chaselb.  You are very sincere in your efforts to help share information about Gitcoin!  I wish I had this resource when I started poking around Gitcoin  A few questions I still have after reading this:   Where do we find information about the token?  What is it used for? Whats on the roadmap?  In a competitive market with 1000s of competing tokens, why should people even care about the token?   Whats on the DAOs roadmap?  What are the goals for this quarter? year?  How are they tracking?   How do I reach people in different parts of the DAO? Is there an organizational chart of ppl who work for the DAO?  Are there open positions?   Where do we find information about the protocols?  How is adoption going?  How do i set up Gitcoin Grants protocol or Gitcoin Passport in my DAO?  Whats on the product roadmap?   What is the difference between https://gitcoin.co/ and https://gitcoindao.com/ ?       chaselb:  it’s unclear what the role of stewards are    I think this is problematic bcus Stewards seem like a core part of DAO governance.  ",
                    "links": [
                        "https://gitcoindao.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#4",
                    "likes": "5",
                    "time": "04/01/2023-17:37:56",
                    "content": "Thank you for sharing your thoughts here @chaselb! The insight is incredible valuable, and you raise some great points. I can speak to some of them:     chaselb:  There are, however, channels open to community members for each specific workstream, however, the activeness of these channels just depends   These channels unfortunately slowed down to community members as hiring slowed with the economic conditions, most conversations are very product-focused and happening in channels visible to current contributors to a specific workstream, or within the pods channels which are open to all citizens. Currently, the purpose of a workstream general channel is to have general discussion + updates on the work your workstream is doing, and foster a culture of “building in public”. This channel is also the go-to for general cross-stream communication and collaboration. We can definitely do a better job of utilizing these channels!     chaselb:  Overall, I’d consider the discord a pretty low-context source of information. Not too much engagement there, with the exception of the DAO Vibes call which occurs regularly and has 10+ people show up and engage every week   Our Discord is mostly meant for realtime conversations on active initiatives. For information sourcing, Notion is definitely the best platform to go to. But I’m sure Gary has been thinking about this!     chaselb:  CSDO Decisions  A database of all proposals made through CSDO, as well as which ones have failed/passed  Just a database, no explanation or link to an explanation to how these proposals are brought up and passed    Each item in the CSDO Decisions DB contains all context for each proposal. You can click into any item to see the outcome, a quick summary of what will change, as well as the full conversation(s) that happened surrounding that proposal!     chaselb:  All Stewards A monthly call for all of the stewards.  Workstreams DO give operational updates here, so is a pretty good place for gaining context on the DAOs progress Call is not recorded (or at least the recording isn’t shared openly) Meeting notes are available  Steward Council A monthly call for the stewards on the stewards council (see below for more info)   The first calls for these are next week, and both meetings will be recorded and livestreamed to our YouTube Channel! Thank you again for the valuable feedback, you’ve given me personally plenty to think about! I’m looking forward to hearing more of your thoughts in the future! ",
                    "links": [
                        "https://www.youtube.com/@gitcointransparency"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.028993055555556
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#5",
                    "likes": "2",
                    "time": "04/01/2023-23:26:23",
                    "content": "While I don’t agree with all of their points, I thought @Vega had some interesting points about DAO & Community alignment on this thread.    November CSDO Digest   The more Gitcoin insiders 1. have “Material Non Public Information” and the more 2. Gitcoin insiders are making decisions with their agency on behalf of GTC holders, the more the risks accrue to the project.   And the info from Bankless is interesting supporting material.    November CSDO Digest   There is a great Bankless podcast on this that just live-streamed yesterday. Here is a timestamped video explaining why. And here is a screenshot of that timestamped spot.    ",
                    "links": [
                        "https://gov.gitcoin.co/t/november-csdo-digest/12338/15",
                        "https://gov.gitcoin.co/t/november-csdo-digest/12338/15",
                        "https://youtu.be/jo1ZuhuCVZE?t=2208"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.21875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#6",
                    "likes": "2",
                    "time": "05/01/2023-16:07:35",
                    "content": "One difficulty I have is understanding when the conversation needs to be brought public. Before I discuss it with anyone at all? After conferring with a few people? Once there is some level of internal agreement? Perhaps for each case it is different? I do think we are learning and establishing norms. It is a very difficult problem. There is a big difference between an MNPI decision like a roadmap or GTC utility plan being withheld and the same items being discussed, but without enough agreement or consensus on solutions to qualify as information at all beyond what some nodes in the network are thinking. We need to find the right balance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.686507936507937
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/0x_sam",
                    "index": "#7",
                    "likes": "2",
                    "time": "05/01/2023-18:44:36",
                    "content": "Thank you, I like this Bankless chart a lot. The thing that speaks to me from this chart and the Bankless discussion is that the more security-like features that get built into GTC token design beyond pure governance (aka anything that accrues monetary value), the more important it is that we work to reduce information asymmetry. The raison d’etre of security laws is to reduce risks from information asymmetries and the whole point of “sufficient decentralization” is arguing that information asymmetry is not a problem as their are no differences from an “insider” and the general public. The more we can work in public across all work streams, the stronger the DAOs legal defense is against potential security law considerations. Long-winded way of saying let’s keep doing our best to always work in public whenever possible, especially if there is a material decision being made. Even if the sausage-making of decisions necessitates face-to-face meetings or DMs, it’s extremely important that the key points from the decision-making process find their way to public-facing channels to ensure there are no accidental information silos being formed that would count against us from a security law + information asymmetry perspective. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.04563492063492
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Vega",
                    "index": "#8",
                    "likes": "2",
                    "time": "05/01/2023-19:57:35",
                    "content": "    0x_sam:  The thing that speaks to me from this chart and the Bankless discussion is that the more security-like features that get built into GTC token design beyond pure governance (aka anything that accrues monetary value), the more important it is that we work to reduce information asymmetry.   Gitcoin dumps $1 million in GTC on market every month to fund it’s operations.  I strongly urge you to prioritize (1) reduce information asymmetry (2) remove incentive misalignments between insiders and GTC holders. Not because of some legal risk.  Because it’s the ethical thing to do. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.748299319727891
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Vega",
                    "index": "#9",
                    "likes": "1",
                    "time": "05/01/2023-19:59:49",
                    "content": "    DisruptionJoe:  One difficulty I have is understanding when the conversation needs to be brought public. Before I discuss it with anyone at all? After conferring with a few people? Once there is some level of internal agreement? Perhaps for each case it is different?   Knowing that risk comes from  info asymmetry on material information misaligned incentives  the questions I would ask myself are  is this information material to GTC holders? does this information create misaligned incentives between insiders, users, and GTC holders?      DisruptionJoe:  There is a big difference between an MNPI decision like a roadmap or GTC utility plan being withheld and the same items being discussed,   In my opinion both are material to the project’s future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.857142857142857
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/koday",
                    "index": "#10",
                    "likes": "0",
                    "time": "11/01/2023-23:59:23",
                    "content": "    chaselb:  Create a very readable Gitcoin wiki to host all relevant information, as opposed to having it scattered among forum posts   I think this is a great idea, it could be crowdsourced by workstream and updated bi-weekly or monthly to give community members a high-level overview of what was recently completed, what’s being worked on now, and some version of a roadmap. If workstreams were diligent with updating this it would give a pretty comprehensive view of all the moving parts in the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.65
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#11",
                    "likes": "1",
                    "time": "12/01/2023-09:40:03",
                    "content": "Originally, the knowledge base at support.gitcoin.co was supposed to be this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Viriya",
                    "index": "#12",
                    "likes": "5",
                    "time": "12/01/2023-13:47:30",
                    "content": "MMM is actually undertaking this now. It will be a Notion hub that’s segmented into different community audiences. The first draft should be done by the end of this week. I will link it here in case anyone would like to leave comments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/koday",
                    "index": "#13",
                    "likes": "0",
                    "time": "12/01/2023-17:43:46",
                    "content": "Oh awesome! That’s great to hear ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/llllvvuu",
                    "index": "#14",
                    "likes": "1",
                    "time": "23/01/2023-01:29:11",
                    "content": "Maybe a quick win would be to re-organize some of the stuff the DAO is already doing to be explicitly titled “Investor Community Relations” with a prominent page, someone being bestowed an official title of “Head of Community Relations”, and more conventional (familiar to traditional investors community members) format. or s/Community Relations/Token Relations I get the sense that when people describe themselves as “community” here, they are (unfortunately) not focused on how to help out, get involved, learn more about our programs, etc. They are looking for stuff like financial statements, quarterly earnings calls, forward guidance, etc. Probably a lot of what people are asking for exist, just not in the language/format/discoverability that they’re used to. It’s also possible to just burn the bridge and never raise token funding again. Perhaps Gitcoin needs public goods funding itself and is not fit for the weight of a token (imagine if the Red Cross had a stock…). If people bought the picotop they are already down over 90% and it may not be worth it to try and salvage that (and what happens if there is another bull cycle and the token balloons to a $3b market cap and the DAO is expected to return that? one must consider that GTC was literally airdropped for free and at no point did anyone ever promote expectations of it being worth anything - since that would of course be illegal). It’s not uncommon for orgs in such a financial position to restructure out their equity and when there is so little left to lose it often also brings investors peace of mind to see the chapter close. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.494696275946276
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/chaselb",
                    "index": "#15",
                    "likes": "1",
                    "time": "24/01/2023-02:24:00",
                    "content": "    llllvvuu:  one must consider that GTC was literally airdropped for free and at no point did anyone ever promote expectations of it being worth anything - since that would of course be illegal   THIS THIS THIS. I cannot emphasize this enough and thank you for mentioning it. The token was intended, and should remain, for GOVERNANCE. It is NOT an investment. In fact, if it were, it would probably be a security. And holding it/participating in this organizational experiment would probably be illegal. Even considering this, however, I think that having a page for those details relevant to holding workstreams accountable (financial statements, performance metrics, etc.) as this is relevant to those token holders who are holding token to govern. And ALSO having a page for community who wants to contribute. One could be the accountability hub and another could be the contribution hub. But yes, can we PLEASE burn the bridge. Every time I read “GTC price” on the forum a small part of me dies inside. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.225
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Viriya",
                    "index": "#16",
                    "likes": "3",
                    "time": "07/02/2023-16:32:05",
                    "content": "    llllvvuu:  Maybe a quick win would be to re-organize some of the stuff the DAO is already doing to be explicitly titled “Investor Community Relations” with a prominent page, someone being bestowed an official title of “Head of Community Relations”, and more conventional (familiar to traditional investors community members) format.   Thanks for your thoughts here @llllvvuu! As someone who is leading the marketing team (which was responsible for community relations OKRs last season) , I can attest that the issue of community relations is slightly more complex (or maybe just outright complicated) than it appears on the surface. Our community reaches far beyond our investors of GTC. Token holders are one of 8 stakeholders (last time I counted) that we feel accountable to engage with…each with vastly different needs and desires as it relates to engagement with our org. Grantee needs and desires are very different from the community of developers wants to build on our protocols which are vastly different to the needs and desires of our stewards, etc, etc. This kind of stakeholder segmentation is natural, of course. The issue is that there is no a shared definition of who our community is, how that community ladders up to org objectives. Is our community the sum of all of our stakeholders? Is it a subset of them? What constitutes community engagement vs stakeholder enablement? How would we like to engage with our defined community to help drive org objectives? There are a lot of unanswered questions as it relates to community strategy. MMM will not be taking on the task of answering these questions this season for a variety of reasons. My recommendation would be to have community engagement initiatives live in their respective stakeholder workstreams–but I also feel that there’s value in creating coherence across these segments with a “Head of Community Relations” role. I imagine as we discuss our organizational structure at ETH Denver, we will further this conversation to make sense of what’s needed. Very much appreciate the inputs and insights in this conversation. I think it provides great food for thought on steward/GTC holder needs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.854044412377746
                }
            ]
        }
    ],
    "group_index": "276"
}