{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-carbon-neutral-policy-at-gitcoin/10823",
            "title": "Proposal: Carbon-Neutral Policy at Gitcoin ",
            "index": 10823,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "regen"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#1",
                    "likes": "40",
                    "time": "06/06/2022-16:54:48",
                    "content": "Hey folks! KlimaDAO has been working with us for a while to help us estimate our carbon emissions . The working doc can be found here From the report by Klima there are two main numbers to focus on: 715 tCO2e - Our total carbon impact from the trading of GTC at the date of the report 1352 tCO2e - Our total carbon impact from the running of Gitcoin Grants (donations and payouts inclusive) These emissions represent our total on-chain emissions to date, representing all trading of GTC, all donations made during our grants rounds, and our grants payouts across Mainnet, zksync and polygon. Note: these do not address Bounties, Hackathons, Kudos, or any other on-chain emissions we may have produced to date.  Proposal for a carbon-neutral policy at Gitcoin I am proposing that we do two things: Ratify the intention to become fully carbon-neutral at Gitcoin DAO, and implement Phase 1 of a carbon-neutral policy In Phase 1, I propose we fully offset our on-chain energy usage for our Grants program and GTC token to date, and to agree to continue to offset our energy consumption for grants and GTC going forward. out of scope for this proposal. In a Phase 2 to be described in more detail pending completion of Phase 1, I believe we could pursue full carbon neutrality by reducing and offsetting our scope 1 and scope 2 emissions. This would require that we consider our total operational emissions, and the emissions of our products. These emissions would include all sources of greenhouse emissions we produce in the operation of our DAO, including the energy consumption from our other on-chain activities such as governance, treasury actions and contributor disbursements, usage of AWS or other SaaS products, air travel and resources consumed for our conferences and events, the emissions from producing and shipping swag, and potentially others. The effort to build a holistic emissions reduction and offsetting strategy would mostly likely require us to engage an outside group for consultation, the specifics of implementing this phase would require additional time and resources that are out of scope for this proposal.  What needs to be decided to complete our offsetting  1. Choose your Token We have several options for tokenized carbon credits available to us at this time. Prices as of 5 June 2022 Standard Offsets: BCT - Toucan’s Base Carbon Ton $2.01 UBO - C3 Universal Base Offset $2.78 Nature based Offsets: NCT - Toucan’s Nature Carbon Ton $4.52 MCO2 - Moss’s Nature-based Carbon Ton $5.81 NBO - C3 Nature Based Offset $4.08 There’s been some controversy about BCT and while these are Verra standard offsets many have critcized these as virtually worthless: Bloomberg - Are you a robot? But we would be able to cherry-pick particular projects from the BCT pool, this is in some ways a benefit to help the market find the true price of the BCT pool, and would allow us to offset with credits that come from some potentially worthwhile projects. Furthermore there have been some recent actions taken by Verra (their statement here) that have disrupted the tokenization of carbon credits (see Kilma’s response here, and Toucan’s response here). It’s still unclear what implications this has for web3 carbon projects, and for the moment Toucan is asking it’s community to pause bridging Verra credits on chain). For this offset, we could decide to avoid Verra credits altogether, and opt to offset via Redd+ projects only for this first initial offsetting program. We should also note that we have already had some offsetting done on our behalf by our friends at Toucan, and some carbon credits in our treasury with an early gift from Toucan: https://twitter.com/ToucanProtocol/status/1501520217100283912 This was a gift of 152 NCT burned on our behalf, as well as 54 tons deposited for us to use in the future: Polygon Transaction Hash (Txhash) Details | PolygonScan …and a nice NFT to commemorate: Ethereum Transaction Hash (Txhash) Details | Etherscan So for our total footprint for GTC trading and the Grants rounds of 2068 tCO2e, less the amount already offset and in the treasury, we have 1862 tons to purchase. If we do this with NCT our offset for Phase 1 will cost $4.52 * 1862 = $8416.24 I would welcome discussion on this approach, and if we believe we should choose a different mix of tokens, offset GTC separately from the Grants program emissions, or any other approaches the community might recommend.  2. Burn your Tokens Once we have purchased the tokenized carbon credits, all that remains to complete our offsetting is to burn those tokens.  3. Proof of Offsetting The beauty of doing this on-chain is the full history of the burning, purchase, and original tokenization is traceable back to the carbon credit, and the proof is all available on-chain. But we do have the ability to publicly dedicate our offsetting. For those that aren’t familiar, Klima offers their love letters project https://www.loveletter.klimadao.finance/ I really like this project and suggest we source our message here from the community.  Conclusion It’s time we take our green pills. I hope with the conversation we will have here that we can refine the proposal, gain sponsorship, and ratify the proposal to declare our intention to become fully carbon-neutral, and to execute on phase 1. I look forward to your feedback.  ",
                    "links": [
                        "https://carbon.klimadao.finance/BCT",
                        "https://carbon.klimadao.finance/UBO",
                        "https://carbon.klimadao.finance/NCT",
                        "https://carbon.klimadao.finance/MCO2",
                        "https://carbon.klimadao.finance/NBO",
                        "https://www.bloomberg.com/news/articles/2022-04-07/the-biggest-crypto-effort-to-end-useless-carbon-offsets-is-backfiring",
                        "https://verra.org/verra-addresses-crypto-instruments-and-tokens/",
                        "https://www.klimadao.finance/blog/response-to-verra-comments-on-crypto-instruments-and-tokens",
                        "https://blog.toucan.earth/response-to-verras-announcement/",
                        "https://twitter.com/ToucanProtocol/status/1501520217100283912",
                        "https://polygonscan.com/tx/0x8b46af182a596c399b76a56572dff1e68da824a49221dfdd49724d9fc3265f3b",
                        "https://etherscan.io/tx/0x52c7b0467c5d88a198fe6606ac2aa7a56cdb0ce91403fbc186c3dd0238456701",
                        "https://www.loveletter.klimadao.finance/",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-21-2022/10911",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-26-2022/11134",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-27-2022/11163",
                        "https://gov.gitcoin.co/t/gitcoindigest-28-2022/11215",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-25-2022/11086",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-22-2022/10972",
                        "https://gov.gitcoin.co/t/poap-edition-gitcoindao-digest-23-2022/11004",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24-2022/11060"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.433006535947712
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#2",
                    "likes": "8",
                    "time": "06/06/2022-17:08:51",
                    "content": "This is great! Thanks for putting it together @kevin.olsen! Personally Im a fan of going with the NCT over the BCT but it would be good to discuss all the options in more detail. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.45
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#3",
                    "likes": "5",
                    "time": "06/06/2022-20:15:26",
                    "content": "Thanks @M0nkeyFl0wer - I agree completely! I would love to see us support the Nature-based tokens over others. The total cost I projected here is just using Toucan’s NCT:     kevin.olsen:  If we do this with NCT our offset for Phase 1 will cost $4.52 * 1862 = $8416.24   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.03125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/es0",
                    "index": "#4",
                    "likes": "7",
                    "time": "07/06/2022-14:38:56",
                    "content": "I think this is a great initiative and something which helps ‘green’ cryptos image. I’d be in favor of selectively offsetting from the BCT pool (for cost reasons) or utilizing NBO, UBO, or MCO2. Would Gitcoin also want to hold KLIMA tokens to have a voice in the emerging on-chain carbon market? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Archimedes",
                    "index": "#5",
                    "likes": "12",
                    "time": "07/06/2022-15:01:54",
                    "content": "Hey great to see this come forward Kevin! As for highest quality i’d opt for UBO/NBO as they dont inherit the problems of BCT of Toucan. Glad we could help at Klima! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/cryptodonniedxb",
                    "index": "#6",
                    "likes": "4",
                    "time": "08/06/2022-08:27:17",
                    "content": "Great! I’ve been following both projects and I think UBO and NBO they have much higher quality. i’d go for that ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Atmosfearful",
                    "index": "#7",
                    "likes": "8",
                    "time": "08/06/2022-16:01:26",
                    "content": "Hey, awesome proposal, just wanted to point out: Beyond the loveletters campaign, we’ve been working hard to strengthen transparency and the Proof of Offsetting user journey. Now, when you create a retirement, you will get a shareable page for it like this: klimadao.finance/retirements/0x293ed38530005620e4b28600f196a97e1125daac/2 You can also explore retirements per-beneficiary 0x address, like this: klimadao.finance/retirements/0x293ed38530005620e4b28600f196a97e1125daac We are also working on a shareable public “home dashboard” for your carbon neutral commitments and retirements, which we call a “Pledge” (coming very soon!) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.197916666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/BrianOlympus",
                    "index": "#8",
                    "likes": "5",
                    "time": "08/06/2022-16:19:26",
                    "content": "great idea. All carbon types of good; BCT is most cost effective while UBO,NBO, or MCO2 are higher quality! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.9125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/KTOR",
                    "index": "#9",
                    "likes": "4",
                    "time": "09/06/2022-06:58:52",
                    "content": "Great to see this proposal. I think a combination of token types would be best. Say, selective retirement of certain BCTs paired with a nature based asset (NBO or MCO2). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.357142857142856
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ShimonD-KlimaDAO",
                    "index": "#10",
                    "likes": "4",
                    "time": "10/06/2022-17:32:26",
                    "content": "It was a pleasure to work on this together @kevin.olsen . I encourage Gitcoin folks to drop by our discord if you have any questions about our retirement aggregator, offsetting methodologies, or the Gitcoin emissions analysis linked in the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jabby09",
                    "index": "#11",
                    "likes": "1",
                    "time": "12/06/2022-23:34:16",
                    "content": "I think this is a great initiative and a well written proposal. Fully support and glad Klima could help. I agree with KTOR, selective retirement of certain BCTs paired with a nature based asset (NBO or MCO2). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.523809523809524
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bruderbuck",
                    "index": "#12",
                    "likes": "2",
                    "time": "13/06/2022-16:10:09",
                    "content": "Gitcoin and KlimaDAO would make a great fit here IMO! lets get Gitcoin fully green pilled  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/CCG",
                    "index": "#13",
                    "likes": "1",
                    "time": "13/06/2022-16:13:26",
                    "content": "Great idea - should definitely proceed with this. I personally would offset historical emissions with BCT and then move on to NBOs, MCO2s, etc moving forwards. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/donooor",
                    "index": "#14",
                    "likes": "1",
                    "time": "13/06/2022-17:45:46",
                    "content": "This match was made in Heaven. Would be amazing to see Klima spreading and integrating with OGs of the space such as Gitcoin. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/classwar",
                    "index": "#15",
                    "likes": "1",
                    "time": "13/06/2022-20:12:24",
                    "content": "Hells bells, this should happen all over the defi world! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/sambogoat",
                    "index": "#16",
                    "likes": "1",
                    "time": "14/06/2022-03:04:50",
                    "content": "All for more ecosystem integrations. I’d love to see adoption of UBO/NBO please. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#18",
                    "likes": "3",
                    "time": "14/06/2022-10:38:07",
                    "content": "    kevin.olsen:  But we do have the ability to publicly dedicate our offsetting. For those that aren’t familiar, Klima offers their love letters project https://www.loveletter.klimadao.finance/ I really like this project and suggest we source our message here from the community.   This would could be a fun community exercise. Overall, I’m very in support of your proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.046875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ecowealth.klima",
                    "index": "#19",
                    "likes": "0",
                    "time": "14/06/2022-11:18:47",
                    "content": "Yes and No, NCT is BCT which are TCO2’s(verra credits), its confusing. NCT were extracted from BCT, the pool. UBO and NBO, well klima has governance rights in C3 to analyze and vote on changes unlike what happened above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ecowealth.klima",
                    "index": "#20",
                    "likes": "2",
                    "time": "14/06/2022-11:26:09",
                    "content": "I am for all. BCT will be cheapest path to carbon neutrality then MCO2 NCT UBO NBO will put Gitcoin above and beyond going forward. The onchain carbon market will only succeed with quality offsetting and removal onward and that is the priority. Proving to verra that on chain carbon gets retired when ‘transferred’ from verra registry will improve our relationship with them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/marcel",
                    "index": "#21",
                    "likes": "10",
                    "time": "14/06/2022-14:25:18",
                    "content": "Great initiative  I’d like to mention that with Toucan’s TCO2’s the underlying credits that are in NCT/BCT you can retire the credits (which burns these carbon ERC20s immediately) and leave a message behind and specify a wallet address that is the beneficiary of the offsetting. You will get an on-chain RetirementCertificate NFT that will show the project data and amount you have retired  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/JamesFarrell",
                    "index": "#22",
                    "likes": "14",
                    "time": "14/06/2022-16:15:47",
                    "content": "    kevin.olsen:  f we do this with NCT our offset for Phase 1 will cost $4.52 * 1862 = $8416.24   Hey Kevin, support nature based projects with NCT would be ideal IMO. The price of NCT has fallen this week, so current costs with these high quality credits would be: Phase 1 would now cost $2.60 * 1862 = $4841.2 With NCT Gitcoin can event retire one of Verra’s premier projects - Rimba Raya Biodiversity reserve     kevin.olsen:  It’s still unclear what implications this has for web3 carbon projects, and for the moment Toucan is asking it’s community to pause bridging Verra credits on chain). For this offset, we could decide to avoid Verra credits altogether, and opt to offset via Redd+ projects only for this first initial offsetting program   The quality of the Verra credits, available in the Toucan NCT pool aren’t in doubt, and we paused bridging as we continue discussion in Verra. The legitimacy the tokenized carbon assets brought onto EVM blockchains can be trusted in terms of the rigour and security ensured in the bridging process. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2214285714285715
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/denyolo",
                    "index": "#23",
                    "likes": "2",
                    "time": "15/06/2022-08:47:21",
                    "content": "That’s great! I would suggest high quality tokens like NCT, MCO2 and NBO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.9
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lowestdefinition",
                    "index": "#24",
                    "likes": "3",
                    "time": "17/06/2022-06:39:24",
                    "content": "I would definitely opt for high-quality, nature based credits to avoid projects with questionable additionality and risk greenwashing. With Toucan having brought tens of millions of credits on-chain it‘s proven itself enough to recommend NCT. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/es0",
                    "index": "#25",
                    "likes": "2",
                    "time": "17/06/2022-13:18:30",
                    "content": "If Gitcoin considers NBO, they could selectively retire the Pacajai project. You can read about it here: [www].notion.so/offsetra/Pacajai-REDD-Project-84daa5d46df14f319bed2edfde2081b0 This project holds VCS and CCB certification (Climate, Community and Biodiversity). These KPIs ensure the project is having robust impact across both environmental and social domains. Looking forward to seeing this proposal progress! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.229166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nature",
                    "index": "#26",
                    "likes": "1",
                    "time": "17/06/2022-16:36:12",
                    "content": "This is really interesting. NCT is the highest quality and most liquid nature based solution/credits on-chain. Plus the price of NCT is so good right now - would be an affordable, high quality offsetting instrument! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.185714285714287
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nature",
                    "index": "#27",
                    "likes": "2",
                    "time": "17/06/2022-16:37:46",
                    "content": "Big agreement here! Gitcoin should definitely use NCT to select award winning projects that are in the registry to offset with. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/haywyer",
                    "index": "#30",
                    "likes": "1",
                    "time": "27/06/2022-16:46:57",
                    "content": "I would be cautious about using Redd+ offsets: “The project type with the largest share of offset credits on the market to date is Reducing Emissions from Deforestation and forest Degradation (REDD+). Studies on the outcomes of REDD+ projects document little actual climate benefit, concerns which have not been addressed by a shift to jurisdictional approaches.” https://carbon-direct.com/wp-content/uploads/2021/02/Carbon-Direct_Carbon-Plan_Berkeley-Carbon-Trading-Project_TSVCM-Comments-1.pdf ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.53125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/haywyer",
                    "index": "#31",
                    "likes": "2",
                    "time": "28/06/2022-00:40:22",
                    "content": "“If the question is can we ever, at 5 bucks a ton, produce something that’s meaningful, I think the answer is no” - Danny Cullenward, the policy director at CarbonPlan, a nonprofit climate research organization. \"Think of it as a donation,” Dr. Haya said, “not as buying credits to cover your emissions.” Do Airline Offset Programs Really Reduce Your Carbon Footprint? - The New York Times. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3939393939393945
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/johnx25bd",
                    "index": "#32",
                    "likes": "7",
                    "time": "23/07/2022-16:42:39",
                    "content": "Writing as a member of the Gitcoin community — I love this. Gitcoin is the right organization to pioneer climate action in Web3. I support the proposal in full. When it comes to how to bring the proposal to life, I think Gitcoin has a real opportunity here. I’d love to see the DAO use its expertise in internet-scale coordination to develop new ways of building a climate action program. I’m working on a few ideas here with some collaborators, we’ll share more soon — quadratic climate action?  The question is: how can we use the resources we devote to climate action to catalyze the most impact? I see a few avenues:  Financial  Looking backward ~$10k is not a huge amount, but it’s not nothing. I’d love to hear proposals from the community on which carbon projects most align with Gitcoin values, and selectively pick those from their respective carbon pools for retirement. We could quite easily build a retirement portfolio that we want to talk about. [ a bit about Filecoin Green’s selection tool ] Looking forward This is a bigger opportunity in my opinion. Much of the highest quality carbon credit supply is not available on-chain right now — it’s not even available in the big registries like Verra yet. I’d love for the community to develop tools to identify impact projects to support on a regular basis. This let’s us direct funding to the highest impact project categories in a flexible way. We have the privilege of working in a sector that is very comfortable with risk and moonshot ideas. I would love it if Gitcoin took some informed risks here and devoted capital to some out-there ideas that just might make a huge difference.  Governance / coordination  Composable governance processes mean we can lift and shift established Web3 decision-making patterns and apply them toward climate portfolio curation. At the moment, there are a few industry leaders that are thinking more in terms of impact than image. Stripe and Microsoft stand out. We should take a page from their book, and explore a Web3-native way of making sense of the highest-leverage use of our resources. To start this could be as simple as a few people monitoring new on-chain supply, and the community quadratically selecting a portfolio to invest in each quarter. This is a common need and we can easily build a tool / workflow useful to other DAOs. More on this below. (Related — is anyone working on a carbon curation DAO? Noting that this would definitely require deep expertise to be credible.) More broadly, how can we experiment with Web3 institution-building to create adaptive processes of deploying capital into the highest impact project categories, based on the scientific evidence? Web3 moves fast — can we lead the way and front-run the world by surfacing and accelerating the most promising new projects and technologies? Getting $30k to a promising new project could accelerate scaling by a year — which could make a huge difference to our future.  gitcoin-cdr622×622 52.5 KB   Vibes  Gitcoin leads when it comes to building Web3 culture. The greenpilled meme and the narrative building around cryptonative regeneracy is pushing and pulling our communities in the right direction. The money Gitcoin devotes to climate action will help, but continuing to activate the community and create the expectation for climate consciousness amongst Web3 builders and users could be a force multiplier on any funding we provide. This will obviously work best if it’s true to our values. But generally, this means really leaning in and devoting resources beyond the initial retirement funding. Any education campaigns should be optimize to increase both the motivation and the ability with which others in Web3 can take action to support the Earth. Overall I’m proposing that we take advantage of our strengths to make sure the efforts we make towards regenerating the Earth have the highest impact. This means using our resources to push the boundary — investing in next gen carbon projects, establishing forkable processes for DAOs to take climate action, and telling the story in an engaging way.  Steps forward First step is to choose which carbon tokens we want to retire to offset historical emissions. What does the Gitcoin community value? Technology-based? Nature-based? Established registries? Or new methodologies? My vote would be for the community to collectively design a retirement portfolio that showcases the best and brightest of Web3 carbon. I can see a few options to achieve this:  Delegate to a sub-committee Run a Twitter poll or two Put it to a quadratic vote A round of quadratic matching for a few carbon credit types in the next grants round Any other ideas?  To achieve this, we’ll need to identify which tokenized carbon credits are eligible to be included in the portfolio. This is pretty important — retiring low quality credits A: does not constitute legitimate climate action and B: would expose the DAO to negative press if (when) someone digs into the retirements. Transparency  Beyond the obvious candidates, I would personally advocate for us to save some funding to deploy into the next-gen and forward carbon credits that will be available on-chain soon. And of course, memes are everything — the storytelling should get a lot of emphasis. This collective retirement portfolio curation process is a community pattern we will be able to reuse … this past week in Paris the ReFi community came together and hatched some ideas … more soon™️  ☝ One challenge here: as a best practice, we would choose *specific projects* rather than the reference tokens, so we understand what we’re supporting and can tell that story. But nuance is the enemy of simplicity, so we could also ask a few trusted, informed community / DAO members to choose which specific projects we offset with.   Climate action isn’t a “thing” to be “done” — climate consciousness is a mindset to adopt. It’s one of the things that makes climate change such a challenging issue to address: humans want a finish line, and there’s no finish line here. There is no battle to be won. Gitcoin is a Schelling point for the hopeful. Let’s lead by showing an optimistic, organized, cogent example for taking catalytic climate action using these global coordination tools we’re all uncovering together. ",
                    "links": [
                        "https://behaviormodel.org/",
                        "https://www.trevorhinkle.com/blog/climate-change-is-a-journey",
                        "https://gov.gitcoin.co/t/gitcoindigest-28-2022/11215",
                        "https://gov.gitcoin.co/t/regen-vaults-public-goods-add-on-on-top-of-commercial-erc-4626-vaults/13185/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.828913966292607
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Cryptobeliever2021",
                    "index": "#33",
                    "likes": "0",
                    "time": "26/07/2022-22:07:08",
                    "content": "This is excellent. a good example is polygon matic. Gitcoin should work with projects like Klimadao to set up the long term carbon neutral plan. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.749999999999999
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#34",
                    "likes": "0",
                    "time": "27/07/2022-22:21:07",
                    "content": "Love your thinking here around how these kind of decisions should be made. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/BRMbm",
                    "index": "#35",
                    "likes": "0",
                    "time": "28/07/2022-06:47:14",
                    "content": "Great proposal discussion and thread. I’d recommend also looking at Carbon Collectible NFTs (ccnfts.io) - a super innovative approach to ensuring nature-based communities that are traditionally locked out of carbon markets can not only be included in the carbon offset economy but can generate tangible high-quality offset projects. I’m not affiliated with them in any way, just love the model. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/izkillaz",
                    "index": "#36",
                    "likes": "0",
                    "time": "04/08/2022-15:33:00",
                    "content": "I love this proposal! Very Green and Earth Friendly! Crypto people do love and care for the environment.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.667187500000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/0xAurelius",
                    "index": "#37",
                    "likes": "3",
                    "time": "23/02/2023-23:36:49",
                    "content": "Hi all, I’m hoping we can revive this discussion in the new year. Now that the Alpha Round is complete and Grants is live, I think a nice way to both solve this logjam of deciding how to allocate funding to different classes of offers and dogfood the new protocol would be to run a quadratic funding round matched by Gitcoin’s own funds to allocate across different carbon credit projects. For instance, we could select a few projects from each carbon credit pool (BCT, NCT, UBO and NBO, with MCO2 being another option but treated as a bundle of 4 projects rather than a single project) There two potential mechanisms for then allocating capital amongst those choices:  The community would then fund these projects just like any other grant round, and the funds would be used to retire credits from the selected project/pool. Alternatively, the new Snapshot Gitcoin Passport integration could be used to allow any GTC holders with a passport to vote on how the Gitcoin treasury’s funds would be allocated across a variety of carbon credit types via quadratic voting.  There is some concern about the DAO getting front-run and all of a given project getting used up before the DAO has a chance… so we might have to limit to only projects with relatively large volumes available relative to the size of the retirements to be made. As linked in the original post above, the KlimaDAO digital carbon dashboard has a list of how many credits from each project are present in each pool, we’d just need to narrow down that list to projects that fit Gitcoin’s constraints (mostly around having enough supply) Does that sound like a reasonable approach? If the approach sounds reasonable, happy to start the ball rolling by providing some info on a few projects in each pool I think might be a good fit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7214152806258065
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#38",
                    "likes": "3",
                    "time": "24/02/2023-13:05:56",
                    "content": "Hey, thank you for bringing this conversation back to life! Really timely, as you said, with the ability to use either the Grant Stack to QF fund our Carbon offsetting, or using a Quadratic Vote on Snapshot. I’m looping in @M0nkeyFl0wer and @shawn16400 to help think through the voting design, and Ben especially to ensure we’re building an impactful offsetting process. Let’s finally make this happen! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#39",
                    "likes": "5",
                    "time": "24/02/2023-20:40:49",
                    "content": "We’ve been talking  Stoked to see this coming together. Looking forward to talking next steps in more detail. Cheers y’all and thanks @0xAurelius ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                }
            ]
        }
    ],
    "group_index": "128"
}