{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-digest-37-to-gr16-or-not-to-gr16-the-dao-deliberates-the-pros-and-cons/11649",
            "title": "Gitcoin Digest #37: To GR16 or not to GR16? The DAO Deliberates the Pros and Cons \\xf0\\x9f\\xa4\\x94 ",
            "index": 11649,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "contributors",
                "stewards",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/alexdwagner",
                    "index": "#1",
                    "likes": "3",
                    "time": "12/10/2022-21:37:50",
                    "content": " 1442×260 92.3 KB   To GR16 or not to GR16?    This week, GitcoinDAO leads contributors pondered the merits of whether to have a Grants Round in December, and how that grants round might be modified, to meet both the needs of grantees and Ethereum-based ecosystems, as well as the needs of the DAO in launching dGrants. High-level, here’s what’s happening in the DAO this week:   Read: Janine posted a proposal on whether to run GR16 in December, so that DAO workstreams might focus their attention on shipping dGrants protocols in the Spring of 2023(Passport, Round Manager, Grants Hub). The proposal is open for comment. Please read it and leave your feedback!   Schelling Point happened this week, last Monday. This was our biggest Schelling Point yet. Thanks to Simona Pop for curating the event! If you couldn’t make it to the event, check out Gary Scheng’s live-tweet thread for a first-hand experience.   The ODS Hackathon is happening now, through 10/31. Interested in contributing to the open sourced future of Sybil defense? There’s still time to apply. Join here, or hop into the #fdd-hackathon channel in Discord.   Also, Dev Con Bogota continues through Friday. Gitcoin’s own Connor O’Day gave a talk titled “New Applications for Quadratic Funding”. Watch Connor’s talk here!   1600×1066 200 KB  Also, thanks to Vermeer, QZ, and Maxwell for operating the Gitcoin Impact Booth at DevCon this week! If you were in attendance, hopefully you were able to swing by to say hi and snag a Gitcoin astronaut plushie   1280×960 219 KB   FeymAVoWQAIHSbG2048×1536 499 KB   Keep reading for summaries of the most relevant governance forum posts from the past week, plus a roundup of what’s happening on Twitter in the world of public goods and Gitcoin, new Gitcoin blog posts, new GreenPill episodes, and our calendar of community events.  In this issue of the Digest:  DAO Kudos   Hot Topics   Twitter Roundup   New Posts in the Governance Forum   This Week’s GreenPill Episodes   Weekly Gitcoin Blog Roundup     New and Active Governance Proposals  Upcoming Events   And now, this week’s DAO Kudos!    DAO Kudos  “Feeling grateful for all the IRL connections happening in Bogota ” - Laura  “Huge kudos to Armando for developing an awesome roadmap for the impact report!!” - Laura  “Melissa for crushing user research and usability testing on Grant Explorer ” - Nate  “To Rohan and Sandy who are stretching their facilitation muscles ” - Jodi  “Great collaboration with Saf getting our Fraud Detection Data Analyst job description up and filtering from over 150 applicants to find the best ones to interview!” - Joe  “Big thank you to Kris, Kyle, Scott, CSDO & Stewards for building the V2 of the “Steward Council proposal”. “ - Shawn      Hot Topics A roundup of interesting topics of the past week from within the GitcoinDAO ecosystem.   From Twitter   Owocki announced the launch of SuperModular, “a venture studio that builds regen web3 projects, often on top of & adjacent to Gitcoin 's protocols (QF/grants/passport)”. SuperModular was previously known as Web3Events. Sign up for their email list at supermodular.xyz now, and receive your buidler POAP!   FDD is collab’ing with CryptoSapiens to host a series called “Open Data Science Live”. The first topic will be, “Sybil Slayers: Predicting and squelching attacks w open data”. @cadamstallard and other folks from BrightID and Orange Protocol will be joining the talk as well. The first Twitter Space will be 10a PDT / 1p EDT / 17h UTC on Thursday, 10/13. Set a reminder here.      From the Governance Forum We had an active week in the Governance Forum, to put it lightly. Lots to read and comment on this week!   [Request for feedback] Proposed Future for the Grant Programs and GR16 as we Transition to the Protocol, by Janine  This proposal was co-authored by Janine, Connor, lthrift, nategosselin, ceresstation, kevin.olsen, and Laura | Viriya, with feedback from other DAO contributors. In the proposal, Janine proposes that GitcoinDAO should consider running a modified, smaller Grants Round for GR16 in December, or perhaps not running a Grants Round at all, so that Gitcoin workstreams can focus their attention towards shipping the new grants protocols(Passport, Grants Hub, Round Manager). There is a lively discussion happening in the comments. Whether to host a GR16 in December and in what manner is a big decision, and will have an impact not only on the Gitcoin brand and ecosystem, but on the greater Ethereum ecosystem as well. In the spirit of the DAO’s values of transparency and open source ethos, we encourage you to read the post and comments, and add your own feedback there. Request for Comment: Add your comments to the thread here.    Proposal: V2 of the Steward Council, by shawn16400  In this proposal, shawn16400 gives concrete ways to evolve and improve the existing Steward Council. Shawn16400 proposes improvements in the following three areas: Updating objectives and role of the Steward Council, Steward council remuneration, and changing the selection process for steward council members. Request for Comment: Add your comments to the thread here.   “[Proposal] Ratify the Results of Grants Round 15…”, by Janine  This thread was originally posted on 9/30. Since then, a Snapshot proposal was created and passed with 100% for the proposal. Numerous comments have been added from GitcoinDAO workstream leads and stewards voicing their support for the proposal. Some commenters posted clarifying questions as well. If you were a GR15 grantee, the post is worth reviewing to better understand the payment process for matching funds, and the status of payments. TL;DR: The GR15 round results have been ratified and matching fund payments will be going out to grantees in the next two weeks.      From the Gitcoin Blog This Week   Introduction to Grants Protocol, by Julia Pepper  This post gives a short history of Gitcoin Grants, and outlines its “protocol future”. TL;DR: by creating decentralized, open source protocols we can empower communities in the Ethereum ecosystem to independently run their own grants rounds, to create a more resilient, interdependent, and thriving web3 ecosystem for us all. Creating open grants protocols is a natural progression of GitcoinDAO’s commitment to building and funding digital public goods for all.    Latest Episodes from GreenPill    Greenpill #50 – Kevin is joined by Christopher Vitale, Associate Professor of Media Studies, and a founding member of The Graduate Program in Media Studies at Pratt Institute, Brooklyn, NY. He’s also the author of, “Networkologies: A Philosophy of Networks for a Hyperconnected Age.” Kevin and Christopher chat about the inspiration behind Christopher’s book, how web2 and web3 networks compare and contrast, what the future of networks could look like, and so much more.   Greenpill #51 – Kevin welcomes some of the team behind Public Nouns: Nich Kesonpat, Sky Minert, and Ven Gist. Public Nouns is a Nouns extension focused on supporting Public Goods. The four chat about what Public Nouns is and the dynamics at play behind the project, what the future of public good funding looks like, how to scale it to reach the masses, and so much more.      Gitcoin Governance Overview Snapshot polls GTC Holders and Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, move on to Tally after being ratified on Snapshot.  Active Proposals:  Public Goods Funding S15 Budget Request (second try) – Ends Thursday, 10/14 (Tally)   Proposal Discussions:   [Request for feedback] Proposed Future for the Grant Programs and GR16 as we Transition to the Protocol, by Janine   Proposal: V2 of the Steward Council, by shawn16400   “[Proposal] Ratify the Results of Grants Round 15…”, by Janine    Latest Completed Proposals:  Ratify the Results of Grants Round 15 and Formally Request the Community Multisig Holders to Payout Matching Allocation – Passed (Snapshot)     Upcoming Community Events If you have an event you’d like us to include in the Digest, reach out to @alexdw5 on Twitter or Discord. Every Wednesday:   12p ET – DAO VIBES – our weekly open community vibes call. Happens in the Citizen Forum on Discord.  For up-to-the-minute updates on Gitcoin events, check out our Events Calendar!    New to GitcoinDAO?    TLDR - What is Gitcoin?   Become a Gitcoin Citizen!    If you would like to receive a succinct summary of the latest Gitcoin News in your inbox, sign up here! Help us improve the Gitcoin Digest by interacting with this pol.is! Add your statements and vote on what others have put forward. Remember to check back regularly to vote on new statements. Thank you!   Previous edition ",
                    "links": [
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624/7",
                        "https://twitter.com/Sim_Pop/status/1576912633730863104?s=20&t=ZTf0G-6FQH0yJmWHYGCjGA",
                        "https://twitter.com/Sim_Pop/status/1576912633730863104",
                        "https://twitter.com/garysheng/status/1579496222641246213?s=20&t=RAJZ3x97B-E9jiHIJRkDEQ",
                        "https://gitcoin.co/hackathon/datascience/onboard",
                        "https://devcon.org/",
                        "https://twitter.com/EFDevcon/status/1579966830063812617?s=20&t=nwkJ9z5qrOmREKfme0kXZw",
                        "https://www.youtube.com/watch?v=HaqYiE8W0yU&t=27807s",
                        "https://twitter.com/ha_vermeer",
                        "https://twitter.com/not_qz",
                        "https://twitter.com/publicmaxwell",
                        "https://twitter.com/CoachViriya",
                        "https://twitter.com/CoachViriya",
                        "https://twitter.com/heynate_g",
                        "https://twitter.com/0xJodiCee",
                        "https://twitter.com/safderwords",
                        "https://twitter.com/DisruptionJoe",
                        "https://gov.gitcoin.co/t/proposal-v2-of-the-steward-council/11639/",
                        "https://twitter.com/owocki/status/1579508166613946368?s=20&t=RAJZ3x97B-E9jiHIJRkDEQ",
                        "http://supermodular.xyz",
                        "https://twitter.com/CryptoSapiens_/status/1579910711777447936?s=20&t=6TZMRpvErGWrW8HtntCf0w",
                        "https://twitter.com/CryptoSapiens_/status/1579910711777447936",
                        "https://twitter.com/cadamstallard",
                        "https://twitter.com/BrightIDProject",
                        "https://twitter.com/OrangeProtocol",
                        "https://twitter.com/CryptoSapiens_/status/1579910714709315584?s=20&t=RAJZ3x97B-E9jiHIJRkDEQ",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624/7",
                        "https://gov.gitcoin.co/u/J9leger",
                        "https://gov.gitcoin.co/u/connor",
                        "https://gov.gitcoin.co/u/lthrift",
                        "https://gov.gitcoin.co/u/nategosselin",
                        "https://gov.gitcoin.co/u/ceresstation",
                        "https://gov.gitcoin.co/u/kevin.olsen",
                        "https://gov.gitcoin.co/u/viriya",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624/7",
                        "https://gov.gitcoin.co/t/proposal-v2-of-the-steward-council/11639/1",
                        "https://gov.gitcoin.co/u/shawn16400",
                        "https://gov.gitcoin.co/t/proposal-v2-of-the-steward-council/11639/1",
                        "https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-15-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/11593",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x41c47d0531dc252c1ae2e4caf256fa7c5f0c09bd71f4c02f543b111d3cf788ab",
                        "https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-15-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/11593/12",
                        "https://go.gitcoin.co/blog/introduction-to-grants-protocol",
                        "https://go.gitcoin.co/blog/author/julia-pepper",
                        "http://availableon.com/greenpill",
                        "https://www.youtube.com/watch?v=mecvIg1sXik",
                        "https://twitter.com/PrattInstitute",
                        "https://www.johnhuntpublishing.com/zer0-books/our-books/networkologies",
                        "https://www.youtube.com/watch?v=g3ocz7CpPys",
                        "https://twitter.com/PublicNouns",
                        "https://twitter.com/nichanank",
                        "https://twitter.com/0xd2_eth",
                        "https://www.tally.xyz/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/39",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624/7?utm_source=hs_email&utm_medium=email&_hsenc=p2ANqtz-_VzgkpZwiXRvGW8Zy3THTnJxR7kPsyQUjKRWtH18dsQ-z458R8L6QgZ58G2A4VjWuF8Lnh",
                        "https://gov.gitcoin.co/u/J9leger?utm_source=hs_email&utm_medium=email&_hsenc=p2ANqtz-_VzgkpZwiXRvGW8Zy3THTnJxR7kPsyQUjKRWtH18dsQ-z458R8L6QgZ58G2A4VjWuF8Lnh",
                        "https://gov.gitcoin.co/t/proposal-v2-of-the-steward-council/11639/1?utm_source=hs_email&utm_medium=email&_hsenc=p2ANqtz-_VzgkpZwiXRvGW8Zy3THTnJxR7kPsyQUjKRWtH18dsQ-z458R8L6QgZ58G2A4VjWuF8Lnh",
                        "https://gov.gitcoin.co/u/shawn16400?utm_source=hs_email&utm_medium=email&_hsenc=p2ANqtz-_VzgkpZwiXRvGW8Zy3THTnJxR7kPsyQUjKRWtH18dsQ-z458R8L6QgZ58G2A4VjWuF8Lnh",
                        "https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-15-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/11593?utm_source=hs_email&utm_medium=email&_hsenc=p2ANqtz-_VzgkpZwiXRvGW8Zy3THTnJxR7kPsyQUjKRWtH18dsQ-z458R8L6QgZ58G2A4VjWuF8Lnh",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x41c47d0531dc252c1ae2e4caf256fa7c5f0c09bd71f4c02f543b111d3cf788ab",
                        "https://twitter.com/alexdw5",
                        "https://calendar.google.com/calendar/u/0?cid=Y19pdHMwdGlmb2wybWtyZWVvbDQyOW5qNmhoa0Bncm91cC5jYWxlbmRhci5nb29nbGUuY29t",
                        "http://gitcoindao.com",
                        "https://primer.gitcoindao.com",
                        "https://gitcoin.notion.site/Become-a-Gitcoin-Citizen-7b83f9b5ca06487f84e0142d0180970a",
                        "https://form.typeform.com/to/ttNCMt8w",
                        "https://pol.is/2dc3urtbjf",
                        "https://pol.is/2dc3urtbjf",
                        "https://gov.gitcoin.co/t/gitcoin-digest-36-reflecting-on-gr15-and-looking-to-s16-plus-dev-con-and-schelling-point-in-bogota/11610?utm_source=hs_email&utm_medium=email&_hsenc=p2ANqtz-_VzgkpZwiXRvGW8Zy3THTnJxR7kPsyQUjKRWtH18dsQ-z458R8L6QgZ58G2A4VjWuF8Lnh"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.579229797979798
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/qijin",
                    "index": "#2",
                    "likes": "2",
                    "time": "14/10/2022-03:38:52",
                    "content": "周报#37中文版，欢迎订阅并关注中文twtitter（@GitcoinCN）参与互动！    news.gitcoinchina.com    GitcoinDAO 周报 #37 2022 是否如期举办GR16？本周，GitcoinDAO的领导贡献者们思考了是否在12月有一个Grants Round，以及如何修改该Grants Round，以满足受赠者和基于Ethereum的生态系统的需求，以及DAO推出dGrants的需求。首先，这是本周 DAO 中发生的事情：阅读： Janine 在 12 月发布了一项关于是否运行 GR16 的提案，以便 DAO 工作流可以将注意力集中在 2023 年春季发布 dGrants 协议上（Passport、Round...      ",
                    "links": [
                        "http://news.gitcoinchina.com/issues/gitcoindao-37-2022-1401406",
                        "https://gov.gitcoin.co/t/gitcoin-digest-38-bogota-recap-open-data-science-hackathon-continues-and-dao-stewards-v2-vote-is-up/11709"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/10/2022-01:24:43",
                    "content": "Thank @qijin for your efforts! 中文可以订阅周报 ： http://news.gitcoinchina.com/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "218"
}