{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/dai-and-gitcoin/13238",
            "title": "DAI and Gitcoin ",
            "index": 13238,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/pcfreak30",
                    "index": "#1",
                    "likes": "2",
                    "time": "11/03/2023-10:13:21",
                    "content": "I have been meaning to post this for a bit now, and with Silvergate and Silicon Bank (SVB) now impacting Circle I think it’s something for the DAO to discuss. Also, know that I am a project grantee so this does impact me directly, but I have no stake in the DAO. Given DAI’s exposure to USDC, I think it should be considered to move the default matching payouts to something OTHER than DAI. And I do not think USDC should be used or really any centralized stablecoin TBH. We are seeing live war room/black swan scenarios play out right now to show why we need to not be relying on TradFi-based currencies on-chain. I also somehow get the impression this is the start of the centralized stablecoin/TradFi version of UST. Shots have been fired. Gitcoin wants to grow and expand, but even if DAI has been trusted for a long time, a lot of projects, including them, are slowly getting captured by TradFi and making actual Defi that is not in TradFi control disappear. Food for thought from someone who is trying to build a truly decentralized web3 ecosystem. Kudos. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.248376623376624
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ale.k",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/03/2023-22:11:07",
                    "content": "Thanks for the thoughtful post @pcfreak30 - To speak only for my own opinion, I think it will be helpful for Gitcoin grow progressively more token-agnostic - for many of the reasons you bring up.  FWIW - this and future Gitcoin grants rounds are calculated in Ξ-native amounts (not USD/DAI), but we also allow different grant program owners to choose-their-own adventure… It will be interesting to see how the space evolves as banking ties break and bend, and I look forward to us all becoming more global in our outlook on what exactly constitutes a “stable” asset… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                }
            ]
        }
    ],
    "group_index": "339"
}