{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-onegtc-a-stablecoin-for-the-gitcoin-community/6505",
            "title": "[Proposal] $oneGTC - a stablecoin for the Gitcoin community ",
            "index": 6505,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#1",
                    "likes": "19",
                    "time": "16/06/2021-12:34:26",
                    "content": " TLDR  ICHI builds and incentivizes stablecoins for other projects, like $oneGTC - always redeemable 1:1 to $USDC, and backed by $USDC + your project token ($GTC). We believe any community should have it’s own medium of exchange to unlock the economic power it has - there’s no better place to start this public good initiative than experimenting with the Gitcoin community. Countries have their currencies. Brands have their loyalty program point. Crypto communities need to have their own MoE that can be used to incentivize users to retain value within the ecosystem. Looking to get Gitcoin’s community feedback and ideas on $oneGTC use-cases and initiatives.   A native medium of exchange for the Gitcoin community (throughout this post I will use the Gitcoin example, but the same applies for any crypto community with a native token) Today - Gitcoin allows grants and bounties to be paid in various currencies & stablecoins. With the introduction of $GTC, Gitcoin is ready to foster it’s own economic power, and encourage people to use the protocol native asset as the protocol mean of exchange. Problem - As with any utility / governance token - $GTC volatility prevent it from being used as a medium of exchange Solution - ICHI will launch $oneGTC - a stablecoin redeemable 1:1 for $USDC, backed by $USDC + $GTC. $oneGTC can be used across Gitcoin as a stable medium of exchange governed by the stablecoin holders. Anyone can mint $oneGTC by supplying USDC and $GTC to the mint contract. This creates a reserve of $USDC to ensure redemption at $1 and a community treasury of $GTC How - Gitcoin user contribute, pay grants, hold funding in $oneGTC - protocol native stable medium of exchange - users can benefit from discount on platform fees or other means of rewards for preferring to use the protocol native stablecoin - helping the protocol increase the utility of it’s token and create a token sink as collateral to $oneGCT Gitcoin community can use $oneGTC to:  Pay contributors in stablecoins - giving them a way to hedge token volatility + generate demand for $GTC token (unlike using other stablecoins that require to give up on your token to acquire it) Encourage users to donate in $oneGTC Pay bounties with the protocol native stablecoin Treasury diversification - Gitcoin can hold part of it’s treasury in a stable medium of exchange, while using $GTC token as collateral Create work bonds backed by income service agreements (ongoing discussion with @androolloyd)  ICHI v2 launch ICHI deployed a Decentralized Monetary Authority (DMA) which will deploy and manage the $oneGTC stablecoin. The DMA has been audited by Quanstamp and Solidified. It provides decentralized minting and redemption of oneGTC at $1. The DMA will manage collateral and yield strategies at the direction of the oneGTC community.  How will the launch of $oneGTC look like ? If the community is supportive of running this experiment, there are usually two phases to the launch of a new $oneToken, and a core principle of value exchange between the communities Phase 1 - Bootstrapping  ICHI will do all the heavy lifting of launching a $oneGTC, PR and marketing and providing liquidity rewards for $oneGTC minters and stakers. Gitcoin will support with it’s own rewards and/or endorsement of this experiment by proposing use cases where users can use $oneGTC in the protocol.  Phase 2 - adoption  Introducing new use cases for $oneGTC to drive adoption and growth.   About ICHI ICHI is a family of stablecoins (coins valued at 1 USD) designed to drive scarcity of member coins (ie, $oneGTC = $1). ICHI exists to provide price stability and community treasury to projects like Gitcoin, only the Gitcoin community governs its stablecoin treasury. How is the ICHI design better than other stablecoin designs? The peg is guaranteed; redeeming $oneGTC will always get the equivalent in USDC. However, unlike USDC, ICHI is 100% on-chain and non-custodial. When minting a oneGTC - you deposit exactly $1 - no need for over-collateralization, or getting into a debt position as the case is with other stablecoin projects. Who is behind ICHI? ICHI was created with a top team of devs from Microsoft, Amazon, RedHat, and IBM. ICHI had a 100% fair launch and has been community-owned from the first block. There was no pre-sale, no initial team cut, etc. ICHI already collaborates with top DeFi dex like Bancor (ICHI token whitelisted and co-invested for IL protection) Sushiswap, 1inch (rewards program in place), Balancer and loopring Towards v2, ICHI is in the process of launching new oneTokens for top crypto projects (list can be found in the ICHI telegram channel) Read more Website - https://www.ichi.org/ dApp - ichi.farm Docs- https://docs.ichi.farm/ Updated proposal here Proposal: $GTC-Backed Economy ",
                    "links": [
                        "https://www.ichi.farm/#/mint",
                        "https://docs.ichi.farm/",
                        "https://gov.gitcoin.co/t/proposal-gtc-backed-economy/8033",
                        "https://gov.gitcoin.co/t/proposal-gtc-backed-economy/8033",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-1/7424",
                        "https://gov.gitcoin.co/t/proposal-from-mask-network-conduct-token-swap-with-maskdao/8655/11",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-5/8075"
                    ],
                    "GPT-summary": "The post proposes the creation of a stablecoin called $oneGTC for the Gitcoin community, which would be redeemable 1:1 to $USDC and backed by $USDC and $GTC. The stablecoin would be used as a medium of exchange for the Gitcoin community, allowing for the payment of grants and bounties in a stable currency. The post seeks feedback and ideas from the Gitcoin community on the use-cases and initiatives for $oneGTC. The post also provides information on ICHI, the company behind the stablecoin, and its design and team.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.763052825552826
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/raullen",
                    "index": "#2",
                    "likes": "10",
                    "time": "16/06/2021-20:59:31",
                    "content": "This is a sensible proposal but what makes oneGTC different from DAI/USDT/… which are widely accepted within Gitcoin community? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/06/2021-00:45:30",
                    "content": "Hi @raullen, A good point I think is that you get more control using our ‘Own’ Stablecoin for example than using some DAI in many way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.833333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#4",
                    "likes": "5",
                    "time": "17/06/2021-10:04:28",
                    "content": "right, the key difference is that you need your project native token $GTC to mint a new $oneGTC, and when you pay in other stablecoins you have to give up on your token in exchange for that stablecoin. so If a community is incentivizing it’s ecosystem users to use it, you are driving another demand vector & token utility. In a way it’s similar to how brands retain and engage user via loyalty programs, frequent flyer points etc - you encourage them to transact with your local medium of exchange to drive stickiness and retention of value within your ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.283627087198516
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Imuetinyan",
                    "index": "#5",
                    "likes": "4",
                    "time": "17/06/2021-20:18:36",
                    "content": "GTC on its own was deemed to have no economic value (although that is strictly not the case as it listed on several exchanges), so pairing it with another stablecoins to create another token within the space can bring some challenges.  Anyway, your proposal is worth considering-if we put a little more definition on gtc as being more than just a governance token only ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0078125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nimnathw",
                    "index": "#6",
                    "likes": "1",
                    "time": "18/06/2021-10:43:38",
                    "content": "Since GTC is already trading and has a ‘value’ what stops the Gitcoin community from using it? If there is a need for a stable coin pegged to USD, ageUSD/ sigmaUSD type protocol is another option rather than a USDC backed coin. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#7",
                    "likes": "4",
                    "time": "19/06/2021-18:00:29",
                    "content": "    Imuetinyan:  GTC on its own was deemed to have no economic value (although that is strictly not the case as it listed on several exchanges), so pairing it with another stablecoins to create another token within the space can bring some challenges. Anyway, your proposal is worth considering-if we put a little more definition on gtc as being more than just a governance token only   $GTC is a governance token and as such over time it’s value will be driven by the value of the protocol it governs A stablecoin that serves the Gitcoin community and is backed by $GTC - will introduce additional utilities for the $GTC token, which in turn make it more deisrable to hold → drive more demand for the token and overall have positive impact on the project     nimnathw:  Since GTC is already trading and has a ‘value’ what stops the Gitcoin community from using it? If there is a need for a stable coin pegged to USD, ageUSD/ sigmaUSD type protocol is another option rather than a USDC backed coin.   Example - if Gitcoin pays contribuoters in $GTC, most of them will immediately exchange it to a stablecoin to hedge the USD value, adding price pressure on $GTC value. $GTC has only 1 out of 3 properties of money - Store of Value. Since price is volatile it cannot serve as a medium of exchange and unit of account. $oneGTC solve this problem and allows people to transact & save with it. other stablecoins are not backed by $GTC, so they do not drive demand to hold and use $GTC Not your stablecoin - not your money. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0046164772727275
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nimnathw",
                    "index": "#8",
                    "likes": "0",
                    "time": "20/06/2021-00:53:58",
                    "content": "there are both advantages and disadvantages. There are inherent weaknesses of ‘stable coins’, pegged or algorithmic, example-- IRON/ TITAN. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#9",
                    "likes": "3",
                    "time": "20/06/2021-06:24:51",
                    "content": "Right, not saying there isn’t risk when introducing any new practice or tools, but in this example I would highlight $oneGTC is not algorithmic - it’s 100% backed, redeemable 1:1 to $USDC and governed by $oneGTC holders, so it is the Gitcoin community itself that would dictate what / if strategies will be applied to the collateral - not ICHI or other 3rd party - and therefore take the risk profile that fits them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.371347402597403
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Imuetinyan",
                    "index": "#10",
                    "likes": "3",
                    "time": "20/06/2021-06:28:20",
                    "content": "    Lior:  Example - if Gitcoin pays contribuoters in $GTC, most of them will immediately exchange it to a stablecoin to hedge the USD value, adding price pressure on $GTC value.   A valid point raised here,we certainly do need a stable coin for the community. It will help take off pressure on GTC in times when people need to convert tokens to other forms to fund their projects ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.982142857142857
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/laocai",
                    "index": "#11",
                    "likes": "0",
                    "time": "20/06/2021-10:08:52",
                    "content": "How the stablecoin is really needed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ETHan1Elohim",
                    "index": "#12",
                    "likes": "0",
                    "time": "21/06/2021-16:21:01",
                    "content": "I think a $oneGTC could be very beneficial for the Gitcoin ecosystem. Mint and redeem for $1, all while building a $GTC reserve and providing a positive price impact solution for the native token. Those who work within the Gitcoin ecosystem could find using a $oneGTC to be a valuable medium of exchange, store of value, and unit of account. Using a stablecoin that provides a hard peg at $1 and benefits Gitcoin as a whole. Thus, making real business safer and more effective. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.168290043290043
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Yalor",
                    "index": "#13",
                    "likes": "4",
                    "time": "22/06/2021-05:54:55",
                    "content": "Hey @ETHan1Elohim I don’t think it makes any sense to create a stable coin for Gitcoin. It doesn’t really help us accomplish our mission of funding open source, plus there are plenty of other projects out there that provide stability pegged tokens that we can take advantage of. See for example the $RAI coin from https://reflexer.finance/ of $DAI from MakerDAO | An Unbiased Global Financial System these are solutions that work now and built by amazing teams. ",
                    "links": [
                        "https://makerdao.com/en/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#14",
                    "likes": "0",
                    "time": "22/06/2021-09:40:58",
                    "content": "    Yalor:  It doesn’t really help us accomplish our mission of funding open source,   ICHI is an open source project that allows any open source token community have it’s own stable medium of exchange, backed by that same community currency I think once you realize the potential , it is obvious how this primitive can be super valuable to help other open-source projects unlock value in their ecosystem. We propose Gitcoin to lead the way in experimenting with this -  full alignment to Gitcoins mission     Yalor:  plus there are plenty of other projects out there that provide stability pegged tokens that we can take advantage of. See for example the $RAI coin from https://reflexer.finance/ of $DAI from MakerDAO | An Unbiased Global Financial System these are solutions that work now and built by amazing teams.   Yes - there are many stablecoins out there - non of them is backed by $GTC - the whole idea of $oneGTC is serving the Gitcoin community & ecosystem Why it serve Gitcoin - you get a stablecoin that is backed by $GTC → to mint a new $oneGTC you need to deposit $GTC → it serves as demand driver for $GTC → support the Gitcoin project value. ",
                    "links": [
                        "https://makerdao.com/en/",
                        "https://gov.gitcoin.co/t/proposal-gtc-backed-economy/8033/28"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.741582491582492
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Qian666666",
                    "index": "#15",
                    "likes": "0",
                    "time": "22/06/2021-17:49:47",
                    "content": "非常棒，永远相信美好的事物即将发生。i iiiiiiiiii ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/dhtal",
                    "index": "#16",
                    "likes": "2",
                    "time": "23/06/2021-00:19:32",
                    "content": "Really good points here - definitely beneficial to the Gitcoin community to keep value within its own ecosystem and have a stablecoin that is backed by $GTC. When buying RAI, DAI, USDC, USDT, or any other stablecoin you have to sell your $GTC putting downward price pressure on the price. When minting $oneGTC you aren’t selling, but rather storing your GTC into a Treasury (Vault) which the community can decide how to invest. It removes those tokens from circulation and puts upward price pressure on the $GTC token. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.46875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#17",
                    "likes": "0",
                    "time": "28/06/2021-19:16:12",
                    "content": "A quick update on ICHI v2 launch - The first oneToken on v2 to launch is $oneFIL - a stable coin for the Filecoin community Introducing oneFIL: A Reliable Form of Payment for Filecoin’s DataDAOs and Storage Ecosystem | by Mr. Masanobu Fukuoka | ichi.farm | Jun, 2021 | Medium ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.458333333333332
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#18",
                    "likes": "0",
                    "time": "28/06/2021-19:28:07",
                    "content": "Since the topic has moved into a proposal status, I’d like to summarize what would be the next step to move forward in deploying $oneGTC and run an experiment in which ICHI and Gitcoin communities will push to experiment with a specific use case for $oneGTC:   Approve launching a $oneGTC - ICHI will be doing all the heavy lifting and deployment (this is contingent to a similar proposal passing an ichi community vote)   Support the launch with $GTC rewards for bootstrapping initial liquidity (ICHI will match with $ICHI rewards so both projects commit to the success of it)   Support an experimental use case for using $oneGTC in the platform - anything from paying grantees in $oneGTC, to providing rebate or cash back for using $oneGTC as the medium of exchange for contributions in the platform etc…   Adding this poll for a temperature check :     Yes - Gitcoin wants to launch $oneGTC and lead the way in experimenting  how crypto communities can benefit from having their own stablecoin! No - Gitcoin doesn’t want to take part in this experiment     0 voters     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4772727272727275
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#20",
                    "likes": "1",
                    "time": "05/07/2021-16:43:54",
                    "content": "Thank you for putting together this proposal. I agree with @Yalor on this. I don’t think it makes sense to create a stablecoin for Gitcoin either. There are many other stablecoins that the community can use right now and this doesn’t seem like a priority in regards to Gitcoin’s mission. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.101190476190476
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#21",
                    "likes": "1",
                    "time": "05/07/2021-18:41:23",
                    "content": "We have a call scheduled tomorrow with several Gitcoin stewards to discuss this proposal and brainstorm ideas. It would be great to have community members join the conversation! ICHI - Gitcoin  $oneGTC Tuesday, July 6 · 11.30am US Eastern Time (6.30pm CET) Google Meet joining info Video call link: https://meet.google.com/apr-xyzf-zgz Or dial: ‪(DE) +49 40 8081615268‬ PIN: ‪530 721 280‬# More phone numbers: https://tel.meet/apr-xyzf-zgz?pin=9549163415621 Would love ",
                    "links": [
                        "https://tel.meet/apr-xyzf-zgz?pin=9549163415621"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/martz",
                    "index": "#22",
                    "likes": "1",
                    "time": "06/07/2021-17:17:56",
                    "content": "This seems interesting but i’m not sure why it is a priority right now? IMO We haven’t observed GTC enough yet to know that it does not acheive all of these goals?  “Problem - As with any utility / governance token - $GTC volatility prevent it from being used as a medium of exchange”  there are plenty of governance token ecosystems / protocols that function well and don’t involve creating a stablecoin / gov token pair? Aren’t many stablecoins eventualIy just backed by USDC anyway? For finance  focused protocol like yearn (YFI/WOOFY)  i see the real value, but GTC and Gitcoin are quite different at the moment. I’m curious what the call yielded though, not trying to discourage this because is something that may become a problem in the future thx! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.630952380952381
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#23",
                    "likes": "2",
                    "time": "07/07/2021-18:30:37",
                    "content": "Hi @martz , the call went really well ! We clarified exactly the points you and others were asking around understanding the core value proposition for Gitcoin and $GTC by using $oneGTC, and how this doesn’t interfere to Gitcoin’s prioroties We will share here a summary soon. for now you and others are invited to join a group chat opened for ICHI & Gitcoin stewards to discuss $oneGTC https://t.me/joinchat/Ke8Vv4Cnfjk1ZDY8 ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-3/7876",
                        "https://gov.gitcoin.co/t/gtc-6-23-govern-as-a-member-live-discussion-in-chinese/5837/11"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/HelloShreyas",
                    "index": "#24",
                    "likes": "1",
                    "time": "15/07/2021-03:47:54",
                    "content": "Thank you for your proposal! Here are a few questions I have:   What if oneGTC just launched independently, updated Gitcoin governance on launch, and Gitcoin community members can decide whether to use oneGTC or any other stablecoin? Gitcoin tokenholders can also decide whether to provide incentives for oneGTC or not. We can revisit support from the treasury post launch.   What is your metric for success that would show a community benefited from its own stablecoin vs. using an existing one? Do you have any examples of successful community stablecoins?   How does oneGTC affect GTC, if at all?   From Gitcoin’s perspective, why not borrow/earn/diversify into USDC/DAI/RAI to pay opex rather than use oneGTC? What exactly are we missing out on?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.859375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#25",
                    "likes": "3",
                    "time": "15/07/2021-09:07:49",
                    "content": "Thanks @HelloShreyas. here are the (kind of) short answers - happy to elaborate on the group chat or schedule another community call:     HelloShreyas:  What if oneGTC just launched independently, updated Gitcoin governance on launch, and Gitcoin community members can decide whether to use oneGTC or any other stablecoin? Gitcoin token holders can also decide whether to provide incentives for oneGTC or not. We can revisit support from the treasury post launch.   We can do that. but we strongly prefer to do it together with the communities we build for. For us , getting support from  Gitcoin, the leader in promoting open source development, makes it even more important to join hands and experiment together     HelloShreyas:  What is your metric for success that would show a community benefited from its own stablecoin vs. using an existing one?       HelloShreyas:  How does oneGTC affect GTC, if at all?   Long term impact and value proposition for Gitcoin:  image1236×695 80.9 KB  While this is a long term play that doesn’t happen over night, there are benefits along the way for token holders and the community:      HelloShreyas:  Do you have any examples of successful community stablecoins?   Think about loyalty programs and frequent flyer clubs as a successful example in today’s economy - this is how brands retain loyalty and keep capital within their ecosystems. ICHI wants to allow crypto communities to do the same ! ICHI has launched v2 just a couple of weeks ago, and creating a sustainable economy takes time, I can post separately updates on the progress made with the first tokens to launch -  oneFIL & one1INCH (stablecoins for the Filecoin & 1INCH communities)     HelloShreyas:  From Gitcoin’s perspective, why not borrow/earn/diversify into USDC/DAI/RAI to pay opex rather than use oneGTC? What exactly are we missing out on?   When you pay in other stablecoins you give up on $GTC to buy them. When using $oneGTC you actually lock $GTC and reduce the circulating supply (cause $GTC is needed to mint $oneGTC) (cc @linda in reply to her comment) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.216666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#26",
                    "likes": "3",
                    "time": "23/07/2021-10:20:16",
                    "content": "Honestly, I think every token that has a marketplace should make a stablecoin Volatile tokens can be a speculative store of value (GTC has no economic value)  and CAN be used as a medium of exchange but as a unit of account they cause more problems than they solve… in fact, because of the unit of account issues, the medium of exchange use case is hampered. If a good plan and a team with a track record of success can be put together that can legit pull it off i would wholeheartedly support this effort. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/AwakeNing_Tong",
                    "index": "#28",
                    "likes": "0",
                    "time": "26/07/2021-04:47:12",
                    "content": "Sorry, I will object to it, because I don’t think this is necessary. Gitcon is an open community platform. It aims to develop towards decentralization. I have every reason to believe that the value of GTC will continue to grow and issue stable coins. It will slow down his development. You need to look farther when you walk, not in front of your eyes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.044444444444444
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lior",
                    "index": "#29",
                    "likes": "0",
                    "time": "26/07/2021-10:14:41",
                    "content": "On the contrary - $oneGTC is a long- term play - and is building on the belief of all of us here that  Gitcoin and GTC will continue and grow. oneGTC only support that and add utility to the token, making the $GTC economy stronger Decentralization wise - having it’s own stablecoin does increases the independency of the project, not having to give up on the project native token to get price stability using 3rd party stablecoins. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Yalor",
                    "index": "#30",
                    "likes": "0",
                    "time": "30/07/2021-21:44:52",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Yalor",
                    "index": "#31",
                    "likes": "1",
                    "time": "30/07/2021-21:45:21",
                    "content": "Closing this topic to shift all discussion toward the official DAO proposal Proposal: $GTC-Backed Economy ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "479"
}