{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/csdo-monthly-decisions-summary/11048",
            "title": "CSDO Monthly Decisions Summary ",
            "index": 11048,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "community",
                "CSDO"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#1",
                    "likes": "6",
                    "time": "01/07/2022-17:19:04",
                    "content": "Hey all! Key stakeholders use the weekly Cross Stream DAO Operations (CSDO) calls to voice their opinions in the decision-making processes used to steer the DAO toward its purpose & essential intents. These calls aim to maximize workstream buy-in and minimize unproductive time spent on executing ideas without key stakeholder approval. Each month, I will be compiling a summary of the decisions made in these calls and adding them to this post to improve transparency into how the DAO is collectively deciding to move toward our goals. You can find the CSDO meeting notes, current projects, and all decisions proposed during these calls in the CSDO Notion Page.   DECISIONS SUMMARY FOR JUNE 2022  1.  Delay S15 Start by One Month (to August) Meeting Notes: CSDO (Cross Stream DAO Ops) #37 Outcome: Passed   Outcome Summary This proposal passed. The S15 dates will remain the same, and the budget proposal timelines will be delayed by one month. Workstreams will use their reserves to bridge the gap. The next budgets proposed will be for 6 months, with a 3 month check-in.  2. Standardize a Set Norm Across the DAO (Suggest - Agreement to lessen volitility risk for workstreams when posting budget requests) Meeting Notes: CSDO (Cross Stream DAO Ops) #38 Outcome: Passed   Outcome Summary This proposal passed, and a set standard will be set to accommodate the effects of volatility on the funds received by workstreams. The standard will be to use the 20 day moving average of $GTC. The GTC total will be adjusted based on the current market value at the time this proposal is moved to Tally. The vote will be to send $xxx,xxx in GTC at either the current price or the 20 day moving average (whichever is lower).   DECISIONS SUMMARY FOR MAY 2022  1.  Hire a Scribe to attend CSDO calls Meeting Notes: CSDO (Cross Stream DAO Ops) #30 Outcome: Passed   Outcome Summary The proposal passed and Kyle Jensen was hired as the dedicated Scribe.  2. Delay Move to Snapshot by One Week Meeting Notes: CSDO (Cross Stream DAO Ops) #30 Outcome: Passed   Outcome Summary The proposal passed, and the process for moving budget proposals to Snapshot will be delayed until next week to allow stewards more time to meaningfully dive into budget requests. This also delays the execution of transfers into workstream multisigs by ~a week.  3. Ratify an Official Purpose and Essential Intents for Gitcoin DAO Meeting Notes: CSDO (Cross Stream DAO Ops) #32 Outcome: Passed   Outcome Summary The proposal passed, and an official Purpose and Essential Intents for Gitcoin DAO will be published.  4. Discord Structure Changes Meeting Notes: CSDO (Cross Stream DAO Ops) #32 Outcome: Passed   Outcome Summary It has been decided that discord management / structure changes do not need to be official proposals.  5. Consolidate Moonshot Collective & Builderband Meeting Notes: CSDO (Cross Stream DAO Ops) #33 Outcome: Passed   Outcome Summary This proposal passed, and the Moonshot Collective & Builderband communities will merge into one community. This will be announced in the forum, and the builderband channels in the discord will be archived. Builderband builders will be given the opportunity to opt into the merge.  6. Gitcoin Forum Organization / Visual Layout Updates Meeting Notes: CSDO (Cross Stream DAO Ops) #33 Outcome: Passed   Outcome Summary This proposal passed, and the governance forum will be updated to:  Create more fitting categories Provide a new visual layout Introduce tags   7. Update Organization of CSDO Calls Meeting Notes: CSDO (Cross Stream DAO Ops) #34 Outcome: Passed   Outcome Summary This proposal passed. The Tactical Tuesday and Strategic Friday CSDO calls will go through an organizational update to improve the structure and usefulness of the calls. ",
                    "links": [
                        "https://www.notion.so/gitcoin/CSDO-1ab473386f74461c80b9409d0d400f0e",
                        "https://www.notion.so/Budget-planning-kris-807f775c3cdb44ceb39c1e99ad01160d",
                        "https://www.notion.so/Joe-What-to-do-when-workstreams-receive-substantially-less-than-they-should-have-because-of-volati-258e4a115f574b86bd753985141fcb3f",
                        "https://www.notion.so/gitcoin/CSDO-Cross-Stream-DAO-Ops-30-801e1ed81193477c89da444df542475e#9590fb9590a346289173b7cbc83c4ef4",
                        "https://www.notion.so/There-is-a-growing-misalignment-among-GitcoinDAO-contributors-stewards-and-followers-about-the-org-fb9fa000812f4fbb86651639a7fa987e",
                        "https://www.notion.so/There-is-a-growing-misalignment-among-GitcoinDAO-contributors-stewards-and-followers-about-the-org-fb9fa000812f4fbb86651639a7fa987e",
                        "https://www.notion.so/Tensions-There-are-currently-three-builder-communities-within-GitcoinDAO-all-having-many-overlapp-ee1c4e48974f4bca869783f137d2b103",
                        "https://www.notion.so/Tensions-We-now-have-a-ratified-purpose-intents-and-our-forum-has-been-pretty-chaotic-for-quite-a-a826c4b6389e44fa87a18a76d6b4a815",
                        "https://www.notion.so/Kris-Proposed-update-org-CSDO-Calls-d8e2476cb0234175901231f32e6da7da",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24-2022/11060",
                        "https://gov.gitcoin.co/t/digest-44-decentralizing-gitcoin-grants-and-how-do-we-handle-protocol-adoption/12192"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.255347593582887
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#4",
                    "likes": "2",
                    "time": "02/08/2022-02:54:05",
                    "content": " DECISIONS SUMMARY FOR JULY 2022 Note: A DB containing all historical CSDO decisions can be found here  1. DAO Vibes Restructure Meeting Notes: CSDO (Cross Stream DAO Ops) #41 Outcome: Passed   Outcome Summary This proposal passed, and Saf will coordinate & moderate future DAO Vibes calls. ",
                    "links": [
                        "https://www.notion.so/PROPOSAL-DAO-Vibes-kris-d2b7e54e139f4147b1613000eea03336"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#5",
                    "likes": "1",
                    "time": "02/09/2022-02:00:58",
                    "content": " DECISIONS SUMMARY FOR AUGUST 2022 Note: A DB containing all historical CSDO decisions can be found here. You can also checkout the other topics and ‘soft’ decisions made in the CSDO weekly notes  1. S16 Planning Meeting Notes: S16 Planning Proposal Outcome: Passed   Outcome Summary This proposal had two parts, both of which passed:  Keep a cadence of 3 months for our season but alternate between ‘strategic’ and ‘tactical’ season preparations We start season 16 one month later to give Stewards more time to review and to get rid of the one month of delay in budget delivery.  ",
                    "links": [
                        "https://www.notion.so/gitcoin/CSDO-1ab473386f74461c80b9409d0d400f0e#3431b7891a26453fab6adc7ee6e2c5e4",
                        "https://docs.google.com/document/d/1rr9vjw8KbswE1e7J_niW1qYGxC0ObaSbbluj5VWxJFM/edit#",
                        "https://gov.gitcoin.co/t/gitcoin-digest-32-2022/11446"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.395833333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kylejensen",
                    "index": "#6",
                    "likes": "0",
                    "time": "30/11/2022-16:18:40",
                    "content": "Future updates can be found in the CSDO Digest thread! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "149"
}