{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gtc-tam-sam-som-analysis/12603",
            "title": "GTC TAM/SAM/SOM analysis ",
            "index": 12603,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#1",
                    "likes": "8",
                    "time": "19/01/2023-08:44:29",
                    "content": "One of the reasons why I’ve been spending so much time on Gitcoin is that there is a lot of room for growth here. That’s because I think it’s TAM (total addressable market), SAM (serviceable available market), and SAM (serviceable obtainable market) is really really high. These two slides explain these concepts really well.  TAM-SAM-SOM-Explained-what-is1200×654 38 KB  And this second infographic, which is slightly more complicated, explains the concept further.  b8d393f53ae53155c4b775c5bc2555471920×2484 247 KB   Gitcoin’s TAM/SOM/SAM I think that Gitcoin TAM/SOM/SAM look like this:  Gitcoin Passport How big is the market size for an web3 identity aggregator?     What Size Comment     TAM 5 billion Number of Internet Users per wikipedia    SAM 30 million Number of MetaMask users per decrypt    SOM 30 million The SOM is the same as SAM in my opinion.   Current Traction 188 thousand Number of GItcoin funders per gitcoin.co/results    Current Traction 100 thousand Number of GItcoin Passports per Gitcoin gov forum      Grants Stack How big is the market size for an web3 capital allocation stack?     What Size Comment     TAM $25 trillion/year Amount allocated to public goods per year per giveth    SAM₁ $10.8 billion Approximate total size of DAO treasuries per deepDAO    SAM₂ $1 trilllion Total Crypto Market Cap per coinmarketcap    SOM $10.8 billion The SOM is the same as SAM in my opinion.   Current Traction $72 million Total amount of public goods funding on Gitcoin so far per gitcoin.co/results      Token Swaps As you can see from this post, I am bullish on GTC doing token swaps (what you call Mutual Grants) with up and coming VC projects.     What Size Comment     TAM₁ $1 trilllion Total Crypto Market Cap per coinmarketcap    TAM₂ $800 billion VC Investments In 2021 per globaldata    SAM $21 billion VC Investments In Crypto 2021 per coindesk    SOM $21 billion The SOM is the same as SAM in my opinion.   Current Traction $100k Estimated Total Gitcoin Mutual Grants so far per this post      What insights can we derive from this information?  Gitcoin’s Growth will be an S-Curve Many of the graphs in the GTC Financial Model are quite naive because they show an exponential growth (J curve) growth. In reality, Gitcoin’s growth will be limited by it’s TAM, SAM, and SOM.   Room to Grow Gitcoin’s current traction is ~ 1/1000th of it’s SOM in almost all of the market segments that it is in.  That makes me really excited about room for growth. There is massive room for growth in this market!  All that remains between current traction + the SOM is execution and network effects!  Rising Tide Lifts All Boats A rising tide lifts all boats.  The nice thing about Gitcoin is that it’s being lifted by the rising tide of Ethereum’s growth.  We can expect that Gitcoin’s SAM/SOM will continue to grow as long as the EVM continues to gets adopted. ",
                    "links": [
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/3/35a27ff5758d6fd7aaa91517cb09a2d543e37209.jpeg",
                        "https://en.wikipedia.org/wiki/Global_Internet_usage",
                        "https://decrypt.co/95039/metamask-consensys-30-million-users",
                        "https://gitcoin.co/results",
                        "https://gov.gitcoin.co/t/gitcoin-updates-summarized/12337",
                        "https://youtu.be/DBGoX7DON54?t=118",
                        "https://deepdao.io/organizations",
                        "https://coinmarketcap.com/",
                        "http://gitcoin.co/results",
                        "https://gov.gitcoin.co/t/gtc-financial-model/12574/3",
                        "https://coinmarketcap.com/",
                        "https://www.globaldata.com/media/disruptor/global-venture-capital-investment-16-q1-2022-stays-resilient-finds-globaldata/",
                        "https://www.coindesk.com/business/2022/12/23/crypto-funding-plunged-in-2022-but-vc-head-sees-areas-of-opportunity/",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347/19",
                        "https://gov.gitcoin.co/t/gtc-financial-model/12574/3",
                        "https://gov.gitcoin.co/t/an-interactive-model-for-gitcoin-revenue-growth-forecasting/12625"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2386278195488725
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "4",
                    "time": "19/01/2023-11:31:25",
                    "content": "This is a great article. Thanks for sharing. We do have a lot of work to do to make this happen. I did an internal poll to get range estimates of what we might expect from protocol fees and services based on growth rate. I’m hoping we finish the model this week and I’ll put up a nice forecasting post to break it down next week. Here are the live results: Mentimeter Here are a few more details about what we are doing: [Discussion] Gitcoin 2023 - Future Essential Intents and Organization - #7 by DisruptionJoe ",
                    "links": [
                        "https://gov.gitcoin.co/t/discussion-gitcoin-2023-future-essential-intents-and-organization/12533/7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.471170033670035
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/vikrant6661",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/01/2023-07:42:50",
                    "content": "A great eye opener. Excellent one. Keep up the good work.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.166666666666668
                }
            ]
        }
    ],
    "group_index": "300"
}