{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/dao-compensation-sustainability/10604",
            "title": "DAO Compensation Sustainability \\xe2\\x8f\\xb3 ",
            "index": 10604,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "8",
                    "time": "14/05/2022-18:58:48",
                    "content": "GitcoinDAO has different starting conditions than most other DAOs. One effect of that is traditionally, people working at the Holdings company (corporate) have made salaries/benefits - like any corporation.  Gitcoin Holdings (the company that existed when the DAO originated) had a policy of paying team members US competitive market-rate-for-technology-companies-salaries, which in some cases, meant that often times our compensation policy meant offers were generated at compensation levels comparable to this:  Screen Shot 2022-05-14 at 12.34.08 PM902×338 65.2 KB  Screen Shot 2022-05-14 at 12.33.56 PM910×296 45.5 KB   Screen Shot 2022-05-14 at 12.33.53 PM712×314 53.1 KB  Of course, Gitcoin Holdings has venture funding & a business model (and revenue generated from doing virtual hackathons) that has allowed the corporation to generate offers in this category.  And even so, it is losing lots of money every month as it supports Gitcoin Grants (so perhaps this is not sustainable). The DAO does not, as far as I know, have a model for financial sustainability yet. But it does seem that the DAO has inherited the company’s compensation policies in some areas. I am writing this post because I see this trend is about to collide with market conditions. I want to name that.  By naming this trend, the DAO can get ahead of it. I believe that this sentiment is echoed in other stewards posts during S14 governance:    [S14 Voters Guide] Lefteris' Guide   I am running a company building opensource software in Berlin, Germany. We have a very constrained budget, yet we build amazing software. We are 7 people and we burn less in a year than some workstream budgets have asked for a quarter. I don’t know if they all expect “sillicon valley” salaries but considering the market conditions I feel a strong urge to say no to all this spending.   Lefteris has told me privately that full time contributors to Rotki make $30k - $50k per year.    Griff's S14 voter’s guide   For me the funding requests in general were just too much… way too much. I come from the perspective of Giveth, Commons Stack and Token Engineering Commons and most of these proposals are asking more than their yearly budgets!   Griff has told me privately that Giveth contributors make $19/hour.   GivETH v2 shipped with about $500k in funding. By way of comparison, Gitcoin Holdings pays roughly $300k/mo for software engineering.  And the DAO spends about $150k/mo on Moonshot Collective (the only software engineering organization natively in the DAO). Gitcoin has still not shipped Grants 2.0.  Here are some more thoughts on why.  Open Questions This leads me to a few questions I think the DAO should consider?  If I were to start this project all over again, should I have gone the Giveth/Rotki route? Is the DAO in for more hard times if it continues Holdings’ compensation patterns? Should GitcoinDAO pay six-figure salaries to its full time contributors, like the Holdings company did (perhaps unsustainably)? Is there a DAO-wide compensation policy in the works?  Should this policy be consistent in both times of abundance & scarcity? Can the DAO sustain these compensation policies if we are no longer the market leader? What is the DAOs compensation model?  What are the workstreams compensation models? What would have to be true for the DAO to create great software, become a market leader, get to financial sustainability, and pay web2-competitive salaries (the virtuous cycle I personally think the DAO should be aiming)?  I understand that these may be painful conversations to have.  But I see no alternative to getting these hard governance questions out in the open. As always, please remember I am just one node in the DAO network - and I have perspective given how long I’ve been in the project, but the governance of this question (and other matters of import to the DAO) are up the governance process. ",
                    "links": [
                        "https://www.indeed.com/jobs?q=software%20engineer&l=New%20York%2C%20NY&vjk=ed0910e8232509f7",
                        "https://gov.gitcoin.co/t/s14-voters-guide-lefteris-guide/10585/1",
                        "https://gov.gitcoin.co/t/griffs-s14-voter-s-guide/10594/1",
                        "https://gov.gitcoin.co/t/the-overton-window-for-grants-2-0/10461",
                        "https://gov.gitcoin.co/t/abundance-scarcity/10045",
                        "https://gov.gitcoin.co/t/the-overton-window-for-grants-2-0/10461",
                        "https://gov.gitcoin.co/t/a-dao-has-no-ceo/9852",
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v3/10358",
                        "https://gov.gitcoin.co/t/gtc-6-23-govern-as-a-member-live-discussion-in-chinese/5837/22",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-18-2022/10660"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4369918699187
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#2",
                    "likes": "7",
                    "time": "15/05/2022-18:04:51",
                    "content": " Lefteris has told me privately that full time contributors to Rotki make $30k - $50k per year.  That was supposed to be private!!1oneone.  (kidding). So It’s true. We are ready to pay up to $80k for the most senior engineer position but we have not yet found a good match for such a position. But indeed from these numbers you can see, that a lot is possible with smaller numbers. And it’s not we don’t want to pay more. We just can’t afford it since we are a small self-funded startup with some community support via gitcoin grants.   If I were to start this project all over again, should I have gone the Giveth/Rotki route?   I would definitely have gone with something leaner. But in retrospect we are all geniuses.   Is the DAO in for more hard times if it continues Holdings’ compensation patterns?   Absolutely. This is not sustainable.   Is there a DAO-wide compensation policy in the works? Should this policy be consistent in both times of abundance & scarcity?   That would be nice and would make sense as part of the DAO Ops subgroup.   Can the DAO sustain these compensation policies if we are no longer the market leader ?   It’s not a question of can (I think it can’t), but if it should. And imo it should not. It should try to become a lean machine that spends only as much as it needs to spend and not a penny more.  If there is any income, that income creates a surplus and we got abundance then we can revisit this.   What is the DAOs compensation model? What are the workstreams compensation models?   So far I see each workgroup doing their own thing and following no rules/framework/patterns. It would be nice to standardize everything as part of the DAOOps workgroup.   What would have to be true for the DAO to create great software, become a market leader, get to financial sustainability, and pay web2-competitive salaries (the virtuous cycle I personally think the DAO should be aiming)   Here I am gonna say something you may not like to hear. I don’t think DAOs can build good software. A DAO is a very political machine, getting into governance, trying to get everyone heard, doing votes, politics and what not. Good software is built by 1-2 architects/CTO and a small, lean and effective development team. I don’t think a DAO can build good software. Perhaps it can hire a team that will be able to and maybe create a very good and clear specification for them to implement. ",
                    "links": [
                        "https://gov.gitcoin.co/t/the-overton-window-for-grants-2-0/10461"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.306531531531531
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#3",
                    "likes": "2",
                    "time": "15/05/2022-20:41:31",
                    "content": "What would it take to change your mind re: “I don’t think DAOs can build good software?”  IF we could innovate along those lines, we could gain leadership IMO.  This is an enormous issue and challenge right now and arguably fixing it would contribute enormously to the future of web3 as a home for great software development. An idea I’ve heard recently in another context that might help is to provide as a central service core capabilities such as a pipeline and frameworks, tools and processes for sprints & epic planning, and so on.  We could look to instrument these in a DAO-friendly way also - so for eg enforcing design discipline in a pipeline & also rewarding following the process via recognition (poap-like for code reviews). TBH I’m learning a lot about GitCoin over the last couple of weeks.  It might be that the above sort of patterns are already in place.  I’m mostly reacting to your comment “no rules / framework / patterns”.  As you know from Deming and all others of that ilk, if you want to improve a process - step 1 is to have a process in the first place   If you have pointers as to where our processes for software dev are documented, I’m happy to stake a look and educate myself. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.157563025210084
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#4",
                    "likes": "2",
                    "time": "15/05/2022-20:56:36",
                    "content": "Just a comment that there is a related thread in March (DevRel @ GitcoinDAO) - about the current lack of DevRel as a practice.  Part of what a DevRel practice might offer to the broader community, as I think @owocki was articulating in the other thread, would be a set of practices and tools and pipelines (which tie the two together) that would be attractive to engineers building within our ecosystem. So the sorts of “devops” practices we are talking about in this thread would also be valuable as the basis for DevRel promoting GitCoin+ as a great place to develop. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.475
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#5",
                    "likes": "3",
                    "time": "16/05/2022-14:55:11",
                    "content": "    epowell101:  What would it take to change your mind re: “I don’t think DAOs can build good software?” IF we could innovate along those lines, we could gain leadership IMO. This is an enormous issue and challenge right now and arguably fixing it would contribute enormously to the future of web3 as a home for great software development.   id be curious what @kevin.olsen @lthrift have to say about this when they propose the Gitcoin Product Group workstream.  they also have experience updating the moonshot collective operating system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.204081632653061
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#6",
                    "likes": "5",
                    "time": "16/05/2022-19:26:55",
                    "content": "There’s so much to comment on here but I want to first focus on the actionable steps. Salary sustainability vs our treasury IS something we need to address. Assuming we are not in an emergency state currently, I propose this: We set a date ~1 month before the start of S15 to have a group strategizing call. In this call we present options that do justice to the humans of Gitcoin as well as to its mission. Options like: a) salary reduction for all b) new hires brought on at a lower rate, with leveling period across a few months where high salaries are lowered and new hires are raised (to find equality without making an earthquake in ppls lives) c) take a furlough d) high context/high salary folks go to 1/2 time Having this conversation in late June allows us the time to observe the market. It allows us the time to develop these options (treasury moves should be a big part of what’s creating options here IMO, and we just haven’t made those moves yet). And it creates space so that we’re not making rash decisions. The future of work honors people’s autonomy by giving them all the info they need to make the best decisions for their lives and for the causes they serve. At the same time, psychological safety is important and we owe it to ourselves to not YOLO some paycuts (as long as we are not in emergency state as I said at the top). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.664646464646465
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#7",
                    "likes": "1",
                    "time": "16/05/2022-23:34:08",
                    "content": "This is great. Thank you for stepping in Loye, hard times demand sacrifices, those who are here solely for high gains will drift away, those who are passionate about the mission will stay. A DAO wide salary reduction would be fair  .  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0152777777777775
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Huxwell",
                    "index": "#8",
                    "likes": "4",
                    "time": "18/05/2022-16:27:35",
                    "content": "There’s many aspects on compensation but this perspective stands out to me.  twitter.com    Chase Chapman 🌊 @chaserchapman  The way governance tokens work today isn’t sustainable  1) Governance power should be earned, not bought  2) Contributors shouldn’t have to give up governance rights (tokens) to pay rent   7:33 AM - 11 Jan 2022           383                47            If we have a proper DAO treasury diversification plan we can offer the option to be compensated in stable coins. An other long term option would be to use GTC as a utility token and create a new governance token. The virtual token used for CowSwap seems to be an idea we could learn from. Based on the twitter post above and the virtual token idea, we could compensate contributors with a standard ERC20 in conjunction with vGTC for which the amount could be weighted based on the contributions made or other params. But this would lead to a centralized governance model, so if anyone that is not a contributor wants to get involved in governance, then they could buy the utility GTC token and redeem it for vGTC. PS: We’re thinking of creating something along those lines for dCompass DAO. ",
                    "links": [
                        "https://twitter.com/chaserchapman/status/1480925824387792905",
                        "https://twitter.com/chaserchapman/status/1480925824387792905",
                        "https://twitter.com/chaserchapman/status/1480925824387792905",
                        "https://gov.gitcoin.co/t/the-utility-of-gtc/10071",
                        "https://github.com/gnosis/cow-token",
                        "https://gov.gitcoin.co/t/improve-gtc-liquidity-with-tokemak/10725/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2979797979797985
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lunacat",
                    "index": "#9",
                    "likes": "3",
                    "time": "18/05/2022-17:57:38",
                    "content": " An other long term option would be to use GTC as a utility token and create a new governance token. The virtual token used for CowSwap seems to be an idea we could learn from.  r/ethtrader donuts is another case study that could translate well to address this very fair concern. From Donuts FAQ: Q: What is CONTRIB? A: Whenever a user earns donuts, they earn an equal amount of CONTRIB. CONTRIB is a separate token and is non-transferrable. It essentially shows life-time earnings, even if a user has sold their donuts. It can also be used to potentially restrict some actions to users that earned their donuts, rather than purchased them. ",
                    "links": [
                        "https://github.com/gnosis/cow-token",
                        "https://www.reddit.com/r/ethtrader/comments/kl6ldu/donuts_faq/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.622402597402597
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#10",
                    "likes": "5",
                    "time": "18/05/2022-19:33:09",
                    "content": "I love these types of ideas. I am starting to really see the value in some “stable” portion of compensation, and then a “variable” portion of compensation. Having to sell your voice (aka, governance tokens) to pay bills doesn’t feel good. I want to explore this a bit more and I wonder if anyone is interested in helping us map out some options? @Lunacat - Want to join the conversations that @loietaylor may be facilitating soon? A few things for us to cover on that call: 1 - Options as Loie outlined on what it might mean to “cut contributor pay” 2 - Exploration on how to offer downside protection, and capped upside 3 - Exploration on multiple token types to bridge the compensation/voting details. I will defer to Loie on timing, but I know this is a top of mind for a few of us. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.880681818181818
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lunacat",
                    "index": "#11",
                    "likes": "1",
                    "time": "18/05/2022-19:55:54",
                    "content": "@kyle I’d be happy to (schedule permitting)!  I don’t feel particularly comfortable opining on others’ compensation (view that as the stewards role), but glad to help explore the other two items and anything else that might come up ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.21875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#12",
                    "likes": "9",
                    "time": "18/05/2022-21:48:08",
                    "content": "This is an interesting conversation, and feels to me like it’s flipping the script on web3, in a negative way. The narrative during times of abundance was that web3/DAO work offers an alternative to web2 in that it gives you more flexibility and optionality in terms of what you can do, without having to sacrifice financial incentives. What I’m hearing in some of these recent conversations is flipping to a more “if you’re passionate you’ll work for below market rate and be open to being exploited” mindset, which has been highly toxic in the web2 non-profit space. I get that we’re entering times of scarcity, but I think we need to be mindful of the effects of this narrative-shift and what long-term effects it could have on the space. Another thing to consider is the costs associated with a significant compensation reduction - i.e. if there’s a mass exodus beacuse current contributors can no longer afford to work at Gitcoin DAO (given that a large proportion of the core team is in the US, where the salaries we offer aren’t excessive by most measures), how far back would this set current projects, and what would the costs of rehiring/restructuring the DAO be? Just think there’s a lot of nuance that needs to be taken into account when discussing people’s livelihoods haha. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.670864661654136
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bhargavaparoksham",
                    "index": "#13",
                    "likes": "1",
                    "time": "19/05/2022-05:17:55",
                    "content": "Hey @owocki @loietaylor @kyle  Do you think proposing & setting a dao wide spending limit per season until grants 2.0 is shipped or until we are out of bear market make sense? Even in a worst case scenario of GTC going to $1 to 1.5 the dao will have ~$50 to $75 million (vested + unvested) in its treasury. So if we cap max spending at lets say 1.5 mil per season. Then even for 3 yrs (12 seasons) DAO would at max spend 18 mil i.e ~30-40% of treasury and hopefully by the end of 3 years we would be out of the bear market. In case if the market conditions improve we can remove the spending limit early. All workstreams should split this max budget i.e 1.5 mil based on their contribution levels for core DAO goals etc. Couple of things to note:  The spending limit per season can be a % of treasury rather a fixed USD amount like (1.5 mil). The spending limits can be set both at DAO level & individual work stream levels as well. Along with a DAO wide comp policy, if we have a spending limit for each workstream, it makes it easier for the workstreams to reorganise themselves accordingly to fit the new spending limit.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7102272727272725
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Layn",
                    "index": "#14",
                    "likes": "1",
                    "time": "19/05/2022-09:45:28",
                    "content": "I would like to offer a few comments here. from @lefterisjp comments:  Good software is built by 1-2 architects/CTO and a small, lean and effective development team. I don’t think a DAO can build good software. Perhaps it can hire a team that will be able to and maybe create a very good and clear specification for them to implement.  My understanding is that a DAO is “just” the organization model for running a project, the same that it could be an LLC. With so many people here involved in open software, and this being an important factor in the mission, how can we reach this conclusion? Aren’t there enough examples of good running open-source projects with high quality? (Linux, Gnome, WordPress, IETF, etc). Note, that I’m asking from total unknowledge,  I never participated in an open-source project. Btw, not sure if this could help: https://portal.devxdao.com/public-proposals/185 From @owocki :  Lefteris has told me privately that full-time contributors to Rotki make $30k - $50k per year.  I’m in Europe too, we hire globally, and I’m not even able to attract juniors for a $30k salary. Our seniors are around $80k, and if I find a superstar is almost free check. I’m a startup with no too many resources, so imagine with what we are competing for talent. And I don’t believe that we would attract that talent just because they are aligned with the mission, people want/need to secure their future. I think the tech market is currently in a bubble and it doesn’t look like it’s gonna explode at any time soon. On top of that, working for DAOs has many advantages, you can work for many DAOs at the same time ( this may be an advantage for the person, but I don’t think it is for the DAO, from my point of view if we detect good people, we want them 100% focus on us, and in their free time, enjoying their life, so they can recharge and come with energy the next day, maybe this is an old-fashing though). But it also has many risks from a stability perspective: I have one task now, but It’s not sure at all that I would have a new task once a finish this. So I would have to go out there hunting for new bounties, grants, or freelance jobs. What about illness? pregnancy, vacations, holidays? Along these lines, I was thinking about something to introduce some kind of recognition for the track record of a contributor: Hey, you have been here for 3 months, doing an excellent job, here you have an NFT, that you can exchange, at any time, for 2 days off (numbers from the example are just random). This could create loyalty from the contributors, and people may value this on top of just salary/reward. @kyle :  I am starting to really see the value in some “stable” portion of compensation, and then a “variable” portion of compensation. Having to sell your voice (aka, governance tokens) to pay bills doesn’t feel good.  I totally agree that people should sacrifice compensation for having a voice. This may be a total change of subject, but I’m investigating an alternative to 1-token-1-vote governance model. I like more a system based on reputation, where your reputation’s score rewards your alignment with the mission and penalizes the opposite. Those reputation points can’t be lifetime, I think they should work like the ATP ranking. So people needs to contribute constantly during periods of time, in order to keep their scoring, instead of doing one task and living from that reputation for the rest of their days. @bhargavaparoksham :  Even in a worst case scenario of GTC going to $1 to 1.5 the dao will have ~$50 to $75 million (vested + unvested) in its treasury. So if we cap max spending at lets say 1.5 mil per season. Then even for 3 yrs (12 seasons) DAO would at max spend 18 mil i.e ~30-40% of treasury and hopefully by the end of 3 years we would be out of the bear market. In case if the market conditions improve we can remove the spending limit early.  I think this is very short term vision. It doesn’t matter if this bear market last 3 years or the next one, or maybe there are some external factors that dump the price to zero. The DAO should look for a way to increase its revenue and be auto-sustainable. Managing the treasury and being sure that it can resist market conditions is one piece, but sooner or later, the treasury will be gone. Some quick ideas:  Looks for financial contributors, there are a lot of non-profit organizations and foundations raising funds from wealthy people. What about taking tokens/equity from the projects that the DAO helps? I think there is a lot of knowledge in this DAO, many other DAOs can learn from it (I’m researching this in detail for the one that I’m creating). This DAO can create tools and service that facilitate the management of this DAO and charge for it to other DAOs.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.055421401515152
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#15",
                    "likes": "6",
                    "time": "19/05/2022-10:13:36",
                    "content": "    Layn:  Aren’t there enough examples of good running open-source projects with high quality? (Linux, Gnome, WordPress, IETF, etc). Note, that I’m asking from total unknowledge, I never participated in an open-source project.   Sure there are! But they are not made by what we call DAOs now. An opensource project tends to have 1-2 architects, 3-5 core contributors and then any number of occasional contributors. Without the main person behind it, the maintainer, the project usually dies. Good projects try to go around that by having multiple maintainers and/or when someone steps down they try to find a replacement.     Layn:  I’m in Europe too, we hire globally, and I’m not even able to attract juniors for a $30k salary.   Then you need to work on your hiring process. It’s very easy. Try angellist.co, twitter, and the job boards of whatever language/frameworks you use. If your work is opensource go to opensource job boards. Many people really appreciate the chance to get paid to work in opensource. Paying $80k for a good senior sounds good. Also for Europe. But if budget is tight (like it is with rotki) can be accomplished with less. The most important thing to find is people aligned with the vision of what it is you are building and try to pay them as good as your budget allows. The reason salaries and prices are mentioned is because this DAO is overspending and burning money like there is no tomorrow while there is zero revenue coming back in and … well let’s be honest. It has shipped very little (nothing?) in the 1 year since its inception.     Layn:  I think this is very short term vision. It doesn’t matter if this bear market last 3 years or the next one, or maybe there are some external factors that dump the price to zero. The DAO should look for a way to increase its revenue and be auto-sustainable. Managing the treasury and being sure that it can resist market conditions is one piece, but sooner or later, the treasury will be gone.   Very strong agree here. Irrespective of market conditions the DAO needs to become sustainable. Right now it’s simply burning money and I don’t see any revenue coming in. Your ideas also sound cool. Gitcoin grants 1.0 has the optional (but by default set to 5%) fee that goes to Gitcoin holdings. How about switching that to being revenue for the DAO at some point? Or at the point gitcoin grants 2.0 comes along? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.105064611314611
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bhargavaparoksham",
                    "index": "#16",
                    "likes": "1",
                    "time": "19/05/2022-10:13:46",
                    "content": "    Layn:  I think this is very short term vision. It doesn’t matter if this bear market last 3 years or the next one, or maybe there are some external factors that dump the price to zero. The DAO should look for a way to increase its revenue and be auto-sustainable.   Hey @Layn I agree with you on the point that we the DAO should try to increase its revenue. But it is also equally important that we should simultaneously try to reduce our burn as well. Setting a spending limit based on a DAO wide consensus is the best way that I see to control the burn. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.928571428571429
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Layn",
                    "index": "#17",
                    "likes": "1",
                    "time": "19/05/2022-10:39:06",
                    "content": "    lefterisjp:  Sure there are! But they are not made by what we call DAOs now. An opensource project tends to have 1-2 architects, 3-5 core contributors and then any number of occasional contributors. Without the main person behind it, the maintainer, the project usually dies. Good projects try to go around that by having multiple maintainers and/or when someone steps down they try to find a replacement.   So, the solution could be to engage and retain full time these profiles. Architects should define processes to be followed by core and occasional contributors. Thanks for the tips about hiring   Gitcoin grants 1.0 has the optional (but by default set to 5%) fee that goes to Gitcoin holdings. How about switching that to being revenue for the DAO at some point? Or at the point gitcoin grants 2.0 comes along?  Is there any doc regarding how you are doing that without being considered a security token? I’m curious about this. Not sure how relevant these fees are, but if they are attractive, and you remove them, that could devalue the token, because people will be less willing to hold it. Somehow the interest of the DAO and holders should be aligned in this aspect too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6380718954248366
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#18",
                    "likes": "3",
                    "time": "19/05/2022-21:06:27",
                    "content": "    lefterisjp:  Gitcoin grants 1.0 has the optional (but by default set to 5%) fee that goes to Gitcoin holdings. How about switching that to being revenue for the DAO at some point? Or at the point gitcoin grants 2.0 comes along?   Just want to note the optional 5% fee goes directly back into the matching pool for future rounds, no revenue for Holdings or the DAO. This changed about a year or so ago, before that the option did go to funding the Gitcoin core dev team (pre-dao).     Layn:  Is there any doc regarding how you are doing that without being considered a security token? I’m curious about this. Not sure how relevant these fees are, but if they are attractive, and you remove them, that could devalue the token, because people will be less willing to hold it. Somehow the interest of the DAO and holders should be aligned in this aspect too.   This fee doesn’t have anything to do with GTC or token holders directly (not today where it goes to the matching pool, or in the past when it went to fund platform development, which was before GTC anyway). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.316666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#19",
                    "likes": "9",
                    "time": "19/05/2022-21:26:48",
                    "content": "On the topic of revenue - I do think there is an option in the near future to start charging operational/management fees for the growing number of Ecosystem rounds we are running. Most of my time over the past few years at Gitcoin Holdings was focused on managing the virtual events/hackathons business, which did bring in a good amount of revenue via sponsorship fees. I’ve now transitioned to focus pretty much fully on Grants, specifically ecosystem rounds, and I am moving from Holdings to the PGF workstream. A lot of work goes into managing ecosystem rounds (not unlike hackathons) with partner/grantee onboarding, education, operations, marketing, payments, etc. We’ve never charged fees for matching pool donors in the past because we obviously want 100% to go to the community, and funders are not really purchasing a service they are making a generous (charitable) donation. But I think it’s a bit different for ecosystem rounds - while main pool and cause round donors likely don’t see any direct immediate benefits (besides exposure + goodwill), ecosystem round sponsors are specifically funding the growth and development of their own protocol or community (and not necessarily open source/public goods broadly). Something I’ve been thinking about as we move towards Grants 2.0 with more self serve features - ideally, anyone can run their own self serve QF round at any time they want, while Gitcoin will still host our big main rounds, with more hands on management for specific ecosystems or causes. It won’t be possible for PGF to scale and run all rounds, but if your option is to do all the work yourself or have Gitcoin manage it for free, many will opt for the latter. So I think eventually some type of fee or cost to cover DAO overhead for managed ecosystem rounds will be inevitable. The important thing to weigh is the value of some additional revenue in the near term (and maybe it only makes a small dent in burn) versus the risk of slowing down growth and adoption. Personally, I think given the market pressures we’ve seen as of late, it might make sense to begin generating some DAO revenue sooner rather than later. But I don’t think everyone agrees yet, curious what others think. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.597706718346254
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/socal434",
                    "index": "#20",
                    "likes": "1",
                    "time": "21/05/2022-08:09:46",
                    "content": "Yeah, this should be a project of passion. The people who stick around will be the biggest supporters of the mission. Hopefully salary reductions won’t be to hard on people who are full time with the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.145833333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#21",
                    "likes": "1",
                    "time": "21/05/2022-11:24:19",
                    "content": "I think charging the ecosystem rounds with a fee with operational/management and possible grant curation services is a great idea!     connor:  But I think it’s a bit different for ecosystem rounds - while main pool and cause round donors likely don’t see any direct immediate benefits (besides exposure + goodwill), ecosystem round sponsors are specifically funding the growth and development of their own protocol or community (and not necessarily open source/public goods broadly).   Exactly, makes sense to charge them. We have the same vision for the GIA, we want to become a Ecosystem/Cause grant curation service provider.(Hopefully we will have permissionless services when Grants 2.0 kick in). For the Cause rounds we could do it pro bono, if the cause it altruistic in nature. I believe It would be a natural move to try to generate some revenue especially seeing the growing number of ecosystems. We could also be kinda overwhelmed by  that growing number in the near future.  We should talk more on Monday during the Grants Tactical and see what our peers want. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71078431372549
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/TyHagler",
                    "index": "#22",
                    "likes": "1",
                    "time": "21/05/2022-11:36:16",
                    "content": "I’m not a voting member, but very interested in how the DAO responds to this question. I am grateful to @owocki for raising a challenging but necessary topic of conversation. Reading through the governance process documents, it describes a policy for managing conflict of interest that seems to apply to any employee of the DAO who also holds governance tokens when addressing compensation questions:    Gitcoin DAO Governance Process v3   Conflicts of Interest In any case where a steward or community member votes on a proposal that directly benefits themselves (e.g. voting to pass their own workstream budget) the vote will be considered invalid by default. Any steward may raise a claim of conflict to be addressed prior to a vote being finalized on Tally. If a conflict is found, any related vote must be redone and may be considered passed so long as the steward in conflict abstains and the quorum rules are met.   This raises a practical question: How many Stewards are also employees of the DAO? Are there enough Stewards who don’t have a conflict of interest on this question to be able to reach quorum? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#23",
                    "likes": "1",
                    "time": "21/05/2022-14:11:48",
                    "content": "The main threat to the evolution of DAOs(in my view) just like any other organization are parasitic behaviors. Basically corruption + greed + manipulation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#24",
                    "likes": "2",
                    "time": "22/05/2022-23:51:38",
                    "content": "  twitter.com   DeFi Surfer | (💎,💎) @808_Investor  .@MakerDAO 2022 budget at a glance: - $400k / employee overall; - $1.2M / employee in \"Real World Finance,\" way more than engineering at $474k 👀 - $770k on \"Strategic Happiness\".   Two thoughts: - Is this reasonable for a protocol? - You hiring??  cc @0xHamz https://t.co/DgMEnbKpqY   12:55 PM - 21 May 2022           33            saw this on twitter today + felt it was an interesting analogue for another DAO at scale.  (though MakerDAO isnt exactly comparable to Gitcoin in many ways - they are DEFI, Gitcoin is public goods.  they have a more sustainable financial model than Gitcoin does.  and they are a few years older than Gitcoin.). but i still find it compelling because it helps me think of what gitcoin would look like at scale. ",
                    "links": [
                        "https://twitter.com/808_investor/status/1528102320038367234?s=12&t=f-HctiqPxmS38_GNhZSW5w",
                        "https://twitter.com/808_investor/status/1528102320038367234?s=12&t=f-HctiqPxmS38_GNhZSW5w",
                        "https://twitter.com/808_investor/status/1528102320038367234?s=12&t=f-HctiqPxmS38_GNhZSW5w"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#25",
                    "likes": "4",
                    "time": "22/05/2022-23:54:16",
                    "content": "    loietaylor:  Assuming we are not in an emergency state currently, I propose this: We set a date ~1 month before the start of S15 to have a group strategizing call.   I’m strongly supportive of having a smaller group that creates a safe & productive container for this conversation.  It should have someone representing people ops (Loie or someone on her team), and someone else who knows the financials of the DAO well (Kyle or Llamas).  Such a group would start with listening + then perhaps through building consensus eventually recommend policy back to the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#26",
                    "likes": "0",
                    "time": "23/05/2022-16:15:12",
                    "content": "Wow, I actually wanted to bring that issue up, but didn’t want to make more enemies  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#27",
                    "likes": "0",
                    "time": "23/05/2022-17:01:01",
                    "content": "My take (as a a steward), I should not be voting on the DAO Ops budget (I think I might have  ) but I am fine to vote on all other budgets. The DAO Ops budget does compensate me (as a contributor I currently make 1850 GTC a month), but no other workstream compensates me. The conflict of interest clause is one we should remind stewards of, as I think most WS leads are also stewards with a fair amount of GTC delegated to them. IMO, no one steward has the ability to approve or deny a budget on their own though. It usually takes three of more (at a minimum) to really move the vote (if they went against all other stewards/community members). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1268939393939394
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#28",
                    "likes": "1",
                    "time": "24/05/2022-12:24:38",
                    "content": "    kyle:  The DAO Ops budget does compensate me (as a contributor I currently make 1850 GTC a month), but no other workstream compensates me.   To be fully transparent here: future and further compensation will be negotiated here for all your awesome work, and you consult on multiple workstreams so your case is actually an example on why it is important to keep on refining this clause, there’s always so much context. Very happy that a first paragraph on this made it into v3 now though. And yes, one steward cannot turn the vote but ofc they do influence others. Having power spread out over more non-contributing stewards would be a good thing, but then we ofc also need to work on how to incentivize them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.581730769230769
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#29",
                    "likes": "5",
                    "time": "24/05/2022-12:54:46",
                    "content": "    owocki:  I’m strongly supportive of having a smaller group that creates a safe & productive container for this conversation. It should have someone representing people ops (Loie or someone on her team), and someone else who knows the financials of the DAO well (Kyle or Llamas). Such a group would start with listening + then perhaps through building consensus eventually recommend policy back to the DAO.   +1 on this. It should be more than just a group strategy call, it should be a taskforce that looks at all the salaries but starts with an intake meeting.     loietaylor:  a) salary reduction for all b) new hires brought on at a lower rate, with leveling period across a few months where high salaries are lowered and new hires are raised (to find equality without making an earthquake in ppls lives) c) take a furlough d) high context/high salary folks go to 1/2 time   Looking at these options only option b) makes sense to me (I like that one a lot). Although I know it is just a ‘conversation starter’, it is within the domain of people ops to provide some guidance here and I hope some more options can come up to equalize pay first before we eg go for a dao-wide reduction or potentially ask some of most high context (often highest performing) contributors to go to 1/2 time.  I think what Saf describes here is a realistic scenario…     safder:  f there’s a mass exodus beacuse current contributors can no longer afford to work at Gitcoin DAO … how far back would this set current projects, and what would the costs of rehiring/restructuring the DAO be? Just think there’s a lot of nuance that needs to be taken into account when discussing people’s livelihoods   … and we should at all cost avoid a talent bleed of the DAO. I personally can live with a paycut but at the same time I believe in fair treatment of all. Measuring of people’s performance is not easy but this discussion shows how important it is to at least establish some standards (urgently) we can adopt dao-wide, and we’ve been talking about this for a long time. Salaries are pretty random from my view and in a bear market tensions around this will probably only rise. I’ve seen private and public discussions around what some people make and I’ve seen other workstreams being very good at hiding how much some people actually make. There’s a lot of work to be done here and great to see that we’re broaching this topic.  Some final thoughts after reading up on all of the above, looking back at the original Qs:     owocki:   If I were to start this project all over again, should I have gone the Giveth/Rotki route?    No, coming from Giveth I can be clear about this.  We all made the exact same (extremely low) salary, no matter how hard or long you worked or how efficient you were. It really was painful at times, for many. People should always be compensated for what they do. No system is perfect but we should try to find a balance.     owocki:   Is the DAO in for more hard times if it continues Holdings’ compensation patterns?    Probably yes. All salaries should be revised, this should by the way also include legacy rules with vesting plans from holding employees. This is a very unbalanced situation that should also be addressed while we’re at it.     owocki:   Should GitcoinDAO pay six-figure salaries to its full time contributors, like the Holdings company did (perhaps unsustainably)?    We should pay the correct market value but take into consideration our own financial situation and adapt where necessary, esp. for people who are overpaid or whose pay has never been evaluated by people ops in terms of what makes sense in the market, performed hours, peer review etc. There’s no dao-wide system in place here at the moment.     owocki:  Is there a DAO-wide compensation policy in the works? Should this policy be consistent in both times of abundance & scarcity ?   We do not have one but afaik it is in the works, this was in people ops’ OKRs last season and it is in there again for this season.     owocki:   Can the DAO sustain these compensation policies if we are no longer the market leader ?    Let’s start by drafting one, take context into account and go from there.     owocki:   What is the DAOs compensation model? What are the workstreams compensation models?    Does not exist/is not consistent/unknown.     owocki:  What would have to be true for the DAO to create great software, become a market leader, get to financial sustainability, and pay web2-competitive salaries (the virtuous cycle I personally think the DAO should be aiming)?   Have a clear purpose and intents from which a lot of logic can come to make easier decisions, and a strong people ops team to create policies that makes sense to all workstreams and continually evolve given our own ever-evolving context. ",
                    "links": [
                        "https://gov.gitcoin.co/t/the-overton-window-for-grants-2-0/10461",
                        "https://gov.gitcoin.co/t/a-compensation-commitment/10830/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.78922077922078
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#30",
                    "likes": "0",
                    "time": "25/05/2022-15:15:06",
                    "content": "    bhargavaparoksham:  Do you think proposing & setting a dao wide spending limit per season until grants 2.0 is shipped or until we are out of bear market make sense?   This is something Workstream leads have asked for from the stewards. More specifically, “We want to know what the DAO budget is, and then we can determine how to spend those funds amongst us” We are starting to explore a few options to help remove ambiguity here. Something like a sliding scale of compensation make-up (ie, what % is in stables and what % is in GTC) based on GTC price. And then also taking a look at treasury sustainability, to ensure that we have (ideally) 10+ years of runway. This may not be possible with the current market, but we are planning to be a project and DAO that stands the test of time.     connor:      lefterisjp:  Gitcoin grants 1.0 has the optional (but by default set to 5%) fee that goes to Gitcoin holdings. How about switching that to being revenue for the DAO at some point? Or at the point gitcoin grants 2.0 comes along?   Just want to note the optional 5% fee goes directly back into the matching pool for future rounds, no revenue for Holdings or the DAO. This changed about a year or so ago, before that the option did go to funding the Gitcoin core dev team (pre-dao).   This was a change more than a year ago (nearly 2 years ago). We instead created a grant to fund the core development. It too has now been made inactive and we have no inflows to supplement development. This is something we have started to evaluate if we should change. Here is one idea for example. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7727272727272725
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#31",
                    "likes": "4",
                    "time": "11/06/2022-00:42:15",
                    "content": "Thank you Kris - there’s been so much talk on this the last couple weeks but I do want to give it the grace of responding on the forum where everyone can benefit from it! So: This!  Although I know it is just a ‘conversation starter’, it is within the domain of people ops to provide some guidance here and I hope some more options can come up to equalize pay first before we eg go for a dao-wide reduction  The best path forward I see here is a custom competency/skill leveling framework. It is a matrix that looks like this:  Screen Shot 2022-06-10 at 5.37.52 PM2192×1076 355 KB  But ours would be tailored to match the competency that is most important in web3 and Gitcoin specifically. Typically an org uses this matrix to determine a salary offer before a hire is brought on. But in the instance where our pay is not equal thus far, I think using our same scoring mechanism that we use for new hires would be the most legitimate way to evaluate current contributors as well. Next,     krrisis:      owocki:  Is there a DAO-wide compensation policy in the works? Should this policy be consistent in both times of abundance & scarcity ?   We do not have one but afaik it is in the works, this was in people ops’ OKRs last season and it is in there again for this season.   Just fyi this was not in the People Ops OKRs last season - you are right that it is now though! Very excited to be supported to have the space for this service, and to make this comp policy. Lots of fresher discussion on it here. I’ll prob continue the rest in the other post^ ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-compensation-commitment/10830"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.04508091115234
                }
            ]
        }
    ],
    "group_index": "98"
}