{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/cross-chain-gitcoin-dao-eth-is-very-expensive/10313",
            "title": "Cross-chain Gitcoin DAO? ETH is very expensive ",
            "index": 10313,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#1",
                    "likes": "0",
                    "time": "06/04/2022-19:05:05",
                    "content": "Ethereum definitely isn’t the best blockchain to exist, and likely won’t ever be. I wonder if there is consideration to become cross-chain, like say, developing on/for Algorand? Everything on Ethereum is so expensive. I’ve spent a good chunk of my income from the DAO on gas. I wonder if moving some of the treasury over to a stablecoin pegged to GTC on other chains is a good idea. L2s are the common rebuttal, but they’ve all got their own set of challenges and problems with the “blockchain trilemma” that Algorand solves quite elegantly. It’s also pretty impressively easy to use, and mobile-first. ",
                    "links": [
                        "https://www.algorand.com/resources/blog/silvio-micali-lex-fridman-algorand-and-the-blockchain-trilemma"
                    ],
                    "GPT-summary": "The author is proposing the idea of developing on/for Algorand instead of Ethereum due to the high gas fees. The author suggests moving some of the treasury over to a stablecoin pegged to GTC on other chains. The post also discusses the challenges and problems with L2s and how Algorand solves them. The post does not ask for feedback or advertise the proposal, but rather explains the proposal and invites constructive criticism and questions.",
                    "GPT-proposal-categories": [
                        "Interoperability and Scalability",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.895833333333334
                }
            ]
        }
    ],
    "group_index": "51"
}