{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-8-2022/10032",
            "title": "GitcoinDAO Digest Edition #8 2022 ",
            "index": 10032,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "2",
                    "time": "09/03/2022-21:40:35",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!    Key actions for this week:  Vote on the The Steward Council Election & Mandate proposal Vote on the Steward Council Term Allocation proposal Gitcoin GR13 is live - Donate to your favorite grants across the 13 Match Rounds!    Meta-Governance    Grants 2.0 is how we scale our impact by Owocki argues that GitcoinDAO should consider going all-in on Gitcoin Grants 2.0. “QF is a core money lego […] there is a legitimate opportunity to ride that insight to create exponentially more social, culture, intellectual, financial, and experiential capital for our stakeholders & for the world.”   Articulating GitcoinDAOs Impact On The World by Owocki articulates GitcoinDAOs impact on the world across four areas; Social, Financial, Intellectual and, Experiential.   Quadratic Funding x Effective Altruism by Owocki explores “the intersection of Effective Altruism and web3.0.” The post describes how we could bring more of an Effective Altruist mindset to Gitcoin Grants through evidence of effectiveness into the Gitcoin Grants dataset.   Dan provided an update on the Treasury Diversification Working Group. If you’d like to recommend a strategic partner, please leave a comment on the second forum post or contact a member of the working group.   Dear Moonshot Collective Help DAOs Level Up Gov tooling: BUIDL Request for Chain Agnostic Conviction Voting by Jessica argues for the introduction of conviction voting within GitcoinDAO to “more efficiently distribute & decentralize funding proposals and visualize dynamic average consensus signals.”   Novel Situation #1 - Project should not have a token or raised VC funding by David argues that the criteria that “Grant Applicants should not have a token” is outdated and should be revised.   Kei introduced mintkudos.xyz - An initiative to create of peer-verified soulbound tokens that capture off-chain contributions as part of a decentralized reputation.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     The Gitcoin Foundation - A proposal to represent the Gitcoin DAO IRL by a Cayman Islands Foundation The Steward Council Election & Mandate     ImpactDAO Cartographers Wanted. Steward Council Term Allocation    Treasury Diversification Part II - Welcoming Strategic Partners        Workstream Discussion    Moonshot Collective    Moonshot Collective builds tools for DAOs so they may recognize and reward their contributors. We’re excited to announce the launch of our first major DAO tool, Tip.Party! Quickly reward event and meeting participants all at once with tokens. It’s simple and ready to use! Want a walkthrough? DM us on Twitter.   Green Pill Podcast Episode 3 hosted by Owocki with special guest Santi Siri is live on Spotify, Apple, and wherever you like to listen to podcasts.They talk about building UBI on Ethereum through Proof of Humanity.     Fraud Detection & Defense (FDD)    Sybil Defense   The Anti-Sybil Operational Process is ready to hand off from Blockscience to GitcoinDAO. After 3 workshops to transfer knowledge, the DAO devops group is ready to run the main system which activates sanctions against sybil accounts.   The trust bonus evaluation shows how few of the accounts currently use any of the trust bonus methods. We still feel we can make recommendations for how the weighting of each integration should be updated to more accurately reflect their intended purpose.      Grants Investigation Agency   We received legal approval from the Gitcoin Holdings org for our integration for the Ethelo tool built out to scale our ability to review grants as a community. While we still may use it for the last week of open approvals, we plan to use it again for the flags & disputes later in GR13.   In working with the Ethelo platform, we learned that its design is generalizable to many other uses including our human evaluators in the ML pipeline. It could even be used to review user participation, task creation, task completion, community sentiment among other use cases. We hope to advance discussions on building a lasting partnership with the Ethelo team.   Last day for new grant approvals is Wednesday, March 15th! Get your grants in today! (Shout out to Zer8, David, and the grants review squads for staying on top of the incoming approvals!)     Ground Control   Adam Stallard of BrightID will be joining our multisig to replace Trueblocks who is stepping out of that role and leaning into being a subject matter expert helping our community ML model build out on-chain features for sybil detection. Thanks for your support and oversight TJ!   We hosted a workshop with our multisig keyholders on how to improve the experience and quality of their participation this week.   Check out the new and improved FDD notion main page & FDD proposals template!   Our data analytics squad is looking for requests. As we and others write code to analyze grants and DAO data, we are looking to aggregate and create dashboards to give the best of the best insights to our community on an ongoing basis.   Shout out to MMM stream for some new cool logo designs  808×400 55.9 KB        Merch, Memes & Marketing    Memepalooza 6 was held last Friday in Discord. We invited Developer DAO to co-host the event and had over 120 unique attendees. Lots of great memes were created around public goods, GR13 and why we love our developers <3   The MMM Workstream will start to use RadicalxChange Voice to bring a more democratic approach in determining high level goals and projects within the group. An introduction will be held this Friday before the process begins next week.   A new topic has been posted on the forum to discuss Gitcoin Visual Identity & Branding. We’re interested in hearing from the community on the current branding and how we might expand it to support the vision and mission of the DAO.   New GR13 merch is live in the schwag store - The collection include of a t-shirt, tote bag, stickers and Public Goods Are Good-cap.   If you’ve participated in any of the DAO Vibes calls since January, we have POAPS for you to claim! Head over to the mmm-general thread in Discord for more info.     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET on Discord! We have been seeing great attendance and engagement and we would love for you to join us. Afterwards there is the Gitcoin Contributors Happy-Hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? Every other Monday we’ll tell you all about how we’re organized and how you can become an active contributor. The next one is Monday, March 14, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x5784ba66b16153b15cd2b94625909cb1b4ee7d1c6b5f033b30d037fa90140db9",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x54a5344b67a260f4951ee957e7da2191557a34de39512172394cedc086fa0a99",
                        "https://gitcoin.co/grants/",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/articulating-gitcoindaos-impact-on-the-world/9994",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/quadratic-funding-x-effective-altruism/10016",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/u/schlabach",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-3-5-2022/10012",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/t/dear-moonshot-collective-help-daos-level-up-gov-tooling-buidl-request-for-chain-agnostic-conviction-voting/10027",
                        "https://gov.gitcoin.co/u/JessicaZartler",
                        "https://gov.gitcoin.co/t/novel-situation-1-project-should-not-have-a-token-or-raised-vc-funding/10029",
                        "https://gov.gitcoin.co/u/David_Dyor",
                        "https://gov.gitcoin.co/u/keikumata",
                        "https://gov.gitcoin.co/t/request-for-proposal-decentralize-gitcoin-kudos/8115/4",
                        "http://mintkudos.xyz/",
                        "https://gov.gitcoin.co/t/proposal-the-gitcoin-foundation-a-proposal-to-represent-the-gitcoin-dao-irl-by-a-cayman-islands-foundation/9983",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x5784ba66b16153b15cd2b94625909cb1b4ee7d1c6b5f033b30d037fa90140db9",
                        "https://gov.gitcoin.co/t/impactdao-cartographers-wanted/9866/",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x54a5344b67a260f4951ee957e7da2191557a34de39512172394cedc086fa0a99",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://tip.party/",
                        "https://twitter.com/MoonshotCollect",
                        "https://twitter.com/owocki",
                        "https://twitter.com/santisiri",
                        "https://open.spotify.com/show/0l6aXWC94dd0RA3tkKfxjd",
                        "https://podcasts.apple.com/us/podcast/2-ethers-phoenix-with-optimisms-karl-floersch/id1609313639?i=1000552104369",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://gov.gitcoin.co/u/zer8/summary",
                        "https://gov.gitcoin.co/u/David_Dyor",
                        "https://gov.gitcoin.co/u/castall/summary",
                        "https://gov.gitcoin.co/u/tjayrush",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://gov.gitcoin.co/t/harnessing-collective-intelligence-for-workstreams-with-radicalxchange-voice/10024",
                        "https://gov.gitcoin.co/t/discussion-gitcoin-visual-identity-branding/10023",
                        "https://store.gitcoin.co/",
                        "https://discord.com/channels/562828676480237578/865579177854894151",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-7-2022/9996",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.140689935064935
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#2",
                    "likes": "0",
                    "time": "11/03/2022-01:42:03",
                    "content": "If you have any questions about Gitcoin product, please go to discord   Discord    Join the Gitcoin Discord Server! Build and Fund the Open Web Together. Connect with the community on Discord! | 21,187 members      and create a ticket in this channel #📝create-a-ticket ",
                    "links": [
                        "https://discord.com/invite/gitcoin"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-10-2022/10209",
            "title": "GitcoinDAO Digest Edition #10 2022 ",
            "index": 10209,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "2",
                    "time": "24/03/2022-08:22:05",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!    Key actions for this week:  Gitcoin GR13 has only hours left! Donate to your favorite Grants across the 13 Match Rounds! Join us for the GR13 Finale event on Youtube this Friday at 11am-12:30pm PT!    Meta-Governance    Grants Policy Update: Projects with Tokens by Annika is intended to “provide context on, and guide the community to a decision around, grant eligibility criteria as it pertains to projects with tokens.” The post is a follow-up & summary of the existing discussions outlined in Novel Situation #1, and Proposed Revision to Grant Eligibility Criteria 1.   Partnership & Mutual Grant with Wonder by Andros is a proposal that “if passed, would issue 100,000 GTC for governance rights equating to 2,500,000 $WONDER tokens (2.5% of total supply) when Wonder’s token is live.”   Decentralizing Public Speaking about Gitcoin by Owocki is a call for DAO contributors to join a working group that will diversify the voices that are public speaking about Gitcoin, our mission, impact, philosophy, etc.   Minimum Viable Product by Owocki is an invitation to apply Web 2 product philosophy to Web 3 by building, designing, and testing usable, reliable, and functional products.   Minimum Shippable Increments by Owocki expands on the idea of the MVP with open source software principles to discuss how products can/should be built in public!   Its time to level up our emails by jahnsson reflects on the tools we’ve been using to manage our email campaigns and suggests a path forward to improve our data insights, growth, and impact.   Treasury Diversification Working Group Update by schlabach provided an update on the Treasury Diversification Working Group. If you’d like to recommend a strategic partner, please leave a comment on the second forum post or contact a member of the working group.   Ether’s Phoenix Game [Version 0] by Colton introduces Ether’s Phoenix (EP) – an exciting gamification of the process of supporting public goods. Your actions shape a constantly evolving PFP and increase (or decrease) your Regen Score. EP proliferates coordination lore, unifies impactDAOs through a shared game experience, and provides a trackable metric of greenpilled people (Regen Score).   Elliot published an update from Llama on Gitcoin Financial Reporting for February 2022. The report now includes a “consolidated profit/(loss) account that translates the GTC transactions into $USD”.   Why I am a Holon maximalist by Owocki introduces Holons as “Greek for “whole/parts” meaning literally the whole that is simultaneously a part, and vice versa. Holons are the circles that we live in.” “What I think is cool about a holonic point of view of Gitcoin Grants is that each of the grants in Gitcoin has a lot to gain from the multiple holons (grants rounds) it is in.”   Can Gitcoin be doing more to support Ethereum Protocol Devs? by Owocki is an invitation to the Gitcoin community to participate in the recent debate on Twitter regarding funding Ethereum protocol developers. “Ethereum Protocol Development is a public good, and it’s possibly the closest one to the ecosystem that gave Gitcoin life. Can Gitcoin be doing more to support Ethereum Protocol Devs?”   Proof Of Impact seedling [Proposals Wanted] by Owocki is an extension of the ImpactDAO Cartographers initiative - with the ambition to create a ImpactDAO RatingsDAO emerge. “Such a DAO would maintain an on-chain registry of which ImpactDAOs have what Impact”.   DevRel @ GitcoinDAO by Owocki has the objective to start a conversation around what the developer relations practice at Gitcoin should look like.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     Partnership & Mutual Grant with Wonder   Should we adopt the Gitcoin Foundation and take legal possession of philanthropic assets from Gitcoin Holdings Result: Yes   Proof Of Impact    Steward Council Term Allocation Result: 5k GTC   Grants Policy Update: Projects with Tokens     Grants Policy Update: Projects with Tokens     Data Science @ Gitcoin DAO     Treasury Diversification Part II - Welcoming Strategic Partners     Introducing the Steward Council        Workstream Discussion    Public Goods Funding    We’re only a couple of hours away from wrapping up Grants Round 13. There’s still time to support public goods and get your donations matched from the matching pool(s)!   Our partner Verses (a collective of writers, researchers, technologists) have some of the best writing in the ecosystem about what it means to be a pluriverse. Stay tuned in for their next drop   GR13 may not be over yet but the work is already beginning on GR14! We are evaluating our partnerships and upcoming cause rounds.     Moonshot Collective    Green Pill Podcast Episode 5 hosted by Owocki is live on Spotify, Apple, and wherever you like to listen to podcasts. In this episode Kevin speaks with Coordinape founder Tracheopteryx about the alignment of ownership, value, and merit to achieve Fractal Sovereignty.   Schelling Point Amsterdam registration is live! Schelling Point is a one day celebration of coordination, public goods, and regenerative finance — what Moonshot Collective is all about. Schelling Point Amsterdam will take place on April 21, as part of the week-long Devconnect event. Tickets are limited, so be sure to get signed up right away!     Fraud Detection & Defense (FDD)    We’re working on a model within Ethelo (a decentralized decision-making tool for e-democracy) to improve our grants review process. Our goal is to focus on maximizing trust in the system   Our sybil resistance tooling is increasingly battle-tested and our community review model is working well. We will continue to improve our anti-sybil operational process (ASOP) with a combination of machine learning and human evaluation   We are running a Contributor Experience (CX) survey and need your feedback!     Merch, Memes & Marketing    Organization:  The RadicalxChange Voice experiment has now progressed into Stage 2 where contributors of MMM are asked to add comments and vote on Pol.is. The experiment ends next week with a final round of quadratic voting as we collectively determine our ambitions and goals for the upcoming Season 14.    Events:  We’re preparing for the upcoming Memepalooza 7 which will be hosted in Discord on the OG meme day of the year: April 1st. This month we are inviting our frens from 1Hive to meme and have fun with us, come join! If you’ve attended DAO Vibes lately you’re eligible for POAPs! Contact bfa#7705 in Discord for assistance. Planning is happening for the next Can Devs Do Something developer meetups that will take place in Barcelona, Amsterdam & Toronto. More information will be shared soon.    Brand & Comms:  We’re working on final steps of negotiation with PR agency YAP Global. Aiming for April 1, 2022 start. We will be meeting with Wednesday Studio on 3/29 to discuss a new brand vision.    Growth:  We’re evaluating new software providers to replace Acquia. In conversations with Hubspot for email & CMS, likely will undergo a broader evaluation for marketing automation platforms. GR13: Marketing plan. Seeing good upswing at the end of the round, as we have seen in the past 3 rounds. In the past 3 grants rounds, an average of 61% of the round’s total # of contributions and 53% of the round’s community funding has come in the last 5 days.      DAO Operations    We’re determining the best way to manage payment and accounting across DAO workstreams. We’re excited about the potential for some DAO-native tools (such as those being built by Utopia Labs)   We’re upgrading our treasury management through diversification and key partnerships.   We’re making sure we provide support to GR13 funders and help them navigate getting verified to increase their trust bonus, grant appeals, and any issues they may face     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET on Discord! We have been seeing great attendance and engagement and we would love for you to join us. Afterwards there is the Gitcoin Contributors Happy-Hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? Every other Monday we’ll tell you all about how we’re organized and how you can become an active contributor. The next one is Monday, March 28, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)   Registrations are open for SchellingPoint@EthAmsterdam! After the great success of SchellingPoint@EthDenver, we’re crossing the Atlantic to keep the coordination party going in the Netherlands. Come hear from some of the greatest minds in crypto IRL on 4/21!     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://gitcoin.co/grants/",
                        "https://youtu.be/nFF8lpiC-hI",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/t/proposal-grants-policy-update-projects-with-tokens/10125",
                        "https://gov.gitcoin.co/u/annika",
                        "https://gov.gitcoin.co/t/novel-situation-1-project-should-not-have-a-token-or-raised-vc-funding/10029",
                        "https://gov.gitcoin.co/t/proposed-revision-to-grant-eligibility-criteria/10098",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-wonder/10170",
                        "https://gov.gitcoin.co/u/andros",
                        "https://gov.gitcoin.co/t/decentralizing-public-speaking-about-gitcoin/10100",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/minimum-viable-product/10139",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/minimum-shippable-increments/10140",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/its-time-to-level-up-our-emails/10134",
                        "https://gov.gitcoin.co/u/jahnsson/summary",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-3-19-2022/10128",
                        "https://gov.gitcoin.co/u/schlabach",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-3-19-2022/10128",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/t/ethers-phoenix-game-version-0/10113",
                        "https://gov.gitcoin.co/u/colton/summary",
                        "https://gov.gitcoin.co/u/Elliott",
                        "https://gov.gitcoin.co/t/gitcoin-financial-reporting/8867/5",
                        "https://doc-0o-6s-docs.googleusercontent.com/docs/securesc/5qb3ou4l183q2oc9iqghlnga2st6uuvi/vutpst17m0qjkkp3ifb8d853k6ohktag/1648046550000/07219962111518817433/11838597598179151713/1PjWKx0oiYHiBmgkR21F-_BGBWXdkKwsx?e=download&ax=ACxEAsZI7vKA0mvqZ8b_6ZXrjWcvALO1Ed8ISeQ8nm3gXEaDYeIvATuDvP-AFwNMeICgppChj20JCE3h1iaTS9boAfTvQolh5vQgqOpIx4wYST73RAVtvS-LzEWtXISXvWPNynSJ1U5abJk3N_74k7HSfYw5BmBWWyoQBIgZGtRA-wtAl1bOvfH-pbl1a-Jj_Gv94fyxLMcUoECyi-9SI2Y_NFadJWZx9PLOm_5JSu1_t4t4FrB6a2G2yxCOS4CPLXYbURMsu4A_sgMnkAWOUi6ySfu5m6g-R0U9ijnKxzzao4NEEjmD6YqY0iMtwtpeg5i2G9fdDye9RVrHhDPL6JatiZFR7XL_YkFAlMh7sn7xBQKS28q4wpmCwQggxAQL4yUa_oTZv3VBdeo6qQutvLiHc607RUpd8QC3PqNuVXWJ8_JjEQ2Y06iiUQqlZP-mBsLOg0VcP6quk8LAUYB5PgZKkOJeoUnJtl6PZ-40m9dDnvnoNdvui0iiyZfpZwUJqoQpi--nQu6jyJ0THQMqg_CLxYc47IdswTL_d8ibL3NBr7xBEsLSEXnVB1IbG6Dmp_TYFeCWgu3qkD7gch1gHMUd-yrAhuxySRuhwSEjY9rY7HjFwqku9NIY_HOCVzMFgLNn1ct99Ol15X34L_2GxdOvgRNZXiJQI03_bC-z6fD9B-SC7qN4J_UloURru-BZAOx5QEf50MONwuCU_MoktWmn4R3tZ31WSVSETPDGrJ9Lc1u19zQ1&authuser=0&nonce=ov43spacssu7i&user=11838597598179151713&hash=jbcln7lopb85ke1a3j31e6lo9q3ns09b",
                        "https://gov.gitcoin.co/t/why-i-am-holon-maximalist/10152",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/can-gitcoin-be-doing-more-to-support-ethereum-protocol-devs/10151",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/proof-of-impact-proposals-wanted/10179",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/impactdao-cartographers-wanted/9866",
                        "https://gov.gitcoin.co/t/devrel-gitcoindao/10161",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-wonder/10170",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xd7e430bdbff261f3b32738e44f91efe85512f9a3359e38fa3c4c3c86f380b47e",
                        "https://gov.gitcoin.co/t/proof-of-impact-proposals-wanted/10179",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x54a5344b67a260f4951ee957e7da2191557a34de39512172394cedc086fa0a99",
                        "https://gov.gitcoin.co/t/proposal-grants-policy-update-projects-with-tokens/10125",
                        "https://gov.gitcoin.co/t/proposal-grants-policy-update-projects-with-tokens/10125",
                        "https://gov.gitcoin.co/t/data-science-gitcoindao/10088",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/t/introducing-the-steward-forum/9485",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "http://gitcoin.co/grants",
                        "https://verses.xyz",
                        "https://twitter.com/verses_xyz",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://twitter.com/owocki",
                        "https://open.spotify.com/show/0l6aXWC94dd0RA3tkKfxjd",
                        "https://podcasts.apple.com/us/podcast/2-ethers-phoenix-with-optimisms-karl-floersch/id1609313639?i=1000552104369",
                        "https://twitter.com/tracheopteryx",
                        "https://schellingpoint.gitcoin.co/",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://ethelo.com",
                        "https://docs.google.com/forms/d/e/1FAIpQLSdoGB9d0SWyC-VC9Ntp4lSpFcW7v1lOrhmLHk-Yk4Zw2DRfYA/viewform",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://gov.gitcoin.co/t/harnessing-collective-intelligence-for-workstreams-with-radicalxchange-voice/10024",
                        "https://pol.is/home",
                        "https://www.addevent.com/event/un12865532",
                        "https://docs.google.com/spreadsheets/d/1uh0XjeKlpbb0CqKy2jL0wo6IZmw2uslHh3MBKqlfLgQ/edit#gid=0",
                        "https://gitcoin.notion.site/DAO-Ops-84f425e281ae49579a2b4acf0bad5dd5",
                        "https://www.utopialabs.com",
                        "https://gitcoin.co/blog/trust-bonus",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://schellingpoint.gitcoin.co",
                        "https://www.youtube.com/playlist?list=PLvTrX8LNPbPlryx_S85pZPfH9yD7qcPsg",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-11-2022/10277"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7448065476190475
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862",
            "title": "GitcoinDAO Digest Edition #5 2022 ",
            "index": 9862,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "2",
                    "time": "09/02/2022-18:05:27",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!    Key actions for this week:  Check out and give feedback on the budget request by MMM, FDD, dCompass & MC. Take a look at the Voter Guide by Kyle that summarize the Workstreams budgets. Check out The Schelling Point Agenda to learn all about the events planned in Denver on the 17th!    Meta-Governance    The Steward Council - Formation & Mandate by Simona seeks to “select the members of the GD Steward Council, approve its mandate and tenure. (…) This council looks to elevate the participation of the most engaged stewards.” Currently 14 stewards are eligible for a seat on the council.   Treasury Diversification Part II - Welcoming Strategic Partners was posted by Dan. The post is proposing that “Gitcoin diversify $15 million of its treasury into stablecoins”. If you are interested in participating please fill out this form or share your thoughts in the thread. An update was also shared with progress so far and the next steps forward.   Kyle has provided a Summary on the S13 Workstream Budget Proposals presents the TLDR of what each Workstream plans to achieve with their upcoming budget. The thread is directed towards “folks who may be struggling to digest the nuances in these proposals’’.   How does the DAO prioritize side rounds? was posted by Owocki to spark a discussion on the importance of having a credible and neutral policy to ensure a smooth running of the Gitcoin Grants side rounds, with notable contributions by Scott and Connor. There is also an active discussion in the Community Input on GR13 Structure-thread regarding how our upcoming GR13 specifically will be architectured.   A DAO has no CEO by Owocki sheds light on how GitcoinDAO has grown over the past year and goes into detail on the separation between Gitcoin Holdings (the legal entity that launched the DAO) and GitcoinDAO.   The Great Bear, The Great Reset, The Great Revival by Owocki provides insight into Gitcoin’s history, the major challenges that we’ve overcome and how we are growing into the next phase - “The Great Revival”.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     Moonshot Collective Q2 Budget Request DAO Operations Workstream Budget - Q1 2022    FDD Season 13 Budget Request     MMM Season 13 Budget Request     dCompass Season 13 Budget Request     [SUMMARY] S13 Budget Proposal Recap - Kyle’s Voter Guide     Treasury Diversification Part II - Welcoming Strategic Partners     Introducing the Steward Council     2/17 ETH DENVER event        Workstream Discussion    Public Goods Funding   No updates for this week — check back next week to see what we’re working on behind the scenes!    Moonshot Collective    It’s budget season! Check out the Moonshot Collective budget request for the months to come.   Since Q4 2021, Moonshot Collective has raised over $3 million for public goods through GreatestLARP, Moonshot Bots, and Mars-shot Bots. We’ve built and dogfooded decentralized tech like Pay.Party, Tokenstream.Party, and Tip.Party. And more! Read all about it on the linked governance post.     Fraud Detection & Defense (FDD)   We’ve submitted our FDD Workstream Season 13 budget request for your input. Check out how far we’ve come since Season 12, and how we intend to continue defending Gitcoin from threats to its legitimacy, credible neutrality, and sustainability, over the next several months.    Merch, Memes & Marketing    The MMM Workstream Season 13 budget request is live on the forum with our visions and goals for the upcoming months – check it out and give us some feedback!   The first Can Devs Do Something developer meet-up was hosted last week in Lisbon at Crypto hub, The Block. Our 2nd meet-up is happening next week in Denver on the 15th!   We have revamped the onboarding experience for new contributors joining the workstream. This includes a new Talent Coordinator role supported by a Talent Squad. Also in development is a self-guided Wiki that new contributors can use to navigate and contribute to MMM.     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET on Discord! We have been seeing great attendance and engagement and we would love for you to join us. Afterwards there is the Gitcoin Contributors Happy-Hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? Every other Monday we’ll tell you all about how we’re organized and how you can become an active contributor. The next one is Monday, February 14, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://gov.gitcoin.co/t/proposal-mmm-season-13-budget-request/9818/",
                        "https://gov.gitcoin.co/t/proposal-fdd-workstream-season-13-budget-request/9826/",
                        "https://gov.gitcoin.co/t/proposal-dcompass-season-13-budget-request/9794",
                        "https://gov.gitcoin.co/t/moonshot-collective-workstream-budget-request-q2-2022/9824",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kyles-voter-guide/9856",
                        "https://schellingpoint.gitcoin.co/#agenda",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/t/the-steward-council-formation-mandate/9843",
                        "https://gov.gitcoin.co/u/Pop",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/u/schlabach",
                        "https://docs.google.com/forms/d/e/1FAIpQLScpCS8BMyp0M6VJ9OrDRWyYr1FaQqGdsHd94AS314dEUFxvmg/viewform",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-2-5-2022/9830",
                        "https://gov.gitcoin.co/u/kyle",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kyles-voter-guide/9856",
                        "https://gov.gitcoin.co/t/how-does-the-dao-prioritize-side-rounds/9827",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/u/ceresstation",
                        "https://gov.gitcoin.co/u/connor",
                        "https://gov.gitcoin.co/t/discussion-community-input-on-gr13-structure/9735/6",
                        "https://gov.gitcoin.co/t/a-dao-has-no-ceo/9852",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/moonshot-collective-workstream-budget-request-q2-2022/9824",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/16",
                        "https://gov.gitcoin.co/t/proposal-fdd-workstream-season-13-budget-request/9826/",
                        "https://gov.gitcoin.co/t/proposal-mmm-season-13-budget-request/9818/",
                        "https://gov.gitcoin.co/t/proposal-dcompass-season-13-budget-request/9794/1",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kyles-voter-guide/9856",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/t/introducing-the-steward-forum/9485",
                        "https://gov.gitcoin.co/t/proposal-2-17-eth-denver-event/9419",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://gov.gitcoin.co/t/moonshot-collective-workstream-budget-request-q2-2022/9824",
                        "https://greatestlarp.com/",
                        "https://bots.moonshotcollective.space/\\'",
                        "https://mars-shot.space/",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://gov.gitcoin.co/t/proposal-fdd-workstream-season-13-budget-request/9826",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://gov.gitcoin.co/t/proposal-mmm-season-13-budget-request/9818",
                        "https://bit.ly/denverdevs",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-4-2022/9816",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-6-2022/9949"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.06830808080808
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/02/2022-13:11:47",
                    "content": "Hey Fred, Great work as always. One question… How do we decide who’s voter guide to put at the top? This really makes it seem like Kyle’s voter guide is the opinion of the DAO. Is that the case? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#3",
                    "likes": "1",
                    "time": "11/02/2022-23:12:03",
                    "content": "Hey Joe, Great input, AFAIK the Voters-guide-thread is the place to go to participate in a broader discussion around the Season 13 budgets and how they relate to each other. I think that taking a step back and looking at the budgets in a wider context is of great benefit for the Stewards as they review and compare the different proposals. Maybe I should’ve been more clear that it’s mainly the discussion I’m inviting the reader to participate in, as opposed to highlighting the OP as an objective source of truth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.24537037037037
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#4",
                    "likes": "2",
                    "time": "14/02/2022-17:21:28",
                    "content": "Yes. Maybe there should be an objective voters guide that informs the stewards and community of what is being requested, but not the opinions of one steward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-11-2022/10277",
            "title": "GitcoinDAO Digest Edition #11 2022 ",
            "index": 10277,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#1",
                    "likes": "3",
                    "time": "31/03/2022-19:33:18",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!   Key actions for this week:  The FDD Workstream is running a polis discussion to collectively generate thoughts & ideas about budget proposals in GitcoinDAO and would appreciate your feedback. Attend Memepalooza VII this Friday to hang out and create memes with 100+ meme lords!    Meta-Governance:   In Grants 2.0 is how we scale our impact , Owocki shares his thoughts on the future of grants: “TLDR: Grants 1.0 is centralized & therefore has an upper limit to its growth. […] We can reduce fragility & scale our impact with Grants 2.0 I explore what that world looks like & attempt to build common understanding & consensus about that direction.”   In How do we scale our sensemaking?, Owocki shares the idea that “Sensemaking is the process by which people give meaning to their collective experiences” and asks “What novel sensemaking tools/processes, or sensemaking tools/processes for DAOs, should GitcoinDAO be aware of?”   A world where QF Enhances Every Income by Owocki describes an ambition of GitcoinDAO to have \"QF enhance every income” and how “Grants 2.0 could allow us to exponentially scale Grants because we’re not the ones administering the QF rounds anymore.”   Gitcoin Product Collective - how to map software teams to workstreams by LThrift outlines a strategy for how the “Gitcoin Product Collective becomes a meta-workstream that supports holding continuity across highly dependent teams while allowing for smaller, self-organizing groups oriented around deep protocol domains”   The Blue Ocean by Owocki is about how we explore The Internet of Jobs (an uncontested market space or blue ocean) and continue building products that can make Web3 go mainstream.   In Abundance & Scarcity  by Owocki, Kyle replies to share his thoughts on how GitcoinDAO scales through having aspects of being an ImpactDAO (funding public goods), ProtocolDAO (Coordination Party Kit, Grants 2.0), and InvestmentDAO (grant funding leads to early project discovery). Kyle also describes how Gitcoin continues to diversify it’s treasury and that workstream leads “are doing double duty, running the DAO and their Workstreams”   In Wartime DAO / Peacetime DAO, Owocki shares insights from the Ben Horowitz essay on the differences between Peacetime CEO & Wartime CEO. He emphasizes the importance of knowing that Peacetime and Wartime have different values and makes a “challenge [to] the DAO stewards & leaders to be aware of whether they are in wartime or peacetime.”   Why I am Holon Maximalist  by Owocki introduces the idea of Holons as “the collectivist circles we individuals live in” and goes on to describe how “Each Holon can have a QF round. Maximizing the Holons that have QF is how we win.”   In Can Gitcoin be doing more to support Ethereum Protocol Devs?, Owocki started a discussion where Trent introduces Protocol Guild: a coalition of protocol developers who aim “to provide autonomous tools for recruitment, retention, and reward to the protocol and its maintainers.”   DAO Design Best Practices by Owocki highlights Best Practices advocated by Tracheopteryx and Chase Chapman which include being able to trust that your actions will replicate in the way you expect them (process fidelity), being able to navigate inevitable tensions, and being able to see what’s happening in a DAO (network topography) and step up to help.     GitcoinDAO Governance Overview:     Proposal Discussions Active Proposals Latest completed proposals     Partnership & Mutual Grant with Wonder     Proof Of Impact      Grants Policy Update: Projects with Tokens     Data Science @ Gitcoin DAO     Treasury Diversification Part II - Welcoming Strategic Partners        Workstream Discussion    Public Goods Funding    Grants round 13 is in the books! We raised $4.6M for public goods, with $3.2M from matching funds and $1.4M from the community!    Round 13 grantees can expect payouts to be ready to claim on April 15th!     Moonshot Collective    Green Pill Podcast Episode 6 hosted by Owocki is live! Kevin is joined by serial entrepreneur Jordan Hall to talk about how to achieve harmony and sovereignty on a civilizational scale. This is a heavy episode, so strap in!   Every month Moonshot Collective Devs demo their projects for the community. The next demo will be Monday, April 4 at 1 pm MT. Join here, or checkout the video later on MC Youtube.   GTChase and Willsputra have written about how the “Moonshot Collective + Internet of Jobs = ”. They highlight how “[w]e are seeing a huge shift of talent coming into Web3 + more of that talent being part time then full time. So the question becomes how do we onboard the continued influx of new talent & part time contributors to full time and meaningful work. “   Paulwalnuts writes about a new Product Idea and makes the case for why the moonshot collective should “Create a permissionless and possibly decentralized rapid testing platform for DAOs to more easily test their prototypes and designs.”     Fraud Detection & Defense (FDD)    We completed a review of the Trust Bonus system used to increase funder’s matching percentage and found that the majority of users do not verify at all   We closed all GR13 grants disputes and are super grateful to our contributors (special shoutout to Zer8)   We are running a polis discussion to collectively generate thoughts & ideas about budget proposals in Gitcoin DAO and need your feedback!   Thank you to FDD’s very own Octopus for making this great video where he shares his thoughts on the purpose of FDD and how it works     Merch, Memes & Marketing    Memepalooza 7 will be hosted in Discord on the OG meme day of the year: April 1st. This month we are inviting our frens from 1Hive as well, come join us! During the last Memepalooza we started a new initiative to highlight artists in our ecosystem and this month we are excited to feature Gitcoin’s very own Colton Orr!   We are testing Matomo as our web analytics tool instead of Google Analytics after engaging with our community about data privacy.   The RadicalxChange Voice event regarding how we will structure and evolve the MMM Workstream going into Season 14 has been concluded! The participation from our contributors was great, check out the result deck to learn more. Shout out to @erich and @anoanoano for helping facilitate the experiment!   Seanmac created a post which discusses the lack of Product Marketing at Gitcoin and advises that “As we enter Season 14 budget planning, we should think strongly about investing in product marketing.”     DAO Operations    We are initiating a project to improve our governance forum and request your feedback in this 4-minute survey.   Our accounting team is diversifying FDD and DAO Ops treasuries and seizing opportunities to swap into stablecoins. We have also sent reimbursements to FDD members for EthDenver and are sending DAO Ops members reimbursements by the end of the month.   We are engaging with our Steward Council by defining a structure for calls, discussing foundation bylaws, and voting fee reimbursements.     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET on Discord! We have been seeing great attendance and engagement and we would love for you to join us. Afterwards there is the Gitcoin Contributors Happy-Hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? Every other Monday from 1:00 to 2:00 PM EST we’ll tell you all about how we’re organized and how you can become an active contributor. If you haven’t applied, do this first!)   Memepalooza 7 will be hosted on Friday in Discord. All your favorite memelords will be there – don’t miss out!   Registrations are open for SchellingPoint@EthAmsterdam! After the great success of SchellingPoint@EthDenver, we’re crossing the Atlantic to keep the coordination party going in the Netherlands. Come hear from some of the greatest minds in crypto IRL on 4/21!     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition  1600×381 61.7 KB  ",
                    "links": [
                        "https://pol.is/5arjtwwtpz",
                        "https://www.addevent.com/event/un12865532",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/how-do-we-scale-our-sensemaking/10192",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/a-world-where-qf-enhances-every-income/10202",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/why-i-am-holon-maximalist/10152",
                        "https://gov.gitcoin.co/t/gitcoin-product-collective-how-to-map-software-teams-to-workstreams/10204",
                        "https://gov.gitcoin.co/u/lthrift/summary",
                        "https://gov.gitcoin.co/t/the-blue-ocean/9868",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/abundance-scarcity/10045/5",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/u/kyle/summary",
                        "https://gov.gitcoin.co/t/wartime-dao-peacetime-dao/10228",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://future.a16z.com/peacetime-ceo-wartime-ceo/",
                        "https://gov.gitcoin.co/t/why-i-am-holon-maximalist/10152",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/can-gitcoin-be-doing-more-to-support-ethereum-protocol-devs/10151/10",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/u/trent/summary",
                        "https://protocol-guild.readthedocs.io/en/latest/index.html",
                        "https://gov.gitcoin.co/t/dao-design-best-practices/10219",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://twitter.com/tracheopteryx",
                        "https://twitter.com/chaserchapman",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-wonder/10170",
                        "https://gov.gitcoin.co/t/proof-of-impact-proposals-wanted/10179",
                        "https://gov.gitcoin.co/t/proposal-grants-policy-update-projects-with-tokens/10125",
                        "https://gov.gitcoin.co/t/data-science-gitcoindao/10088",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://availableon.com/greenpill",
                        "https://twitter.com/owocki",
                        "https://twitter.com/jgreenhall",
                        "https://zoom.us/j/97330538534?pwd=eHJranh2dFlIWUhlOUlyVHhOclJCQT09",
                        "https://www.youtube.com/channel/UCfbOba7iD19HyrB9QbV6Uww",
                        "https://gov.gitcoin.co/u/GTChase",
                        "https://gov.gitcoin.co/u/willsputra/summary",
                        "https://gov.gitcoin.co/t/moonshot-collective-internet-of-jobs/10250",
                        "https://gov.gitcoin.co/u/paulwalnuts/summary",
                        "https://gov.gitcoin.co/t/product-idea-introducing-uxtesting-party-for-feedback-and-discussion/10208",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://drive.google.com/file/d/1Cj_YZnlEA291ApBJ-UeAvx-e6ke04Zc_/view?usp=sharing",
                        "https://pol.is/5arjtwwtpz",
                        "https://www.youtube.com/watch?v=GrYD_gTHgys",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://www.addevent.com/event/un12865532",
                        "https://matomo.org/",
                        "https://gov.gitcoin.co/t/harnessing-collective-intelligence-for-workstreams-with-radicalxchange-voice/10024",
                        "https://docs.google.com/presentation/d/16QKwe7UVm1Sj4NM0HA9d0up2GYhnMl6Lwh0hffRw1Hc/edit?usp=sharing",
                        "https://gov.gitcoin.co/u/seanmac/summary",
                        "https://gov.gitcoin.co/t/product-marketing-at-gitcoin/10203",
                        "https://gitcoin.notion.site/DAO-Ops-84f425e281ae49579a2b4acf0bad5dd5",
                        "https://docs.google.com/forms/d/e/1FAIpQLSdNGCiHFF_RXBAPr6SMWqemCeVJY0BKQPVFaBxOTgxeU1jfIg/viewform?usp=sf_link",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.addevent.com/event/un12865532",
                        "http://gitcoin.co/discord",
                        "https://schellingpoint.gitcoin.co/",
                        "https://www.youtube.com/playlist?list=PLvTrX8LNPbPlryx_S85pZPfH9yD7qcPsg",
                        "http://gitcoindao.com/",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-10-2022/10209",
                        "https://gov.gitcoin.co/t/impactdao-category-creation-proposals-wanted/10500"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.366622505846644
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "1",
                    "time": "31/03/2022-20:55:07",
                    "content": "small nitpick, this is GitcoinDAO Digest Edition #11 in 2022 not GitcoinDAO Digest Edition #11! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#3",
                    "likes": "0",
                    "time": "31/03/2022-22:12:47",
                    "content": "Thanks for the feedback! Updated ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-6-2022/9949",
            "title": "GitcoinDAO Digest Edition #6 2022 ",
            "index": 9949,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "3",
                    "time": "24/02/2022-05:08:05",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. There’s been quite a few updates during Schelling point and ETHDenver so without further ado - let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!    Key actions for this week:  Ratify the FDD Season 13 Budget Request  Ratifythe Moonshot Collective Season 13 Budget Request  Ratify the MMM Season 13 Budget Request  Check out The Schelling Point Playlist with talks from our event in Denver!    Meta-Governance    KERNEL Evolves: A New Leaf For Gitcoin DAO by Vivek describes how “KERNEL is on the path to spinning out from Gitcoin, paving the path for it to create its own space within GitcoinDAO & beyond.”   Gitcoin GR13 Matching Pool Allocations by Annika looks to “discuss and finalize how funding allocations for the Gitcoin Grants Round 13 Matching Pool are distributed.”   How to Pitch Your Project on Gitcoin Grants by Leon is a great guide on how to optimize your Gitcoin Grant description.   Summary S13 Budget Proposal Recap Kris’s Voter Guide by Kris aggregates his thoughts on the S13 Workstream budget requests. Make sure to also take a look at Kyle’s voter guide and join the conversation.   Treasury Diversification Working Group Update by Dan provides the latest and greatest from the working group working on GitcoinDAO Treasury diversification. If you’d like to recommend a strategic partner, please leave a comment on the second forum post or contact a member of the working group.   The Steward Council - Formation & Mandate has been updated after feedback by the community, the initiative will go live shortly with a dozen of Gitcoin Stewards.   Leon proposed to experiment with Partial common ownership constructs to fund public goods in Gitcoin, Web 3, and beyond.   Jon from Shapeshift joined the discussion in the A Dao Has No CEO-thread with his perspective of “decentralizing ShapeShift and going through some very similar questions and situations as I think you are dealing with in Gitcoin”.   The Blue Ocean by Owocki explores the Blue Ocean of Internet of jobs (IoJ). The post starts a conversation around how Gitcoin products already deployed to the VLue Ocean and what blue ocean opportunities the DAO is interested in pursuing   ImpactDAO Cartographers Wanted by Owocki describes ImpactDAO as an up & coming money lego. If you are interested in helping catalog the ImpactDAOs ecosystem & articulating their impact to the world, join the Telegram chat!   Disruption Joe won 2nd place in the Metapod pitch competition during EthDenver by showcasing the need for a Sybil Detection DAO. This service DAO would be incubated in FDD and GitcoinDAO would participate in the founding council and earn governance via investment and incubation funding.   Retreat 2022 Impressions by Owocki is an invitation for anyone who attended the Gitcoin retreat in Boulder Colorado to share their impressions or learnings from the event.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     Gitcoin GR13 Matching Pool Allocations FDD Season 13 Budget Request dCompass S13 funding request   [SUMMARY] S13 Budget Proposal Recap - Kyle’s Voter Guide Moonshot Collective Season 13 Budget Request FDD Season 13 Budget Request   Summary S13 Budget Proposal Recap Kris’s Voter Guide  MMM Season 13 Budget Request   Treasury Diversification Part II - Welcoming Strategic Partners  Moonshot Collective Season 13 Budget Request   Introducing the Steward Council  DAO Operations Workstream Budget - Q1 2022     dCompass Season 13 Budget Request      Workstream Discussion    Public Goods Funding    Ecosystem + cause rounds were announced during Schelling Point and ETHDenver, alongside the first Gitcoin Aqueduct partner!   The workstream is pushing hard this week to hit >$1m in funds raised for the main pool in GR13 alone.   Forward planning for the library and public goods weekly continues to improve, with guests from across the ecosystem planned for the rest of Q1.   Several micro-grantees have started to showcase their work. Verses put their latest drop forward last Wednesday, and Crypto Culture and Society has formally launched Semester II.     Moonshot Collective    Kevin’s talk “Take The Green Pill” in ETHDenver covers our new GreenPill.Party initiative. Are you ready to take the pledge, Anon?   Austin Griffith talk “From Scaffold-ETH to BuidlGuidl to Moonshot & Beyond: A Magical Bufficorn Journey” presents Scaffold-ETH and other exciting DAO tech we’ve been working on.   Emu gave an update on how Moonshot Collective is using its own tools to Tip and Pay our devs. In January 100% of compensation was paid through the tools created within the workstream.     Fraud Detection & Defense (FDD)    Stay updated on our progress in our FDD Weekly Update every Monday at 11am EST in Discord, or review the slides.   Data analysis shows that XGboost ML algorithms perform significantly better than the current random forest model implementation. This discovery is a direct result of the community model squads work.   Grant reviews are currently happening within 4 days and will be less than 48 hours during the last week before and the first week during GR13. GIA deployment for all reviews is blocked by legal concerns of Gitcoin Holdings.   Multisig changes are happening as the multisig keyholders which act as oversight of the workstream lean into their role and are actively making adjustments based on the workstream expectations. Our recent additions are going through a nomination and voting process which is being refined.     Merch, Memes & Marketing    The Gitcoin Primer is live with a 5-10 minute walk-through on the vision and mission of the Gitcoin ecosystem and how to get involved. Check out the TLDR - What is Gitcoin?- thread as well for further context.   The second Can Devs Do Something?!-meetup took place during ETHDenver. Over 40 people joined us as we vibed, ate donuts and discussed everything from Hackathons to memes.   We received a ton of great submissions on our 4 bounties posted to the Schelling Point Hackathon. The winners have been contacted and bounties paid out. Check out the How to bridge to L2’s blog post to read the winning submission for the blog post bounty!   We’ve set up custom m-m-m.eth subdomains for our contributors in order to easier integrate and use the coordination tools in the MC party-suite.     Upcoming community events    Community Onboarding Call! New to Gitcoin? Every other Monday we’ll tell you all about how we’re organized and how you can become an active contributor. The next one is Monday, February 28, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)    New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/17",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/18",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/19",
                        "https://www.youtube.com/playlist?list=PLvTrX8LNPbPlryx_S85pZPfH9yD7qcPsg",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/t/kernel-evolves-a-new-leaf-for-gitcoin-dao/9912",
                        "https://gov.gitcoin.co/u/vivek",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-gr13-matching-pool-allocations/9915",
                        "https://gov.gitcoin.co/u/annika",
                        "https://gov.gitcoin.co/t/how-to-pitch-your-project-on-gitcoin-grants/9898",
                        "https://gov.gitcoin.co/u/leone",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kris-s-voter-guide/9895",
                        "https://gov.gitcoin.co/u/krrisis",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kyles-voter-guide/9856",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-2-19-2022/9927",
                        "https://gov.gitcoin.co/u/schlabach",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/t/the-steward-council-formation-mandate/9843",
                        "https://gov.gitcoin.co/u/leone",
                        "https://gov.gitcoin.co/u/JonisJon",
                        "https://gov.gitcoin.co/t/a-dao-has-no-ceo/9852/4",
                        "https://gov.gitcoin.co/t/the-blue-ocean/9868",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/impactdao-cartographers-wanted/9866",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://t.me/+ORZ8joj8_AhjM2I5",
                        "https://twitter.com/MetaPodDAO/status/1495578393424932871?s=20&t=9dpt0tRgRA6Mmavg9MCyjw",
                        "https://gov.gitcoin.co/t/retreat-2022-impressions/9944",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-gr13-matching-pool-allocations/9915",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/17",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x6cf2d1e9d1f00ed74d296b719c46327d66a1af2be5275c3eb545f878d8890614",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kyles-voter-guide/9856",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/18",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x93d337378cc8c6c507b88ebb518ddd57f772bb010b75cb9daaae03974eeacfdb",
                        "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kris-s-voter-guide/9895",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xa6fa6cae4e3c341f4b65a580779e3e66430e02b8979e54c49536fce583cb3735",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x6a7500e65d65468fede15c1a447b1077e75fe66dd4ca87b690dde904c0008b8b",
                        "https://gov.gitcoin.co/t/introducing-the-steward-forum/9485",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/16",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x6cf2d1e9d1f00ed74d296b719c46327d66a1af2be5275c3eb545f878d8890614",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://twitter.com/gitcoin/status/1494467687161942016?s=20&t=bfCiuVZJpdkXceLGxmEHmg",
                        "https://pluriverse.world/",
                        "https://twitter.com/CryptoSocietyS1/status/1489709838301081613",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://www.youtube.com/watch?v=qP7wqLWV33M",
                        "https://greenpill.party/",
                        "https://www.youtube.com/watch?v=tZUE0ZGWRY8",
                        "https://gov.gitcoin.co/u/kdm5126",
                        "https://gov.gitcoin.co/t/coordination-party-kit/9231/7",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://docs.google.com/presentation/d/1QuQcozQtKV2vukzYp2u9z-wW60uV3egs9mlX9orHFMI/edit#slide=id.g104d241aaa0_6_0",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://primer.gitcoindao.com/",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://www.addevent.com/event/XO11944135",
                        "https://gitcoin.co/hackathon/schellingpoint/?org=mmmgtc",
                        "https://gitcoin.co/blog/howto-get-funds-on-layer2s",
                        "https://moonshotcollective.space/",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.gitcoindao.com",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-7-2022/9996"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8238766085512665
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-2-2022/9739",
            "title": "GitcoinDAO Digest Edition #2 2022 ",
            "index": 9739,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "2",
                    "time": "19/01/2022-22:06:59",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading! Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!    Key actions for this week:   Make sure to vote on the three live proposals on Snapshot and Tally: a. Public Goods Funding workstream budget b. Developer DAO Partnership c. Gitcoin DAO - Workstream Accountability Flow   Share input and join the conversation on our Roadmap and our goals for 2022     Meta-Governance    Gitcoin Treasury Diversification posted by Shreyas from Llama proposes “that Gitcoin diversify $15 million of its treasury into stablecoins.” The goals of the treasury diversification are to “de-risk Gitcoin’s treasury, make sure the treasury has sufficient stablecoins to cover one year of operating expenses, and ensure that GTC tokens are held by long-term partners.”   Season 13 (2/1-4/30) | Aligning the workstream budgets to make life easier for the Stewards posted by Joe proposes a way to set up a structure for the timing of Workstreams budget proposals. The proposal detailed in the thread has been ratified by the CSDO group, with representatives from each workstream, and establishes a shared infrastructure and processes to follow going forward.   Gitcoin Aqueduct posted by Dave and co-authored by Owocki is a paper which introduces the “a tool that incentivizes ecosystem development for your project with a single line of Solidity.” The tool is aimed to reduce the “friction involved with starting a protocol while providing opportunities for developers to make a living contributing to open source”. Contact aqueduct@gitcoin.co if you’d like to set up a Gitcoin Aqueduct!   Regen CryptoEconomics Book: Governance by Owocki goes into detail of the book that’s being written on “cryptoeconomic systems that create positive externalities for their neighbors & for the world.” in regards to how it will be governed. The thread looks for stakeholders who can evolve the project forward in next edition(s). A separate thread was also started to receive feedback regarding a potential foreword in the 0th edition of the book authored by the GitcoinDAO community.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     Gitcoin Treasury Diversification Gitcoin DAO - Workstream Accountability Flow DAO Operations Workstream Budget - Q1 2022   Introducing the Steward Forum Developer DAO Partnership Grants Round 12 Ratification & Payout   2/17 ETH DENVER event Public Goods Funding workstream budget       Workstream Discussion    Public Goods Funding    Discussion: Community Input on GR13 Structure posted by Annika seeks community input on what the community would like to see in terms of structure for GR13, which will run from March 9-24, 2022.   GR12 matching fund payouts have been initiated! Grantees have been sent emails with their final amounts and can claim them directly from the link in those emails.   Our first two DAO partnerships have been finalized and posted Tally, for both DeveloperDAO and PrimeDAO, with more on the horizon   The Public Library is working on a new public goods syllabus alongside Crypto Culture and Society and continuing to host weekly conversations with guests like @caseorganic and @biancamikaila    Alisha and Lani continue to host Public Goods Are Good with previous grantees and other members of the Gitcoin community, if you have suggestions for guests, please reach out!     Moonshot Collective   It’s all coordination — always had been. That’s why we’re building the Coordination.Party Toolkit. Each decentralized Toolkit app helps DAOs recruit, recognize, reward, or retain contributors. For example Recuriter.Party is a decentralized LinkedIn where job seekers get paid when recruiters access their profile. And Pay.Party allows teams to allocate a budget in a democratic way. We’re building coordination tools for GitcoinDAO and beyond. Keep track of our weekly progress here.    Decentralize Gitcoin    Payouts for dGrants Gitcoin Building Gitcoin Grant Round have been issued.   Research for dGrants protocol V1 proposal is in progress, the research include:  Smart contract upgradability Grant creation flow considerations Curation approaches Grant Metadata management    DevOps has been working with teams to identify some additional needs, to ensure calendars are regularly synced and help with the build process of GitBook together with MMM.     Fraud Detection & Defense (FDD)    We are updating the FDD Operating System, including:  Making sure contributors understand the How, What, When, and Why of getting paid Ensuring FDD delivery of mandate via proper success metrics for sybil, grants, and research Proper access control for all documentation and project management Contributors know which meetings to attend, where information and conversation are being held and proper review cadence A clear system for making decisions and adding contributors    Q1 Outcomes for Sybil Defense are:  GitcoinDAO runs the ASOP end-to-end. Blockscience scope reduced and redirected. Alignment on a single high-quality codebase and single source of truth for documentation Clearly define the data needing access control vs what can be opened up A basic app for human evaluations is built, used, and analyzed after the round Gain commitments and requirements for participation in a Sybil Detection data storage      Merch, Memes & Marketing    We hosted the 5th iteration of Memepalooza last Friday in Discord with over 40 attendees and lots of great memes. We scored a 9.2/10 on overall satisfaction with the event and 66% of respondents said 10/10 they would come back. We also discovered some new bugs of Memes.party which are being worked on.   Three design bounties have been listed in the Schelling Point Hackathon, which begins on Jan 20. Are you interested in creating some awesome Reaction stickers, GR13 POAPs or DAO Governance POAPs? There’s 1000DAI up for grabs for each of these, check them out!   Memes.party and Steward Report Cards have both received optimizations and improvements during the week as a step closer to their respective v2.0 launch later this quarter.   We’re always interested in assisting with other groups and initiatives within GitcoinDAO. Please utilize our Request form and let us know if you’re looking for support or collaboration!     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET in Discord! We have been seeing great attendance and engagement and we would love for you to join us. New this year is a Gitcoin Contributors Happy-hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? Every other Monday we’ll tell you all about how we’re organized and how you can become an active contributor. The next one is Monday, January 31, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/13",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/14",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xa4dd8527231eeb912929e0874b689144565fc6d2cbc0faed7cc694622e07eb6b",
                        "https://gov.gitcoin.co/t/2022-roadmap-2022-goals/9613",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/t/gitcoin-treasury-diversification/9698",
                        "https://gov.gitcoin.co/u/HelloShreyas",
                        "https://gov.gitcoin.co/t/season-13-2-1-4-30-aligning-the-workstream-budgets-to-make-life-easier-for-the-stewards/9738",
                        "https://gov.gitcoin.co/u/DisruptionJoe",
                        "https://gov.gitcoin.co/t/gitcoin-aqueduct/9684",
                        "https://gov.gitcoin.co/u/paradave",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/regen-cryptoeconomics-book-governance/9713",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/regen-cryptoeconomics-book-foreword-by-gitcoindao/9711",
                        "https://gov.gitcoin.co/t/gitcoin-treasury-diversification/9698",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xa4dd8527231eeb912929e0874b689144565fc6d2cbc0faed7cc694622e07eb6b",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xaf6b1e2a1a7ed4022b214baccd5e3d12b9037b009e4ea49ec8b9f782a5003c1c",
                        "https://gov.gitcoin.co/t/introducing-the-steward-forum/9485",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/14",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x97a2ed00ed7c5f06d731724856e8a96755ceb38d3e35adfe207b972c9489ec7a",
                        "https://gov.gitcoin.co/t/proposal-2-17-eth-denver-event/9419",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/13",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://gov.gitcoin.co/t/discussion-community-input-on-gr13-structure/9735",
                        "https://gov.gitcoin.co/u/annika",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xe74f2ddceaf3a50cb7c6de9ae1be5ace0bed4c5c34ca980adda8d323de1cd2c6",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x29eaaff1ca752785b508298b4aaf5d4bf3173e9b3859b9832cc84c5b12b48847",
                        "https://twitter.com/caseorganic",
                        "https://twitter.com/biancamikaila",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://coordination.party/",
                        "https://www.youtube.com/channel/UCfbOba7iD19HyrB9QbV6Uww",
                        "https://gitcoin.notion.site/Decentralize-Gitcoin-cd6d46d3784244e4ae7a68b108bb9495",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://docs.google.com/document/d/1rfXHYbCoXcErmJtED_W0JhS-6W3TvFEUNNltlOaM9_o/edit?usp=sharing",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "http://memes.party/",
                        "https://gitcoin.co/hackathon/schellingpoint/",
                        "https://gitcoin.co/issue/mmmgtc/bounties/1/100027489",
                        "https://gitcoin.co/issue/mmmgtc/bounties/3/100027521",
                        "https://gitcoin.co/issue/mmmgtc/bounties/2/100027492",
                        "http://memes.party/",
                        "https://www.daostewards.xyz/",
                        "https://m-m-m.xyz/request",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-1-2022/9683",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-3-2022/9771"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.771802108253588
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110",
            "title": "GitcoinDAO Digest Edition #9 2022 ",
            "index": 10110,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "3",
                    "time": "17/03/2022-19:33:32",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!    Key actions for this week:  Vote on the Gitcoin Foundation proposal Vote on Steward Council Term Allocation proposal Gitcoin GR13 is live - Donate to your favorite grants across the 13 Match Rounds!    Meta-Governance    A visual history of Gitcoin’s mission (2017 - 2022) by Owocki is a visual overview of Gitcoin’s journey so far. “From Open Source Funding > Open Source Funding & Public Goods Funding > Funding Public Goods as a means to create Human Thriving”   How Soulbound Tokens Can Make Gitcoin Grants More Pluralistic by Leon introduces the Plurality paradigm for funding public goods and details its application to Quadratic Funding and Gitcoin. The proposed social incentive design combines soulbound attestations and pairwise quadratic funding to capture cooperation between grant contributors and increase Plurality.   Abundance & Scarcity by Owocki raises questions regarding how we should make the most of our current abundance prior to the next potential bear market. ”How do we maximize the utility & anti-fragility of the Gitcoin network?”   GitcoinDAO as a generator function for innovation by Owocki describes GitcoinDAO as a “generator function for new coordination - protocols, DAOs, and public goods - GitcoinDAO generates net-new coordination using Open Source technologies. We create value before we capture value. We build ecosystems.”   The Donut Economy x 8 Forms of Capital by Owocki talks about the “world I want to see created by regen web3, using two frameworks which I discovered during research into GREENPILLED - how crypto can regenerative the world.” “If Gitcoin is a generator function of innovation, this post is a taxonomy of what I think the DAO could point its innovation machine at.”   Our Flagship Product is GitcoinDAO by Owocki argues that our flagship product is actually GitcoinDAO, as opposed to Gitcoin Grants as “GitcoinDAO is the totality of what we do and how we show up. Gitcoin Grants is just one part.”   Data Science @ GitcoinDAO by Owocki raises the question “What should the data science practice at Gitcoin look like?” The thread describes four areas of interest; Product Analytics & Data Science, Marketing Analytics & Data Science, Complex Systems Insights and Fraud insights.   Dan provided an update on the Treasury Diversification Working Group. If you’d like to recommend a strategic partner, please leave a comment on the second forum post or contact a member of the working group.   Gitcoin Appeals Discussion and Planning by David is a plan to “facilitate informed steward debate & vote for denied grant applicants seeking an appeal (…) specifically, the work-flows and automation associated with the system.”   Proposed Revision to Grant Eligibility Criteria by David is a proposal to “suggests a policy change to GitcoinDAO grant eligibility criteria. This policy change suggestion arose from the BrightID appeal request - Grant 191. This policy change is recommended by the Fraud Detection & Defence workstream of the GitcoinDAO.”     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     Proposed Revision to Grant Eligibility Criteria Should we adopt the Gitcoin Foundation and take legal possession of philanthropic assets from Gitcoin Holdings The Steward Council Election & Mandate    ImpactDAO Cartographers Wanted. Steward Council Term Allocation    Treasury Diversification Part II - Welcoming Strategic Partners     Introducing the Steward Council        Workstream Discussion    Public Goods Funding    Grants Round 13 is in full swing! It’s a great time to be a grantee and contributor – more matching funds are available than last round – we have over $3M in matching funds up for grabs!   Public Goods are Good! Our partners think so too. We’re partnering with:   Crypto, Culture, and Society (a learning DAO studying the impact of crypto on culture and society) are kicking off Season Two! Gitcoin will be playing a key role in helping build a liberal arts education for crypto   DeveloperDAO is bringing tons of amazing coders into the space to help us build new types of public goods   DreamDAO is continuing to help push forward the solarpunk + regen narrative to show the optimistic futures we can create together   Verses (a collective of writers, researchers, technologists) who have some of the best writing in the ecosystem about what it means to be a pluriverse.       Moonshot Collective    The Moonshot Collective Season 13 budget request has passed on chain as is queued for execution.   Green Pill Podcast Episode 4 hosted by Owocki is live on Spotify, Apple, and wherever you like to listen to podcasts. This episode features a panel of workstream leads from GitcoinDAO. They talk about Grants Round 13, which is ongoing now through March 24th.     Fraud Detection & Defense (FDD)    The FDD Season 13 budget request has passed on chain as is queued for execution.   Sybil Defenders   Our Anti-Sybil Operational Process (ASOP) has kicked off strong! We are moving this process into the DAO and will own the end-to-end process to identify and sanction sybil accounts.   We are running a human evaluation layer and believe more human evaluations can be done at a higher quality for lower cost!     Grants Investigation Agency   Last day to get a new grant approved for GR13 is 3/15! Apply now if you’ve been waiting! (Shout out to Zer8, David, and the grants review squads for staying on top of the incoming approvals!   Updated the appeals process for grants which were denied to have clearer strategies and outcomes. All appeals for GR13 so far have been heard     Ground Control   Our source council has gone through the first round of voting covering topics like multisig key holder responsibilities, workstream objectives and key results, and downside risk insurance.   Our data analytics squad is looking for requests. As we and others write code to analyze grants and DAO data, we are looking to aggregate and create dashboards to give the best of the best insights to our community on an ongoing basis.       Merch, Memes & Marketing    The MMM Season 13 budget request has passed on chain as is queued for execution.   Last week we had a kick off AMA session with Matt and Alex from RadicalxChange Foundation to go over the plan to integrate RxC Voice into our Season 14 Budget process. We’ve now begun the process which will run for 2 weeks!   Are you interested in how the visual intensity and branding for Gitcoin look like going forward? We are looking for more people to join in on the convo!   We’ve begun building out a Dune dashboard of GitcoinDAO with metrics and visuals to increase transparency of GitcoinDAO. The dashboard is still being built out, so expect more metrics and visuals to come. The version 2 of the Steward Report Cards are also in the works with better metrics for engagement of our awesome Stewards. More on this will be shared in the coming weeks.     DAO Operations    The great Puncar has created a video to help contributors navigate the Gitcoin Notion, organize their pages, and update their contributor information. Thanks Puncar!   February finance is in the books! The budget has been updated based on actual spend and payments have been successfully sent.   We are planning greater coordination with other workstreams on future budget and payments as well as reimbursing members of FDD and Dao Ops workstreams for Eth Denver.   We are growing the community experience by being thoughtful about our onboarding process, our public calls, and starting a DAO research initiative.   We are onboarding to Sobol with some of our first contributors. Sobol is a software tool for decentralized organizations to map accountability and find fast, agile, alignment for decision-making.     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET on Discord! We have been seeing great attendance and engagement and we would love for you to join us. Afterwards there is the Gitcoin Contributors Happy-Hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? Every other Monday we’ll tell you all about how we’re organized and how you can become an active contributor. The next one is Monday, March 28, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)   Registrations are open for SchellingPoint@EthAmsterdam! After the great success of SchellingPoint@EthDenver, we’re crossing the Atlantic to keep the coordination party going in the Netherlands. Come hear from some of the greatest minds in crypto IRL on 4/21!     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xd7e430bdbff261f3b32738e44f91efe85512f9a3359e38fa3c4c3c86f380b47e",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x54a5344b67a260f4951ee957e7da2191557a34de39512172394cedc086fa0a99",
                        "https://gitcoin.co/grants/",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/t/a-visual-history-of-gitcoins-mission-2017-2022/10049",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/how-soulbound-tokens-can-make-gitcoin-grants-more-pluralistic/10077",
                        "https://gov.gitcoin.co/u/leone",
                        "https://gov.gitcoin.co/t/abundance-scarcity/10045",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/gitcoindao-as-a-generator-function-for-innovation/10078",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/the-donut-economy-x-8-forms-of-capital/10079",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/gitcoindao-as-a-generator-function-for-innovation/10078",
                        "https://gov.gitcoin.co/t/our-flagship-product-is-gitcoindao/10081",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/data-science-gitcoindao/10088",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/u/schlabach",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-3-12-2022/10046",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/t/gitcoin-appeals-discussion-and-planning/10035",
                        "https://gov.gitcoin.co/u/David_Dyor",
                        "https://gov.gitcoin.co/t/proposed-revision-to-grant-eligibility-criteria/10098",
                        "https://gov.gitcoin.co/u/David_Dyor",
                        "https://gov.gitcoin.co/t/proposed-revision-to-grant-eligibility-criteria/10098",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xd7e430bdbff261f3b32738e44f91efe85512f9a3359e38fa3c4c3c86f380b47e",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x5784ba66b16153b15cd2b94625909cb1b4ee7d1c6b5f033b30d037fa90140db9",
                        "https://gov.gitcoin.co/t/impactdao-cartographers-wanted/9866/",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x54a5344b67a260f4951ee957e7da2191557a34de39512172394cedc086fa0a99",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/t/introducing-the-steward-forum/9485",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "http://gitcoin.co/grants",
                        "https://cryptosociety.notion.site/cryptosociety/Crypto-Culture-Society-01f39bcff26b422183061e6011b16892",
                        "https://twitter.com/CryptoSocietyS1/status/1489709838301081613",
                        "https://twitter.com/developer_dao",
                        "https://twitter.com/dreamdao_",
                        "https://verses.xyz",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://gov.gitcoin.co/t/moonshot-collective-workstream-budget-request-q2-2022/9824",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/20",
                        "https://twitter.com/owocki",
                        "https://open.spotify.com/show/0l6aXWC94dd0RA3tkKfxjd",
                        "https://podcasts.apple.com/us/podcast/2-ethers-phoenix-with-optimisms-karl-floersch/id1609313639?i=1000552104369",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://gov.gitcoin.co/t/proposal-fdd-workstream-season-13-budget-request/9826/25",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/23",
                        "http://gitcoin.co/grants",
                        "https://gov.gitcoin.co/u/zer8/summary?utm_source=gitcoindao&utm_medium=email&utm_campaign=news15",
                        "https://gov.gitcoin.co/u/David_Dyor?utm_source=gitcoindao&utm_medium=email&utm_campaign=news15",
                        "https://gov.gitcoin.co/t/gitcoin-appeals-discussion-and-planning/10035",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://gov.gitcoin.co/t/proposal-mmm-season-13-budget-request/9818",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/21",
                        "https://gov.gitcoin.co/t/harnessing-collective-intelligence-for-workstreams-with-radicalxchange-voice/10024",
                        "https://gov.gitcoin.co/t/discussion-gitcoin-visual-identity-branding/10023",
                        "https://dune.xyz/ivanmolto/Gitcoin-DAO",
                        "https://www.daostewards.xyz/",
                        "https://gitcoin.notion.site/DAO-Ops-84f425e281ae49579a2b4acf0bad5dd5",
                        "https://www.loom.com/share/ef19ae09c46141aca7b7f62868b830cc",
                        "http://gitcoindao.com",
                        "https://sobol.io",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://schellingpoint.gitcoin.co",
                        "https://www.youtube.com/playlist?list=PLvTrX8LNPbPlryx_S85pZPfH9yD7qcPsg",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-8-2022/10032",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-10-2022/10209"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.205922067901235
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-3-2022/9771",
            "title": "GitcoinDAO Digest Edition #3 2022 ",
            "index": 9771,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "4",
                    "time": "26/01/2022-17:48:10",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!    Key actions for this week:  Vote on the Gitcoin DAO - Workstream Accountability Flow Ratification  Make sure to claim your GitcoinDAO Contributor 2021 POAP!    Meta-Governance    Elliot from Llama posted an update to the Gitcoin Financial Reporting for December 2021. The statements are split into transactions denoted in GTC and in stablecoins.   GD Steward Roles & Responsibilities by Simona starts a conversation on the roles and responsibilities of our Stewards in GitcoinDAO. “Stewards are in charge of listening to their constituents, evaluating and voting on proposals. (…) They are the protectors of the legitimacy of the DAO, they are responsible for keeping the DAO on track to accomplish its mission, and they are final enforcers of responsibility for everyone working on the GitcoinDAO’s mission\".   We’ve seen a lot of great feedback for the foreword of his upcoming Regen CryptoEconomics book by Owocki. Check out some of the suggestions from Diego, Kyle, and Scott on how GitcoinDAO should be represented!   IRLart is asking for feedback on the beneficiary of the Gitcoin / Solar Punk Auction that will be hosted at ETHDenver. “It could go directly to the Gitcoin DAO multisig, but I thought it would be a great gesture of regenerative crypto economics to streamline it to the metaverse coordinators working group to continue elevating their efforts.”     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     Gitcoin Treasury Diversification Gitcoin DAO - Workstream Accountability Flow Ratification Gitcoin DAO - Workstream Accountability Flow   Introducing the Steward Forum  Developer DAO Partnership   2/17 ETH DENVER event  Public Goods Funding workstream budget      Workstream Discussion    Public Goods Funding    Annika and the Public Goods workstream are seeking community input on how we can improve the structure for the upcoming GR13 taking place from March 9-14 this year. “As we continue on the path of decentralizing Grants Ops from Holdings into the DAO, we want to build the habit of bringing the community in much earlier in the process to provide their input on what they want to see with respect to the matching pool, rather than having a Holdings-proposed structure that stewards simply vote on.”    Moonshot Collective    Heading out to ETHDenver in February? Our Moonshot Collective devs will be speaking at various points throughout the conference, and we’ll be hosting Schelling Point on Feb 17 where we’ll debut “Greenpilled”, Owocki’s Regen CryptoEconomics book. Stay tuned for more details.   Every week Moonshot Collective devs try out the apps they’ve been working on. We call it dogfooding, and our dogfood tastes good! Check out the project videos on our YouTube here.     Decentralize Gitcoin    We’ve published the data used to execute payouts on the governance forum as a final step in completing the payouts for the Gitcoin Building Gitcoin round that was run in GR12. Community members can now run through the verification process themselves! Currently, this process is lightly documented and requires strong technical expertise, but we are working on making this more user-friendly in the future.   Research on the various areas that will feed into the final design of the dGrants V1 Protocol is moving forward. The areas mentioned in our last update currently consist of Smart Contract Upgradability, Grant Creation Flow, Curation Approaches, and Grant Metadata Management. We are taking the learnings from the last two rounds as well as customer/user use cases to improve and designing a robust protocol accordingly.   It is clear that a multi-chain implementation of dGrants is a must, so we are working hard to ensure that we can take the V1 solution and deploy it across any EVM compatible network. This will allow us to build a single cohesive ecosystem on top of each of these Grant Registry deployments.   The DevOps team has created a request portal for the GitcoinDAO, making submitting requests significantly easier and more trackable.   Next week, we will be proposing rolling out DAO wide standards around required 2FA and the use of password managers.     Fraud Detection & Defense (FDD)   FDD will host a meeting with their multisig oversight group on Friday to review Q4 deliverables and Q1 budget proposal.    Merch, Memes & Marketing    We’ve listed 4 bounties (1, 2, 3, 4) in the Gitcoin Schelling Point hackathon leading up to ETHDenver! The bounties are worth over 3000 DAI in total, so make sure to check them out!   We’ve sent across the Regen vs Degen card game to the production company. Over a hundred decks have been ordered in the first batch that will be given out to attendees of Schelling Point in February. Make sure to keep an eye out for hidden easter eggs!   Check out the MMM Workstream objectives and key results for Q1 that was recently posted on the forum by Sean. Our budget request is being worked on and more details on this will be shared soon.   Make sure to claim your very own GitcoinDAO Contributor 2021 POAP if you contributed to any of the Workstreams last year!     Upcoming community events    Ever seen conflicts in DAOs & wondered how to handle them in a non-hierarchical way? Stay tuned for an event on Conflict Resolution, where you can hear from several trained facilitators. The event will be February 8th at 3pm ET, joining details will be sent out next week!   Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET in Discord! We have been seeing great attendance and engagement and we would love for you to join us. New this year is a Gitcoin Contributors Happy-Hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? Every other Monday we’ll tell you all about how we’re organized and how you can become an active contributor. The next one is Monday, January 31, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/15",
                        "https://discord.com/channels/562828676480237578/890336705998127165/933827677041860628",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/u/Elliott",
                        "https://gov.gitcoin.co/t/gitcoin-financial-reporting/8867/3",
                        "https://drive.google.com/file/d/12Qgfrh4F1Q-mbsoLaEHGY8eLXJl75Sp_/view",
                        "https://gov.gitcoin.co/t/gd-steward-roles-responsibilities/9762",
                        "https://gov.gitcoin.co/u/Pop",
                        "https://gov.gitcoin.co/t/regen-cryptoeconomics-book-foreword-by-gitcoindao/9711/",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/u/clasikman/summary",
                        "https://gov.gitcoin.co/u/kyle",
                        "https://gov.gitcoin.co/u/ceresstation",
                        "https://gov.gitcoin.co/u/irlart",
                        "https://gov.gitcoin.co/t/calling-all-gitcoindao-metaverse-coordinators/8902/13",
                        "https://gov.gitcoin.co/t/gitcoin-treasury-diversification/9698",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/15",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xa4dd8527231eeb912929e0874b689144565fc6d2cbc0faed7cc694622e07eb6b",
                        "https://gov.gitcoin.co/t/introducing-the-steward-forum/9485",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/14",
                        "https://gov.gitcoin.co/t/proposal-2-17-eth-denver-event/9419",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/13",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://gov.gitcoin.co/u/annika",
                        "https://gov.gitcoin.co/t/discussion-community-input-on-gr13-structure/9735",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://www.ethdenver.com/",
                        "https://gov.gitcoin.co/t/regen-cryptoeconomics-book-governance/9713",
                        "https://www.youtube.com/playlist?list=PLVupIN3GgLthT8vSZjY9U6nHrtDigmf2w",
                        "https://gitcoin.notion.site/Decentralize-Gitcoin-cd6d46d3784244e4ae7a68b108bb9495",
                        "https://gov.gitcoin.co/t/dgrants-gr12-round-payout-data-verification/9752",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-2-2022/9739",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://gitcoin.co/issue/mmmgtc/bounties/1/100027489",
                        "https://gitcoin.co/issue/mmmgtc/bounties/2/100027492",
                        "https://gitcoin.co/issue/mmmgtc/bounties/3/100027521",
                        "https://gitcoin.co/issue/mmmgtc/bounties/4/100027528",
                        "https://gitcoin.co/hackathon/schellingpoint/onboard",
                        "https://gov.gitcoin.co/t/2022-roadmap-2022-goals/9613/13",
                        "https://gov.gitcoin.co/u/seanmac",
                        "https://discord.com/channels/562828676480237578/890336705998127165/933827677041860628",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-2-2022/9739",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-4-2022/9816"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.986652470905717
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-7-2022/9996",
            "title": "GitcoinDAO Digest Edition #7 2022 ",
            "index": 9996,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "1",
                    "time": "03/03/2022-01:25:15",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!    Key actions for this week as we approach GR13, starting on March 9th:  If you’re a builder: sign up for the hackathon  If you’re a grantee; don’t forget to update your grant and consider applying for the ecosystem rounds  If you’re looking to contribute to your favorite projects in the space; level up your trust bonus and increase your impact by up to 150%      Meta-Governance    The Gitcoin Foundation - A proposal to represent the Gitcoin DAO IRL by a Cayman Islands Foundation by Kyle outlines a proposal to create the Gitcoin Foundation and calls for the community to “execute a transfer of ownership of various Gitcoin Holdings assets to the Gitcoin Foundation.”   Gitcoin Grants 2.0 by Kevin and Lindsey presents Grants 2.0 as “the accumulation of all that we’ve learned since launching Gitcoin Grants in January 2019 + evolving it for the last 3 years.” “Grants 2.0 will be forkable, modular, and decentralized.”   Thin workstreams lead to better outcomes by Kyle is a discussion around the hypothesis that “Multi-sub-workstream structure is actually bad for governance, outcomes and accountability across the DAO as a whole.”   Securing a GTC Token Reactor by Willy introduces the concept of Tokemak’s token reactors and discusses the “merit of campaigning for a GTC Reactor in the next election.”   Dan provided an update on the Treasury Diversification Working Group. If you’d like to recommend a strategic partner, please leave a comment on the second forum post or contact a member of the working group.   Owocki gave an update in the thread on ImpactDAO Cartographers Wanted - the plan is to publish the “ImpactDAO” Map v0.1.0 book for Devconnect in Amsterdam 4/22 to sell alongside the Greenpill book.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     The Gitcoin Foundation - A proposal to represent the Gitcoin DAO IRL by a Cayman Islands Foundation  GR13 Matching Pool Allocations   Gitcoin Matching Pool Allocations      ImpactDAO Cartographers Wanted.     Treasury Diversification Part II - Welcoming Strategic Partners     Introducing the Steward Council        Workstream Discussion    Public Goods Funding    As we approach GR13, we’re implementing quadratic funding to ensure that funds are matched to real contributors. Find out how you can increase your trust bonus and make a bigger impact with your funds.   Tracking for Grants and Bounties have been set up to identify overlap between the two products.     Moonshot Collective    Green Pill Podcast Episode 2 with special guest Karl Floersch is live on Spotify, Apple, and wherever you like to listen to podcasts.   Want to reward event or meeting participants all at once with tokens? Send them a tip at tip.party. Tip Party debuted at ETH Denver, and is now live for anyone to use. Reach out to Moonshot Collective devs on Telegram if you’d like to bring Tip Party to your workstream or DAO.     Fraud Detection & Defense (FDD)    This week began a series of workshops to teach 3 DAO contributors to run the Anti-Sybil Operational Process so the DAO can take over work previously done by Blockscience.   An app was built for human evaluations of Sybil accounts allowing us to better protect the process from vulnerabilities and allow us to improve on inter-reviewer reliability.   The Grant Review Team is going to the backup plan of scaling grants reviews as the Gitcoin Holdings team needs more time to assess legal implications of integrating data to our GIA software built for this purpose.     Merch, Memes & Marketing    Memepalooza 6 is happening this Friday. For the first time, we will be partnering with another DAO to host the event, this time welcoming our friends at DeveloperDAO to meme about all things web3 and public goods. We are also continuing our artist spotlight series, featuring MMM Contributor Nanopunk’s artwork and giving away some NFTs during the event.   Check out our blog post on the collaboration with Tally, utilizing Gitcoin Aqueduct to automate the funding of public goods and the building of Tally’s community-owned ecosystem.   Gitcoin GR13 is just around the corner, a new Grants Verification Score has been implemented to help eliminate bad actors and ensure that funding is more proportionately matched to trusted contributors. Learn more in our blog post.     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET on Discord! We have been seeing great attendance and engagement and we would love for you to join us. Afterwards there is the Gitcoin Contributors Happy-Hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? Every other Monday we’ll tell you all about how we’re organized and how you can become an active contributor. The next one is Monday, March 14, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://gitcoin.co/hackathon/gr13/onboard",
                        "https://gitcoin.co/grants/",
                        "https://twitter.com/gitcoin/status/1499161494881140736?s=20&t=7B_dEmikIMj4j8ou_NqBNQ",
                        "https://twitter.com/GitcoinDAO/status/1499161595062075392?s=20&t=O0nQ7I9X9RbLwzGSgb6seA",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/t/proposal-the-gitcoin-foundation-a-proposal-to-represent-the-gitcoin-dao-irl-by-a-cayman-islands-foundation/9983",
                        "https://gov.gitcoin.co/u/kyle/summary",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/u/kevin.olsen",
                        "https://gov.gitcoin.co/u/lthrift/summary",
                        "https://gov.gitcoin.co/t/discussion-a-hypothesis-thin-workstreams-lead-to-better-outcomes/9975",
                        "https://gov.gitcoin.co/u/kyle",
                        "https://gov.gitcoin.co/t/discussion-securing-a-gtc-token-reactor/9976",
                        "https://gov.gitcoin.co/u/Willy",
                        "https://gov.gitcoin.co/u/schlabach",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-update-2-26-2022/9962",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/impactdao-cartographers-wanted/9866/6",
                        "https://gov.gitcoin.co/t/impactdao-cartographers-wanted/9866/",
                        "https://devconnect.org/",
                        "http://greenpill.party/",
                        "https://gov.gitcoin.co/t/proposal-the-gitcoin-foundation-a-proposal-to-represent-the-gitcoin-dao-irl-by-a-cayman-islands-foundation/9983",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xa7f5df0710cba3a190df10a054ce3b4e7225bcfd65b918d86a8b0bef1976b8d8",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-gr13-matching-pool-allocations/9915/",
                        "https://gov.gitcoin.co/t/impactdao-cartographers-wanted/9866/",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/t/introducing-the-steward-forum/9485",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://gitcoin.co/blog/trust-bonus",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://twitter.com/karl_dot_tech",
                        "https://open.spotify.com/show/0l6aXWC94dd0RA3tkKfxjd",
                        "https://podcasts.apple.com/us/podcast/2-ethers-phoenix-with-optimisms-karl-floersch/id1609313639?i=1000552104369",
                        "https://tip.party/",
                        "https://t.me/joinchat/BHPBtqODJGo0NDdh",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://www.addevent.com/event/zU12305380",
                        "https://opensea.io/NanoPunk",
                        "https://gitcoin.co/blog/tally-wallet-plans-first-gitcoin-aqueduct/",
                        "https://twitter.com/gitcoin/status/1494467687161942016?s=20&t=bfCiuVZJpdkXceLGxmEHmg",
                        "https://gov.gitcoin.co/t/gitcoin-aqueduct/9684",
                        "https://gitcoin.co/blog/trust-bonus",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-6-2022/9949",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-8-2022/10032"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.792590664052928
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/erich",
                    "index": "#2",
                    "likes": "1",
                    "time": "04/03/2022-21:29:47",
                    "content": "I’d like to add an invitation to everybody to participate in the discussions around grants matching caps via Polis: Polis ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-4-2022/9816",
            "title": "GitcoinDAO Digest Edition #4 2022 ",
            "index": 9816,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "1",
                    "time": "03/02/2022-07:02:12",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!    Key actions for this week:  Vote on the DAO Operations Workstream Budget proposal on Tally. If you’re going to Schelling Point, check out the latest updates by Ben!    Meta-Governance    Consent of the Governed (and Legitimacy by Process) in GitcoinDAO by Owocki articulates how “Legitimacy flows in GitcoinDAO - specifically ‘legitimacy by process’. eg if a process is legitimate, the outputs of that process gain legitimacy.”   Schelling Point Updates by Ben describes all of the latest updates and details including locations and Covid-safety rules. Join the Telegram group to coordinate with other attendees!   The response by Glen Weyl to Owocki’s “A Vision for A Pluralistic Civilizational Scale Infrastructure for funding Public Goods” thread sparked a rousing discussion on quadratic funding, with interesting points made by nollied and Ben.   Scaling Funding for Blockchain-era Public Goods by Owocki provides some context behind barriers to high throughput public goods funding. “Funding distribution mechanisms & funding sources are two sides of the same coin. They need to grow together, and not grow too far out of balance with one another.”     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     dCompass Season 13 budget request DAO Operations Workstream Budget - Q1 2022    Gitcoin Treasury Diversification     Introducing the Steward Council     2/17 ETH DENVER event        Workstream Discussion    Public Goods Funding   No updates for the week! Check back next week to find out more about what we’ve been up to.    Moonshot Collective   We’re in the middle of preparing for Schelling Point at ETHDenver. Our speakers are locked in and ready to go. Registration for Schelling Point is closed, but the greater conference is still open for new attendees to sign up until Friday, Feb 4.    Decentralize Gitcoin    Huxwell shared a Q4 2021 retrospective going over the last 3 months of hard work and accomplishment done by the dCompass team. The Season 13 budget request for dCompass was also posted on the forum, check it out and give some feedback!    Fraud Detection & Defense (FDD)    Check out the State of FDD Season 12 Review, a precursor to our Season 13 budget proposal which will be posted on Friday, Feb 4 according to the Workflow Accountability Flow. Danilo clarifies the use of certain KPIs to measure the performance of the FDD workstream, with notable discussion points given by Kyle, Pavel, and Joe.   We’ve conducted almost 15 hours of strategy meetings, aligning on the essential intent in each of our focus areas and the outcomes needed during the next 3 months to help us get there. You can think of these as “What would be true if FDD is successful over the next 90 days”.   Treasury management netted us $75k in gains. The stream will end up with $30k extra after using a portion of the gains to kickstart the FDD OS, increasing the number of human evaluations, and beginning work on a red team simulation software similar to cadCAD.  Model and simulate collective decision outcome variations Contributors can easily access data without compromising security      Merch, Memes & Marketing    The Gitcoin Primer is scheduled to go live later this week as a first touch point for new contributors joining our community. We’ve ramped up production of visuals and infographics to get integrated into the new onboarding process.   We’ve received some great writing & design submissions on our bounties listed in the Schelling Point Virtual event. There is still a week left to turn something in, so make sure to take a look!   Loie from the Gitcoin People Ops will be hosting ‘DAO Resolutionaries’ as a virtual roundtable event on Tuesday, Feb 8. MMM will be assisting with promotion and logistics. More details below.   Make sure to claim your very own GitcoinDAO Contributor 2021 POAP if you contributed to any of the Workstreams last year!     Upcoming community events    The very first Can Devs Do Something developer meet-up is happening Thursday, Feb 3 IRL at The Block in Lisbon. If you’re interested in joining please RSVP, or spread the word and share with your Lisbon frens!   DAO Resolutionaries, an event where DAO reps can meet trained conflict facilitators, is coming up this Tuesday February 8th at 3pm ET! ​​Quick lightning pitches will teach you about the facilitators’ different modalities, how they approach conflict in a decentralized way, and who is the best practitioner to suit your DAO. Join the livestream here.    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET on Discord! We have been seeing great attendance and engagement and we would love for you to join us. New this year is a Gitcoin Contributors Happy-Hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? Every other Monday we’ll tell you all about how we’re organized and how you can become an active contributor. The next one is Monday, February 14, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/16",
                        "https://gov.gitcoin.co/t/schelling-point-updates/9786",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/t/consent-of-the-governed-and-legitimacy-by-process-in-gitcoindao/9778",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/schelling-point-updates/9786",
                        "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                        "http://post.spmailtechnolo.com/f/a/cp-rwLzKvnUt9f6GCR5Zcg~~/AACuKQA~/RgRj1u0EP0QeaHR0cHM6Ly90Lm1lLytXWjNLbU9RNHVkX1UyTEVSVwNzcGNCCmHgBGj0YWW7xUlSDmJlbkBnaXRjb2luLmNvWAQAAAGY",
                        "https://gov.gitcoin.co/t/a-vision-for-a-pluralistic-civilizational-scale-infrastructure-for-funding-public-goods/9503/11",
                        "https://gov.gitcoin.co/u/GlenWeyl",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/a-vision-for-a-pluralistic-civilizational-scale-infrastructure-for-funding-public-goods/9503",
                        "https://gov.gitcoin.co/u/nollied/summary",
                        "https://gov.gitcoin.co/u/m0nkeyfl0wer/summary",
                        "https://gov.gitcoin.co/t/scaling-funding-for-blockchain-era-public-goods/9797",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/proposal-dcompass-season-13-budget-request/9794/1",
                        "https://www.withtally.com/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/16",
                        "https://gov.gitcoin.co/t/gitcoin-treasury-diversification/9698",
                        "https://gov.gitcoin.co/t/introducing-the-steward-forum/9485",
                        "https://gov.gitcoin.co/t/proposal-2-17-eth-denver-event/9419",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://schellingpoint.gitcoin.co/",
                        "https://www.ethdenver.com/",
                        "https://www.ethdenver.com/apply",
                        "https://gitcoin.notion.site/Decentralize-Gitcoin-cd6d46d3784244e4ae7a68b108bb9495",
                        "https://gov.gitcoin.co/u/Huxwell",
                        "https://gov.gitcoin.co/t/proposal-integrate-dcompass-within-dgitcoin-to-build-dquests-dknowledge/8836/19",
                        "https://gov.gitcoin.co/t/proposal-dcompass-season-13-budget-request/9794/1",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://gov.gitcoin.co/t/state-of-fdd-season-12-review/9774",
                        "https://gov.gitcoin.co/t/gitcoin-dao-workstream-accountability-flow/9644/",
                        "https://gov.gitcoin.co/u/danlessa",
                        "https://gov.gitcoin.co/t/state-of-fdd-season-12-review/9774/7",
                        "https://gov.gitcoin.co/u/Kweiss",
                        "https://gov.gitcoin.co/u/Pfed-prog",
                        "https://gov.gitcoin.co/u/DisruptionJoe",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://gitcoin.co/hackathon/schellingpoint/?org=mmmgtc",
                        "https://twitter.com/GitcoinDAO/status/1488578155636043777",
                        "https://discord.com/channels/562828676480237578/890336705998127165/933827677041860628",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://bit.ly/3o2KNjH",
                        "https://twitter.com/GitcoinDAO/status/1488578155636043777",
                        "https://t.co/ebEjZKHsbY",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-3-2022/9771",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.052047554966963
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326",
            "title": "GitcoinDAO Digest Edition #12 2022 ",
            "index": 10326,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#1",
                    "likes": "4",
                    "time": "07/04/2022-19:13:48",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!   Key actions for this week:  Vote on the proposal to Ratify Grants Round 13 results! The FDD Workstream is running a polis discussion about budget proposals in GitcoinDAO and would appreciate your participation.  Submit your unconference session proposal for Schelling Point @ EthAmsterdam by 4/10!  Owocki started an AMA that will run for the month of April! Jump in to ask any questions you have.    Meta-Governance:   [Proposal] Ratify the Results of Grants Round 13 and Formally Request the Community Multisig Holders to Payout Matching Allocations by Annika is a request for Stewards to ratify the results and payouts for Grants Round 13. “Over $4.6M will be distributed to public goods as part of the round, of which $3.2M came from the combined matching pools and $1.4M was contributed by the community.” Expected payouts are going to be sent on April 15th.   Huxwell provides an update on dCompass which shows how adventurers can complete quizzes to receive rewards and quest creators can configure how the rewards are delivered. A staging app on testnet to test the first quests is set to go live this week.   Owocki shares Lessons about Impact Networks from the book “Impact Networks” by D Ehrlihman. Impact Networks are “like DAOs but without tokens” and “[relationships] between network participants is the core basis of trust that allows for antifragility of the network.”   Get a special sneak preview of the Future History of the Open Internet Book, and The ImpactDAO Poster/Book from Owocki! You can also see the physical copies (and maybe grab one) at Schelling Point Amsterdam.   In Hype Cycles - a tool for sensemaking, Owocki drills down into five phases of emerging technology lifecycles: Innovation Trigger, Peak of Inflated Expectations, Trough of Disillusionment, Slope of Enlightenment, & Plateau of Productivity.   In The Plateau of Productivity , Owocki continues the discussion about Garner Hype Cycles by contextualizing them using the history of Gitcoin Grants. In 2022, with a DAO standing up and Grants 2.0 on its way, “we are further along in the trough of disillusionment, but the plateau of productivity is perhaps in sight.”   Simona Pop shares a timeline for workstreams to share their Season 14 Budgets. Workstream leads are expected to share their budget request on the forum by April 28th.   The treasury diversification working group let us know that they had calls with potential lead partners and welcomes you to send your recommendations for strategic partners.   In An Evolutionary Lens on Web3/Open Source Software , Owocki discusses the key properties that allowed Linux to evolve and how Web3 can learn from this. This thread highlights how Web3 technology has already had a spectacular evolution, partly because it adds global coordination and incentivisation layers to what makes OSS work.     GitcoinDAO Governance Overview:     Proposal Discussions Active Proposals Latest completed proposals     Ratify the Results of Grants Round 13 and Formally Request the Community Multisig Holders to Payout Matching Allocations Ratify the Results of Grants Round 13 and Formally Request the Community Multisig to Payout Matching Allocations    Partnership & Mutual Grant with Wonder     Proof Of Impact      Data Science @ Gitcoin DAO     Treasury Diversification Part II - Welcoming Strategic Partners        Workstream Discussion    Public Goods Funding    Every Wednesday, the Public Goods Library hosts a philosophical discussion in the Gitcoin Discord server, with topics ranging from DAOs, community, governance, and everything in between that ties back to web3 and public goods. Check out one of our past calls on Micropayments and Calm Design by Amber Case! (start video at 3:10)   We are aiming to ratify the results of grants round 13 and invite our stewards to comment!   The Grants team is actively working on a framework for mutual grants (swaps) to help ensure we are acting as effective metagovernance stewards.   We are currently working hard on the workstream budget and optimizing our ops!     Moonshot Collective    Green Pill Podcast Episode 7 hosted by Kevin Owocki is live! This episode features Glen Weyl, founder of RadicalxChange and one of the pioneers of Quadratic Voting. They discuss the future of Quadratic Funding and using the power of markets for the good of society.   Every month Moonshot Collective Devs demo their projects for the community. April demos happened on Monday the 4th. If you missed it, you can watch them on YouTube.   Moonshot Collective prototypes decentralized tools for DAOs. Are you interested in demoing Tip Party or Pay Party for your DAO, Workstream, or Team? Send us a DM on Twitter!     Fraud Detection & Defense (FDD)    Joe delivers the GR13 Governance Brief which outlines the FDD workstreams efforts to improve Sybil Defense, Grants Review, and Data Access. Sybil Defense makes use of Humans-In-The-Loop (HITL) machine-learning and in round 13 delivered a 100% increase in the number of human evaluations with a 300% decrease in cost. Grants Reviews were conducted by the new Grants Intelligence Agency (GIA) which had to use a “plan B” system in lieu of the data access they needed to use a newly developed tool. The GIA also conducted a review of Grants Eligibility Policy following the BrightID case.   We are working on an analysis of “airdrop farming” a type of collusion behavior we found certain grants and users to be propagating during round 13.     Merch, Memes & Marketing    Sean published a thread on Contributor tiers & MMM trusted contributor experiment to start a conversation around a basic income for trusted MMM contributors. This basic income is intended to increase contributor retention and pay for their ability to stay up to date with all communication channels.   We hosted an epic Memepalooza last Friday in Discord! Together with our frens at 1Hive and KlimaDAO we had over 150 attendees performing meme magic. Catch up on all the great memes at the schelling point for memes; memes.party.     DAO Operations    We are hiring! We need a Hiring Manager, and Support Lead.   We are holding a retreat this week for the leadership team to engage in focused discussions   We are evaluating improved tooling for the DAO including Sobol, Google Calendar, and Google Groups.   We are also looking at improving our forum experience     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET on Discord! We have been seeing great attendance and engagement and we would love for you to join us. Afterwards there is the Gitcoin Contributors Happy-Hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? The next event will be Monday, April 11th from 1:00 to 2:00 PM EST. We’ll tell you all about how we’re organized and how you can become an active contributor. If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xe0c6d911e8c06e8ed28071ebfe84d8dfa90c1381dbfc0f3a6ccdb96ec3147de6",
                        "https://pol.is/5arjtwwtpz",
                        "https://gitcoin.typeform.com/to/jEupXMPJ?typeform-source=t.co",
                        "https://schellingpoint.gitcoin.co/",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/ama-april-2022/10273",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-13-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/10278",
                        "https://gov.gitcoin.co/u/annika/summary",
                        "https://twitter.com/gitcoin/status/1507179207427829760?s=20&t=pz6xcWSfNc7osFjsHZEXCw",
                        "https://gov.gitcoin.co/u/huxwell/summary",
                        "https://gov.gitcoin.co/t/proposal-dcompass-season-13-budget-request/9794/15",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/lessons-about-impact-networks/10305",
                        "https://www.amazon.com/Impact-Networks-Connection-Collaboration-Catalyze/dp/1523091681/ref=sr_1_1?keywords=impact+networks&qid=1649089245&sprefix=impact+ne%2Caps%2C108&sr=8-1",
                        "https://gov.gitcoin.co/t/future-history-of-the-open-internet-book/10324",
                        "https://gov.gitcoin.co/t/the-impactdao-poster-book-is-here/10323",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://schellingpoint.gitcoin.co/",
                        "https://gov.gitcoin.co/t/hype-cycles-a-tool-for-sensemaking/10267/2",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/the-plateau-of-productivity/10269",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/hype-cycles-a-tool-for-sensemaking/10267/",
                        "https://gov.gitcoin.co/u/pop/summary",
                        "https://gov.gitcoin.co/t/season-13-2-1-4-30-aligning-the-workstream-budgets-to-make-life-easier-for-the-stewards/9738/8",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-updates-thread/10231/4",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/t/an-evolutionary-lens-on-web3-open-source-software/10293",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-13-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/10278",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xe0c6d911e8c06e8ed28071ebfe84d8dfa90c1381dbfc0f3a6ccdb96ec3147de6",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-wonder/10170",
                        "https://gov.gitcoin.co/t/proof-of-impact-proposals-wanted/10179",
                        "https://gov.gitcoin.co/t/data-science-gitcoindao/10088",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://youtu.be/3YPpEwjbj9I",
                        "https://www.caseorganic.com/",
                        "https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-13-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/10278",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://availableon.com/greenpill",
                        "https://twitter.com/owocki",
                        "https://twitter.com/glenweyl",
                        "https://twitter.com/RadxChange",
                        "https://www.youtube.com/channel/UCfbOba7iD19HyrB9QbV6Uww",
                        "https://tip.party/",
                        "https://app.pay.party/",
                        "https://twitter.com/MoonshotCollect",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://gov.gitcoin.co/u/disruptionjoe/summary",
                        "https://gov.gitcoin.co/t/gr13-governance-brief/10289",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://gov.gitcoin.co/u/seanmac/summary",
                        "https://gov.gitcoin.co/t/contributor-tiers-mmm-trusted-contributor-experiment/10296",
                        "http://memes.party/",
                        "https://gitcoin.notion.site/DAO-Ops-84f425e281ae49579a2b4acf0bad5dd5",
                        "https://twitter.com/GitcoinDAO/status/1509185588599083014?s=20&t=Xs18hYXcltlTH658zdlzLA",
                        "https://twitter.com/GitcoinDAO/status/1511043414317584384?s=20&t=Xs18hYXcltlTH658zdlzLA",
                        "https://sobol.io/",
                        "https://gov.gitcoin.co/t/gitcoin-forum-improvement-project/10314",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com/",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-11-2022/10277/3",
                        "https://gov.gitcoin.co/t/poap-edition-gitcoindao-digest-13-2022/10363"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.481404301716801
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#2",
                    "likes": "2",
                    "time": "07/04/2022-23:00:04",
                    "content": "@GitcoinDAO contributor list https://twitter.com/i/lists/1512065573026697218 Could we add this list in next edition? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/04/2022-18:58:43",
                    "content": "Definitely we can! Thanks for the note ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/vogue20033",
                    "index": "#4",
                    "likes": "2",
                    "time": "08/04/2022-19:12:32",
                    "content": "I always look forward to reading the newsletter.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "7"
}