{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/forum-guidelines-and-code-of-conduct-2023/12479",
            "title": "Forum Guidelines and Code of Conduct 2023 ",
            "index": 12479,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "stewards",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/puncar",
                    "index": "#1",
                    "likes": "14",
                    "time": "03/01/2023-14:18:08",
                    "content": " Rules of Engagement   → 1. In the interest of fostering an open and welcoming environment, we ask that you be respectful of each other’s thoughts and opinions. We will not tolerate any insults, racism, harassment, or threats of violence against members, even as a joke. → 2. This is a community space free from advertising. Do not post unsolicited referral links or discord invitations unless specifically asked for by another user. → 3. Do not post any NSFW content, and limit the use of offensive language across all channels and nicknames. → 4. Never share API or secret keys, whether they are free or worthless. Those are for your use and your use only. → 5. No user should ever ask you to send them money, especially not members of the moderation team. Please contact any available @admins immediately if that happens to you. → 6. It is an offense to impersonate members of the moderation team. Anyone caught doing this will be instantly banned and reported. → 7. As this is a free platform we cannot guarantee that the text communications in this server aren’t recorded and monitored by law enforcement. Please be conscious of this by refraining from discussing anything illegal, including tax evasion and market manipulation. → 8. As you can see, this forum is organized by topics; please keep the discussion in their respective threads or one of the moderators will assign it to the proper one for you; we want to keep the discussion organized and clean, so please keep things relevant and help us encourage productive, focused discussion. The full code of conduct can be found on our website here: Code of Conduct - Gitcoin support Welcome to Gitcoin  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.572916666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/puncar",
                    "index": "#2",
                    "likes": "0",
                    "time": "03/01/2023-14:18:15",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/puncar",
                    "index": "#4",
                    "likes": "0",
                    "time": "03/01/2023-14:22:32",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "275"
}