{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/workstream-suggestion-defi-treasury-management/204",
            "title": "Workstream Suggestion: DeFi Treasury Management ",
            "index": 204,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/androolloyd",
                    "index": "#1",
                    "likes": "16",
                    "time": "21/05/2021-23:05:32",
                    "content": "Hey Gitcoiners, I suggest that we put together a Workstream around how to effectively manage the Gitcoin treasury. Using DeFi protocols we can extend the treasury’s capital and maximize the impact of public goods funding. We have some heavy hitters of the DeFi space who have stood up to be Stewards so I am confident we can put together a good strategy to effectively tackle this. This also happens to co-inside with some work we are doing at PleasrDAO. I think having a strategy in effect in time for next Grants round’s completion would be prudent. Catch you in the Metaverse. ",
                    "links": [
                        "https://gov.gitcoin.co/t/ama-with-me-kevin-owocki/45/8"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Yalor",
                    "index": "#3",
                    "likes": "3",
                    "time": "23/05/2021-00:27:56",
                    "content": "That is a great idea, there is actually an existing group consisting of Hudson Jameson, Anthony Sassano, David Hoffman and some others. They currently manage the Gitcoin Community treasury, so I wonder if we could expand that group a little bit via this workstream ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.765625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ajbeal",
                    "index": "#4",
                    "likes": "9",
                    "time": "26/05/2021-23:56:25",
                    "content": "Hey Gitcoiners! Below is a draft Treasury Management Proposal for the Grants Multi-sig, authored by @HelloShreyas, @ajbeal, and @AcceleratedCapital from Llama, which provides treasury management as a service to DAOs. Treasury Management Approach There are a variety of approaches to treasury management based on the goals and demands of the organization. The primary levers available to us are the assets and the allocation. We can distinguish different crypto assets based on market cap, liquidity, months since launch, volatility, return potential, and other factors. For purposes of this exercise, we have divided assets into three tranches:  Screen Shot 2021-05-26 at 5.40.15 PM706×496 30.1 KB  Because funds in the Grants Matching Pool are needed for quarterly grant distributions, we are inclined to take a slightly more conservative approach. Below is the suggested allocation: Low Risk (40%) - Allocated to stablecoins and interest bearing equivalents.  An amount of these assets equal to at least the dollar amount of the last quarter of grants will sit idle in the Grants multi-sig and be available for immediate use. The remainder will be put to work across several lending and AMM platforms to earn passive yield. [We estimate 7-12% APY on these assets for the foreseeable future.]  Medium Risk (50%) - Allocated to large cap cryptocurrencies and DeFi tokens.  This tranche will be held long, and may be put to work across several lending and AMM platforms. To the extent the asset can be staked for yield such as in the case of ETH2, we will commit 100% of the asset to staking, taking into consideration any lock up periods. There is a preference for a derivative asset that enjoys the staking yields without being subject to the lock up (ex: stETH on Lido), if available. Assets in this tranche may be used in conjunction with assets from the Low Risk tranche for yield generation purposes. Example - contributing an equal amount of WETH and USDC to the WETH/USDC liquidity pool on Uniswap.  High Risk (10%) - Allocated to smaller cap tokens  This tranche will be held long, and may be put to work across several lending and AMM platforms. To the extent the asset can be staked for yield such as in the case of ETH2, we will commit 100% of the asset to staking, taking into consideration any lock up periods. There is a preference for a derivative asset that enjoys the staking yields without being subject to the lock up if available. Assets in this tranche may be used in conjunction with assets from the Low Risk tranche for yield generation purposes. Ex: contributing an equal amount of [small cap token] and USDC to the relevant liquidity pool on Uniswap.  Implementation of Treasury Management Llama will work with Gitcoin on an ideal way to implement the strategic asset allocation that involves the community and allows for effective decision making. We will screen assets based on various criteria including market cap, liquidity, months since launch, volatility, return potential, and other factors. The Gitcoin community will approve broad guardrails: tokens, strategic allocation, and rebalancing frequency. We will help implement rebalancing within those guardrails. This should be done on-chain, transparently, and potentially programmatically via Set Protocol. We will also review the strategic asset allocation periodically and make proposals to the Gitcoin community for feedback. We would love to hear any feedback and questions! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.528556547619048
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#5",
                    "likes": "0",
                    "time": "30/05/2021-14:37:34",
                    "content": "This is awesome! Are there turn key solutions to helping us balance in this way? One problem with multisigs is that it’s often hard to coordinate the signatures required to send funds within the time window needed. I wonder if an index of sorts (like $DPI) could be created to manage and balance this? Does something like that exist? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.180555555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/e-gons",
                    "index": "#6",
                    "likes": "2",
                    "time": "30/05/2021-16:23:42",
                    "content": "Thank you for putting together such a thoughtful proposal. I would add a few points for your consideration:  Is the 60/40 mix between stocks (medium + high risk cryptoassets) and bonds (stablecoin yield farming) the optimal asset allocation for the treasury? The issue with the 60/40 portfolio is a de minimus benefit from diversification due to the 60%-90% correlation between the assets in each bucket. Another asset allocation mix to consider is something akin to a leading endowment, such as Yale, who will include lower correlation asset classes such as real estate, leveraged equities, and venture capital. The GTC treasury could re-create some of these asset classes via synths that track stock market ETFs for things like real estate, commodities, etc.  Security Selection I suggest we utilize indices (e.g. DPI) where possible, as it is unlikely that we will increase the returns of the portfolio through superior security selection (e.g. picking UNI over SUSHI, etc.). We can create our own indicies through the Set protocol, but this has its issues as well (see below).  Ethereum Tail Risk Exposure By investing 100% of the treasury in Ethereum denominated assets, it leaves the treasury open to systemic risk and the unknown unknowns. To make the treasury more anti-fragile, it is worth considering diversifying the portfolio (e.g. BTC not WBTC).  Implementation with Set I like the simplicity, transparency and automation that the Set Protocol brings to the table, but I worry about the ETH tail risk exposure mentioned above. The ETH network can get very congested during market volatility and de-leveraging events, which create forced sellers. These are exactly the events when you need to be active, and being 100% reliant on ETH’s network makes that difficult at the moment.  Automation Should we consider using some of Yearn’s infrastructure (e.g. Vaults, multi-sig management, transaction automation) to help manage the 40% fixed income allocation? It is battle-tested and has an ardent community supporting it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.400333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/androolloyd",
                    "index": "#7",
                    "likes": "3",
                    "time": "30/05/2021-20:24:38",
                    "content": "I will say that I believe a large focus of the treasury mgmt should be coordinated around ‘no loss’ protocols so that we may function more like an endowment than a fund. This isn’t to say I am against holding large cap currencies(as long as its not bitcoin), I just believe there is more value to be captured through incentivized community participation in the creation of our capital engine. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.378571428571429
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/e-gons",
                    "index": "#8",
                    "likes": "1",
                    "time": "31/05/2021-16:24:10",
                    "content": "You make an excellent point. The goal of the fund should be first and foremost to protect purchasing power such that the treasury can support the current and future needs of the DAO. I suggest we decide on maximum acceptable volatility for the treasury’s portfolio and work backward from there into an asset allocation strategy. The asset allocation decision will have the biggest impact on the treasury’s overall performance, so it is worthy of our deep and careful consideration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8240740740740735
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/haywyer",
                    "index": "#9",
                    "likes": "0",
                    "time": "01/06/2021-22:14:19",
                    "content": "I wonder to what extent stablecoins are truly stable if they are pegged to a fiat currency. Is there perhaps a coin that is pegged to inflation? A diverse portfolio would also have a number of assets with negative correlation with general crypto markets… perhaps some kind of volatility products or physical asset-backed tokens could be beneficial? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/androolloyd",
                    "index": "#10",
                    "likes": "1",
                    "time": "01/06/2021-22:25:55",
                    "content": "RAI is not pegged to fiat. It i s a free floating asset powered by a PID controller. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/haywyer",
                    "index": "#11",
                    "likes": "0",
                    "time": "02/06/2021-00:38:00",
                    "content": "RAI definitely sounds interesting. thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#12",
                    "likes": "1",
                    "time": "02/06/2021-13:38:34",
                    "content": "love this idea, I am definitely interested in this workstream. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wyx",
                    "index": "#13",
                    "likes": "0",
                    "time": "09/06/2021-00:16:49",
                    "content": "As with any asset management service, they will take a few basis points off for management fees. How much is this fee and will Llama be the custodian of the funds? Also, 7-12% APY seems generous, might have to revise that downwards as more money gets parked into the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ajbeal",
                    "index": "#14",
                    "likes": "1",
                    "time": "09/06/2021-02:26:52",
                    "content": "Yes, we will try to automate the allocation and any rebalancing as much as possible. Protocols to accomplish this include Set, Index Coop and potentially UMA. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ajbeal",
                    "index": "#15",
                    "likes": "2",
                    "time": "09/06/2021-02:37:00",
                    "content": "Great questions.   Llama will NOT take custody of treasury funds.   We do anticipate fees to be a small percentage of the treasury. The specific amount is still being considered.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ajbeal",
                    "index": "#16",
                    "likes": "4",
                    "time": "09/06/2021-02:41:49",
                    "content": "These are all worthwhile considerations.  Agree that to the extent possible, finding uncorrelated assets is ideal. We agree that indices are easier to manage and will look to leverage them where possible. We can certainly consider using Yearn’s infrastructure.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.614285714285715
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/meknab",
                    "index": "#17",
                    "likes": "0",
                    "time": "30/06/2021-01:30:35",
                    "content": "I know I am late to this thread but I agree with this approach ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/zyks678",
                    "index": "#18",
                    "likes": "0",
                    "time": "01/07/2021-01:30:07",
                    "content": "A great idea, let’s discuss it and implement it as soon as possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                }
            ]
        }
    ],
    "group_index": "358"
}