{
    "poll_list": [
        {
            "id": "0xbe39c3414e4622a2522dc4d6e9030deb56fa8b90304dae05cd1a2a6d50cb5537",
            "title": "Public Goods Funding WS Budget Request for S14",
            "discussion": "https://gov.gitcoin.co/t/s14-proposal-public-goods-funding-budget-request/10443",
            "body": "\nThis vote is looking to pass the S14 budget for the Public Goods Funding Workstream (PGFW).\n\nThe top level KPI of the PGF is to help increase the interest in and funding for public goods within web3, principally by leveraging quadratic funding and other related mechanisms (e.g. retroPGF 1).\n\nThe total amount requested is 185.5k GTC over these 3 key areas:\n\nGrassroots Community Efforts (35k GTC)\nGitcoin Grants Operations (45k GTC)\nCommunity Partnerships (72.5k GTC)\n60 days reserves (95k GTC) - current reserves (62k GTC)\n\nFor more details please see this post: https://gov.gitcoin.co/t/s14-proposal-public-goods-funding-budget-request/10443\n\n* A denomination in dollar amount will be prioritized in budget proposals over GTC - so if the spot price assumed at posting of a budget changes between then and when the budget executes, the GTC amount will be readjusted to reflect the dollar amount at the time this proposal is moved to Tally or the 20 day moving average (whichever is lower) is moved to Tally. \nG",
            "choices": [
                "Yes",
                "No",
                "Abstain"
            ],
            "scores": [
                7166184.220744676,
                2712710.6627714173,
                1656744.9087524074
            ],
            "start": 1652290019,
            "end": 1652720400,
            "snapshot": "14756159",
            "state": "closed",
            "author": "0x0CF30daf2Fb962Ed1d5D19C97F5f6651F3b691c1",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "❗️ [canceled] Gitcoin PGF workstream S14 funding r…",
            "date": "Proposed on: May 18th, 2022",
            "yes_votes": "2",
            "no_votes": "0"
        },
        {
            "title": "Gitcoin PGF workstream S14 funding request ratific…",
            "date": "Proposed on: May 19th, 2022",
            "yes_votes": "6.48M",
            "no_votes": "2.6M"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/s14-proposal-amended-public-goods-funding-budget-request/10443",
            "title": "[S14 Proposal - AMENDED] Public Goods Funding budget request ",
            "index": 10443,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#1",
                    "likes": "12",
                    "time": "28/04/2022-19:15:48",
                    "content": " Abstract Proposers: @annika @ceresstation @Fishbiscuit @vgk The goal of the public goods funding workstream is to help increase the interest in and funding for public goods within web3, principally by leveraging quadratic funding and other related mechanisms (e.g. retroPGF). Over the course of Season 13, we made significant progress towards this goal, and we are requesting 198K 185.5K GTC as budget for Season 14 to continue scaling our efforts. S14 Budget Request (in GTC) - AMENDED Season 14 budget = 152,500 60 days’ reserves1 = +95,000 Current reserves2 = -62,000 Total Amount requested = 185,500 [1] Adding 60 days’ reserves to budget requests is a new standard that was first proposed and ratified at CSDO on 2022-04-19. [2] Current reserves is the PGF Gnosis Safe balance as at time of posting, rounded to the nearest thousand. The reserves total will be adjusted based on the value at the time this proposal is moved to Snapshot and Tally. [3] A denomination in dollar amount will be prioritized in budget proposals over GTC - so if the spot price assumed at posting of a budget changes between then and when the budget executes, the GTC amount will be readjusted to reflect the dollar amount at the time this proposal is moved to Tally or the 20 day moving average (whichever is lower) is moved to Tally. Current Multisig: PGF Multisig: Gnosis Safe Full Budget Breakdown: PGF Budget S14 2022 Final - Google Sheets     Budget Category Description & Assumptions Amt USD Amt GTC     Public Library Hold a space to inspire people interested in working on Public Goods $90,000 15,000   PG PR Create accessible dialogue for people new to Public Goods $30,000 5,000   Publication Nurture ideas and grow awareness on Public Goods $60,000 10,000   ImpactDAO Community cartography of the ImpactDAO landscape $30,000 5,000   Grants Ops Ensures sustainable operations for Gitcoin Grants $270,000 45,000   Fundraising Contributors Source and close long term pools of capital for grantees $247,530 41,255   Comic Experiment with fundraising around collectively-owned art IP $45,000 7,500   Auction Create collectively-owned art IP $45,000 7,500   Strategic Partnerships Work with new and existing mission-aligned orgs by creating a Mutual Grants Committee $108,000 18,000   Travel/Events Get our core contributors to important events to work connect with future partners $34,470 5,745    The initial workstream proposal was successfully passed on 7th August 2021 through a snapshot vote, and allocated 45k GTC to instantiate the Public Goods Funding workstream (PGF). On January 4th, 2022 a further vote was passed for 100k GTC as we continued to scale the workstream and achieve PGF objectives within three key areas:  Grassroots Community Efforts Gitcoin Grants Operations Strategic Partnerships  This has also allowed us to focus our KPIs around increasing the GMV of Gitcoin Grants and related public goods funding mechanisms, both by scaling the right people into grants ops related roles, and by forming relevant strategic partnerships to further solidify Gitcoin as a credibly neutral public goods funding mechanism.  Our Journey So Far (S13) The following aims to summarize what the PGF workstream has achieved since our last budget while spending ~50k GTC of the Q1 budget (50% of budget requested). We hope this progress will help showcase that we’re ready to scale the workstream and improve the efficiency of the grant funding flywheel. In turn, we hope this helps us continue to be one of the most important impact DAOs in the Ethereum ecosystem and beyond.  Grassroots Community Efforts Leads: @Fishbiscuit @Maxwell  Onboarded and oriented more amazing contributors across multiple workstreams via library discussions (e.g. Ale Borda, Ben Percifield, Colton Orr, Gary Sheng, Jason Cook, Jim Chang, Maxwell Kanter, Michelle Ma, Sarah Drinkwater, Madison Adams, and many others) Continued exploring further partnerships with KERNEL to help onboard new entrants to the space into their first DAO Created a Public Goods Starter Pack to introduce the concept of public goods with different levels of complexity so that anyone can start engaging in deeper conversations on public goods Ran a session and wrote a thought piece with Crypto, Culture, & Society on the solarpunk movement, leading to opportunities with multiple university publications (e.g. Harvard Tech Review) Held sessions with speakers such as Amber Case (micropayments and calm design), Ale Borda (public goods ecosystem synergies), Bhaumik (designing inspiring learning communities), and more Continued holding our Twitter Space, Public Goods are Good. Our guests included Tina He, Jasmine Wang, Cyn Bahati, Lauren Luz, Eva Beylin. We also ran multiple events to support ecosystem and cause rounds in GR13.   Gitcoin Grants Operations Leads: @annika @J9leger  Successfully executed on GR13 with $4.6M in GMV (30% above the 3 round moving average) in collaboration with MMM for marketing and FDD for grant reviews Executed nine ecosystem rounds for ZK Tech, Open Gaming, Polygon, ENS, Algorand, OlympusDAO, NFTs, Uniswap, & Radicle and three cause rounds for Climate solutions, Longevity, and Support for Ukraine Built an Ecosystem Round run book to be able to run rounds in a more repeatable way Partnered with the product team in defining early requirements for Grants 2.0 Onboarded two new full-time contributors to the Grants Operations team   Strategic Partnerships Leads: @vgk @azeem  Increased grants matching funds raised to $3.2M in GMV (67% of total funds) across multiple types of rounds (main, cause, ecosystem) in GR13 Brought in a number of long term recurring ecosystem funders including a [9 figure announcement](* Closed the first 3 Gitcoin Aqueducts to enable recurring public goods funding for ecosystems) by Fantom Closed the first 3 Gitcoin Aqueducts to enable recurring public goods funding for ecosystems Began formalizing and scaling types of partnerships including general donations, NFT sales, and mutual grants Brought in a number of new strategic partners:   Crypto, Culture, and Society (a learning DAO studying the impact of crypto on culture and society) are running through Season Two! Gitcoin will be playing a key role in helping build a liberal arts education for crypto  DeveloperDAO (a place for new devs in web3 to get started) is bringing tons of amazing coders into the space to help us build new types of public goods  DreamDAO (a regen guild bringing gen z builders into web3) is continuing to help push forward the solarpunk + regen narrative to show the optimistic futures we can create together  Kudos (a soulbound NFT reputation protocol) has been quickly building a following and use-case for their tooling  Verses (a collective of writers, researchers, technologists) who have some of the best writing in the ecosystem about what it means to be a pluriverse     Continuing Activities and Proposed Budget  Grassroots Community Efforts (42.5k GTC) We believe that a strong grassroots effort around public goods can help to increase the number and quality of potential partners and contributors working together with Gitcoin to achieve our mission. This can be broken down into achieving 5 objectives: [1] Inspiring Spaces: Sustain and grow the Public Library community as a gateway for new contributors  Continue regular Public Library sessions and invite salient thinkers on Public Goods and Web3 as our speakers and moderators while inviting new participants interested in Gitcoin’s mission Develop and operationalise an onboarding flow for reliable participants to contribute to the Public Goods Funding workstream or other workstreams around GitcoinDAO Kickstart initiatives hosted by our Public Library participants beyond Gitcoin to discuss Public Goods  [2] Accessible dialogue: Host the “Public Goods are Good” Twitter Space consistently  Maintain a regular space for people curious about Public Goods and interact with key organisations and people through Twitter Spaces Support GR14 by hosting discussions on cause rounds and showcasing grantees  [3] Nurture ideas: Kickstart a publication on Public Goods  Grow awareness of Public Goods and inspire action to contribute Create a public good (non-rivalrous, non-excludable open publication) about Public Goods to move beyond synchronous community interactions  [4] Community Cartography: Support and grow the ImpactDAO mapping initiative  Complete an initial map of ImpactDAOs in the space to provide a baseline for evaluation and insight generation Explore mental models, narratives, relationships, and culture around ImpactDAOs to help foster the growth of the Public Goods ecosystem through educational material and research  [5] Community Lore: Create art for Gitcoin’s lore with collectively-owned IP  Grow a collective of lore-builders, creatives, and builders shaping a solarpunk future through the Gitcoin mythos   Gitcoin Grants Operations (45k GTC) Gitcoin Grants is the heartbeat of the DAO and is our primary product offering. Over the past six months, we’ve been gradually decentralizing Gitcoin Grants Ops and moving the execution of the program from Gitcoin Holdings into the DAO. Season 14 is expected to be a monumental milestone in that transition, with members of the previous Gitcoin Holdings team moving into the PGF workstream full-time. To that end, we will continue to build towards the H1 2022 objectives we set out at the beginning of the year: [1] Scale: Grow grants program  Increase number of high quality grants that raise >$5K/quarter by 50% (pending market condition) Increase the number of side rounds by 100%  [2] Sustainability: Set ourselves up to execute grants on a larger scale  Minimize the number of hiccups during the round Achieve NPS for participants, partners, and donors of >70 Test at least two new constructs for funding grants (e.g., public goods coalition, aqueduct)  [3] Decentralization: Continue to decentralize grants program  Move grants ops completely out of Gitcoin Holdings & into the DAO Increase role of stewards/community in grants strategy & decision-making; define governance surface area  Additionally, in Season 13, the Grants 2.0 product vision was outlined. In Season 14, as we start to work towards this vision, we want to test some assumptions we have around the future of the program. We are adding these new GR14-specific objectives to the above more macro-level list: [4] Ecosystem Funders: Test Grants 2.0 assumptions  Run a new Ethereum Infrastructure round in GR14 and solicit funds from ecosystem builders Run 15-20 Ecosystem Rounds in GR14 Assess which ecosystem funders are equipped & motivated to self-run rounds Share survey / interview results from post-GR13 partner discovery work   Community Partnerships (72.5k GTC) Fundraising and other forms of strategic partnerships are critical to the sustainability of Gitcoin as a DAO. These activities include bringing in matching funders for grants rounds, creating new ways to sell / auction NFTs, making small scale partnerships (or large scale via mutual grants with newly emerging organizations in the ecosystem, and experimenting with other new mechanisms like RetroPGF. Our objectives are as follows: [1] Scale: Grow the size of matching rounds executed by the DAO  Increase the number of net new partners we work with by 20% Increase the average size of side rounds (with emphasis on cause rounds) by 50% Continue to level up new full time and part time contributors towards the above  [2] Sustainability: Tighten processes to scout and execute partnerships  Refresh partnerships process to handle a larger load of potential partnerships while ensuring that we seek out the most aligned partners to work together by growing the partnerships team’s capacity Continue to build out new documentation to ensure members of the team have full context on each other’s responsibilities and current objectives (e.g. robust relationship tracking) Formalize our evaluation process to support partnerships across the DAO with support from Stewards via the mutual grants committee  [3] Measure impact: Help set the stage for new cause rounds that augment our mission  Fundraise for the Ethereum infrastructure round to bring Gitcoin back to its roots Focus on bringing in new values aligned web2 partners like Fifty Years and double down with other existing values aligned partners like Protocol Labs  [4] LARP together: Experiment with fundraising efforts around art, open-source partnerships, and collectively-owned IP  Kickstart a new team focused on experimenting with different methodologies to raise funds for Public Goods Raise at least 20 ETH through 1-3 net new NFT sales  If you have any questions about this budget proposal, please comment below! ",
                    "links": [
                        "https://www.notion.so/gitcoin/CSDO-1ab473386f74461c80b9409d0d400f0e?p=c793a1c798414811b2334f24e488ec2b",
                        "https://gnosis-safe.io/app/eth:0xa7aC9f7087d7197e0047DB9A90562a1364bf897D/balances",
                        "https://docs.google.com/spreadsheets/d/1ggYdSWOqo0eQjvUaifZyCmmN48nNNJ1l7PKGhFVkWwA/edit#gid=412717552",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmQWucgbue8uemNHXTDKvvEhRxfEcoB6B6Ci51TANkKaGU",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x6acb83e8757ea5421a23d4f5ef082cf9455d4bc79f414da99905070ea54e6f8a",
                        "https://publicgoodspack.xyz/",
                        "https://society.mirror.xyz/OuxuYixNEYVX6D0kW6aHMy9g66lEwf5KsnlIha7F0bQ",
                        "https://gitcoin.notion.site/Public-Goods-Discussion-Micropayments-and-Calm-Design-f0c7dafaf48b4e028cb43f909b2de8b2",
                        "https://gitcoin.notion.site/Public-Goods-Weekly-Discussion-DreamDAO-s-Ale-Borda-4b89b0b399a243ffa244a2c31cae5745",
                        "https://gitcoin.notion.site/Public-Goods-Weekly-Discussion-Speaker-Bhaumik-from-CCS-779596684fa442a18a908aa83e7ce530",
                        "https://twitter.com/zkvalidator",
                        "https://twitter.com/opgames_",
                        "https://twitter.com/0xpolygon",
                        "https://twitter.com/ensdomains",
                        "https://twitter.com/algofoundation",
                        "https://twitter.com/olympusdao",
                        "https://twitter.com/opensea",
                        "https://twitter.com/uniswapgrants",
                        "https://twitter.com/radicle",
                        "https://gov.gitcoin.co/t/gitcoin-aqueduct/9684",
                        "https://gov.gitcoin.co/t/gitcoin-aqueduct/9684",
                        "https://cryptosociety.notion.site/cryptosociety/Crypto-Culture-Society-01f39bcff26b422183061e6011b16892",
                        "https://twitter.com/CryptoSocietyS1/status/1489709838301081613",
                        "https://twitter.com/developer_dao",
                        "https://twitter.com/dreamdao_",
                        "https://mintkudos.xyz/",
                        "https://verses.xyz/",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://gov.gitcoin.co/t/schelling-point-event-workstream-setup-proposal/11083/7",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-15-2022/10453",
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v3/10358",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522",
                        "https://gov.gitcoin.co/t/s15-proposal-integrated-pgf-budget-request/11220/17",
                        "https://gov.gitcoin.co/t/kris-voter-guide-s14/10554",
                        "https://gov.gitcoin.co/t/s14-voters-guide-lefteris-guide/10585",
                        "https://gov.gitcoin.co/t/bobs-voter-guide-season-14/10575",
                        "https://gov.gitcoin.co/t/griffs-s14-voter-s-guide/10594"
                    ],
                    "GPT-summary": "The post is a proposal for the Public Goods Funding workstream to continue scaling their efforts in increasing interest and funding for public goods within web3. The proposal includes a budget breakdown for Season 14 and highlights the progress made in Season 13. The post also mentions the objectives for the workstream in the upcoming season and invites questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.408848743848744
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#2",
                    "likes": "5",
                    "time": "02/05/2022-09:06:40",
                    "content": "Thanks for this breakdown. I’m really excited by the work that PGF workstream is doing. I wanted to better understand 2 budget categories since they were on the higher end of funding amount requested.  Public Library (Hold a space to inspire people interested in working on Public Goods) at $90k (15k GTC) Source and close long term pools of capital for grantees at $247,530 (41,255 GTC)  I definitely get the need to pay those working on these great initiatives, but also want to better understand how this capital is being used given it’s a fairly large amount for 1 season. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.2651098901098905
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#3",
                    "likes": "3",
                    "time": "02/05/2022-10:01:32",
                    "content": "    linda:   Public Library (Hold a space to inspire people interested in working on Public Goods) at $90k (15k GTC) Source and close long term pools of capital for grantees at $247,530 ($41k)    Echo this in terms of clarification - perhaps some work with MMM in better highlighting the work PL is doing would be a great way to ensure the value is surfaced for better assessment? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#4",
                    "likes": "3",
                    "time": "02/05/2022-17:22:19",
                    "content": "Thank you for our support @linda! Allow me to explain the rationale and breakdown  Public Library (Hold a space to inspire people interested in working on Public Goods) at $90k (15k GTC)   We’re requesting the same amount as the last quarter to grow our community, we’ve managed to streamline the operations of the public library better over the quarter and thus we now have the capacity to do more with the same budget requested Public library started out as a core aspect of the PGF workstream and has been a great space for people interested (and have some knowledge) of public goods to come onboard and work with us/get to know the community/share resources/share opportunities More than half of our core contributors have come from the public library, starting out just attending calls, scribing, moderating etc and has been a great space to inspire people to really believe that funding and growing public goods is possible + take the plunge to join us Some of these contributors find a space in other workstreams such as @michelle_ma or were also inspired to kick off initiatives such as DreamDAO This also gives us the bandwidth to create educational resources on public goods such as the starter pack and articles  PGF also doesn’t have an ops budget for overall contributor management and onboarding, community management, overall workstream operations are currently parked under this segment too hence its more than having 1 or 2 contributors run weekly calls   Source and close long term pools of capital for grantees at $247,530 (41,255 GTC) Regarding the “source and close long term pools of capital for grantees” bullet - that breaks down into paying contributors who are bringing in matching capital for the grants rounds with the north star of scaling the team.    This season - we are very focused on scaling and enabling the partnerships/ecosystem team so that we can have enough bandwidth to handle all the inbound and outbound fundraising that we’ve been unsustainably trying to keep up with (60+ hour weeks for current full-time partnerships team members).   We are doing this by hiring/team scaling and implementing process and tooling to help boost the capital raised per fundraiser and distribute the existing load.   Specifically that includes salaries for 10 contributors (Full time + Part time):    Scott Moore (Full time) Vishnu Kumar (Full time) New Partnerships/Ecosystem Associate (Full time - finalizing hire) 7 part time contributors which will include:  5 new fundraising contributors (Part time) 2 new sales ops contributors to help implement process + tooling (Part time)    Thank you! ",
                    "links": [
                        "https://society.mirror.xyz/OuxuYixNEYVX6D0kW6aHMy9g66lEwf5KsnlIha7F0bQ"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.687040863177226
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#5",
                    "likes": "1",
                    "time": "02/05/2022-22:43:37",
                    "content": "    Fishbiscuit:  PGF also doesn’t have an ops budget for overall contributor management and onboarding, community management, overall workstream operations are currently parked under this segment too hence its more than having 1 or 2 contributors run weekly calls   This is significant and easy to miss.  Part of the 90k Public Library budget request is used for PG workstream operations/onboarding.  Just wanted to point that out. Full support. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.036458333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#6",
                    "likes": "2",
                    "time": "03/05/2022-04:25:38",
                    "content": "I have been compiling my Voter’s guide and I want to offer some of my questions and observations ahead of posting the voter guide. I do intend to update my voter guide as we discuss here, but hopefully we can keep the PGF relevant convo in this thread. tl;dr on my current sentiment:  PGF - Requesting a reduction (from 160K to 88.75K GTC), PGF spent 40% of its budget in S13 and a request of 160k feels incredibly large when 60% of the last budget went unspent. The Gnosis safe has very few active DAO members still on it and REALLY needs to be revised. Fundraising Contributor budget could be cut in half (if not more) - this group should be here for the mission, not the commission (and I believe only two people are in this payment lump? Hard to tell from the view of the budget linked). Grants Ops also feels heavy, but I believe it now covers 6 people, so is perhaps just fine (also hard to tell). The other work outlined in the request is small in nature and of value to keeping us a narrative leader in PGF more broadly. My concern though is that MMM should be driving (and accountable for) lots of this work as it’s marketing and community building - Can we coordinate funding on Public Library, PG PR, Publication, ImpactDAO and perhaps even the Comic and Auction line items listed (ie move those to MMM or leverage the large budget they just requested)? We seem to have a spray and pray approach with these initiatives (and others in MMM) and now is the time to really focus on protocol advancement in PGF.  PGF has been the heart and soul of our DAO (IMO) for a while, and the time to shift that has begun. We need to be focused more on a scaled protocol approach than hiring an army to find funding or run Grants Rounds or talk about Public Goods. I would love to see us be prudent in the way we approach this seasons budget to really focus on the necessities and let a few of the experiments die or go on pause for S14 and S15. The bear market we are moving into will not be kind to many projects. Our community will need us and I am extremely nervous about the large amount of sell pressure we will be creating with so many of these budgets. I am asking each workstream to really evaluate how to cut proposal sizes to ensure we can deliver our mission for years to come. Moving PGF’s budget to 88.8K GTC when only 40% was spent in S13 seems reasonable (token value is 60% what is was before though), and I recognize they are taking on a handful of new DAO entrants from Gitcoin Holdings. I would love some thoughts from the PGF team on how might we be able to cut this budget down and hand off many of the smaller items to MMM now that they are really hitting their stride. to reiterate, this request and feedback is going out to all workstreams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.617722061888728
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#7",
                    "likes": "6",
                    "time": "03/05/2022-08:00:37",
                    "content": "Hey @kyle, especially in light of the change in market conditions, I think 160K is actually quite close to our expected spend / is likely appropriate. That said, we’ll see what we can do to in good faith make a few cuts as many other workstreams are doing. I do want to take a moment to address the concerns in general though. First, regarding lower spend last quarter:  Before anything else, I think on principle it’s bad precedent to restrict a workstream’s budget because of their ability to be prudent in spending in previous quarters. PGF was able to in fact skip a budget due to slowly ramping up responsibilities and ensuring all activities aligned with key outcomes and priorities (so in fact this is in a sense our S13 budget). Due to changes in foundation timeline, multiple members from holdings held position instead of moving into PGF, many of those members are now going to be heading into the DAO and we want to make sure to incentivize them to stay active and perform to the best of their abilities. These members include folks like @annika @connor and other high performing members. Now that we’ve hit our stride operationally, we want to scale up to meet the demand we’re seeing in market both from funders (i.e. raising matching funds) and from potential ecosystem grants round candidates (i.e. the $500m FTM ecosystem pool). There is real risk of missed opportunities if we don’t scale effectively.  Second, regarding the multisig:  The Gnosis safe currently has mainly active members including @Pop @HelloShreyas and myself, though I do agree @Yalor @ken should likely replaced with operational members of the workstream such as @annika or @Fishbiscuit. I don’t think this is currently an operational challenge, we have been effective in distributing payments and continue to improve flows here.  Finally, with respect to splitting work between PGF + MMM:   We’ve been in active discussions with @seanmac on a bi-weekly basis to determine how to coordinate towards the best possible outcomes. In general (and Sean feel free to jump in if anything has changed here) we are aligned on the current split of responsibilities given our bandwidth, but have plans to adjust in future seasons. In this context, we agree MMM should be responsible for marketing activities but:   a) @Fishbiscuit noted above much of the community building work we are doing is separate and leads to meaningful outcomes (as shown by the number of contributors the library and public goods PR have propagated across the DAO).   b) Activities like the auction of the comics actively help the partnerships team, and it’s important for us to be coordinated with @Colton especially as we spin up more NFT auction mechanisms here   All this being said, I do definitely agree with being prudent in the context of a bear market, but believe that we are largely doing so with the approach we’re taking above already. Further, and I am certainly biased, I believe PGF is currently more clearly generative for the DAO with its spend, principally because outcomes involve directly increasing GMV + bringing in net-new funds. Happy to answer any other questions and I appreciate the thought / diligence put in here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.711997767857143
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#8",
                    "likes": "2",
                    "time": "04/05/2022-11:47:51",
                    "content": "This workstream is the easiest to judge. They need to bring in an infinite runway for matching pools and ensure the grants rounds operate correctly. The grants operations team is fantastic. Kudos to @annika @connor @J9leger and team for massively improving not only the operations, but the way we approach the issues which arise. Honestly, it seems like a lot of money going to marketing like things such as twitter spaces and discord calls, but I am not here to mess with others methods for success. By the metrics which I use to judge this stream, I have zero complaints about the work they have done or the direction they are going. Strong support for this budget. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.973958333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#9",
                    "likes": "3",
                    "time": "09/05/2022-16:13:58",
                    "content": "After taking another pass at our budget and keeping consistent with other workstreams tightening their belts, the PGF workstream is reducing the budget requested for the publication and impactDAO cartography by 50%. These are nascent initiatives that are experimental, and we would like to be aligned with the overall direction of DAO workstreams to be more streamlined and focus on our core initiatives. Therefore, the proposed budget for these 2 initiative will be:     Budget Category Description & Assumptions Amt USD Amt GTC     Publication Nurture ideas and grow awareness on Public Goods $30,000 5,000   ImpactDAO Community cartography of the ImpactDAO landscape $15,000 2,500    Therefore the change in overall budget will be Season 14 budget = 152,500 60 days’ reserves1 = +95,000 Current reserves2 = -62,000 Total Amount requested = 185,500 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.402777777777778
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#10",
                    "likes": "1",
                    "time": "09/05/2022-19:08:29",
                    "content": "I will be supporting this budget as is, especially with the revised amounts for the categories Publication and ImpactDAO as explained by QZ here. I unfortunately do not have time to dig as deep as I’d like to but I echo some of Kyle’s comments on creating more alignment with MMM and in S15 I hope we can move over some of these lines to MMM and others. Eg the creation of the comics is for me not something that should be a part of PGF but clearly of MMM. The public goods library is a treasure trove of content but it feels the summaries rarely make it outside of Notion, and that is a pity, knowing the brilliant minds joined in these calls. I hope we can already bring serious improvement during this season, esp. seeing the reserved budget for this. I do not agree that the Public Library should become the ‘gateway for new contributors’ - this responsibility lies within DAO Ops, and I have not even seen a clear onboarding process to become a part of the Library itself. I hope more alignment on this will emerge during this season, because I do see this as a serious issue. I do see there’s deep alignment of people who join the library calls, so this is an extra reason to develop a solid and integrated approach here. I’d love to also see more transparency on the budget spending in general, as there is not a lot of detail in the budget breakdown (also not in the linked document). Hopefully the compensation logic DAO Ops is working on will also help on this level. Tl;dr I’ll be voting yes, but I hope there will be lots of deep integration with MMM, DAO Ops and others + more budget transparency. ",
                    "links": [
                        "https://gov.gitcoin.co/t/kris-voter-guide-s14/10554"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.763939393939395
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#11",
                    "likes": "0",
                    "time": "10/05/2022-03:32:03",
                    "content": "    Fishbiscuit:  Total Amount requested = 185,500   This still feels like way too much to me. The overlap between work happening in MMM and PGF with the marketing, library calls, twitter spaces, etc. seems excessive. I also feel strongly the compensation for those doing the “selling of the rounds” is far too high. Our goal is to be a protocol where adoption happens organically. Ten fundraising contributors still feels like way too much (and thus that budget feels way too high). I am willing to forgo traction/growth on rounds to lower the spend here. We want to move that focus to our protocol development, not just staffing up more people to support the old platform. I still feel like the ~91-100k GTC versus the 152.5k is highly reasonable. Reducing Library calls, cutting back on PR, pausing the publication and the impactDAO work, slowing the comic and the auction seem totally viable to me. I would likely vote no without a larger reduction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.448245614035088
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#12",
                    "likes": "0",
                    "time": "12/05/2022-12:42:34",
                    "content": "    ceresstation:  [3] A denomination in dollar amount will be prioritized in budget proposals over GTC - so if the spot price assumed at posting of a budget changes between then and when the budget executes, the GTC amount will be readjusted to reflect the dollar amount at the time this proposal is moved to Tally or the 20 day moving average (whichever is lower) is moved to Tally.   I’d like to note that a total dollar amount is never explicitly stated in this thread (only the breakdown) and this budget has moved to snapshot. Additionally, the snapshot request for 185.5k GTC may be using the $6 GTC price from two weeks ago while GTC now is at $2. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/qedk",
                    "index": "#13",
                    "likes": "0",
                    "time": "12/05/2022-13:57:02",
                    "content": "It’s fine, the proposal also explicitly states:  A denomination in dollar amount will be prioritized in budget proposals over GTC - so if the spot price assumed at posting of a budget changes between then and when the budget executes, the GTC amount will be readjusted to reflect the dollar amount at the time this proposal is moved to Tally or the 20 day moving average (whichever is lower) is moved to Tally.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#14",
                    "likes": "0",
                    "time": "12/05/2022-14:02:31",
                    "content": "Yes, for that reason, a total dollar amount seems preferable to a total GTC amount when requesting a budget. It’s a small issue here because the numbers are there for anyone to calculate ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#15",
                    "likes": "2",
                    "time": "12/05/2022-15:40:22",
                    "content": "Thank you for pointing it out. PGF has generally requested amounts in GTC when posted on snapshot but still point the snapshot vote back to the forum where dollar amounts are denominated. This was a practice done since the very first budget and we’ve stuck to it for now since there hasn’t been a standardised format for presenting budget amounts on snapshot. Therefore, you’re right that when the vote eventually moves to tally, we’ll request for the dollar amount in GTC and whatever price GTC will be ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.825892857142857
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#16",
                    "likes": "0",
                    "time": "25/05/2022-15:27:12",
                    "content": "I thought that my voter’s guide was enough but since I was asked why did I vote against funding this WG, the main reason is that it is asking for too much funding for what it needs to accomplish and also that both this and MMM (which I also voted against) seem to overlap and it’s not clear why. I am not saying that bringing in funding for the rounds is not important work. It is. But repeating my overall message across the entire DAO I think we should go back to the drawing board and rethink our spending. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.072916666666667
                }
            ]
        }
    ],
    "group_index": "74"
}