{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/lessons-about-impact-networks/10305",
            "title": "Lessons about Impact Networks ",
            "index": 10305,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "7",
                    "time": "04/04/2022-17:31:47",
                    "content": " I recently read Impact Networks by D Ehrlihman, and found it to be a fascinating & great resource about creating impact in a complex networked world. The book is like a playbook for people building “impact networks” (basically impact movements, so I kind of think about it like DAOs but without tokens). It’s got some really really gold stuff for how to build an antifragile network. I definitely recommend purchasing the book, but here are some paraphrased lessons I took while reading the book to whet your appetites.  I cobbled these together using the open source toolkit here,  but the book is under a fairly strict copyright, so I was not able to include everything - Please support the author by purchasing the book here!. Networks are well-positioned to address complex issues; which are difficult to define + have no clear beginning or end. Complex issues prioritize the ability to adapt to changing circumstances + modify strategies as we learn what works + what does not. To address the complex challenges of our time, the book takes the position that we must embrace complexity + work collaboratively across systems of diverse stakeholders, especially when the path forward is unclear. Most people love the idea of collaboration as long as it promises to do exactly what you want to do. But that’s not how collaboration works, Collaboration is not forced or coerced. Collaboration is hard because to collaborate you need to give up control. Networks are networks of relationships. Relationships between network participants is the core basis of trust that allows for antifragility of the network. Clusters of relationships are extremely common, which form naturally as people gravitate towards those who share similarities. Networks are limited in effectiveness when cluster are not bridged. Bridges are essential links between two parts of a system Here are what different types of networks look like, courtesy of the open source book toolkit:  1492×1156 76.1 KB   1518×1222 114 KB   1462×1110 189 KB   1546×1184 195 KB  The book claims that since relationships are the heart of everything impact networks can accomplish, so creating a density of relationships is important. Because of this, moving from networks that look like this (left) to this (right) is critically important.  1472×1000 114 KB  1596×984 250 KB  The book also advocates finding single points of failure in the network relationship graph + making sure those are made to be more antifragile.  612×792 264 KB  The book advocates adopting a “network mindset” - embracing that everything is connected & the actions of individuals/organizations/sectors affect one another in profound & unexpected ways. To embrace a network mindset as a leader means:  Scaling impact, not growing their organization or function. Being part of an interconnected system, not the center of it. Sharing leadership with peers, not hoarding power or trying to be a hero. Building trust based relationships, not systems of control.  All hierarchies are networks, but not all networks are hierarchies. Being top of the hierarchy (or at the center of a rigid hub + spoke network) has its benefits (more control), but it has costs. The more one controls, the less the people around them can self organize to respond to complexity. Hierarchies have a hard time adapting to changing circumstances. When the organizing structure is predefined and inflexible, there is not much room for collective discovery, collaboration, or unforeseen innovation. Hierarchies are not good at solving for complexity.  1542×1224 102 KB  1440×772 111 KB  Here are the differences between a hierarchical mindset + a network mindset courtesy of the book graphics.  713×449 57.6 KB  With a hierarchical mindset, your organization is at the center of your focus.  With a network mindset, you place the purpose at the center of your focus and see your organization as one part of a larger, interconnected system.  Self-organization happens when people are invited to noticed & act on opportunities based on their own judgment. When people are free to try noew things, experiment, and connect with others in the system, networks become “leaderful”. Leadership in hierarchies are fixed, in networks, the leader is the person who knows what to do next. Networks can have smaller sub circles that are organized around their own principles or cohesive memberset.  Finally, networks can be part of other networks. This graphic reminds me of the DAO of DAOs vision for Gitcoin  The book claims that cultivating & sustaining Impact Networks is like gardening, because networks are living systems. They are not like machines that can be built, they are living systems. They are a continual process of “the five Cs”:  Clarify purpose & principles. Convene People Cultivate Trust Coordinate Actions Collaborating for systems change.  Some challenges to break down through the above processes:  Local Knowledge Seperation (when people are disconnected) Complexity  What does leadership look like in an Impact Network? The book advocates that no one should lead all of the time, and everyone should lead some of the time. Network leadership is about trusting relationships, shared power, and collaboration. It is adaptive, facilitative, & grounded in the wisdom of living systems. Network leadership is distributed, the leader is the person who knows what to do next. Network leaders manage the network operation s& maintain it’s communication systems, caring for the network , nurturing it’s growth, and constantly anticipate its needs & challenges. There are different types of network leader roles.  Catalyzing - crafting a vision & inspiring action. Facilitation - guiding participants through group processes. Weaving - fostering new connections & relationships Coordination - enabling participants to advance collective work  Here are four principles for networked leadership that the book recommends:  Foster self-organization Promote emergence Embrace change (and sense into the future) Hold dynamic tensions.  It’s interesting to think about dynamic tensions in the context of impact networks. Here are some areas where there is dynamic tension:  Building trust & taking action Participation & pace Self-interest & shared interest The parts & the whole Planning & emergence Divergence & convergence  I know that one area, while Gitcoin is decentralizing I’ve seen tension in is between building trust & taking action. Members of the company are learning to build trust across the network before doing the work - One great point I think the book makes is that building trust is doing the work (in a network) Another is between divergent thinking (expressing different perspectives) allows for convergence (bringing ideas together), which leads to emergence(discovering new possibilities).  1238×560 129 KB  I really got a lot out of this book. I definitely recommend purchasing the book, I will be happy to reimburse up to a dozen GitcoinDAO leaders who purchase the book + agree to read it. ",
                    "links": [
                        "https://www.amazon.com/Impact-Networks-Connection-Collaboration-Catalyze/dp/1523091681/ref=sr_1_1?keywords=impact+networks&qid=1649089245&sprefix=impact+ne%2Caps%2C108&sr=8-1",
                        "https://www.converge.net/trainings-toolkit#toolkit",
                        "https://www.amazon.com/Impact-Networks-Connection-Collaboration-Catalyze/dp/1523091681/ref=sr_1_1?keywords=impact+networks&qid=1649089245&sprefix=impact+ne%2Caps%2C108&sr=8-1",
                        "https://www.converge.net/toolkit/book-graphics",
                        "https://www.converge.net/toolkit/book-graphics",
                        "https://gov.gitcoin.co/search?q=%22dao%20of%20daos%22",
                        "https://www.amazon.com/Impact-Networks-Connection-Collaboration-Catalyze/dp/1523091681/ref=sr_1_1?keywords=impact+networks&qid=1649089245&sprefix=impact+ne%2Caps%2C108&sr=8-1",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-aug-2022/8694",
                        "https://gov.gitcoin.co/t/discussion-gitcoin-2023-future-essential-intents-and-organization/12533/6",
                        "https://gov.gitcoin.co/t/knowledge-transfer-characterizing-the-sybil-resistance-problem/11235",
                        "https://gov.gitcoin.co/t/discussion-series-visually-adapting-gitcoins-brand-logo/12753/9",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-dao-ops-budget-request/12741/29",
                        "https://gov.gitcoin.co/t/where-is-the-fire-around-this-fire/10664",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326",
                        "https://gov.gitcoin.co/t/dao-design-best-practices/10219/8"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5053732244997295
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ccerv1",
                    "index": "#2",
                    "likes": "2",
                    "time": "05/04/2022-21:27:29",
                    "content": "I read this last year after hearing Chase Chapman’s interview with David Ehrlichman. I love books that don’t mention DAOs but are actually all about DAOs! (Reinventing Organizations is like that too.) I have seen a naive approach to building networks that consists of bringing different orgs with hierarchical mindsets into a room together, facilitating lots of discussions, writing down words that emerge from those discussions that are innocuous sounding to everyone present, and calling it “shared purpose”. Networks that “discover” their purpose rarely have a true innate purpose that binds members. Another naive approach is creating a call to action where organizations or representatives feel compelled to show up in order to look good. They don’t want to be there, but they know it looks bad if they don’t show up. Networks that coerce their members to show up don’t have much impact either. I’d been reflecting on the Five C’s a lot since reading the book. A quote that stuck with me is “networks move at the speed of trust.” You can’t rush the process of cultivating trust. The people who convene need to be intrinsically motivated to be there. You need to release the tensions by acknowledging them directly and then, like an acupuncturist, pushing into them with pins. Anyway, great notes and a great addition to the regen canon! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7630718954248366
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "2",
                    "time": "05/04/2022-22:55:37",
                    "content": "    ccerv1:  ( Reinventing Organizations is like that too.)   this is a great point!  would love to have a “Reinventing Organiazations” TLDR on the gov forum too! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Layn",
                    "index": "#4",
                    "likes": "3",
                    "time": "16/05/2022-08:43:06",
                    "content": "Just finished the book. I also found it quite interesting and, as @ccerv1, love that it’s not done for DAOs but everything can be applied to them. I took several notes, but for me, what resonated more, was the focus on the relationships. I thought that onboarding was key to the success of a DAO (network), but after reading the book, I now understand that onboarding is just a piece of nurturing the relationships inside the network. I missed a little bit more details about the distributed decision-making that the author mentions a couple of times. I’m pretty sure he is not thinking of voting. I think he may be talking about rough consensus but would love to have his thoughts on this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.359375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ccerv1",
                    "index": "#5",
                    "likes": "5",
                    "time": "17/05/2022-22:48:07",
                    "content": "Finally got around to it! TLDR - Reinventing Organizations (\"Teal\") ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "50"
}