{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/the-impactdao-poster-book-is-here/10323",
            "title": "The ImpactDAO Poster/Book is here! ",
            "index": 10323,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "19",
                    "time": "07/04/2022-16:09:20",
                    "content": "Following the ImpactDAO Cartographers Wanted! 🗺 post, a group of about 100 people have formed in a telegram group to map the territory of ImpactDAOs. I have been working with @Aleborda21 and @octaviaan and @careymurdoch for the last few months on mapping out ImpactDAOs in the web3 space.  We have produced two products, which we will be launching at Schelling Point Amsterdam on 4/21.  Poster31920×2599 520 KB  Screen Shot 2022-04-07 at 9.55.53 AM1411×1753 202 KB  The first product is a poster that details how ImpactDAOs relate to each other visually. The second product is a book about ImpactDAOs which details ~100 ImpactDAOs in the space. I’d love to invite @Aleborda21 to comment about the why/what/how behind these projects. And I’d love to invite members of the GitcoinDAO to pick up  a digital copy of the ImpactDAO Poster - $0 a physical copy of the ImpactDAO Poster- $10 a digital copy of the ImpactDAO book - $13.37 a physical copy of the ImpactDAO book - $33  Ill have copies of these on-site on 4/21 at Schelling Point - Consider this preview to be a reward for those who follow the gov forum  ",
                    "links": [
                        "https://t.me/+ORZ8joj8_AhjM2I5",
                        "https://schellingpoint.gitcoin.co/",
                        "https://store.gitcoin.co/products/impactdao-poster",
                        "https://store.gitcoin.co/products/impactdao-book-digital-edition",
                        "https://www.blurb.com/b/11120667-impactdaos",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326",
                        "https://gov.gitcoin.co/t/the-overton-window-for-grants-2-0/10461",
                        "https://gov.gitcoin.co/t/impactdao-category-creation-proposals-wanted/10500",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-aug-2022/8694"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.008333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Aleborda21",
                    "index": "#2",
                    "likes": "11",
                    "time": "07/04/2022-18:09:02",
                    "content": "So excited for everyone to read it and explore the world of ImpactDAOs through this book! Since I first learnt about web3, and learned how we could embed our values into our economic system, redefine how we share value, and align the individual with collective incentives, I was fascinated by how we can use all of these principles to create massive positive change. We think ImpactDAOs are an essential building block to drive the great energy, excitement, and resources within web3 towards positive actions that change real lives. However, the general notion of web3 is, for many, not a technology used primarily for achieving positive change. With the book, we attempt to achieve three goals:  Establish some major shifts web3 enables in how we make sense of the world and how we focus our energy and resources to achieve more effective change Highlight the primitives, tools and frameworks ImpactDAOs are currently using to achieve this change. Showcase how this is an emergent, highly collaborative ecosystem where we can stack ImpactDAOs to achieve holistic, modular solutions that take combine expertise, talent and resources to serve all living systems  We created a couple of maps that serve as frameworks to understand this rapidly growing space. One map shows the role each ImpactDAO plays within the ecosystem to achieve individual positive externalities but, most importantly, to act as building blocks for other ImpactDAOs to achieve better outcomes. The second map (pictured in the poster) shows both the role each ImpactDAO plays but also highlights the Social Capital they affect (understanding that many ImpactDAOs affect more than one area of life but challenging to showcase on a single map) We have featured impact DAOs that have a) achieved substantial positive externalities in a way we could verify, b) provided value to the ecosystem beyond their direct positive externality and c) tackled leverage points that affect multiple areas within the ecosystem. Throughout the book, we share how web3 enables them to achieve impact in a way that was not possible previously and try to showcase the stories of how this connects to the real world or share verifiable impact metrics. Most info was from reading docs, case studies, discords, podcasts, etc. For some of these ~40 we did chat with either core team members or others that had used their tools, impact, and platforms to have further insight into their work! It is essential to highlight that many ImpactDAOs are ascent. We are yet to see how the ecosystem evolves, but this is also an exciting opportunity to take this still emergent design space to architect it in a way where collaboration is at its core. We can think through our approaches to make sure we are going beyond fixing or solving band-aid issues to tackling what will drive the most change for the world forward. Finally, although we aimed to be super neutral and include as many ImpactDAOs as possible that have an established theory of change, this is just from Kevin and my perspective. Here we simply acted as cartographers to lay out the current state of ImpactDAOs hopefully to serve as another effort for more people to use web3 to better the world. We are most excited to see more and more examples come up or for talent to join or collaborate across existing ImpactDAOs. Any and all feedback or ideas on how we want to evolve this forward are always more than welcome! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.350293033237948
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "1",
                    "time": "15/04/2022-15:53:15",
                    "content": "Join the telegram group if you are interested in helping co-create an upcoming version of the book/poster: Telegram: Join Group Chat ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Bem",
                    "index": "#4",
                    "likes": "1",
                    "time": "18/04/2022-13:30:50",
                    "content": "I know this is v0 but I feel like Gitcoin is missing from the poster! Its in the notion but i feel like we shouldnt understate / downplay our own impact! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#5",
                    "likes": "1",
                    "time": "21/04/2022-09:59:15",
                    "content": "It’s there now! See revised image at top. Where do you think it belongs? Did we get it right in your view? Eager for any and all feedback as this is just a v1! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.142857142857143
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Bem",
                    "index": "#6",
                    "likes": "1",
                    "time": "21/04/2022-11:27:33",
                    "content": "Omg youre totally right my b - it wasnt in kevins tweet! But its here - and i think tooling / infra is the right place. A lot of these obviously have some venn diagram overlap but i think this is the right call  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1607142857142865
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Irina",
                    "index": "#7",
                    "likes": "1",
                    "time": "03/05/2022-00:02:31",
                    "content": "amazing! can’t wait to read! I could not put down Greenpilled v0 on the way to Schelling Point at ETHDenver and am so excited and delighted to sit with this masterpiece! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.539930555555556
                }
            ]
        }
    ],
    "group_index": "56"
}