{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/hiring-freeze/10542",
            "title": "Hiring Freeze? \\xf0\\x9f\\xa7\\x8a ",
            "index": 10542,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "8",
                    "time": "08/05/2022-21:48:52",
                    "content": "Given the recent concerns about the market turning bearish and the DAO’s effectiveness vis-a-vis it’s spend, I am considering what it would look like if we tightened our belts over at Gitcoin Holdings. I am going to be proposing a Hiring Freeze to Gitcoin Holdings’ Leadership team on Monday. A little Gitcoin History: During the Great Bear, Gitcoin was 12 people.  We survived + ran Grants rounds for over 2 years at this team size.  So I know it’s possible to operate with a bit more of a scarcity mindset. Of course, that was 0 to 1 Gitcoin, and we are now pursuing 1 to 10 Gitcoin.  Gitcoin has ballooned to 100+ contributors, and we’ve grown very quickly - Some people have turned around from being hired themselves to hiring 1-4 people themselves during the next several months of joining.  Of course, it is hard to scale culture this way - as the values the team starts with (in 2018-2020, leanness, a focus on shipping product - among other things) are likely to get inflated away. It is my opinion that we’ve jumped from 0 to 1 straight to 10 to 100 without actually hitting the milestones that the 1 to 10 phase would imply (growing GMV, retiring 1.0 / shipping the 2.0 version of the Dapp + getting traction).  I think it’s time to pump the brakes. The reasons to consider a hiring freeze are:  Extend runway. Lower the chances that a RIF is needed for the DAO to survive. Focus on creating the conditions for more lean operations & high ROI operations. Stop expecting that we can hire our way out of our problems / to our goals.  Turn the team to those who are the right fit for this stage of the thread.  Of course, Gitcoin Holdings is not GitcoinDAO.  I may be the CEO of the Holdings company, and be able to make a call at the Holdings Co, but I am just one node in the GitcoinDAO network. The DAO has no CEO.  It is up to workstream leads & DAO leadership whether it wants to tighten it’s belts. So consider this an FYI.  I am posting this thread to overcommunicate in case other workstreams want to do the same as Gitcoin Holdings. ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-brief-history-of-gitcoin-from-2017-2022/9431",
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855/2",
                        "https://www.randstadrisesmart.com/blog/what-reduction-force-rif-what-does-it-mean-you",
                        "https://avc.com/2017/01/from-the-archives-turning-your-team/",
                        "https://gov.gitcoin.co/t/a-dao-has-no-ceo/9852",
                        "https://gov.gitcoin.co/t/s14-proposal-fdd-season-14-budget-request/10448/32",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17-2022/10597"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.773781179138322
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/05/2022-13:03:03",
                    "content": "found this interesting thread about how coingecko is preparing for a potential bear market   twitter.com    Bobby Ong @bobbyong  Last week, we had our monthly townhall in CoinGecko.   Some of the questions asked during the all-hands were: - how is CoinGecko preparing for the bear market? - are we planning for any layoffs? - our opinion on the bear market  Here's what we shared and some additional thoughts:   4:16 PM - 19 May 2022           222                56            ",
                    "links": [
                        "https://twitter.com/bobbyong/status/1527428128330682368?s=12&t=cxYTK-l9Vtn3n6MP5ad6rw",
                        "https://twitter.com/bobbyong/status/1527428128330682368?s=12&t=cxYTK-l9Vtn3n6MP5ad6rw",
                        "https://twitter.com/bobbyong/status/1527428128330682368?s=12&t=cxYTK-l9Vtn3n6MP5ad6rw"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "3",
                    "time": "20/05/2022-13:04:59",
                    "content": "and here is a great article from YC about how their portfolio companies are preparing for the bear (startups are not 1:1 with DAOs but there still may be some good thoughts):    No one can predict how bad the economy will get, but things don’t look good. The safe move is to plan for the worst. If the current situation is as bad as the last two economic downturns, the best way to prepare is to cut costs and extend your runway within the next 30 days. Your goal should be to get to Default Alive. If you don’t have the runway to reach default alive and your existing investors or new investors are willing to give you more money right now (even on the same terms as your last round) you should strongly consider taking it. Regardless of your ability to fundraise, it’s your responsibility to ensure your company will survive if you cannot raise money for the next 24 months. Understand that the poor public market performance of tech companies significantly impacts VC investing. VCs will have a much harder time raising money and their LPs will expect more investment discipline. As a result, during economic downturns even the top tier VC funds with a lot of money slow down their deployment of capital (lesser funds often stop investing or die). This causes less competition between funds for deals which results in lower valuations, lower round sizes, and many fewer deals completed. In these situations, investors also reserve more capital to backstop their best performing companies, which further reduces the number of new financings. This slow down will have a disproportionate impact on international companies, asset heavy companies, low margin companies, hardtech, and other companies with high burn and long time to revenue. Note that the numbers of meetings investors take don’t decrease in proportion to the reduction in total investment. It’s easy to be fooled into thinking a fund is actively investing when it is not.  For those of you who have started your company within the last 5 years, question what you believe to be the normal fundraising environment. Your fundraising experience was most likely not normal and future fundraises will be much more difficult. If you are post Series A and pre-product market fit, don’t expect another round to happen at all until you have obviously hit product market fit. If you are pre-series A, the Series A Milestones we publish here might even turn out to be a bit too low. If your plan is to raise money in the next 6-12 months, you might be raising at the peak of the downturn. Remember that your chances of success are extremely low even if your company is doing well. We recommend you change your plan. Remember that many of your competitors will not plan well, maintain high burn, and only figure out they are screwed when they try to raise their next round. You can often pick up significant market share in an economic downturn by just staying alive. For more thoughts watch this video we’ve created: Save Your Startup during an Economic Downturn     ",
                    "links": [
                        "http://www.paulgraham.com/aord.html",
                        "https://www.youtube.com/watch?v=0OVSTWozvfY"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.547662150259552
                }
            ]
        }
    ],
    "group_index": "91"
}