{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/regen-cryptoeconomics-book-foreword-by-gitcoindao/9711",
            "title": "Regen CryptoEconomics Book : Foreword by GitcoinDAO ",
            "index": 9711,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "11",
                    "time": "15/01/2022-18:22:09",
                    "content": "Hi all. You may have seen on twitter that I’m writing a book entitled “Regenerative Cryptoeconomics”.  Screen_Shot_2022-01-14_at_10.08.20_AM_720x720×916 78 KB  Here’s what the book is about:  This book is about cryptoeconomic systems that create positive externalities for their neighbors & for the world. We explore the intersection of programmable money, game theory, & mechanism design. We search for powerful new ways to to fund, design, develop, & market regenerative web3-era applications and digital assets. We launch the meme of regenerative crypto-economics into the world.   Foreword from GitcoinDAO As part of the book, I’m having a handful of members of the web3 regen community write forewords, and I’d like to include “GitcoinDAO” on that list as well. Here’s what I’ve got drafted up:  Our vision is to establish an empowering, open and collaborative space where individuals and communities can access resources in proportion to their value creation independent of their geographic location, education, background or offline identity. By creating collaborative, decentralized funding mechanisms, Gitcoin has become the natural choice for seeding and supporting digital public goods. The DAO enables building for the public, by the public by helping individuals and communities start, fund, and scale open source projects. We are the EVM whisperers, the DAO cartographers, the internet citizens, and the chaos magicians of the internet of money. We are the schelling point for the hopeful . We are still discovering new & innovative ways to solve coordination problems in a DAO-era world. We systematically discover or invent these mechanisms, and if we’re lucky + good, we then scale them.  Astute readers of this forum may note that the first two paragraphs are pulled from this thread on mission/values which was authored by @Pop (but synthesized bits from many many community members) and the second two paragraphs are from the what is gitcoin post that I authored. Here is how it looks in the layout.  101755×2214 128 KB   111755×2211 224 KB  I would like to solicit feedback on the above content. What do people think?  Should we include a GitcoinDAO Foreword in the 0th edition of this book? Who even has the legitimacy to author a statement on behalf of the DAO? Does the fact that these posts have been up on the forum for months + have already solicited comments imbue legitimacy, or can legitimacy only come from the formal governance process? Maybe a middle ground would be to ship this book with a statement about GitcoinDAO instead of from GitcoinDAO?  ",
                    "links": [
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin/8694",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin/8694",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-2-2022/9739",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-3-2022/9771"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.78525641025641
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/clasikman",
                    "index": "#2",
                    "likes": "2",
                    "time": "15/01/2022-20:19:29",
                    "content": "@owocki a pleasure to greet you, well here I have some comments:  If the foreword should be included, almost always people see the foreword first to be interested in the content, and those 4 paragraphs are the initial point of interest. If a person is already part of the DAO, then they would already have every right to write something in their name, but since it is a community of people, all of whom are included, then there must be a certain degree of acceptance that is denoted in the reactions of the forums or RRSS, it depends on what you have written. If it is already legitimate, since many people participated with comments or corrections, then you already have the acceptance that you mentioned in point 2. (We will never agree 100% on everything, but the idea is to reach an acceptable percentage ). Since the whole community is here reading this, then you can now send it from GitcoinDAO.  These words are only an opinion I hope I have served you, have a good day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "0",
                    "time": "19/01/2022-23:33:55",
                    "content": "hey all, i am going to ship the book to the printers likely on friday. here’s what im thinking  based on the lack of engagement on this thread (thanks to @clasikman for their input), i’m going to assume that the DAO doesnt deeply care what direction i take this so long as what is written is generally aligned with our ethos. it feels like based on the fact that the text of the post is from threads that have already have been around for a while that the Lindey effect of those posts is somewhat large. i’m trying to have a bias towards action.  based upon the above, i’m thinking i’ll just roll forward with the foreword as written in the post.  let me know if anyone disagrees please! ",
                    "links": [
                        "https://www.oreilly.com/library/view/do-more-faster/9780470929834/ch42.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.321428571428571
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wkarshat",
                    "index": "#4",
                    "likes": "2",
                    "time": "20/01/2022-14:26:25",
                    "content": "Accurate link to Simona’s Gitcoin Mission & Vision post. However, the first two paragraphs do appear in the Sept TLDR post, under We build for human thriving. For me, the second paragraph does describe what I believe, and the following two are good, if somewhat whimsical. But I’m not a fan of the first one, simply because it is formulated ambiguously, between ‘in proportion’, ‘their value’ and ‘their geographic location’. And we found out since Sept that locations do matter… An organization does not have a ‘voice’, in the sense of not having a corporeal physical existence, but it can certainly have a speaker. There is no doubt that for Gitcoin, beyond being the founder, you are the visionary and the speaker. Still, foundational statements made on behalf of the DAO could be further confirmed as accurate and representative through some form of a referendum or a process of ratification. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.755102040816327
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Rieki7",
                    "index": "#5",
                    "likes": "2",
                    "time": "20/01/2022-17:19:34",
                    "content": "Absolutely LOVE this effort @owocki ! I’d like to offer a few resources here that may help with this exploration:   ttps://explore.joinseeds.earth/read-me-first/ - this goes over one evolving attempt at using web3 tools to build a regenerative economic system.   ttps://explore.joinseeds.earth/5.-economic-tools/v/tools-for-regenerative-economic-systems/ - this goes over a variety of game-theory and economic protocols.   Would love to help in any way with this effort brother and really appreciate the lead you’ve been taking here! Removed the “H” at the start of links since I can add them  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#6",
                    "likes": "0",
                    "time": "20/01/2022-20:40:51",
                    "content": "    wkarshat:  There is no doubt that for Gitcoin, beyond being the founder, you are the visionary and the speaker.   it might be an interesting middle ground, to say the foreword is by myself on behalf of the dao. another option that came up would be to ratify this through the cross-stream dao ops group. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#7",
                    "likes": "3",
                    "time": "22/01/2022-20:39:57",
                    "content": "A few thoughts - I love the idea of having a foreward from the DAO. I would really love to see us close by saying “We are Gitcoin” not “we are GitcoinDAO” Gitcoin is a community and DAO, by adding “DAO” to Gitcoin it feels like there are two unique orgs/groups/etc. We are one. I also really like that you pulled from existing material, and that these materials have largely been discussed before. One personal preference of note, I dont love this:     owocki:  communities can access resources in proportion to their value creation   It feels exclusionary and as if we are only offer these resources to those who create value. I would love to think we are offering these tools to dreamers, dabblers, value creators and critics alike. We as a community are stronger by incorporating the best of what works, sharing our learnings and discarding what doesn’t. Gitcoin of yesterday will look different from Gitcoin of today. I would like to believe we have something to offer all who seek to understand. So, one humble suggestion:  Our vision is to establish an empowering, open and collaborative space where individuals and communities can access resources independent of their geographic location, education, background or offline identity.  I would also strike “digital” from the second paragraph as we are already moving into real life public goods as evidenced by GR12. Third paragraph has a space at the end (near the period) that shouldn’t be there (it does not look like this space is in the proof you shred though). Final paragraph, perhaps use: “We will continue to discover…” as we opened with “we are…” in the paragraph above. This will able maintain the tense for the second sentence in that paragraph. In the second sentence, consider changing discover to uncover as we used discover in the first sentence . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.733205782312925
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#8",
                    "likes": "0",
                    "time": "24/01/2022-02:26:39",
                    "content": "    kyle:  A few thoughts - I love the idea of having a foreward from the DAO. I would really love to see us close by saying “We are Gitcoin” not “we are GitcoinDAO” Gitcoin is a community and DAO, by adding “DAO” to Gitcoin it feels like there are two unique orgs/groups/etc. We are one.   Hi @kyle I like this statement very much, many times I am confused (I guess the Gitcoin user had the same) what is Gitcoin and what is GitcoinDAO, and what’s the difference. If our goal is to transit to DAO, maybe use the same name “Gitcoin” instead of “GitcoinDAO” , it is a great suggestion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.152777777777779
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#9",
                    "likes": "0",
                    "time": "24/01/2022-04:04:57",
                    "content": "    kyle:  It feels exclusionary and as if we are only offer these resources to those who create value. I would love to think we are offering these tools to dreamers, dabblers, value creators and critics alike   Thanks for the thoughtful commentary Kyle! This is a great point, and forces some thinking about our values and hard tradeoffs to be made. Here is my 002 wei.  Open to others feedback! On one hand, I believe that being as inclusive as possible is important.  It is not the fault of the underprivileged or under-resourced that they were born into where they were, and we should make every effort to be as inclusive as possible. On the other hand, I feel like the north star mission is to “build and fund the public good”.  If we are not prioritizing the people who are providing value to the public good, then how are we to accomplish this mission? Perhaps a middle ground is to have a baseline amount of resources available to everyone (Gitcoin’s code, its lore, its culture, its governance model), but then have some resources (eg the matching pool) that are only available to those who are creating value for the public good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.162698412698413
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#10",
                    "likes": "1",
                    "time": "25/01/2022-19:15:07",
                    "content": "  Should we include a GitcoinDAO Foreword in the 0th edition of this book?   Absolutely +1 on this, although I agree with @kyle that we should say Gitcoin, it’s really one core community, and we’re all on the same mission in different ways.   Who even has the legitimacy to author a statement on behalf of the DAO?   I think it might be a bit late if we really want the whole DAO to have input depending on when we need to bring this to press, but it could always be something that’s included and iterated on for V1 as well.   Does the fact that these posts have been up on the forum for months + have already solicited comments imbue legitimacy, or can legitimacy only come from the formal governance process?   I think most of the points here definitely reflect all the conversations folks have had in Public Goods Funding, and so from that perspective I think it’s the right vibe.   Maybe a middle ground would be to ship this book with a statement about GitcoinDAO instead of from GitcoinDAO?   I don’t know if this is truly distinct, whether we say it about or from the DAO it represents the DAO and I think our position on the degree to which this represents everyone’s views should be the deciding factor on either way of wording things. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.566326530612244
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#11",
                    "likes": "2",
                    "time": "25/01/2022-19:28:22",
                    "content": "We discussed at the CSDO today and ratified this text as legitimate from the perspective from the workstream leads:  Our vision is to establish an empowering, open and collaborative space where individuals and communities can access resources independent of their geographic location, education, background or offline identity. By creating collaborative, decentralized funding mechanisms, Gitcoin has become the natural choice for seeding and supporting public goods. The DAO enables building for the public by the public.  We help individuals and communities start, fund, and scale open source projects. We are the EVM whisperers, the DAO cartographers, the internet citizens, and the chaos magicians of the internet of money. We are the schelling point for the hopeful. We will continue to discover new & innovative ways to solve coordination problems in a DAO-era world. We systematically uncover or invent these mechanisms, and if we’re lucky + good, we then scale them.  We also made an edit that made it come from “Gitcoin” as opposed to GitcoinDAO. Heres what it looks like laid out in the book:  Screen Shot 2022-01-25 at 12.28.50 PM812×1050 40.8 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.841540404040404
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Rieki7",
                    "index": "#12",
                    "likes": "0",
                    "time": "04/02/2022-18:17:05",
                    "content": "I see the same thing with “DAO” as early days of “LLC” and “INC” where many businesses made it a point to add this organizational form to their name (and in some cases required by law). I also agree to just go with “Gitcoin” and introduce the DAO concept in promotional material and other places. Just opinionated food for thought here  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.59375
                }
            ]
        }
    ],
    "group_index": "662"
}