{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/s14-voters-guide-kyles-guide/10567",
            "title": "[S14 Voters Guide] Kyle's Guide ",
            "index": 10567,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#1",
                    "likes": "2",
                    "time": "11/05/2022-17:21:49",
                    "content": " Kyle’s Season 14 Voters Guide Season 14 is upon us and we now have 8 budget proposals to review and evaluate. I want to start with an immense thank you, and shout out to those drafting, coordinating and proposing these workstream budgets. This is arguably one of the most robust planning sessions we have had, and I have loved that so many workstreams are really leveling up their thinking and planning. Thank you! As I write this Voter’s Guide, I want to note that I am but one node in the network, but I would like to think I am also a highly connected node. A node with a vested interest in Gitcoin’s success that cares deeply about our long term opportunities. That in mind, I often act as a “wet blanket” or a reality bearing voice that challenges the idea that we have free internet money that we can spend in wild ways to grow and learn (without actually accomplishing our mission). S14 is going to see a large increase in budget requests from most workstreams as they fill their reserves, and onboard contributors from Gitcoin Holdings who have decided to join the DAO full time. I believe this trend (contributors embracing the DAO full time) is good for Gitcoin and for Web3 in general. I do worry that season over season Gitcoin continues to struggle actually making progress on its goal to be a protocol DAO however. IMO, the most important thing for the Gitcoin DAO is Grants 2.0. Any work not advancing that cause will see immense scrutiny this period from me and likely other stewards. There is tremendous output and experimentation happening across the Gitcoin DAO, but now is not the time to lose focus on any other area outside of our Protocol development. We are failing to support and launch a Grants protocol, and each workstream continues to define metrics that largely are not in support of that goal. The market winds are shifting and we need to button down the hatches to ensure we launch a protocol that stands the test of time. As a result of this sentiment and my agreement with this Twitter Poll, we should scrutinize budgets to ensure we stay focused on the outcomes that matter (not the outputs). Workstreams continue to grow and say “yes” to everything instead of really nailing their core value proposition and expanding from there - this will have us die a death from a thousand cuts.   MMM - Vote Yes given reductions and agreed upon slowing of expenses. My goal was to cut down the larger number of initiatives we are paying outside firms to support us with. PR is likely not necessary at this time, we have a strong narrative and brand but no protocol to announce. This new number still honors the reserves that were ratified. I would like to see diversity in your multisig. All of your signers are core MMM contributors and you are missing your customer’s feedback (and collusion prevention  ). FDD has done a good job of shifting how to think about multi signer responsibility (DAO Ops a bit too).  PGF - Voting No unless a larger reduction is made. A request of 152k feels incredibly large. The Gnosis safe has only a few active DAO members still on it and REALLY needs to be revised (Yalor, Shreyas, Ken dont participate much). Fundraising Contributor budget could be cut in half (if not more) - IMO we should wait to really push for adoption until we have a protocol to grow adoption on. Grants Ops also feels heavy, but I believe it now covers 6 people, so is perhaps just fine (also hard to tell). The other work outlined in the request is small in nature and of value to keeping us a narrative leader in PGF more broadly - BUT - I wonder if we can reduce the frequency to help us cut the cost down by ½ or a ⅓. My concern though is that MMM should be driving (and accountable for) lots of this work as it’s “marketing” - Can we coordinate funding on Public Library, PG PR, Publication, ImpactDAO and perhaps even the Comic and Auction line items listed (i.e. move those to MMM)?  FDD - Waiting to see reduction amounts this week (Would vote No as-is), IMO FDD should be focused on maintaining as slim of an operating budget as possible given the reduction in round sizes and the changes coming from Grants 1.0 to Grants 2.0. I still feel that Gitcoin seems to be paying for the education and advancement of a number of ideas - Sybil DAO, Most of “Evolution”, Catalyst, etc. without any discernible increase in value being delivered back to the DAO. Cutting most of “Evolution”, scaling back “Sybil defenders” and doing a deeper dive on the value of GIA would be valuable. FDD has brought tremendous strength in ideas to the Gitcoin DAO, and those participating in the workstream are sharp. They just seem to be building for an ideal that doesn’t align with where we currently are as a community or market - costs continue to grow without a large change in result (though I understand decentralized approaches are culprits for this cost increase). I would love to explore a “lean” S14 ahead of Grants 2.0 and then evaluate what a measured growth plan might look like.  DAO Ops - Voting Yes, DAO Ops is in a precarious situation having taken on multiple funding obligations for the entire DAO which really conflates its budget with that of supporting the entire DAO. I fear DAO Ops may be centralizing too many entry points of the DAO and eroding autonomy of workstreams, but WSs seem to prefer this approach for now (this is no fault of DAO Ops merely pointing out they are no longer their own masters, but instead at the behest of CSDO).  MSC - Voting Yes given amendments, MSC has really struggled to find its legs (beyond great YOLO projects that have grown funding for PGF) and now has a leadership transfer to course correct. Rightfully so there was a dramatic reduction in budget requested compared to S12 and there is an opp to further focus where MSC spends resources. I appreciate the revisions to the proposal and the reflection on the roadmap. Grants 2.0 and GTC Utility are incredibly important for our future and I would love to see us double down on those themes.  dCompass - Voting no, It has taken me a while to overcome the sunk cost fallacy, but I do not think we should continue to fund this work. S14 is really the season of focus, and I would like to see the Gitcoin DAO focus its funding efforts on our protocol.  Kudos - Voting no, The mintkudos team has great user traction, a great UX and is aligned with our vision for reputational needs in the space. I would love to find a way to keep this work as an informal workstream for one more season and continue to develop the thesis (and supporting protocol (dPopp).  Kernel - Voting no, Kernel doesn’t really fit as a workstream, and it likely doesn’t need to be one to accomplish its mission or goals. It has funding from Gitcoin Holdings and the proposal lacks clear upside for the Gitcoin DAO in a way that a close relationship cannot offer. I am really interested in making sure Kernel has secure funding, but giving them GTC to sell and fund operations just doesn’t feel appropriate. I want to explore more options here.  ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://twitter.com/kbw/status/1515084405139771402",
                        "https://twitter.com/kbw/status/1490722309317046274",
                        "https://hbr.org/2017/02/you-need-to-manage-digital-projects-for-outcomes-not-outputs",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17-2022/10597"
                    ],
                    "GPT-summary": "The author of the post is providing a guide for voters to review and evaluate the 8 budget proposals for Season 14. The author expresses gratitude for the workstreams and proposes that the Grants 2.0 protocol is the most important thing for the Gitcoin DAO. The author provides feedback on each proposal and suggests reductions and amendments for some. The post also includes the author's concerns about the growth of costs without a large change in result and the need for a lean S14 ahead of Grants 2.0. The post includes constructive criticism, positive feedback, and questions about the proposals.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Board composition",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.810634478205233
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#2",
                    "likes": "3",
                    "time": "11/05/2022-17:44:22",
                    "content": "   [S14 Proposal - AMENDED] Memes, Merch, Marketing - Budget request   Current signers of the MMMultisig are: Brittney, Fred, Sean, Jonas, Ceres, ChrisDean & Simona. ( Update: ChrisDean and Simona were added to the MMM multisig after the original S14 proposal. )   Hey Kyle, appreciate your guide & perspective. Just want to clarify if your comment re: the MMM multisig was made after seeing this change (or if you had not seen this part of our amended proposal). Thx! ",
                    "links": [
                        "https://gnosis-safe.io/app/eth:0xC23DA3Ca9300571B9CF43298228353cbb3E1b4c0/balances",
                        "https://gov.gitcoin.co/u/seedphrase",
                        "https://gov.gitcoin.co/u/fred",
                        "https://gov.gitcoin.co/u/seanmac/",
                        "https://gov.gitcoin.co/u/jonas/",
                        "https://gov.gitcoin.co/u/ceresstation/",
                        "https://gov.gitcoin.co/u/chrisdean",
                        "https://gov.gitcoin.co/u/pop",
                        "https://gov.gitcoin.co/t/s14-proposal-memes-merch-marketing-budget-request/10440/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.171875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/05/2022-18:05:08",
                    "content": "This is great - I missed this. Thanks for the update! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.625
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/s14-voters-guide-lefteris-guide/10585",
            "title": "[S14 Voters Guide] Lefteris' Guide ",
            "index": 10585,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#1",
                    "likes": "15",
                    "time": "12/05/2022-15:47:24",
                    "content": "Lefteris S14 voter’s guide I create this voter guide as per our discussion in the Steward council and at the request of other stewards. It’s based on @krrisis and @owocki 's guide It will be short. I am really pressed for time and have spent already a lot of time analyzing all the different proposals and trying to understand what they do, how much money do they need and what does the DAO get from them. For me Gitcoin and its DAO should be about one thing and one thing only. Funding opensource. Public goods is a cute term but it’s so generic that it can be abused and leads to what we see today. That is multiple groups asking for money to do their thing since anything can be somehow put into the public goods category. This sentiment lead to this tweet which somehow got popular:  twitter.com    Lefteris Karapetsas | Hiring for @rotkiapp @LefterisJP  A DAO without a clear goal is just a fat cow filled with cash to be milked by subgroups each with its own idea of what the goal of the DAO should be.  The more generic the stated goal of the DAO the easier to fall into this trap.   12:47 AM - 4 May 2022           222                23            With that in mind I was thinking of abstaining from most votes. The abstain tendency was due to two reasons.  Not enough time to properly understand and judge budgets for 8 workstreams I think most asks were too big considering we are in a bear market.  But after more thinking, looking at more of the budgets and seeing the market crash in the last days I think I am going to vote No to all but 2 workstreams. I will put my reasoning for each workstream below but the overall thinking is simple and as follows: The problem of properly funding opensource work is a very important problem to solve. It is not even closed to being solved yet. I think the purpose of Gitcoin should be to solve that. Anything else is just a distraction, dead weight and waste of money. So anything that does not contribute to  opensource funding gets a No. For me gitcoin tries to solve opensource funding by their flagship product which is gitcoin grants.     Workstream Recc Comment     MMM No I don’t understand what the need for memes/merch/marketing is at this point in time and with the market in such a terrible state this is one of the most obvious budgets to cut.   PGF  No I don’t see how this helps fund opensource. Sounds like education/strategic partnerships and outreach. Which though good and eventually needed, it is something I believe is not going to help in the short term and considering the state of the market we should not fund yet.   FDD  No This is a tough one. FDD or some approach like them is needed for sybil defense against gitcoin grants. But having spent hours trying to understand what they do and failing and realizing most of it is human checking I believe at its current form it should not be funded. What I would like to see from a workstream to help against sybil attacks is output in the form of software tools that will help us. And much much lighter budgets.   Kernel No I don’t see why Kernel should be funded by GitcoinDAO. It’s a great project but was outside of GitcoinDAO and with the state of the market I believe it should stay separate.   DCompass  No I don’t see how this workstream can help with Gitcoin funding opensource and Gitcoin grants.   Kudos No Same as the others. Kind of sad to say no as the request is quite small, but to be fair I am going to stick to the rules I set in the first part of this post.   MC  Yes From the proposals out there, this is the only one that has something to do with preparing for Grants 2.0, which is the continuation of Gitcoin grants and as such aims to help with funding opensource so I will vote yes.   DAO Ops Yes A DAO needs people to operate it, manage treasury, diversify, create tools and help with every day operations.    Closing Thoughts This is tough. It’s a tough position to be in and I hate to be seen as the bad guy saying no to so many people. But there is 3 things to consider here:  The workstreams tend to ask for a lot of money. I do all this governance stuff here pro bono because I believe in the vision of creating a universal solution for funding opensource. At the same time I am running a company building opensource software in Berlin, Germany. We have a very constrained budget, yet we build amazing software. We are 7 people and we burn less in a year than some workstream budgets have asked for a quarter. I don’t know if they all expect “sillicon valley” salaries but considering the market conditions I feel a strong urge to say no to all this spending. No organization can build everything. The past year Gitcoin DAO seems to have tried to build many things, spin off many workgroups and us the stewards have been saying yes, yes, yes to everything. This has to stop and the DAO needs to focus on its core goals. Which imo is to fund opensource. The time to evaluate budgets is too little. We should have more than a month to evaluate a budget and they should all follow the same format. Not having enough time (as happens every season, and also this one) we the stewards tended to say yes or abstain since it’s just “too much work” to do in 1 week. I think this needs to seriously change. All budget requests should pass a multi-monthly review process and feedback of back and forth before going to snapshot votes. Otherwise they should get auto-rejected. If any workstreams convince me they can help fund opensource software I reserve the right to change my vote   I am sorry if this disappoints some people. Let’s survive the bear market and fund opensource together. ",
                    "links": [
                        "https://twitter.com/LefterisJP/status/1521758439348838400",
                        "https://twitter.com/LefterisJP/status/1521758439348838400",
                        "https://twitter.com/LefterisJP/status/1521758439348838400",
                        "https://gov.gitcoin.co/t/s14-proposal-memes-merch-marketing-budget-request/10440",
                        "https://gov.gitcoin.co/t/s14-proposal-public-goods-funding-budget-request/10443",
                        "https://gov.gitcoin.co/t/s14-proposal-fdd-season-14-budget-request/10448/6",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-kernel-budget-request/10444",
                        "https://gov.gitcoin.co/t/s14-proposal-dcompass-budget-request/10412",
                        "https://gov.gitcoin.co/t/s14-proposal-decentralize-gitcoin-kudos-budget-request/10442",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-moonshot-collective-budget-request/10446",
                        "https://gov.gitcoin.co/t/s14-proposal-dao-operations-s14-budget-request/10447",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17-2022/10597",
                        "https://gov.gitcoin.co/t/dao-compensation-sustainability/10604"
                    ],
                    "GPT-summary": "Lefteris S14 voter’s guide explains his reasoning for voting no on most workstreams, as he believes Gitcoin should focus on funding open source and anything else is a distraction. He provides a brief analysis of each workstream and why he is voting no or yes. He also suggests that budgets should be reviewed over a longer period of time and follow a standardized format before going to snapshot votes.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.353752903600465
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "4",
                    "time": "12/05/2022-20:07:43",
                    "content": "Thanks Lefteris. We have gone back to the drawing board. Here is another visualization to show how FDD efforts relate to software.  FDD Budget • Gitcoin Holdings - Google Chrome 2022-05-12 at 2.06.01 PM1695×1058 111 KB  We plan on posting a fully revised budget tomorrow. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/polarpunklabs",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/05/2022-23:12:49",
                    "content": "I can understand the desire to get lean and especially how important that is in light of GTC’s declining price (although market conditions in crypto do switch quickly). However, I would make a protest about eliminating the PGF steam. Public goods education and partnerships do not appear to me incidental to Gitcoin but central to its identity, providing the rationale for why public goods should be funded. I think in stripping away the ongoing reflection on what Gitcoin is and what funding open source entails - beyond the rudimentary - you will end up with a DAO without a mission, a soulless hulk, like some company undergoing corporate raiding. As Griff notes in his post: ‘This is one of the few working groups that is working to make an economic impact on GTC by creating token swaps with other DAOs to build more liquidity and it brings in actual funding, mostly to the Matching pool, but this is still great, I think it can bring in more $$ into the ecosystem than it costs to fund it, that said, i wish it were leaner.’ Link. I take this to be the result of the good will of the education work and outreach Gitcoin is strongly associated with. And probably this is precisely the part of the community most likely to come up with new ideas about creating utility for GTC. It is, in a manner, the reflective part of the Gitcoin project and should be ineliminable on that basis. I’ve seen the lean process in higher education strip institutions down to nothing in an effort to cut costs and then end up with reputation for soullessness. This should be avoided at all costs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.11449494949495
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#4",
                    "likes": "1",
                    "time": "16/05/2022-07:16:27",
                    "content": "Thank you for your feedback. I hear what you are saying but I disagree. The reasons are:   As I have said many times in the past gitcoin for me has been always for funding opensource. Anything else is just bla bla. https://twitter.com/LefterisJP/status/1525948948975915011 I really dislike the switch from opensource to public goods .It’s such a loaded term that can be interpreted to mean literally anything by anyone. And suddenly you become a fat cash cow to be milked by others. And it’s all about politics from there on   Gitcoin’s main funding opensource product is gitcoin grants. Since the DAO was created that product has been getting worse and worse. It’s buggy as hell, stuff break every time, 1/4 of the stuff actually work and looks and feels abandoned. As a developer myself it pains me to see this.   So to me all the talk about outreach, education, public goods and more rings hollow at this point in time. It’s time to cut the fat, tighten the belt and focus again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.923611111111112
                }
            ]
        }
    ],
    "group_index": "94"
}