{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/building-gitcoindaos-legitimacy/9649",
            "title": "Building GitcoinDAO's Legitimacy ",
            "index": 9649,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "5",
                    "time": "08/01/2022-19:43:30",
                    "content": "As we’ve been setting 2022 goals, I’ve been thinking lately about Vitalik’s famous The Most Important Scarce Resource is Legitimacy post lately, especially vis a vis it’s relevance to the pluralistic scale infrastructure for funding public goods. This post assumes you’ve read both of the above posts.   If you have not, please read them + come back here   They’re worth your time, I pinky swear.   Types of legitimacy From Vitaliks post:  Legitimacy is a pattern of higher-order acceptance. An outcome in some social context is legitimate if the people in that social context broadly accept and play their part in enacting that outcome, and each individual person does so because they expect everyone else to do the same .  The ways through which legitimacy is gained are (again, from Vitaliks post):    Legitimacy by brute force : someone convinces everyone that they are powerful enough to impose their will and resisting them will be very hard. This drives most people to submit because each person expects that everyone else will be too scared to resist as well.  Legitimacy by continuity : if something was legitimate at time T, it is by default legitimate at time T+1.  Legitimacy by fairness : something can become legitimate because it satisfies an intuitive notion of fairness.  Legitimacy by process : if a process is legitimate, the outputs of that process gain legitimacy (eg. laws passed by democracies are sometimes described in this way).  Legitimacy by performance : if the outputs of a process lead to results that satisfy people, then that process can gain legitimacy (eg. successful dictatorships are sometimes described in this way).  Legitimacy by participation : if people participate in choosing an outcome, they are more likely to consider it legitimate. This is similar to fairness, but not quite: it rests on a psychological desire to be consistent with your previous actions.    How this applies to building & funding public goods. My view is that legitimacy is an end in itself, but it is also a means to further our mission. So in this post, I plan to talk about how the DAO could build the legitimacy of a pluralistic scale infrastructure for funding public goods, inclusive of GitcoinDAO (but also respecting a need for pluralism - there are other great mechanisms that will build/fund public goods in the 21st century).  legitimacy by brute force I do not think that legitimacy by brute force is a good thing for the DAO to pursue, as much of our target market is building towards more teal organizations.   Brute force is not an effective motivator of people in these types of structures.  legitimacy by continuity & legitimacy by performance I think that much of our ongoing work is bootstrapping legitimacy by continuity and legitimacy by performance.  GitcoinDAO has delivered $50m of funding for OSS so far, and legitimacy by continuity would confer that that we will continue to do, thereby bootstrapping legitimacy by performance. I consider Gitcoin to be a 2sided marketplace where builders of public goods can find funders of public goods and visa versa.  Marketplaces are famously hard to bootstrap, as they are subject to chicken-egg effects (you need builders to attract funders, you need funders to attract builders, etc), and I have a big chip on my shoulder from 2017 trying to get Gitcoin off the ground + being told I probably wouldnt be able to pull it off my a few famous VCs.  Luckily, we’ve since proven those naysayers wrong, and I believe that as our network effects begin to spin faster and faster, that our legitimacy by continuity and legitimacy by performance will continue to compound.  What was once a headwind is becoming a tailwind.  legitimacy by participation I think that legitimacy by participation  is one of the most important parts of the Quadratic Funding Mechanism.  It really builds credibly that the results of every Gitcoin Grants Round aggregate the preferences of 10000s of people. An aside: since voter turnout in digital democratic systems is often very low, i wonder if systems that generate signal (governance direction) but dont feel like voting will be a breakout category. Quadratic Fudning is perhaps just an early breakout case of this. One other way we build legitimacy by participation  is by showing love, respect, kinship with, and participation in other public goods mechanisms out there.   Just as ETH client diversity is important, so too must GitcoinDAO respect the need for pluralism of mechanisms/projects that create public good.  In the coopetition between mechanisms that create public good, a greater, more compounded public good will emerge - and this is a feature not a bug.  One recent tangible example: I made a point to embrace the recent GIVEconomy launch as much as I could. Another tangible example: Running Sustainweb3 with Radicle back in 2020. A final tangible example: Scott Moore, who is my cofounder at Gitcoin now, ran a project called Git Token before Gitcoin.  We became friends in 2017 through our mutual love of open source software.  A third way we can build legitimacy by participation  is by making GitcoinDAO as accessible to contribute to as possible.  We’ve made strides here with the recent launch of http://gitcoindao.com/ and with all of the activity in the Discord, but more work remains to help onboard, orient, and retain would-be DAO contributors.  legitimacy by process I think that we are still building our legitimacy by process  at GitcoinDAO.  Three important things I would like to see  the FDD building credibly neutral, fair, community governed processes for managing disputes & rules against sybil resistance.  This will reinforce legitimacy by process. the dGrants workstream building dGrants such that it is the primary QF mecahnism we use, will create legitimacy by process.  When the communities we serve no longer have to rely on a centralized Grants tool, that will reinforce legitimacy by process. By having GTC holders govern GitcoinDAO/Gitcoin Grants, and GTC holders being a member of the communities served by QF, that creates legitimacy by process.   legitimacy by fairness Through the above processes I believe that we should ask hard questions about how we are building (or not) the DAO’s legitimacy by fairness. In a way, I am not in a strong position to address the DAO’s legitimacy by fairness.  As the og founder of Gitcoin, I have an extremely privileged & birds eye view of the DAO’s fairness.  I believe that everyday members of the DAO should chime in & speak up as to where they think we have (or do not have) legitimacy by fairness. That said, I will say that in many cases, that QF as a mechanism, and therefore Gitcoin Grants approximates fairness at scale in very elegant ways. In others, they do not or it may be more ambiguous depending upon your vantage point  Compounding Total Legitimacy  One thing I’ve always been very proud of with Gitcoin is that we have both a strong ethos of traction AND of social good ethos. I really just think it’s so important to stay in the center of this venn diagram because traction and social ethos compound the legitimacy of one another.  Screen Shot 2022-01-08 at 12.07.24 PM996×670 17 KB   If we had traction, but not a strong mission orientation, we’d just be another project that is gaining adoption but isnt good for the world.  Hank_Scorpio1440×1080 138 KB   If we had a strong mission orientation, but not traction, we’d be ineffectual.  One of the brands I really look up to that I think does this really well is Tesla.  BQwukuZwwwXrg27B9Le2Q62268×1688 83.5 KB   Tesla’s mission is to prove that electric vehicles are viable & jumpstart the market moving towards electric vehicles (which pollute the environment way less). This mission is backed up by a great product with strong traction, especially a large market, R&D, + go to market execution. Together, the legitimacy provided by both of these things really compounds to create much more legitimacy than the sum of its parts.  Translating the story of this venn diagram & the example of Tesla back to Gitcoin, I think that  Gitcoin’s mission is to build & fund public goods - a clear sociacl good. Gitcoin is a community of developers (who are kingmakers in a world where software is eating the world).  Because of that, we help create traction for the 100s of DAOS + ecosystems we serve. Together, the legitimacy provided by both of theese things really compounds to create much more legitimacy than the sum of its parts.  When you are perceived as white hot with momentum + with legitimacy, there are many many opportunities that open up to you.   Feedback welcome Clearly, as Gitcoin Grants grows, there is iteration to be done to build legitimacy (and protect against threats to that legitimacy.   This post is only the vantage point of one person.  I’d be curious:  What did I miss? What did I get wrong? What did I get right?  ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-vision-for-a-pluralistic-civilizational-scale-infrastructure-for-funding-public-goods/9503",
                        "https://gitcoin.co/mission",
                        "https://gov.gitcoin.co/t/a-vision-for-a-pluralistic-civilizational-scale-infrastructure-for-funding-public-goods/9503",
                        "https://en.wikipedia.org/wiki/Teal_organisation",
                        "https://gitcoin.co/results",
                        "https://www.investopedia.com/terms/n/network-effect.asp#:~:text=The%20network%20effect%20is%20a,military%20and%20some%20research%20scientists.",
                        "https://wtfisqf.com/",
                        "https://twitter.com/owocki/status/1441415242009886723",
                        "https://twitter.com/owocki/status/1478748803238744071",
                        "https://www.investopedia.com/terms/c/coopetition.asp",
                        "https://www.youtube.com/watch?v=2eWE667bc3I",
                        "http://web3.sustainoss.org/",
                        "http://gitcoindao.com/",
                        "https://gitcoin.co/discord",
                        "https://twitter.com/owocki/status/1469283258617630723",
                        "https://gov.gitcoin.co/t/to-the-web3-farsi-speaking-community/9408",
                        "https://twitter.com/GitcoinDisputes",
                        "https://gitcoin.co/mission",
                        "https://www.wsj.com/articles/SB10001424053111903480904576512250915629460",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-1-2022/9683",
                        "https://gov.gitcoin.co/t/discussion-gitcoin-visual-identity-branding/10023/4",
                        "https://gov.gitcoin.co/t/consent-of-the-governed-and-legitimacy-by-process-in-gitcoindao/9778",
                        "https://gov.gitcoin.co/t/a-dao-has-no-ceo/9852"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.004644660894661
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#2",
                    "likes": "0",
                    "time": "11/01/2022-06:03:36",
                    "content": "seems like vectorizing legitimacy is essentially what we’re trying to do with sybil scores. imagine this as being a big matrix L of shape NxD:   N=number of individual humans  D=numeric representation of each individual’s accumulated legitimacy scores. (maybe 6? because vitalik claims there are 6 ways to gain legitimacy)  i think it’s cool to think of it in this way, imagine each DAO wants to determine the sybil score of an individual, but each DAO values different types of legitimacy more. for example:  legitimacy accumulated by brute force might have a negative weight legitimacy accumulated by performance might be a large positive weight  we can say this weighting is a column-wise vector s of shape Dx1. Each DAO kinda has their own s vector (and might be tuneable via simulation). of course, there are infinite ways to describe this problem, but i like this version because if you vector-matrix multiply: s * L = scores then you get an output scalar weighting for each individual (1xN) relative to the DAO who’s s vector is used. you can do a lot of cool stuff by just tweaking the s vector and seeing how scores is affected. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5254329004329
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/01/2022-23:05:24",
                    "content": "Great post, really like this articulation:     owocki:  I believe that as our network effects begin to spin faster and faster, that our legitimacy by continuity and legitimacy by performance will continue to compound.   And this one:     owocki:   we have both a strong ethos of traction AND of social good ethos.   I hope (and am confident!) we can continue to build on the strengths we have to accomplish even more in the coming quarters and years. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.351190476190476
                }
            ]
        }
    ],
    "group_index": "658"
}