{
    "poll_list": [
        {
            "id": "QmdLNbbE4CHPwyhfsqjj1qzst2NFjXS6Ax3moqWwgVWjQa",
            "title": "[Proposal] Ratify the Results of Grants Round 10 and Request the Community to Payout Matching Allocations ",
            "discussion": "",
            "body": "We ask our Community Stewards to ratify the GR10 payout amounts as being correct, fair, and abiding by community norms, including the judgements and sanctions made by the Anti-Fraud Workstream.\n\nPlease vote FOR or AGAINST\n\nFOR You ratify the results as reported by Gitcoin Holdings & the Anti-Fraud & Collusion workstream and request the keyholders of the community multi-sig* to payout funds according to the GR10 Final Payout Amounts posted in the governance forum proposal here (tab 3, gid #1499217137): https://docs.google.com/spreadsheets/d/1xD6XW4tJ7e9Fkvti-WflkS-MxOggKzEmkVrzHpLB_q0/\n\nAGAINST You do not ratify the results and request keyholders of the community multi-sig wallet to delay payment until further notice.\n\nFor further info see here: https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-10-and-formally-request-the-community-multi-sig-holders-to-payout-matching-allocations/7832",
            "choices": [
                "FOR",
                "AGAINST"
            ],
            "scores": [
                1864642.594119378,
                4076.711776605006
            ],
            "start": 1626298200,
            "end": 1626730200,
            "snapshot": "12827445",
            "state": "closed",
            "author": "0x5BA02f4Ff6Af1d9d2Af8774D10fD32Eb57d4E2E6",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-ratify-the-results-of-grants-round-10-and-formally-request-the-community-multi-sig-holders-to-payout-matching-allocations/7832",
            "title": "[Proposal] Ratify the Results of Grants Round 10 and Formally Request the Community Multi-Sig Holders to Payout Matching Allocations ",
            "index": 7832,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "18",
                    "time": "09/07/2021-21:19:20",
                    "content": "GTC Proposal - (VOTE OPEN NOW on SNAPSHOT) Ratify the Results of Grants Round 10 and Formally Request the Community Multi-Sig Holders to Payout Matching Allocations We ask our Community Stewards to ratify the GR10 payout amounts as being correct, fair, and abiding to community norms, including the judgements and sanctions made by the Anti-Fraud Workstream. Review the Grants Round 10 Governance Brief To payout the matching allocations from Grants Round 10, we need the stewards to ratify the matching allocations. This comes with the extra responsibility of ratifying the decisions made by Gitcoin Holdings and the Anti-Fraud & Collusion workstream of GitcoinDAO. To make the payouts in a timely manner, we would like to suggest voting on Wednesday, July 14th*. Here are the need to know items:  The round totals on the site are not adjusted for anti-sybil measures.  In response to a few requests to make the data easier to read. We’ve updated this new version with the Blockscience fraud detection and Gitcoin results side by side (data is the same): Grants Round 10 Final Payout Amounts* *Feel free to comment directly on the sheet.  The total fraud tax for GR10 was $14,350, down over 50% from GR9  The fraud tax is the difference in allocations before and after the sybil account contributions are deactivated from matching eligibility.   Grant Approval, Grant Disputes, and User Sanctions are now determined by the Anti-Fraud & Collusion workstream with oversight from the community. Ratifying the decisions of the Anti-Fraud workstream does not create new policy. There will be opportunity to discuss their decisions in depth and ratify new policy prior to GR11.  The defensive measures taken to protect against fraud and collusion had incredible results. This may have been partly because of the community involvement and oversight. While there is still more work to be done in progressively decentralizing the grants platform, ratifying this round’s closure will set a precedent for trusting, but verifying the workstream’s decisions. (Similar mechanism design to an optimistic roll-up). Please vote FOR or AGAINST FOR You ratify the results as reported by Gitcoin Holdings & the Anti-Fraud & Collusion workstream and request the keyholders of the community multi-sig* to payout funds according to the Grants Round 10 Final Payout Amounts the non-custodial GR10 deployment contract. AGAINST You do not ratify the results and request keyholders of the community multi-sig wallet to delay payment until further notice. *This allows for 5 days of deliberation from today, 7/9/21 until 7/14/21. Round totals for before and after defensive measures will be added here on Monday 7/12/21. ** The Ethereum ecosystem is governed by the community multi-sig which we intend to transfer to the GitcoinDAO treasury once select criteria has been met. For questions, comments or concerns on any of the above, please comment below or join the Gitcoin Discord! ",
                    "links": [
                        "https://gitcoin.co/blog/gitcoin-grants-round-10-governance-brief/",
                        "https://medium.com/block-science/evaluating-the-anti-fraud-results-for-gitcoin-round-10-cec9277ce5b2",
                        "https://docs.google.com/spreadsheets/d/1xD6XW4tJ7e9Fkvti-WflkS-MxOggKzEmkVrzHpLB_q0/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1xD6XW4tJ7e9Fkvti-WflkS-MxOggKzEmkVrzHpLB_q0/edit?usp=sharing",
                        "https://discord.gg/cD6RKWjZ6g",
                        "https://gov.gitcoin.co/t/expected-timeline-for-completion-ratification-and-payout-of-gr11-matching-funds/8673",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-4/8005",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-3/7876"
                    ],
                    "GPT-summary": "The post is a proposal for the ratification of the results of Grants Round 10 and a request for the community multi-sig holders to payout matching allocations. The proposal explains the need for ratification and provides details on the anti-fraud measures taken during the round. The post also invites comments, questions, and concerns from the community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.016699250570218
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#2",
                    "likes": "3",
                    "time": "09/07/2021-22:24:50",
                    "content": "    DisruptionJoe:  Review the Gitcoin Grants Round 10 Governance Brief here   Hi @DisruptionJoe I hope you are doing well. To see the Round 10 Governance Brief, we need an authorization from Google looks like. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/07/2021-13:57:54",
                    "content": "Wrong link! The governance brief is here: https://gitcoin.co/blog/gitcoin-grants-round-10-governance-brief/ It has been updated in the post ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#4",
                    "likes": "1",
                    "time": "12/07/2021-21:05:40",
                    "content": "How can we see how much is the fraud tax for each grant? So a comparison before/after the algorithm runs for each grant? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/07/2021-21:11:57",
                    "content": "It is in the Blockscience reference materials. This is the full study overview This is the before after comparison ",
                    "links": [
                        "https://www.dropbox.com/s/ezl2ku5nvr2yuhi/r10_grants.csv?dl=0"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#6",
                    "likes": "2",
                    "time": "14/07/2021-01:54:12",
                    "content": "The ‘before and after’ comparison is a CSV file with the follow header: grant, modified, total_amount, match, funding, funding_diff, relative_funding_diff, include_filter, max_payout  Is there any further information about what these fields mean and how they were derived? I don’t see that on the study overview. Also, any information on the rows of data? It’s hard to tell, but it seems each grant has three rows of data. Is there an explanation of that? I wouldn’t normally ask, but my row (TrueBlocks) has an entry that looks differently to others (it has true in the include_filter field), so I’m wondering why. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.913194444444445
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#7",
                    "likes": "2",
                    "time": "14/07/2021-18:06:42",
                    "content": "I’ve gotten a few requests to make the data easier to understand. I’ve cleaned up this version with the Blockscience fraud detection and Gitcoin results side by side and a separate sheet showing before and after with the payout amounts. Grants Round 10 Final Payout Amounts Feel free to comment directly on the sheet. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#8",
                    "likes": "5",
                    "time": "14/07/2021-18:14:02",
                    "content": "Reply from Danilo below. Looks like it wasn’t used. I can’t speculate on what it was, but looks like a thresh-hold of some sort.  Do you have his contact info? I also updated the original post with a sheet that has both of the results in an easy to read side by side. A - grant identifier (can be duplicated) B - scenario (modified=False is the original data & modified=True is what happens when contribs from sybil users are removed. If blank, then this is related to the comparison between scenarios) C - Sum of raw contributions (USDT) D - Quadratic Match E - Quadratic Funding (USDT) F - Difference between fundings on the two scenarios (USDT) - associated with Fraud Tax per Grant G - Share of F in relation to E (original scenario) H - not used I - max between E for the two scenarios ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.948260073260073
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#9",
                    "likes": "1",
                    "time": "15/07/2021-00:45:22",
                    "content": "This is great. Exactly what I was looking for. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wschwab",
                    "index": "#10",
                    "likes": "0",
                    "time": "15/07/2021-08:22:05",
                    "content": "why did DeFi Latam vote against? I’m not sure what their tag is here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#12",
                    "likes": "0",
                    "time": "15/07/2021-14:57:35",
                    "content": "There was a dispute on the Commons Simulator (Grant 277) being included in the LatAm sub-round for $50,000. The decision made was that the grant could stay in the category because it had existed since round 4 and had always been in LatAm, this is just the first time there was a pool dedicated to that region. The owner didn’t switch the region when the pool was announced. We also advised that while we think this was the proper way to handle this round, we advise the stewards to consider how we can define the policy to better achieve the intended outcomes in the future. (The policy updates will happen before the next round.) The Definitions subgroup that works on policy thought that it would be inappropriate to disallow them from GR10 by changing policy mid-round. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#13",
                    "likes": "2",
                    "time": "17/07/2021-07:59:47",
                    "content": "I will vote for the ratification as I don’t see anything wrong. But what I don’t like is that I feel kind of powerless to understand exactly how/why the differences in the payouts are as they are. I was in the calls and heard the Blockscience guy explain but I might be stupid as I still don’t totally grok it. The differences in most grants are minuscule except for the edge ones. Then the question would be what can these grants do to improve the situation in the future? Or is it (as is my understanding) completely out of their hands? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.805555555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#14",
                    "likes": "1",
                    "time": "17/07/2021-13:34:16",
                    "content": "It’s mainly a transparency question or aspect. From what I’ve seen in the spreadsheet, many amount has been overpaid or in some case underpaid (very few) from what I understand. At the same, I really think it’s great to see that this process has been reviewed and audited and some difference has been found. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1722222222222225
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#15",
                    "likes": "4",
                    "time": "19/07/2021-14:19:05",
                    "content": "I do understand that the calculations kind of feel like a “black box” at this point. Our goal with the anti-fraud workstream will be to make sure the data and calcs can be run and verified by the community in the near future. We will post the list of users to disable from matching benefits and let the greater wisdom of the community find error or issue. It will take more time before that is fully enabled. A problem now is that we are working to build the decentralized grants tech (dGrants) so it is not likely that we will have cycles to document the data structures of the “legacy” version. We also must consider that as long as Gitcoin Holdings has centralized servers hosting any data, they also maintain liability for that data. I think this round the vote to approve is saying something like “We recognize the Gitcoin team has had sole control over this in the past (and still does). We approve the methodology and intentions used and appreciate the direction the team is moving to decentralize this aspect of the system. The oversight and mechansism aren’t perfect now, but to get payments out and not have perfect be the enemy of good, we approve.” This will probably still be true for GR11. We will improve, but not have it perfect. I expect that each oversight and decision making mechanism will be improved both in documentation and execution. The goal would be to have strong mechanism design in place when the time comes to fully decentralize the technological architecture hosting grants along with the political power and decision making in a way that is verifiable through open-source software. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.717592592592593
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#16",
                    "likes": "1",
                    "time": "19/07/2021-14:19:44",
                    "content": "Thanks for taking the time to thoughtfully interact through this process. It’s nice to see. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.000000000000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#17",
                    "likes": "2",
                    "time": "24/07/2021-02:31:20",
                    "content": "Just a quick note here on the decision to use ‘graduated sanctions’ in this case. I think that was a good idea. One of Elinor Ostrom’s tenets is that sanctions should be graduated – small at first and increasingly larger as time goes on and the undesirable behavior doesn’t correct itself. In this case, I’m sure it was an oversight/mistake, so no sanction was warranted. If the group doesn’t correct it for Round 11, then the dispute may resolve in a different way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#18",
                    "likes": "2",
                    "time": "07/09/2021-17:20:20",
                    "content": "    DisruptionJoe:  The Definitions subgroup that works on policy thought that it would be inappropriate to disallow them from GR10 by changing policy mid-round.   This is logical.  The ‘Commons Stack’ (CS) has a few longstanding grant applications with Gitcoin.  And they are an altruistic organization doing good work!  Full disclosure, I am a trusted seed (approved member) of the CS. while Ostrom suggests graduated sanctions our current appeal policy is rather binary.  Either a grant gets approved or it does not.  There is an entire Gitcoin User Policy under development which imo should house the graduated sanctions to be issued for contraventions of user policy.  I see don’t see a real spot for gradation of the appeals process unless we consider having graduated levels of appeal available to grant applicants (which is my suggestion). There are huge growing pains right now as the decentralization process matures.  This was expected and tolerable.  Joe has a great perspective:  We must not let the striving for perfection destroy the good system we currently have.  It is continually improving. Accordingly, I support ratification. disclosure:  I am part of the Gitcoin Dao Fraud Detection & Defense (FDD) workstream. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.253571428571428
                }
            ]
        }
    ],
    "group_index": "531"
}