{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/discussion-dgrant-solution/9023",
            "title": "Discussion: dGrant solution ",
            "index": 9023,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#1",
                    "likes": "8",
                    "time": "13/11/2021-05:31:12",
                    "content": "Decentralized Grants Verification Challenges we are facing now:  Grants review manually is becoming unrealistic by a small team Community is not encouraged to be involved in the grants verification process  Decentralising Grants Verification:  Grants legality is governed by the whole community Community is incentivized with GTC to be involved in the grants verification process  Possible process:  Community members are promoted to “Watcher” once they have any of DID verified (POH, POAP, BrightID and so on) Any “Watcher” has the right to “Flag” a suspicious grant submission with X*GTC deposit and detailed reasons The challenge details are sent to “Gitcoin Grant Court” in Kleros (decentralized dispute resolution) to get the challenge result If “Watcher” is flagging a malicious grant submission successfully he will get the deposit back and Y*GTC rewards If “Watcher” is flagging a legit grant submission as suspicious he will lose the staked X*GTC The grant will be removed if it is successfully identified by “Watcher”  The effects we get from this solution:  Grants are governed by the whole community in realtime globally Community is incentivized with Y*GTC each time flagging malicious grants submission It is an effective deterrent security protection from spam/scam grants submission  Future expansion:  It could be applied to dBounty as well It could be expanded to any modules of GitcoinDAO which requires monitoring and curation  Support needed from GitcoinDAO:  Detailed grants policy documents GTC funds to be rewarded to successful “Watcher” and to be sent to “Gitcoin Grant Court” as arbitration fees GitcoinDAO members tier implementation for “Watcher”  Possible difficulties:  Gas fee keeps high on Mainnet Often adjustment of XGTC and YGTC if the price of GTC is changing too much  ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-21/9209"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1567669172932336
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#2",
                    "likes": "2",
                    "time": "15/11/2021-01:44:11",
                    "content": "I love this proposal, although the name should be changed bc dGrant is used for decentralized grant in workstream. Maybe we could integrate this proposal in Decentralized Gitcoin stream, so @phutchins and @DisruptionJoe what are your thoughts? I heard that Gitcoin Core team has collaborated with PoH team before, while in this proposal we could use GTC as staking and incentive for GitcoinDAO users (community members). @owocki any insight for this proposal? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "2",
                    "time": "16/11/2021-20:07:08",
                    "content": "The FDD workstream is currently managing the policy and evaluation of grants for approval to different rounds. The dGrants product needs to be integrated to our current process as well as these forward looking solutions. There are multiple options for how we prioritize. Let’s connect with @phutchins and @Sirlupinwatson around how to move this forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/11/2021-20:08:25",
                    "content": "Can you ping me on discord Ianian ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#5",
                    "likes": "1",
                    "time": "16/11/2021-20:11:27",
                    "content": "Hi @lanlan3322! Thanks for your feedback, highly valuable!     lanlan3322:  Grants review manually is becoming unrealistic by a small team   Right now we have 2 separate decentralized squads working on to review each grants under 24/48 hours delay. We had the first “Splitting Squad” on the first of November I think.     lanlan3322:  Community is not encouraged to be involved in the grants verification process   I think the community is highly encouraged to be involved in the grants verification process, we are actively getting more user and contributors involved in that part only.     lanlan3322:  Any “Watcher” has the right to “Flag” a suspicious grant submission with X*GTC deposit and detailed reasons   This is already possible to “Flag” a grant, once a grant has been “Flagged” we will carefully review it. Any member of the community can “Flag” a grant. @David_Dyor can tell you more about that process since he’s building up the policy’s. We are also planning on creating an interface UX-UI to review these grants, either on dGrants or on Gitcoin. Feel free to jump in the conversation on Discord or we can keep this post up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.805026455026455
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#6",
                    "likes": "3",
                    "time": "17/11/2021-14:39:31",
                    "content": "Unless Y is very significantly larger than X, I for one would not participate due to a natural human tendency to prefer pain avoidance over reward. A slightly different way to state this so that it’s very clear would be to change Y to 3 * X and change the amount lost due to an incorrect identification to .1 * X. Summary “Watcher stakes X GTC and, if correct, receives 3 * X reward. If incorrect the Watcher forfeits .1 * X and received .9 * X refund.” This sounds simultaneously more rewarding on correct identification and less punishing on incorrect identification. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.406666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#7",
                    "likes": "2",
                    "time": "18/11/2021-04:28:49",
                    "content": "I agree this general direction is desirable.   There is some progress already and I look forward to continuing the discussion.  We (the Fdd) have been talking to a project already (Celeste) but the goal is to have a modular system where a variety of court-like systems can fit in.  As for policy, all docs are migrating to Gitbook where current versions will be accessible to everyone. The FDD also developed an appeals procedure intended to be used with the future iteration of the grants program.  I can see being used after the ‘marking’ process you describe.  In the legacy version of grants what you call marking was called flagging. Would like to see a short gamified training quest for the ‘Markers’ much like the Grant Evaluation Squads receive a small amount of training.  In the legacy system anybody had the ability to mark/flag a grant.  Even members of the public.  Sometimes industry folks like to squeal on each other.  I would like to see that preserved somehow.  Lots to discuss and I look forward to meeting you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#8",
                    "likes": "2",
                    "time": "19/11/2021-03:15:40",
                    "content": "Thanks for your detailed clarifications. We are perfectly ok right now but if we see the future when there are 100+ or even 1000+ submissions (who knows it is not happening?!   ) the review pressure will be hard to handle by dedicated members. Instead, it will be easier to hand over to all members in the system. For now, the community is basically involved by “Goodwill” and there could be a more sustainable way to keep encouraging members to join the mission with a proper incentives system established. The present “Flag” function is easily attacked without any protection. Malicious actors would do irresponsible flagging to overload our review teams. To align with GitcoinDAO concept we could build these small DAO components which will eventually stack up a whole DAO system.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.82390873015873
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#9",
                    "likes": "0",
                    "time": "19/11/2021-03:21:28",
                    "content": "Exactly, totally agree with you. We need to work out a better way and put the managing factors in DAO process which could be discussed and then applied via smart contract forcefully without human interaction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#10",
                    "likes": "2",
                    "time": "19/11/2021-03:29:28",
                    "content": "Thanks, I am looking forward to working out a gamified module on this. FDD is the first perfect place to realize this DAO-like component. Internet of jobs should be incentivized based on valuable contributions and there should be certain penalization on hostile actions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.080357142857143
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#11",
                    "likes": "0",
                    "time": "22/11/2021-02:17:47",
                    "content": "In order to keep the discussion record I copied Joe’s comments from discord here: //Start of msg from discord So we have a manual review process now, but it needs to be better than that. There was a curation interface made for this which could be lightly adjusted. I’m not sure if all these steps are necessary, but I think they are at first glance   update and plug in the curation game interface but only so whitelisted reviewers and leave reviews   Open up to anyone to review (maybe staking) and compare results of whitelist to the open one   add in functionality to better create thresholds for participation and test them.   connect the outcome of reviews to directly activating ir shutting off grants match eligibility for rounds. (Previously done manually based on reviews done in the game)   //End of msg from discord Thanks @DisruptionJoe ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.261904761904762
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#12",
                    "likes": "0",
                    "time": "22/11/2021-02:29:57",
                    "content": "Thanks, which channel should i join for dGrant discussion? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#13",
                    "likes": "2",
                    "time": "22/11/2021-18:37:13",
                    "content": "I propose we use the dgrants-feedback channel.  Gitcoin Started a discussion there.  Note we are planning to use Celeste for the external conflict resolution step, not Kleros, however the goal is to enable any similar project to be used.  Aragon Court is another possibility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#14",
                    "likes": "0",
                    "time": "23/11/2021-01:01:42",
                    "content": "Thanks, but I don’t have access to dGrant-feedback channel. yap, More options provide more resilience for the system, just like uniswap provides options for users to choose which token list to show. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#15",
                    "likes": "2",
                    "time": "25/11/2021-03:45:27",
                    "content": "Just had a quick check on Celeste and it is using Aragon Court actually:  1hive.gitbook.io    Documentation Developer documentation         GitHub    GitHub - 1Hive/celeste-backend: Backend services for Celeste 🪐 Backend services for Celeste 🪐. Contribute to 1Hive/celeste-backend development by creating an account on GitHub.      ",
                    "links": [
                        "https://1hive.gitbook.io/celeste/developers/documentation",
                        "https://github.com/1Hive/celeste-backend",
                        "https://github.com/1Hive/celeste-backend"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/willjgriff",
                    "index": "#16",
                    "likes": "3",
                    "time": "25/11/2021-14:09:17",
                    "content": "That’s correct. If between us we build an interface for the Gitcoin DAO proposal process with Celeste, it should interface fairly easily with Aragon Court too. However, note that Celeste lives on xDai and soon Polygon and Arbitrum, where as Aragon Court lives on the Ethereum mainnet so depending on where the Gitcoin DAO proposal process lives (I believe it is on Ethereum mainnet), there may also be bridging infrastructure necessary. For reference I work at 1Hive and on the Celeste Smart Contracts fork from Aragon Court. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.07936507936508
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#17",
                    "likes": "1",
                    "time": "28/11/2021-07:50:02",
                    "content": "Thanks @willjgriff , I am glad to join this task if there are any needs. I think independent dispute resolution is more logical in DAO. The guardians of the constitution are not affected by governing voting power. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.45
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wkarshat",
                    "index": "#18",
                    "likes": "1",
                    "time": "04/03/2022-06:41:40",
                    "content": "The ratio of the reward and punishment needs to be compared to the prevalent rates of false negatives [faulty grant application getting approved]. For example, you propose a ratio of 30:1, and if the rate of false negatives is 5%, it may pay to simply flag every grant. Unfortunately we may not have very precise empirical numbers for false negatives, and not only because the criteria are somewhat vague, given the entire range of grant applicant and subject matter possibilities, and the judgements are inherently subjective. With various grant subtypes and a range of possible failing criteria, somewhat unevenly distributed over time, it is not immediate how to map any set of secondary evaluations to the entire population of the grant applications. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.297916666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shahid1956",
                    "index": "#19",
                    "likes": "0",
                    "time": "01/05/2022-08:42:42",
                    "content": "Well thought proposal. Involving   Gitcoin community in verification is a good idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                }
            ]
        }
    ],
    "group_index": "610"
}