{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/pausing-gitconnect-for-northern-hemisphere-summer/10809",
            "title": "Pausing Gitconnect for (Northern hemisphere) Summer ",
            "index": 10809,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "good-vibes",
                "People-Ops",
                "contributors"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/puncar",
                    "index": "#1",
                    "likes": "1",
                    "time": "05/06/2022-19:04:03",
                    "content": "Hi all Gitcoiners, I want to let you know that we will be pausing Gitconnect for the summer due to very low attendance and revisiting its setup for relaunch in the fall.  But in the meantime, I would like to get some suggestions from you on improving gitconnect. A brief overview of Gitconnect It’s hard to create strong bonds with colleagues while just working. The online environment does not enable many opportunities to have a watercooler chat or grab lunch together. And we are people; we are social creatures, and we need connections with other humans. How do we enable human-to-human connection in a virtual environment? I don’t know, but we need to try; one of the experiments has been virtual gitconnect; up to 5 people group meeting with no agenda, just set time to hang out. Did it work? Yes, the limitation of five people enables everyone on the call to be engaged. And the discussions were very engaging, and the topics were super interesting. But, from around 100 invitees, we got ten individuals ever joined this call, and nobody has joined the last one. There are various reasons why people have not joined, and that’s why I want to take a step back and ask you for feedback and suggestions. I believe together; we can launch a new version of gitconnect that will make our community stronger and more connected. Please add your suggestions in the comment below , and have a great summer.  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.89297138047138
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "1",
                    "time": "07/06/2022-03:40:20",
                    "content": "hmmm. dao vibes (every weds at 10am MST) has no agenda, last for an hour and usually draws about 200 ppl.  you can find recordings of dao vibes on youtube. maybe worth discussing there?  or continuing the momentum for gitconnect there? not as intimate as gitconnect tho ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                }
            ]
        }
    ],
    "group_index": "125"
}