{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-as-a-generator-function-for-coordination/10078",
            "title": "GitcoinDAO as a generator function for coordination ",
            "index": 10078,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "4",
                    "time": "15/03/2022-13:35:51",
                    "content": "In math & computer science, a generator function is a mathematical function that generates other functions. I want to talk about why I am starting to think about GitcoinDAO as a generator function for protocols, DAOs, and public goods - GitcoinDAO is a generator function for coordination… In 2017, when we launched Gitcoin, it was just one product, a bounties platform. Bounties are a mechanism where you can post a task to do X and put up Y tokens as a prize. The Gitcoin Universe looked like this:  1094×726 39.2 KB  In 2018 & 2019, we built or acquired a few new products and things began to look like this:  1066×614 43.2 KB  These products were:  Kudos - an NFT for showing appreciation to contributors. Labs - an incubation studio for advanced web3 concepts. Ethical Ads by CodeFund - an ethical ad network for funding open source. Quests - a quiz/video game based way to do onboarding to web3. Grants - a crowdfunding platform.  What’s really neat is that some of these products started creating their own products or funding/partnering with other quality products in a way that’s really meaningful.  1184×934 54.5 KB  Products also began evolving during this time. When we were thirsty for revenue during The Great Bear, we repackaged Bounties as Hackathons - something we knew that developers knew how to use and marketing departments knew how to pay for. As 2019 turned to 2020, this evolution accelerated:   Products began to fail.   Kudos & Quests began to fade.   Labs spun out of Gitcoin.   CodeFund did not make it.   Products began to evolve.   Hackathons subsumed bounties.   Vivek spun up KERNEL - a web3 native university/accelerator.   This is what we put our energy into during 2020, and the resultant portfolio of impact.  1132×806 73 KB  As this happened, we started to conceive of what Gitcoin would be when it grew up. A few tangible things that came out of that.  We began plotting our spin out from Consensys. We began laying groundwork for the GitcoinDAO. We began to think of ourselves as a generator function of coordination - specializing in DAOs, protocols, and public goods.  Oh and during that time, more great projects kept coming out of Grants, Hackathons, and now KERNEL!  1310×914 73.8 KB  At present day, Gitcoin has funded 14k hackathon projects, 3k grants, 1000 KERNEL alumni. As of March 14 2022, Gitcoin has helped 66,499 funders reach an audience of 292,275 earners. Gitcoin has facilitated 1,732,175 complete transactions to 10,212 unique earners. 2020 was the start of that - It was during this time that I started to conceive of Gitcoin as a generator function of projects. And as we started to conceive of GitcoinDAO, how that could be a generator function for DAOs, ecosystem development, developer talent, and public goods. Fast forward to today, GitcoinDAO has launched and has generated several new workstreams, each with products of their own (highlighted below in bold).  1418×932 128 KB  I think this story gets even cooler when you take into account how ecosystem-forward Gitcoin is. I’ve denoted projects in blue that we have positive relationships with, and projects in pink that have funded Gitcoin Grants + joined the Funders League. Add those to the projects in black. I wonder what a world in which there were social, technological, or token interop with this ecosystem looks like.  1600×1015 152 KB  One thing thats quite remarkable when you start to try to articulate our impact, is that our impact is already quite decentralized! Of course, the DAO should continue to push on decentralizing KERNEL and decentralizing Grants as well as the governance of the public goods oriented products. In summary, GitcoinDAO is a generator function for new coordination - protocols, DAOs, and public goods - GitcoinDAO generates net-new coordination using Open Source technologies. We create value before we capture value. We build ecosystems. EDIT: a previous version of this post was titled “GitcoinDAO as a generator function for innovation”, it has since been updated to “GitcoinDAO as a generator function for coordination” ",
                    "links": [
                        "https://gov.gitcoin.co/t/kernel-evolves-a-new-leaf-for-gitcoin-dao/9912",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/gitcoin-ecosystem-flowchart/11173/6",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110",
                        "https://gov.gitcoin.co/t/the-donut-economy-x-8-forms-of-capital/10079",
                        "https://gov.gitcoin.co/t/where-is-the-fire-around-this-fire/10664",
                        "https://gov.gitcoin.co/t/roadmap-to-network-utility/10546",
                        "https://gov.gitcoin.co/t/our-flagship-product-is-gitcoindao/10081/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.686853288987436
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#2",
                    "likes": "1",
                    "time": "29/07/2022-15:10:46",
                    "content": "Very interesting post.  The fact that you posted the history of Gitcoin here helpes give context and it’s just cool to see it’s evolution and direction. I didn’t knew a lot of this stuff and it helpes because I only joined the DAO 1 year and a half ago and only became a regen in July 2020 when I joined 1Hive, I only understood what Gitcoin could be a little later down the road… Many people have the DAO of DAOs approach, but I think that a generator function is the same…maybe Gitcoin is a generator function of generator functions one day when math advances  … But, how could we make sure that this generator function keeps generating and resources are allocated properly? What makes a contributor to this system valuable?  Are they building the right things at the right time?   How do we know if the DAO is corrupt and drifting away? ( I think we saw this during 2021-2022 when people were kinda euforic-myself included probly) I guess that a lot of these answers will be the result of experimentation, experience and coordination( + right mindsend + values sprinkled on top ) Really curios what Gitcoin DAO will become in the next 10 years. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6703738512949045
                }
            ]
        }
    ],
    "group_index": "15"
}