{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/refactoring-gitcoin-what-falls-between-the-cracks/13026",
            "title": "Refactoring Gitcoin: What falls between the cracks? ",
            "index": 13026,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "community",
                "CSDO",
                "strategy"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#1",
                    "likes": "8",
                    "time": "21/02/2023-14:24:11",
                    "content": "We’ve come through a period of course correction as a DAO, and have seen a few major decisions recently taken: GPC is splitting into Passport and Allo Protocol. And FDD and DAOOps will dissolve, and S17 will be their final seasons. While difficult, I see this as overall very positive. We’re re-orienting the DAO around the products. Plans are already in place to move our support, fraud, and data analysis functions into the product teams. And as Kyle wrote up recently, all of this allows us to center our work around our most important things. These recent changes require additional work to be done to ensure operational continuity. Still, I’m confident that we have the right structures to enable us to continue to operate and evolve the DAO.  Tension: where are we still likely to see work that falls through the cracks? I think we have two areas of coordination that remain unaddressed in our DAO.   We are missing bottom-up ideation and participation. Outside of joining a workstream, there aren’t low-barrier onramps where our community can step in and contribute to shaping gitcoin. We have a tremendous opportunity with @ceresstation 's recent proposal to use the Grant Stack to invite our community to participate in a regular cadence of Gitcoin building Gitcoin rounds. These rounds can enable much of the work with no home in the current or future workstreams. This would be a massive win in terms of shifting the budgeting work away from stewards, workstream leads, and the ‘insiders’ into a public space that leverages our core product to do what it does best: elicit the will of the community to fund initiatives in a concave space.   From the other direction, we are missing the ability to execute on some narrower strategic areas, evidenced in our inability to move forward with revenue modeling, GTC utility, and similar deeply consequential but non-workstream specific tasks. I think these issues suffer from what Divya and Safron call “Shared Stagnation: Sacrificing progress for participation” in their CIP Whitepaper. Gitcoin’s current issue is that even if we employed the best in class “sense and respond” governance techniques, we would have no individual who is accountable for getting this work done. As such, it languishes in any number of gov posts attempting to move this discussion forward. I believe we should reorient our approach and opt to have narrower accountability structures to solve this.    Proposal: address the work that we’ve been missing along two tracks:   A broad bottoms up effort to source and fund the jobs the community wants done, and to use our amazing collective intelligence superpower of quadratic funding to make that happen.   A narrow, top-down accountability setting that finds leaders in the DAO to take on specific mandate to deliver on key strategic issues (i.e. revenue modeling, and GTC utility).   For point 1, please do read Scott’s proposal here. I think this is nearly in the ‘safe enough to try’ territory. For point 2, my assumption is that the individuals leading these efforts would be sourced from the DAO Core team. We would expect these folks to post regular progress reports in the forum, to solicit involvement from experts inside and outside of our DAO, and to run these topics to ground in the form of proposals that are ratified via Snapshot vote. We’ve had some precedent in the past for the top-down accountability with Kyle’s treasury diversification efforts. I’m of the opinion that the strategic work should follow a similar trajectory. Doing so would allow us to collectively remain focused on our most important things (Allo adoption and growth, and the Grant program), while still making progress on the topline strategic work that our existing team/responsibility structures have neglected. The shift here is one of process: are we ok to stop the leaderless, deliberative, and stagnant approach to these topics and move to assigning team members the mandate to lead the generation and ratification of these solutions? To the group: Does this resonate? What are the risks and trade-offs that you see? What safeguards would you want in place to make this safe enough to try? ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-building-gitcoin-using-quadratic-funding-for-subtraction/13015",
                        "https://cip.org/whitepaper",
                        "https://gov.gitcoin.co/t/gitcoin-building-gitcoin-using-quadratic-funding-for-subtraction/13015",
                        "https://gov.gitcoin.co/t/knowledge-transfer-the-gitcoin-hyperstructure/11335/10",
                        "https://gov.gitcoin.co/t/gitcoin-building-gitcoin-using-quadratic-funding-for-subtraction/13015/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.61495474222747
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Maxwell",
                    "index": "#2",
                    "likes": "4",
                    "time": "21/02/2023-18:28:18",
                    "content": "Thanks for putting this together, Kevin! Very thoughtful, and I couldn’t agree more. Fully supportive of these efforts. In particular, I’d love us to double down on @ceresstation’s recent post. Such an articulate post, and I think would be awesome for us to move forward with it. Regarding the leadership piece, I couldn’t of said it better. Sense and respond is all good and fun in theory and small orgs, but with multiple products with thousands of active users, we need decisive and accountable leadership that deliver results. In PGF, it’s been exciting to see folks take on more ownership and hold themselves accountable, and I’m optimistic this will spread throughout the DAO as we become new and improved in S17. Onwards and upward! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.342058080808081
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#3",
                    "likes": "4",
                    "time": "22/02/2023-03:07:00",
                    "content": "The Eisenhower Matrix sumamarizes this quite well (and there is some contention on if he developed this matrix, or just got the credit for it).  inline-leadership-eisenhower-matrix-2-2x1680×1722 48.9 KB  We certainly chase the urgent here at Gitcoin, not always the Important (I am guilty of this too!). I appreciate the intention of naming the progress (and lack there of), but I wonder how we actually make room for this for the folks you are chatting about (top down)? We already are getting heat about budgets being too large, and team sizes being too large, yet we find ourselves in a space where key folks are over burdened and under supported. I’m interested in determining how to empower more folks to own outcomes instead of staying idle and looking for direction. This is a bit of a rant, but the number of times people have come out and said “we don’t have a strategy!” but have done nothing to improve that situation is getting quite old. I actually wonder if the bottoms up approach may offer funding for experts to come in and pitch solutions to these problems. Anyway, open to ideas on how we might take some first steps here. ",
                    "links": [
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/2/2d6d6735b3916abf96c96528429003904fadf818.webp"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.797735760971055
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#4",
                    "likes": "2",
                    "time": "22/02/2023-08:33:03",
                    "content": "    kyle:  the number of times people have come out and said “we don’t have a strategy!” but have done nothing to improve that situation is getting quite old   You and me both. I see the issue as one of legitimacy and accountability. In the current deliberative format, any one person seeking to own a topic as consequential as strategy might be seen as illegitimate: who’s given this person the authority to own this issue? The forums have not proven to be effective at building up consensus opinions, and CSDO hasn’t been able to workshop it’s way through these topics either.     kyle:  We already are getting heat about budgets being too large, and team sizes being too large, yet we find ourselves in a space where key folks are over burdened and under supported. I’m interested in determining how to empower more folks to own outcomes instead of staying idle and looking for direction.   This is a great point, we might have leaders that are overloaded (I’ve been there) but we also need to be building the next layer of accountability in our teams to free folks up to take this work on. If this is through internal promotion, or hiring in, we need to have the capacity for this work. I would propose that it is less about organization capacity and more about a consensual process to give individuals that empowered outcome ownership. This is IMO classic agent/principle stuff, and I have some thoughts on why we have more agentic behavior over principle behavior in the DAO. Without solving that incentive misalignment though, I believe there are enough energetic and mission-aligned folks that we could progress topics if they were freed up to move through the work decisively. Lastly, I think the bottom up approach could yield amazing results, and would love to see a number of research efforts on topics that just aren’t getting attention. But for those to come through and be ratified as our core Business Strategy, Token Utility, etc. are a gamble, and we might still fall victim to the Shared Stagnation issues we have currently. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.463624338624339
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#5",
                    "likes": "6",
                    "time": "22/02/2023-11:00:48",
                    "content": "    kevin.olsen:  The shift here is one of process: are we ok to stop the leaderless, deliberative, and stagnant approach to these topics and move to assigning team members the mandate to lead the generation and ratification of these solutions?   This might be too simplistic of an assessment.  As a observer of the leadership structure, I would suggest we have had a series of issues related to lack of focus/direction, poor signaling, lack of delegation, and the absence of realistic bench development. What to do with this? Simple:  CSDO delegates critical gaps to realistically capable developmental resources to do the work on a timeline.  If performance does not meet expectations, have a hard conversation.     kyle:  We already are getting heat about budgets being too large, and team sizes being too large, yet we find ourselves in a space where key folks are over burdened and under supported. I’m interested in determining how to empower more folks to own outcomes instead of staying idle and looking for direction.   As with any downsizing “overburdening” gets worse as WSL and CSDO absorb work.  The primary expense-neutral options are to 1) stop work 2) build capacity in your teams 3) work longer hours.     kyle:  This is a bit of a rant, but the number of times people have come out and said “we don’t have a strategy!” but have done nothing to improve that situation is getting quite old   I am going to rant back.  Speaking for myself, in the last two weeks I have been paralyzed by fear.  Not fear for my job; I am retired, I work here because I want to.  But fear of wasting my time (ok and a bit of losing the job… Gitcoin is a great platform to work on solving DAO governance - my passon). Fear that my work:  does not matter / is not valued fear this work is not inline with other ideas somewhere else fear my work is going to be torpedoed at the 11th hour by some last moment dismissal  Yeah, I have been here before (in the old world) and I know how to manage.  I just need to write project plan, get stakeholder alignment, and move forward.     kevin.olsen:  The forums have not proven to be effective at building up consensus opinions, and CSDO hasn’t been able to workshop it’s way through these topics either.    Building consensus takes a lot more effort than posts on a forum I tend to think CSDO should be more delegatory vs. executional Consensus is the wrong orientation - we don’t need consensus, we need the opportunity to provide meaningful input (aside from the forum).  MMM has done this exceptionably well lately.      kevin.olsen:  I would propose that it is less about organization capacity and more about a consensual process to give individuals that empowered outcome ownership.   No, lets be realistic, its about capacity too.  To focus on “the most important things”, we have to make time for “the most important thing” and that means more work on “the most important things”. As the org shifts work around, we don’t all magically end up with more time.  It actually takes more time and causes more work as we fumble around trying to figure out what gets absorbed and what goes away. Developing people and effective delegation takes real time and work and I think we have room to improve there.  All of this takes capacity, so if we are serious about success with this new work, we have to stop other work.     kevin.olsen:  Lastly, I think the bottom up approach could yield amazing results, and would love to see a number of research efforts on topics that just aren’t getting attention.   Love the idea and I know it can work.  But damn. Speaking for myself, Gitcoin does does not feel like a “stick your neck out” environment atm.     kevin.olsen:  But for those to come through and be ratified as our core Business Strategy, Token Utility, etc. are a gamble, and we might still fall victim to the Shared Stagnation issues we have currently.   This is not the most fertile soil I have seen for “bottoms up” initiatives.  I suggest CDSO sucks it up and decides what is most important, and then makes realistic delegations (considering capacity and capability). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.082255181687
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#6",
                    "likes": "1",
                    "time": "22/02/2023-14:23:16",
                    "content": "    kevin.olsen:  You and me both. I see the issue as one of legitimacy and accountability. In the current deliberative format, any one person seeking to own a topic as consequential as strategy might be seen as illegitimate: who’s given this person the authority to own this issue? The forums have not proven to be effective at building up consensus opinions, and CSDO hasn’t been able to workshop it’s way through these topics either.   This is a great articulation. I would add one piece to it - CSDO has not been willing to put the time into workshopping our most important thing, the overall strategy. We workshopped why this happens and what we should do about it, but then no one was willing to take the time to continue the process. CSDO is too vested in their workstream outcomes to take the time for the holistic outcomes AND we don’t trust one person to do this because we don’t want a CEO.  Image 2022-09-30 at 1.52.11 PM1116×965 90.6 KB  After doing this exercise, a few dissenting voices in CSDO were overridden in the agreement that we didn’t need to do any more strategy meetings that month. That was October. We didn’t have another strategy session until mid-January. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.846153846153847
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#7",
                    "likes": "4",
                    "time": "22/02/2023-16:00:07",
                    "content": "    shawn16400:  Simple: CSDO delegates critical gaps to realistically capable developmental resources to do the work on a timeline. If performance does not meet expectations, have a hard conversation.   I think we’re advocating for really similar things here.     shawn16400:   Consensus is the wrong orientation - we don’t need consensus, we need the opportunity to provide meaningful input (aside from the forum). MMM has done this exceptionably well lately.    Interesting, why I think MMM was so successful is that they had a mandate that allowed them to cut through and make a decision (and the MMM team are thoughtful brilliant people who built the whole thing in public). Branding falls squarely into their remit. This is more of an example of the workstream structure stepping in to provide the delegated authority that’s missing for these other topics.     DisruptionJoe:  This is a great articulation. I would add one piece to it - CSDO has not been willing to put the time into workshopping our most important thing, the overall strategy.   Glad you agree, I see lots of reasons for the CSDO being protective of their time.     DisruptionJoe:  we don’t trust one person to do this because we don’t want a CEO.   Agreed! We don’t want one single authority that all responsibility rolls up to. I’m hoping to land the idea that we haven’t explored the option space much. CSDO Workshop or CEO doesn’t allow enough degrees of freedom to get out of this trap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.107380952380952
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#8",
                    "likes": "3",
                    "time": "15/03/2023-23:49:47",
                    "content": "Only now getting to responding to this post. I agree with your outline and I think we are addressing these two issues with the two processes which are currently being developed within our DAO     kevin.olsen:  We are missing bottom-up ideation and participation. Outside of joining a workstream, there aren’t low-barrier onramps where our community can step in and contribute to shaping gitcoin.   This one is being addressed by the proposal by Umar and Shawn with the running of Citizens/Community rounds, based on Scott’s post.     kevin.olsen:  From the other direction, we are missing the ability to execute on some narrower strategic areas, evidenced in our inability to move forward with revenue modeling, GTC utility, and similar deeply consequential but non-workstream specific tasks.   This would be addressed through the GCP process, which is also currently being updated (more coming soon). I agree with @shawn16400’s comments that it is not only a question of empowerment, but also of capacity. Through a well-defined GCP process (combined with requests for proposals, within this process), it will be easier for CSDO to delegate these crucial - and very high-context - topics to teams, whether they are part-time contributors or specialists outside of our DAO. The combination of these two initiatives - and a clear delineation between both to indicate what process serves which outcomes and to avoid overlap and confusion- might help us break through the stagnation you described so well. Thanks for voicing this so well, a lot of this can further enrich the two processes which are being outlined, excited for what will come out of this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.260937500000001
                }
            ]
        }
    ],
    "group_index": "329"
}