{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/passport-testing-on-mobile-devices/12541",
            "title": "Passport Testing on Mobile Devices ",
            "index": 12541,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "passport",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/carlosjmelgar",
                    "index": "#1",
                    "likes": "3",
                    "time": "11/01/2023-11:33:15",
                    "content": "Passport is a vital tool for protocol adoption, but still very web3 oriented, which serves as an entry barrier for noobs and people in regions slow to adopt the space. Example: Impact Onboarding event at a Garifuna village in Honduras Context: The goal is to give people relevant, meaningful, and useful reasons to adopt crypto’s most basic use case: payments. They earn small amounts of crypto by doing good in their community, a cafe agrees to accept crypto payments. Goal: enable this community to adopt more tools to continue empowering positive change in their community; access to grant funding being the most obvious. They get to a point where they’re inspired to launch other, more meaningful public goods initiatives (health, education, climate, etc…) and adopt platforms like Gitcoin. Problems:  They only have mobile devices, and many of them are really old.  They don’t use most of the platforms attached to stamps (They said facebook is for old people)  Web3 user experience is bad on computers, terrible on mobile These experiences can make people feel unwelcome and prevent communities that need the most help to excluded while others that don’t need as much help benefit from QF. For example: Most of the web3 grant funding in Honduras is for pizza and wine or brunch “meetups”. These teams are web3 savvyy and able to mobilize their communities, even setting up multiple grants like women meetups, nft meetups, defi meetups, conferences etc… Potential solutions:  More testing on mobile devices, different models and older versions  Meet people where they are. Maybe gaming integrations or IG. What are teenagers using these days?  Internal education modules or through partnerships that lead to a passport stamp  Human verification. This may be the most difficult, and least web3-y. Similiar to what BrightID does with calls. Other relevant cases are a 64 y/o community lead in a different village. She’s been organizing onboarding events, community clean ups, art and language classes for kids. I wouldn’t dare trying to have her adopt Passport. She lives in a community that’s 2.5 hours away from the nearest city and I’m unable to visit often. How do we get someone like her to use passport so she can bring Public Goods to her community? Just sharing my experience and thoughts here. I would love some feedback on what I can be doing better. If I’m facing these obstacles, I’m sure many others are as well. How do we create a smoother experience for people in communities we don’t often consider? The teams in big cities don’t have this on their radar and if they were to consider it, I doubt they’d want to do the hand holding. ",
                    "links": [
                        "https://twitter.com/web3beach/status/1610750835876630534"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.775549613784908
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#2",
                    "likes": "3",
                    "time": "11/01/2023-15:37:21",
                    "content": "Great suggestions. I think we’ve heavily focused on getting to market, and that’s led us to limit our scope to newer devices, fast connections, etc. but this is a great reminder that our products are being used in context’s that we haven’t been designing for. cc’ing the passport team for visibility: @erich @Etovardesign @nutrina ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nutrina",
                    "index": "#3",
                    "likes": "1",
                    "time": "12/01/2023-10:46:22",
                    "content": "Yes, this is indeed a great suggestion. We should definitely think more about making this as easy as possible across devices and for different user groups. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.444444444444445
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#4",
                    "likes": "2",
                    "time": "12/01/2023-14:01:33",
                    "content": "    carlosjmelgar:  Maybe gaming integrations or IG.   I really love this part too. If we are working to deepen the number of stamps that help someone prove their unique humanity, than linking to steam accounts, roblox accounts, etc. could be interesting stamps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.291666666666666
                }
            ]
        }
    ],
    "group_index": "294"
}