{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/harnessing-collective-intelligence-for-workstreams-with-radicalxchange-voice/10024",
            "title": "Harnessing collective intelligence for workstreams with RadicalxChange Voice ",
            "index": 10024,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "11",
                    "time": "07/03/2022-19:30:12",
                    "content": "Authored by @fred and @erich  TLDR This post describes how RadicalxChange Voice might improve the collective decision-making processes in the context of DAOs in general and GitcoinDAO workstreams specifically.  Shared Goal Formation Groups of people collaborating without a robust set of democratic rules often default back to a hierarchical, top-down decision-making arrangement. In other words, the Schelling point of unorganized collaboration, even in the DAO age, continues to be a traditional boss-employer relationship. Organizing groups without democratic mechanisms often lead to power concentrations from a few charismatic leaders - the loudest voices in the room dominate. Therefore, formal rules and boundaries are essential to help individuals negotiate the shared resources and vision of the group. With the help of new DAO-native tools, we are able to construct systems that are more fair, inclusive, and democratic. We should strive for more social dimensions of progress and systems for shared goal formation based on participatory democratic mechanisms.  RadicalxChange Voice: Democracy² RadicalxChange (RxC) is a global movement for next-generation political economies founded by political economist @GlenWeyl in 2018. RxC is committed to advancing plurality, equality, community, and decentralization through upgrading democracy, markets, the data economy, the commons and identity. RxC Voice is an open-source web app that allows groups to evolve and leverage collective intelligence to rapidly make decisions together. Using RxC Voice, a cooperative can filter signal from noise and align the group towards shared ideals and outcomes. We believe that RxC Voice can help move DAOs towards more pluralistic governance as it amplifies the whole group’s shared beliefs instead of just the dominant voices.  Using RxC Voice The RxC Voice process is divided into 3 stages. Each step of the process is anonymous, it’s not possible to gain insight into how individuals vote, nor can individuals prove to other participants how they’ve voted. The stages are as follows; Stage 1: Delegation - Members of the group are asked to delegate Voice Credits to boost the impact of their peers. The delegated credits are then matched using quadratic funding with a matching pool 100 times the number of delegates. Stage 2: Deliberation - Members are invited to add and explore statements by the group on Polis. Members may submit any statement or comments that express their ideas, feelings, or principles relevant to the conversation. Stage 3: Election - Actionable common grounds are identified by quadratically voting on the statements from stage 2 by either agreeing or disagreeing. At the end of this stage a set of the most agreed upon statements are identified and presented. If you’d like to see how this works in practice - check out the 2-minute introduction of RxC Voice.  Initial Experiments in Gitcoin Considering how GitcoinDAO operates with contributor-driven workstreams, we see collaborative road-mapping as a natural fit for RxC Voice. With RxC Voice, workstreams can harness the richness of their collective intelligence in order to form better roadmaps, budgets and priorities which align workstream operations with shared contributor goals. The emerging Builderband, Gitcoin’s alumni network of builders, applied RxC Voice to prioritize its activities for Q1 2022. As the next application within Gitcoin, we propose to implement RxC Voice with the contributors of the MMM Workstream. If the experiment is successful, MMM aims to incorporate the results in the Season 14 budget proposal. The RxC Voice pilot in MMM will take place half way into Season 13 and center around the question: - What activities should the MMM workstream prioritize in Season 14?  Giving DAOs a Shared Voice In identifying potential RxC Voice product improvements specific to Gitcoin, we might consider starting a formal collaboration with RxC Foundation to help suit our needs. Similar to how the executive branch of the Colorado government worked with RxC and quadratic voting to address interdisciplinary issues. If proven successful at MMM, RxC Voice could be applied for cross-workstream and DAO-wide cooperation as well for rapid, democratic, decision -making. We are excited about the use cases of RxC Voice and see an excellent opportunity to apply it within GitcoinDAO’s executive teams. We look forward to experimenting together with RxC Foundation and, hopefully, bringing more plurality and collective intelligence to GitcoinDAO. We invite anyone interested to connect with us as we jump into this experiment!  1316×1600 475 KB  Special thanks to @alexrandaccio and @anoanoano from the RadicalxChange Foundation for their work on RxC Voice. ",
                    "links": [
                        "https://radicalxchange.org/",
                        "https://voice.radicalxchange.org/",
                        "https://github.com/RadicalxChange/rxc-voice",
                        "https://pol.is/home",
                        "https://youtu.be/YWRRTO9zuks",
                        "https://www.notion.so/gitcoin/Builderband-6145889998bd4225a41a917367890630",
                        "https://github.com/builderband/pm/issues/12",
                        "https://m-m-m.xyz/",
                        "https://www.radicalxchange.org/media/blog/quadratic-voting-in-colorado-2020/",
                        "https://gov.gitcoin.co/t/how-do-we-scale-our-sensemaking/10192/5",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-11-2022/10277",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-8-2022/10032",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-memes-merch-marketing-budget-request/10440/10",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-memes-merch-marketing-budget-request/10440",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-10-2022/10209"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0413896619253755
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/muratgozel",
                    "index": "#2",
                    "likes": "5",
                    "time": "08/03/2022-11:37:48",
                    "content": "I’m supportive of this transition and excited about experimenting with this in our works in MMM. I would like to explain my concern raised while reading this.  There are experienced people and less experienced people per project. And leaving the decision making to those experienced people is the best choice according to my experience in MMM. We mostly trust your @Fred and @seedphrase feedback about our works because you carry the brand values and give the right direction for a work.  In short, will we lose the decision making based on experience and expertise? Maybe this concern is unrelevant and and RxC already has a solution for this. This looks like great opportunity to build collective intelligence. Thanks @alexrandaccio @anoanoano ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.455853174603174
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#3",
                    "likes": "4",
                    "time": "08/03/2022-12:57:55",
                    "content": "Thanks for the feedback Murat,   The purpose of Stage 1 is to collectively distribute voice credits to trusted individuals within the group. The delegated credits are then matched via quadratic funding to democratically allocate credits according to the will of the collective. This helps reduce the impact of information asymmetry and varying levels of context for the election process in Stage 3.   The ambition of this initial experiment with RxC Voice in MMM is to more effectively incorporate contributors’ opinions and thoughts in the upcoming Season 14 budget proposal. At this point RxC Voice will not be used on a project level.   We’re currently planning a workshop/AMA prior to the launch next week, more details on this will be shared soon! EDIT: An introduction/AMA will be held this Friday at 3pm UTC togheter with @erich @anoanoano & @alexrandaccio. Season 13 contributors of MMM have been invited, if anyone else wishes to listen in, please reach out! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.30078125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seedphrase",
                    "index": "#4",
                    "likes": "4",
                    "time": "09/03/2022-11:50:47",
                    "content": "Sweet proposal. I like the drive for democracy. Looking forward to the workshop and testing out this system in MMM. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/maerg",
                    "index": "#5",
                    "likes": "3",
                    "time": "13/03/2022-14:00:44",
                    "content": "Great initiative @Fred, Fully supportive of this. I am curious and excited to see the results! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0859375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/erich",
                    "index": "#6",
                    "likes": "3",
                    "time": "01/04/2022-17:05:37",
                    "content": "Here is an overview of the recent RxC Voice pilot results in the Memes, Merch, and Marketing workstream. The pilot centered around the question: What activities should MMM prioritize in Season 14? To recap — 23 of the active contributors in the MMM workstream signed up as participants for the decision and quadratically delegated voice credits to each other. They then formed proposals through Pol.is and finally, prioritized them in a quadratic vote. Here are the complete results of that concluding vote.  image1453×876 58.2 KB   Host more community events, similar to Memepalooza. (38 votes) Focus our energy on fewer but bigger projects. (37 votes) Create more defined, full-time or part-time roles in MMM. (37 votes) Increase our presence at conferences and IRL. (37 votes) Collaborate more with other Gitcoin workstreams and teams and find out what we can help them market. (37 votes) Foster art and culture. (35 votes) Request more money for the MMM budget every Season (at par with other Workstreams). (32 votes) Think of fundraising campaigns. (28 votes) Define different levels of designers based on how good they are (27 votes) Recognize community experience as an aspect of MMM. (26 votes) Work more with other DAOs. (25 votes) Give every activity in MMM a pre-approved and visible budget. This would make it easier to join a task and know the compensation beforehand. (25 votes) Set expectations early for contributors on what DAO life might be like. (24 votes) Establish stricter requirements for onboarding designers. (24 votes) Utilize a mix of raids and task forces for specific projects in order to balance speed and reliability. (20 votes) Assign a talent coordinator for MMM (20 votes) Assigned roles to each contributor to encourage participation in the Workstream. (19 votes) Restrict the amount of new contributors we onboard each Season. (19 votes) Adopt Dework to help make projects clearer and easier to take on. (18 votes) Re-think how the Raid structure works. (15 votes) Make the MMM Notion page open to edit by contributors, in order to make it more useful. (12 votes) Change the name of the Workstream. (6 votes)  Thank you to @alexrandaccio and @anoanoano for facilitating this amazing experiment!  I’m curious to see how it will shape MMM’s roadmap for Season 14, @Fred, @seanmac, and @seedphrase. Please feel free to share your experience as a participant in this as well as your thoughts on the results. I’d be delighted to help organize more collaborations between RadicalxChange Voice and Gitcoin. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.063041125541125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#7",
                    "likes": "1",
                    "time": "01/04/2022-17:12:59",
                    "content": "Thank you! I’ve very happy with the contributor participation, I think this was really successful. We got valuable and actionable items that we will incorporate into our upcoming budget. More information on the results can be found here: RadicalxChange Voice - Google Slides Results will be discussed during our upcoming Workstream sync next week! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.8125
                }
            ]
        }
    ],
    "group_index": "4"
}