{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-15-formerly-week-in-governance/8806",
            "title": "GitcoinDAO Digest #15 (formerly Week in Governance) ",
            "index": 8806,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "4",
                    "time": "13/10/2021-23:56:22",
                    "content": " 2048×488 78.4 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the very first edition of the GitcoinDAO Digest After 14 editions of the Week in Governance, we’ve transitioned editorial duties to the community. We will share TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading! We know, we’re growing up so fast  Without further ado, let’s dive in!    Meta-Governance    How we achieve our mission by @owocki explores how GitcoinDAO “can create more impact towards its mission of more coordination & reduction of coordination failures”. Kevin brings into focus how “the product suite, built by GitcoinDAO will be deployed to help partner DAOs better source, select, sell, onboard, and retain talent” and “become a perpetual motion machine that reinforces itself” benefiting the entire ecosystem.   A Proposal to ratify the results of Grants Round 11 and formally request the community multisig to payout matching allocations is live until October 17th.   Gitcoin Discovery: Decentralize the Knowledge Base & Quests; a new Workstream proposal authored by @Huxwell was published on the forum. The proposal has received a lot of feedback from the community. The Workstream would “be responsible for decentralizing and improving the Gitcoin Quests. It would be a community-driven, learning platform for onboarding and engaging users & developers into Web3”.     GitcoinDAO Governance Overview      Proposal discussions Active proposals Latest completed proposals     Prototyping Workstream ( Moonshot) Budget Request - Q4 2021 Proposal to Ratify the Results of GR11 Gitcoin MMM Q4 2021 budget request   Gitcoin Discovery: Decentralize the Knowledge Base & Quests  Ratify GR11 Matching Pool Allocations      Workstream Discussion    Public Goods Funding    Awardees for the Call for Proposals for New Kinds of Public Good, a project in collaboration with Other Internet, have been announced in a blog post by @ceresstation. In addition to the seven main awardees, a list of honorable mentions was also published.   The first workstream payments are going out to the squad helping push forward the climate change, advocacy, and longevity rounds for GR12 this week!   Onboarding continues to make progress with help from @krrisis and others across the DAO, funded in part by PGF.   The public goods library continues to grow, and Henry Zhu recently put forward a deep, thoughtful talk on Ivan Illich’s work, helping the DAO further its understanding of the commons we all seek to serve.     Moonshot Collective    A Budget Request Proposal for the Moonshot Collective - Q4 2021 was posted in the forum by @austingriffith requesting to fund the Moonshot Collective with 100k GTC for the next 3 months. @owocki provided the Season 1 build roadmap for the Moonshot Collective in the comments section.   Every Friday the Moonshot Collective gets together to show off their progress. This week includes Moonswap, Quadratic Diplomacy, Tip.Party, and Merch. Learn more by saying hello in Discord, or checking out our Website. Demo videos for each project can be found on YouTube. Follow @MoonshotCollect on Twitter for frequent updates. Every month, MC presents a demo for their GitcoinDAO projects. Each project gets 5 minutes to show off what they’ve built! Last week Decentralized Grants, Mars Shot Bots, Open signal, Scaffold Directory, GitcoinDAO Steward Report Cards, Anon Vs Moloch, Wayfair Discord Bot, Tip.Party, and Quadratic Diplomacy demoed during the monthly call.     Decentralize Gitcoin    The team is running a Decentralized Grant Round on the Polygon network for the Moonshot Collective Workstream as a way to support our DAO, stress test the system, and collect feedback from users.   The Workstream has collected valuable feedback from many MC team members as a number of bug fixes have been pushed out.   The MC team has created 6 grants so far. The round is planned to kick off externally on October 18th, scope and requirements are being defined…     Fraud Detection & Defense    A Proposal to ratify the results of Grants Round 11 and formally request the community multisig to pay out matching allocations is live on Snapshot until October 17th.   FDD is sending out DAO contributor agreements to all participants. The Workstream is recommending all DAO contributors use an LLC. Payments are beginning to stream to contributors!   The State of FDD blog post & Q4 Budget Proposal will be published this week.   BlockScience shared their report on the GR11 Anti-Sybil efforts. Fraud tax was down over 50%. First round we had enough human evaluators to perform statistical analysis. There were 853 Sybil accounts sanctioned. For GR12, a community ML algo is to run side by side with the BlockScience algo and on-chain forensic detection methods will be added.   FDD met with Celeste to build a decentralized appeals process.   Four contributors from Gitcoin will participate in the Gnosis + Governauts DAO compensation research project.   Planning started for the ambassador program and FDD is currently supporting Cross-stream DAOops until it potentially becomes a Workstream.     Merch, Memes & Marketing    The vote to ratify the MMM Workstream budget request for Q4 2021 has passed and action has been taken to push forward on a formal on-chain vote.   This newsletter you are reading right now is part of the MMM-copywriting substream. Each GitcoinDAO Workstream is responsible for their respective section, but the newsletter as a whole is funded and maintained by MMM. Beside the newsletter, the copywriting-substream is maintaining the @GitcoinDAO-Twitter account and is working on improving the GitcoinDAO-onboarding process.   A “Regen vs Degen”-card game is being developed as a novel educational effort to explain technical terms and expressions. The game is currently being playtested to get it balanced and make it as fun as possible. Once feedback from the playtesters and artwork for the cards are implemented and complete, an online tournament will be held to celebrate the launch. An option to buy the physical cards will also exist.     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM EDT in Discord!   Every other Wednesday you can join us for an onboarding call where we’ll tell you all about how we’re organized and how to become an active contributor. If you haven’t applied, do this first!     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to check out what they are up to and where you might fit in. Current openings across the GitcoinDAO can be found here.   That’s it for this week’s GitcoinDAO Digest. Feel free to join the discussions via the links above and on Discord, and visit the Gitcoin DAO Event calendar to keep yourself updated on what’s to come. If you are reading this on our forum, and would like to receive this in your inbox, sign up here! Previous Edition ",
                    "links": [
                        "https://gov.gitcoin.co/t/how-we-achieve-our-mission/8760",
                        "https://gitcoin.co/mission",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmQTMLG8qbDpTCCUwVnbEmzLkdCvf1ApZ8w9nd9idfC8r7",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-discovery-decentralize-the-knowledge-base-quests/8747",
                        "https://snapshot.org/#/gitcoindao.eth",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmQTMLG8qbDpTCCUwVnbEmzLkdCvf1ApZ8w9nd9idfC8r7",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmZbt14YZBzLtx4umQ9hxSwxZFRsV8BNr9VV7dGoKRsDLT",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-discovery-decentralize-the-knowledge-base-quests/8747/",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmSRTDaRckWkWBBAHDXXyatMFLUZcFjSCkvHSBuC84fgbf",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gov.gitcoin.co/t/workstream-public-goods-funding/129",
                        "https://gitcoin.co/blog/seeking-a-new-kind-of-public-good/",
                        "https://gitcoin.co/blog/seeking-a-new-kind-of-public-good-closing-the-loop/",
                        "https://gitcoin.co/blog/seeking-a-new-kind-of-public-good-honorable-mentions/",
                        "https://gov.gitcoin.co/t/workstream-public-goods-prototyping/130",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785/",
                        "https://moonshotcollective.space/",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785/2",
                        "https://gitcoin.co/discord",
                        "https://moonshotcollective.space/",
                        "https://youtube.com/playlist?list=PLVupIN3GgLtgMwcqHwnoptx3W1YikLHQB",
                        "https://twitter.com/MoonshotCollect",
                        "https://www.addevent.com/event/sl8144453",
                        "https://gov.gitcoin.co/t/workstream-decentralize-gitcoin/180",
                        "https://www.notion.so/gitcoin/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmQTMLG8qbDpTCCUwVnbEmzLkdCvf1ApZ8w9nd9idfC8r7",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmQTMLG8qbDpTCCUwVnbEmzLkdCvf1ApZ8w9nd9idfC8r7",
                        "https://medium.com/block-science/gitcoin-grants-round-11-anti-fraud-evaluation-results-50f4b0f15125",
                        "https://gov.gitcoin.co/t/workstream-suggestion-mmm-merch-memes-marketing-for-public-goods-gitcoin-gitcoindao/7066",
                        "https://gov.gitcoin.co/t/proposal-merch-memes-marketing-workstream-budget-request/8562",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmZbt14YZBzLtx4umQ9hxSwxZFRsV8BNr9VV7dGoKRsDLT",
                        "https://twitter.com/gitcoindao",
                        "https://twitter.com/owocki/status/1446495166114631683?s=20",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://www.notion.so/gitcoin/06fad27dbd2d49468aa810c92f1f28c2?v=d403dc9f76144dcab232e3a18002494f",
                        "https://discord.com/invite/gitcoin",
                        "https://www.addevent.com/calendars/pz351122/",
                        "https://form.typeform.com/to/ttNCMt8w",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-14/8758",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-formerly-week-in-governance/8844"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.538743663743664
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "2",
                    "time": "14/10/2021-20:19:37",
                    "content": "One piece of feedback I’ve been getting is “I dont know how to help.  Where do workstreams need help?” from a few new community members. Have we considered having an “ASKS” section wherein workstream leads communicate what they need from the broader GitcoinDAO community week over week? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.840909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#3",
                    "likes": "2",
                    "time": "14/10/2021-21:17:52",
                    "content": "@owocki definitely! One of the big asks in the rework of gitcoindao.com (our notion overview) is to have a very clear & simple overview of open tasks & roles for contributors. We now have this (and is linked above) but people tend to get lost a bit there. As soon as this v2 is up & running we can include this here and even embed some of the highest prio tasks & jobs. Making the #onboarding channel also the place to share, discuss & find opportunities is part of this logic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.108333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ntnsndr",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/10/2021-02:29:54",
                    "content": "Wait wait wait where is a link to Henry Zhu’s Illich talk? That sounds like a dream come true! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wizardjuan",
                    "index": "#5",
                    "likes": "1",
                    "time": "19/10/2021-21:20:00",
                    "content": "Here are the notes @ntnsndr  Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-16-formerly-week-in-governance/8844",
            "title": "GitcoinDAO Digest #16 (formerly Week in Governance) ",
            "index": 8844,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/seedphrase",
                    "index": "#1",
                    "likes": "3",
                    "time": "21/10/2021-10:35:23",
                    "content": " 1600×381 62.6 KB  Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest​:sparkles:, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading! Without further ado, let’s dive in!   Meta-Governance    The proposal to ratify the results of GR11 has been ratified on Snapshot, the majority vote going towards allowing to pay all grants the amount of match funds from the community multisig as determined by applying QF after removing contributions attributed to accounts flagged as sybil.   @Huxwell gave an update on the Discovery-workstream proposal after two weeks of discussion on the forum. “We’d like to move forward by creating a vote on Snapshot in the following days that will contain an updated and simplified version for the proposal and budget request”. The updated proposal Integrate dCompass within dGitcoin to build dQuests & dKnowledge. The name of the workstream has been renamed from Discovery to dCompass.   The Community Experience team spearheaded by @krrisis is making great progress on streamlining cross-DAO operations, onboarding flows, a Notion and Discord rework, and more. In this context “Gitcoin’s orbit” by Kevin Owocki explores the Gitcoin ecosystem and onboarding by drawing parallels to a solar system. The post also describes what a “DAO of DAOs”-solar system might look like.   Renee Lee started a discussion in the How we achieve our mission-thread on “which role(s) the GitcoinDAO Ambassador may play within quadratic diplomacy and coordinating culture + capital”.   @kelsien raised questions and concerns regarding the Steward Report Cards and the metrics displayed on the cards. Kelsie links to a recently published paper that explores the relationship between on-chain transactions and surveillance.     GitcoinDAO Governance Overview      Proposal Discussions Active Proposals Latest completed proposals     Integrate dCompass within dGitcoin to build dQuests & dKnowledge Prototyping Workstream ( Moonshot) Budget Request - Q4 2021 2 # Proposal to Ratify the Results of GR11     Gitcoin Discovery: Decentralize the Knowledge Base & Quests  Gitcoin MMM Q4 2021 budget request   Redistribute GTC to Individuals Who Could Not Claim Due to Error        Workstream Discussion    Public Goods Funding    The public library continues to grow thanks to @linht.tran, Pan, and others, with speakers like Henry Zhu and Mat Dryhurst stopping by to talk about the web3 ethos.   @annika, @jihad, @lanitrock, @Vizzbk and others have begun pushing forward on ops and fundraising for GR12 including for three themed rounds: climate, tech advocacy, and longevity.   Lee and QZ are working with FDD on what a DAO Wayfinder role could look like.   QZ and Rafa have independently begun thinking about what cross-DAO onboarding might look like alongside the Inter-DAO Alliance.   Large & established organizations like the Gates Foundation are inquiring about supporting digital public goods and web3 tooling.     Moonshot Collective    The Greatest LARP launched on Wednesday, October 20. Come defeat Moloch and fund public goods with us!   Every Friday the Moonshot Collective gets together to show off their progress. Individual projects demo what they’ve been working on, and this week we had three projects demo: Anon Vs Moloch, Moonswap, and Quadratic Diplomacy. Demo videos for each project can be found on  this YouTube playlist.   Follow @MoonshotCollect on Twitter for frequent updates. Learn more by saying hello in Discord, or checking out our site.     Decentralize Gitcoin    The POC instance of dGrants, which is acting as our current production environment, now has 11 grants created by the Moonshot Collective team.   Test data has been cleaned up and the round has been updated in preparation for the marketing push on Oct 20th at 3PM EST.   A number of bugs have been fixed and a significant number of changes have been made based on feedback that we have received from internal testing.   The budget proposal for Q4 2021 is coming soon along with the dCompass teams proposal for budget within the Decentralize Gitcoin workstream.     Fraud Detection & Defense (FDD)    Proposal to ratify the results of Grants Round 11 passed. Payouts start streaming on 10/21/21. @DisruptionJoe authored a Twitter thread on the topic of fraud tax and why it will not be paid out this round.   Open sourced DAO contributor agreements are being sent to all contributors.   Contributor payments for Epochs 1-3 were sent out by FDD and Epochs 4-6 will be sent next week. Q4 payments will stream weekly or biweekly.   The FDD-Budget Proposal for Q4 is about to be released. 90,000 GTC which includes one quarter of reserves for the defense streams are being requested. The State of FDD companion piece provides further details about the current role of the Workstream, which includes a Roadmap to Progressive Decentralization, how FDD provides value to GitcoinDAO, and a breakdown of all FDD initiatives.     Merch, Memes & Marketing    MMM created POAPs for the Public Goods Workstream and the Moonshot Collective. To date, MMM has created and gifted POAPs to more than 50 people for GitcoinDAO related events and roles.   MMM is making a steady stream of memes for the Moonshot Collective Twitter to celebrate their builds, culture and community and continuing a valiant effort to meme public goods into existence and spread the vision of Gitcoin.     Upcoming community events    ETHLisbon, LisCon and The DAOist are happening this week in Lisbon, Portugal. Members of the Gitcoin community are both attending and speaking at the events. Reach out to Fred, Kris, Owocki, Loie, Alp, and Morten to say hello if you are in town!   Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM EDT in Discord!   Community Onboarding Call!  New to Gitcoin? Every other Wednesday we’ll tell you all about how we’re organized and how to become an active contributor. The next one is Wednesday, October 27, 12-1PM ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to check out what they are up to and where you might fit in. Current openings across the GitcoinDAO can be found here.   In summary, there are three key actions to take this week:  Join us for interesting discussions via the links above and on Discord! Check the Gitcoin DAO Event calendar to keep yourself updated on what’s to come! If you are reading this on our forum or were forwarded this email and would like to receive it weekly, sign up!   Thanks for reading! Last week’s edition ",
                    "links": [
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmQTMLG8qbDpTCCUwVnbEmzLkdCvf1ApZ8w9nd9idfC8r7",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-discovery-decentralize-the-knowledge-base-quests/8747/15",
                        "https://gov.gitcoin.co/t/proposal-integrate-dcompass-within-dgitcoin-to-build-dquests-dknowledge/8836",
                        "https://gov.gitcoin.co/t/gitcoins-orbit/8812",
                        "https://gov.gitcoin.co/u/lee0007",
                        "https://gov.gitcoin.co/t/how-we-achieve-our-mission/8760/3",
                        "https://gov.gitcoin.co/t/how-we-achieve-our-mission/8760",
                        "https://gov.gitcoin.co/t/introducing-steward-report-cards/8712/14",
                        "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3907693#",
                        "https://snapshot.org/#/gitcoindao.eth",
                        "https://gov.gitcoin.co/t/proposal-integrate-dcompass-within-dgitcoin-to-build-dquests-dknowledge/8836",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmUMKpGM6daj2Lo7Wb8urz6hG4gvfoDu94fpBgueRZGYDi",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmQTMLG8qbDpTCCUwVnbEmzLkdCvf1ApZ8w9nd9idfC8r7",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-discovery-decentralize-the-knowledge-base-quests/8747/",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmZbt14YZBzLtx4umQ9hxSwxZFRsV8BNr9VV7dGoKRsDLT",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gov.gitcoin.co/t/workstream-public-goods-funding/129",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gov.gitcoin.co/t/workstream-public-goods-prototyping/130",
                        "http://www.greatestlarp.com",
                        "https://www.youtube.com/playlist?list=PLVupIN3GgLtiE23oay-uyeS4U_hC_I5Sw",
                        "https://twitter.com/MoonshotCollect",
                        "https://gitcoin.co/discord",
                        "https://moonshotcollective.space/",
                        "https://gov.gitcoin.co/t/workstream-decentralize-gitcoin/180",
                        "https://grants.gtcdao.net",
                        "https://www.notion.so/gitcoin/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmQTMLG8qbDpTCCUwVnbEmzLkdCvf1ApZ8w9nd9idfC8r7",
                        "https://twitter.com/DisruptionJoe/status/1450090116366667777?s=20",
                        "https://github.com/LarryFlorio/LegalForms/commit/89b536591ea1ef897dfa87275a145ef2c8355f46",
                        "https://docs.google.com/document/d/1uEuGe5OOecLyAsLbgnqaLplaH8ycU4zej3c-mv6QHTI/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/workstream-suggestion-mmm-merch-memes-marketing-for-public-goods-gitcoin-gitcoindao/7066",
                        "https://i.imgur.com/xoNgIa1.png",
                        "https://twitter.com/MoonshotCollect",
                        "https://twitter.com/owocki/status/1448711674085588993/photo/1",
                        "https://twitter.com/fahimfarque/status/1444005213426356254/photo/1",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.ethlisbon.org/",
                        "https://liscon.org/",
                        "https://www.thedaoist.co/",
                        "https://twitter.com/Freddmannen",
                        "https://twitter.com/krrisis",
                        "https://twitter.com/owocki",
                        "https://twitter.com/Loie_Low",
                        "https://twitter.com/alpergintr",
                        "https://twitter.com/Death_and_TXs",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://www.notion.so/gitcoin/06fad27dbd2d49468aa810c92f1f28c2?v=d403dc9f76144dcab232e3a18002494f",
                        "https://discord.com/invite/gitcoin",
                        "https://www.addevent.com/calendars/pz351122/",
                        "https://form.typeform.com/to/ttNCMt8w",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-15-formerly-week-in-governance/8806",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17/8897"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.686435490738769
                }
            ]
        }
    ],
    "group_index": "591"
}