{
    "poll_list": [
        {
            "id": "0xf8a7f4c5c6f894046555d608d5508ab04ae608670c135b27869c184c3c325236",
            "title": "GR14 Round Structure & Grants Eligibility Update",
            "discussion": "",
            "body": "Forum post: https://gov.gitcoin.co/t/proposal-gr14-round-structure-grants-eligibility-update/10632\n\nThis proposal looks to finalize round structure & matching pool allocations for Grants Round 14.\n\nIn addition, we’re proposing a policy change to platform-level eligibility for grantees, following the many discussions on this topic in GR13.\n\n\nVote\n\nThe three options to vote on are:\n\nOption 1: FOR GR14 Structure & FOR New Eligibility\n\nYou approve the GR14 structure as is, and are in favour of us removing the “no token” eligibility requirement.\n\nOption 2: FOR GR14 Structure & AGAINST New Eligibility\n\nYou approve the GR14 structure as is, but are NOT in favour of us removing the “no token” eligibility requirement. If this option prevails, GR14 eligibility will remains as-is.\n\nOption 3: AGAINST GR14 Structure\n\nYou do not approve of the GR14 structure, and will be submitting an alternate proposal for consideration.",
            "choices": [
                "FOR GR14 Struct & FOR New Elig",
                "FOR GR14 Struct & AGNST New Elig",
                "AGAINST GR14 Structure"
            ],
            "scores": [
                678979.2526195062,
                7346359.312420987,
                2037.8144106358775
            ],
            "start": 1653309151,
            "end": 1653741300,
            "snapshot": "14829578",
            "state": "closed",
            "author": "0x894Aa5F1E45454677A8560ddE3B45Cb5C427Ef92",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-gr14-round-structure-grants-eligibility-update/10632",
            "title": "[Proposal] GR14 Round Structure & Grants Eligibility Update ",
            "index": 10632,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#1",
                    "likes": "12",
                    "time": "17/05/2022-14:07:44",
                    "content": " Summary This proposal looks to finalize round structure & matching pool allocations for Grants Round 14. In addition, we’re proposing a policy change to platform-level eligibility for grantees, following the many discussions on this topic in GR13.  TLDR:   GR14 will look similar structurally to GR13, as we hone our innovation focus in on Grants 2.0 and launching the protocol   We are standing up a dedicated ETH Infra round in order to more intentionally support Ethereum protocol development   We are proposing removing the “grants should not have a token” criteria from platform eligibility    Round Structure  GR13 Recap Main Round In GR13, we continued on with the no-category approach & the 2.5% main pool matching cap that we had successfully tested in GR12. As background, prior to GR12, the main pool was divided into categories that assigned pre-set percentages of the pool to grants in specific disciplines or geographies (“categories”). Since then, we have done away with that category-based main pool approach, and instead have been scaling thematic matching pools outwardly with Ecosystem & Cause Rounds, which are dedicated QF pools for specific projects & domains. See the GR13 & GR12 posts for more context. Based on community feedback, the no-category approach and 2.5% matching cap continued to satisfy their intent and people are excited by the benefits that cap continues to bring to the longer-tail of grantees (funding many grants vs. letting the top few take the lion’s share of the pool). Ecosystem Rounds Based on ecosystem partner feedback, Ecosystem Rounds – rather than main pool categories – are an offering that there is a clear market need for us to continue with & build upon. We’ve grown Ecosystem Rounds substantially – from 2 in GR11, to 5 in GR12, to 9 in GR13 – and are seeing demand in GR14 from ecosystems that are new to working with Gitcoin, a testament to product-market fit of that offering in spite of market turmoil. We ran retrospectives with several partners after GR13 to get their input as we build these out further. As we work towards giving ecosystems more agency over their own rounds, we are seeing some awesome community-led innovation take shape. A few examples to note from GR13:   Collaborative ecosystem rounds, like ZK Tech & Open Gaming   Novel funding mechanisms, like Radicle’s Drips   Ecosystem round matching caps: In GR13, we offered the option for these rounds to set their own individual matching caps. All nine rounds took us up on this offer, selecting caps ranging from 10-20%, allowing ecosystems themselves to test QF based on their own needs   As we look towards Grants 2.0, a world wherein anyone will be able to stand up their own grants program, we want to continue to enable ecosystems to successfully run & innovate on their own rounds on top of Gitcoin, rather than Gitcoin doing this work in a centralized way. Cause Rounds Cause Rounds are rounds funded by external sponsors for clear sets of global public goods, and represent Gitcoin moving beyond just Web3 & Digital Public Goods, and into Public Goods more broadly speaking. These rounds expand the user base & TAM of Gitcoin Grants, and have successfully brought in funding interest from major Web2 philanthropists. In GR13, in addition to continuing with the Climate & Longevity rounds from GR12, we added a ‘Support for Ukraine’ round. This round was successful by all accounts, raising $700K in matching funds in the span of just a couple weeks to provide humanitarian aid given the crisis in Ukraine. All this said, we continued to learn acutely in GR13 that Cause Rounds represent a lot of operational overhead for Gitcoin – since there isn’t usually an external lead driving these rounds forward like we have with Ecosystem Rounds, a substantial lift falls on the PGF workstream for these rounds. As a result, until we have the Grants 2.0 protocol which will enable anyone, anywhere to stand up their own Cause Round, we plan to grow these rounds vertically, rather than horizontally (i.e., doubling down on just a few key rounds and scaling funding within those rounds). We don’t have the resources to run many small Cause Rounds in parallel.  GR14 Proposal We propose GR14 look a lot like GR13 – partly because the community feedback we have received on the direction of the last couple rounds is positive, and partly because we are honing our innovation focus in on Grants 2.0 and launching the protocol. Context: Grants 2.0 & Maintenance Mode To be explicit about the second point above: Grants 1.0, the centralized platform on which our program currently runs, is now in maintenance mode. The product team will fix any bugs and continue to maintain the platform as we build Grants 2.0 in parallel, but no product resources are prioritized to innovate on the current platform. This limits how much we can play with the grants program in the near-term, but is the right long-term direction given the vision we are working towards. Given the above context, we do not plan to make substantial changes to the grants program structure or do any substantial innovation on QF over the next few rounds, with an eye to this longer-term big play we are marching towards. Proposed Round Structure As a result, the Public Goods Funding workstream proposes that the structure of the round remains the same for GR14 at a high-level. In summary, the structure of the round will remain:  A Main Pool (of up to $1M) Ecosystem Rounds Cause Rounds  Main Pool The GR14 main pool will be a single matching pool fund/distribution of up to $1M in matching for the round. As in GR13, no individual grant’s matching contribution amount shall exceed 2.5% of the overall matching pool fund. We are specifically requesting “up to $1M”, rather than a specific amount. This “up to $X” is something we’ve been discussing for a bit – while historically we’ve requested a specific amount, we actually don’t think it makes sense for governance to ratify a specific amount prior to the round. Doing so prematurely and setting too high an amount can cause us to unnecessarily pull funds from the multisig – since when these posts are created, we are still fundraising for the main round. This is especially timely right now given the down market, and the fact that we have seen some funders rescind commitments due to that. Ecosystem Rounds In GR14, we plan to run roughly ten Ecosystem Rounds. As in previous rounds, these are pass-through funds that are not drawn from the existing multisig balance, and once again we have a mix of new & returning ecosystem partners funding these rounds. Within the ecosystem rounds we plan to run in GR14, we are particularly excited to announce a new Ecosystem Round we are being intentional about standing up: an ETH Infra round focused on protocol devs in the Ethereum ecosystem. This round was spun up in response to the discussion here – and as we expand Gitcoin Grants beyond just open-source in the Ethereum ecosystem, we believe this is an important round to prioritize in order to ensure we are continuing to have a dedicated funding pool for protocol development. Cause Rounds In GR14, we plan to run three Cause Rounds: a Climate Round, a Blockchain Advocacy round, and a new DEI Round. As with Ecosystem Rounds, these are pass-through funds that are not drawn from the existing multisig balance.  Grants Eligibility Update We are proposing an expansion to grants eligibility in GR14, based on (1) the direction we are headed with Grants 2.0, and (2) the BrightID appeal which brought into question the existing eligibility criteria. Context Since its inception, Gitcoin has been focused on funding public goods. In the early days of the grants program, there were no eligibility criteria highlighting ‘what’s in’ and ‘what’s out’ – anyone could get approved for a Gitcoin Grant. At one point, it was brought to Gitcoin’s attention that there were grants on the platform that did not meet the ethos of ‘public good’, and the following norms were established for grants eligibility:   A grant should not have raised over $500K in VC funding   A grant should not have a token   Today, FDD declines grant applications that meet these criteria. In addition, community members have the ability to ‘flag’ a grant they see on the platform that they believe should not be deemed a public good, which then sends that grant to FDD’s dispute process. Denied grants are offered a chance to request an appeal which are vetted by the FDD. The ideal process by which appeals might trigger policy revisions (and vice versa) have not yet been established. FDD has consultations with LexDAO Impact Clinic planned. Where we are today As outlined in this post, the landscape has evolved and many early-stage projects, like BrightID, that the community would deem eligible for grants do have small token experiments. In GR13, as we pursued the BrightID appeal, we explored the idea of allowing tokens under a certain market cap. We realized quickly that there is a ton of complexity associated with this – token reporting is non-standard, and setting a market cap would be too arbitrary a criteria that would likely continue to require much manual review. Recommendation PGF & FDD are recommending that we remove the ‘a grant should not have a token’ criteria from our eligibility. As per the existing rules, the removal of this criteria does not mean that airdrops and quid pro quo offers will get through, only that the existence of a token doesn’t automatically disqualify a project. QPQ also applies to/includes non-monetary rewards. As with the BrightID appeal, we want to move in the direction of putting the definition of a public good into the community’s hands, rather than having this be something Gitcoin prescribes centrally. As the result of that specific appeal makes evident, the ‘has a token’ criteria is not a good barometer of what the community considers a public good – and so we propose broadening the aperture, and triaging appeals on a case-by-case basis. In addition, we will work with the product team to determine what changes we might make in assessing whether a project is a public good at application stage (e.g., requiring projects with a token to submit a brief writeup on why they should be eligible). Grants previously turned down for having tokens will need to re-apply and will not automatically be re-reviewed with this change.  Voting Options We will ask the stewards to vote on three options: Option 1: FOR GR14 Structure & FOR New Eligibility You approve the GR14 structure as is, and are in favour of us removing the “no token” eligibility requirement. Option 2: FOR GR14 Structure & AGAINST New Eligibility You approve the GR14 structure as is, but are NOT in favour of us removing the “no token” eligibility requirement. If this option prevails, GR14 eligibility will remains as-is. Option 3: AGAINST GR14 Structure You do not approve of the GR14 structure, and will be submitting an alternate proposal for consideration. Once we have feedback on both this and any other proposals, the Public Goods Funding workstream will gather all formal proposals and submit a Snapshot vote to decide which to move forward with. Please do not submit a snapshot vote for your proposal specifically! This just adds confusion and makes it harder for the community’s voice to be heard effectively. ",
                    "links": [
                        "https://gov.gitcoin.co/t/proposal-gitcoin-gr13-matching-pool-allocations/9915",
                        "https://docs.google.com/document/d/1xmGnJ5sL-DZxuUWBEYKVQD7eyPq1ccBZuxmiW-m_g_Y/edit",
                        "https://docs.google.com/document/d/1gMY4Lnn2veNlAguoKHjwtIk-5vSzXTASEXsk_F26Ra0/edit",
                        "https://twitter.com/gitcoin/status/1499161519497433092?s=20&t=pDELl_YVwQwkOU3wJnF8sw",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
                        "https://gov.gitcoin.co/t/can-gitcoin-be-doing-more-to-support-ethereum-protocol-devs/10151",
                        "https://gov.gitcoin.co/t/novel-situation-1-project-should-not-have-a-token-or-raised-vc-funding/10029/17",
                        "https://gov.gitcoin.co/t/decentralizing-the-gitcoin-grants-program/12669",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-18-2022/10660"
                    ],
                    "GPT-summary": "The post is a proposal for the structure and eligibility of Grants Round 14. The proposal suggests maintaining the structure of the previous round, with a main pool, ecosystem rounds, and cause rounds. The proposal also suggests removing the \"no token\" eligibility requirement for grants, and instead triaging appeals on a case-by-case basis. The post also discusses the background and context of the proposal, as well as the limitations of the current Grants 1.0 platform. The proposal will be voted on by stewards, with three options presented.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Community and engagement",
                        "Change to proposal pipeline",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.49025690102079
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#2",
                    "likes": "4",
                    "time": "17/05/2022-19:59:36",
                    "content": "Hey Anika, Thanks a lot for the post and for explaining where gitcoin grants 1.0 stands right now.     annika:  As with the BrightID appeal, we want to move in the direction of putting the definition of a public good into the community’s hands, rather than having this be something Gitcoin prescribes centrally. As the result of that specific appeal makes evident, the ‘has a token’ criteria is not a good barometer of what the community considers a public good – and so we propose broadening the aperture, and triaging appeals on a case-by-case basis.   About this I am really torn. I really think neither FDD nor anybody has the ability “triage on a case by case basis”. This is why rules like no token, or less than $X in VC funding are helpful. They make it easy to weed out applications. It’s very easy to cheat if we triage on a case by case basis. If nothing else simply DOS the people who triage. Claim that token is not owned by the entity applying, claim it was a fair launch and nobody in the team kept any tokens and other things that are impossible to verify with certainty.  Handling token projects I understand this is not an easy problem to solve and it has no good solution but there is multiple approaches to take.  As before As we did before. So set out rules that help guide and set the spirit of how gitcoin grants should work. This makes it manageable by whoever goes through the applications. Especially considering that gitcoin grants 1.0 is in maintenance mode. People can still appeal and explain why their token project is an exception. (these would be a minority).  Drop the no token requirement Say we accept everything and tokens and all is okay but have to make decisions for every project on a case by case basis. This is not manageable in my opinion and also sends the wrong message about what kind of projects gitcoin should fund. The vast majority of token projects follow a certain formula. Which is to keep a certain % of the supply for themselves in their treasury which gives them a big pot of money to work with. Funding such projects further through gitcoin grants sounds ridiculous to me. For the token projects that may be an exception to this rule I would say ask them to appeal on a case by case basis, based on a document that we should create specifying what kind of tokens are acceptable. So make it possible to appeal, but still keep the no token rule, which would both:  Save us time and effort Send a clear message on what kind of projects should be funded by gitcoin   My recommendation So at this point I believe I would vote for and ask other stewards to vote for Option 2.  Option 2: FOR GR14 Structure & AGAINST New Eligibility You approve the GR14 structure as is, but are NOT in favour of us removing the “no token” eligibility requirement. If this option prevails, GR14 eligibility will remains as-is.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.642818292818292
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#3",
                    "likes": "5",
                    "time": "17/05/2022-20:35:45",
                    "content": "    lefterisjp:  Funding such projects further through gitcoin grants sounds ridiculous to me.   I couldn’t agree more. I will be voting for option 2. If projects that have raised money via token sales are permitted to participate, GitCoin will devolve into a marketing campaign. I’m not sure I understand what the justification would be to allow token projects, other than perhaps it’s a recognition of the impossibility of the task of identifying them – I understand that, but I don’t think turning away from the challenge is the solution. One of the things that makes the task of identifying misbehaviour is the speed of the rounds and the fact that the donations are delivered directly upon receipt. In GitCoin 2.0, if every grant recipient was forced to be a smart contract, there could be a three-month escrow of the distribution for both the match and the actual donations. This would leave more time for human evaluations which would make it more effective. Perhaps this would make it less likely that people would try to cheat. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.387276785714286
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lunacat",
                    "index": "#4",
                    "likes": "5",
                    "time": "17/05/2022-21:02:29",
                    "content": "Similar to the above comments about not funding projects that have their own tokens as reserves (100% agree), I also feel strongly that the lobbying groups (eg Blockchain Association and Coin Center) should also be excluded from matching.  These groups have exorbitant funding from corporates, venture capital, and very deep pocketed individuals.  In GR12, CC and BA combined received ~$440k in matching.  I’ve been to several parties these guys threw during this period, and you can safely assume a good chunk of this change went not to furthering public goods, but wining and dining Capitol Hill staffers and officials.  Allocating matching capital to them that could else wise go to furthering open source / public goods is not in line with Gitcoin’s stated mission.  This ship has probably sailed, but just wanted to make the point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.089743589743589
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/polarpunklabs",
                    "index": "#5",
                    "likes": "2",
                    "time": "17/05/2022-21:30:21",
                    "content": "Great work @annika I am just curious what does DEI mean in this context? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.645833333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#6",
                    "likes": "1",
                    "time": "17/05/2022-22:34:30",
                    "content": "Oooof did not know they are still getting funded by Gitcoin. Strong + 1 Especially if your allegations on exorbitant spending are true. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.305555555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/carlosdp.eth",
                    "index": "#7",
                    "likes": "1",
                    "time": "17/05/2022-23:00:23",
                    "content": "Just my 2 cents: this is an important part of effective lobbying, it’s not just having meetings with legislators and educating them, unfortunately. A group that wines and dines people versus just sitting down with them over a powerpoint presentation is more likely to get support, that’s just human nature, especially for people that work in DC. I would personally consider donating to both those organizations probably, if they were in GR14. Political risk to web3 is huge and can’t be ignored, and impacts any and all public goods built on top of it!  Just want to give a different perspective on that point! I wouldn’t want to see all the funding stay with companies for orgs with such influence on fiat law, and Gitcoin seems like an ideal avenue to address that! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.896701388888888
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lunacat",
                    "index": "#8",
                    "likes": "2",
                    "time": "18/05/2022-00:19:04",
                    "content": " Just my 2 cents: this is an important part of effective lobbying, it’s not just having meetings with legislators and educating them, unfortunately.  Yep, this indeed how our world works and I don’t disagree.  I just don’t think matching pool should be used to fund it, especially given (1) CC and BA’s goals aren’t to further public goods / open source, (2) they have ready access to capital, and (3) it takes away from smaller projects that rely on Gitcoin. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.388888888888888
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#9",
                    "likes": "6",
                    "time": "18/05/2022-04:17:04",
                    "content": "I think this is a very fair take. I’m not extremely aware of how funds are spent by these lobbying organizations (and I generally hate the idea of lobbying altogether, but I get why it needs to be done). I understand both sides of why funding advocacy is essential (especially right now), but also that these orgs may already be well capitalized. I do just want to note though, when you said:     Lunacat:  These groups have exorbitant funding from corporates, venture capital, and very deep pocketed individuals. In GR12, CC and BA combined received ~$440k in matching  … Allocating matching capital to them that could else wise go to furthering open source / public goods is not in line with Gitcoin’s stated mission.   The reason why their matching was so high in GR12 is because the donations from matching funders specifically for the Advocacy round was $900k (?) while there are so few grants in that category. Perhaps the corporates, VCs, deep pockets you mention that fund these groups anyway were a primary driver for funding that matching pool. So optimistically, it’s money that would have went into their pockets anyway, only now the general public gets a more democratic say in how it’s distributed You’re correct these grants still take some funds from the main pool, but the max cap was 2.5%, so $25k. I don’t want people thinking CC and BA took $440k from the main pool funds that would have gone to smaller projects, it was more like ~$30k. But yeah I think there is a case to be made that we should decouple some cause, and ecosystem rounds from the main pool, and I’ve made this case internally. We just need to better define what the main pool should include. See results from GR12 broken down by round here:  Screen Shot 2022-05-17 at 9.04.07 PM1908×900 74.9 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.462923280423281
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#10",
                    "likes": "3",
                    "time": "18/05/2022-04:28:43",
                    "content": "I’m also on the fence with token requirements, I think it’s very hard to define. NFTs are tokens. There are *actual valueless governance tokens. There are non-transferable tokens. There are groups tokenizing carbon credits. There are tokens that were airdropped with 100% to the community. There are projects with tokens with no treasury or founder-owned allocation. There are projects doing purely charitable work or UBI with tokens. There are projects doing work with for a larger org that may have a token but the project owners don’t manage it (all the bankless grants). Work on EIP-1559 I believe got some early funding via Gitcoin Grants, but Ethereum has a token  Where do you draw the line? I think tokens are going to be a core part of lots of different areas of web3 (more than we even see now), and many can be public goods but still have a token.     tjayrush:  If projects that have raised money via token sales are permitted to participate, GitCoin will devolve into a marketing campaign.   I definitely agree with you here, and maybe the rules should be no tokens sales, or no token sales that raised >$500k (or whatever the VC threshold is). Rather than an arbitrary measure of market cap (like $20m), I think it should be more of a consideration of whether their work can be / is funded by their token, and whether the project is a public good. But of course that’s impossible to define and will require manual reviews. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.584722222222222
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#11",
                    "likes": "2",
                    "time": "18/05/2022-06:40:24",
                    "content": "As stated in my post the easiest way which would end up with less work imo is to keep a simple requirement and if a token project, like BrightID, feels they should be an exception apply and explain why. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/saintsal",
                    "index": "#12",
                    "likes": "5",
                    "time": "18/05/2022-08:18:59",
                    "content": "It’s worth considering that the centralised “no token” policy excludes:  any hyperstructures (which is a huge space to explore for sustainable public goods, and arguably the future of sustainable FOSS) any public good project using a token for governance any public good using token-gating with communication any project that even looks like it’s building on defi mechanics (eg. just saying you’re inspired by Uniswap/Maker)  So the current policy just cuts out good public goods projects on the first pass, not even giving them a chance to participate on their own merit in the community match-funding. We’re starting to conflate has token with funded by token in this debate, and so does the current policy, which is the problem being addressed by the suggestion to begin with. I think the proposing teams could help inform this discussion by sharing some of the specifics to illustrate why they came to this suggestion.  As a grant applicant, I saw a high load of appeals on Discord, and also noted appeals finding their way through backchannels, so I don’t think this was a few isolated cases like BrightID. I also looked through the Notion tables showing the applications and approval pipeline – something I’d suggest delegates could do if they want to get more specific situational awareness. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.081578947368421
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#13",
                    "likes": "3",
                    "time": "18/05/2022-08:23:55",
                    "content": "I would like to vote AGAINST token, and agree with @lefterisjp and @tjayrush . Reason 1: we need to keep consistent with the rules without token. Reason 2: Most token is delivered by token sales (and the project team had capability to feed themselves) Reason 3: Some token projects are not public goods. Reason 4: I don’t know the reasons (and discussions) for allowing token for the grant. Maybe there are more contexts in FDD and PGF, and would you share more? @annika For token projects, we could review them case by case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#14",
                    "likes": "2",
                    "time": "18/05/2022-09:00:40",
                    "content": "The vast majority of token projects are funded by their token in one way or another. The exceptions can appeal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/saintsal",
                    "index": "#15",
                    "likes": "1",
                    "time": "18/05/2022-09:08:58",
                    "content": "    lefterisjp:  The vast majority of token projects are funded by their token in one way or anoth   Are you stating that generally, or based on the Gitcoin applications? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#16",
                    "likes": "3",
                    "time": "18/05/2022-09:22:36",
                    "content": "Generally. Which would open the floodgates for everyone and their grandma’s chicken to apply for extra funding from gitcoin grants since suddenly token projects would be fine. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 4.888888888888888
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/vogue20033",
                    "index": "#17",
                    "likes": "1",
                    "time": "18/05/2022-14:13:36",
                    "content": "    bobjiang:  vote AGAINST token   I share the same sentiment with @bobjiang on voting against token. Nevertheless, the exceptions can appeal as @lefterisjp rightly said. The good example is in the case of Bright ID.     connor:  I think it should be more of a consideration of whether their work can be / is funded by their token, and whether the project is a public good.   Above all, the most important thing to look out is whether the project is a public good that need to be funded. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.869047619047619
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#18",
                    "likes": "1",
                    "time": "18/05/2022-14:39:08",
                    "content": "    annika:  Option 1: FOR GR14 Structure & FOR New Eligibility You approve the GR14 structure as is, and are in favour of us removing the “no token” eligibility requirement.   This is conversation has been on-going since a while in the FDD over the grants eligibility criteria… I have to mention a few points here:  Governance token have no values… (We need to make a distinction in-between governance token, monetized token and experimental tokens…) Side rounds thematic should be clear or depending on the funding partner, they could have the opportunity to debate/decide to allow a grant who has a token in place, or plan to have a token in the near-by-future which has been seen many times over many grants (Most of them has been denied) But BrightID is a strong example.  In my view, we should keep the main eligibility criteria, under 500k in VC funding or external funding and no quid pro quo as the 2 main standards. Grants that has been denied in the past or currently, can always re-apply, or they can appeal the decision (This can take days and they might not be up for the current funding round)     connor:  I think it should be more of a consideration of whether their work can be / is funded by their token, and whether the project is a public good.   I agree Based on this, I am voting for Option No.1 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.8297448165869215
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#19",
                    "likes": "2",
                    "time": "18/05/2022-15:16:49",
                    "content": "    Sirlupinwatson:  Governance token have no values   Oh but they very much do  We can call them “useless governance tokens” as much as we want but it does not change the reality of the situation, which is they very much have value, and are a funding mechanism. I don’t believe that I need to write this … but Gitcoin itself is the proof. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#20",
                    "likes": "0",
                    "time": "18/05/2022-17:00:19",
                    "content": "I think we should be able to make a clear distinction over Governance Token (There is 2 side on that medal) Monetized Token and Experimental Token at this point…  Economic Value1243×978 97.9 KB    decentralized.quadraticlands.com   Quadratic Lands Gitcoin is where builders, developers, and protocols come together to build and fund the open web.      ",
                    "links": [
                        "http://decentralized.quadraticlands.com/about.html"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#21",
                    "likes": "4",
                    "time": "18/05/2022-18:24:19",
                    "content": "I appreciate the thoughtful comments about this deceptively complex issue.  I will reply to some of the comments as I go.  But ultimately, I think aiming at the most basic layer is appropriate.  Is a given project truly a public good or not?  If the community believes yes, then the token situation is irrelevant.  There seems to be agreement that projects with large treasuries should not be eligible for the grant program, regardless of where that funding originated.  So I would like to eventually see the <$500k restriction be generalized to apply to any source, not just VCs.  But this is a step in the right direction imo. The large influx of applicants which should result from the criteria modifications is a feature during this down market macro state, at a time when other grant protocols are springing up.  The boost to numbers might just extend our Overton window enough to ship G2.0 successfully. I will vote #1.     lefterisjp:  I really think neither FDD nor anybody has the ability “triage on a case by case basis”.   I agree.  But the FDD is already tasked with this challenge.  To truly eliminate the case-by-case assessments we need to establish hard criteria - ‘musts’ not ‘should-s’.  It is the ‘should’ which puts undue pressure on individual grant reviewers.  No single reviewer should be expected to determine, on behalf of the Gitcoin Dao, whether an borderline case is eligible or not.  Especially considering this has been an entry level position into the FDD.  Historically FDD spread this pressure over additional reviewers but this is not scalable.  In fact if we distilled the criteria to a single item it would probably be:  MUST be a public good.  If this is assured the rest is nearly unimportant.  Token no token, open source vs closed source (another contentious matter). Creating public good benefit outweighs all the secondary criteria (probably which evolved to help assess benefit to public goods in the first place).  If we just did a community signaling process on whether borderline grants (as flagged by community and FDD) are true public goods and which are not, the rest becomes noise.     tjayrush:  I’m not sure I understand what the justification would be to allow token projects, other than perhaps it’s a recognition of the impossibility of the task of identifying them – I understand that, but I don’t think turning away from the challenge is the solution.   I believe the justification bubbled up during the BrightID discussions, and was based on the recognition that a great portion of blockchain projects use tokens for both governance and to provide for individual ownership/investment. This combined with the expansion of Gitcoin (bringing in many new reviewers) caused some inconsistent application of the eligibility criteria.  The FDD suggested initial revisions in pursuit of consistent application of eligibility criteria and to increase the number of excellent projects getting funded.     tjayrush:  In GitCoin 2.0, if every grant recipient was forced to be a smart contract, there could be a three-month escrow of the distribution for both the match and the actual donations.   I like the idea of using a 3 month delay whether by smart contract escrow or another mechanism.  In addition to TJ’s reasoning, it provides a large window of time to process any disputes and appeals without causing any disruption to projects accumulating donations. When we remove denied projects from rounds we cancel their ability to accrue donations. If the project later successfully appeals we do not know how much they would’ve earned.  I acknowledge the FDD engaged LexDao to improve and fine-tune the emergent appeal process.  Preserving the donations for denied grants (in event of later good appeal) is high on the priority list.     Lunacat:  I also feel strongly that the lobbying groups (eg Blockchain Association and Coin Center) should also be excluded from matching.   Yes yes yes!  Great point Lunacat. Great to see first-time posters in this thread.  Welcome Saintsal. I will vote #1 and push for future revision to ensure the 500k cap applies to funding from all sources. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.857169622492203
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#22",
                    "likes": "1",
                    "time": "18/05/2022-18:37:24",
                    "content": "Come on … really? GTC has no economic value? So why does the DAO pay salaries with it? Why can I sell it via uniswap for other tokens or via Binance for cash? Please don’t treat me like an idiot. The only reason this was written in that page was for legal reasons. I will remind you that Gitcoin itself had an investment round (Ethereum’s Gitcoin Raises $11.3 Million, Spins Out of ConsenSys - Decrypt), took money (economic value) to spin out of Consensys and create the GTC token and the DAO and paid out the investors in GTC. Investors hunt money and economic value. If it had no economic value then:  The token would be not tradeable The investors (Paradigm, Electric capital etc.) would be philanthropists and not VCs.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.7375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#23",
                    "likes": "2",
                    "time": "18/05/2022-18:49:08",
                    "content": "    David_Dyor:  I believe the justification bubbled up during the BrightID discussions, and was based on the recognition that a great portion of blockchain projects use tokens for both governance and to provide for individual ownership/investment. This combined with the expansion of Gitcoin (bringing in many new reviewers) caused some inconsistent application of the eligibility criteria. The FDD suggested initial revisions in pursuit of consistent application of eligibility criteria and to increase the number of excellent projects getting funded.   So why not keep the no token rule, but specify if the token is only used for governance, and the project has no treasury of said token then it’s fine? Basically push the responsibility to the user to do due diligence instead of pushing it on the DAO? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.489015151515152
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#24",
                    "likes": "0",
                    "time": "18/05/2022-19:00:03",
                    "content": "    lefterisjp:  So why not keep the no token rule, but specify if the token is only used for governance, and the project has no treasury of said token then it’s fine?   This is ridiculous, should we start to look back in time and see for example Bankless (Just to mention this one)? Did we ever made a follow up on any grants? It’s almost like playing a catch me if you can game… I have my opinion and you got yours, which is fine. Not treating anyone as an idiot here… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#25",
                    "likes": "1",
                    "time": "18/05/2022-19:01:39",
                    "content": "    Sirlupinwatson:  This is ridiculous, should we start to look back in time and see for example Bankless (Just to mention this one)? Did we ever made a follow up on any grants? It’s almost like playing a catch me if you can game…   There is no need to look back in time if we don’t change the rules now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party questioning proposal"
                    ],
                    "Sentiment": 4.444444444444445
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#26",
                    "likes": "2",
                    "time": "18/05/2022-19:16:37",
                    "content": "This was closer to the FDD’s original revision suggestion.  Which met resistance for the exact reason you and SirlupinWatson discuss.  Many projects claim to have a Governance token of no value which is actively traded on the open market (like $GTC & $BANK).  So predictions were made that making this change (without the suggestion to keep zero project tokens in a treasury) would take a lot of effort but would not produce the desired changes.  I like the additional clause but I wonder if there is a way to also push this responsibility to the applicant.  Like every grant applicant must provide a team treasury breakdown? It is probably beyond the scope of the average reviewer to conduct treasury analysis…but maybe not… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.701388888888888
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#27",
                    "likes": "1",
                    "time": "18/05/2022-21:13:39",
                    "content": "This would require more time of humans reviewing items rather than being a scalable system. But that might be fine for the number of cases that encounter this issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.291666666666668
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#28",
                    "likes": "2",
                    "time": "18/05/2022-21:19:38",
                    "content": "    David_Dyor:  I agree. But the FDD is already tasked with this challenge. To truly eliminate the case-by-case assessments we need to establish hard criteria - ‘musts’ not ‘should-s’. It is the ‘should’ which puts undue pressure on individual grant reviewers. No single reviewer should be expected to determine, on behalf of the Gitcoin Dao, whether an borderline case is eligible or not.   This is the issue. With the BrightID appeal we asked to have the policy change as part of a snapshot vote, which would then allow the law to fine tune to an acceptable solution. Since the stewards did not want a vote, it remains in someones hands, and that is currently FDD. We were going to implement a Celeste or Kleros solution, but the dGrants project was stopped and grants 2.0 started. Either way, the no vote was a vote for the ambiguity to continue and no discernable process for evolving the law to be in place. We have started talks with LexDAO Impact Clinic to guide us through designing a proper appeals system. cc @bestape ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.043367346938775
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#29",
                    "likes": "1",
                    "time": "19/05/2022-12:04:51",
                    "content": "Hello everyone, thank you @annika for raising these collective concerns we have been having, before diving into the actual proposal I would like to reveal the situations from the GIA’s perspective and also mine. The main issue is that people/projects/organizations view Gitcoin as the GO TO place to get funding(like the Kickstarter of web3 and indie projects). Most of the applicants don’t even care what the eligibility criteria are or what our mission at Gitcoin is. They just want funding and will try anything to get it. Given the complexity and diversity of the grant applications, I believe we did an amazing job filtering out these type of projects in GR12 and GR13, but not all of them, that is currently impossible if we really want credible neutrality/fairness in the grants program. We need a reason to deny a project, we cannot deny it just because we want to. After reviewing thousands of grants(GR11, GR12)  and approving even more(GR12, GR13) I think I am one of the few people that has clear view on what’s going on. 1. A lot  of the people that apply for funding don’t care that much about Gitcoin’s mission 2. A lof of the people that apply for funding don’t care that much what the rules are…until they get denied. 3. A lof of the people always tend to “milk the cow” until the very last drop, so they will resort to very complex tactics to get their grant applications into an “approvable” format 4. People that want to game the system can read in Discord and also on the forum and basically create a perfect grant “recipe” which only has the goal of extracting $ from Gitcoin, Gitcoin’s users and our partners. (this will be a vulnerability also in Grants 2.0 ) Sorry for the tags I just want everyone to be aware of these situations and also to try to see the situation from another angle @lefterisjp @Lunacat @tjayrush I think that @connor nailed it     connor:  NFTs are tokens. There are *actual valueless governance tokens. There are non-transferable tokens. There are groups tokenizing carbon credits. There are tokens that were airdropped with 100% to the community. There are projects with tokens with no treasury or founder-owned allocation. There are projects doing purely charitable work or UBI with tokens. There are projects doing work with for a larger org that may have a token but the project owners don’t manage it (all the bankless grants). Work on EIP-1559 I believe got some early funding via Gitcoin Grants, but Ethereum has a token  Where do you draw the line? I think tokens are going to be a core part of lots of different areas of web3 (more than we even see now), and many can be public goods but still have a token.   I think Connor really described the core issue of denying grants with tokens. We already accepted a lot of grants that use NFTs for funding all kinds of initiatives…like sell NFTs to raise $ for a cause. I see no issue in grants having a token to sustain their activity if they are building toward the common good.  A possible solution: 1. We could clearly redefine some of the acceptance/denial criteria for each round (clearly state what is acceptable and what is not)  and make that known! Now getting into the comments…     lefterisjp:  About this I am really torn. I really think neither FDD nor anybody has the ability “triage on a case by case basis”. This is why rules like no token, or less than $X in VC funding are helpful. They make it easy to weed out applications.   How would you recommend handling these types of situations? Different rounds have different levels of acceptance/restrictions via grant applications. That makes our job in the GIA way harder than it should be. How do we maintain credible neutrality if a grantee gets denied for the same reason others get approved?  When people reach out in support and ask: Hey why was my grant denied, it’s exactly like this other grant that was approved? The GIA(me, @David_Dyor and @vogue20033 ) and also the FDD really cared about each and every grant creator(I know how hard starting out is).  I personally answered to all of their questions and tried to help them understand what’s going on. Not a few believe that we are biased in our approach and I also believe that. We sometimes favor BIG projects over SMALL ones because of their influence and sometimes we are are more likely to approve projects that are our FRENS.  It that credible neutral?  The issue with creating a threshold like  500k $ is the fact that we could be cutting funding to projects that are OS and building for the public good, but need wayyy more $ than 500k to reach their goals. We will see in GR15…     lefterisjp:  Come on … really? GTC has no economic value? So why does the DAO pay salaries with it? Why can I sell it via uniswap for other tokens or via Binance for cash? Please don’t treat me like an idiot. The only reason this was written in that page was for legal reasons.   100% agreed, I’m keeping it real here: the reality we all live in is a kinda vortex in which the law is used as a cover up and we make rules that can be easily broken… Even if Gitcoin started that way, I see no issue with that, we didn’t have other ways of funding a project like Gitcoin back then. . Maybe when true believers in web 3 will gather the right amount of capital this will change     lefterisjp:  The vast majority of token projects are funded by their token in one way or another. The exceptions can appeal.   I kinda agree with this, but what if they are funding their projects with their token to continue building cool stuff? Why should we discriminate between token and no token? That was the reason Annika wrote this proposal. For GR15 we should try to create more threshold like the 500k $ one…a example: Projects that donate over X percent of their profits to public goods or use the funds to build around a cause should be allowed I will vote with Option 1! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.502658635224424
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#30",
                    "likes": "1",
                    "time": "19/05/2022-12:24:13",
                    "content": "    ZER8:  How would you recommend handling these types of situations? Different rounds have different levels of acceptance/restrictions via grant applications. That makes our job in the GIA way harder than it should be. How do we maintain credible neutrality if a grantee gets denied for the same reason others get approved?   Deny all token projects and let them appeal explaining why it’s not used as a funding mechanism. If they have a token that’s sufficiently funding them deny the project.     ZER8:  I kinda agree with this, but what if they are funding their projects with their token to continue building cool stuff? Why should we discriminate between token and no token? That was the reason Annika wrote this proposal.   Because they already have a funding mechanism in place through the token and gitcoin grant matching pot is not the place to supplement their income from. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#31",
                    "likes": "1",
                    "time": "19/05/2022-12:28:52",
                    "content": "The funny part is that until GR13 we actually DID! But as I explained there were already some projects with tokens approved and some rounds are more permissive towards this hence we need a general rule      lefterisjp:  Because they already have a funding mechanism in place through the token and gitcoin grant matching pot is not the place to supplement their income from.   Hmm, well ok, but we have a lot of grants approved that have a funding mechanism, not that ez to solve. I would ask: Should we investigate the funding mechanisms of each and every project that is now active on the platform and draw our conclusions from there?  This will only lead to conflicting situations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#32",
                    "likes": "3",
                    "time": "19/05/2022-12:34:23",
                    "content": "    ZER8:  Should we investigate the funding mechanisms of each and every project that is now active on the platform and draw our conclusions from there?  This will only lead to conflicting situations.   Either that or simply define the no token rule better and more concretely via a document. And make a post publishing and outlining this document and ask the community itself to flag existing grants:  By asking the grant owners why do they still have an active grant when there is a token? Flagging them to the DAO.  Effectively push a lot of responsibility to the community to weed out existing grants that should also follow this rule. You’d be surprised at the result. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.87962962962963
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#33",
                    "likes": "3",
                    "time": "19/05/2022-12:46:41",
                    "content": "    lefterisjp:  And make a post publishing and outlining this document and ask the community itself to flag existing grants:   The community can flag grants and is already flagging, but that doesn’t mean that they will take up the time to really research that project outside of Gitcoin(where the truth lies), they will just read the descriptions on the platform. We cannot assume that everyone tells the truth in that description… Believe me we are doing everything we can, we pushed for the creation of a Grant Investigations squad specifically for this reason…people lie and deceive the platform and the community doesn’t have all the inputs to check. There are more solutions to this…we are working towards that. But as time goes by these situations will be more frequent not less… We need to be on the same page and aware of the issues that we face in order to understand the magnitude of the situation. A lot of stewards and influential figures from the DAO don’t know what our challenges within the FDD(specifically GIA regarding this issue) really are and how we are solving them.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.798611111111112
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#34",
                    "likes": "1",
                    "time": "19/05/2022-12:51:28",
                    "content": "    ZER8:  The community can flag grants and is already flagging, but that doesn’t mean that they will take up the time to really research that project outside of Gitcoin(where the truth lies), they will just read the descriptions on the platform. We cannot assume that everyone tells the truth in that description… Believe me we are doing everything we can, we pushed for the creation of a Grant Investigations squad specifically for this reason…people lie and deceive the platform and the community doesn’t have all the inputs to check. There are more solutions to this…we are working towards that. But as time goes by these situations will be more frequent not less…   So your solution is give up and open the doors to all token projects? I am sorry but this is not a solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.3046875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#35",
                    "likes": "2",
                    "time": "19/05/2022-12:51:54",
                    "content": "    David_Dyor:  But ultimately, I think aiming at the most basic layer is appropriate. Is a given project truly a public good or not?   This should be the primary question for every grant, thanks David for your comments! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.46875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#36",
                    "likes": "2",
                    "time": "19/05/2022-14:00:52",
                    "content": "Give up on what? I’ve explained that we started investigating grants from other perspectives, something that I’ve pushed solely for the benefit of the Gitcoin Grants Ecosystem… Btw, it is not “my” solution.  This is a proposal and we each vote on it. If I personally didn’t care for our collective mission, why would I make my own job harder by voting for “Yes, allow grants with tokens” ? Who would vote in favor of increasing his own workload  this season…?  This is not about what I believe, it’s about credible neutrality and in my view if we just don’t allow projects with tokens/NFTs this would be a loss for the ecosystem as a whole.     lefterisjp:  So your solution is give up and open the doors to all token projects? I am sorry but this is not a solution.   I think that is the aligned vission with Grants 2.0, yes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.597222222222222
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#37",
                    "likes": "4",
                    "time": "19/05/2022-14:21:01",
                    "content": "QF grants with no rules and a completely off-hands unmoderated approach will never work. In such a case any project, no matter how big or well funded can take part and apply. Assuming byzantine behavior and non-honest participants the QF round then devolves to a battle between the marketing departments of big organizations. Which organization can better use their well funded marketing team to organize social media campaigns to get the most people to vote for them and drain the matching pot in their favor? In the meantime, the projects that really need the funding, 2-3 devs banding together to build a public good get nothing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#38",
                    "likes": "4",
                    "time": "19/05/2022-14:49:04",
                    "content": "    lefterisjp:  QF grants with no rules and a completely off-hands unmoderated approach will never work. In such a case any project, no matter how big or well funded can take part and apply.   I agree, we will always need grant curation and yes, it’s great to get the community involved(as you stated above), that’s why we will be using Ethelo to begin the shift to permissionless reviews  We will still have trusted reviewers in that permissionless system that handle the main round and if other ecosystems/causes want to use this system, they will be able to do it. Each round could have it’s own rules and people that will be paid to curate(review) according to those rules. We will see how Grant Investigations perform at the end GR14 and how many fraudulent/malice/non-eligible grant applications we will find. Lately we also figured out that we need to investigate grants from round to round to ensure that they are not just “milking the cow” and actually building something. This     lefterisjp:  Which organization can better use their well funded marketing team to organize social media campaigns to get the most people to vote for them and drain the matching pot in their favor? In the meantime, the projects that really need the funding, 2-3 devs banding together to build a public good get nothing.   I agree…this is what I am actually worried about. That’s why we handle every case with equal importance. A “small” project today can be the next “Uniswap” or even “GItcoin”  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.675
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#39",
                    "likes": "2",
                    "time": "19/05/2022-15:24:13",
                    "content": "Yes. This was the basis for the decision with BrightID and we made that decision based on feedback from 138 Gitcoin users who overwhelmingly wanted us to fund public goods over worrying about exact policy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving feedback on proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#40",
                    "likes": "3",
                    "time": "19/05/2022-15:39:01",
                    "content": "    lefterisjp:  QF grants with no rules and a completely off-hands unmoderated approach will never work.   I agree. This is my reasoning for funding the “Trust Building” squad in option 2 on our (FDD) budget proposal. We need to provide communities with a software tool that decentralizes their content moderation (grant eligibility). The other argument is that we should ship Grants 2.0 and let communities delegate the authority. Either way, a marketplace will be formed for better solutions to the problem, but unfortunately the one that is not delegated authority would be a public good infrastructure that no one entity would invest in building. I believe that if we don’t invest in it now, to ship it with grants 2.0 protocol, then it will not be built.     lefterisjp:  Assuming byzantine behavior and non-honest participants the QF round then devolves to a battle between the marketing departments of big organizations. Which organization can better use their well funded marketing team to organize social media campaigns to get the most people to vote for them and drain the matching pot in their favor? In the meantime, the projects that really need the funding, 2-3 devs banding together to build a public good get nothing.   Yes, and if there is delegated authority to moderate content, then it is easy to corrupt. But if we shipped a tool for the communities to express their inter-subjective consensus, we would empower better results aligned with our overall mission. Communities will choose different “funding stacks” with grants 2.0. These stacks will be composed of 4 modular components:   Funding mechanisms (Voting weight distribution) - QF, Pairwise QF, MACI, SACI, 1p1V, Pluralist Pairwise QF, QF w/ $1 Tax, etc   Grant discoverability curation (Who gets the best spot on the shelf) - Staking on grants (TCR), JokeDAO/nounsdao curation method, Pluralist signalling   Grant eligibility curation (Content moderation) - Delegated authority, Oracles, Inter-subjective consensus, tbd new models…   Sybil-Resistance Services (How do we know each voter is legitimate?) - Algorithmic (dPoPP reader or current ML), rules based (constraints based on dPoPP stamps or other reputation/holdings), Deep Learning, staking on other users, mechanism design tied into the funding mechanism, etc   When these stacks compete to see which allocates public goods funding in a way that is best for the community, the evolutionary pressue is on matching pools to select a funding stack that works for the users/participants/donors. The idea would be that we can allow the public goods funding rails to compete with each other rather than the capital itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.767171717171717
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#41",
                    "likes": "8",
                    "time": "19/05/2022-23:20:37",
                    "content": "Hey everyone. Glad to see this thoughtful and constructive discussion of these important topics. I personally feel strongly that projects should not be disqualified for having a token or NFT. Frankly this is the core infrastructure of web3 it seems misguided to eliminate projects from potential funding for wanting to build things that use cryptoeconomic building blocks. I’m focused specifically on ReFi projects and other projects in the cause rounds who are trying to use these tools to make the world a better place. I believe we should be encouraging the use of crypto as a key part of their projects infrastructure. Isn’t that what we want? Why would we discourage using cryptoeconomics and composability to coordinate and fund solutions? I tried to explain this debate to a friend who isn’t in crypto and they couldn’t wrap their head around it… “wait the people in crypto don’t want to fund projects that are using tokens and NFTs”. There is a big difference in my opinion between a token sale and the use of a token for say carbon credits or as a mechanism for governance. Yes these tokens have value but that is a good thing in these situations. Does it automatically mean these projects no longer need funding? Maybe if they did a token sale and raised millions of dollars that is a different story but in that case we are really talking about how much funding a project has already which is less of an issue of having a token and more an issue of a variety of external factors that effect the size of their treasury. It feels to me like the token rule idea is a hold over from the ICO days. I’m all for taking steps to ensure projects are not scams, and focusing the majority of our support to projects that need it but simply cutting out anyone who is using tokens cuts out a big chunk of our community in DAOs and ReFi projects. I think an appeal is one possible solution as has been suggested. Another approach would be to carve out some exceptions to that rule like for example not excluding ReFi projects for using tokens for climate solutions. “Appeal” feels a bit punitive, perhaps we need to be more nuanced about how these decisions are made especially in ecosystem and cause rounds. Refi projects are very up front about what they are building and why, they shouldn’t have to appeal as if they are asking for forgiveness for something they are doing wrong. They should apply for funding and we should have the capacity to make nuanced decisions based on use cases. I am acutely aware of the operational constraints we are already working within and the implications of a more nuanced process. Thus I think its important we are clear about what we consider appropriate and what we don’t so that team members can focus on implementing those rules and don’t need to go through multiple rounds of initial review and then appeals. If this is indeed going to be ReFi Summer we should think carefully about the implications of this decision. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.678661616161617
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#42",
                    "likes": "12",
                    "time": "20/05/2022-00:01:30",
                    "content": "It actually seems like the two points of view here are not that different: Option 1: No token policy stays, but projects that want to can apply for an exception and can be approved after a review (case by case basis) Option 2: Token policy is updated with some general guidelines and thresholds, but projects still are applying anyway when opening a grant and are always subject to review and approval (case by case basis) I don’t think anyone is really trying to change the policy to “all projects with tokens are allowed no matter what”, but maybe that wasn’t explicitly clear in the initial proposal. I also don’t think anyone is really arguing for a “no token projects allowed no matter what” either. It doesn’t look like we’ll come to a resolution to make a change before GR14, and that’s ok. But IMO these two options are essentially the same thing in practice. So I suppose the question is, which one is more work for the DAO, and which one is fairer for grants. I’d argue even if we went for option 1, we’d still want to provide some guidance and criteria about what types of projects/tokens are likely eligible for an exception (so we don’t get as many applications to review that are obvious declines, and so our reasoning is public/decisions are justifiable and applied equally). This makes it even closer to option 2, essentially the same thing. I think in the long term it will be less work for the DAO and fairer to grantees if we provide general guidelines for what kinds of token projects could be approved, and provide some examples, even if the metrics are not strict values. So before making a decision here, I think the details to nail down are 1. What is the review/appeal process (I don’t think a BrightID situation with a big forum debate and governance vote is scalable, FDD will likely have to make decisions, all the more reason to set public guidelines), and 2. What those rough guidelines should be (market cap? treasury? funding/runway? type or mechanism of token? etc) Again, doubt this can happen before GR14, but just wanted to state that I really think most people in this thread are in agreement that certain types of projects with tokens should be allowed, but simply disagree on the best policy to communicate and enforce that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.605530753968254
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#43",
                    "likes": "5",
                    "time": "20/05/2022-15:30:01",
                    "content": "    connor:  Again, doubt this can happen before GR14, but just wanted to state that I really think most people in this thread are in agreement that certain types of projects with tokens should be allowed, but simply disagree on the best policy to communicate and enforce that.   Yes. As stated above exactly because of this I think we should not change the rule at all now, but instead properly define what token projects are okay. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.48015873015873
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#44",
                    "likes": "3",
                    "time": "20/05/2022-22:06:35",
                    "content": "Well said. Totally agree. I think we are all saying similar things here.     connor:  It doesn’t look like we’ll come to a resolution to make a change before GR14, and that’s ok. But IMO these two options are essentially the same thing in practice. So I suppose the question is, which one is more work for the DAO, and which one is fairer for grants.   +1 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#45",
                    "likes": "8",
                    "time": "23/05/2022-08:40:31",
                    "content": "This conversation has evolved since this post, but I feel the need to clarify the following exchange:     ZER8:      lefterisjp:  So your solution is give up and open the doors to all token projects? I am sorry but this is not a solution.   I think that is the aligned vission with Grants 2.0, yes.   Regarding the vision for Grants 2, it is not our vision to change the way Gitcoin runs its rounds. It is our vision to enable grant programs outside of Gitcoin to come to their own policy decisions with their communities and to tailor their programs to their needs. These will and should differ from the set of choices the Gitcoin community has made to run our grant rounds. Let’s not conflate the choices we make for the running of our rounds at Gitcoin, with the choices other communities may make when using the Grants 2 protocol. The community decided policies for Gitcoin grants will still hold when Gitcoin runs its rounds on top of Grants 2.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.339285714285714
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#46",
                    "likes": "4",
                    "time": "23/05/2022-12:38:03",
                    "content": "Thanks everyone for the thoughtful dialogue here - eligibility is definitely a nuanced topic, and it is great to see so many people engaging so passionately. The proposal is now up on Snapshot for voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.607142857142858
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#47",
                    "likes": "2",
                    "time": "23/05/2022-15:06:14",
                    "content": "Thank you for the clarification. I forgot to specify that the main round will not align. It’s also a very good idea to let the communities decide. You/we could inform them and brief the round owners on how we suggest they should run their round and what are the biggest issues/vulnerabilities and no-no’s  (that we encountered) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.397222222222222
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#48",
                    "likes": "1",
                    "time": "23/05/2022-23:15:09",
                    "content": "There has been a lot of debate here, I want to mention I really appreciate the discussion. It’s opened my eyes to a number of use cases I hadn’t considered, and the broader implications of us denying a grant. I still feel that those with a token should apply, get denied, and then appeal. I know this creates friction for us, but to me it send the “right” message that token launches (which fund a project) are a big deal, and exclude you for funding from the community match pool. Like it was pointed out, we want to offer more granularity to those ecosystems who are okay with having a token, but we dont have that ability yet. so… for GR14, I would say we keep the rules the same and then evaluate once we have Grants 2.0 ready. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#49",
                    "likes": "1",
                    "time": "24/05/2022-11:33:21",
                    "content": "Agree here and should those allegations be true it is 100% not conducive to levelling out the playing field in terms of access to resource ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#50",
                    "likes": "2",
                    "time": "24/05/2022-11:38:02",
                    "content": "A protocol should always be un-opinionated and specific communities should come with their own rules. A best practices can be shared based on Gitcoin experience but again, each community will be able to take what they need and leave the rest ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#51",
                    "likes": "3",
                    "time": "24/05/2022-11:42:11",
                    "content": "Can we apply a matrix here as I am trying to do in the governance flow so that an easily digestible and usable format is in place for people to be able to self determine eligibility? Almost a “are you aligned enough to ride” dynamic where we have a set of attributes that must be met for an eligibility score? Very much pulling from the engagement score we’re been working on with Steward Cards and creating a pattern of self evaluation and accountability vs pages of text… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.193333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#52",
                    "likes": "2",
                    "time": "24/05/2022-17:11:20",
                    "content": "There is a side-effect to making the eligibility change.  A likely big increase in approved grants. I think this will have beneficial PR optics in a time of decreasing momentum and bear markets.  In season 13 we had our first decrease in numbers…this doesn’t paint a nice picture.  How much better would it look if we were able to announce big increases to approved grant numbers? This might help extend our Overton window… Also, I want to re-state my view that If a project is a true public good it really doesn’t matter whether they have NFTs or other tokens. If only we could quickly hold community polls about the projects of questionable public good benefit we could ignore the entire token/nft debate.  If a project is deemed a true public good or public-good-benefit by the majority of our community the fundraising methods become irrelevant (unless illegal or unethical).  The more fundraising such a project achieves the more benefits accrue to public goods.  Even if by an NFT sale. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.844135802469136
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#53",
                    "likes": "2",
                    "time": "24/05/2022-18:14:19",
                    "content": "We will always be here for consultancy. I was talking from a POV in which it would be a waist of resources to not share with them what we believe is of crucial importance for their success.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/puncar",
                    "index": "#54",
                    "likes": "0",
                    "time": "25/05/2022-12:36:33",
                    "content": "@David_Dyor - we discussed the last round the eligibility for multiple grants proposals from one DAO/organization, so I just wanted to check if multiple-proposal from one community is still not an option. to recap on the specific topic:  Bankless has 23 000 members, and they are working in self-organized groups, called guilds and projects. Some of the projects may/may not be a public good (Bankless Academy, Bounty Board, DAO dash, Ultrasound merch, and many more) As of now, a few tried to apply but have been declined based on the one DAO one proposal rule  My question is if this rule still applies for GR14 or not And my second question is, does this rule apply only for the main matching round or overall. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4523809523809526
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#55",
                    "likes": "0",
                    "time": "25/05/2022-15:40:41",
                    "content": "It surprises me sometimes how far we’ve gotten away from the original intent of the Quadratic Funding paper. The ‘curator’, at least in my reading of that paper, was supposed to be the community itself. I feel that what’s happened is that “GitCoinDAO” the organization has taken over “Curation” task and as a direct result any hope of the community building that skillset themselves will disappear. The obvious, logical conclusion of the path we’re on is human-in-the-loop, centralized KYC. The discussion should not be about whether or not a centralized workstream should allow or disallow projects to participate with or without tokens. It should be about how we can enable, teach, train, and foster an environment where the community builds the skillset themselves. Having said that – we shouldn’t allow projects that are already funded with tokens to receive matching funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#56",
                    "likes": "2",
                    "time": "25/05/2022-18:00:35",
                    "content": "Right now the vast majority of projects that have tokens also receive some funding benefit from them (e.g. holding in treasury, selling to investors, etc) upon launch or sometime in the future when tokens become transferable. In these cases, I don’t think it makes sense for them to get matching funds on Gitcoin so we can prioritize public goods that don’t have a clear funding mechanism. I lean towards the process of token projects that aren’t using them for funding (e.g. team/treasury didn’t retain any tokens, etc) can apply for an exception. I also believe we can adjust the eligibility later on if we’re seeing way more tokens unrelated to funding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.63265306122449
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#57",
                    "likes": "0",
                    "time": "25/05/2022-18:15:59",
                    "content": "    connor:  I think the details to nail down are 1. What is the review/appeal process (I don’t think a BrightID situation with a big forum debate and governance vote is scalable, FDD will likely have to make decisions, all the more reason to set public guidelines), and 2. What those rough guidelines should be (market cap? treasury? funding/runway? type or mechanism of token? etc)   Agree. So I hope the FDD team can share these refined guidelines. For now I will abstain from voting because it is unclear to me if a yes vote would lead to rushed implementation. I do not think this will be the case but would love in any case to see the draft of these eligibility criteria first and hear if they will already be used in GR14. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.621527777777777
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#58",
                    "likes": "2",
                    "time": "25/05/2022-19:03:59",
                    "content": "Although I voted for, if “against” wins, we will need to rapidly update the appeal process to execute in a day or two for most cases. This is doable for GR14. Thanks @annika for getting ahead of this so we can prepare based on the results of the vote! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#59",
                    "likes": "2",
                    "time": "25/05/2022-19:52:19",
                    "content": "    linda:  can apply for an exception   Since the criteria published in gr13 (and historically) is “A project should not have a token” we do not need to create an exception/exemption process imo.  FDD reviewers can already recommend approval of projects with tokens based on their judgement & discretion.     krrisis:  to see the draft of these eligibility criteria first and hear if they will already be used in GR14.   The FDD put forth their recommended changes to token-policy in GR13 which did not proceed to Steward vote. Since then there has been intermittent coordination between PGF and FDD to try and come up with a suitable suggestion that might reach and pass Steward vote.  Unfortunately there seems to be a diverse range of opinions on how best to deal with the token issue which doesn’t appear headed for fast resolution.  The matter is bigger than the FDD alone imo.  This is why the FDD attempt during GR13 did not reach the voting stage.  People wanted to contribute to the discussion and did not want the FDD deciding unilaterally. Feels like we are drifting from the topic of GR14 structure but since the appeal process was brought up I can give a brief summary:   All appeals requests are started via a Google form (posted on the Grant Eligibility Notion page).   FDD assesses all requests for merit.  Any with merit (usually based on simple mistakes) get processed internally by the FDD  unless they are based on a Novel Situation (NS), which is the most complex case, as we saw with BrightID   The google form states that NS appeals will get 3 days of Gov forum discussion followed by 3 days for Snapshot vote.    The 3 & 3 timeline, suggested by FDD last season, has never been used (or approved by Stewards).   (imo we need to eliminate Steward voting from the Appeal process for true efficiency).   FDD is engaging LexDAO to help refine the process, especially for NS.  This part of the process is an experimental work-in-progress that has not been ratified by Stewards.  Instead of clinging to historical procedures designed before the Dao existed the FDD is now considering the challenge from a blank-slate perspective, now with LexDAO.   Notes: -Most appeals other than NS can be dealt with quickly (<48 hours). -The plan is to replace the FDD assessment stages with assessment by a decentralized group. What does this mean for GR14?  The FDD is prepared to deal with the majority of appeal requests quickly.  Should any NS Appeal get requested we should expect dao-wide lengthy vigorous debates. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.505833333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#60",
                    "likes": "5",
                    "time": "25/05/2022-20:06:44",
                    "content": "    tjayrush:  I feel that what’s happened is that “GitCoinDAO” the organization has taken over “Curation” task and as a direct result any hope of the community building that skillset themselves will disappear.   From my perspective, as someone who has been with Gitcoin Holdings for over 3 years, what we see happening with the GitcoinDAO and FDD/PGF workstreams is exactly what you describe, community curation. 2 years ago approvals and eligibility were solely handled by people within Gitcoin Holdings, with no governance or public debate. FDD’s evolution IS the community building that curation skillset, why would that hope disappear? Anyone can join the DAO and volunteer to curate,  we’re having these open debates in a public forum on policies/appeals, governance votes are open. Sure we could have the community more involved using a governance vote on every grant application but that would be a bit messy…     tjayrush:  The discussion should not be about whether or not a centralized workstream should allow or disallow projects to participate with or without tokens. It should be about how we can enable, teach, train, and foster an environment where the community builds the skillset themselves.   These aren’t mutually exclusive, we need a platform-wide general policy that the community agrees to, and we also need to enable + train the community to curate (FDD). The reality is grant reviewing, curating, and approving, is time intensive and not the most fun work. No one is going to do it for free just to build a skillset, we need to compensate those putting in the time and effort, hence, a workstream is created.     tjayrush:  The obvious, logical conclusion of the path we’re on is human-in-the-loop, centralized KYC.   I don’t think this is obvious or logical, we’re on the opposite path, this is where we started, and we’ve been progressively moving away from it. But yes I do think we could build out a more decentralized dispute and arbitration system, maybe with staking, voting, incentives, etc. But we’d still need a general platform-wide policy. I also want to say that this is all specific to GitcoinDAO operated rounds - ideally with Grants 2.0, anyone will be able to run their own custom round whenever they’d like, and choose how they curate (via a centralized team or decentralized community). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.135416666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#61",
                    "likes": "0",
                    "time": "26/05/2022-15:41:43",
                    "content": "I think you missed my point. The point I’m making is that in the original paper, the curation function was supposed to be handled by the individual donations from the community. That was the mechanism that was meant to curate “good” projects from “bad.” There was an acknowledgement in that paper that there was a Sybil problem, but there was no mention of a gatekeeper (that I remember). I’m talking about the gatekeeping function. There are well-established methods to do gatekeeping in a non-smart-contract (i.e. human-in-the-loop) world. Those methods are called KYC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#62",
                    "likes": "5",
                    "time": "26/05/2022-21:02:50",
                    "content": "This is exactly why I think building a decentralized grant curation infrastructure is so important. This is the outcome we will get from a combination of grants 2.0 components and FDD research. First, by connecting Ethelo to scale our grant reviews we are NOT trying to say Ethelo is the future tool. To date, we have spent $4k on the integration which Ethelo has spent more $$$ and time in building for us. What it does do is allow us to open up reviews to be done by anyone. However, we choose how to weight those reviews. For GR14, we will only consider the trusted reviewers for production use, and we will verify the results with the previous method. At the same time, we want to know how we could make the criteria validation decentralized and permissionless. Gitcoin Passport will allow us to give review stamps and model a use case that is outside of simply sybil defense (but also is an AMAZINGLY HIGH QUALITY sybil signal!) That is why this work was done last season: GIA Rewards OKR Report This season as we gather data from the live Ethelo experiment, we will run the data through the simulations built off the research above. You can see the simulation software here: https://github.com/dRewardsSystem/Rewards This will allow us to find mathematic proofs and kill assumptions/falsify hypothesis about the system. Then through a proper research, hypothesis, experiment, development cycle, we would hope to be able to provide decentralized and permission-less grant reviewing that uses inter-subjective consensus to ANY community that wants to use it with the launch of Grants 2.0. If we don’t fund building this and simply use delegated authority ourselves, the odds of another ecosystem building this are slim to none, but the work is almost done! The benefit is analgous to a distributed ledger over a database. It is triple entry accounting that fundamentally changes the game theory. Because users get incentivized to review one grant against one criteria that is randomly selected at a time, and that criteria and grant is filtered to the total set of criteria for any community-curated ecosystem, it makes the optimal strategy provide trusted outcomes. It also is much cheaper to defend than to attack. Another really cool benefit that helps push the legitimacy flywheel is that anyone who has a Gitcoin Passport could then participate and get paid for doing reviews, which then incentivizes passport adoption. The output of the grants 2.0 project registry flyweel and the output of the anti-sybil flywheel have a positive feedback loop supporting each other via utility use cases for GTC!  This is an exponential form of the Jet Engine effect @owocki has talked about. ",
                    "links": [
                        "https://github.com/dRewardsSystem/Rewards",
                        "https://gov.gitcoin.co/t/the-grants-2-0-flywheel/10711",
                        "https://gov.gitcoin.co/t/the-gitcoin-anti-sybil-flywheel/9417",
                        "https://gov.gitcoin.co/t/the-gitcoin-anti-sybil-flywheel/9417"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.351848223615465
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#63",
                    "likes": "4",
                    "time": "26/05/2022-22:43:54",
                    "content": "Ah, I see what you mean, my apologies for the misunderstanding. Yeah, I do agree in an ideal world, no manual curation would be needed at all, and the QF mechanism itself would naturally provide the curation. This community curation is part of the appeal for protocols to run ecosystem rounds, instead of or in addition to their traditional grant programs (even with the manual curation, it’s much more community-oriented). In practice though I don’t think it’s realistic, at least right now. One example of why: it’s not uncommon to find 100% fraudulent grants that are impersonating a legit project, but created by someone totally unrelated to that project. It’s tough for the community to verify (much less get every individual to do their due diligence), and often the project’s real owners don’t find out about the fake grant until much later. Another example is quid pro quo. Any project could open a grant and tell their community “hey all donors will get an airdrop” or “we’re raising our seed token round via Gitcoin Grants” and incentivize tons of donations that way. Sure, a lot of the community might protest and raise concerns, but if the only curation method is donations, that grant will still take home a huge undeserved portion of the matching funds. And at the end of the day, we probably can’t have a truly open QF protocol curated only via donations until there is a real decentralized identity system widely adopted that is rock solid (and that could take 5? 10? 20+ years?). Plus much better decentralized arbitration systems. I definitely agree with the spirit of your opinion on this, and would like to see us move progressively towards that vision, but realistically it’s a long way out ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.146665386584742
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/gmkung",
                    "index": "#64",
                    "likes": "1",
                    "time": "27/05/2022-03:05:20",
                    "content": "On the topic of decentralized curation and arbitration, has there been discussion of using Kleros or Kleros Curate as a solution? Kleros has been used for the approval of bounties and grants for years now, and can be a very viable solution for decentralizing the gatekeeping of eligibility for grant pools (an important feature to have as mentioned by @lefterisjp). Kleros also has the ability to be incredibly generate purpose and comprehensive in the things that should be checked for, utilizing the judgment of a decentralized jury to complement the current usage of decentralized ID systems like Proof-of-Humanity (@connor)  to prevent malicious projects from draining the pools. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tjayrush",
                    "index": "#65",
                    "likes": "2",
                    "time": "28/05/2022-21:45:10",
                    "content": "    connor:  and that could take 5? 10? 20+ years?   Totally understand. Thanks for responding. I think what you say above is true. I guess I’m saying, “Let’s get started…” It’s all good though. Cheers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "104"
}