{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/digest-44-decentralizing-gitcoin-grants-and-how-do-we-handle-protocol-adoption/12192",
            "title": "Digest #44: Decentralizing Gitcoin Grants, and \\xe2\\x80\\x9cHow Do We Handle Protocol Adoption?\\xe2\\x80\\x9d \\xe2\\x9b\\x93 ",
            "index": 12192,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "contributors",
                "stewards",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/alexdwagner",
                    "index": "#1",
                    "likes": "1",
                    "time": "30/11/2022-22:53:01",
                    "content": " 1442×260 92.3 KB   Digest #44: Decentralizing Gitcoin Grants, and “How Do We Handle Protocol Adoption?”     The Future of Gitcoin Grants Yesterday, Madison and Maxwell from the Public Goods Funding workstream(PGF) hosted a chat about the future of the Gitcoin Grants program, and how best to decentralize Gitcoin Grants. The conversation happened during our weekly Gitcoin Community Call(formerly, “DAO Vibes”). Up to this point, the Public Goods workstream has decided what rounds are Gitcoin-led. We recognize that, to effectively scale our program, we need to continue to decentralize. Our goal is to find ways to achieve long-term financial sustainability with the help of the broader Gitcoin community. The PGF team asked some key questions on the call, and received feedback from community members on the realities of fundraising for public goods. Three key questions:  How many rounds does it make sense for the Gitcoin program to support initially and why? What do you think these rounds should look like? Which services would be most helpful for Gitcoin to provide in order to help fund public goods? This could include funding, operating grants rounds, marketing grants rounds, and grant review. What outcomes should we track to measure our success as a decentralized grants program?  Protocol adoption is also a core focus. For Gitcoin to effectively decentralize its grants program, we need to get ecosystems to use, adopt, and run their own, self-hosted grants rounds on Gitcoin Grants protocols. Here’s a link to the call recording, and notes from the call. Join us for the next Gitcoin Community Call(12p ET in the #dao-citizens channel in the Discord), which will be led by MMM brand strategist, Alexa Lombardo! Alexa will moderate a discussion on the Gitcoin brand, and how we are evolving it to meet the needs of a decentralized Gitcoin Grants program. Read her recent forum post on the topic here.  1280×714 383 KB  h/t to Scott Moore for the meme    In This Issue of the Digest  DAO News   This Week’s Content   From the Gov Forum   New Gov Proposals   Upcoming Events   Opportunities for Builders       DAO News   Tomorrow, the third “Buidl in Public” session is happening at 11:30a ET. If you’re not familiar, “Buidl in Public” is our new weekly series focused on supporting one early-stage Web3 project in a live workshop format. Each week, Gary profiles one innovative Web3 project, and helps the project founders strategize on community engagement, brand, traction, and more! This week, he is talking to Impact DAO. RSVP here!    Fantom round applications close Tuesday, 12/6. Round voting to determine hackathon winners starts Monday, 12/12. You can read more about the Alpha Round here, on the Gitcoin blog.   Two new Open Data Science Community updates: 1) ODC is now having weekly stand-ups on Tuesday morning pacific time, 14:30 GMT in the ODC Discord. 2) Next Thursday(12/8) at 10am ET, ODC is doing a Twitter Space AMA for ODC-related projects. Next Thursday we’ll be speaking with Trust Protocol. Schedule a reminder here.    You can now follow Gitcoin on Lens Protocol. Drop your lens @ in this thread and we’ll follow you back!   Also, there are five hackathons running on Gitcoin right now! Scroll to the bottom of the Digest to check out our Opportunities for Builders.    This Week’s Content A weekly roundup of blog posts, podcasts, and other content from the Gitcoin community. This week, there are two new blog posts on the Gitcoin blog, Azeem talks to VenturePunk, and the Twitter Spaces recording of our recent chat with Snapshot on Passport integration.   Gitcoin Blog: Gitcoin Passport <> Snapshot: Making DAO coordination more secure  Last week, Gitcoin hosted a Twitter Space with the Passport team, to talk about sybil defense and why quadratic voting makes sense for Web3. Snapshot has built integrations with Gitcoin Passport as a solution for sybil defense in DAO governance. They also recently added an option to use quadratic voting in a Snapshot proposal. Read more about the partnership here.   Gitcoin Blog: The Everscale blockchain announces the last call for its online hackathon with a $43,000 prize pool  The Everscale Elysium Hackathon concluded this past Monday (11/28). This was the Everscale network’s first fully online hackathon. As the hackathon wraps up and all work has been presented, prizes will be distributed to hackers, as determined by the hackathon jury. Congrats to all who participated!   Azeem, Fundraising and Partnerships Lead at Gitcoin, talks to the VenturePunk newsletter about “issues with DAOs”. From the interview, ““When it comes to coverage of DAOs what we often find in crypto media is blanket praise, and because of that I will instead focus on some of the major issues I’ve encountered thus far.” Read the interview here.    ICYMI: The Gitcoin x Snapshot Twitter Space happened last week. @kevinrolsen spoke with @NathanVDH0x about the @gitcoinpassport x  @SnapshotLabs integration and why it’s vital we protect the future of Quadratic Voting. Listen here while it’s still up!      From the Governance Forum These are the top posts from this week in the Gitcoin Governance forum. See the latest here.   [Discussion Series] Evolving the Gitcoin Brand: Introduction & Overview by Alexa Lombardo  In this post, Alexa explores what brand means and why it matters, and then examines how we can actively evolve the Gitcoin brand to meet the needs determined by this next phase of our evolution, i.e. the launch of Gitcoin grants protocols in the Spring of 2023. It then summarizes the work we’ve done thus far to evolve our brand strategy in order to inform future design and marketing decisions. Alexa would love your feedback. Drop your thoughts in the replies!   CSDO Monthly Digest by Kyle Jensen  Cross-Stream DAO Operations (CSDO) is a group of workstream and initiative leads that come together to ensure alignment, transparency, and integrity across the DAO. In this post, Kyle introduces the monthly CSDO Digest, and breaks down all the most important CSDO outcomes from every month, starting with September. Also check out Kyle’s CSDO Monthly Decisions Summary post, which recounts the decisions the CSDO team has made during their weekly calls for the month.   [request for feedback] Introducing a dedicated gatekeeper contract to the Grants Protocol by Nate Gosselin  Nate Gosselin, Product Lead on Grants Protocols, shares a design that the Grants Protocol team has been working on, and asks for input. Nate asks, “What do people think about adding an additional smart contract to grants protocols that handles voter eligibility?”. You can participate in an unofficial vote in the post and add your feedback here.      New Gov Proposals Proposals go to Snapshot first, then are rat  Active Proposals: The following proposals are active on Tally this week.  S16 - FDD Budget Proposal S16 - DAO Operations Budget S16 - Public Goods Funding Budget S16 - Gitcoin Product Collective Budget S16 - MMM Budget Proposal  The following proposals are active on Snapshot:   Gitcoin Steward Council Election – Use your GTC to vote and elect the next 10 members of the Steward Council. The Steward Council serves as an advisory body for the DAO. Click here to vote.    Proposal Discussions:  [request for feedback] Introducing a dedicated gatekeeper contract to the Grants Protocol   Latest Completed Proposals: These Season 16 budget proposals all passed on Snapshot and are being ratified on Tally this week.  S16 - FDD Budget Proposal S16 - DAO Operations Budget S16 - Public Goods Funding Budget S16 - Gitcoin Product Collective Budget S16 - MMM Budget Proposal    Upcoming Community Events If you have an event you’d like us to include in the Digest, reach out to @alexdw5 on Twitter or Discord. Next Wednesday (12/7):  12p ET – Gitcoin Community Call. This Gitcoin Community Call will be led by MMM brand strategist, Alexa Lombardo! Alexa will moderate a discussion on the Gitcoin brand, and how we are evolving it to meet the needs of a decentralized Gitcoin Grants program. Read her recent forum post on the topic here.   Friday (12/2):  11:30 AM ET – Buidl in Public #3 – Gary Sheng chats with @impactdaos, running a live workshop to strategize with them about community engagement and growth from a Web3 community-lens. RSVP here.   Tuesday (12/6):  2p ET – UNICEF Round AMA – Join us in welcoming the 10 grantees in the UNICEF Round into the Gitcoin ecosystem! Our hosts Azeem Khan & Ben West will share more on the participating projects and their intended impact, followed by Q&A. The round launches Friday, 12/9!. You can schedule a reminder for the Twitter Space here.  For up-to-the-minute updates on Gitcoin events, check out our Events Calendar!   Opportunities for Builders   Are you a web3 builder? Fill out this interest form to join our first Gitcoin “Buidlers Circle”. Work closely with Gitcoin leaders to add your input to our effort to support our builder community, and connect with other builders. Our first Buidler Circle is limited to 10 participants–apply today!   The Web3 Social Hackathon starts today, and runs until 12/31. Sponsors include Gitcoin, Ceramic, Unlock, and others. $50k in prizes. Register now.    The Illuminate/22 Hack by Moonbeam began this week! Runs 11/14 - 12/12. There is $80K in various bounties available. Check the Prize Explorer.    Reserve Protocol Launch Hackathon–this DeFi hackathon is looking for the most innovated defi project and has $100K Grand Prize bounty. Check out the description to add some helpful inspirations for possible products that you can create using the Reserve Protocol, check them out here.   Block Born & Balthazar Hackathon - Powered by Tezos. Run 11/9 - 12/4. Unity has integrated a verified Web3 software development kit (SDK) built for the Tezos blockchain on the Unity Asset Store. If you are interested in Gaming and Tezos then check out the various bounties available. Check the Prize Explorer.   UBESWAP DESTINY HACKATHON. Runs 11/14 - 12/12. Sponsors include Celo and Ubeswap. Prize pool of 800,000 UBE(roughly ~$15k at the time of publish date of this newsletter). Check out the bounties here.   Magic Eden Hackathon – Creator Monetization. Runs from 10/28 - 12/12. Total prize pool of $250k.   Algorand Greenhouse Hack 3. Starts 12/14. Various bounties available. Take a look at the winning projects from GHH2.   The 12 Days of HacXmas starts today (12/1) and runs until 12/12.      New to GitcoinDAO?    TLDR - What is Gitcoin?   Become a Gitcoin Citizen!    Sign up here to get the Gitcoin Digest in your inbox. Tell us how we can improve the Digest here ! Thank you!   Previous edition ",
                    "links": [
                        "https://twitter.com/_madison_adams",
                        "https://twitter.com/publicmaxwell",
                        "https://www.youtube.com/watch?v=wy4OUh2jiMQ",
                        "https://www.youtube.com/watch?v=wy4OUh2jiMQ",
                        "https://twitter.com/alexa_lombardo",
                        "https://gov.gitcoin.co/t/discussion-series-evolving-the-gitcoin-brand-introduction-overview/12164",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/8/875c228f8805df712fa750166d931cab43e36bbb.png",
                        "https://twitter.com/notscottmoore/status/1585315991508357121?s=20&t=kJMRniiIbg2ajht0ewk-Jw",
                        "https://twitter.com/GitcoinFam/status/1595189575047159809?s=20&t=9U0MhEaB1xb4QaqIXK1lVw",
                        "https://twitter.com/impactdaos",
                        "https://www.addevent.com/event/Ys15600519",
                        "https://go.gitcoin.co/blog/announcing-the-fantom-alpha-round",
                        "https://discord.gg/KJ6PGH4cnK",
                        "https://twitter.com/TrustProtocol",
                        "https://twitter.com/i/spaces/1MnxnpWYokVGO",
                        "https://t.co/or9Q0DSpI9",
                        "https://twitter.com/gitcoin/status/1597662938642644992?s=20&t=0BuUXNAtKs6HiH5Kq1Hacg",
                        "https://gitcoin.co/hackathons",
                        "https://go.gitcoin.co/blog",
                        "https://twitter.com/venture_punk/status/1596206843675672587?s=20&t=UK13OTN8Tic_INRm7JbAzQ",
                        "https://twitter.com/SnapshotLabs/status/1595439026990944256?s=20&t=IBa0thDqPS2wxle6GpZk0g",
                        "https://go.gitcoin.co/blog/gitcoin-passport-snapshot-making-dao-coordination-more-secure",
                        "https://twitter.com/SnapshotLabs/status/1595439026990944256?s=20&t=IBa0thDqPS2wxle6GpZk0g",
                        "https://passport.gitcoin.co/",
                        "https://go.gitcoin.co/blog/gitcoin-passport-snapshot-making-dao-coordination-more-secure",
                        "https://go.gitcoin.co/blog/the-everscale-blockchain-announces-the-last-call-",
                        "https://gitcoin.co/hackathon/everscale/?",
                        "https://twitter.com/azeemk_",
                        "https://twitter.com/venture_punk/status/1596206843675672587",
                        "https://venturepunk.substack.com/p/venturepunk-4-youre-daoing-me-crazy",
                        "https://twitter.com/kevinrolsen",
                        "https://twitter.com/NathanVDH0x",
                        "https://twitter.com/gitcoinpassport",
                        "https://twitter.com/SnapshotLabs",
                        "https://twitter.com/SnapshotLabs/status/1595439026990944256?s=20&t=IBa0thDqPS2wxle6GpZk0g",
                        "https://gov.gitcoin.co/latest",
                        "https://gov.gitcoin.co/t/discussion-series-evolving-the-gitcoin-brand-introduction-overview/12164",
                        "https://gov.gitcoin.co/u/alexalombardo",
                        "https://go.gitcoin.co/blog/introduction-to-grants-protocol",
                        "https://gov.gitcoin.co/t/discussion-series-evolving-the-gitcoin-brand-introduction-overview/12164",
                        "https://gov.gitcoin.co/t/csdo-monthly-digest/12182",
                        "https://gov.gitcoin.co/u/kylejensen",
                        "https://gov.gitcoin.co/t/csdo-monthly-decisions-summary/11048",
                        "https://gov.gitcoin.co/t/request-for-feedback-introducing-a-dedicated-gatekeeper-contract-to-the-grants-protocol/12148",
                        "https://gov.gitcoin.co/u/nategosselin",
                        "https://gov.gitcoin.co/t/request-for-feedback-introducing-a-dedicated-gatekeeper-contract-to-the-grants-protocol/12148",
                        "https://www.tally.xyz/gov/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/44",
                        "https://www.tally.xyz/gov/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/41",
                        "https://www.tally.xyz/gov/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/42",
                        "https://www.tally.xyz/gov/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/40",
                        "https://www.tally.xyz/gov/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/43",
                        "https://snapshot.org/#/gitcoindao.eth",
                        "https://snapshot.org/#/gitcoingov.eth/proposal/0x5543373d5748b4145b3a8a2cf8ecbf105fcb14d9b136f49134cd51bb4b8f6c75",
                        "https://snapshot.org/#/gitcoingov.eth/proposal/0x5543373d5748b4145b3a8a2cf8ecbf105fcb14d9b136f49134cd51bb4b8f6c75",
                        "https://t.co/XjHs7hX3bO",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xc49ae9a62e6b0ad1652adc115886a0a245d52c0035238bb9bcb9e055cb51c568",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x08bc5d61cf0e939b333187625eb2f3dce3a630a328db2b76f4776107cf6612c3",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x63e139b75e52843ce6af2e684101025ba2f88edf80775397927a875d9617b789",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x974724227df2dcd1659379651886364eee441c24ff96ed0e0b2ee6395712408d",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x35010aec1b8a754dc250ac714c6b3c7337663d1d82a601537eb72f3afee99249",
                        "https://twitter.com/alexdw5",
                        "https://twitter.com/alexa_lombardo",
                        "https://gov.gitcoin.co/t/discussion-series-evolving-the-gitcoin-brand-introduction-overview/12164",
                        "https://twitter.com/garysheng",
                        "https://twitter.com/impactdaos",
                        "https://www.addevent.com/event/Ys15600519",
                        "https://go.gitcoin.co/blog/gitcoin-unicef-qf-collaboration-pilot",
                        "https://twitter.com/i/spaces/1yNGaNlyazjJj",
                        "https://calendar.google.com/calendar/u/0?cid=Y19pdHMwdGlmb2wybWtyZWVvbDQyOW5qNmhoa0Bncm91cC5jYWxlbmRhci5nb29nbGUuY29t",
                        "https://docs.google.com/forms/d/1OP3l04-8-fsYjSOkPQNGX4rJrXNsNmbvw3ui4NN9nIk/viewform?edit_requested=true",
                        "https://docs.google.com/forms/d/1OP3l04-8-fsYjSOkPQNGX4rJrXNsNmbvw3ui4NN9nIk/viewform?edit_requested=true",
                        "https://orbis.club/web3-social-hackathon-dec-2022",
                        "https://orbisclub.notion.site/The-Web3-Social-Hackathon-Pre-Register-Now-1fff0db4dcbc43dcac135d0361e1ffc4",
                        "https://gitcoin.co/hackathon/illuminate/onboard",
                        "https://gitcoin.co/hackathon/illuminate/?",
                        "https://gitcoin.co/hackathon/reserve-launch/?",
                        "https://gitcoin.co/issue/29518",
                        "https://gitcoin.co/hackathon/block-born/onboard",
                        "https://tezos.com/",
                        "https://gitcoin.co/hackathon/block-born/",
                        "https://gitcoin.co/hackathon/ubeswap/onboard",
                        "https://coinmarketcap.com/currencies/ubeswap/",
                        "https://gitcoin.co/hackathon/ubeswap/?",
                        "https://gitcoin.co/hackathon/magic/onboard",
                        "https://gitcoin.co/hackathon/greenhouse3/onboard",
                        "https://twitter.com/DevGreenhouse/status/1595092784272519168?s=20&t=QijmHDscJqDWXfV9ZqTYyw",
                        "https://gitcoin.co/hackathon/12days/onboard",
                        "http://gitcoindao.com",
                        "https://primer.gitcoindao.com",
                        "https://gitcoin.notion.site/Become-a-Gitcoin-Citizen-7b83f9b5ca06487f84e0142d0180970a",
                        "https://d2zw1g04.na1.hubspotlinks.com/Ctc/I8+113/d2zW1G04/VWbJzl23GsSPW4s3p9G2TJgLhW7MhRLh4SvnQ3N4dVQbS3lSbNV1-WJV7CgF96W2f1FQf5Jfp1yW94kP408B9drdW989wTj4ywnqmW1Wq4h-1YYq_YW5Nll128BRbnjW5RJLX08YtHmxVW6FMS5B2rkwW2ymX2z8FQM54W3NDvDj77d5zDW45lJ_p8FSddcW6fC_hY9bhGCRW2Gfvp36X1s12W3GF_lF1SwWhrW2jkrVQ4f0mmZW3461fX7NcPhzW603LWr7yzF5xW3lTFbB28dB8PW2sc-L_6DtpwkW6hjFy_5cGyWZW7LJwqw129wGhW8NqCSn4yRTyWMfSFcTKKMF73lNV1",
                        "https://d2zw1g04.na1.hubspotlinks.com/Ctc/I8+113/d2zW1G04/VWbJzl23GsSPW4s3p9G2TJgLhW7MhRLh4SvnQ3N4dVQby3lSbtV1-WJV7Cg-NlVGGd7r4zdyBdW6WNsXY6DstrdW47T00M5bPWTsW4qt7LL8P5fSBW5c4JCP9954YfW4vnDBv69qsYZW95swcD90n5VwW8N7slt28k9jLW9jPk2W8BzkKmW75yJLr6PJq2VMXw18P2znRzW3FXKgS1TWW7TW66PKT11yGnbBW4vqTPg7QL_n-W3BKdkD4MrGk5W56yVl84bbhBxW6qdzqF4lKCmdW7p8gFd4m5PZ_W8JjjrD4tP-p5W9fbShy48mZ-M3gYk1",
                        "https://gov.gitcoin.co/t/digest-43-gitcoin-x-unicef-partnership-alpha-rounds-upcoming-twitter-spaces-and-more/12110",
                        "https://gov.gitcoin.co/t/digest-45-our-grants-round-with-unicef-launches-tomorrow/12262"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.673653847730552
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/qijin",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/12/2022-08:35:07",
                    "content": "周报#44中文版，欢迎订阅并关注中文twtitter（@GitcoinCN）参与互动！    news.gitcoinchina.com    GitcoinDAO 周报 #44 2022 我们的首次Alpha轮募捐——与联合国儿童基金会创新办公室联手，将于9号开始！这一轮有 10 个受助者，致力于在教育、医疗健康、气候和金融服务方面提供具有社会层面思考的解决方案。您可以在这篇文章中阅读更多关于每个受助者的信息以及如何支持他们的工作。该轮从 12 月 9 日至 16 日进行，将在 ETH 主网上进行。作为 Gitcoin 的 Alpha 测试季的一部分，与联合国儿童基金会的这一轮将是基于我们的新赠款协议（grants...      中文周报订阅：http ://news.gitcoinchina.com/ ",
                    "links": [
                        "http://news.gitcoinchina.com/issues/gitcoindao-44-2022-1480926",
                        "http://news.gitcoinchina.com/",
                        "http://news.gitcoinchina.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "254"
}