{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindao-digest-edition-23/9370",
            "title": "GitcoinDAO Digest Edition #23 ",
            "index": 9370,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#1",
                    "likes": "5",
                    "time": "08/12/2021-23:06:06",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading!  If you would like to receive this newsletter in your inbox, sign up here.  Without further ado, let’s dive in!   Meta-Governance    BlockScience published a blog post about their ongoing work with Gitcoin om human/ML Sybil-detection and introduced a new tool for DAOs to map cycles & modes of work. The post sheds light on some of the challenges, and presents useful frameworks like the Socio-Technical Frequency Map to assist in compartmentalizing and operationalizing workstreams.   Partnership & Mutual Grant with Prime DAO by Vishnu is a proposal that, if passed, “would grant Gitcoin $250K USD worth of PrimeDAO’s $D2D governance token at a price of $0.50 per token for a total of 500K $D2D coins, equating to 0.5% of Prime DAO treasury. The purpose of this alliance is to help ensure that Gitcoin and Prime can work together to build tooling for DAO2DAO coordination.”   The Partnership & Mutual Grant with Developer DAO authored by Nader is now live on Snapshot. “The proposal, if passed, would issue 50,000 GTC for governance rights equating to 5% of Developer DAO when governance is live.”   Retroactive GTC Allocation to Lead Engineer of Gitcoin Grants V1 was posted by Kevin to “retroactively allocate an appropriate number of GTC tokens to Kevin Seagraves, the lead engineer and product manager for Gitcoin Grants V1.“ The post also includes a poll to gauge opinions before moving on.   Elliot from Llama gave an update in the Gitcoin Financial Reporting thread with a third iteration of the report, this time for November. The report now also features a “key financial highlights section that shows the key themes this month along with some background as to the reasons for the movement.”   TLDR - How Gitcoin Grants Round 12 Works by Owocki gives a quick intro to how the currently running GR12, as well as how quadratic funding works.   Gitcoin Grants is our Metronome by Owocki describes how the 2 week quarterly Grants rounds, Hackathon, KERNEL block and Governance activity provides a rhythmic metronome that the GitcoinDAO ecosystem revolves around.   December 2021; Who’s hiring? by Owocki invites Workstream leads to announce the currently open positions they are hiring for to the broader community. Check it out if you, or anyone you know are interested in contributing to GitcoinDAO!   The Internet of Jobs is here by Owocki articulates “the size, scale, & scope of the internet of jobs (IoJ) and produces a canonical reference for this emergent trend.” The post goes into details of how mechanisms can be designed for an IoJ native world and describes Gitcoin Bounties and Gitcoin Grants as two examples.   Implementation of a Decentralized Bounty Platform - Progressive Decentralization Workstream by ethanl is a proposal to allocate 4000 GTC for 1.5 month to begin building out the De-bounty Platform (DB) - “an interface to monitor the off-chain development progress of freelancers, and react to pre-set milestones with on-chain logic set by bounty providers. Bounties will be automatically delivered via a smart-escrow.”   Tardigrade gave an update on the proposal to “Redistribute GTC to Individuals Who Could Not Claim Due to Error” with final amendments as they are working on transitioning the proposal into a Snapshot vote.     GitcoinDAO Governance Overview     Proposal Discussions Active Proposals Latest completed proposals     Implementation of a Decentralized Bounty Platform - Progressive Decentralization Workstream dCompass Q4 Budget request    Partnership & Mutual Grant with Prime DAO DeveloperDAO Partnership    Retroactive GTC Allocation to Lead Engineer of Gitcoin Grants V1     Redistribute GTC to Individuals Who Could Not Claim Due to Error     Partnership & Mutual Grant with Prime DAO        Workstream Discussion    Public Goods Funding    Grants Round 12 went live last week, with over $3m in matching pool funding from a variety of ecosystem partners like ENS, Ethereum Foundation, and NounsDAO.   NounsDAO in particular has committed one of the largest single amounts of funding ever at 169 ETH, with a special NounsBot auction set to happen later this week.   Moreover, PGF successfully set up over 10 rounds in total for GR12, including three cause rounds focusing on advocacy, climate, and longevity.   The public library and public goods PR squads continue to push forward on helping promote and expand the discourse around public goods; Aya from the Ethereum Foundation and a number of other exciting speakers are coming up!   We’ve continued to solidify partnerships with groups like DeveloperDAO, Verses, and more.     Moonshot Collective    The GreatestLARP, Level 4 is Live! We gathered our 200 member ETHBot army in Level 2. We captured 200 mini-Molochs in Level 3. Now The Final Battle is upon us! Help defeat Moloch one last time while raising funds for public goods.   To beat Level 4 we must crowdfund 100 ETH to unlock the super-rare 1/1 Battle NFT through PartyBid. Not only will you help slay Moloch, the NFT will be tokenized and distributed to participants based on contribution percentage.   The GreatestLARP has already raised approximately $500K for public goods so far, with the opportunity to raise hundreds of thousands more. Let’s coordinate to take down Moloch!     Decentralize Gitcoin    The on-chain proposal for dCompass Q4 budget has passed quorum on Tally. Huxwell gave an update on dCompass and what’s being worked on. A grant for dCompass is also now live on the Gitcoin building dGitcoin GR12-round.   We are currently about half way through GR12 and we feel good about our progress!  We have 19 approved grants on the platform with 15 of those in the Gitcoin Building Gitcoin round There have been a total of 586 contributions to grants on the platform The total USD value of donations is around $2k which puts is quite a ways away from our goal of $15k so we are working to increase that!    We currently have a review process but it is slower than we would like for turnaround and we are working with the FDD workstream to tighten the time frame.   We are looking to create a dashboard with stats for dGrants.   We have had a number of reports of feedback and issues from our users and we greatly appreciate the feedback! We have worked hard to quickly resolve any issues.     Fraud Detection & Defense (FDD)   Operations  Season 2 | Epoch 3 & 4 contributor payments are out! We are sending the new DAOops stream the remaining budgets for DAOops ($83,616k) & User Support ($61.235). FDD treasury diversification has begun with 25k GTC being used for Stablecoin & ETH purchases over the next few weeks. FDD is also modeling a non-transferrable governance token for FDD to start in Q1 2021. This will help us achieve our progressive decentralization goals outlined in the Q3-Q4 2021 State of FDD deliverables.   Sybil Detection  Join our ecosystem sybil detection roadmap event on Monday the 13th at 3pm UTC (10am EST). Presentations from Blockscience, Omnianalytics, and an overview of the decentralized Proof-of-Personhood Passport offerings to the web 3 community and how we will get there. This is connected to our GR12 events covering last weeks A Community Based Sybil Detection Roadmap blog post. Friday we held the first of 5 sybil hunt evaluation parties. By rewarding DAO contributors for participating in giving their opinion on accounts the ml algorithm flags as sybil, we are able to minimize bias and continually train the algorithms to think like the Gitcoin community and less like it’s builders. This week contributor Dries built out data anonymization process for the community algorithm.   Grant Eligibility & Policy  A new squad with cross-functional input from FDD Policy, FDD Grant Approvals, & PG Grants Ops named Grant Investigation Agency started work designing a publicly run Grant Disputes adjudication process using Ethelo software. Deliverable will be adjudication of all GR12 grants disputes using the new process and criteria considerations. Maintaining a single source of truth for policy on the new dCompass open source knowledge base is a priority. Working across all streams to find a home for the knowledge base maintenance with DAOops. The FDD Grant Approvals squad has new grant approvals posted during GR12 being handled at an average of 12 hours as of Monday, Dec. 6th.   Research   TE Governauts DAO Compensation Open Science Program is in full swing with 5 Gitcoin DAO researchers participating! Growth & Experimentation is looking at squad health & playbooks for how to start a new squad. What considerations need to be made? What tools are there to help the squad achieve their goals? Risks & Threats has begun formal research into sybil attacker profiles so we may better understand how to best defend the grants mechanism. Ops Sec is another path we are just beginning to turn our attention towards.      Merch, Memes & Marketing    Memepalooza 4 was hosted in Discord last Friday with over 50 attendees and 100+ memes. Participants were rewarded through tip.party and were the first to test out the memeshot Memes.party.   Memes.party was launched during the Memepalooza-party. As of writing 375 memes have been uploaded to the perma-web through the site. The team is working on improving the experience and use cases with added functionalities.   A GitcoinDAO primer is in the works with the ambition to help explain GitcoinDAO and how one can contribute. The team has sent out a quick survey to gather some feedback, please fill out the form when you have the time!   A version 2 of the Steward Report Cards is beginning to take shape. We are working on adding new data points to give a better overview of each stewards engagement and involvement. We’re also sketching out a handful of nifty new functionalities that will be added to the site.     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET in Discord! We have been seeing great attendance and engagement.   Community Onboarding Call! New to Gitcoin? Every other Wednesday we’ll tell you all about how we’re organized and how to become an active contributor. The next one is Monday, December 20, 1:00pm - 2:00pm ET. (If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in. Current openings across the GitcoinDAO can be found here.     Key actions for this week:  Vote on the DeveloperDAO Partnership proposal. Vote on the  dCompass Q4 Budget request proposal. Fill out the GitcoinDAO primer form.  Thanks for reading! Last week’s edition ",
                    "links": [
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://block.science/",
                        "https://medium.com/block-science/operationalizing-the-gitcoindao-anti-sybil-process-7f2595544f44",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-prime-dao/9330",
                        "https://gov.gitcoin.co/u/vgk",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-developer-dao/9217/10",
                        "https://gov.gitcoin.co/u/dabit3",
                        "https://gov.gitcoin.co/t/proposal-retroactive-gtc-allocation-to-lead-engineer-of-gitcoin-grants-v1/9343",
                        "https://gov.gitcoin.co/u/captnseagraves",
                        "https://gov.gitcoin.co/u/Elliott",
                        "https://gov.gitcoin.co/t/gitcoin-financial-reporting/8867/3",
                        "https://gov.gitcoin.co/t/gitcoin-financial-reporting/8867/3",
                        "https://drive.google.com/uc?id=1msBeqPnerYz72d3GsTAyG2by7kzhSHFO&export=download",
                        "https://gov.gitcoin.co/t/tldr-how-gitcoin-grants-round-12-works/9333",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gitcoin.co/grants",
                        "https://wtfisqf.com/",
                        "https://gov.gitcoin.co/t/gitcoin-grants-is-our-metronome/9310",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/december-2021-whos-hiring/9288",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/the-internet-of-jobs-is-here/9340",
                        "https://gov.gitcoin.co/u/owocki",
                        "https://gov.gitcoin.co/t/proposal-implementation-of-a-decentralized-bounty-platform-progressive-decentralization-workstream/9292",
                        "https://gov.gitcoin.co/u/ethanl",
                        "https://gov.gitcoin.co/u/Tardigrade",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782/17",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782",
                        "https://gov.gitcoin.co/t/proposal-implementation-of-a-decentralized-bounty-platform-progressive-decentralization-workstream/9292",
                        "https://www.withtally.com/governance/gitcoin/proposal/11",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-prime-dao/9330",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xe74f2ddceaf3a50cb7c6de9ae1be5ace0bed4c5c34ca980adda8d323de1cd2c6",
                        "https://gov.gitcoin.co/t/proposal-retroactive-gtc-allocation-to-lead-engineer-of-gitcoin-grants-v1/9343",
                        "https://gov.gitcoin.co/t/proposal-redistribute-gtc-to-individuals-who-could-not-claim-due-to-error/8782/17",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-prime-dao/9330",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-Funding-80a3202a3a244c65b3fda08c0f7c7d60",
                        "https://gitcoin.co/blog/announcing-grants-round-12/",
                        "https://discourse.nouns.wtf/t/proposal-a-very-nounish-gitcoinmas-nft-crossover-event-169-eth-to-crypto-public-goods/369",
                        "https://gitcoin.co/blog/announcing-grants-round-12/",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://greatestlarp.com/final-battle",
                        "https://www.partybid.app/party/0xA2db0A5687F7c1F685e2E62a917b40E3133B3D8E",
                        "https://gitcoin.notion.site/Decentralize-Gitcoin-c3197f918bf640bc9809cd26d56c93f3",
                        "https://www.withtally.com/governance/gitcoin/proposal/11",
                        "https://gov.gitcoin.co/u/Huxwell",
                        "https://gov.gitcoin.co/t/proposal-integrate-dcompass-within-dgitcoin-to-build-dquests-dknowledge/8836/16",
                        "https://grants.gtcdao.net/#/dgrants/5?roundAddress=0xa94E824ac0907c1Db5145F7fDb326A8bBfCa5599&roundName=Gitcoin+Building+Gitcoin",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-f1a2969a9f324f57a02ef69a60b25cae",
                        "https://docs.google.com/document/d/1uEuGe5OOecLyAsLbgnqaLplaH8ycU4zej3c-mv6QHTI/edit?usp=sharing",
                        "https://gitcoin.co/blog/a-community-based-roadmap-for-sybil-detection-across-web-3/",
                        "https://twitter.com/tokengineering/status/1467924648717430784",
                        "https://gitcoin.notion.site/Memes-Merch-Marketing-c1bd89fac8ab4569bf2a676df28025d8",
                        "https://memes.party/",
                        "https://memes.party/",
                        "https://form.typeform.com/to/umHOZWWx",
                        "https://www.daostewards.xyz/",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://www.notion.so/gitcoin/06fad27dbd2d49468aa810c92f1f28c2?v=d403dc9f76144dcab232e3a18002494f",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xe74f2ddceaf3a50cb7c6de9ae1be5ace0bed4c5c34ca980adda8d323de1cd2c6",
                        "https://www.withtally.com/governance/gitcoin/proposal/11",
                        "https://form.typeform.com/to/umHOZWWx",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-22/9286",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24/9446"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.661786068594105
                }
            ]
        }
    ],
    "group_index": "623"
}