{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/a-compensation-commitment/10830",
            "title": "A Compensation Commitment ",
            "index": 10830,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "contributors"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#1",
                    "likes": "9",
                    "time": "07/06/2022-14:26:20",
                    "content": " MVP Comp Proposal This proposal aims to solve many issues that stem from haywire compensation in GitcoinDAO, and be an interim state until we have a solid comp framework around the end of S14. TL;DR Community ownership of a project rests on transparency, and transparency rests on legitimacy. Salary will be transparent to all DAO contributors, we’ll use the same comp logic for all core contributor offers (incl using US market rates for any contributor), and all GTC pay will be denominated in stables.  1. Transparency What: We state that our default is salary transparency. Each Workstream will arrive at internal transparency by S15. No [name=salary] connections will be externally published outright but we recognize at minimum that salaries are discoverable by DAO contributors. Why: It narrows the wage gap between identity groups & increases worker solidarity. It is the DAO way & is required by stewards. Stating we have salary transparency matches the reality of crypto pay which is that salaries can be found out by researching docs & block explorers.  2. Global Salary Benchmark What: We will use the US market rates as a starting point for salary suggestions. We’ll use the 50th percentile based on data from OpenComp, and add a 30% increase from that 50th percentile rate. Why: Market data provided is base comp, not including healthcare, 401k matching, vesting or equity that is typical outside web3. We have assessed the value of Gitcoin Holdings’ benefits as well as other web2 companies and it’s clear that 30% is a minimum add on to be competitive with web2 jobs. Using this framework also increases equity between workstreams as well as between Holdings & the DAO, reducing the power imbalance/privilege that Holdings folks may have.  3. Saf & Loie are the Compensation Committee What: This process is followed to arrive at any salary offers for core contributors (20+ hr/wk)  An initial rate is suggested (by contributor, the person hiring them, or CC) If not suggested by CC, the rate is submitted as a request for approval from CC A CC member will claim the request, research & confer with committee members, and return a suggested offer within 2 biz days.  Why: Salary offers that were determined using one cohesive process are more fair. Without a legitimate process for arriving at salary offers, salary transparency could wreak havoc culturally in our teams. Salary has been yolo’d across the DAO. We don’t currently have a compensation machine that can be driven by just anybody. (More to say later, but this includes: our own competency leveling framework & better data on dao-space market rates) As we develop that self-driving machine over the course of S14, it makes the most sense for experienced People Operations folks with a view across the whole DAO to be giving these recommendations.  4. Denomination in stables What: All core contributor pay should be denominated in DAI, as in: You are paid 5000 DAI/month. On payday*, 1GTC=5DAI, so you are paid 1000 GTC *or the 20 or 30 day moving average your WS uses Why: We will lose out on essential contributors if we cannot provide pay that is at least equal at the moment of payout to what was promised in pay negotiations. This relates heavily to DEI in the workplace: societally marginalized folks (who we KNOW are necessary team mates to accomplish our mission) are far more likely to need stable income.  Where is this going in the future? This is an MVP - let’s think of it as a minimum viable policy. These are actions we can take now. By the start of S15 we intend to have a Gitcoin-specific competency leveling framework and better market data on crypto industry salary levels, which will enable others outside the Compensation Committee to draft salary offers that are cohesive with the rest of the DAO. (This is something the People Ops team can deliver) We intend also to have a treasury strategy that allows for more creative comp arrangements including percentages paid out in stables, incentives for GTC pay, etc. (This will require a big lift from Treasury Management) We intend also to have a clearer framework for sharing salary data openly - either pay bands or something even more transparent. (This will require the participation of workstreams to arrive at defensible comp for all their contributors) With a competency leveling framework & pay bands it will be clear to contributors how to level up & what skills Gitcoin values folks improving on the most.  How to approach this proposal What we’re asking for in this proposal is for folks to get on board this voyage to compensation legitimacy. We have mapped out the territory. Most of it is People Ops work but there are pieces (named above) that will only succeed with the dedication of others in the DAO. As you read this proposal you may ask yourself “What would need to be true in my domain to reach these 4 states?” Saying yes to this proposal is saying yes to taking whatever actions are in your domain to achieve what needs to be true. Additional sources:  aauw.org    SimpleTruth_4.0-1.pdf 393.17 KB         Pew Research Center’s Social & Demographic Trends Project – 22 Oct 15    Among Self-Employed, Whites and Asians Do More Hiring Whites and Asians are more likely than Hispanics and blacks to be self-employed, and this racial and ethnic gap extends through most industries.  Est. reading time: 3 minutes          The Atlantic – 29 Nov 15    Why So Many Minority Millennials Can't Get Ahead Without the financial support that many white families can provide, minority young people have to continually make sacrifices that set them back.         AIHR – 11 Nov 19    A Full Guide to Compensation and Benefits - AIHR Compensation and benefits are a key part of Human Resource Management. In this article, we'll give you a full guide about comp and benefits.  Est. reading time: 13 minutes          Time    Should You Share Your Salary With Co-Workers? Here’s What Experts Say These are the benefits and downsides of revealing your pay       There are many more sources we’ve used which are more internal to our DAO or the crypto space in general. As we research more those will be revealed, but as stated this is a minimum viable proposal. ",
                    "links": [
                        "https://www.aauw.org/app/uploads/2021/07/SimpleTruth_4.0-1.pdf",
                        "https://www.aauw.org/app/uploads/2021/07/SimpleTruth_4.0-1.pdf",
                        "https://www.aauw.org/app/uploads/2021/07/SimpleTruth_4.0-1.pdf",
                        "https://www.pewresearch.org/social-trends/2015/10/22/among-self-employed-whites-and-asians-do-more-hiring/",
                        "https://www.pewresearch.org/social-trends/2015/10/22/among-self-employed-whites-and-asians-do-more-hiring/",
                        "https://www.theatlantic.com/business/archive/2015/11/gifts-debts-inheritances/417423/",
                        "https://www.theatlantic.com/business/archive/2015/11/gifts-debts-inheritances/417423/",
                        "https://www.aihr.com/blog/compensation-and-benefits/#Models",
                        "https://www.aihr.com/blog/compensation-and-benefits/#Models",
                        "https://time.com/5353848/salary-pay-transparency-work/",
                        "https://time.com/5353848/salary-pay-transparency-work/",
                        "https://gov.gitcoin.co/t/dao-compensation-sustainability/10604/31",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-22-2022/10972",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-21-2022/10911"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.917214912280702
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/06/2022-13:37:43",
                    "content": "Hey Loie, Great to see this written out here, and thank you for all the time you’ve already invested in this. Some thoughts that pop up while reading. This document contains some solid arguments on why we need to be more consistent on how we pay DAO contributors. However, I don’t think this needs to be a proposal of any kind at this point, but I think it’s a great start for a framework and it will help establish the people ops team in DAO Ops as the team to consult for any hire. DAO Ops is the workstream that services the rest of the DAO in its operational needs and I hope everyone will come to you & saf for support and advice. So to me this is not a proposal, this is just part of your mandate and domain. Workstreams should follow the advice process when it comes to the topic of compensation, but we can and should not impose any guidance imo. As a reminder for anyone reading this, this is how the advice process works:   It comes in many forms, but the essence is consistent: any person can make any decision after seeking advice from 1) everyone who will be meaningfully affected, and 2) people with expertise in the matter. Advice received must be taken into consideration. The point is not to create a watered-down compromise that accommodates everybody’s wishes. It is about accessing collective wisdom in pursuit of a sound decision. With all the advice and perspectives the decision maker has received, they choose what they believe to be the best course of action. Advice is simply advice. No colleague, whatever their importance, can tell a decision-maker what to decide.   I think people will happily seek out your advice but not trying to pass a policy or guidance as a proposal will avoid any unnecessary friction or extra overhead, as this guidance will evolve anyway. Some thoughts on the 4 points:  Transparency, all for it. I think we’re already moving this in this direction and hopefully People Ops can discuss with workstreams to already get to this point by the end of this season. In half of the workstreams this info is readily available, in the other half it is not.      loietaylor:  Without a legitimate process for arriving at salary offers, salary transparency could wreak havoc culturally in our teams. Salary has been yolo’d across the DAO.   I strongly agree with this and tbh I think this is already very much the case. Most salaries are transparent already within the DAO, so I think it’s good to have clearer guidance and a strong advice process. However the big issue at hand is with this proposal not tackled, how do we deal with the current compensation, for existing contributors, as this is already causing tensions?  I shared some of my thoughts on this here and would love to continue this discussion. The idea of bands of payments makes total sense to me, but it seems more pressing to give some clear guidance here, especially in the context of the bear market, as we probably also won’t hire that many people in the near future. We have to however deal now with the internal tensions because of salary inequalities and the existing (partlal) opaqueness of the salaries & logic.   Global salary benchmark: this makes sense to me, but I see this as an advice process, so I appreciate that there are some benchmarks available.   Compensation committee: yes!   Denomination in stables: hell yes. I think except for FDD all workstreams do this. I hope a conversation can be started with FDD to move to this simpler model, until we have some more DAO-wide guidance in place. This reduces complexity in accounting, which also means less overhead for FDD (so more focus) and more transparency across the board. (@DisruptionJoe)   So tl;dr - loving all of this, hope this can be the start of a living document in the people ops hub and that all workstreams will seek out the help of this committee for future hires. Looking forward to more input on current compensation across the DAO. ",
                    "links": [
                        "https://gov.gitcoin.co/t/dao-compensation-sustainability/10604/29"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375173611111111
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "1",
                    "time": "08/06/2022-14:31:37",
                    "content": "    krrisis:  I think except for FDD all workstreams do this. I hope a conversation can be started with FDD to move to this simpler model, until we have some more DAO-wide guidance in place. This reduces complexity in accounting, which also means less overhead for FDD (so more focus) and more transparency across the board. (@DisruptionJoe)   FDD has denominated in $ rates for both contributor pay and our budgets since Season 11. Not sure what you mean here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.642361111111112
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/06/2022-15:20:29",
                    "content": "What I understood from the Friday strategy call contributors’ salary is denominated in GTC with an insurance policy in case of downturn of the market, but maybe I misunderstood this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#5",
                    "likes": "0",
                    "time": "08/06/2022-16:34:40",
                    "content": "It is paid in GTC, but denominated in USD. The downside insurance is to protect contributors from violent downward price swings which make the spot price more than 10% lower than the 20 day moving average which is what is normally used. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#7",
                    "likes": "2",
                    "time": "08/06/2022-17:00:00",
                    "content": "    DisruptionJoe:  The downside insurance is to protect contributors from violent downward price swings which make the spot price more than 10% lower than the 20 day moving average which is what is normally used.   Curious if the upside is capped to protect the treasury from those swings too? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6000000000000005
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#8",
                    "likes": "2",
                    "time": "08/06/2022-18:54:38",
                    "content": "    krrisis:  Denomination in stables: hell yes. I think except for FDD all workstreams do this.   Kris, I think you might have been combining PGF & FDD in your perception here. To my knowledge PGF is the only workstream denominating in GTC. The downside insurance is FDD tho ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#9",
                    "likes": "1",
                    "time": "08/06/2022-18:57:52",
                    "content": "If we need to provide downside insurance and then create a mechanism for softening upside as well because we are using a 20 day moving average, would it then make more sense to just not use the moving average? Simplification. Do spot price on payday the way some other workstreams do? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#10",
                    "likes": "0",
                    "time": "08/06/2022-19:54:24",
                    "content": "We do soften the upside as well. Imagine a monthly pay where you Earn $10,000/month. We will compare each of the following 3 situations using each of the 3 models. (Pay spot, pay 20 day ma, pay FDD downside risk insurance model)  The Situation - How the price moved SITUATION 1 - You experience a 30% price downswing. Let’s also imagine price had been pretty steady at $10/token the 20 days prior, but the swing really pulled the ma down to 95% of what the price was most of the month. SITUATION 2 - No price movement SITUATION 3 - The opposite of situation 1. A 30% upswing bringing the token price to $13 and the 20 day ma to $10.50.  The Model - How we determine the amount of TOKEN to pay Model 1 - Pay using spot price Model 2 - Pay using 20 day moving average Model 3 - Pay using FDD downside risk insurance model  How it plays out - The usd value contributor receives / The amount of TOKEN paid  Situation 1 -  $7 Spot / $9.50 20 day ma (Model = Token value when contributor is paid / How much TOKEN is spent) M1 = $7,000 / 1,000 M2 = $9,500 / 1357 M3 = $9,000 / 1286  Situation 2 - $10 Spot / $10 20 day ma M1 = $10,000 / 1000 M2 = $10,000 / 1000 M3 = $10,000 / 1000  Situation 3 - $13 Spot / $10.50 20 day ma M1 = $13,000 / 1000 M2 = $10,500 / 808 M3 = $10,500 / 808 (Calculate as $10,500 / $13 because it is the higher of the 2 and cost the workstream less TOKEN)  If you used the same model 3 periods in a row that played out this way ($ amount contributor was paid in token at time of payments / How much GTC the workstream spent)  1 month of each situation All using M1 = $30,000 / 3000 All using M2 = $30,000 / 3165 All using M3 = $29,500 / 3094  3 down months in a row All using M1 = $21,000 / 3000 All using M2 = $28,500 / 4071 All using M3 = $27,000 / 3853  3 up months in a row All using M1 = $39,000 / 3000 All using M2 = $31,500 / 2424 All using M3 = $31,500/ 2424 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.276143790849673
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#11",
                    "likes": "1",
                    "time": "08/06/2022-22:11:52",
                    "content": "Wait, I’m confused @DisruptionJoe . Shouldn’t “Model 1 - Pay using spot price” mean that a contributor is paid their salary amount (10k) according to the price that day? So the Token value when contributor is paid should always be $10,000 in that case. But what i see here:  Situation 1 - $7 Spot / $9.50 20 day ma (Model = Token value when contributor is paid / How much TOKEN is spent) M1 = $7,000 / 1,000 M2 = $9,500 / 1357 M3 = $9,000 / 1286  is that in Model 1 the contributor is being paid denominated with the token price at $10. No? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.234375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#12",
                    "likes": "2",
                    "time": "08/06/2022-22:56:38",
                    "content": "Thanks for this Loie! Want to emphasize the fact that this is a MVP/interim solution to get each workstream aligned on the basic principles of transparency and consistency on comp throughout the DAO. To me, this is a crucial step towards developing procedural fairness in whatever a future cohesive DAO-wide compensation policy could look like. In addition to the reasons you’ve listed, I think these are both also very important for building trust among contributors and better coordination. Studies show that greater pay transparency makes it more comfortable for people to ask for help from their co-contributors. A next step once these core principles have been established could be developing and agreeing on what the guiding principles would be for a more fleshed-out framework with greater flexibility, optionality, and leveling up strategies for contributors. ",
                    "links": [
                        "https://link.springer.com/article/10.1007/s10869-015-9427-4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.529166666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Maxwell",
                    "index": "#13",
                    "likes": "4",
                    "time": "09/06/2022-00:36:26",
                    "content": "Thank you so much Loie for surfacing this idea. Comp is an extremely important and complicated topic across DAOs, and I’m very grateful to see all your thoughtfulness surrounding compensation within People Ops and GitcoinDAO. The amount of research and care you and Saf have put into this proposal is beyond clear, and I feel extremely fortunate to work alongside you both. Since this is my first gov post, I’ll give a quick intro. My name is Maxwell and I joined PGF full-time last month as a Talent Lead to help with hiring, onboarding, and contributor experience. I’ve been thinking a lot about comp since I came onboard, and I’m both supportive and cautious about this proposal. My support comes from the fact that it is an extremely important problem, and one that needs immediate attention. I’m also supportive because I very much trust you and Saf and your respective expertise in this area. As you write,     loietaylor:  Community ownership of a project rests on transparency, and transparency rests on legitimacy.   I couldn’t agree more, and this is the North Star in my mind for thinking through how we might create more effective and equitable compensation policies. My caution is that this process might create a bottleneck, whereby you, Saf and Loie, need to approve all hires from other workstreams. This bottleneck could create unnecessary friction, and impede on workstream agency. That being said, I do appreciate this framing as a S14 policy, with the goal of having a framework by S15 that would allow workstreams to ‘regain control’ in setting compensation. I very much appreciate Kris’s framing here as well.     krrisis:  This document contains some solid arguments on why we need to be more consistency on how we pay DAO contributors. However, I don’t think this needs to be a proposal of any kind at this point, but I think it’s a great start for a framework and it will help establish the people ops team in DAO Ops as the team to consult for any hire.   I agree that these solid arguments may be better implemented as a framework that offers evidence-based advice, rather than a policy or mandate. My other caution with this sort of policy is that it’s essentially a top-down decision made by People Ops. I do, however, appreciate that this is well-within the domain of authority of People Ops. An alternative I might propose is that a compensation commitment be the result of all the ‘hiring’ folks from DAO Ops, MC, PGF, MMM, and FDD coming together to form a collective framework in a ‘bottom up’ way, based on their unique and contextual experience. I worry that any policy or proposal around compensation or contributor experience that doesn’t take into account the unique context of each workstream will struggle to receive mass-adoption across all the workstreams in GitcoinDAO. I’m curious about the ways in which this proposal has been co-designed with other workstreams, or alternatively how this proposal could be collectively revised by the relevant folks in each workstream? I also wonder how we might think of comp variability across GitcoinDAO as a feature, not a bug. There may be legitimate and valuable reasons why compensation has historically been variable between workstreams. I’d love to hear anyone’s thoughts or pushback here. Ultimately, I think we, as GitcoinDAO, need to do a better job making sure all of our contributors feel taken care of. I’m immensely supportive of any initiative in this direction. Thank you, again, Loie and Saf, for your hard work here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.135823170731706
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#14",
                    "likes": "0",
                    "time": "09/06/2022-11:20:06",
                    "content": "There is definitely room for subjectivity and I probably messed up the math somewhere here (wrote it up quick at 10pm my time), but the idea is that the prices swings happen quite quickly. Let’s say the whole month you are working the price is $10. Then at the end of the month we set up the payments. They don’t go out exactly at midnight on the 31st. Let’s say they go out on the 3rd. This is where the discrepancy can be. It could happen that we put all the payment amounts into an excel, then to a multisig request where it took 24 hours to get 4 signers. Now this situation happens. Could we increase the latency in paying the contributors? Possibly, but we did this because there were real issues where a few pay periods in a row where contributors where getting screwed by using the 20 day ma when spot price moved from it. Also, not arguing for it. Just sharing to help you all see the options available. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.758333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#15",
                    "likes": "2",
                    "time": "09/06/2022-11:23:13",
                    "content": "    Maxwell:  I agree that these solid arguments may be better implemented as a framework that offers evidence-based advice, rather than a policy or mandate.   I agree wholeheartedly with this. Most policy should start as expert advice which gets adopted by workstreams because it works better. Then, it gets ratified to policy to protect new workstreams from wasting too much time experimenting in a space where we already have seen the experiments play out multiple times. Also, WELCOME to the FORUM!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6313131313131315
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#16",
                    "likes": "3",
                    "time": "09/06/2022-14:34:27",
                    "content": "    DisruptionJoe:  Could we increase the latency in paying the contributors? Possibly, but we did this because there were real issues where a few pay periods in a row where contributors where getting screwed by using the 20 day ma when spot price moved from it.   So tbh I think this is an example of where we can indeed reduce complexity as @loietaylor mentions. I think we now have more than enough people on the team to get things signed quickly and adapt numbers if a payment gets stuck. It increases transparency and we don’t need insurance models or moving averages. We just pay everyone in the same way and stewards understand budgets and payments better because we reduce complexity within workstreams to a maximum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#17",
                    "likes": "0",
                    "time": "09/06/2022-17:41:32",
                    "content": "    DisruptionJoe:  M3 = $10,500 / 808 (Calculate as $10,500 / $13 because it is the higher of the 2 and cost the workstream less TOKEN)   I dont quite understand this, but would love to. in this model, 10.5 is not higher than 13… can you say more on this one? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#18",
                    "likes": "0",
                    "time": "09/06/2022-17:45:17",
                    "content": "You could use the spot price or the 20 day ma. When the price is above the downside risk insurance (10% under 20 day ma), then we use whichever price is HIGHER because it costs the workstream LESS GTC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.138888888888888
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#19",
                    "likes": "0",
                    "time": "09/06/2022-19:21:19",
                    "content": "Ok hold on, can we go back to my question re: spot price? There isn’t actually room for subjectivity around what spot price means… And it would be really good to know if FDD has a different definition of “using spot price” than other workstreams. What spot price means to me is that in every single situation, Model 1 results in the token value when contributor is paid = 10,000 I think if there truly is up to 3 days between the “spot price” you use to calculate the GTC amount & when that actually gets paid out, then the moving average would be absolutely necessary. Spot price really only works if you can pay out day of. (please correct me if i’m wrong here but i feel like this hasn’t been addressed and is a crucial definition) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.135989010989011
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#20",
                    "likes": "2",
                    "time": "09/06/2022-19:45:17",
                    "content": "I guess it is a time of calculation and time of payment difference. Yes. I agree that spot price would be good if there wasn’t an issue, but we saw this playout multiple times and there were requests to do something about it. So we passed a proposal. I’m all for using spot price if the payments are denominated in $ AND we know exactly when people will get paid. Perhaps a reduction of complexity is in order as @krrisis  mentioned, but I think it would be less complex to wait until the new strategy is ready before we change things for FDD. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5854978354978355
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#21",
                    "likes": "4",
                    "time": "10/06/2022-16:30:00",
                    "content": "Agree with all of this 100%. A few things to clear up:     Maxwell:  My caution is that this process might create a bottleneck, whereby you, Saf and Loie, need to approve all hires from other workstreams. This bottleneck could create unnecessary friction, and impede on workstream agency.   This is a fair point, and I want to make clear that the intention isn’t for Loie and I to work in a silo and provide mandates other workstreams need to follow. I think this could have been clearer in the original post but for this initial framework, the suggestion is that we will work with the Workstream Lead/Talent Coordinator who is doing the hiring for the role - not “approving hires” but offering a service as People Ops “experts” and providing a suggested comp that may or may not be taken up. It wouldn’t make sense for all workstreams to be part of the comp determination process for another workstream’s hire, but we do intend on sharing the process and suggested comp details for all workstreams’ benefit.     Maxwell:  I agree that these solid arguments may be better implemented as a framework that offers evidence-based advice, rather than a policy or mandate.   Yes, that is exactly what it is.     Maxwell:  An alternative I might propose is that a compensation commitment be the result of all the ‘hiring’ folks from DAO Ops, MC, PGF, MMM, and FDD coming together to form a collective framework in a ‘bottom up’ way, based on their unique and contextual experience.   Yes, a more fleshed-out compensation framework that each WS can fork and adjust for their own needs will be built together with the Talent Coordinators/Leads of each WS. Again, this is a Minimum Viable Product proposal to align on values and offer an interim solution that at least has some coherent logic, which we think is an important step on our way from yolo’ing all comp within the DAO to having a more robust framework that we can point to when making future compensation decisions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#22",
                    "likes": "4",
                    "time": "11/06/2022-03:08:34",
                    "content": "Kris, thank you for the wonderfully thoughtful comment! i’ll address a couple points:     krrisis:  DAO Ops is the workstream that services the rest of the DAO in its operational needs and I hope everyone will come to you & saf for support and advice. So to me this is not a proposal, this is just part of your mandate and domain. Workstreams should follow the advice process when it comes to the topic of compensation   I super agree with this ideal state you describe. Unfortunately this is not at all the case. Despite talking with workstream leads for months about having more logical comp, and People Ops holding the domain of compensation the whole time, any attempts at guidance around comp have been left behind and workstreams have not been seeking advice. Now, we have ALL had a lot on our plates and a lot of this is due to just trying to move as quickly as possible on what is most essential. (myself included! i know I even have an unsent comment open on @seanmac’s proposal on MMM contributor levels ) However I don’t think that simply making suggestions will result in there being legitimate compensation across the DAO. Evidence: I made a DAO Hiring Process Guide (including a section on making a salary offer) back in November and circulated it a few times, and afaik no workstreams used it.  the big issue at hand is with this proposal not tackled, how do we deal with the current compensation, for existing contributors, as this is already causing tensions?  Indeed this is a big issue - and I propose that we create a skills/competency leveling matrix that is custom to gitcoin. Such matrixes usually look something like this:  Screen Shot 2022-06-10 at 5.37.52 PM2192×1076 355 KB  Ours however would be customized to our own DAO and might include such verticals as: self-management, ecosystem expertise, and MAYBE even proximity to our essential intent. But in the vein of trying to make sure our work is efficient & useful, it’s important to get workstreams on board with actually using this stuff. A custom competency matrix like this would allow:  anyone to score a new job candidate into a salary band, independently folks to evaluate salary levels in a fair way if we DO need to go into a period of leveling inequal/unjustifiable pay  contributors to self-assess what skills are the most important to gitcoin, therefor seeing what they should improve upon to become more valuable to (and valued by) the organization. great for using professional development resources in a smart way.  It’s hard to know though whether we should embark on this work when workstreams are still arguing against having a shared comp logic. I really don’t want this to become a piece of work that People Ops produces and doesn’t end up getting used by workstreams. People Ops is in an interesting position. MMM can produce content, run events, etc. GPC and Moonshot can code & release changes to our products. DAO Ops tooling can make changes to our discord structure. FDD can change our grants eligibility enforcement. But when People Ops produces work, folks across the DAO have to agree to use it, otherwise it just sits & gathers dust while the people problems tend to persist. I’m not complaining (i love people operations work & this interdependency has always been an inherent truth of it in every flat org I’ve been in ), but I am trying to draw attention to how and why it’s crucial to get agreement on these things. ",
                    "links": [
                        "https://www.notion.so/gitcoin/DAO-Hiring-Process-13c570dc4d9c48cba69eee8ea2e95b52",
                        "https://gov.gitcoin.co/t/proposal-community-input-on-gitcoindao-s-draft-purpose-essential-intents/10662"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.879808638331365
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#23",
                    "likes": "0",
                    "time": "11/06/2022-03:20:48",
                    "content": "Maxwell, I want to thank you also for an awesome comment! And welcome to the forum  @safder made a great reply to you and I’ll add just a little more  An alternative I might propose is that a compensation commitment be the result of all the ‘hiring’ folks from DAO Ops, MC, PGF, MMM, and FDD coming together to form a collective framework in a ‘bottom up’ way, based on their unique and contextual experience.  We tried to do it this way various times over the course of January-April. But nobody sunk their teeth in. I’m trying to get to a realistic deliverable, and so far a taskforce approach has failed. We’ve also collected a ton of signaling so far already - surveyed folks on comp in the DAO and done a lot of advice process by listening to how workstreams feel. I don’t think we are 100% there with the participatory nature of it but I’m trying to prioritize delivering something. If like you suggest, the talent coordinators from each workstream wanted to commit 5 hours/week to this for the next 6 weeks, I think we could do it. (More cooks in the kitchen takes longer). I’m not sure it’s the best use of everybody’s time since folks will want to customize a bit anyways, but if ppl felt really strongly this is the way to do it, and 110% committed to that time investment, I’d be down to try!  I also wonder how we might think of comp variability across GitcoinDAO as a feature, not a bug. There may be legitimate and valuable reasons why compensation has historically been variable between workstreams.  There’s a lot of merit to this! I think if we do land on it being okay for some workstreams to pay way better than others, it will likely be related to those experimental verticals (proximity to essential intent) I mentioned above when talking about the competency leveling matrix. The way we determine those: interviews with workstream leads/hiring ppl asking why a certain contributor was paid more than another. We are already starting these conversations & they’ll be very important over the next 6 weeks. In some of those decisions we will find our legitimate logic for why one role is more valuable than another, and we can then put that into a competency leveling framework. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.20602278545827
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#24",
                    "likes": "3",
                    "time": "11/06/2022-03:30:49",
                    "content": "Now, for everyone to be aware of (especially WS leads and Talent Coordinators): Today I spent some time digging on etherscan. Starting only with the knowledge of my own address that I receive my pay at, I was able to find out the salary amounts of several contributors in multiple workstreams. One workstream in particular that statedly DOES NOT have salary transparency, I was able to find out the exact salary attached to names of 15 of their contributors. Including the highest paid ones. Including the 6 that did not have a direct ENS name. I’m no block explorer genius, and this was not my own workstream. I wasn’t signed into Notion, or looking at google docs, nothing just etherscan. The fact is that we already have salary transparency. We are just not facing it. Naming this state of salary transparency as what it is would be MUCH more honorable to the contributors. I’ll remind folks that this minimum-viable-policy here point #1 says “We state that our default is salary transparency.” Key word being state. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.052083333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#25",
                    "likes": "2",
                    "time": "13/06/2022-12:23:45",
                    "content": "    loietaylor:  Ours however would be customized to our own DAO and might include such verticals as: self-management, ecosystem expertise, and MAYBE even proximity to our essential intent. But in the vein of trying to make sure our work is efficient & useful, it’s important to get workstreams on board with actually using this stuff. A custom competency matrix like this would allow:  anyone to score a new job candidate into a salary band, independently folks to evaluate salary levels in a fair way if we DO need to go into a period of leveling inequal/unjustifiable pay  contributors to self-assess what skills are the most important to gitcoin, therefor seeing what they should improve upon to become more valuable to (and valued by) the organization. great for using professional development resources in a smart way.    I am HIGHLY supportive of this. It would be great to workshop what the rows could be as you suggested some great Gitcoin specific ones. (I love the essential intent, ecosystem savvy, and self-management suggestions.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.76151121605667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#26",
                    "likes": "5",
                    "time": "14/06/2022-03:14:38",
                    "content": "Hi Loie, Great to see this policy moving forward.  Keep pushing, and thanks for the opportunity to offer some constructive critcism.  General Thoughts  Screen Shot 2022-06-13 at 8.17.46 PM1738×748 95.5 KB  Generally i think a comp policy could aim for :  More performance for network More sovereignty for workstreams (or people) More entitlements for people (note I make no judgement about entitlements being legitimate or not here, there are many moral and competitive reasons to have various entitlements for people.  There are many entitlements (healthcare, benefits, live-able and competitive wages to start) that I personally think are extremely legitimate.   A good proposal should transcend and include these 3 criteria.  I think a balance of these things could be achieved (this is the green dot in the diagram above) and is the target for me personally.   Major Items My major worries with this policy:  This proposal doesn’t tie contributor comp to dao success.  Where is the shared sacrifice in a bad market and shared success in a good one?   Missing the financial analysis to know how much comp the DAO can support.  The policy is doing a massive disservice to the DAO if it commits to entitlements beyond what the economic model of the DAO can support.   A perfectly level + fair compensation policy that will only lasts 3 months does no good for anyone. I know the DAO has not hired its finance lead yet, but it does have llamas already - who posts a monthly financial report and solicits feedback about what people need on it.  A very basic analysis could be done just using S14 numbers. The market is hemorrhaging value right now, and given how much the DAOs success is tied to the crypto markets, I think survival of the DAO should be everyone’s top priority right now.  So this is a big showstopper for the DAO ratifying the proposal IMO.      Minor Items Less major (but not insignificant) worries:  Is it very above market to do us base + 30%  base should be comparable should be seed stage startups not mature web2 companies. (I’m not convinced it is right to tie all global compensation to US salaries).   Missing parts to the comp policy.  This proposal offers no consideration for grandfathered in ppl. no consideration for project work. no consideration for sovereignty of workstreams.  I worry that having a centralized compensation committee approving rates violates the sovereignty of the workstreams to hire who they want, how they want.  I share Maxwells concern here. If the past hiring guides have not been useful for DAO workstream leads, I think that is an opportunity to figure out how People Ops can solve the problems that are in demand from workstream leads - making policies mandatory is not the solution.   I have seen a major demand for accountability in each of the surveys we’ve done, and I’m concerned that our comp policy does not seem to speak to accountability at all.   On salary transparency:  I am not strongly pro or against salary transparency, but I also haven’t seen any demand for salary transparency being voiced organically - which makes me think it’s not much of a priority.  It’s not been on the top 3 list of concerns from in the surveys about people problems to fix that I’ve seen (though Kyle did ask for a compensation policy in his answer to the latest “People Success - Problems” doc).   IMO There should be a broad consensus about salary transparency or individuals should be given an opportunity to consent to disclose salaries should be given before doxing anyone’s salaries.   Stating that there is already an implicit policy of salary transparency just because people are careless about not doxing their addresses (or not using ZK tools to achieve privacy) is not a good argument for salary transparency IMO.     Thanks for allowing me to list out these constructive criticisms.  I will support whatever the DAO decides to ratify here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.545266897081413
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#27",
                    "likes": "0",
                    "time": "14/06/2022-19:54:15",
                    "content": "has any research been done on other DAOs in comparable vertical’s (DAOs, ImpactDAOs, any other way to slice it) compensation policies?  that might be useful to ground this discussion in what’s working elsewhere. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#28",
                    "likes": "2",
                    "time": "14/06/2022-22:16:51",
                    "content": "I love many aspects of this proposal, but am skeptical of a few as well  Transparency I am neutral here… I like the ideals of transparent salaries, but in practice, i haven’t found it very beneficial, so i could go either way.  Global Salary Benchmark I strongly disagree with the proposed policy. US Base + 30% ? This doesn’t make any sense in general IMO… If you are hiring a strategic expert solidity dev, you might need to pay a lot more than US base + 30%, or if you are hiring an admin from the Philippines there is no reason to triple their expected salary. For an Impact DAO going into a bear market, especially given the current state of GTC, we should consider trying to reduce our number one expense, salaries. What are we doing to create the demand that will balance out this issuance? I am going to rally hard against large workstream proposals next round. We have to get scrapier, and start hiring talent that live in less expensive countries. We are a global impact DAO with the opportunity to hire people from all over the world that are ideologically motivated. We should allow workstream leaders to minimize their budget and handycapping them to US wages + 30% is unnecessary.  Saf & Loie are the Compensation Committee I love this as a concept, but I generally like what @krrisis brought up with it being more advice than control. The workstream lead has a budget and goals, they should have the agency to make the necessary budget decisions to satisfy their requirements.  Denomination in stables Definitely, whole heartedly agree, GTC is a horrible unit of account. I would denominate pay in Stables and use the GTC exchange rate at the time of transfer (not moving average).  General Thoughts I love @owocki’s triangle above, and added my own placements:  Screen Shot 2022-06-14 at 4.54.05 PM1920×817 47 KB  The big thing missing here is Vesting in GTC…There should be some vested interest in the DAO’s success. People being paid a salary should also get some future GTC to align their personal best interests with the GitcoinDAO’s best interest. Maybe the lower the salary, the more GTC they get, but it is locked for ~3 years (when we will hopefully be for sure into the next market cycle). I think this policy is trying to over prescribe payments for the good of the individuals working in GitcoinDAO but at the expense of (or in complete ignorance of) the actual GitcoinDAO reality. We need to fund projects that will bring economic stability to the economy and make reasonable budget cuts until we can do that. Spending millions of GTC when there is so little demand and liquidity for the token is irresponsible. Let’s approve high level budgets for work streams, and support work stream leads in salary negotiations, but let’s consider also what is in our means and not tank the value of GTC by overspending it. Major Companies are cutting their costs by 20%, sadly we should follow suit… we don’t have nearly the same income streams that they do, and grew too fast beyond our means. Our budgets are not balanced, we cannot lock ourselves into US base + 30%.    CNBC – 2 Jun 22    Winklevoss twins' Gemini cutting 10% of its staff, saying 'crypto winter' is... Winklevoss brothers are laying off 10% of the workforce at Gemini, a first for the U.S.-based cryptocurrency exchange and custodian.      https://www.theguardian.com/technology/2022/jun/14/crypto-exchanges-coinbase-blockfi-staff-cryptocurrency-bitcoin-price ",
                    "links": [
                        "https://www.cnbc.com/2022/06/02/winklevoss-twins-gemini-citting-10percent-says-crypto-winter-is-here.html",
                        "https://www.theguardian.com/technology/2022/jun/14/crypto-exchanges-coinbase-blockfi-staff-cryptocurrency-bitcoin-price",
                        "https://gov.gitcoin.co/t/s16-proposal-integrated-dao-operations-budget-request/11811/30"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.184220779220779
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#29",
                    "likes": "1",
                    "time": "15/06/2022-03:11:33",
                    "content": "Thanks for the thoughtful responses @owocki and @griff! A couple personal takeaways from the conversation so far:  We may have brought this discussion to the wider community too early or framed it incorrectly; as I’ve repeated, this was by no means meant to be a  long-term or even medium-term policy - just an interim solution to align on before a more thorough framework that takes into account many of the concerns that have been raised. Currently, there isn’t any coherent process for determining comp in any workstream that I’ve come across. We figured that this could serve as a prerequisite MVP before launching into wider comp discussion, but looks like we’ve opened up that Pandora’s box anyways, and there isn’t much appetite for anything less than a complete and long-term solution to this problem. The compensation conversation is clearly top of mind for many in the DAO, and there is a need for People Ops to develop such a solution ASAP with the respective workstreams’ Talent Coordinators (People Ops representatives for each WS).  The Challenge The comp conversation is simultaneously urgent and also one that keeps getting skirted around. My theory is that many contributors are getting paid generous bull market salaries and want to delay the effects of the uncomfortable bear market reality we find ourselves in for as long as possible. It’s a scary time to be in the most precarious of industries, so I don’t blame them. To make a comp restructuring as painless as possible, transparency will be a requirement imo, not an option, as will a consistent and coherent logic to who gets paid what. What we don’t want is a web2 scenario of contributors getting laid off/receiving pay cuts while people at the top of the food chain remain immune - some form of transparency will be required to ensure that this doesn’t happen.     owocki:  has any research been done on other DAOs in comparable vertical’s (DAOs, ImpactDAOs, any other way to slice it) compensation policies? that might be useful to ground this discussion in what’s working elsewhere.   Yes, I’ve compiled my research here. This will be used to develop a wider compensation model for the DAO. On US-Based Compensation For me, the reason we use the US as a benchmark for salaries is because:  This is where most of our existing contributors are. This is where our largest market is, where most grants originate, and where we raise funds. This is where regen-crypto/value-aligned contributors mostly originate, due to the US and western ideals-based marketing approach of the space.  The logic from “US+30%” comes from the fact that at almost any other tech company in the US, you would receive several benefits (health insurace/bonuses/401k matching/etc) on top of your salary that are generally worth approx. 25% of salary. The other 5% is “DAO hazard pay” which is meant to cover the increased risk/costs associated with DAO work. While I generally agree that there may be a need to reevaluate this approach and realign everyone’s salaries with a more reasonable benchmark, and that this could lead to some cost savings, I disagree that salaries should be location-based. The power dynamics created by hiring future workers from low cost-of-living regions and paying them significantly less would be pretty alarming imo, on top of the already existing global power structures that disadvantage those populations to begin with. Not a recipe for a healthy workplace, and not very regen. Looking forward to continuing this conversation with the community and working on a Gitcoin DAO comp structures that feels fair, sustainable, and transparent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8693910256410255
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#30",
                    "likes": "1",
                    "time": "15/06/2022-05:44:35",
                    "content": "I agree this convo is really just too early… probably 2 or 3 years too early. We are not a fortune 500 company. We have to start looking at making reasonable budgets, and living within our means, whatever that takes. This conversation on salaries is simply putting the cart before the horse. Where does the DAO get income? What is creating demand for GTC? Is giving someone 2000 GTC some how, at least indirectly creating 2000 GTC worth of demand to balance out the cost? I don’t think GitcoinDAO is in a stable place where we can take the agency away from work stream leads to make the tough decisions they are going to need to in the upcoming year. If someone is willing to work for less, we should take them up on it. If we can hire an admin for $12 an hour to fill a role, we should do it. There are likely to be very rough times ahead. I think standardizing salaries to US rates is a convo for another time. How many current core team members are there, and what is the current burn rate? Let’s take a VERY conservative estimate and say that we have 10 people making 5k a month (60k a year)… This is 50k a month.  Screen Shot 2022-06-14 at 10.28.53 PM966×856 197 KB   Screen Shot 2022-06-14 at 10.29.51 PM1004×826 201 KB  Well to get the 50k we would cause around 20% slippage and take the price from $2.05-$1.60. We need better liquidity or just need to plan on cutting whole work streams before we start saying that everyone’s salary should be US levels. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.240123456790124
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#31",
                    "likes": "3",
                    "time": "15/06/2022-06:33:31",
                    "content": "Hm I’m not sure I understand what you’re suggesting. We’re not going from a place of “no salary/contributors are working for free” to “US rates”. We already have US-based contributors making US rates. The goal with the comp framework is to ensure existing pay structures in the DAO (there currently are none) make sense, for existing DAO contributors before any future ones. For budget/cost-saving purposes, having clarity and consistency across existing contributor salaries is going to be more lucrative than hiring future contributors at less than minimum wage.     griff:  I think standardizing salaries to US rates is a convo for another time.   We already pay based on US rates, except some people are overpaid while others are underpaid. There is no consistent logic to how we pay people.     griff:  Well to get the 50k we would cause around 20% slippage and take the price from $2.05-$1.60. We need better liquidity or just need to plan on cutting whole work streams before we start saying that everyone’s salary should be US levels.   Workstreams are already spending much more than this with minimal slippage. Not sure where you’re getting your data, but as demonstrated here, workstreams making these payments has no measurable effect on GTC spot price. I feel like what you’re suggesting here is a state of chaos/free-for-all, and bear market or not, nothing useful is going to get built that way - not to mention the fact that this won’t actually change anything about our current burn rate. As a DAO Ops contributor, I’m going to continue championing clarity and consistency in how we operate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.267156862745098
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/sarahdw",
                    "index": "#32",
                    "likes": "1",
                    "time": "15/06/2022-10:30:22",
                    "content": "Also my first forum post! Hi, I’m Sarah, and I’m a contributor on the PGF workstream (and super passionate about equity and transparency in comp overall). As we want to operationalize and scale our processes, I believe this kind of approach, informed by market data and led by People Ops experts is important. Questions:  co-sign Maxwell in terms of creating a more x-functional comp committee, led by people ops, that are trusted to review packages if needed beyond adhering to guidelines. that feels like a good way to handle this process as team grows how are you benchmarking comp overall? are there particular types of crypto company you look at? context: at Omidyar, we found benchmarking hard - we weren’t VC (but had some similarities), weren’t nonprofits (ditto), weren’t tech (ditto). Ended up blending these three fields who have wildly different pay levels bc the org was so unusual, and we hired from all three buckets.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.104166666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#33",
                    "likes": "3",
                    "time": "15/06/2022-15:16:57",
                    "content": "    safder:  The goal with the comp framework is to ensure existing pay structures in the DAO (there currently are none) make sense, for existing DAO contributors before any future ones. For budget/cost-saving purposes, having clarity and consistency across existing contributor salaries is going to be more lucrative than hiring future contributors at less than minimum wage.    The power dynamics created by hiring future workers from low cost-of-living regions and paying them significantly less would be pretty alarming imo, on top of the already existing global power structures that disadvantage those populations to begin with.   What we don’t want is a web2 scenario of contributors getting laid off/receiving pay cuts while people at the top of the food chain remain immune - some form of transparency will be required to ensure that this doesn’t happen.  i think that we should perhaps consider going back to aligning on what GOALS the comp model should have.  what are the MAJOR design criteria, what are the MINOR ones, and are the nice to haves?  without alignment about the goals, we will continue to have misalignment about the comp policies itself. what i perceive from the comments (and conversation) above is that the people ops team has some social justice oriented goals for their comp model, and some of the stewards and others are focused on want to make sure the DAO survives, thrives, and succeeds in market.    im not saying that these things are not compatible with each other ( i personally think there is likely a path to align these goals, if they are ratified as legitimate goals of the comp policy).  what i AM saying is that since this comp model convo skipped the process of aligning on goals for the comp policy, we are having a very messy and misaligned convo to ratify the comp policy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#34",
                    "likes": "0",
                    "time": "15/06/2022-15:44:23",
                    "content": "100% - will discuss this with @loietaylor today and the other workstreams at our weekly hiring sync tomorrow and come up with a list of goals/design criteria we can all agree on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#35",
                    "likes": "0",
                    "time": "15/06/2022-21:46:02",
                    "content": "These 2 concerns from Owocki and Griff are in the same vein.  Missing the financial analysis to know how much comp the DAO can support.   What are we doing to create the demand that will balance out this issuance?  And it is exactly right that this policy guidance doesn’t include this! This policy asks for folks to look at it and decide what would need to be true to follow this guidance, and the forum discussion is doing a great job of serving this purpose. So, we know that financial strategy is an important foundation for a comp policy to stand on. Financial strategy is not within the domain of People Ops. It is within the domain of DAO Ops however, and folks like @kyle and @ChrisDean have been working on securing financial sustainability thru partnerships while other ppl are working on token utility. I would really like to hear these folks chime in here on what they are doing to reach financial stability upon which a compensation policy could stand. I’m glad this conversation has shone a light on this need, because as soon as we have financial stability we really need to have the equitable pay systems in place so we can continue to make hiring decisions in a way that’s sustainable, and makes contributors want to stick around. In the meantime I think we can absolutely shoot towards fair & sustainable comp standards, in fact, agreeing on those will help us use the financial resources properly.  we should perhaps consider going back to aligning on what GOALS the comp model should have. what are the MAJOR design criteria  We mapped out this design criteria over the course of several conversations in the winter. A good outline of the criteria can be found here in the notes from our Compensation Round Table The main criteria in question were:  transparency pay equality btwn workstreams pay equality btwn holdings & the DAO type of experience/competency that calls for higher salary location based pay tokens, vesting, and “total comp” packages  You can see more criteria as well as ppl’s sentiment towards them in the notes. (The notes aren’t amazingly thorough but give you a taste for the conversation) I don’t think it’s completely accurate to say “this comp model convo skipped the process of aligning on goals for the comp policy.” The biggest thing that has changed between then and now is that the market has tanked. So it’s good that we are identifying financial strategy as another important criteria! But the other goals for comp policy were very much arrived at together with DAO members. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.025830200501253
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#36",
                    "likes": "4",
                    "time": "16/06/2022-07:52:27",
                    "content": "    safder:  This is where regen-crypto/value-aligned contributors mostly originate, due to the US and western ideals-based marketing approach of the space.   Europe says hi. This is where ethereum was actually built, with people being paid normal European salaries. The world is really not centered around the US and the salaries of a global DAO should reflect that. I think this matter is quite more contentious than people think and we really should first align on the goals for the compensation model. I will bring it up on the steward council call today. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#37",
                    "likes": "2",
                    "time": "16/06/2022-08:13:11",
                    "content": "    safder:  Hm I’m not sure I understand what you’re suggesting. We’re not going from a place of “no salary/contributors are working for free” to “US rates”. We already have US-based contributors making US rates. The goal with the comp framework is to ensure existing pay structures in the DAO (there currently are none) make sense, for existing DAO contributors before any future ones.   I’ll be clearer, I think we are over paying people across the board, and we need to completely shift gears and start to do more global hiring with smaller salary expectations, and the proposed policy goes against that strategy. Giveth, TEC & Commons Stack are very aligned with Gitcoin’s mission, but have a lot less money so we hire a lot of people in Brazil, Pakistan, Philippines, etc etc to achieve our goals. They are very competent and our “below minimum wage” pay is competitive, especially when you consider the learning opportunities. I hired one person off upwork and for less than $13/hr and now they are a leader in the organization. They have received many raises but still do not make US+30%.     safder:  Workstreams are already spending much more than this with minimal slippage. Not sure where you’re getting your data, but as demonstrated here , workstreams making these payments has no measurable effect on GTC spot price.   You’re right, Gitcoin Price in USD: GTC Live Price Chart & News | CoinGecko there is a lot more liquidity in centralized exchanges. I was looking at uniswap and cowswap (added screenshots), but there is a lot more liquidity on centralized exchanges… I forget those exist sometimes (I avoid them) and was living off my own experience of the lack of liquidity GTC has in dex’s. This does help a lot! Liquidity isn’t a problem right now (well done!). That said, Supply and Demand are a thing, and I still don’t think that a policy to standardize pay at high levels for everyone in the DAO makes sense when we are entering a downturn and are not generating demand for GTC in any way I can see.     safder:  I feel like what you’re suggesting here is a state of chaos/free-for-all, and bear market or not, nothing useful is going to get built that way - not to mention the fact that this won’t actually change anything about our current burn rate. As a DAO Ops contributor, I’m going to continue championing clarity and consistency in how we operate.   No, I am not suggesting chaos. We need order but not from granular salary impositions. We need to have a budget recommendation for S15… like we will not spend more than 1 Million dollars\" and then, yes, we should let entrepreneurial leads have the freedom to be scrappy to make their work stream fit within that budget. We had the first round of denials for work streams in S14, and in S15, I think/hope every work stream will adjust to the new reality. The suggestion of US pay + 30% is a step in the wrong direction in this resource scarce environment. Their budgets should be reduced and to live within that, US + 30% rate may not make sense for a lot of work streams if they want to fit within a budget. ",
                    "links": [
                        "https://www.coingecko.com/en/coins/gitcoin#markets"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8612306740878175
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nett",
                    "index": "#38",
                    "likes": "3",
                    "time": "28/09/2022-01:30:17",
                    "content": "A bit late to the conversation here! I definitely agree that lack of compensation or untimely compensation can risk the loss or interest of essential contributors. Have we considered adopting specific HR tooling to:  Significantly reduce the workload for Saif, Loie and the compensation committee Fully automate the recurring payouts on payday, so that all contributors get paid on time  Some payroll management tools that might be helpful are Coinshift – they recently integrated with Superfluid, so Stewards can fully automate payroll via real-time salary streams. In a way, I can see these streams working as a “social contract” to retain contributors engagement levels as well. I’m pretty sure the streams can be edited or stopped at any time, if necessary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.391666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lunacat",
                    "index": "#39",
                    "likes": "2",
                    "time": "29/09/2022-00:35:52",
                    "content": "Thank you for commenting, @nett.  I’m only adding a comment to help re-facilitate this important discussion that seemed to die off, and acknowledge that apparently half of the compensation committee (does this even exist?) has since left GitcoinDAO. Gitcoin DAO members - get your shit together.  Gitcoin has a great brand, great values, and great people.  Don’t fuck it up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.12962962962963
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#40",
                    "likes": "5",
                    "time": "29/09/2022-20:09:17",
                    "content": "Thanks for the comments both of you and thx for … the encouragement @Lunacat  Definitely keeping our shit together, even though bear markets and reduced workstream budgets definitely impacted us, including this working group within DAOops. However, this does not mean things have not been moving forward. @safder and @Jodi_GitcoinDAO have been working on a comp leveling matrix, of which a version has been implemented by MMM, FDD and finishing up later this season with DAO Ops. Compensation is a tough conversation, so we have taken all the great insights shared here and are now testing out what works within the reality of our DAO context. We will definitely report back, ao. in our S16 budget request, which will include learnings of the past season.     nett:  Some payroll management tools that might be helpful are Coinshift – they recently integrated with Superfluid, so Stewards can fully automate payroll via real-time salary streams.   We’ve definitely thought about this, and are using Utopia Labs at the moment to do payroll. Haven’t personally looked into coinshift but definitely will. Thanks for commenting & sharing! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.177300347222222
                }
            ]
        }
    ],
    "group_index": "132"
}