{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/decentralizing-public-speaking-about-gitcoin/10100",
            "title": "Decentralizing Public Speaking about Gitcoin ",
            "index": 10100,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "4",
                    "time": "16/03/2022-23:10:11",
                    "content": "Hey everyone, The time has come to decentralize public speaking about Gitcoin, and I want you to join the working group. Why do this?  Diversify the voices that are public speaking about Gitcoin, it’s mission, it’s impact, it’s philosophy, etc. Build your personal brand.  Learn by teaching.  Build in public. Commune with our customers/partners, get to see ourselves outside-in. There are a number of 2022 Ethereum Events coming up, if you are attending any of them already, you might as well speak at them! Have fun    How do you get involved in this group?  If you’re interested in joining the group, DM me on discord (@Owocki#1337), and Ill add you to our monthly call, discord channel, google drive full of presentations, and mailing list. If you want to tap this list to have someone Public Speak at your event, please email speakers@gitcoin.co and we’ll hook it up.  Who is eligible?  Contributors who are giving > 30 hours / week to Gitcoin.  ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-10-2022/10209"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.222222222222222
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "4",
                    "time": "16/03/2022-23:10:45",
                    "content": "I’ve been doing public speaking for several years now, and it has been a fun (but hard) journey to evolve how we articulate what we do to the world.  Check out some of the talks I’ve given about Gitcoin over the years if it helps get the creative juices flowing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.508333333333333
                }
            ]
        }
    ],
    "group_index": "20"
}