{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/governance-via-curation-in-gitcoin-grants-may-be-necessary/9365",
            "title": "Governance via Curation in Gitcoin Grants may be Necessary ",
            "index": 9365,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "11",
                    "time": "08/12/2021-14:11:18",
                    "content": "DAOs are bringing an extraordinary conflict into the grants ecosystem. The main Ethereum ecosystem rounds have a precedent that previous token sales can disqualify a grant from being eligible for participation. Having investments over $500k is not a policy, but a norm that has been repeatedly followed. A DAO might have released a token giving it a $100 million market cap and a large treasury. This would make the DAO ineligible for the platform or Ethereum ecosystem according to current policy. There are some edge cases and logical conflicts that make the current policy model unsustainable. CASE 1 BanklessDAO has a token and plenty of funding to go around. But there are still plenty of Bankless grants being created. EXAMPLE: BANKLESS AFRICA | Grants | Gitcoin is a grant for an organization that is starting up and would like to use Gitcoin Grants to get enough traction to get a proposal into BanklessDAO. It could be argued to be a public good. It could be said they aren’t part of BanklessDAO if they didn’t receive direct funding from the DAO. This is difficult to adjudicate because I look at GitcoinDAO workstreams and see that there are many substreams & squads. Each collective level of organization is searching for resources to further it’s mission. CASE 2 https://gitcoin.co/grants/1155/token-engineering-commons & https://gitcoin.co/grants/798/a-hitchhikers-guide-to-token-engineering & https://gitcoin.co/grants/2978/incubating-governauts These three grants all involve Token Engineering Commons. However, they are distinct projects & entities. The difference of these three is that TEC does not have a token and treasury available to fund their projects. Bankless could choose to run a side-round where they supply the matching pool to support the grants in their round. CLARIFICATION But let’s say TEC released a token and had a large treasury. Would we even know if the Governauts was a part of it? In my view, every individual and collective level of organization has independent and autonomous rights. The collectives maintain the right to choose what collectives and individuals may participate in the collective. A policy based solution is not scalable in the long term. We need to move towards governance via curation. Each collective level needs a model to say 'Who has a voice in this curation\" & \"How much weight does their voice carry\" GTC as a decentralizing force GTC governance token is the metric we can (and probably will) use to curate “What is acceptable to appear on the Gitcoin UI” GTC governance token is also used to incentivize curators for the Ethereum ecosystem via the FDD Grant Eligibility stream. For new ecosystems, especially as we move to decentralized grants, the platform curation will separate from the ecosystem curation. This round we added “thematic” rounds. These may have a sponsor who will independently whitelist acceptable grants, but the main gitcoin round should be spread to every public good in the ecosystem. GTC from the DAO can be used to incentivize curation in any rounds with curators being verified non-sybil accounts past a certain threshhold of trust, reputation, ecosystem holdings or whatever threshold we will find in discovery. This takes the single point of failure out of the curation model. NEXT STEPS I believe we need two things to scale this out in the future: STEP ONE We need to distinguish the main Gitcoin Grants round from the Ethereum Ecosystem Rounds. As more integrations have been built, it is impossible to say that the rules for the Eth ecosystem and main round should be the same: EXAMPLE 1: A climate change 501c3 grant in the thematic rounds. Should they receive funding from the Ethereum ecosystem’s funders league donors? EXAMPLE 2: A Zcash ecosystem project. Again, should they receive funding from the Eth Ecosystem sponsors? Both “Ecosystem” & “Thematic” rounds are simply collections of grants with a dedicated matching pool. The grants included in either are always a subset of all the grants on the platform. This should be the “main” round with it’s own matching pool (which might be smaller than the eth ecosystem pool!) STEP TWO We need a dynamic tool for gauging an ecosystems criteria for grant participation & a way for their stakeholders to participate in curation. Using the graph, we can identify stakeholders of an ecosystem. All GTC holders would be curators of the thematic rounds. FDD Grant Investigation Agency is a new squad tasked with adjudicating the Grant Disputes that come up during a round. They are using a tool called Ethelo with consultation from the PG Grants Operations stream, Ethelo team, FDD Policy stream, and the FDD Grant Eligibility squad. They are determining criteria for the Eth Ecosystem, which is now synonymous with the “main round” although it is logically impossible to align these two things with our current trajectory. PURPOSE This post is designed to spark conversation, inform the community, and serve as a precursor to a proposal to potentially have steward ratification of the main round being separated from the Ethereum ecosystem rounds at a technical level and their guidance towards governance via curation. This move would benefit all stakeholders. Matching Pool Funders:  Knowledge that their funds are going to the intended collective of grants Grant Funders: Knowledge that the matching funds they are signaling are not diluted by grants unrelated to the specific ecosystem. More options for ecosystems and themes. Grant Creators: Less dilution of matching funds to unrelated grants PG Grants Operations: Reduced complexity FDD Grant Eligibility: Opportunity opens up for more people to earn by participating in the communities they hold stake in FDD Policy: Less policy to maintain Stewards: Reduces policy questions needing attention to a simple YES/NO should any ecosystem or theme be allowed on the Gitcoin UI and included in the main round? GTC Holders: GTC decentralizing the rewards for “curation mining” on the platform turns would be based on users staking GTC to participate in curating grants lowering the velocity of the token. ",
                    "links": [
                        "https://gitcoin.co/grants/1155/token-engineering-commons",
                        "https://gitcoin.co/grants/798/a-hitchhikers-guide-to-token-engineering",
                        "https://gitcoin.co/grants/2978/incubating-governauts",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24/9446",
                        "https://gov.gitcoin.co/t/the-plateau-of-productivity/10269"
                    ],
                    "GPT-summary": "The author of the proposal discusses the conflict that DAOs bring to the grants ecosystem and proposes governance via curation as a solution. The post explains the need to distinguish the main Gitcoin Grants round from the Ethereum Ecosystem Rounds and the need for a dynamic tool for gauging an ecosystem's criteria for grant participation. The post aims to spark conversation and inform the community, and potentially lead to a proposal for steward ratification of the main round being separated from the Ethereum ecosystem rounds. The post also discusses the benefits of this move for all stakeholders.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Law and regulations",
                        "Privacy, Security and risk management"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.233102453102453
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#2",
                    "likes": "1",
                    "time": "08/12/2021-17:44:24",
                    "content": "    DisruptionJoe:  revious token sales can disqualify a grant from being eligible for participation   Thanks for the thoughts, Joe. I’d love to learn more about the thinking behind “Previous token sales can disqualify a grant from being eligible for participation”… What are some of the best resources to better understand the dynamics here? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#3",
                    "likes": "6",
                    "time": "08/12/2021-18:38:23",
                    "content": "Hi @DisruptionJoe! I think those are really good points that needs to be clarified, thanks for pointing out.     DisruptionJoe:  BanklessDAO has a token and plenty of funding to go around. But there are still plenty of Bankless grants being created.   In short, if you create a DAO with with a Governance Token, that has no “commercial” value, then this grant seems to be eligible and turn into a “grey zone”     DisruptionJoe:  We need to distinguish the main Gitcoin Grants round from the Ethereum Ecosystem Rounds.   Agree! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.816666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#4",
                    "likes": "4",
                    "time": "09/12/2021-04:12:48",
                    "content": "    DisruptionJoe:  but the main gitcoin round should be spread to every public good in the ecosystem.   totally agree with this. I believe that it is a tough question, we could make exploration with control. love to have more positive-sum ideas and solutions here. one side, we would have more public goods support; the other side, we would protect the system, and all the stakeholders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.751262626262626
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/elbeth",
                    "index": "#5",
                    "likes": "1",
                    "time": "11/12/2021-13:49:02",
                    "content": "    DisruptionJoe:  We need a dynamic tool for gauging an ecosystems criteria for grant participation & a way for their stakeholders to participate in curation.   This will be a great tool to gauge the ecosystem. The purposes in step two are laudable. I’m inclined to the point of complexity reduction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#6",
                    "likes": "4",
                    "time": "12/12/2021-08:00:35",
                    "content": "Great move from here! Curation is a great way of coordinating in DAO! Referring to the curate of Kleros which is used by clr.fund, Omen, and DefersiFi the concept is to involve all community members in the curation process. For step one: Creating different curation lists for different rounds and the grant submissions are free to choose which list to go for. The decentralised verification process by the community will identify whether the submission is fit into this round according to the curation list policy. For step two: The grant funders may create a list with their defined policies and the community members are open to joining the verification process to flag out suspicious ones. The disputes could be resolved by external service providers like Kleros, Jur, Celeste (Let’s try not to reinvent wheels in the blockchain world since there are specialized projects that are good at it). Gitcoin provides the platform and community to secure the system. Policies are owned by the owners of the curation lists (Matching Pool Funders, Grant Funders). GTC holders earn by verifying submissions through staking - you may call it “curation mining”. Stewards are focusing on community building instead of Q&A for all kinds of different policies all day. FDD policy holds only the top-level “General Grant Policy” overseeing the policies in all curation lists. This is a realistic governance proposal that is technically accomplished by Kleros Curate and tested by Kleros TCR. Add on an idea about the curation: GTC as the governance token may not be good for incentivizing community members in the curation maintenance. There would be a need for a second token in Gitcoin ecosystem which works as “fuel” to move the community forward with the proper token economic design. ",
                    "links": [
                        "https://curate.kleros.io/tcr/0xba0304273a54dfec1fc7f4bccbf4b15519aecf15",
                        "https://medium.com/@PresenceNumeriq/journey-of-a-fresh-kleros-token-curated-registry-bounty-hunter-1e5f4833ec8a"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.307017543859649
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#7",
                    "likes": "2",
                    "time": "13/12/2021-21:43:07",
                    "content": "How would you start the process of modeling the economic design of a token specific to this process? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#8",
                    "likes": "3",
                    "time": "16/12/2021-06:15:34",
                    "content": "Thank you Joe, I will reply on this topic later, including the suggested new tokens responsible for “rewards” and “reputation” in the curation process and the connections between these two different tokens that are governed by GTC token. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.420454545454545
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lanlan3322",
                    "index": "#9",
                    "likes": "2",
                    "time": "29/12/2021-02:12:32",
                    "content": "To build the foundation for this curation we might consider a new token model:   mirror.xyz    Token Centric DAO - Triple Token Model (part 1) — Mirror As DAO is getting more and more attention there are duel-token models emerging in this ecosystem like POSDAO. Along the way, we realize that the governance token is taking too much responsibility more than securing the system. The heart of the...      This is a rough idea for discussion. @DisruptionJoe @wkarshat ",
                    "links": [
                        "https://mirror.xyz/zhanglaurence.eth/vdyJQadgv9n1C5KU9xwLZoBfcYJ3GR__kCUMpPGK9Jc"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.240259740259741
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/wkarshat",
                    "index": "#10",
                    "likes": "3",
                    "time": "04/03/2022-08:21:24",
                    "content": "An interesting configuration, but with many complex interactions between the tokens, it is difficult to validate from first principles. Have you considered how to model it more formally? With GT as the only governance token, unclear why FT would be readily valued in the open market. Burning FT to gen RT seems to defeat RT purpose, providing a way to effectively buy RT. A single ‘reputation’ metric has been critiqued before, and I’m planning to write this up. Not sure that the xDAI POSDAO ERC677 token example actually applies here, as it is strictly a validator control mechanism, not related to the DAO-like contributor or governance operations. A MakerDAO configuration with the MKR token driving the DAI mechanics, has been around for over four years. I’ve been working on a multi-factor governance model, which takes into account at the vote level the values of Participation, Expertise, and Contribution [PEC] factors. Prior to further modeling, decided not to fast-forward mapping on-chain value store to a token representation. However, C can be readily implemented with a fungible token. Both P and E may need anti-Sybil or even higher personhood guarantees, and E is not transferable, and will not need some of the token primitives. Planning to publish more details, and a visualization, even next week. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5946428571428575
                }
            ]
        }
    ],
    "group_index": "622"
}