{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/new-to-the-gitcoin-forum-intro-thread/10040",
            "title": "\\xf0\\x9f\\x91\\xb6\\xf0\\x9f\\x8f\\xbb New to the Gitcoin Forum? Intro Thread ",
            "index": 10040,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#1",
                    "likes": "1",
                    "time": "11/03/2022-16:34:29",
                    "content": " Say Hello if you’re new to the DAO! Welcome to Gitcoin! This forum is an important layer of our governance process and dynamic. It’s here that we share and shape ideas born in calls/dms/contributors’ brains, with our peers, community and ecosystem. It’s here that we discuss, validate or amend them before they move on to the next stages and become part of Workstream Roadmaps, or crystalise into ratifications via Snapshot and Tally by DAO stewards. Trust levels in Discourse  Introduce yourself Who are you and what are you passionate about in regards to Public Goods Funding, DAOs, and Open Source? How did you find your way to Gitcoin? Feel free to share anything else you’d like to add about yourself here. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.066919191919192
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/0xRachael",
                    "index": "#2",
                    "likes": "4",
                    "time": "11/03/2022-17:27:31",
                    "content": "I’m Rachael! Found my way to Gitcoin after getting interested in web3 last year. Met @ceresstation, Linh, and @Kyle - and definitely got excited about the passion everyone had. I’m super interested in the idea of providing great experiences - specifically around people-y experiences. So from recruiting, to onboarding, to retention - I want people to feel excited about whatever may be next. Perhaps great experiences in web3 is a public good?? Excited to jump into the forum more  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.699404761904761
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Gilly",
                    "index": "#3",
                    "likes": "1",
                    "time": "17/03/2022-02:41:16",
                    "content": "Hey there my name is Mike. I learned about Gitcoin last year after starting my research journey through web3. I’m a hardcore lurker online but I feel its time to make my presence known. I am really interested in DAO’s, crypto, NFT’s and researching web3. I am currently trying to find a way to contribute and be a part of a team. Hopefully in due time I will evolve from casual lurker to social buttery. One post a time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7559523809523805
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/0xRachael",
                    "index": "#4",
                    "likes": "1",
                    "time": "17/03/2022-14:59:13",
                    "content": "Welcome, Mike!  I definitely relate to being a lurker. But, like you said, just takes one post at a time. Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#5",
                    "likes": "2",
                    "time": "23/03/2022-15:53:26",
                    "content": "Hey, Jodi here. I spent the last 3~ years following the web3 space, and met @owocki and @Pop at DevCon 5 in Osaka. I joined Gitcoin last month after 10+ years in local government, economic development, and start-ups orgs. What attracted me to Gitcoin is it’s democratically-based experimentation around public goods funding and flat organizational structure. I’m excited about what we’re doing here, and believe that if we move quickly and with focus, we will create a truly impactful model for digital and IRL community organization and service. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.356060606060606
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/sandy_gitcoinDAO",
                    "index": "#6",
                    "likes": "1",
                    "time": "12/05/2022-20:04:23",
                    "content": "I’m Sandy! I’m happy to share that I joined Gitcoin last month. Loie helped me see that there’s a space for all things people-y and I’ve been excited to join web3 ever since. I come from a background in HR/DEI/advocacy. My goal is to support contributors with their professional journey at Gitcoin and help answer any questions from benefits, development, etc.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.59375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/loietaylor",
                    "index": "#7",
                    "likes": "1",
                    "time": "21/05/2022-16:07:19",
                    "content": "Welcome Sandy! And I’d love to hear from @safder , since you two joined at about the same time and really made this People Ops thing a team!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#8",
                    "likes": "3",
                    "time": "23/05/2022-18:11:21",
                    "content": "Hey everyone, and thanks for the reminder to intro myself here Loie! I’m Saf! I’ve also been at Gitcoin DAO for about a month now, initially hired to be “hiring coordinator”, but that’s sort of shifting to becoming an “anti-hiring coordinator” after the change in markets during my time here haha. I have a background in mechanical engineering and career development at a university, and have done people-y things for various organizations, including other DAOs. I’m very excited about the regen web3 space - it’s basically what makes me get up in the morning - and I’m excited to help grow the space by building community-centric hiring processes and structures for Gitcoin DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#9",
                    "likes": "3",
                    "time": "13/08/2022-10:55:10",
                    "content": "Hi everyone! My name is Shawn and I am really excited to be joining Gitcoin DAO Ops, working with Governance.  As a tradbiz refugee and reformed capitalist, I am passionate about finding new paths for business, people, and communities to grow together equitably. I found my way to Gitcoin as I worked with Mitz over at Index Coop and she mentioned I should look into Gitcoin given I was doing a ton of Governance & people work at Index.  Turns out, I already have a lot of friends here  I find part of the magic of web3 is the forkability of opensource processes & technology.  Anything we can do to determine which problems need to be solved, channel resources into solving those problems, and make the solutions easy for others to reapply - is worth our energy.  I think the DAO experiment can change the world, and I am here to nudge it that direction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.412247474747474
                }
            ]
        }
    ],
    "group_index": "9"
}