{
    "poll_list": [
        {
            "id": "0xb1543058fb6543c32dbea36fb596dbe4fd7a136189d44c8b60c8e7616781e053",
            "title": "[Proposal] Fund FDD Season 14 Budget Request",
            "discussion": "https://gov.gitcoin.co/t/proposal-fdd-season-14-budget-request/1065",
            "body": "This is an AMENDED renewal proposal for the Fraud Detection & Defense workstream requesting budgetary funds for Season 14 (1 May 2022 through 31 July 2022). [Last amendment made Thursday, May 26th. Discussion period ends and proposal will be moved to snapshot on Tuesday, May 31st.\n\nFDD is looking for the community to decide on funding and at what level. This proposal is a request to fund Season 14 (S14) and replenish its reserves for S15 (60 days calculated as ⅔ the approved Season 14 budget. Amounts listed below on each option are the season 14 budget request without reserves).\n\n\nHOW VOTING WILL WORK\n\nSelect the option that you think FDD should be funded based on the initiatives below. A vote for option 1 would count towards each lower funding option until one is selected.\n\nFor example\n\noption 1 has 1 million votes (Not enough)\noption 2 has 1 million votes (Counted as 2 million votes including option 1 - still not enough)\noption 3 has 1.5 million votes (Counted as 3.5 million votes including 1 & 2 - This passes)\noption 4 has 2.5 million votes (Enough to pass on its own, but the higher level is passed)\n\n\nVOTING OPTIONS\n\nOPTION 1 - Fund FDD request $390,000 season 14 budget\n(40% reduction from original request)\n\nOPTION 2 - Fund FDD $330,000 and signal they should not perform a discovery 4 of a sybil detection / Passport DAO\n(49% reduction from original request)\n\nOPTION 3 - Fund FDD $200,000 to continue round operations but not support innovation or round to round improvements.\n(69% reduction from Season 13)\n\nOPTION 4 - Do Not Fund FDD\n(100% reduction from Season 13)\n\nOPTION 5 - Abstain\n\n\nTLDR\n\nWe have participated in governance and lowered our budget request to provide a lean FDD working to make grants 2.0 transition a success. The full funding request includes the original 40% reduction requested. We encourage stewards to fully fund FDD with option 1.\n\nOption 1 & 2 are fundamental differences on the timing or need to launch a sybil detection DAO that focuses on Passport adoption and utility. Ideally, GitcoinDAO would own 20-50% stake and have a 10% aqueduct commitment.\n\nOption 3 is a vote against the current team or roadmap for FDD. It is a signal that you do not believe funds are or will be used effectively, but know that GR14 requires some level of fraud detection & defense work.\n\nOption 4 is a vote against FDD existing.\n\n\nHigh Level Budget Breakdown\n\nSeason 14 Budget Total = $x*\n\nPLUS Season 15 Reserves = (x*1.6777)\n\nTotal Needed = $x + (x*1.6777)\n\nMINUS Current Reserves = TBD* (110k GTC or approximately $254k)\n\nTotal GTC Amount requested at this time = TBD*\n\n*The total will be adjusted based on the current market value at the time this proposal is moved to Tally. The vote will be to send $USD value in GTC at the current spot price when moved to Tally or the 20 day moving average (whichever is lower).",
            "choices": [
                "OPTION 1 - $390,000",
                "OPTION 2 - $330,000",
                "OPTION 3 - $200,000",
                "OPTION 4 - DO NOT FUND",
                "OPTION 5 - ABSTAIN"
            ],
            "scores": [
                281074.5773814505,
                8531668.65987167,
                291045.76862603787,
                2066.879200722416,
                173707.61299673485
            ],
            "start": 1654041450,
            "end": 1654534800,
            "snapshot": "14881575",
            "state": "closed",
            "author": "0x01Cf9fD2efa5Fdf178bd635c3E2adF25B2052712",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "id": "0x332237cf15443ea727e914431b9d916aa2b72d421ce1fa2f8165cc7774dbde0e",
            "title": "Feedback for FDD Budget Proposal",
            "discussion": "https://docs.google.com/document/d/1vSq8ILhQC6jQD2McF0V9yh5RQDf5BxtjcuIK3u03PSg/edit?usp=sharing",
            "body": "This is a test to get some feedback for our budget proposal. Rather than simply request a budget with a slight reduction, we wanted to get feedback from the community on each outcome FDD plans to work on during Season 14. \n\nTHIS VOTE WILL BE USED TO HELP US CONSTRUCT A FINAL BUDGET REQUEST FOR SEASON 14. \n\nFDD has Outcomes which are nested under the following 3 priorities. \n\nSybil Defense (SD) - Protect the legitimacy of funding round outcomes\n\nGrants Intelligence Agency - Provide credible neutrality to grant eligibility moderation\n\nEvolution - Operate the workstream and improve our processes, knowledge and insights.\n\nHere is how the outcomes fit into a 2x3 grid showing operational vs innovation along with the future potential for each outcome. \n\n![FDD Budget • Gitcoin Holdings - Google Chrome 2022-05-12 at 2.06.01 PM.jpeg](ipfs://QmUCTjKfF1PRqrbuZVFdyjZshiP1S768QGCqPsnL4d6sAJ)\n\nHere is our current plan for how budget will be spread amongst the outcomes. (Notice that storytellers, investigations, and catalyst have been removed)\n\n\n![FDD Season 14 Budget - Google Sheets - Google Chrome 2022-05-13 at 9.14.14 AM (1).jpeg](ipfs://QmbhC4E2iuJejDvPZ14xuAWDoJ3BfypVXtmp4q3F1PfBYQ)\n\nNow we want you to vote to indicate which of these outcomes you think FDD should be working towards. A lot of feedback we received was because of fundamental differences in the direction we should be taking. \n\nHere is every outcome, it's deliverables, and how not funding it would look. \n\n",
            "choices": [
                "SD - SAD DevOps",
                "SD - Community Model",
                "SD - Human Evaluations",
                "SD - Sybil Detection DAO",
                "GIA - Ethelo Development",
                "GIA - Round Management",
                "GIA - Permissionless Reviews",
                "EVO - xOS",
                "EVO - Mandate Delivery",
                "EVO - Operations",
                "EVO - Data Science",
                "Round Operations ONLY",
                "50/50 operations/innovation",
                "Build protocols & software",
                "Be a pluralist service provider",
                "Intersubjective Consensus",
                "Decentralize inputs to grants 2"
            ],
            "scores": [
                715038.4135581641,
                2363300.5055472744,
                1321998.8281201904,
                252321.8078779572,
                248263.2801621111,
                2958128.408900412,
                259601.40640299412,
                711353.4602619963,
                2347719.9300357094,
                2971107.216365397,
                867972.9018316956,
                6645.576833738355,
                247475.9241436865,
                246879.6719823939,
                257540.95590725887,
                246328.1520380274,
                708012.0744665423
            ],
            "start": 1652467105,
            "end": 1652810400,
            "snapshot": "14768766",
            "state": "closed",
            "author": "0x01Cf9fD2efa5Fdf178bd635c3E2adF25B2052712",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "Gitcoin FDD workstream S14 funding request ratific…",
            "date": "Proposed on: Jun 9th, 2022",
            "yes_votes": "3.13M",
            "no_votes": "0"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-fdd-season-14-budget-request/10658",
            "title": "[Proposal] FDD Season 14 Budget Request ",
            "index": 10658,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "contributors",
                "stewards",
                "FDD"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "14",
                    "time": "20/05/2022-18:02:20",
                    "content": " Workstream Mandate: Defend Gitcoin (Grants, DAO, & future products) from threats to its legitimacy, credible neutrality, and sustainability. [Mirror Article: GitcoinDAO’s Trust Function]  Season 14 Budget Proposal This is an AMENDED renewal proposal for the Fraud Detection & Defense workstream requesting budgetary funds for Season 14 (1 May 2022 through 31 July 2022). [Last amendment made Thursday, May 26th. Discussion period ends and proposal will be moved to snapshot on Tuesday, May 31st. FDD is looking for the community to decide on funding and at what level. This proposal is a request to fund Season 14 (S14) and replenish its reserves for S15 (60 days calculated as ⅔ the approved Season 14 budget. Amounts listed below on each option are the season 14 budget request without reserves).  How voting will work on snapshot Select the option that you think FDD should be funded based on the initiatives below. A vote for option 1 would count towards each lower funding option until one is selected. For example  option 1 has 1 million votes (Not enough) option 2 has 1 million votes (Counted as 2 million votes including option 1 - still not enough) option 3 has 1.5 million votes (Counted as 3.5 million votes including 1 & 2 - This passes) option 4 has 2.5 million votes (Enough to pass on its own, but the higher level is passed)   VOTING OPTIONS  OPTION 1 - Fund FDD request $390,000 season 14 budget (40% reduction from original request)  OPTION 2 - Fund FDD $330,000 and signal they should not perform a discovery of a sybil detection / Passport DAO (49% reduction from original request)  OPTION 3 - Fund FDD $200,000 to continue round operations but not support innovation or round to round improvements. (69% reduction from Season 13)  OPTION 4 - Do Not Fund FDD (100% reduction from Season 13)  OPTION 5 - Abstain  TLDR We have participated in governance and lowered our budget request to provide a lean FDD working to make grants 2.0 transition a success. The full funding request includes the original 40% reduction requested. We encourage stewards to fully fund FDD with option 1. Option 1 & 2 are fundamental differences on the timing or need to launch a sybil detection DAO that focuses on Passport adoption and utility. Ideally, GitcoinDAO would own 20-50% stake and have a 10% aqueduct commitment. Option 3 is a vote against the current team or roadmap for FDD. It is a signal that you do not believe funds are or will be used effectively, but know that GR14 requires some level of fraud detection & defense work. Option 4 is a vote against FDD existing. Here is an updated visual of the different squads and where they sit in terms of operational needs vs innovation:  FDD Budget • Gitcoin Holdings - Google Chrome 2022-05-26 at 10.45.26 AM2472×1281 244 KB  Here is each squad with the outcomes they will enable for FDD & Gitcoin:     Outcome Value to Gitcoin      Passport Protocol DAOProduction support of Passport & coordination with GPC to drive adoption and utility.  - Build a digital public infrastructure for accelerating adoption of Gitcoin Passport- Idea validated via BrightID participation, MetaPod Pitch Competition, and Hop Protocol    Community IntelligenceData analysis, model prototyping & validation, and sybil strategy center.  - Data analysis to find the best models for passport sybil defense- Open source feature engineering pipeline turns behavior patterns into passport stamps- Prototyping new features and models before pushing them into production- Identifies new opportunities (low hanging fruit} for additional data-driven sybil detection strategies which leverage the data already collected- Fulfills opportunities & requests for further collection and organizing of data- Executes post round data analysis for grants round governance brief    Passport TruthseekersPure research finding insights & sybil stories. - Identifies continually evolving sybil behavior to be codified in the detection system- Statistically validates the algorithm and directly squelching sybil users- Continually trains the ml algorithm to think like the community, not the engineers- Creates patterns to be engineered for Passport to allow for specific GitcoinDAO uses- Provides model for grant review stamps to be sent to user passports    Data OperationsData center which handles access control, ETL, and process automation.  - Runs the end-to-end process used in production to detect sybil accounts- Builds containers and automations to make processes consistent and easy to learn- Supports other FDD dev ops needs & liason with Gitcoin DevOps team    Grants Intelligence AgencyExecutes the critical functions associated with grant eligibility reviews, disputes, and appeals. - Reviews and approve/deny new grant applications in under 48 hours- Ensures all disputes and appeals are heard and executed- In depth review of suspect grants to ensure minimal improper matching allocation- Ensure a proper functioning integration from Grants 1.0 backend to Ethelo- Provide data to be used in evaluating reviewer decision making issues at scale    FDD Operating SystemCore operations & communications supporting FDD squads and contributors. - Funds and directs the roles requested by DAOops- DAO facing collaboration point to help communicate FDD role in the DAO- Building on last season deep dive understanding of Is FDD successful in it’s mandate?- Building dashboards for stewards & FDD with FDD round over round metrics- Facilitates and synthesizes bottoms-up and top-down input to draft FDD outcomes- Removes key person issues from the workstream- Ensures that contributors are able to focus on the primary problems to be solved- Creates accountability for outcome owners via strategic cadence and collaborative decision making processes which are seen as legitimate     High Level Budget Breakdown Season 14 Budget Total = $x* PLUS Season 15 Reserves = (x*1.6777) Total Needed = $x + (x*1.6777) MINUS Current Reserves = TBD* (110k GTC or approximately $254k) Total GTC Amount requested at this time = TBD* *The total will be adjusted based on the current market value at the time this proposal is moved to Snapshot and to Tally. The vote will be to send $USD value in GTC at the current spot price when moved to Tally or the 20 day moving average (whichever is lower). This chart shows Season 13 budgets next to 2 numbers for Season 14 including the original requested amount and the final amended request.  S13 &amp; 14 compare - Google Sheets - Google Chrome 2022-05-26 at 11.07.17 AM1776×1064 92.1 KB   Season 13 Recap FDD Season 13 Report Card  Key highlights & learnings: Sybil Defenders  GitcoinDAO now runs the full anti-sybil operational process (previously done by Blockscience) Doubled the number of human evaluations done at ⅓ of the cost Classified sybil behaviors & ran impact analysis Performed trust bonus analysis and provided recommendations  Won Metapod pitch competition and validated users for Sybil Detection DAO Reviewed sybil assumptions and began work on mechanism design & simulations  Grants Intelligence Agency  Hit all primary round OKRs without getting data integration on time from Holdings Assisted PGF ops in tag requests for eco & cause rounds Began creation of “trusted seed” of reviewers Designed curation incentivization structure for any community to have community curation Grants Curation NLP model that can replicate the GIA team’s decisions with 69% accuracy Reviewed and analyzed all current eligibility policy A full end to end process mapping of the grant review process was created  Evolution  First season of source council was a success and even implemented accountability measures Developed FDD decision making process to encourage autonomy FDD contributor experience survey implemented Designed PEC model for bottoms up governance issuance within workstreams Created a data science pipeline for requests from other workstreams Created a data repository for public gitcoin datasets Designed architecture for GitcoinDAO data storage layer Made improvements/refactors/optimizations/bug fixes in SAD codebase   Season 14 Goals These seasonal objectives and key results highlight our focus within Season 14. These are TBD based on the budget passing.  Lean GR14 Services Objective: Provide lean Grants 1.0 sybil defense & grant eligibility services for GR14  KR1: Review and approve new grant applications in under 48 hours KR2: Lower appeal processing time to average under 1 week KR3: Lower the cost per grant review by 50% while maintaining quality   Protocol Centric Fraud Defense Objective: Build a decentralization & protocol-centric fraud defense strategy for Grants 2.0  KR1: Identify 5 sybil stories for use by the Passport product team KR2: Identify a clear trust bonus scoring algorithm improvement for dPoPP KR3: Define at least 3 classes of stamp types for use in Passport   Become a Pluralist Service Provider Objective: Build digital public infrastructure for grants 2.0 modular components  KR1: Model a non-sybil use case for stamps within GitcoinDAO KR2: Provide 3 use cases examples for stamps KR3: Conduct discovery on Sybil Detection DAO as driver of Passport adoption   Current Holdings* This amount represents the total holdings of FDD at the end of Season 13.* FDD Primary Multisig  GTC = 71,115 USDC = 87,585 ETH = 17.18 DAI = 6,000 TOTAL  FDD Ops Multisig  GTC = 25,340 USDC = 15,616 ETH = 0.375  FDD Payments  GTC = 0 USDC = 0 ETH = .3 DAI = 0  *The total reserves on hand will be adjusted based on the current market value at the time this proposal is moved to Snapshot and to Tally using either the current spot price when moved to Tally or the 20 day moving average (whichever is lower).  Team Updates Source Council (Core contributors) - 9 FDD Roles  Collaboration [DAOops Required] Talent [DAOops Required] Accounting [DAOops Required] Storyteller [DAOops Required] WS Lead CSDO 1,2,3  Full (Trusted) Contributors  Multisig Keyholders Subject Matter Experts FTE PTE  Human Intelligence Task(HIT) Roles  Grant reviewers Human Evaluators  ",
                    "links": [
                        "https://gov.gitcoin.co/t/s14-proposal-fdd-season-14-budget-request/10448/60",
                        "https://docs.google.com/document/u/0/d/1xLFfWCrJ-WA5aZvOU2l7l0gLJ4a4vpwKtjFexPuxP-4/edit",
                        "https://docs.google.com/presentation/d/1nF1k8R5MtvSgJ3oE38OXuCskcEHOj64H/",
                        "https://gov.gitcoin.co/t/rethinking-fdd-defending-against-fraud-optimizing-capital-allocation/11090",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-19-2022/10737",
                        "https://gov.gitcoin.co/t/cancelled-superceded-s14-proposal-fdd-season-14-budget-request/10448",
                        "https://gov.gitcoin.co/t/s14-proposal-fdd-season-14-budget-request/10448/56",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-18-2022/10660"
                    ],
                    "GPT-summary": "The post is a proposal for funding the Fraud Detection & Defense workstream for Season 14. The proposal explains the workstream's mandate and provides details on the budget request, voting options, and the different squads within the workstream. The post also includes a recap of Season 13 and the goals for Season 14. The post is open for feedback and questions, and it can be audited and reviewed by third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Community and engagement",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.318653516295026
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#2",
                    "likes": "2",
                    "time": "21/05/2022-14:44:05",
                    "content": "Thanks for sharing! Some of my thoughts:  I don’t think the Sybil Detection DAO or software implementation of a permissionless reputation protocol are the best use of funds for Gitcoin DAO especially during this market environment Is there a possibility of a very slimmed down version of Option 4?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.294444444444444
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#3",
                    "likes": "3",
                    "time": "21/05/2022-14:49:03",
                    "content": "Thank you for all the hard work that you have put into this Joe and thx to all the contributors that helped along. I believe that the structure of the FDDs Budget Proposal should be a model that other workstreams could//should follow. It’s a clear win-win scenario for the DAO and also the respective workstream. The stewards understand what they are funding and the workstream understands the picture that the stewards want to paint. This will only lead to evolution. As a DAO contributor and and FDD SC member I know how important the FDDs work is for the grants program and the DAO. I wish others would realize that and the fact that the FDD wanted to evolve to better solve some of the emergent and also unsolved recurring issues around sybil protection, credible neutrality and legitimacy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.614583333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/05/2022-14:50:40",
                    "content": "Hello Linda, I believe that Option 4 is the FDDs budget already slimmed down to the bare minimum. If you are refering to Option 1, sorry for the correction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.990740740740741
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#5",
                    "likes": "2",
                    "time": "23/05/2022-12:24:17",
                    "content": "I’m not sure I’m understanding. I saw Kyle’s request for a 40% reduction. The option 4 here is a 63% reduction from last season. You and I have not had a conversation about providing an even slimmer budget before this, nor have I had one with anyone else. What have we not communicated in this process that you would like to see? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#6",
                    "likes": "1",
                    "time": "23/05/2022-12:39:23",
                    "content": "I’m not saying there hasn’t been proper communication in the process, I’m only trying to understand the possibility of a slimmer Option 4 but @ZER8 said there was not so that answered my question. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#7",
                    "likes": "2",
                    "time": "23/05/2022-17:09:37",
                    "content": "From an FDD standpoint, I’d say there isn’t a smaller amount we would be comfortable with as anything further would not be a unit serving a mandate, but Gitcoin could survive a round or two by hiring for the execution of a complicated task. (Most likely FDD contributors, but we would need to know exactly which tasks were requested.)  Option 5 = Less than option 4 - Hired guns Gitcoin would survive (probably), but there would not be a workstream serving the mandate. The services could be hired from FDD contributors, but  Vote for option 5 if this is your choice. Advantages  Very low cost Ability to replace autonomous workstream with service provider (No scope creep)  Disadvantages  Lose insights and knowledge gained in the last year Fall behind the red team Potential for large losses for Gitcoin community - Probably not this round, but the following because the work isn’t being done to keep up with the evolving attacks Laying off people who have done good work for gitcoin   Option 4 - FDD Executes the round at bare minum Advantage  Keep FDD an autonomous unit in GitcoinDAO still working out how to best fulfill it’s mandate and serve Gitcoin’s mission Maintain knowledge and insights built over the last year Lean grants reviews  Disadvantage  Lose ground gained against red team Insufficient funding to continue developing new models to serve grants 2.0 (Some will be done, but not sure how much can be done with the limited time and resources) Laying off people who have done good work for gitcoin Signal opportunity to attackers (Like announcing there won’t be a security guard on saturday night at a retail store)   Option 3 - Continue progress on classifying attack classes and mitigation techniques Advantage  Build on previous learning - Here is an example from new technique found in the last few weeks Develop new techniques in line with dPoPP & Project history grants 2.0 future Gain data on grants reviews to be able to scale Gitcoin rounds on grants 2.0 Understands that the human evaluations are the ethical underpinning that removes bias from our algorithms. We want the algo to “think” like the community, not like the engineers that built it. Our humans in the loop process is cutting edge ethical AI and the decision to defund is to put profit ahead of purpose.  Disadvantage  Spend more (Less than any other workstream - Is Sybil Defense and Grant Eligibility less important than every other outcome the DAO works to achieve?)   Option 2 - Continue building on work to decentralize grant eligibility reviews for all future communities using grants 2.0 Advantage  In line with intended outcome of helping communities to better allocate their resources Shows an ethical difference between content moderation approaches in web 3 from web 2. Think of sybil defense as user moderation and grant eligibililty as content moderation. Did we learn anything about how not to do moderation from Twitter and Facebook? Potential reputation builder and proof-of-project history compliment Upside potential if generalized  Disadvantage  Costs $35k Could fail   Option 1 - Allow FDD to set a precedent for how to spin out efforts when the positive externalities to the ecosystem align with GitcoinDAO’s mission, but exceed the mandate of the workstream. Advantage  Potentially create large upside for GitcoinDAO in ownership of the public infrastructure. Show how to build and launch public goods supporting protocols without VC funding Huge Aqueduct potential Why not build mutual grants with something we built and know works! Validation = See hop protocol sybil contest Creates a model for how to split off projects with upside when an autonomous workstream’s scope creeps, but the scope creep is in line with the overall mission of GitcoinDAO, but outside of it’s critical mandate.  Disadvantage  Costs $60k Could fail  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.354306047487865
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#8",
                    "likes": "1",
                    "time": "23/05/2022-19:47:47",
                    "content": "Over the last couple years the anti-fraud personnel and efforts of Gitcoin grew enough that it became a dedicated unique workstream of the Gitcoin Dao.  In other words…the FDD was born. The early years were full of excitement and potential, but this was not a permanent state.  Like a classic confused teenager, the FDD had to experiment with identity.  Finding/creating its identity in the rapidly-shifting environment of web3.  During all this the FDD has protected its family, even as it brainstormed roadmaps to self-sufficiency and revenue-generation.  The FDD was always mission-first.  But we must now reconsider what that mission is. Some believe the FDD scope has drifted away from the core mission.  Before approving a budget they want assurances the FDD will continue to honour Gitcoin Dao priorities.  I hear these valid concerns.  I think most folks recognize the need for balance between mission & innovation. The FDD has always been here to serve Gitcoin and this should continue. The FDD should focus on what the GitcoinDAO finds most important (every workstream should).  The FDD is finding its dao IKIGAI just like an individual.  Over the past 3-4 seasons I watched communication & coordination between workstreams improve dramatically.  This helped everyone understand the big picture.  A picture that now suggests low priorities should be paused/cancelled due to macro state. The FDD is keen to tightly align with the Gitcoin Dao.  If we came out of alignment it was completely unintentional.  I am lifted by the idea the FDD can serve the dao even better!  With the community’s input the FDD can identify and trim the fat.  it is great that people care enough to speak up, and help the FDD understand and align with the Dao.  We in the FDD are eager to boost Gitcoin Dao to the next level, however that looks. There is no group better positioned to achieve greater anti-fraud results at Gitcoin. There is no group with the solid history of the FDD and the technical partnerships needed to effectively protect Gitcoin. There is no other group ready/interested to defend Gitcoin in the future.   Gitcoin can be among the leading web3 anti-sybil/anti-fraud experts.  This will happen via the FDD. Some of the un-alignment accusations came as a surprise and the FDD should have a season to respond.  If you think the scope of FDD drifted please give us the chance to demonstrate how aligned, lean and laser-focused we can be.  Help us understand the dao-wide priorities so we can help the dao.  Try to guide this crusty teenager before abandoning them.  The results will be incredible. Conclusion: My preference is for option 2.  I think the extreme reductions of option 4 are unprecedented and would sacrifice some of the significant innovations the FDD has been developing, namely a new decentralized review model (called Permissionless Reviewing) and the in-training Machine Learning system which is becoming more and more capable.  Option 3 features even larger reductions than were first requested by Kyle. Lastly, I want to recognize our unity.  It is great to see so many dedicated and loyal folks committed to the long term success of Gitcoin.  We are all on the same team here.  Go team! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.059405438311688
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#9",
                    "likes": "5",
                    "time": "24/05/2022-04:00:57",
                    "content": "Thanks @DisruptionJoe and team for mapping this out. Dare I say, for the first time in a while I can actually understand the different funding options and the outcomes FDD would deliver with each. Huge kudos to the team for mapping out options in this way. I would really love to see more Workstreams approach this in S15. I am supportive of Option 4 and on the fence on Option 3. The work to review grants, operate the rounds and offer an analysis after the round is valuable. I am still worried that some of the direction of FDD (model build out, approach to human evaluations and even the community model) may not be aligned long term with where I think FDD could be headed (this is just my opinion). So I will likely just stick to voting for option 4 for this season. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#11",
                    "likes": "1",
                    "time": "24/05/2022-15:15:14",
                    "content": "Thank you for the continued collaboration on moving this forward and taking all the steward comments into account and really taking the steward feedback on board. It’s been one of my highlights of this season to really see us all collaborating to find a middle ground for how we move forward.     DisruptionJoe:  OPTION 3 - Fund FDD $369,665 (38% reduction from Season 13) FDD should perform data analysis and continue iterating on models for making round to round improvements. (Includes 7 Full Time Core Contributors) OPTION 4 - Fund FDD $222,975 (63% reduction from Season 13) FDD should only execute services for GR14 and not be evaluating opportunities for improvement or needs to keep up with the “red team” in future rounds. We would obviously try to keep up, but are not confident the forward looking work could be done. (Includes 5 Full Time Core Contributors)   I am wondering if there is a combination between these two? I would opt for Option 4 but I am forever wanting innovation vs stagnation so what would be a balance here where we continue iterating models (maybe it’s ONE per season?) for improvement but without a 140k price tag? It is not an easy or pleasant task scrutinizing to this level but perhaps a better or more clear definition of what \" models for making round to round improvements\" may mean or entail? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.527412280701754
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#12",
                    "likes": "5",
                    "time": "24/05/2022-17:02:50",
                    "content": "Thanks for the meaningful and direct feedback.     Pop:  perhaps a better or more clear definition of what \" models for making round to round improvements \" may mean or entail?   Let’s say you are a sybil attacker. You make a bunch of accounts Simona1, Simona2, Simona3… This is a clear signal, but we wouldn’t see the usernames being closely related without  Noticing the behavior Turning the insight into a data problem - A model Creating a process for continually evaluating and updating the model  Here is the example of how we recently created another model for fighting off your attack: Fighting Simple Sybils: Levenshtein Distance - HackMD Now we know how to detect it, but we need to either manual squelch those accounts or algorithmically do it. Algorithmic scales, manual does not. To make this “feature” a part of the algorithmic detection we must go a step further. We can turn the detection of the behavior into a feature for the ml model. This is the overall algorithm that combines many features to determine if an account is sybil. But what happens when the legit user “Simona69” gets caught in the heuristic? This is why we have humans in the loop. What is Human in the Loop Machine Learning: Why & How Used in AI? | by Vikram Singh Bisen | VSINGHBISEN | Medium The humans will notice that Simona69 is not like the 68 before it. This info will then train the algo that the high quality signal DOES have exceptions. The more humans that we have evaluate, the more opportunities for us to spot the algorithm being unfair to classes of users. The community model is finding new features and models to incorporate into what you might call a “meta-model” or ensemble which is best capable of accurately identifying sybil, and more importantly - NOT SYBIL accounts. We have discussed moving the data science initiative to DAOops and maybe this is the time to do that. It helps FDD, but could be more beneficial to the DAO as a whole. The interesting part of connecting the group to FDD is that spotting sybil behavior is a lot like moving your Scrabble pieces around to see if you have a word. Sometimes we know exactly what data to request to build a feature, but spotting new behaviors is a mix of active analysis and serendipity. We could lower the overall ask to $115k for the round to round improvements and ethical guardrails to be in place by transfering the data science budget to come from DAOops. ",
                    "links": [
                        "https://medium.com/vsinghbisen/what-is-human-in-the-loop-machine-learning-why-how-used-in-ai-60c7b44eb2c0",
                        "https://gov.gitcoin.co/t/web3-sybil-resistance-tool-competitive-landscape/12461/5"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.775255937755937
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#13",
                    "likes": "0",
                    "time": "24/05/2022-18:50:48",
                    "content": "    DisruptionJoe:  We have discussed moving the data science initiative to DAOops and maybe this is the time to do that. It helps FDD, but could be more beneficial to the DAO as a whole.   This is really interesting actually and a trajectory I am seeing in other DAOs also - I wonder if there is enough understanding of the possibilities of DS for the DAO that would warrant a “DS as a service” function to be accessed by workstreams  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.895833333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#14",
                    "likes": "2",
                    "time": "24/05/2022-20:57:29",
                    "content": "Thanks for this updated proposal Joe & team. I’ll just copy what simona wrote here because I wholeheartedly agree:     Pop:  Thank you for the continued collaboration on moving this forward and taking all the steward comments into account and really taking the steward feedback on board. It’s been one of my highlights of this season to really see us all collaborating to find a middle ground for how we move forward.   A quick question on this:     DisruptionJoe:  Source Council (Core contributors) - 9 FDD Roles  Collaboration [DAOops Required] Talent [DAOops Required] Accounting [DAOops Required] Storyteller [DAOops Required]    … are you saying here that you would be counting on DAOops to take over these roles? Or am I misinterpreting this? Because this is not really in our current scope.     DisruptionJoe:  We have discussed moving the data science initiative to DAOops and maybe this is the time to do that.   This is also not something we could take on at this time I fear, data analysis that is crucial to the DAO at the moment is FDD related, so I would propose for it to remain with FDD. On my vote, I am unsure how I will vote at this moment and looking forward to more comments from others. I’d definitely vote for innovation, same comments as Simona. Thanks for all your work on this, I know this is a tough process but it’s making our DAO more transparent + resilient and us all better at giving and receiving feedback. Appreciate all you do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.670138888888889
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#15",
                    "likes": "3",
                    "time": "24/05/2022-21:03:05",
                    "content": "    krrisis:  … are you saying here that you would be counting on DAOops to take over these roles? Or am I misinterpreting this? Because this is not really in our current scope.   Nope. Saying that the role exists because DAOops requested us to have someone in that role. It shouldn’t be by storyteller though!     krrisis:  On my vote, I am unsure how I will vote at this moment and looking forward to more comments from others. I’d definitely vote for innovation, same comments as Simona.   Option 3 is focused on improvements, but not necessarily innovation. Options 1 & 2 have innovation. The difference being that they are creating new value or systems rather than continually improving or tweaking the ones we have. Based on your comment, I think you are most aligned with Option 3.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.647727272727273
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#16",
                    "likes": "2",
                    "time": "24/05/2022-21:09:06",
                    "content": "I think this is very insightful for anyone considering options 1 & 2 or looking at FDD as future drivers of dPoPP adoption. [S14 Proposal] FDD Season 14 Budget Request - #50 by danlessa ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party giving positive feedback on proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#17",
                    "likes": "0",
                    "time": "25/05/2022-10:21:37",
                    "content": "Hello, I want to echo other people’s comments and thank you for taking the time to incorporate feedback from the stewards in the budget proposals. Before talking at all about the current options let me re-iterate the feedback I tried to give in the google doc you had DMed me which seems to have evolved to become this proposal. What I would like to see come out of the FDD WG is an algorithmic software solution for evaluation of grants and sybil detection. With minimal human input. I do understand that human input will always be needed at some point but it should be kept at a minimum as it does not scale. For simple manual reviews of grants which is what I understand Option 4 to be I think even Option 4 is very expensive. Manual review and classification of grants is a very simple work that can be accomplished even by someone from Upwork for $10/hr so to say. Instead, and please please correct me as I may be understanding the budget wrong, what I see is: A request of $222,975 for 4.8 months (3 months + 60% reserves) for 5 full time contributors. That translates to a 222975 / 5 / 4.8 → $9290.625 per month for each employee to do “the bare minimum” which is what I understand is manual reviews. This is an insane monthly salary for just manually reviewing grants.  That said what I want to see from FDD is to focus and iterate on delivering a software solution combined with minimal human input. Can you guys pull that off? So far I have not seen the most encouraging results. I see lots of hard to understand jargon and no software yet. I am at the moment not sure what to vote. I would also want to see what other stewards say. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.514583333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#18",
                    "likes": "3",
                    "time": "25/05/2022-15:13:38",
                    "content": " This is a very funny situation. Option 4 doesn’t mean only grant reviewing. On that logic everything that the other workstream do can be outsourced via Upwork? Am I wrong to assume this? I thought this was a DAO or is it a CAO in which we call it a DAO, but it’s just a corporation that’s online 24/7 ? Is that the vision? I don’t think so…     lefterisjp:  Before talking at all about the current options let me re-iterate the feedback I tried to give in the google doc you had DMed me which seems to have evolved to become this proposal. What I would like to see come out of the FDD WG is an algorithmic software solution for evaluation of grants and sybil detection. With minimal human input. I do understand that human input will always be needed at some point but it should be kept at a minimum as it does not scale.   The FDD has multiple algorithmic solutions and the [Reward system] (GIA Rewards OKR Report) ( includes grant reviewers and is only  one of the solutions). The total cost of the grant reviews was exactly 14k last season and we protected millions of dollars of funds(more from an eligibility POV) . Do you think it’s expensive to do manual grant ? reviews?  I don’t think you actually know the issues/challenges we face as the FDD and even more so in the GIA which is in charge of grant reviewing. 14K was the cost of 12.000-15.000 reviews! The FDD does not mean grant reviewing… We could hire people from upwork but that will cost us even more…We will need to train each of them…takes a season or two. We actually pay our reviewers with 10-20$ per hour atm… On another note I really thought we had the ethos of decentralization here, but like reading your comments I kinda see through that “mirage”. Even the way in which we recruited the reviewers was fair and open for everyone. We recruited them chronologically in the order they reached out to us… and we wanted to keep things neutral and fair even within our squads. Reading your comment is like all my work within the FDD for the past three-six months was null and I can’t be happy about that… Why are stewards not even looking at what we are building and just “hating” on us? Is that fair for the contributors here? Is that fair towards me? Who worked 60+ hours a week and 80+ during the round to make sure the grant creators, our donors and our matching funds are protected?(4 real, you can look in our Discord during the round and see what’s up). Associating the FDD with grant reviews nullifies all the hard work done by my peers. If you really care about Gitcoin DAO, the grants program and our community please try to understand what major issues we face …we have entire organizations trying to game the system, we have hundreds of people that are creating fake grants…all while running the round, ensuring sybil protection and trying to solve “unsolved” research problems…     lefterisjp:  Instead, and please please correct me as I may be understanding the budget wrong, what I see is: A request of $222,975 for 4.8 months (3 months + 60% reserves) for 5 full time contributors. That translates to a 222975 / 5 / 4.8 → $9290.625 per month for each employee to do “the bare minimum” which is what I understand is manual reviews. This is an insane monthly salary for just manually reviewing grants.   Those people are not reviewing grants, I am the driver of Round Management, only my squad handles grant reviewing  and as I stated above that costs 10-20k MAX per round. This round we actually want to reduce that number with 50%, which is not fair for our contributors, but we need to reach a balance that satisfies the DAO.     lefterisjp:  I see lots of hard to understand jargon and no software yet.   That’s your truth, but is it the truth?   We can have a call anytime (takes 10 minutes) and I can explain and walk you though the whole process of grant reviewing and why we opted for this system which works amazingly btw  I’m sure that @DisruptionJoe @omnianalytics @Sirlupinwatson @David_Dyor and @vogue20033 can explain more about our collective efforts. PS. I know and I completely agree what the DAO has some BIG issue. Parasitic behaviors are the threat to any organisation… The FDD is not the biggest spender and we work on one of the most complicated and complex set of problems. I don’t believe that by cutting our budget we will do the DAO a favor  If people vote for Option 3 which is less than 400k they will see that we could and probably will continue to save funds(from our donors and matching funds) that are more than that number. Have a good day ser  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.17431640625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#19",
                    "likes": "1",
                    "time": "25/05/2022-15:59:03",
                    "content": "Hi there! In short,     lefterisjp:  I see lots of hard to understand jargon and no software yet.   Sorry about that, we will try to simplify the literature that we are using so you can understand what we are working on and what we are doing/trying to achieve.     lefterisjp:  What I would like to see come out of the FDD WG is an algorithmic software solution for evaluation of grants and sybil detection. With minimal human input. I do understand that human input will always be needed at some point but it should be kept at a minimum as it does not scale   Fundamentally, we have two working algorithm for Sybil Detection classification and one application that can automatically run prediction/analysis from the human-in-the-loop inputs (Human Evaluations) “ASOP” → Anti-Sybil Operationalized Process or “SAD” Fraud-Detection-and-Defense (github.com) Explained by @danlessa in depth here Community Model Software (You will need a username and a passcode to see it, if you are interested let me know) @omnianalytics  Software1076×1038 46.2 KB  ",
                    "links": [
                        "https://medium.com/block-science/operationalizing-the-gitcoindao-anti-sybil-process-7f2595544f44",
                        "https://github.com/Fraud-Detection-and-Defense/CASM",
                        "https://crypto.omnianalytics.io/apps/gitcoin-human-eval/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.598958333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#20",
                    "likes": "2",
                    "time": "25/05/2022-15:59:51",
                    "content": "    ZER8:  The FDD is not the biggest spender   The FDD is the biggest spender. (source: Dune)  2022-05-25_17-54956×413 25.2 KB   Those people are not reviewing grants, I am the driver of Round Management, only my squad handles grant reviewing  and as I stated above that costs 10-20k MAX per round. This round we actually want to reduce that number with 50%, which is not fair for our contributors, but we need to reach a balance that satisfies the DAO.  Please describe in detail to me then what “bare minimum” is and where each part of the requested $222,975 goes where so I can make an informed decision.  You seem to have some kind of misunderstanding that it’s my or other steward’s fault for not understanding your problems or for not diving deep enough into what you are doing. I am getting paid nothing to do this. You are asking money from the DAO and I am asked to say yes or no. If you want a yes you will have to keep it simple, keep it very short and explain where the money goes in enough detail so I can make an informed decision if the ask is too much or not. If you give me to read very long essays I will simply default to saying no. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.9
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#21",
                    "likes": "0",
                    "time": "25/05/2022-16:04:23",
                    "content": "Thank you Armin. The link to Github is broken. I assume because the repository is private? https://github.com/Fraud-Detection-and-Defense/CASM  <— this one.  Software (You will need a username and a passcode to see it, if you are interested let me know)  Yes that would be cool to try it out. Good idea. But first I would like to see code. I am a developer so that’s what I can judge best. ",
                    "links": [
                        "https://crypto.omnianalytics.io/apps/gitcoin-human-eval/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.535714285714286
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#22",
                    "likes": "2",
                    "time": "25/05/2022-16:10:46",
                    "content": "Yes, these are private repo, you can request an access to @omnianalytics (OmniAnalytics#5482) on discord, just send him your GitHub username then he can add you in the group. For the “ASOP” “SAD” @DisruptionJoe can add you in the group as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#23",
                    "likes": "1",
                    "time": "25/05/2022-16:14:43",
                    "content": "I will do that. But why private? Since we are all about opensource software here, I would expect what the DAO  produces to be opensource too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/danlessa",
                    "index": "#25",
                    "likes": "4",
                    "time": "25/05/2022-17:09:51",
                    "content": "The repos contain sensitive information, like the specific features being used for sybil detection and how they’re retrieved. Making those open source will make obvious to the attackers to what look into in order to avoid detection. I don’t see a hard blocker for opening it up, but this should be part of an involved discussion (which FDD is already doing a lot) and the precautionary principle should apply. Also, the SAD codebase is as of now a monolithic piece of software, which makes not trivial to separate the sensitive stuff into separate repos. It’s definitely doable as a part of the FDD evolution to develop into that, and opting for increasing community involvement on Sybil Detection will definitely make that highly desirable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.784166666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#26",
                    "likes": "0",
                    "time": "25/05/2022-17:26:54",
                    "content": "I was talking about this season  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#27",
                    "likes": "2",
                    "time": "25/05/2022-17:29:06",
                    "content": "I understand, I’m actually upset because I’m sure we both have Gitcoins DAO best interest at hearth, Our solutions are not that easy to comprehend because the threats are the same. Maybe next season there could be a Steward Budget call in which all the workstreams present their needs and accomplishments with their previous budget  The simplest way of seeing what we are doing is the diagram:  aH8oYaa09JYI72EvXaCaMPzNE0y-EOj7aHKSl-0F6TR-VpLY4I94J7iIlEl87FkMfD-Tl4hvQZG2CG0BywIVtk9cjwQv1BD97rV6q0VVG1r9ZXaloDqJLT7TVs5KZ-5lGeMPYfF24gNyJnxP1600×1057 246 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.104166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#28",
                    "likes": "5",
                    "time": "25/05/2022-17:54:52",
                    "content": "Here is another way to view the FDD work  Grant Eligibility = Content Moderation  Round execution - Reactive operational execution (All Round Management)  Two reviewers per grant minimum x 1000 new grants Training of new reviewers - facilitating learning and communication during the round Manual documentation of flags/disputes Judgements on disputes Manual documentation of appeals Facilitation of conversations around appeals and judgements   Short Term Improvements - Proactively improving for the next round (Mandate Delivery, Data Science)  Ethelo devops support to bring down per review cost - spend $10k, save $10k per round Gather better data from the approvals process Training Research on Kleros, Celeste and staking ideas (We had this on the roadmap 2 seasons ago, but then the dissolving of dGrants was a surprise and no one included us in the product conversations around building grants 2.0 so we thought we were supposed to maintain course and figure out our own solutions for grants 2.0)   Medium Term Connecting Current Course & Speed to Future State (Trust Builders)  Using review data from ethelo to run simulations of the decentralized protocol for reviewer reputation which would create stamps in Passport. Software - https://github.com/dRewardsSystem/Rewards/commit/6eeaebf3584d21fbbdfcc42e580b870b4e75ea22  Description of software - GIA Rewards OKR Report    Long Term Vision - Future State = An ethically values aligned and sustainable solution (Trust Builders w/ Sybil Detection DAO & Passport)  Passport is used by everyone on earth - They have an option to participate in sybil hunting and grant curation for reward at anytime The system doesn’t BAN sybils and fraudulent grant creators, it instead only allows them to play with each other We avoid the web 2 moderation trap of becoming addicted to lean and inexpensive (but easily corrupted) delegated authority We have built a system that offers communities the potential to choose “community curation” which is a decentralized review process aka a system where they can’t do wrong as opposed to shouldn’t do wrong Stamps from this system are HIGH quality non-sybil signals   Sybil Defense = User Moderation  Round execution - Reactive operational tasks (Mostly SAD squad & Human Evals)  Run ASOP algorithm to identify sybil accounts Push info to gitcoin backend for sanctioning/squelching (114,000 contributions out of 500k total in GR12) Enough human reviews to statistically validate the model is working properly (>1,500 but decreasing returns over 8,000 or around there currently) Enough human reviews to identify new behaviors of attackers (More is better as long as they are putting in genuine human subjective answers and not just using a “rubric”) Enough human reviews to disperse bias across reviewer geographies, cultures, race, sex, etc. (rather than programming the bias of the engineers)   Short Term Improvements - Proactively improving for the next round (Data Science & Community Model)  Identifying the high confidence sybil users (and known not sybil) and analyzing for correlations to Passport stamps Turn Passport stamp correlations into features Continue work identifying sybil behavior classes and new features Analyze human evaluations for inter-reviewer reliability   Medium Term Connecting Current Course & Speed to Future State (Community Model, Mandate Delivery, Data Science)  Remove all cgrants backend data from algos - Use only non-pii publicly available (On chain) inputs Identify long term value patterns that can prove the cost of forgery Continue algorithmic sybil defense for communities that need it early. Although gitcoin is building a very long term valuable solution with passport, someone still needs to read the data AND we need to compare the results of our hypothesis that dPoPP will continue to solve the problem and not be gamed. We should not lose the current working system until we have tried to falsify the new hypothesis with the best data available!   Long Term Vision - Future State = An ethical & values aligned sustainable solution (Community Model, Sybil Detection DAO, Trust Builders)  Sybil Detection DAO decentralized user moderation - NOT by having an ever expanding set of human evaluators, but by using the machine learnin to scale the human subjectivity. Algorithms hold unknown amounts of bias. Keeping humans in the loop is an ethical solution in line with Gitcoin’s values. Dynamic reading and peer predictions A high values rules based system designed and dynamically updated using crowdsourced data analysis (Community model) Large ownership stake in digital public infrastructure for Gitcoin & aqueducts!!!   brian flynn ¬_-_ on Twitter_ a service DAO of sybil hunters _ Twitter - G.. 2022-05-25 at 11.59.19 AM959×1886 167 KB  Note: Evo - oXS & Evo - Ops are both operational functions. The first being our decision making, meetings, calendar updates, internal comms, etc. The latter being the roles with DAO ops has requested each workstream have and our payments. ",
                    "links": [
                        "https://gov.gitcoin.co/t/gia-rewards-okr-report/10438"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.247623794334321
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#29",
                    "likes": "5",
                    "time": "25/05/2022-18:14:53",
                    "content": "Another thing that might help to understand FDD is it is all OUTCOME based organization.  Sybil Defense Are we protecting grants from sybil attacks in a legitimate way that empowers the voices of the many (Its this part about empowering voices of many where @kyle and I disagree on whether community model and human evals should continue. I agree there is a high value system being built, but it is not there yet. By putting in the evaluation work now, we can better attempt to disprove the hypothesis that the new and untested high-value system Passport creates will be ungameable)  This round Next round Making moves in line with a grants 2.0 future Identifying assumptions and risks Reducing system bias Decentralizing the inputs where it solves a specific problem - not for the sake of “decentralization”   Grants Intelligence Agency Does Gitcoin grants provide maximum credible neutrality in the way it moderates content? (aka grant eligibility)  Executing reviews, disputes, appeals for the current round Developing MVPs like work with Ethelo which will scale our reviews Get better data on reviews to scale even further We will still have to curate the main gitcoin rounds with grants 2.0 protocol Should we accept that the content moderation on web 3’s premier value network uses delegated authority a la Twitter/Facebook style unless someone else is willing to invest in a decentralized grant review protocol or should we offer the “can’t do wrong” system out of the box? If our mission is to launch grants 2.0 protocol, you might consider this scope creep. If you think the gitcoin mission is to help communities build and fund their shared needs, it is probably essential.   Evolution Are we consistently re-evaluating and improving  Staying ahead of the “red team” Setting metrics which aren’t subject to Goodhardts law Aligned and focused internally Accountable to each other Have the needed context and info  I would really love very direct feedback from @lthrift (Product Director) @kevin.olsen (VP of eng) @brent (Passport PM) and @nategosselin (Grants PM) to see which specific points are not aligned here. Let’s have a productive conversation! I am also asking for us to be involved in co-creating a future. I don’t understand why FDD was only involved in the grants 2.0 planning in discovery workshops where the product team for grants 2.0 learned what FDD was currently doing, but not in any future planning where we could have put these ideas forward and course corrected together at an earlier point in this process. In fact, I put the proposal forward to CSDO that we needed to get on the ball, hire Sam and The Ready to discuss and share our plans before the budget proposals were due. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.481267217630855
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#30",
                    "likes": "1",
                    "time": "25/05/2022-19:31:09",
                    "content": "Daniel I understand that and it’s a sufficient explanation to me for having it private for now. Try to work towards making it opensource eventually at some point soon, perhaps by separating the sensitive paremeterization out in a private repo. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#31",
                    "likes": "4",
                    "time": "25/05/2022-19:43:32",
                    "content": "Yes. This is the plan with the community model squad. We will figure out the Passport (dPoPP) usage patterns of known sybil accounts to identify features to use in creating the Gitcoin Passport Reader score which would be exported to dapps that don’t want to roll their own algo. Unfortunately, we only have a couple seasons to do this while the Passport is being used on cGrants before the grant registry and round manager parts of the protocol are rolled out. The idea being we can move from private repos using some PII data to open repos using only publicly available on chain data. We know that the community values decentralization, privacy, consent, etc. We have had the same outcomes all along and have adjusted with the new plans for grants 2.0. At this point, the community has been cheering us on as we built the proper tools for the job, but they aren’t all finished. We thought the timeline was to be able to launch by the time grants 2.0 launches. Now, if we are “defunded” it is a catch-22. People can say, “see they didn’t build anything with the money”, but in reality we did a lot of research and iteration to understand the problem space and have started on building in the solution space. All along we were executing the necessary minimum to keep the rounds going. The reason I shared the documents around Trust Builders and the info about the community model and SDD above is because the evidence is tangible. If we stop now, Gitcoin community will provide a grants 2.0 protocol with all its eggs in one basket on an untested sybil defense hypothesis and throw away its investment in other solutions that work today, against the advice of those directly working on the problem, even though those people are agreeing that it is a great hypothesis that we should test! Please discuss with the data scientists and people working on the problem before making a decision. It would also leave a 3/4 built skyscraper behind where people could say, “see, GitcoinDAO couldn’t provide a protocol without single points of failure and they wasted all their money on this thing”… but it might just be that finishing building that skyscraper would have removed the single points of failure. (skyscraper = the sybil work done so far) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.246776773950687
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#32",
                    "likes": "5",
                    "time": "25/05/2022-23:34:22",
                    "content": "Thanks @DisruptionJoe for this amended budget request - I echo others’ thoughts in this being much clearer than previous iterations. I know this has been quite a process for you all and I want to acknowledge that the clarifying work is really appreciated. I also really love the framing of a menu of budget options for stewards to choose from, rather than a binary yes/no decision. I think we should explore this in the context of other workstreams in the future. I am not certain yet which way I will vote - I want to dive into the details a bit more - but at a first glance, I am leaning towards Option 3. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.725595238095238
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#33",
                    "likes": "6",
                    "time": "26/05/2022-20:47:31",
                    "content": "This proposal was updated today to reflect feedback from stewards and conversations with GPC, Passport, and Kyle at the foundation on how to better align and communicate our roadmap. We expect to post to snapshot on Tuesday, 5/31. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/octopus",
                    "index": "#34",
                    "likes": "8",
                    "time": "30/05/2022-16:19:53",
                    "content": "I am reminded of the quote by the great V.I. Arnold, “Mathematics is the part of physics were experiments are cheap.” This is one of those places where the is really about how to define the cost function that we’re trying to optimize. It’s important to think very carefully about all of the tradeoffs  – not only about the budget for today, but also about the long-term values and risks in play. I’ve seen it proposed that the task of investigating sybils be crowdsourced to  $10/hour workers on Upwork. This simply moves the challenges FDD is trying to address to other areas: 1. how do you vet the workers on Upwork beforehand? 2. how do you know that the work done by the Upworkers is valid? I am afraid this approaches severely underestimates the resources and motivations of Red Team; what keeps Red Team from flooding Upwork with applicants that they know will approve their sybils? Or bribing existing workers with $1000 to approve a selected Sybil (given that some bad actors have $100k+ budgets for their grants, targeting a $1k bribe doesn’t seem out of proportion)? The steps that would be needed to take to make crowdsourced work viable are exactly the steps that FDD is currently exploring, with the added incentive that FDD will gain knowledge and retain control of the process. We always have to think very carefully about what we are optimizing, about the risks and tradeoffs. It is always going to be cheaper in the short run to work with established structures , cut costs, and ignore future growth. Spending time experimenting and exploring uncertain realms, by definition, will always have unknown ROI. But maintaining the growth @owocki has proposed that GitCoin is an egregore, which means it is a living thing, which means that it needs to be fed and nurtured. I think the egregore that GitCoin needs to become operates differently than a traditional bottom-line business, and this is something that people who are responsible for feeding the egregore (i.e. the stewards) need to consider. The current FDD proposals are seeking to balance the two objectives of present performance and learning for the future  by 1. performing within established knowledge while simultaneously using simulations (as cheap experiments) to gather information about alternative models. The simulations and other models are important, because we are dealing here with a human intelligence network with an intriguing type of information flow. We need models because networks of human intelligence and information flow aren’t amenable to purely logical testing like software programs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.240322580645161
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#35",
                    "likes": "4",
                    "time": "31/05/2022-22:58:48",
                    "content": "This proposal will be moving to snapshot today and I am requesting stewards to vote for OPTION 1. While we believe we have the support for option 2 to pass, we still want the stewards who believe we should do a discovery for a Sybil Detection/Passport Protocol DAO to be able to express that interest. We have done the work, had tough conversations and continue to perform even after losing three people in the budget review process. As a last request for stewards, I’d like to request that you to consider the following.   All options are more than a 40% deduction from the original request which is more than any steward asked for.   In a grants 2.0 future, we need to consider that FDD is responsible for protecting the legitimacy and credible neutrality of our own Gitcoin community rounds.    As other communities have rounds, they will need to choose their funding stack as well. With that, they will either take recommendations from what we use, roll their own algo, or design new solutions. We can be invested in the generalized FDD solutions as businesses and protocols.   Our work is on a core functions in Gitcoin Grants.  Finally, here is one more way to look at what FDD does based on functions in the funding stack. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.186710858585859
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#36",
                    "likes": "4",
                    "time": "04/06/2022-10:39:21",
                    "content": "Thank you @DisruptionJoe , @ZER8 , @David_Dyor, @Sirlupinwatson for the incredible effort in communicating what FDD is trying to do. I read your entire proposal the first time, and I did it again. I will vote for Option 2 in the Snapshot.  OPTION 2 - Fund FDD $330,000 and signal they should not perform a discovery 4 of a sybil detection / Passport DAO (49% reduction from original request)  I believe:  innovation is important to any organisation, encouraging it is key prudence is just as important, and I appreciate FDD trying to move towards being a leader in sybil defence  With the changes to Grant 2.0, FDD will need to evolve with it. I think creating some space for that is important while continually executing on FDD’s core functions. However, I’d like to remind some contributors that Stewards are not your enemy. Therefore I’d like to give some appreciation to @David_Dyor for his carefully written explanation to give context on how we might make better decisions regarding FDD.  Analysis Comparing both proposals ,here’s the key changes I think happened Core functions FDD OS from 124.4k to 95k (-29.4k)  removed storytellers (-14.4k) halved data analysis (-15k)  Grants eligibility from 86.5k to 60k (-26.5k)  halved ethelo dev (-6.5k) lowered cost for round, reward, GIA which budgeted 60k by 1/3 (-20k)  Data Ops from 50k to 45k (-5k)  simply lowered it by 10%  Adding in the Innovation segment Passport Trustseekers == Sybil Detection DAO from 60k to 60k (-0k)  both have same budget @60k   Community Intelligence, probably combination of catalyst and community model from 97.5k to 70k (- 27.5k)  guess is catalyst from 37.5k to 30k (-7.5k) because we love schelling points community model from 60k to 40k (-20k), also a 1/3 reduction  My guess is that the “Expansion” is more of a psychological element to nudge stewards to vote for Option 2. which is innovation because its description is so sparse. A bit like fire sales saying original price is $10, 50% discount at $5.  Conclusion I think FDD has somehow managed to balance most of the original roadmap, cut out some additional items that we’ve given feedback on (thank you for taking in some of mine too!). Here’s a potential compromise for S15. I would suggest considering splitting items up and @DisruptionJoe being an advisor to these workstreams Core to FDD  Grants Investigation Workstream Sybil Detection Workstream  DAO innovation  Gitcoin Research Workstream - I noticed that research work is being done throughout the DAO including MMM’s research on grants with a case study Passport Workstream - however this should fall under Moonshot/Product team  Yes it will give stewards more to look at. However, consider @kyle 's hypothesis that Thin workstreams might lead to better outcomes.  From this perspective, I think splitting innovation from the core function of FDD can help us get our key sybil detection and grants approval process going while we are given more time to discuss and evaluate the direction of innovation we want to go as a DAO, and as FDD. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.224759615384615
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#37",
                    "likes": "2",
                    "time": "05/06/2022-23:09:35",
                    "content": "So for me this one is a very hard decision. I am leaning towards  voting for option 3. The reasons are that:  I believe FDD, or something like that essential to Gitcoin grants and as such should definitely be something we should have during the grants round. I am sure that sybil Detection DAO is not something the DAO should spend funds right now under the current market. I am not confident that the current FDD team is able to deliver on what the DAO needs in the long run. I am not sure if it’s the fault of the team organization, the roadmap they are trying to stick to, or a breakdown of communication between FDD and the rest of the DAO. Something is off.  For Option 2 we are asked to fund “Passport Truthseekers” and “Community Intelligence”. I read the bullet points and explanations of what each of those is. I can’t really judge if it’s useful or not. I don’t have anything to judge by. No results to compare with. On the other hand I understand that this is what innovation and research is about, but how long can we keep funding research without concrete results? Then again I see comments by @David_Dyor and @DisruptionJoe here in this thread where they say they are surprised about the misalignment between the DAO and the FDD.  Some of the un-alignment accusations came as a surprise and the FDD should have a season to respond. If you think the scope of FDD drifted please give us the chance to demonstrate how aligned, lean and laser-focused we can be. Help us understand the dao-wide priorities so we can help the dao. Try to guide this crusty teenager before abandoning them. The results will be incredible.  and asking for more time to act on the feedback  It would also leave a 3/4 built skyscraper behind where people could say, “see, GitcoinDAO couldn’t provide a protocol without single points of failure and they wasted all their money on this thing”… but it might just be that finishing building that skyscraper would have removed the single points of failure. (skyscraper = the sybil work done so far)  Which makes me want to help towards aligning more on the goals and giving more feedback. I am really torn, between option 3 and 2, but leaning towards 3. Even if If I vote for 2, it would still not be a vote for the current way FDD is doing things. We need to reconsider a lot of things. Most important of which are:  Conciseness. FDD has a tendency to go off on a tangent. Every time I look at what you guys are doing, it sounds and looks more and more complicated than the previous time. You also tend to have funny names and very long form descriptions of everything. Keep it simple. (similar to point 1.). Please keep things simple. Stewards are not your enemies, but if we can’t understand what you are doing, or if we have to spend hours to understand something that should have been straightforward (come on guys it’s not rocket science) we won’t blindly say yes to it. Alignment on goals. Do one thing and do it well. It seems that FDD is trying to do too many things at the same time. We should have discussion within the DAO about what the FDD’s mandate and goal is again. Communication. There seems to be a breakdown of communication between you guys and the DAO. This is evident by the surprise you show in the feedback while this was already known between stewards in previous rounds too. Also by the comments in this thread about lack of inclusion in grants 2.0 planning (quoted below).   I would really love very direct feedback from @lthrift (Product Director) @kevin.olsen (VP of eng) @brent (Passport PM) and @nategosselin (Grants PM) to see which specific points are not aligned here. Let’s have a productive conversation! I am also asking for us to be involved in co-creating a future. I don’t understand why FDD was only involved in the grants 2.0 planning in discovery workshops where the product team for grants 2.0 learned what FDD was currently doing, but not in any future planning where we could have put these ideas forward and course corrected together at an earlier point in this process.  No matter what option is voted for these 4 points need to be addressed. Since the snapshot vote runs until tomorrow evening and it’s already late here, I will sleep on it and vote tomorrow. But wanted to leave my thoughts here first. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.382374899112188
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#38",
                    "likes": "1",
                    "time": "06/06/2022-01:55:39",
                    "content": "Tl;dr - I will be voting to fund option 2. Grant review/approval (eligibility enforcement, etc.) and the data science work from FDD has been incredibly important for us to continue and encourage the growth of the Grants program. I want to continue my thanks and appreciation to the FDD team for the ongoing conversation and revisions of this budget. I have appreciated those conversations and the willingness to explore an alternative to the previously proposed focus areas. As we evaluate the future of Grants and our Identity management tooling (Gitcoin Passport), I am of the opinion that much of the FDD work as previously scoped (before these revisions) have been focused on solving our sybil detection and sybil suppression in the wrong way. This budget proposal and my vote for Option 2 comes with the expectation that we will continue to realign FDD towards partnership in a protocol driven approach (as opposed to an ML based, and human review approach). A protocol based Sybil prevention approach will make the rounds (for all Grants 2.0 communities) more expensive to attack than they are to defend. Today, our Sybil detection is a very expensive red team vs blue team where we are constantly “whack-a-mole” finding and updating our approach. In the future, defining a cost of forgery for a wallet, which defines eligible matching pool impact will be possible with the protocol. This means, we will let the existing Sybil detection processes fade and shift from how we do things today. I am interested in funding Option 2 to ensure GR14 still runs (grant eligibility reviewed, sybil detection and “fraud tax” calculated, appeals process on eligibility, etc.). I am also interested in seeing continued data science from Omni as it has been very instructive in helping us shape the future approach. When evaluating past versions of the budget (and option 1), I don’t believe funding other mechanisms should continue and FDD has heard this critique and cut their budget request by ~45% from S13 to accommodate this cut in investment. One item that I want to flag is that I believe there is an opportunity to better align on how to direct $60k of this budget in closer partnership with the Grants 2.0 and MSC workstreams. My vote for Option 2 comes with the request that the roadmap for the Truth Seeker’s work is roadmapped and agreed upon with the Grants 2.0 workstream and MSC. They are directing the work for those protocols and I would want to ensure they are aligned with the work to expand our thinking there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.088333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#39",
                    "likes": "2",
                    "time": "06/06/2022-06:26:28",
                    "content": "    octopus:  I’ve seen it proposed that the task of investigating sybils be crowdsourced to $10/hour workers on Upwork. This simply moves the challenges FDD is trying to address to other areas: 1. how do you vet the workers on Upwork beforehand? 2. how do you know that the work done by the Upworkers is valid? I am afraid this approaches severely underestimates the resources and motivations of Red Team; what keeps Red Team from flooding Upwork with applicants that they know will approve their sybils? Or bribing existing workers with $1000 to approve a selected Sybil (given that some bad actors have $100k+ budgets for their grants, targeting a $1k bribe doesn’t seem out of proportion)?   How do you vet any new hire? How do you know the work done by any new hire is valid? The people working for the FDD can be bribed even easier than new people off upwork, as many of them have public twitter accounts, finding out who you hire on upwork would be much harder. I have found INCREDIBLE people off upwork for Giveth and Commons Stack. In fact, at this point about 1/2 the Commons Stack team was hired off of upwork. None of them would take bribes. We have to hire off upwork, because we don’t have VC funding, we live month to month on donations, but yet we still scramble to make it happen, and make an impact. In fact, we make a greater impact because we are sending crypto to countries that need it. If you would like help hiring off of upwork, some of the Ops money that was raised can be sent to General Magic, who does our hiring, and they can help find great candidates… and even show them how we do it. Don’t get me wrong, we need to also have experts like yourself Octopus (you know i love your work) and Z (you KNOW I love his and Blockscience’s work) but where we can, lets stop hiring people from the US and Switzerland, and hire people that can do the same (or often better) work for 1/3 the cost. The FDD has to cut costs, GTC cannot handle the wild inflation that was voted for this quarter, I can’t believe how much was approved to be spent on Ops and MMM… its ridiculous. IMO more should be spent in FDD than Ops and MMM this quarter… both can have admins from lower income places support their work. But that ship has sailed, we are where we are and we need to appreciate the market forces and the fact that GTC has no sources to generate demand right now or on the horizon, and tighten up. :-/ But I believe in the FDD team and the expertise they have developed, and am excited to see what they can build this quarter! I am voting for Option 2. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.627512954217499
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#40",
                    "likes": "1",
                    "time": "06/06/2022-07:37:13",
                    "content": " I am voting for Option 3.  you actually voted for Option 2 though  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#41",
                    "likes": "2",
                    "time": "06/06/2022-09:45:47",
                    "content": "So I voted for Option 2 after all. As I wrote here: [Proposal] FDD Season 14 Budget Request - #37 by lefterisjp I was torn between 2 and 3, but at least from the back and forth with FDD I see a lot of willingness to adopt and adjust and also compared to all other funded workstreams and to their initial proposal the budget ask is much smaller. Still I ask that FDD considers the points I wrote above for future rounds and for how we can fix the communication problems. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.265625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#42",
                    "likes": "0",
                    "time": "06/06/2022-13:06:58",
                    "content": "oops! Thx! Fixed it I meant Option 2 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/cancelled-superceded-s14-proposal-fdd-season-14-budget-request/10448",
            "title": "[Cancelled/Superceded S14 Proposal] FDD Season 14 Budget Request ",
            "index": 10448,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "15",
                    "time": "29/04/2022-00:47:07",
                    "content": "Newest proposal: https://gov.gitcoin.co/t/proposal-fdd-season-14-budget-request/10658  Workstream Mandate: Defend Gitcoin (Grants, DAO, & future products) from threats to its legitimacy, credible neutrality, and sustainability.  Season 14 Budget Proposal This is a renewal proposal for the Fraud Detection & Defense workstream requesting budgetary funds for Season 14 (1 May 2022 through 31 July 2022). FDD is requesting $486,130 to fund Season 14 (S14) and replenish its reserves for S15.  High Level Budget Breakdown Season 14 Budget Total = $649,455 PLUS Season 15 Reserves = $432,970 Total Needed = $1,082,425 MINUS Current Reserves = $596,295 ($690k total holdings | $596k Season 13 reserves & $94k treasury) Total Amount requested at this time = $486,130* *The GTC total will be adjusted based on the current market value at the time this proposal is moved to Snapshot and to Tally. The vote will be to send $ in GTC at the current price when moved to Tally or the 20 day moving average (whichever is lower).  TLDR FDD is responsible for the following items which are mapped to the outcome sets below  Defending Gitcoin Grants from exploits. (Sybil Accounts, Collusion, etc) Coordinating the grant eligibility policy & reviews Sustainably operating the workstream. Goal setting, delivery, accountability, & comms.  Sybil Defenders (Legitimacy)  Maintains DevOps for Sybil Detection machine learning pipeline Designing models for decentralizing the inputs to the machine learning pipeline Humans evaluating accounts to determine if they are sybil and train machine learning Solving for sustainable mechanism design minimizing the exploit surface area/profitability Inform decisions and improve our resilience to fraud using research, simulations, NLP/ML, etc  Grants Intelligence Agency (Credible Neutrality)  Set up tooling to lower our cost, improve the quality of reviews, and give transparency/consistency to the decision processes Execute all grant reviews, disputes, and appeals to ensure grants rounds run fairly Design, test, and implement a model for decentralizing grant reviews using incentives Deep dive reviews of grants to better understand the methods attackers use  Evolution (Sustainability)  Ensuring governance decisions and processes are properly designed and implemented Supporting payments and advancement of smart contract usage in comp models Articulating the work being done in FDD for internal and external stakeholders Setting strategy goals and ensuring that the workstream is accountable for delivering Providing data analysis services for FDD (this season we are opening to all GitcoinDAO)   Season 13 Recap FDD Season 13 Report Card GR13 Governance Brief  Key highlights & learnings: Sybil Defenders  GitcoinDAO now runs the full anti-sybil operational process (previously done by Blockscience) Doubled the number of human evaluations done at ⅓ of the cost Classified sybil behaviors & ran impact analysis Performed trust bonus analysis and provided recommendations  Won Metapod pitch competition and validated users for Sybil Detection DAO Reviewed sybil assumptions and began work on mechanism design & simulations  Grants Intelligence Agency  Hit all primary round OKRs without getting data integration on time from Holdings Assisted PGF ops in tag requests for eco & cause rounds Began creation of “trusted seed” of reviewers Designed curation incentivization structure for any community to have community curation Grants Curation NLP model that can replicate the GIA team’s decisions with 69% accuracy Reviewed and rewrote all current eligibility policy A full end to end process mapping of the grant review process was created  Evolution  Kishorditya’s Mandate Delivery Report outlining a Six Sigma style system review health metric for FDD to overcome Goodhart’s law Onboarding experience overview article on Mirror by JCook First season of source council was a success and even implemented accountability measures Developed FDD decision making process to encourage autonomy FDD contributor experience survey implemented Designed PEC model for bottoms up governance issuance within workstreams Created a data science pipeline for requests from other workstreams Created a data repository for public gitcoin datasets Designed architecture for GitcoinDAO data storage layer Made improvements/refactors/optimizations/bug fixes in SAD codebase   Season 14 Goals FDD Season 14 Goal Planning FDD has Top Level Goals which seasonally examine its respective medium term focus tagged Essential Intent. Consequently, (round over round) RoR Health Metrics are deployed to determine progress toward the medium term (12-18 months) goals. Objectives & Key Results (OKRs) are used to guide each top level goal set within a season. Outcomes are derived from our retro & strategy workshops, discussed with CSDO leadership, then assigned to an Outcome Owner through a process of nomination, synthesis, and ratification. Outcome owners are allowed to participate on the FDD Source Council. This gives them voice through the progressively decentralized FDD decision-making process. The corresponding Decision Making Agreement can be found in Notion. Most importantly, Outcome Owners are accountable for successfully executing on deliverables during a season and transparently communicating blockers and impediments preventing or delaying the delivery of key results. The FDD Source Council is responsible for incubating ideas and implementing passed proposals in the interest of the continuous improvement and progressive decentralization of FDD & Gitcoin.  Essential Intent & RoR Health Metrics These metrics are how we show the round over round improvements of the FDD workstream.  Sybil Defenders To minimize the effect of sybil attacks on Gitcoin Grants now and in the future  Cost/evaluation (S12=$4.39;S13=$1.42) Inter-reviewer reliability score (n/a) USD removed from fraudulent allocation (S11=$606k;S12=$621k;S13=) Number of models (S11=2;S12=2;S13=2) Human evaluations (S11=1,800;S12=6,000;S13=12,000)   Grant Intelligence Agency To improve the legitimacy, scalability, and quality of grant eligibility processes  Grant time to activation (S11<96hr;S12=<48hr;S13=<48hr) Cost per review (S13=$5.38) Total # of reviewers (S11=7;S12=8;S13=7) Poison pill score (Quality) (n/a) Successful appeals/total new applications (S13=16/33=48%)   Evolution To empower contributors to help FDD deliver on outcomes and become sustainable  Contributor UX score Time from proposal to pass/fail Grant round execution score GIA Execution Score Sybil Execution Score  The evolution scores will be baselined during season 14.  Season 14 Top Level OKRs These seasonal objectives and key results highlight our focus within Season 14.  Sybil Defenders Objective: Improve the quality of data inputs & processes in preparation for Grants 2.0   KR1: Add 2 anti-fraud components with Grants 2.0 applicability  KR2: Lower the cost per evaluation by 10% while maintaining inter-reviewer reliability  KR3: Add the community model to the “meta-model” for sybil detection   Grant Intelligence Agency Objective: Collaborate to improve scalability and quality of reviews in preparation for Grants 2.0   KR1: To re-review the entire set of active grants in prep for Grants 2.0  KR2: To reduce the number of outstanding appeals and disputes to zero  KR3: Lower the cost per grant review by 50% while maintaining quality   Evolution Objective: Build the workstream to be sustainable and remove “key person” issues   KR1: A contributor UX score improvement of 10%  KR2: Find and plan 5 opportunities for revenue or protocol funding  KR3: Build metric dashboards for each top level goal set   Season 14 Budget Requirements  1259×363 59 KB   1265×839 134 KB   Current Holdings (Using spot prices of $5.42 GTC & $2,875 ETH) FDD Primary Multisig (This entire wallet is counted as reserves on hand at the end of S13)  GTC = 101,115 = $548k USDC = 87,585 = $87k ETH = 17.18 = 49k DAI = 6,000 = $6k TOTAL = $690k  FDD Ops Multisig (approximately $107k will be used for S13 epoch 11,12,13 payments)  GTC = 16,876 = $91k USDC = 15,616 = $15k ETH = 0.375 = $1.5k TOTAL = $107k  FDD Payments  GTC = 0 USDC = 0 ETH = .3 DAI = 0   Team Updates Source Council (Core contributors) - 9 FDD Roles  Collaboration Talent Accounting WS Lead CSDO 1,2,3  Full (Trusted) Contributors (Not SC)- 18  Multisig Keyholders Subject Matter Experts FTE PTE  Human Intelligence Task(HIT) Roles  Grant reviewers - 8 Human Evaluators - 37  ",
                    "links": [
                        "https://docs.google.com/document/u/0/d/1xLFfWCrJ-WA5aZvOU2l7l0gLJ4a4vpwKtjFexPuxP-4/edit",
                        "https://gov.gitcoin.co/t/gr13-governance-brief/10289",
                        "https://docs.google.com/presentation/d/1nF1k8R5MtvSgJ3oE38OXuCskcEHOj64H/",
                        "https://gov.gitcoin.co/t/gia-rewards-okr-report/10438/2",
                        "https://gov.gitcoin.co/t/mandates-delivery-report-open-for-feedback/10470",
                        "https://mirror.xyz/jmcook.eth/Cq2dj3ihqkYumYmyCD1jDGididAFnUj3f47zI428Vi0",
                        "https://docs.google.com/document/d/1sWPEYJSY6P5exNxaiUtCaFrcX2bNPAmOJZt-6veGoko/edit?usp=sharing",
                        "https://gitcoin.notion.site/Decision-Making-Agreement-00808e48bee74ad1a2d08d58051111f5",
                        "https://gov.gitcoin.co/t/bobs-voter-guide-season-14/10575",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-19-2022/10737",
                        "https://gov.gitcoin.co/t/kris-voter-guide-s14/10554/2"
                    ],
                    "GPT-summary": "The post is a proposal for the Fraud Detection & Defense workstream requesting budgetary funds for Season 14 and replenishing its reserves for Season 15. The proposal outlines the workstream's responsibilities, goals, and achievements from the previous season. The post also includes metrics and objectives for the upcoming season, as well as a breakdown of the budget requirements. The post does not advertise the proposal, but rather explains it and provides information for auditing and review.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.449328212437968
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#2",
                    "likes": "11",
                    "time": "29/04/2022-02:00:31",
                    "content": "Love to see the evolution of FDD ws, this is a very clear budget proposal including budget request and reserve and last season financial report. The most inspriing part is the structures and the system. OKRs driven diffirent teams and clear responsibilities, and final result is the cost is decreasing, and the sybil is more strong. Definitely say “YES” for this budget request. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.081666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#3",
                    "likes": "11",
                    "time": "29/04/2022-04:57:59",
                    "content": "this season we’re putting an emphasis on higher inter squad cohesion and minimizing the duplication of work between squads by consolidating! season 14 for FDD is gearing up to be the most exciting and impactful one yet! our new members (myself included) have really started hitting our strides and finding where we belong. shout out to @DisruptionJoe for putting all this together and cutting out as much noise in our governance/budgetary decisions as possible. ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-15-2022/10453",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7024147727272725
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#4",
                    "likes": "10",
                    "time": "29/04/2022-12:37:24",
                    "content": "Since I  oficially joined Gitcoin DAO(from GR11) I can say that it’s the most impressive part for me has been the ever evolving structure of the FDD and the way it’s descentralizing while maitaining its purpose to defend the DAO against threats to its legitimacy, credible neutrality  while also ensuring scalability.  I can say that @DisruptionJoe has helped everyone in the FDD evolve and learn + he ensured that the FDD can and will help  every workstream, he’s a true leader, a very deep/thoughtful one and also an operational genius. I’m lucky to work with him, with my collegues in the FDD and also with the GItcoin DAO peeps I with to invite anyone interested in voting on our budget to study the FDD’s evolution from GR11 to GR12 to GR13 and now to GR14. It sound be eazy to follow up by reading our governance briefs from the respective seasons. The cohesion of this workstream is amazing and quality, values and proactiveness of it’s members are something rare, even in web3. Evolving while also maintaining and improving the FDD’s initial functions is not an easy task and should be taken into account when voting on this budget request. As a SC member and driver of 2 squads in the Grant Investigation Agency I believe it’s crucial we continue to get funded. We have been responsible with overviewing and executing on one of the most complex and important matters for the Gitcoin: the Gitcoin Grants! Congratulations for all the FDDers, you are great! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.754385964912281
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#5",
                    "likes": "10",
                    "time": "29/04/2022-16:51:36",
                    "content": "Really excited to improve the Human Evaluation and the app build with omnianalytics, data quality and reviews, continuous training to detect Sybils Attacks and lower the Fraud proportion to redirect these amounts in the right direction. Looking back since GR12 we were able to refine the overall development of the Fraud & Detection workstream but not limited to and advance our sharable values/goals toward a common mission. We still have plenty of work that need to be done but this is clearly a step forward. Shoutout to @DisruptionJoe @David_Dyor @tigress @ZER8 @nollied @vogue20033 @bobjiang @wkarshat @kishoraditya basically the hole FDD Team and all new comers that joined lately like ZEN who did work with me on the ASOP and of course @danlessa with his team BlockScience! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.344451003541913
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Adebola",
                    "index": "#6",
                    "likes": "10",
                    "time": "30/04/2022-11:27:34",
                    "content": "Season 14 in the FDD will herald more inter squad solidarity, which will increase the success impact by the workstream. The bottom up structure of the FDD makes it easy to come up with feasible and sustainable ideas, while still maintaining the “community first” promise of a DAO. The growth and evolution of FDD when i joined in GR12 has been unprecedented, hence an indication that S14 will be impactful and exciting. Kudos to @DisruptionJoe for shaping out a cutting edge structure for the workstream. ",
                    "links": [
                        "https://gov.gitcoin.co/t/kris-voter-guide-s14/10554",
                        "https://gov.gitcoin.co/t/s14-voters-guide-lefteris-guide/10585"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.277777777777778
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/zen",
                    "index": "#7",
                    "likes": "9",
                    "time": "30/04/2022-13:55:50",
                    "content": "Since I have joined the FDD Workstream in January, I have met the brightest and most passionate and innovative people. I’m so proud to be a contributor to FDD and GitcoinDAO. And thanks to the support and encouragement of my FDD family I am so excited and motivated to contribute even more and collaborate with all the contributors at FDD and GitcoinDAO. Thank you everyone  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 7.017857142857142
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#8",
                    "likes": "8",
                    "time": "30/04/2022-23:26:24",
                    "content": "we also all love to argue, a healthy sign of any community  @ZER8 @Sirlupinwatson @tigress @DisruptionJoe @octopus and others  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jonas",
                    "index": "#9",
                    "likes": "8",
                    "time": "01/05/2022-09:11:23",
                    "content": "I admire FDD’s commitment to decentralization and you inspire other workstreams to do better. As a workstream FDD’s tools to measure their effectiveness and impact makes this workstream easy to trust, and I can’t wait to see how FDD evolves.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.347222222222221
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kishoraditya",
                    "index": "#10",
                    "likes": "7",
                    "time": "01/05/2022-10:15:25",
                    "content": "S14 is going to see some spectacular results with FDD gearing towards grants 2.0, Sybil DAO, and understanding deeper insights to be the backbone of Decentralized Autonomous Organizations in general! Awesome work putting down the 90-day vision and budget! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.868055555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#11",
                    "likes": "6",
                    "time": "01/05/2022-19:36:29",
                    "content": "Another clear well-described budget from Disruption Joe that gets my full support.  Glad to be part of the team with you and the entire FDD & Gitcoin Dao.  I appreciate the leaning out and trimming of the budget plus getting some metrics established to help communicate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#12",
                    "likes": "3",
                    "time": "02/05/2022-15:39:11",
                    "content": "Lol. We never argue. I can argue that we don’t ever argue   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#13",
                    "likes": "5",
                    "time": "02/05/2022-19:17:28",
                    "content": "@DisruptionJoe is a master at building the machine that builds the machine. FDD has prepared a lot of content but its buried in several documents, I’d suggest maybe making it a bit easier for people to understand how FDD is functioning. Here’s the approach I took to make sense of the FDD budget that I took (after looking at everything) and the subsequent comments/suggestions I’ll give. 1. Get a sense of the top level sums This can be found under Season 14 Budget Requirements and splits the budget into outcome owners, GIA, Sybil Defenders, and Evolution 2. Start with the FDD Season 14 Goal Planning documents 3. See if you agree with the overall goals Here are my thoughts for the team:   What about prevention of sybils?: I’m curious if FDD is looking at prevention/deterrence rather than detection. having less sybils might make it easier to defend too. A red team approach might help where some FDD individuals are empowered to pose as sybils to try to attack us and learn from that rather than relying too much on automation and AI/ML.  FDD Storytellers might not be necessary: this stood out as its more of a PR activity for FDD. For context, its asking for 14.4k USD which is >50% of most of your sub-workstreams. Its unclear how it will help improve contributor UX, GIA execution, or sybil execution and the items of quests etc seem to fall under onboarding instead. I’ll suggest removing it or making it into just a sample blog post or explainer for contributors.  Greater focus on policy: working with grantees for GR13, there was some feedback that the policy was unclear or that the process for grantees might feel arbitrary or disheartening. I know this isn’t the case but perhaps reallocating the budget from storytelling to policy communications will be more helpful. In fact, including that as a top-level OKR for GIA might be even better. Right now Evolution has a higher % of budget compared to GIA too which might suggest overindexing on automating and growing FDD for this particular budget  Inter-Workstream work: would like to see some evidence of discussion on FDD with Grants 2.0 especially with “Catalyst | nollied” which is asking for 37.5k USD (one of the largest allocations). Caveat that I’m not saying there isn’t discussion, but would like some idea of how aligned this work is especially because what is proposed is very experimental and is researching a lot of different highly technical topics.  Sybil Detection DAO needs more details: I know there’s some context as during ETHDenver this idea was floated. Right now I’m assuming its about creating a sub-DAO focused on sybil detection, but I thought that was FDD itself. Also it’s asking for 90k USD which is the largest % of the overall budget.  Overall thoughts: I like that FDD takes time to explore more experimental issues and DAO-wide issues. The budget and its process to come up with it is democratic and decentralised which I appreciate too, however I’d like to see work done between other parts of the DAO (links to discussions, WIP, etc) to get a better idea how the work is going.  4. Take a look at past performance with the S13 Report Card  at first glance, most of everything has been done, so congratulations to the workstream for pulling of a great season! interesting to see the work exploiting grants and a focus on simulations, I suppose that falls under prevention! curious how some of these things have been used like the mandate delivery option and the CAP table research  5. Requests and rationale for vote choice   Requests: Additional focus on Grant Policy communication, removing FDD Storytelling, include more inter-WS discussions to provide more confidence on decisions and direction. I’d like to see more work from subject matter experts on the technical aspects of FDD, especially on mechanism design and AI/ML work  Rationale: I am leaning towards a FOR vote as I agree with most of the OKRs and won’t want to let one OKR hold back my general positivity towards FDD.  Once again a great job putting together elements of the budget! ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.099442755825734
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#14",
                    "likes": "3",
                    "time": "02/05/2022-19:31:11",
                    "content": "    Fishbiscuit:  I’m curious if FDD is looking at prevention/deterrence rather than detection. having less sybils might make it easier to defend too. A red team approach might help where some FDD individuals are empowered to pose as sybils to try to attack us and learn from that rather than relying too much on automation and AI/ML.   yes!!! that’s what my squad “Catalyst” is researching and developing. I’m a firm believer that we should not totally rely on retrospective sybil account detection. we’re working to minimize the profit margins for exploits in general using novel mechanism design proven through simulation. i’m hoping to coordinate with the grants 2.0 folks (ie. @kevin.olsen) to bring this to fruition.     Fishbiscuit:  Inter-Workstream work : would like to see some evidence of discussion on FDD with Grants 2.0 especially with “Catalyst | nollied” which is asking for 37.5k USD (one of the largest allocations). Caveat that I’m not saying there isn’t discussion, but would like some idea of how aligned this work is especially because what is proposed is very experimental and is researching a lot of different highly technical topics.   to be clear, we haven’t had full on discussions yet, but I am hoping that this season we can work more closely. either via direct communication, or by presenting our propositions and simulation results to be implemented into the “marketplace” of components/presets for the round managers. the only “evidence” i have can be found here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.264988425925926
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#15",
                    "likes": "3",
                    "time": "02/05/2022-19:34:25",
                    "content": "    Fishbiscuit:  this stood out as its more of a PR activity for FDD. For context, its asking for 14.4k USD which is >50% of most of your sub-workstreams. Its unclear how it will help improve contributor UX, GIA execution, or sybil execution and the items of quests etc seem to fall under onboarding instead. I’ll suggest removing it or making it into just a sample blog post or explainer for contributors.   storytelling is something missing in nearly all streams, esepcially FDD. there’s an almost magic-like property of taking what’s going on internally and communicating it in a digestible format. i think of it like self-awareness and external relationship building. you know, in cognitive behavioral therapy (CBT), communicating with ones-self unlocks immense potential in becoming a better human being. why wouldn’t this apply to the shared consciousness of a DAO? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.840909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#16",
                    "likes": "3",
                    "time": "02/05/2022-20:08:53",
                    "content": "    Fishbiscuit:  Here’s the approach I took to make sense of the FDD budget that I took (after looking at everything) and the subsequent comments/suggestions I’ll give. 1. Get a sense of the top level sums This can be found under Season 14 Budget Requirements and splits the budget into outcome owners, GIA, Sybil Defenders, and Evolution 2. Start with the FDD Season 14 Goal Planning documents 3. See if you agree with the overall goals   Thanks for this suggestion. We also made this budget review tool on Ethelo and would love for you all to check it out to review all of the Season 14 budget requests! https://gitcoinbudget.ethelo.net/     Fishbiscuit:  What about prevention of sybils? : I’m curious if FDD is looking at prevention/deterrence rather than detection. having less sybils might make it easier to defend too. A red team approach might help where some FDD individuals are empowered to pose as sybils to try to attack us and learn from that rather than relying too much on automation and AI/ML.   Yes. This is directly a goal of ours with the Catalyst squad (formerly called Matrix).     Fishbiscuit:  DD Storytellers might not be necessary : this stood out as its more of a PR activity for FDD. For context, its asking for 14.4k USD which is >50% of most of your sub-workstreams. Its unclear how it will help improve contributor UX, GIA execution, or sybil execution and the items of quests etc seem to fall under onboarding instead. I’ll suggest removing it or making it into just a sample blog post or explainer for contributors.   We actually found that this one bubbled up for us from all the contributors. We weren’t doing a good job of sharing context within the workstream between squads. Most of your other criticisms here seem to highlight the need for some level of comms. This is a very small budget and the outcome owner is already a source council member with another outcome so there isn’t a full time person dedicated to this. We simply felt the need to be intentional about this.     Fishbiscuit:  Greater focus on policy : working with grantees for GR13, there was some feedback that the policy was unclear or that the process for grantees might feel arbitrary or disheartening. I know this isn’t the case but perhaps reallocating the budget from storytelling to policy communications will be more helpful. In fact, including that as a top-level OKR for GIA might be even better. Right now Evolution has a higher % of budget compared to GIA too which might suggest overindexing on automating and growing FDD for this particular budget   One answer to this is that we raised the round management budget substantially and put the grant policy work within this stream. We believe that the policy errors were more process driven than due to an unclear policy (although its just a weighting, not a binary). Another answer is that we are bearish on policy in general. Instead, we are solving for how any community, including our own, can collectively set and review criteria and grants eligibility status against that criteria in a decentralized way that maximizes for trusted outcomes first, then minimizes cost for scalability. You can see this in our Rewards Modeling OKR report here or if you want a high level overview, watch this 8 minute video.     Fishbiscuit:  Inter-Workstream work : would like to see some evidence of discussion on FDD with Grants 2.0 especially with “Catalyst | nollied” which is asking for 37.5k USD (one of the largest allocations). Caveat that I’m not saying there isn’t discussion, but would like some idea of how aligned this work is especially because what is proposed is very experimental and is researching a lot of different highly technical topics.   This workstream was formerly called Matrix. We believe that it’s work is crucial because without it we are not preparing for a grants 2.0 future. Funds removed from fraudulent allocation is the most relevant metric for them. Without them we do not have a high-level overview of why we are focusing where we are. In the last season, Kylin’s review on the matching caps informed the grants ops decision on what to do with matching caps. Additionally, they identified an entirely new vector of attack. Their work is needed in my opinion and their budget is only lower than the sybil model now because innovation and research is a hard sell, but unfortunately FDD is tasked with solving 2 unsolved research problems for Gitcoin. In season 14, they are tasked with coming up with Grants 2.0 components which can minimize fraudulent allocation. They will map the composable components and communicate an understanding of the tradeoffs in different component stacks. They will also be able to inform decisions based on simulations. Grants 2.0 is going to be a main customer for this squad because they will need a collection of components to start. They are currently focused on building the first component of Grants 2.0 as the ones which are used in cgrants, but this squad can simulate and suggest new legos with code that can be dropped into production. They can also plugin synthetic data to the community model to help train it faster. Another way they can reduce costs is in prototyping NLP solutions. Lastly, they can help other FDD squads with simulations. Deliverables include reports and graphics and even code for grants 2.0 components.     Fishbiscuit:  Sybil Detection DAO needs more details : I know there’s some context as during ETHDenver this idea was floated. Right now I’m assuming its about creating a sub-DAO focused on sybil detection, but I thought that was FDD itself. Also it’s asking for 90k USD which is the largest % of the overall budget.   I will be directly leading this effort. The details are in flux, but we need to begin building some of our standards into protocols which will serve as microservice protocol DAOs. The entire solution can be generalized to serve all of web 3. Here is the Sybil Detection DAO deck. Overall, thank you for the thoughtful response. ",
                    "links": [
                        "https://gitcoinbudget.ethelo.net/",
                        "https://gov.gitcoin.co/t/gia-rewards-okr-report/10438",
                        "https://youtu.be/GrYD_gTHgys",
                        "https://docs.google.com/presentation/d/1fXKmqBseygbQ3MguzW0_FkFQ6thLcxJUEZj3WtXVOrI/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.721858141858141
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#17",
                    "likes": "1",
                    "time": "02/05/2022-20:18:41",
                    "content": "Gotcha on that, may I suggest not asking for a budget to the tune of 5.8% of FDD’s overall budget. As this is more nascent, probably a smaller sum to start to show some results would be good + there’s a fair bit of reserves each round that can be used for activities like this (edited for accuracy, 9.2 to 5.8%) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#18",
                    "likes": "2",
                    "time": "02/05/2022-20:20:45",
                    "content": "True, storytelling is fundamental to the human experience and knowledge transfer. However that’s not the core of what FDD ought to be doing and my personal take is that focus is definitely important! Hence the suggestion of focusing on explaining the grants policy itself and starting with that rather than creating all these experiments and quests suggested. This is something that can be measured as you can now survey past grantees and new grantees or figure a way to see if they get the policy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.525974025974026
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#19",
                    "likes": "4",
                    "time": "02/05/2022-20:33:09",
                    "content": "    Fishbiscuit:  may I suggest not asking for a budget to the tune of 9.2% of FDD’s overall budget. As this is more nascent, probably a smaller sum to start to show some results would be good   The catalyst budget is 5.8% and they are only new in that it is a name change. I highlighted some results above. This squad is comprised entirely of Ph.d statisticians, mathematicians, systems engineers, and machine learning engineers. This is a very low budget for the work being done imho. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.742424242424242
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#20",
                    "likes": "2",
                    "time": "02/05/2022-21:02:36",
                    "content": "    Fishbiscuit:  that’s not the core of what FDD ought to be doing and my personal take is that focus is definitely important!   by this same logic, should we also slash accounting/talent/collaboration?     Fishbiscuit:  Gotcha on that, may I suggest not asking for a budget to the tune of 5.8% of FDD’s overall budget. As this is more nascent, probably a smaller sum to start to show some results would be good + there’s a fair bit of reserves each round that can be used for activities like this (edited for accuracy, 9.2 to 5.8%)   research and development is longer term for tangible results with high risk high reward. plus, we’re paying our highly qualified members below market value already. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.116666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#21",
                    "likes": "4",
                    "time": "02/05/2022-21:05:56",
                    "content": "    ZER8:  Lol. We never argue. I can argue that   uhm…,… i disagree. hahaha ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#22",
                    "likes": "5",
                    "time": "02/05/2022-21:07:49",
                    "content": "  Yes eventually it should require less budget, that’s what DAO Ops is trying to do and eventually this part of the budget would be lower. (to the slashing point) Understand that legacy-wise that’s how it is now but hopefully we’d have better standards across the DAO. So to the original point, would working with MM be better rather than doing it in-house?   Yes and @DisruptionJoe explained the rationale for this, at first glance it seems to be an entirely new initiative hence my skepticism. Now that it’s clarified, I’m quite impressed how FDD has found quality contributors to work on this (and am excited to see it happen).   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.8560606060606055
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#23",
                    "likes": "2",
                    "time": "02/05/2022-21:11:20",
                    "content": "    Fishbiscuit:  So to the original point, would working with MM be better rather than doing it in-house?   generalizing integral human-centric functions to an external workstream/squad sacrifices fidelity. of course, we can outsource collaboration, talent, and accounting, but it will inherently be less fine-tuned for our needs. in the case of talent and collaboration, this could cause disjointedness.     Fishbiscuit:  I’m quite impressed how FDD has found quality contributors to work on this (and am excited to see it happen).    yes catalyst is my favorite child lol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.114583333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#24",
                    "likes": "3",
                    "time": "02/05/2022-21:47:57",
                    "content": "I love that there is a Discord convo with core engineers going on right now about how to optimize the quadratic funding calculations and @nollied walks in with already built code from his simulations. optimized_clr.py · GitHub ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#25",
                    "likes": "2",
                    "time": "02/05/2022-23:00:20",
                    "content": "    DisruptionJoe:  Grants 2.0 is going to be a main customer for this squad because they will need a collection of components to start. They are currently focused on building the first component of Grants 2.0 as the ones which are used in cgrants, but this squad can simulate and suggest new legos with code that can be dropped into production. They can also plugin synthetic data to the community model to help train it faster. Another way they can reduce costs is in prototyping NLP solutions. Lastly, they can help other FDD squads with simulations. Deliverables include reports and graphics and even code for grants 2.0 components.   i’m pretty impressed with how precise your statements here are. it’s tightly coupled with my vision too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.949729437229437
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#26",
                    "likes": "4",
                    "time": "03/05/2022-04:15:04",
                    "content": "I have been compiling my Voter’s guide and I want to offer some of my questions and observations ahead of posting the voter guide. I do intend to update my voter guide as we discuss here, but hopefully we can keep the FDD relevant convo in this thread. tl;dr on my current sentiment:  FDD - Requesting a reduction (from 118K to 67K GTC), FDD is a cost center, like DAO Ops and should be focused on maintaining as slim of an operating budget as possible. Gitcoin seems to be paying for the education and advancement of a number of ideas - Sybil DAO, Most of “Evolution”, Catalyst, etc. without any discernible increase in value being delivered back to the DAO. Cutting most of “Evolution”, scaling back “Sybil defenders” and doing a deeper dive on the value of GIA would be valuable. FDD has brought tremendous strength in ideas to the Gitcoin DAO, and those participating in the workstream are sharp and care deeply about our mission. FDD seems to be building for themselves and not for Gitcoin - costs continue to grow without a large change in result (though I understand decentralized approaches are culprits for this cost increase). FDD supports a two week long blitz (Grants Round) which has a leading and trailing week or so of intense evaluation of the round. Getting to a budget of $650k to support the Round is just too much. IMO, Outcome owners can lead much of “Evolution” as part of their day to day if they weren’t just building the machine to feed the machine.  We seem to have hit a tipping point where despite the volume needing to be processed, we still continue to see growth (though much less growth than past seasons). I am still struck by how much we could accomplish with a team of three (Joe, Kevin and I) and the partnership with Blockscience. It cost us roughly $50K/mo to deliver all of our sybil detection for rounds up to 11. And now we are at a 13x funding request ($550K) with a 1.5x increase in Grants funding volume (the 1.5x number may be too low as it likely depends how you measure the round volume - I am looking at $$ going through the platform contributors - which for the longest time had been our north star ). I don’t want to see FDD go away, I just really wish there was more prudence in the selection of ways they are expanding. The bear market we are heading into has really changed my risk tolerance for the experimentation and learning. I feel it is important all workstreams deeply evaluate the impact they have for Gitcoin and strip down to the slimmest budget they can while maintaining the impact likely for S14, S15. Even if it means slowing initiatives like Sybil DAO, new tooling build outs, research on adjacent areas (like DAO governance models), etc. I would love some thoughts from the FDD team on how might we be able to cut this budget down to perhaps a 7x increase from “the good ole days” as compared to where we are now. This request and feedback is going out to all workstreams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.433487808487808
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#27",
                    "likes": "5",
                    "time": "03/05/2022-14:27:22",
                    "content": "    kyle:  FDD is a cost center, like DAO Ops and should be focused on maintaining as slim of an operating budget as possible.   Your understanding of FDD’s role in solving unsolved research problems which existentially affect Gitcoin’s future is interesting to me. You seem to be saying on one side that we, Gitcoin, need to focus on creating a decentralized protocol. That there is no future value for Gitcoin if we don’t decentralize the system and give the governance token more utility in that process. FDD is doing that with both of our areas of responsibility, but your answer is ‘You, me, Kevin and Blockscience could do it for less’. From the beginning, the reason for having a workstream for FDD was to push the control of the subjective decisions out of the hands of a few… you me kevin We take that seriously and are building to allow larger numbers of participants.     kyle:   Sybil DAO, Most of “Evolution”, Catalyst, etc. without any discernible increase in value being delivered back to the DAO    Sybil Detection DAO - On one hand you are saying we need to find ways to provide upside back to the DAO. On the other hand, you see a (lightly) validated idea that simply needs execution to take a solution we are using which can be generalized for all of web 3 and think this is simply education. The wild thing is that while we would provide the digital infrastructure which would be required for online democracies to work, we would also benefit from better data into our system. Very positive sum. Cutting most of evolution - Which part of evolution do you think is least needed?  Contributors knowing when and how to participate? Us understanding where are strengths and weaknesses are and continually improving? Our data collection and aggregation that allows us to be data driven? Our internal and external communication of what we are doing so we are clear between ourselves and you and other stewards understand our work? (This one is new, but the explanation to fishbiscuit above discusses relevant details) Our paying contributors on time? Our paying contributors for the roles DAOops has requested we create?  If we had wanted DAO ops to run everything and control all the decision making, hiring, and payment decisions along with assessing every workstream’s competency, then we probably should have made a company, not a DAO. That is a little facetious. I do want to hand over responsibility for some of these items as we have done with others in the past, but I don’t believe the DAOops workstream has advanced to the level to be able to fully serve our needs. Reasons:  After 6 months we still don’t have a metric for “what is a successful onboard to gitcoinDAO?” Our peer review process supplied to us was basically telling us to walk all our contributors through copying a google form with the right settings and sending it out. This handed us more work that we needed to pay our contributors to do rather than providing a service. We didn’t include the $120k for travel expenses the CSDO passed! ($120k coming from the Moonshot proposal)  They will get there, and the way we will do that is by other workstreams, FDD included, developing their own systems. We allow the successful norms to emerge and then DAOops can facilitate the operations which we all opt in to sharing. What you don’t explicitly say here is that by eliminating FDDs operations and structure, you are effectively asking for all hiring, decision making, and information gathering and insights to be provided by DAOops.     kyle:  doing a deeper dive on the value of GIA would be valuable   Can you say more here?     kyle:  FDD seems to be building for themselves and not for Gitcoi   This is ridiculous! Quadratic funding (and most other funding mechanisms one might use in grants 2.0) does not work without sybil resistance. Second, if you want a decentralized protocol that improves democracy and allows for better allocation of resources you HAVE TO provide a decentralized way to source the inputs to the system. Sybil detection is not the only way to do this. Catalyst is working on mechanism design solutions for grants 2.0. Either way, if the content moderation (both users/sybil and issues/grants) for online democracies works like what you had at Twitter, then we are not building for this community. This work from our rewards modeling crew in GIA went fairly unnoticed, but it is essentially the point of what FDD needs to do. We need to understand how we can create trusted outcomes via engineering good systems, then minimize the cost to be efficient, but not so efficient that the system centralizes. This will be used to optimize and decentralize the inputs to the sybil pipeline along with it’s original intention of optimizing the grant review mechanism so that ANY community can provide community curation rather than self curation. We are going to be able to offer legitimacy, credible neutrality, and sustainability AT SCALE if we are successful. If that isn’t directly in benefit of Gitcoin, I don’t know what is.     kyle:  Even if it means slowing initiatives like Sybil DAO, new tooling build outs, research on adjacent areas (like DAO governance models), et   You obviously see this as an expense and I see it as an investment that also happens to make us better. Gitcoin would own a substantial share of these protocols to govern and participate in their growth. Think aqueducts and ownership. (Kinda like owning a rental property. You benefit from the investment appreciation and cashflow.) By understanding the governance for a new Sybil Detection DAO, we can help Gitcoin launch multiple subDAO microservice protocols which will be legitimate public goods as digital infrastructure enabling online democracies. By building out Sybil Detection DAO, we gain data partners which need to be rewarded for providing us with data that makes our detection efforts better. By building out new tools like Ethelo for grant reviews, we enable the community to make eligibility decisions. We provide a way for the subjectivity inherent in decisions to be owned and distributed in the community, not a delegated authority.     kyle:  I would love some thoughts from the FDD team on how might we be able to cut this budget down to perhaps a 7x increase from “the good ole days” as compared to where we are now.   Those weren’t the “good ole days”. Those days sucked. I do not want to “Make Gitcoin Great Again”! We were unable to innovate or really even understand what was happening. We were not able to assess if the things we worked on were the most relevant. This type of thinking is what led us to the previous dGrants issues. It led us to not decoupling the eth and platform creating a ton of confusion and unhappy users (who think FDD is messing up but not realizing we made design decisions that made it impossible to be logically consistent) The suggestion that FDD is here for itself and not the community is simply untrue. We are innovating to find solutions. Perhaps if you didn’t ask us to “slim down” and not look at the overall threats to the DAO, we would have rang a louder alarm about the need for treasury management back when we started in November. If we were to line up the importance of our work, it would probably fall under PGF and the yet to come GPC, but right up there with them. Heck, I remember the good ole days where I was hired for growth but we couldn’t get the data needed to make that work and had a major gap in operations which I ended up filling. Back then we didn’t need ANY marketing. (I’m absolutely not saying we don’t need MMM, I’m just pointing out the double standard in the logic.) ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.817328582778021
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#28",
                    "likes": "5",
                    "time": "03/05/2022-17:48:41",
                    "content": "    Fishbiscuit:  Greater focus on policy : working with grantees for GR13, there was some feedback that the policy was unclear or that the process for grantees might feel arbitrary or disheartening. I know this isn’t the case but perhaps reallocating the budget from storytelling to policy communications will be more helpful. In fact, including that as a top-level OKR for GIA might be even better. Right now Evolution has a higher % of budget compared to GIA too which might suggest overindexing on automating and growing FDD for this particular budget   I can say that this is a great suggestion Fishbiscuit  We should focus on Policy Communications and we will have a GIA Twitter account in GR14. The FDD storytellers initiatives is something different and I wouldn’t take it’s budget, but I do agree that we need a cohesive communications strategy with our grantees  Me and @David_Dyor will start working on this and would love to hear more from you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.773809523809524
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#30",
                    "likes": "2",
                    "time": "03/05/2022-21:49:13",
                    "content": "i realized that the deleted response above had unfair/leading questions. feel free to ignore. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#31",
                    "likes": "1",
                    "time": "09/05/2022-04:01:28",
                    "content": "    DisruptionJoe:  You obviously see this as an expense and I see it as an investment that also happens to make us better.   I appreciate your responses @DisruptionJoe - ^^ This to me is the crux of where our opinions differ, and you appropriately named it. I feel we are both entitled to hold our opinions and I want to call out that I understand your position and I think I understand the value you see in the work you and the FDD are doing. In the market we are bracing for and with the results I have seen, I am advocating now is not the time to  make such large investments.     DisruptionJoe:  We are innovating to find solutions.   One area I have hoped for FDD to innovate is in software that integrates with the platform / protocol. And my understanding is that the investments have instead been made in building (adjacent) software that support manual review and manual intervention. The ASOP is likely the place that our visions had aligned the most, and I know you were slowed/blocked by a contributor’s lack of action there so i do want to acknowledge the work there.  I am really trying to think through how we move forward. Perhaps I can articulate some of my thoughts more 1:1 and then you can evaluate if they are viable? A larger change is likely needed and I dont want you to feel rugged or pushed out as part of that retooling. We have a protocol coming (dPopp) which will make much of what FDD does more scalable, and also invite others to participate in a simple and effective way in determining the best sybil suppression model. If S14 is a “tide us over” type of season and we cut the things we know we are not going to need in the same way for S15, I could get behind that budget. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.161654135338345
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tigress",
                    "index": "#32",
                    "likes": "4",
                    "time": "09/05/2022-09:43:30",
                    "content": "gm! @kyle I am deeply, wholeheartedly stunned by the selection of words you are using to summarize your sentiment in the tl;dr above.  Words create worlds! It’s a conscious choice!  What you are feeding back to me (FDD) and what I am learning here is that taking into account the current situation and the overall context (see also Hiring Freeze?) we could review priorities and if necessary shift the focus accordingly. Coming back to Words creates worlds! I d like to highlight these three:     kyle:  FDD is a cost center       kyle:  FDD seems to be building for themselves and not for Gitcoin       kyle:  IMO, Outcome owners can lead much of “Evolution” as part of their day to day if they weren’t just building the machine to feed the machine.   What’s awesome about calling another organizational entity a cost center? What’s awesome about making the assumption that FDD seems to be building for themselves?  In a decentralized environment shared understanding of the broader (business) context and priorities, a culture of embracing positive conflict and a felt sense of purpose can better be cultivated and balanced through an approach of having intelligent conversations.  Just compare these two approaches: A World  with conversations like these: This conversation is initiated from an inner felt sense of fear. The urgency to act now and protection against some externality that one can’t control seem to guide the interaction between people. One adopts a defensive or offensive position. The other one reacts in an offensive or defensive way. Roles may switch back and forth. A victimized state gets acted out. Both eventually find themselves defending their position and trying to execute power over the other in order to survive. A World  with Conversations like these: This conversation is initiated from a state of trust and presence. One would approach the situation from an inner felt sense of wholeness, being okay with oneself and courage. A genuine curiosity would be rising and one is wondering how we - together - could master this situation of turmoil and uncertainty. What is emerging here and what questions for which I do not have answers yet can I ask? How can I serve the people to thrive sustainably in the long run? How can I have power with them and partner with them? Which world would you intentionally want to manifest? Which quality of conversations regarding budget do you want to lead? I sincerely believe we do have a conscious choice here. And no, I am not telling anybody that it is easy, but I believe it’s going to be worth it to aspire for World  Conversations. -Tigress ",
                    "links": [
                        "https://gov.gitcoin.co/t/hiring-freeze/10542"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.997429653679653
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#33",
                    "likes": "3",
                    "time": "09/05/2022-17:18:44",
                    "content": " As a contributor I consider wanting to reduce the FDD’s budget with more than a half a little unfair. I am actually not biased in any way(even if I am leading two GIA initiatives, I actually asked for the minim minimorum that we need to get things running and ensuring that the credible neutrality of the grants is ensured)  because I assumed that passing the budget this time will be even more difficult due to the market conditions. I’m kinda a newcomer here, only around for 10 months, but not new in web3 and life . Life has thought me that yes, unpleasant things happen, sometimes they are out of your control => so reducing out budget would not be the end of the world and certainly not the end of the FDD. My life experience AND geographical location(next to Ukraine, God bless everyone ) has also thought me that I should prepare for the worst. My question is: How come that Gitcoin as the amazing organisation(not ironic, I love it) that it is, didn’t prepare for bear market conditions? As a contributor I find this a little distressing… This could be seen as a big vulnerability and while I’m sure that everyone here actually cares about our goal and wants to make the world a better place via public goods funding, I do find it a little weird that we as the cyber organism that we are, didn’t prepare for the bears  Maybe we should learn from this and prepare for the future. Maybe we shouldn’t increase spending or funding initiatives just based on the optimistic sentiment that we all have when the bulls are in charge in the markets   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.950090831787261
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#34",
                    "likes": "4",
                    "time": "09/05/2022-17:50:52",
                    "content": "    ZER8:  that it is, didn’t prepare for bear market conditions   I find asking “Why didnt my DAO prepare for bear market conditions?” to be a little like asking “Can someone do something about how fat I’m getting?”  It absolves the asker of any responsibility for the situation they are in, and expects foresight & a bail-out from others (not within). Does the DAO live in a world with autonomy or not?  I think its time to pick a lane.  Autonomy & responsibility No autonomy & no responsibility  Here are some posts that I’m aware of that tried to get the DAO to rally around the idea that the plush times would not last forever.  They didnt get much action when they were posted. Maybe they will now.     Wartime DAO / Peacetime DAO 🤖 Meta-Governance       A few more great excerpts from Wartime CEO/ Peacetime CEO.  As I read them, I’m translating them to DAO-native in my mind by crossing them ideas from A DAO has no CEO and decentralized great responsibility.  Some of these perhaps don’t translate well to a DAO native context.   Peacetime CEO knows that proper protocol leads to winning. Wartime CEO violates protocol in order to win.  Peacetime CEO focuses on the big picture and empowers her people to make detailed decisions. Wartime CEO cares abou…         Abundance & Scarcity 🤖 Meta-Governance       Not financial or tax advice. This post is strictly educational and is not investment advice or a solicitation to buy or sell any assets or to make any financial decisions. This post is not tax advice. Talk to your accountant. Do your own research.  In my 5 years in the web3 space (2017 - 2022), I’ve seen oscillations between Abundance & Scarcity & back again.  During the last supercycle, major assets like BTC or ETH went up 20-50x and then down 95% from there.  I want to write a little bit about…         Gitcoin Treasury Diversification 📜 Proposal Discussion       Authors from Llama: @schlabach, @0xJosh, @helloshreyas  Summary  We propose that Gitcoin diversify $15 million of its treasury into stablecoins. $15m constitutes 24% of the vested treasury and 2% of the total treasury (vested + unvested). The goals of the treasury diversification are to de-risk Gitcoin’s treasury, make sure the treasury has sufficient stablecoins to cover one year of operating expenses, and ensure that GTC tokens are held by long-term partners. This post outlines the need and pr…         2022 Roadmap & 2022 Goals 🤖 Meta-Governance       Here are some proposed 2022 goals from the Gitcoin Holdings side of things.  Key metrics:   impacted lives of devs (GMV) decentralization  Objective 1: More Scale:   Increase the number of Grants that raise >$5k/quarter by 50% Increase the number of high quality hackathon submissions by 50%*  subject to change after evaluation is done.    Objective 2: More Decentralization:   2 implementations of ($1k GMV each) dGrants forks (horizontal scale) Release a generally available V1 of a shared grants …     I think a better way to rephrase your question is “Why didnt WE prepare for bear market conditions?” ",
                    "links": [
                        "https://future.a16z.com/peacetime-ceo-wartime-ceo/",
                        "https://gov.gitcoin.co/t/a-dao-has-no-ceo/9852",
                        "https://www.youtube.com/watch?v=-o308cW0hKI",
                        "https://gov.gitcoin.co/t/abundance-scarcity/10045",
                        "https://gov.gitcoin.co/t/gitcoin-treasury-diversification/9698",
                        "https://llama.xyz/",
                        "https://gov.gitcoin.co/t/2022-roadmap-2022-goals/9613/3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.009064913844325
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#35",
                    "likes": "3",
                    "time": "09/05/2022-18:06:51",
                    "content": "Hello, Kevin. Not an native english speaker, but that was my point… I was just trying to understand why budgets weren’t really an issue in the bull market vs now.      owocki:  I find asking “Why didnt my DAO prepare for bear market conditions?” to be a little like asking “Can someone do something about how fat I’m getting?” It absolves the asker of any responsibility for the situation they are in, and expects foresight & a bail-out from others (not within).   I was not in any way excluding me, I stated above that I personally reduced the budgets for the initiatives that I’m driving to the minimum. I also was one of the people that supported and promoted the idea that the FDD should maybe try find some revenue streams in order to be partially self sustainable(if possible) and for the benefit of Gitcoin. Those ideas are supported by some, but others believe that having our own revenue streams will stray us away from our goal of defending Gitcoin(which is actually impossible  , we are all here for Gitcoin)     owocki:  Does the DAO live in a world with autonomy or not? I think its time to pick a lane.  Autonomy & responsibility No autonomy & no responsibility    When you have the time, could you detail more about the implications of each scenario, would love to learn more:) Thanks for the links, will give them a read. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.727398989898989
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#36",
                    "likes": "2",
                    "time": "09/05/2022-18:26:24",
                    "content": "    ZER8:  I was not in any way excluding me, I stated above that I personally reduced the budgets for the initiatives that I’m driving to the minimum.   Thanks for responding and the clarification.  Maybe something lost in translation! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#37",
                    "likes": "0",
                    "time": "09/05/2022-18:30:32",
                    "content": "No  Not at all, but good point maybe if all of us actually voiced that and didn’t join the euforia, we wouldn’t be in this situation.     ZER8:  I actually asked for the minim minimorum that we need to get things running and ensuring that we can meet our goals   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#38",
                    "likes": "3",
                    "time": "09/05/2022-20:54:51",
                    "content": "What I can do to help with the current market and reduce our spending (Only for the ASOP + Human Evaluation) Instead of scaling up the team I will limit it and reduce the Numbers or contributors/Human Evaluators to 5 only. Here is a brief resume of what I am anticipating: Breaking down GR13: Total amount of contributor: 35 35 x 500$ = 17,500$ (± 11,000 Evaluations) (300 Evaluations each) Poap creation (Bounty): 250$ Workshop session: 2 35 x 50$ x 2 = 3,500$ Total: 21,250$ Breaking down GR14: Total amount of contributors: 5 12,000 Evaluation / 60 Minutes = 200 Hrs 200 Hrs / 5 Human Evaluators = 40 Hrs 40 Hrs / 5 Rounds (June 9, June 11, June 13, June 15, June 17) = 8 Hrs Non-Stop For each Day 40 Hrs x 60?$/Hrs = 2,400$ x 5 = 12,000$ Poap Creation (Bounty): 250$ Workshop session: 2 5 x 50$ x 2 = 500$ New Total: 12,750$ Amount saved: 8,500$ This is of course only an small-scale of the total amount that we are requesting. I’ll need to work on the operation side to see where we can cut the budget. Writing this here in the hope that this will help other to do the same with their own initiative, if not, then we might have to lay-off contributors or even partially remove some initiative/inventiveness. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.052698032961191
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#39",
                    "likes": "3",
                    "time": "10/05/2022-04:10:04",
                    "content": "Jumping in to provide my two cents as I go through all the proposals. This is probably the toughest proposal of them all for me to review & comment on. On one hand, FDD does important work that is critical to our mission. On the other hand, I share the concerns raised by others around FDD’s rising costs. I agree with the assessment that FDD is a cost center - if we didn’t have the problem of sybil attacks, we wouldn’t spend money on fraud detection; it is not GMV-generative. This view is reinforced by FDD’s own stated workstream mandate - “defend Gitcoin from threats”; it’s here to protect downside, rather than to generate upside. And that’s just fine. Being a cost center is by no means a bad thing, and doesn’t make the work FDD does any less important - calling something a ‘cost center’ shouldn’t be viewed as an attack or as a diminishing sentiment. Without the work FDD does, we would not have a viable grants program. Sybil resistance is work to be extremely proud of. That said, I do worry about FDD’s rising costs, and frankly, the budget request and supporting documents are extremely cumbersome to review - after going through them all, I still don’t feel confident in having a clear assessment of this workstream and what, at a macro level, FDD is building towards. I feel like I need someone to summarize it all for me - and that shouldn’t be the case, given how closely I work with FDD. I believe others have shared similar feedback, and so I will wait to see what the resolution is before making a decision on voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.671875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#40",
                    "likes": "1",
                    "time": "10/05/2022-16:01:50",
                    "content": "    annika:  I agree with the assessment that FDD is a cost center - if we didn’t have the problem of sybil attacks, we wouldn’t spend money on fraud detection;   Yes, and… Sybil defense is an unsolved research problem with a total addressable market of everyone on earth and not a person more! When we find solutions for unsolved problems with a large TAM, should we generalize the solution and have Gitcoin invest in it, or even own it outright? Should we only allow certain workstreams to do this? I guess I only agree that it is not gross GMV generative if you don’t consider a fair mechanism to be something that attracts more participants.     annika:  This view is reinforced by FDD’s own stated workstream mandate - “defend Gitcoin from threats”; it’s here to protect downside, rather than to generate upside.   This should have the … before and after  “…defend Gitcoin from threats…” The full mandate, unchanged since the first budget passed has been, “Defend Gitcoin from threats to it’s legitimacy, credible neutrality, and sustainability”     annika:  Being a cost center is by no means a bad thing, and doesn’t make the work FDD does any less important - calling something a ‘cost center’ shouldn’t be viewed as an attack or as a diminishing sentiment.   I do not view it as an “attack”. It is an invalid statement in my opinion.     annika:  Without the work FDD does, we would not have a viable grants program.   Yes. Then please explain why every other workstream should have higher budgets if this is true? Honestly not trying to be snarky here, I’d really like to know how we consider every other workstream’s work to be more important than dealing with this existential risk. (Considering @kyle is asking for a 40% reduction) Especially when you consider it is an unsolved research problem with a red-team blue team aspect continually changing the strategy and it is core to the grants 2.0 roadmap. With a cost center, you can set and maintain a strategy. With this work, we have to innovate every round and try to stay ahead of the attacks as the honeypot gets larger and larger.     annika:  That said, I do worry about FDD’s rising costs   In relation to what? Other workstreams? We have a lower rate of increase than the majority. Last season? We lowered our rate of increase from 30% to 9%. Something else?     annika:  the budget request and supporting documents are extremely cumbersome to review   We found last season that although we have clear round over round metrics and seasonal objectives along with specific deliverables, people DO find it confusing still. That is why we added the storytellers stream. It is not redundant with MMM because they are not close enough to the work to explain it. We would work with them. It is a small amount to make sure the rest of the DAO does not rob itself of impact, efficiency, ethics, and income, by simply not understanding our work which is admittedly more complex than most other streams. (Again, the problems we are working on are complex)     annika:  I feel like I need someone to summarize it all for me - and that shouldn’t be the case, given how closely I work with FDD.   So we should or shouldn’t do our storyteller initiative to help communicate this? Would we want the DAO to vote no to funding us because the work we do is in a complex domain and no one has the time to learn about it?  In conclusion I would love to talk with you about each initiative. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.441991341991343
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#41",
                    "likes": "2",
                    "time": "10/05/2022-19:49:18",
                    "content": "I really appreciate the thoughts from @annika and agree with so many points she made: 1 - Being a cost center is not a bad thing, and shouldn’t be viewed as a criticism 2 - It’s been difficult to navigate the story line on the value being delivered 3 - Sybil defense is important work and needs to be part of any QF round For my own edification I have tried to break down the core work FDD does 1 - Primary scope: 1.1 - Defend Grants Rounds from Sybil Attacks 1.2 - Review Grants to confirm compliance to our rules/policies 1.3 - Defend against collusion attacks 2 - Secondary scope: 2.1 - Generate ML models to run programmatic sybil detection (using the centralized data set, and a growing on-chain data set) 2.2 - Conduct human review of potential Sybils 2.3 - Build/invest in tooling to make 1.1 and 1.2 more scalable and approachable 2.4 - Invest in OS and working norms (and operations) for the workstream Is this accurate? I am trying to keep this as “pure” of a scope as possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.654513888888889
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#42",
                    "likes": "2",
                    "time": "10/05/2022-20:07:06",
                    "content": "    kyle:  Being a cost center is not a bad thing, and shouldn’t be viewed as a criticism   I do not view it as a criticism, but as an inaccurate description or at best, part of the story.     kyle:  It’s been difficult to navigate the story line on the value being delivered   We thought so too, so we added a very small budget to be intentional about this during s14.     kyle:  1.1 - Defend Grants Rounds from Sybil Attacks   This is not only for today, but for tomorrow. The ASOP could run without innovation, but it would cease to be effective. We HAVE to innovate every round to keep up with the red team and larger rounds.     kyle:  1.2 - Review Grants to confirm compliance to our rules/policies   Looking at this from a grants 2.0 perspective, we need to give communities who use or fork grants 2.0 a way to be credibly neutral. This is a wildly subjective area     kyle:  1.3 - Defend against collusion attacks   I don’t think the grants 2.0 architecture will solve this through “policy” but rather by giving communities tools to provide legitimacy (sybil defense) and credible neutrality (community consent). These communities would then compete for mechanisms that truly work better for their participants. Basically, our longer term strategies for sybil and grant eligibility have a by product of collusion protection, but this has not been a focus in the last few rounds.     kyle:  Generate ML models to run programmatic sybil detection (using the centralized data set, and a growing on-chain data set)   For grants 2.0, users will have a dPoPP. By integrating many services, they will be able to participate meaningfully. By only allowing them to advance by integration, we would be putting new users at a disadvantage in the system. How might we provide the new and disadvantaged users the same access to the system. (That is the point afterall) Our job is to find a way to decentralized the inputs, remove PII from the equation, and still be able to make sense of the rich history of participation users will acquire on dPoPP.     kyle:  Conduct human review of potential Sybils   This is done so algorithmic bias does not co-opt our system. We don’t have a steady true state for what is sybil. If we had zero ethical concerns about the bias of our algorithms, we could remove this, but I think it is best thought of as part of 1.1.     kyle:  Build/invest in tooling to make 1.1 and 1.2 more scalable and approachable   And reduce unwanted bias. Additionally, I think providing a solution which includes legitmacy and credible neutrality to any ecosystem who starts a round is a part of grants 2.0, not just an accessory. If we hand them the 2.0 rails without this protection, they may use 2.0 and get worse results than legacy systems. The reason a community would want to use grants 2.0 is to allocate better. It’s like selling a car without tires. Sure, you can do that, but good luck!     kyle:  Invest in OS and working norms (and operations) for the workstream   Yes. Can we make sure that the machine building the machines of legitimacy and credible neutrality are sustainable without key man issues. Lastly, the desire to define innovation as secondary for FDD is not realistic. Each round the attackers advance their strategies and we need to innovate ours to be effictive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.952393250688706
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#43",
                    "likes": "7",
                    "time": "10/05/2022-21:18:07",
                    "content": "I’ve gotten feedback about people not understanding what is going on in the workstream. It seems that there are many impressions about what the stream is, or should be, but they have missed the ongoing effort due to our having too much content to review. “I feel somewhat DDos attacked when I read FDD budget” Here are a few ways to look at it. First, check out this explainer from Octopus octopus Thoughts On FDD - YouTube Next, you can see how evolution is more about understanding what we did the last round, finding what is and isn’t working, and then converting to a better overall process. It is not redundant with DAOops.  FDD Control Flow1918×1360 104 KB  Here we show which squads focus on executing this round vs innovating and if they are about efficiency or decentralization.  Gitcoin Weekly Workstream update (1)960×540 64.1 KB  This shows our essential intent agreed upon by CSDO and how each FDD squad fits.  Gitcoin Weekly Workstream update960×540 65.7 KB  Then we connect which squads are related to which aspects of GitcoinDAO.  Gitcoin Weekly Workstream update (2)960×540 58.7 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.441666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#44",
                    "likes": "1",
                    "time": "11/05/2022-15:47:47",
                    "content": "This is a step in the right direction - I really appreciate the bucketing - but I still feel a little DDoS attacked (to steal anon’s on-point wording) even when looking at this view. I said this to @kishoraditya just now about something else - “I think the challenge with FDD’s “at a glance” stuff so far is that it’s still quite complex - e.g., the bucketing of what FDD is focused on in the four buckets is a step in the right direction, but understanding 30 broad strokes bullet points and what’s underlying them is still far, far too granular / lacking context to be a summary” As a Steward coming in to review this, my head goes towards:  What are the top 1-2 priority / impact items in each of the four buckets? What is the resource allocation / rationale for each of those?  That is where I would want to start to make sure I’m understanding & agreeing with the most critical items. Beyond that, as a Steward, I care less about understanding the long-tail (unless, of course, it’s taking up substantial budget - in which case I would want to go into its rationale, but only after understanding the core pieces). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.659920634920635
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#45",
                    "likes": "1",
                    "time": "11/05/2022-16:54:49",
                    "content": "I know FDD is taking a lot of steps to evaluate where changes can be made. I appreciate the work and contemplation. I am still not sure how to vote until the final thoughts are shared (I think FDD is going to revise again tomorrow after an internal meeting per my conversation with Joe). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#46",
                    "likes": "2",
                    "time": "11/05/2022-21:38:01",
                    "content": "\\     kyle:  DD is a cost center, like DAO Ops and should be focused on maintaining as slim of an operating budget as possible. Gitcoin seems to be paying for the education and advancement of a number of ideas - Sybil DAO, Most of “Evolution”, Catalyst, etc. without any discernible increase in value being delivered back to the DAO. Cutting most of “Evolution”, scaling back “Sybil defenders” and doing a deeper dive on the value of GIA would be valuable   Thank you on behalf of the GIA   We appreciate your praises and the fact that you have noticed us  means we are getting stuff done and that’s nice…we have actually worked a lot and also put in a lot of passion, late hours and brain matter  into defending Gitcoin from threats to its credible neutrality. It’s not easy for us to make friends when our mission is to maintain fairness  (in the degree that we can and are allowed). We are decentralizing more and more each round and building, modelling based on our results. We work very closely with the “Sybil defenders” and the data science @omnianalytics have been slowly but surely  building on our results. We are working to become a fine tuned machine that has the purpose to integrate with Grants 2.0 It’s not healthy to compare things, but I was want to give this as an example: I personally help out with the MMM(because I love it) pro bono because I like co-hosting and participating in fun events that are beneficial for Gitcoin and the web3 space overall. I don’t have the deepest understanding on what’s going on over there, but I do find it intriguing that the MMMs budget is a decent amount and it was approved by almost everyone, which signals that the work and outcomes generated by them are visible, while it seems that our collective work in the FDD has not reached the same level of awareness…   Tough times, we will make it through.   I apologize for all my “emotion” filled posts and thank you for all the work you are doing! Without the collective efforts of the Gitcoin core team we would not be here and we should also remember that  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5228174603174605
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#47",
                    "likes": "10",
                    "time": "12/05/2022-15:44:06",
                    "content": "    ZER8:  which signals that the work and outcomes generated by them are visible, while it seems that our collective work in the FDD has not reached the same level of awareness…    AGREE.  FDD is working on a revised budget. Hopefully to post on Friday 5/13 with input from other leadership in Gitcoin. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#48",
                    "likes": "1",
                    "time": "16/05/2022-15:32:20",
                    "content": "We have decided to go back to the drawing board rather than push forward a proposal which doesn’t take the current situation into consideration. We would love to get more feedback from you here: https://snapshot.org/#/gitcoindao.eth/proposal/0x332237cf15443ea727e914431b9d916aa2b72d421ce1fa2f8165cc7774dbde0e Simply select the squads or principles you agree with and vote to help us get an understanding of what is most important to you. We hope to ratify an updated budget request by Thursday, May 19th. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.357142857142857
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#49",
                    "likes": "6",
                    "time": "16/05/2022-17:04:42",
                    "content": "    DisruptionJoe:  We have decided to go back to the drawing board rather than push forward a proposal which doesn’t take the current situation into consideration. We would love to get more feedback from you here:   hey Joe, voter turnout on this looks a bit low.  i wonder how we can get that up. there are many options in the poll, which can be complicated for stewards to wade through. from speaking with stewards, i perceive that many of them would be aligned with the following:  lean Grants 1.0/ GR14 sybil protection & grants approvals Grants 2.0 rebuild for decentralization/protocol-centric fraud defense  i wonder if a more thematic poll with fewer options would yield more turnout? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/danlessa",
                    "index": "#50",
                    "likes": "10",
                    "time": "18/05/2022-20:07:31",
                    "content": "Hey friends on GitcoinDAO  Sorry for the late comment. I’ll express my contribution which will make the case towards us exploring what it takes to push for more evolution and how this passes through sketching how a Sybil Detection DAO could look like, as we can and should perform incentive alignment around our ultimate goal of providing Web3’s best Sybil Detection as a Service.  Most of the current function as well as some challenges of FDD has been described in the discussion here. FDD performs a critical function in GitcoinDAO, as Sybil Resistance and Collusion Resistance are critical for the legitimacy of Grants. This is done through a series of increasingly sophisticated processes that have been developed by the entire FDD group since before the DAO was created, and required because our ecosystem demands ever increasing technical excellence with no compromises whatsoever on transparency, decentralization and community ownership on the input, process and outcome. It has been a process of pioneering both in how we organize (governance of algorithmic processes - i.e. the machine learning pipeline), and how we detect and defend against sybil attacks and collusion (governance by algorithms, in a DAO). Going deep and evolving this critical function is not easy nor trivial, and it can be far from sexy when scratching the surface of what it should be. After all, it is about the ongoing operation and maintenance of GitcoinDAO as infrastructure. It also requires domain expertise to develop, operate, iterate on, and maintain the machine learning sybil detection pipeline. Additionally, FDD has arguably managed to create one of the most distinctive initiatives on Web3 so far in terms of real-world Sybil Account Detection - one of the space’s biggest challenges, especially where quadratic voting is employed. The unique blend of experts together with the holistic / integrated processes that were battle-tested on one of the Web3 mostly used platforms is certainly something to be proud of. Something that can also be leveraged and used by all value-aligned platforms on which their success depends on reaching out to real users without compromising on their privacy or incentive alignments.  Given the above considerations, it can be helpful to also share some thinking about what can be a possible strategic direction and a proposal for next steps. We want to ensure FDD and GitcoinDAO have incentive alignment AND functional alignment to defend against sybils. I have written a tale below that provides an analogy for what is functional alignment in this case. We think it could be possible for FDD to evolve further from a GitcoinDAO core team, to become its own DAO that is a service provider to Gitcoin, and potentially other DAOs. FDD is a critical function for DAO maintenance (especially with Quadratic Voting), but it also may likely be a useful service to other DAOs, which would reduce cost dependencies on GitcoinDAO. This being true, then it could be the best long-term sustainable path by both improving the sybil detection (through bi-directional interface points with other data partners) and reducing the cost to GitcoinDAO as various ecosystem partners will be involved in the usage and cost sharing on this new Sybil Detection DAO.  The next step is to Explore. To sketch how it could look like and to map its limitations and opportunities. To discuss as much as possible while there aren’t points of no return. To have a document which allows the community at large to constructively criticize and reject in detail or in its whole form. This is the core intent and function of the SDD work-stream, and it is expected to take the following form:  Deliverable: A written briefing report that includes:  Definition of a clear purpose and functional remit for SDD Diagrams/sketches of potential SDD token governance and economic systems Summary of the results of discussions with potential data partners and scoping of bi-directional interface points Description of a technical roadmap for making SDD viable Recommended next steps   Method: a 3-phase process, on which:  Phase 1: Freestyle sketching  A strawman sketch will be produced based on the combined knowledge of how the SDD + ecosystem tech & dynamics is playing right now.   Phase 2: Intense Iterations  The strawman sketch will pass through extensive review from SMEs to ensure that its cohesive and viable   Phase 3: Polish & Communicate  The iterated document will be transformed and published into an form that invites public-facing iterations & criticisms       I hope these thoughts help share the broader context going into this function, its value to GitcoinDAO and the broader ecosystem, and the potential strategic direction.   Extra: The Tale of the Decentralized Common Goods Factory and its own Sybil Detection Generator (If is too wacky, replace DCG Factory → Factory, and Sybil Detection → Electricity) Let’s imagine a fictitious factory. The Decentralized Common Goods (DCG) Factory, which is owned and managed by the diligent Quadratic Bot, which concerns itself only with maximizing the quality and the positive externalities of what’s being produced. Quadratic Bot knows that the DCG Factory consumes a lot of Sybil Detection energy, and in order to have consistent production results, he decides to purchase and operate its own Sybil Detection Generator, which provides this critical piece of infrastructure to the factory to be autonomous. At some point in time, Quadratic Bot decides that the factory should be less monolithic and that its core functions should be more decentralized and autonomous. As a result of that, the Sybil Detection Generator now has its own manager: Not-Sybil. Not-Sybil, which is as diligent as Quadratic Bot, also only concerns himself with the quality and the positive externalities of what’s produced too. The product in this case is delivering the best Sybil Detection to his users. As the DCG Factory is decentralized and open-source, the commoners of the local village quickly take notice of all the innovation happening inside it, including the Sybil Detection Generator, which is tailored end-to-end for being as optimal as possible for its function. Not-Sybil, observing the demand for Sybil Detection and taking in mind his mission of maximizing positive externalities, decides that it can be a good idea to expand the Sybil Detection Generator capacity and technology for more deeply integrating with the community demands. Quadratic Bot is enthusiastic, but this capacity is way more than he needs, and it is not obvious how the payoff is going to be in terms of the quality improval on the factory products. It may even be a distraction. Quadratic Bot and Not-Sybil are intertwined in a dilemma. There are no questions about the history and the ownership: it was Quadratic Bot who bought and took the risk for the Sybil Detection Ownership. But now that it is being managed by Not-Sybil, the goals are different. Quadratic Bot wants the generator to provide critical services. Not-Sybil wants the generator to provide the best services. How do we untangle that? One option is to re-absorb the Sybil Detection Generator under the Quadratic Bot guidance and dismiss / re-educate Not-Sybil. Make it provide the critical service again. Another one is to imagine a future where the Sybil Detection Generator becomes its own autonomous organization. On which Sybil Detection is also a decentralized common good product too, which is used as a critical service by multiple villages and projects. The future is uncertain and risky. Discovering and mapping it beforehand, and making explicit the landmarks and obstacles can allow for us to have a grasp of the journey without taking points of no return. ",
                    "links": [
                        "https://gov.gitcoin.co/t/proposal-fdd-season-14-budget-request/10658/16",
                        "https://gov.gitcoin.co/t/the-new-grants-protocol-flywheel/11769/8"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.894779977304249
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#51",
                    "likes": "6",
                    "time": "18/05/2022-20:25:55",
                    "content": "Wow, love that post and the storytelling inside… Feels like Ethereum and Ether, or a car can’t run without gas/electricity. Nothing much to add here but really enjoyed to read this @danlessa    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#52",
                    "likes": "6",
                    "time": "18/05/2022-21:27:24",
                    "content": "So FDD had some autonomy and realized it could make a bigger impact on GitcoinDAO’s mission by expanding positive externalities outside of Gitcoin, and this is the misunderstanding. GitcoinDAO stewards may see FDD going outside it’s critical mandate as not within it’s mandate. While FDD may see it as serving GitcoinDAO’s mission better. The way we solve this is to transparently and publicly discuss the situation. Perhaps FDD should lose some autonomy and scope as to not confuse the stewards, but then it should probably also spin out sybil detection DAO to serve Gitcoin’s mandate if the Stewards agree that it has value and fits within the GitcoinDAO scope. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.51948051948052
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#53",
                    "likes": "6",
                    "time": "18/05/2022-21:47:23",
                    "content": "We plan on making a new budget request using this framework if ratified by FDD source council tomorrow.  FDD Budget • Gitcoin Holdings - Google Chrome 2022-05-18 at 2.54.35 PM2168×1409 260 KB  I would say options 4,3,2 are all part of FDD’s critical mandate only on a short, medium, and long term timeline. Option 5 includes the concept covered succinctly by Danilo above. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.071969696969697
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#54",
                    "likes": "7",
                    "time": "19/05/2022-10:55:56",
                    "content": "Translated into hype slang: Vote for the FDD Starter Pack Vote for the FDD Premium Pack Vote for the FDD Full Pack Vote for the FDD Full + Expansion Pack  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#55",
                    "likes": "5",
                    "time": "19/05/2022-19:31:55",
                    "content": "One more refinement before we post, hopefully tomorrow.  FDD Budget • Gitcoin Holdings - Google Chrome 2022-05-19 at 1.28.38 PM1892×1250 206 KB  The voting will ask voters which option they would fund at the highest level. Then votes will be added from higher levels to the lower levels. If Option 1 has 1 million votes, and option 2 has one million votes, then option 2 will be considered to have 2 million votes. Then, if option 3 had one million votes, it would be considered to have 3 million votes, enough to pass quorum, therefore option 3 would win. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#56",
                    "likes": "3",
                    "time": "20/05/2022-18:23:47",
                    "content": "Started a new thread with the new proposal [Proposal] FDD Season 14 Budget Request ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#57",
                    "likes": "2",
                    "time": "24/05/2022-21:07:44",
                    "content": "@kyle I’d love to get your thoughts on this. I think the sybil detection DAO plan could potentially be the driver of dPoPP adoption. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#58",
                    "likes": "2",
                    "time": "26/05/2022-14:55:40",
                    "content": "I think maybe in the medium term it could be… We have a need in serving Gitcoin’s use case first (and driving adoption that way). As mentioned previously, I see this as a crawl → walk → run approach. lets solve our need, using the protocol (and developing the protocol) before we turn outward for customers and guidance. Gitcoin Passport is like a baby bird. We are not ready to throw it out of the nest, but we do see a big blue sky of potential. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.986111111111111
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#59",
                    "likes": "3",
                    "time": "26/05/2022-16:17:47",
                    "content": "    DisruptionJoe:  @kyle I’d love to get your thoughts on this. I think the sybil detection DAO plan could potentially be the driver of dPoPP adoption.   IMO this is going to require less data science/ML focused, more devrel, marketing, mechanism design, fraud detection + remediation + governance management.  would be interested to build a strategy around it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#60",
                    "likes": "3",
                    "time": "26/05/2022-16:24:51",
                    "content": "Maybe this round isn’t the time to officially put budget towards it, but if we did the initial discovery this round, it could be great timing. We will keep it an option on the vote. Here is what we would do if it was voted for:  Problem Narrative In order for a borderless democracy on the internet to succeed, it will require sybil resistance. Gitcoin Grants has shown us that the machine learning detection models can scale, but it does not provide a sustainable source of funding to build a digital public infrastructure.  Solution A model for launching Sybil Detection DAO (SDD) needs to be designed. This begins with standing up supply side microservice subDAOs specialized in incentivizing one behavior. FDD will use funding from Gitcoin and potentially other grants to fund the contributors to build these microservice subDAOs while earning governance in the future Sybil Detection DAO via an issuance curve.  Season 14 Deliverables  Reaching potential data partners and scoping bi-directional interface points  Interface point 1: Data flows Interface point 2: Token/governance flows PoC Use Case: Bright ID   Sketching and modeling potential SDD token governance and economic systems  Include how microservice subDAOs would be embedded in the scheme Include budget estimates for operational costs for 1 year Mapping of microservice protocols to launch prior to SDD with roadmap   Description of a technical roadmap for making SDD viable  How incentive mining might perform in SDD microservice subDAOs System engineering graphic identifying inputs and outputs   Research and recommendations for legal “container” Research and describe integration points between SAD, SDD, and dPoPP  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.257352941176471
                }
            ]
        }
    ],
    "group_index": "78"
}