{
    "poll_list": [
        {
            "id": "0x643408b11f50d57c027f49f7e13246bd7d84a1fca863f71d165b80074dbe2c4d",
            "title": "Moonshot Collective S15 Budget Request",
            "discussion": "https://gov.gitcoin.co/t/s15-proposal-integrated-moonshot-collective-budget-request/11214",
            "body": "This vote is looking to pass the S15 budget for Moonshot Collective (MC).\n\nAmount: The total amount requested from the treasury is $248,220, to be paid in GTC.\nThe GTC total will be determined, based on (a) the current market price of GTC at the time this proposal is moved to Tally, and (b) the remaining balance in the MC Multisig (which will determine how much net new funding we require).\n\nTLDR: The newly defined Purpose & Essential Intents (EI) of GitcoinDAO enabled the Moonshot Collective (MC) to focus on initiatives that advanced those EIs in Season 14. This budget request is to fund the MC community (2 lean teams of 1 PM & 2 devs) to be the first to build on the Grants & Passport protocols. We plan to build composable modules that are valuable to those protocols and its design partners. These composable modules were identified as the most valuable through a collaboration w/ the Gitcoin Product Collective (GPC) workstream.\n\nOverall, the impact/value of our work will help ensure the protocols are approachable, drive adoption of the protocols and increase financial sustainability through increasing GTC Utility.\n\nFor more details, please see this post: https://gov.gitcoin.co/t/s15-proposal-integrated-moonshot-collective-budget-request/11214",
            "choices": [
                "YES",
                "NO",
                "ABSTAIN"
            ],
            "scores": [
                9274727.200464047,
                808.736972883598,
                25001.1
            ],
            "start": 1660599000,
            "end": 1661031000,
            "snapshot": "15348359",
            "state": "closed",
            "author": "0x748dF7c92687A7acA7c1ac81b1cDC2A3995581b9",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "Moonshot Collective S15 Budget Proposal",
            "date": "Proposed on: Aug 22nd, 2022",
            "yes_votes": "5.24M",
            "no_votes": "0"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/s15-proposal-integrated-moonshot-collective-budget-request/11214",
            "title": "[S15 Proposal - INTEGRATED] - Moonshot Collective Budget Request ",
            "index": 11214,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "Moonshot",
                "contributors",
                "stewards",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/GTChase",
                    "index": "#1",
                    "likes": "6",
                    "time": "02/08/2022-14:22:07",
                    "content": " Moonshot Collective Season 15 Budget Request  Essential Intents: For Season 15 Moonshot Collective (MC) will focus on adding value to Gitcoin DAO through product innovation and experimentation to the following Essential Intents (EI):  Protocol Adoption (Passport + Grants) Financial Sustainability (GTC Utility)   TL;DR The newly defined Purpose & Essential Intents (EI) of GitcoinDAO enabled the Moonshot Collective (MC) to focus on initiatives that advanced those EIs in Season 14. This budget request is to fund the MC community (2 lean teams of 1 PM & 2 devs) to be the first to build on the Grants & Passport protocols. We plan to build composable modules that are valuable to those protocols and its design partners. These composable modules were identified as the most valuable through a collaboration w/ the Gitcoin Product Collective (GPC) workstream. Overall, the impact/value of our work will help ensure the protocols are approachable, drive adoption of the protocols and increase financial sustainability through increasing GTC Utility.  Amount MC is requesting $406,254 to fund our workstream and its initiatives for season 15. This includes 3 new salaries from holdings, but still is a 10% decrease vs. our S14 requested budget of $450,254. This is a net new request of $260,353 from the treasury. The GTC total will be adjusted based on the current market value at the time this proposal is moved to Tally. The vote will be to send the requested $USD amount in GTC at the lower of the current price or the 20 day moving average, whichever is lower.  Season 14 Milestone Report MC Treasury + Spend Update      USD GTC DAI     Season 14 projected spend $450,254 81,864 -   Season 14 actual spend $367,007 132,012 -   Funds remaining in Multisig* $346,901* 51,028 209,220    *Notes a conversion based on the price of GTC on 08/02, and will update using the lesser of spot price or 20 day moving average when proposing budget on chain. Season 14 Notable Accomplishments     Initiative/Dept   Objectives Past Season   Value Delivered    Optimism Partnership       Build trust with Optimism stakeholders to build strong + lasting partnership  Deliver products to Optimism that enable successful Retroactive Public Goods Funding (RPGF) experimentation  Enable Optimism to be a first user of the Grants Protocol      Gathered requirements needed for RPGF and built the key products that will be used to run their upcoming RPGF round (RPGF2)  Partnered with Grants protocol team to create a solution for RPGF2.   Optimism became an early adopter of the grants protocol and is a key design partner going forward      Passport + Grants Core Protocol Work       Mobilize talent to work on the highest value add items as it relates to our Essential Intents      Mobilized a full time Product Manager (PM)  and developer to help with the initial launch of Passport  Mobilized a developer on each of Grants Hub and Round Manager teams to help grow the short term capacity, while also gaining valuable context and building relationships to with a key workstream partner      Identity Staking - Continuing in S15       Contribute to GTC Utility with a staking contract that will incentivize users to stake/lock GTC  Improve the  approachability of Passport SDK/Documentation by providing feedback to GPC as the first builders on the passport protocol  Expand Gitcoin Passport by creating a new stamp integration that uses a staking mechanism as an identity provider      Defined goal/problem/scope after completing inception/discovery process to give a headstart into S15  Created an initial iIteration on a smart contract to stake & lock GTC that is reusable across future staking use cases  Consumed passport-sdk/passport documentation to setup passport stamp integration      Governance Operations Scaling   (PAUSED - refocused efforts towards DAOs EIs)        Improve governance layer to scale decision making  Improve steward engagement & preference signaling for DAO proposal funding.  Reduce time spent on decision making (# of days proposal were active before on-chain deployment)  Improve steward sentiment through an initiative survey      Modular Conviction Voting prototype which can be used as a voting strategy building block across multiple initiatives   Highlighted governance process inefficiencies and shared with stewards to better the DAOs budgeting process (improve high leverage decision making)        Season 15 Goals MC is continuing to respect the market conditions by running our workstream as lean as possible. We will have two lean teams (1 PM + 2 devs) who will run experiments and quickly and consistently ship valuable work. Additionally, we will have one developer and one product designer help GPC with core protocol work. This partnership will ensure we are building context and relationships that are important for future seasons. For season 15, we will focus our experimentation and innovation on the core protocols and ensuring they are approachable, while delivering valuable composable modules that drive adoption and GTC Utility. As we partner with other workstreams and the protocol needs become more clear, we will build a backlog of priorities to inform “what’s next” for the two lean teams. For MC to be successful, we will need to define a long term vision and roadmap that portrays how we will grow and scale over the next 6-12 months. The goal for season 15 is to provide this context to the DAO and its stewards so that future quarterly budgets can easily be aligned to the broader vision and roadmap. Season 15 Objectives and Commitments: MACI & Quadratic Voting Modules for Grants Protocol: Through the Optimism partnership we uncovered a need for them to weigh votes quadratically with the option of private on chain voting. This Initiative will build a MACI (minimal anti-collusion infrastructure) module & Quadratic Voting mechanism that enables Optimism to continue their adoption of the Grants protocol. In return it adds to the suite of modules that the Grants protocol can offer to other communities to fund their shared needs. Lastly, building modules on the Grants protocol creates a strong partnership between MC & GPC which ensures building on the Protocol is approachable. Commitments:  Build a quadratic voting mechanism that is modular and reusable in the Grants protocol Ensure user’s votes are on chain but private when using a MACI-like implementation of quadratic voting Research potential scaling issues that could come with a MACI-like implementation Continue partnering with Optimism to accurately define requirements as it relates to private on chain voting  Identity Staking: Passport is the first protocol launched out of the DAO via Gitcoin Product Collective (GPC). At the beginning of GR14, Passport replaced parts of the Trust Bonus system on the Grants platform. In an effort to extend the passport protocol, we propose building Identity Staking. Identity Staking in Passport allows for Gitcoin users to stake GTC as a sybil resistance signal. This initiative is a key component to exploring GTC Utility, building on one of our core protocols, and ensuring those protocols are approachable. Commitments:  Build a modular staking mechanism that can be used for future staking use cases, i.e. Grants curation, Grants review, etc. Improve Passport’s sybil resistance signals by allowing users to stake GTC and be read via their passport (S15 goal is to fold this signal into Trust Bonus, S16+ would be to explore an alternative to Trust Bonus) Experiment with trust bonus score impact based on GTC staked on a person’s Passport  Partner with GPC to ensure experiment findings are synthesized and shared to determine when/if to productionalize this in Gitcoin Grants programs   Partner with FDD as a stakeholder to provide sybil/fraud subject matter expertise Ensure smart contracts that will custody funds are audited before any major production usage  Core Protocol Approachability: Moonshot Collective will be the first third party community building on top of the two core protocols of Gitcoin DAO. This allows a confined/safe/internal environment to build on the protocols, while also providing feedback to GPC about our experiences building on them. This feedback will enable GPC to iterate on their documentation and SDK’s. The improved documentation & SDK’s will help ensure the community outside of Gitcoin DAO will be successful in building on the protocols in the future. Finally, this allows MC to be an extension of the Devrel function of GPC. Commitments:  Consume documentation and SDK’s as if we are a true 3rd party consumer Have a tight feedback loop with GPC to inform them of problems/successes/confusion in building on top of the core protocols Mobilize our community of builders to ensure a diverse perspective of feedback   Season 15 Budget Requirements Season 15 Operating Costs     Budget Category Description & Assumptions Amount GTC Amount USD     Contributor Compensation Accounts for 3 months of compensation for contributors who will be accountable for the success of MC and its initiatives 127,220* $349,854   Hiring Budget Accounts for  2 months of 1 new hire to fill a senior product manager / workstream co-lead role 8,824* $24,266   OpEx Accounts for fees to audit contracts that will custody funds and other product operational expenses. 7,273* $20,000   Total  143,316* $394,121    Notes a conversion based on the price of GTC on 08/02, and will update using the lesser of spot price or 20 day moving average when proposing budget on chain. Further Detail for Description and Assumptions Contributor Compensation - This includes 8 full time contributors and 1 part time contributor (see breakdown of contributors below). This budget does include an increase in spend from previous seasons as we are adding 3 new salaries ($113,254 in total) for people who have been working with Moonshot, but were paid via holdings. Each initiative will have 1 product manager (PM), and 2 developers to achieve the outcomes desired. We will also have our product designer and 1 engineer support core protocol work with GPC. Supporting all initiatives will be 1 workstream lead, 1 product designer, and a part time community + operations lead. Hiring Budget - We are seeking to hire a workstream co-lead to help shape the overall workstream strategy and provide guidance to set MC up for success as a product innovation and experimentation lab. This hire will create reusable processes to lead product teams and guide experimentation in problem spaces, idea generation and validation, structure MC for long term success, build products in the community, etc. Possible career experience includes: product management, technical leadership, innovation lab leadership & venture work. These roles should provide the meaningful experience required to co-lead MC and shape it for success. OpEx - Identity Staking will have a contract that custodies funds as it is facilitating the staking of GTC. Most of our OpEx budget request is to fund an audit of this contract. We will only have it audited if we validate the idea is worthy of being productionalized. The remainder of the funds will be used to successfully host, deploy, etc. the products built in our initiatives. Per Project Cost Allocations: Given the above structure of our budget, it may be helpful to see the costs on a per team basis, this is broken down as follows:  Quadratic Voting: 27.57% Identity Staking: 44.87% Core Protocols: 18.61%  These costs include the shared resources (design and workstream leads allocated ⅓ to each project). The remaining ~8% of our budget will be used to hire a senior PM/Workstream co-lead. The higher cost of identity staking is due to the need to audit its contract, which will custody funds. Quadratic Voting’s product manager will serve dual purpose as the workstream lead as well.  Budget Ask      USD GTC     Season 15 Total Need $394,121 143,317*   60 day reserves $180,000 65,455*   Event Allowance $21,000 7,636*   Current Treasury Balance ($346,901)* (51,028)*   Amount Requested from Treasury $248,220 90,262*    *Notes a conversion based on the price of GTC on 08/02, and will update using the lesser of spot price or 20 day moving average when proposing budget on chain.  Team Composition MC will enter season 15 composed of the following team to ensure we can accomplish our goals and outcomes over the next three months. Please note the addition of three new salaries coming from holdings and that we have reduced our headcount from season 14 to ensure we are running lean, while still being able to be successful in experimenting and shipping valuable products.   Community + Operations Lead - @michaelgreen06  (PT)   Software Developers - @jaxcoder (FT), @farque65 (FT),  @Bliss (FT), @hansmrtn  (FT), @bhargavaparoksham  (FT)   Product Designer - @willsputra (FT + new salary from holdings)   Product Manager - @brent (FT + new salary from holdings)   Workstream Lead - @GTChase (FT + new salary from holdings)   ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-digest-29-2022/11260"
                    ],
                    "GPT-summary": "The post is a proposal from the Moonshot Collective for Season 15 of Gitcoin DAO. The proposal outlines the budget request and objectives for the season, which include building on the Grants and Passport protocols, improving financial sustainability, and increasing GTC utility. The proposal also highlights notable accomplishments from Season 14 and provides a breakdown of the team composition and budget requirements for Season 15. The post does not advertise the proposal, ask for feedback, or give entirely positive or negative feedback on the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "Token economics",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.533868492618492
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#2",
                    "likes": "6",
                    "time": "02/08/2022-17:55:18",
                    "content": " MC_S152257×3468 622 KB  Visualization of the budget draft above. I intend to post these under each budget and keep them updated as proposals incorporate feedback and changes. Please reach out if you have any questions or input.         ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bhargavaparoksham",
                    "index": "#3",
                    "likes": "0",
                    "time": "03/08/2022-16:55:55",
                    "content": "Hey @Fred, why does the prev seasons budget ask chart, show, ~$80k as s15 ask? It should be ~$260k right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#4",
                    "likes": "0",
                    "time": "03/08/2022-17:09:53",
                    "content": "The Budget ask + Reserves ask is $260,353 (the light green line in the graph). Reserve ask is $180,000 Budget ask (without reserves) is therefore $80,353. i.e if the workstreams would not ask for 60day reserves the budget ask would be $80,353. The projected spend can be found just under the Objectives; $406,254 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/GTChase",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/08/2022-19:13:10",
                    "content": "Okay i think there is some confusion here across the board and i will breakdown the numbers to hopefully make it make sense. Our projected spend for S15 is $406,254… This is not inclusive of reserves as that is not a projected spend. Here is a breakdown that might clarify this all for you (same table in the proposal):  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/anneconnelly",
                    "index": "#6",
                    "likes": "6",
                    "time": "03/08/2022-20:38:09",
                    "content": "We had a good call today with Chase. One of the items we discussed was reducing the budget for salary on the new hire by 1 months pay given that they likely wouldn’t be recruited and starting until September at the earliest. Chase was in agreement and is going to make that reduction in the requested budget. Thanks for a good job Chase! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.59280303030303
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#7",
                    "likes": "5",
                    "time": "05/08/2022-13:44:55",
                    "content": "Echoing Anne’s comment, great call with Chase this week. Overall the budget is very thorough, the feedback process has been great, and Chase and Moonshot are doing all the right things to be good stewards of the DAO funding they are requesting to fulfill their mandate. I’m fully supportive of their budget and the process thus far. As a take-away from our feedback session, the stewards on the call highlighted that the Moonshot work is experimental and likely to take more than a single quarter to realize value. To help map that longer value delivery onto the quarterly budget cycle, we discussed the benefit of having Moonshot provide a broader context for their work, including more venture-oriented metrics to anchor their experiments around aspirational value generation (TAM, TVL, etc.). We recommended that the budget is updated to include a commitment to build this context documentation in S15 and to provide that context going forward starting with their S16 budget proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.576530612244897
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#8",
                    "likes": "1",
                    "time": "08/08/2022-01:50:44",
                    "content": "Overall feels like a credible proposal that reflects a tightened focus on essential intents AND on the needs we are uncovering from partners, i.e. Optimism. It is a pretty familiar pattern to see “solution engineering” teams build hand in hand w/ partners software that may or may not end up being applicable beyond that partner or customer.  As such I think the name and image of “Moonshot” may understate your value somewhat because at least in my experience - solution engineering or similar roles such as DevRel as you mention - are fundamental.  They both make big customers successful and often get to build the first versions of innovative stuff. That leads to an actual question - do we have bandwidth for the next Optimism?  Do we anticipate a similar effort to add capabilities for the next large partner or end user? Also - is Optimism contributing to the code as well?  If so, how are we managing that collaboration?   Is there a shared open source backlog I guess and a workflow for design review and so on? One cautionary tale from open source is that sometimes we can crowd out potential contributors because we don’t have time to wait for them to get up to speed.   ne thing we did in the past is we “metriced” teams based on issues that they opened that a non-employee picked up.  The goal here is to align everyone to do the extra work to leave clear footprints so the community can really take off.  Are we ready for explicit “community contribution” metrics? As you know there are a legion of them projects look at of course such as new contributors, contributor activity, and quality of contributor activity. A couple of final questions:  is the plan that MACI is handed off to GPC?  if so, when? are we able to track which issues result in non Gitcoin PRs? why 2 PMs?  I’ve seen PMs able to handle 2 small teams, and these are small teams (i.e. only 2 devs).  Do you need 2 PMs for 4 engineers? in your role as first customer shipped & DevRel - is there any overlap w/ others in Gitcoin?  Do we have devrel engineers elsewhere helping contributors & users get up and running, close their first issue, and so on?  I’m not assuming it would or should sit in Moonshot. could you metric what success looks like in your role as first customer shipped?  Anyway, very exciting evolution of your role and congratulations on your collaboration and innovation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.610980685980685
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#9",
                    "likes": "1",
                    "time": "08/08/2022-15:24:07",
                    "content": "Sharing the appreciation for the great call with Chase last week. Though the proposal itself is clearly written, the opportunity to dive a little deeper is always helpful. Overall, I think the Moonshot S15 budget is lean and that its focus on composable modules that support G2.0 is the right direction. Something I appreciate about Moonshot, is the team’s nimble decision making – the most recent example being pausing modular conviction voting prototyping in favor of more essential work. I hope to see more workstreams demonstrate this way of thinking in S15. My one hangup is the need for a new Sr. PM/Co-Workstream Lead hire. During our call, Chase explained that this hire would compliment the skills already existing on the team.  In the grand scheme, this is a relatively minor seasonal cost at around 6% of the overall budget, but it’s also unclear whether Moonshot will find that person this season or if they’ve explored other ways of solving this problem outside of a direct new hire.  Which raises another concern. Though I respect the strong stewardship over the DAO’s treasury with the conservative budgeting of this line, I’m concerned that Moonshot won’t actually find the profile of candidate they’re looking with what’s budgeted. The current U.S. average for this role is around $145k vs. the annualized $97k budgeted. DAO Ops just went through a similar exercise where the level of experience we needed didn’t align with what we budgeted for the Treasury Lead role. Ultimately, with @kyle’s support, we found other ways to make good on our S14 commitments to the DAO, but it was a lessoned learned, so I share it here (and hope I’m proven wrong)  . I’ll end by saying, I’m looking forward to seeing all that this lean, mean team accomplishes in S15 and beyond. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.55892670547843
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/GTChase",
                    "index": "#10",
                    "likes": "1",
                    "time": "08/08/2022-15:50:23",
                    "content": "Moonshot has taken the feedback from stewards and have integrated the following feedback:  Updating hiring budget for only 2 months of budget for the person to be hired rather than 3 full months. This was due to the fact that we wont be able to hire this person until September at the earliest. Dropping the budget by ~12k Expanded on the person to be hired to highlight what skillsets and experience we are looking for Included a commitment in the Season 15 goals section to highlight MC documenting and sharing a longer term vision that can be used for broader alignment on these quarterly budgets  With that said, this proposal has now moved to “INTEGRATED” and still open for all the feedback in its state! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.604166666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/GTChase",
                    "index": "#11",
                    "likes": "0",
                    "time": "08/08/2022-16:13:21",
                    "content": "Thank you for the detailed response and questions regarding our S15 budget! I think you raise fair points and actually highlighted a lot of the value Moonshot looks to add in the coming season. Below i have answered some of your more specific questions and feedback items.     epowell101:  That leads to an actual question - do we have bandwidth for the next Optimism? Do we anticipate a similar effort to add capabilities for the next large partner or end user?   Our capacity to start will be used in working on Quadratic Voting which will be important to Optimism and other partners that want utilize Quadratic Voting while running their grants rounds. So, we wont have the capacity immediately to take on the next module for a key partner. With that said, we expect to stay close to GPC and build a prioritized backlog of valuable work GPC learns about through their design partner research. This work will feed the two teams as they complete these initiatives and expect similar level of efforts for composable modules.     epowell101:  Also - is Optimism contributing to the code as well? If so, how are we managing that collaboration? Is there a shared open source backlog I guess and a workflow for design review and so on?   So in season 14, the partnership with them was focused on an experiment for Retroactive Public Goods funding. The code that was contributed for that was Moonshot (contract and requirement gathering), GPC (round manager and grants hub contracts and front end), and Optimism (front end and decision making). This work was done via separate backlogs, but shared processes for review and requirement gathering via weekly synchs between all key stakeholders. In Season 15, it will only be Moonshot contributing to the code for Quadratic Voting. Wight feedback loops coming from Optimism to help drive the proper solution.     epowell101:  Are we ready for explicit “community contribution” metrics?   I think for Season 15 it may be a bit early for that as we are focusing on running lean to deliver these modules that are important to our essential intents (protocol adoption + GTC Utility).  You are highlighting our long term vision for MC, and I expect season 16 we may be more ripe for explicit community contribution metrics.     epowell101:  is the plan that MACI is handed off to GPC? if so, when?   Yes this is the plan, and we will be working closely with them throughout the initiative to ensure a smooth hand off. The handoff will happen once the code is complete and meets the needs of GPC and the key partners. Hopefully by season end.     epowell101:  are we able to track which issues result in non Gitcoin PRs?   Could you expand on this ask, specifically the non gitcoin PRs? are you referring to issues that related to the work that we may have done with Optimism?     epowell101:  why 2 PMs? I’ve seen PMs able to handle 2 small teams, and these are small teams (i.e. only 2 devs). Do you need 2 PMs for 4 engineers?   This is a fine question, and don’t necessarily agree that PM’s could handle 2 small teams. I am acting as the other PM, and while acting as the WS lead I assume many responsibilities outside of a day to day PM. So, @brent is the only full time PM and will autonomously work with the other initiative team. 1 person couldn’t fulfill the needs of a PM on 2 teams and do the work required to keep the workstream running successfully.     epowell101:  in your role as first customer shipped & DevRel - is there any overlap w/ others in Gitcoin? Do we have devrel engineers elsewhere helping contributors & users get up and running, close their first issue, and so on? I’m not assuming it would or should sit in Moonshot.   We do not have DevRel hired anywhere yet, but GPC is planning on hiring and owning that per their S15 budget. Since we are the first community building on the protocols we can help frontrun that and implement best practices ensuring they can hit the ground running. I.e. Ensuring the protocols are approachable.     epowell101:   could you metric what success looks like in your role as first customer shipped?    This is an interesting one and we absolutely plan on defining what success looks like/key KPI’s. At the end of the day we want to provide GPC meaningful feedback on the community facing documentation to ensure protocols can be approached easily. That will be done by consuming the documentation and SDK’s as a third party community, but having a tight feedback loop so those things can be iterated on. So quality of the documentation and SDK’s is where we will look to this season. The real success comes from the success of the communities building on the protocols and consuming documentation, but we wont get to realize that until future seasons. Thank you again for all the thought provoking feedback and questions. I hope this resonates with you and am happy to answer anything else that may arise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.877665245202559
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/GTChase",
                    "index": "#12",
                    "likes": "2",
                    "time": "08/08/2022-16:35:42",
                    "content": "Thank you for the valuable feedback, and raising your concerns and questions. I hope the below response helps clarify some of your concerns. Our goal is to find this person this season, hopefully by September, but we understand this is a big goal. We will be using our community of trusted contributors to help fill this pipeline with the hope of expediting the process. We will also explore other alternatives like finding someone internally or sourcing the work through composable scopes of work. With that being said, we have updated the budget to reflect 2 months of salary rather than a full 3 months. So with that consideration that actually meets the US average of 145k /year for this role. If there is any surplus due to the longevity of the hiring/sourcing cycle, that surplus will be used for future seasons budget. I hope that addresses your questions and concerns, and am happy to continue the conversation if needed! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.527777777777779
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#13",
                    "likes": "2",
                    "time": "10/08/2022-20:54:39",
                    "content": "    kevin.olsen:  Chase and Moonshot are doing all the right things to be good stewards of the DAO funding they are requesting to fulfill their mandate   I am likely biased after working so closely with the team, I want to name that upfront. I do feel this statement from Olsen is accurate. Having Moonshot collective slowdown (only two initiatives) to go fast (ramp up on the protocols) will be critical in S15. I appreciate that there has been a focus on the most important items to tackle, without a large swing on the priority list. Said differently, much of the items that were important are still important, we are just going to pace ourselves in accomplishing them given the protocol timing and support capabilities. I am supportive of the budget and I hope to help hire the folks sought to join this great team. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#14",
                    "likes": "0",
                    "time": "15/08/2022-17:49:06",
                    "content": "I have not reviewed this budget in-depth on the forum, but I’ve read the positive reviews by the other Stewards under this proposal, and I’ve also read the initial proposal during the CSDO planning meetings. Based on this I will vote yes on this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.170454545454546
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#15",
                    "likes": "0",
                    "time": "15/08/2022-19:05:50",
                    "content": "Great to see this proposal evolve after the review session with the stewards assigned. Having spoken to @Jodi_GitcoinDAO and @anneconnelly after the review - I was fully in agreement re hiring and glad to see the revision made on role planning. I am comfortable voting to approve this budget as detailed in this INTEGRATED proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/michaelgreen06",
                    "index": "#16",
                    "likes": "0",
                    "time": "15/08/2022-21:42:27",
                    "content": "Hi everyone! Our S15 budget proposal is live on Snapshot Please cast your votes before 20 August at 17:30 (ET). Thanks your time and feedback! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.965909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#17",
                    "likes": "3",
                    "time": "15/08/2022-21:52:31",
                    "content": "I’m supportive of this request because of the great work @brent and team did launching Passport and passing it over to GPC to maintain and the importance of the Optimism partnership. I do think the new salaries from Gitcoin Holdings inform my decision too. I’d like to see this workstream develop better metrics around the rate they take in new ideas, validate potential, prototype, and build MVPs in future seasons. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.4805194805194795
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#18",
                    "likes": "1",
                    "time": "16/08/2022-05:04:49",
                    "content": "I’m happy to see MC lead the charge on adopting Grants 2.0! It seems that we’re betting on token utility to come from staking mechanisms and there have been quite a few thoughts scattered across the forums (1, 2, 3, 4) To sum it up and to help frame some of my queries, utility comes from:  Staking GTC through the form of conviction voting Governance in DAOs (also beyond Gitcoin)  Utility is important because:  It will reflect demand to be a part of Gitcoin’s network It provides some buy pressure on the token  However, this is a long term idea with really no way of knowing it will work out + we’re betting the entire DAO on this. I’ve noticed that there hasn’t been a discussion of revenue and prior discussions have been seen as defecting (a spicy question as @tigress nicely put it) though I do share the sentiment that revenue is important to keep the DAO going. I think token utility is a “DARPA-hard” problem. So I’d like to provide a perspective on how one might approach it. The framework goes something like this (its a tl;dr of the article)  The DARPA execution framework boils down to showing that a vision is not impossible, showing that vision is possible, and then making it exist  To do that, having a fixed budget for ‘seedling’ projects to explore multiple pathways, having a highly technical team to scrutinise proposals, acid testing ideas, and cross-pollinating across the ecosystem is how they achieve it. I hope this isn’t too drastic, but @GTChase you could also consider framing MC as a collection of DARPA program managers that are experimenting with the idea that a token-based network could help fund public goods across ecosystems. However, I do agree with the budget for S15 to experiment with these 2 initial these put forth and would like to suggest some ways to speed it up. Firstly CLR Fund has an open source repo including elements of MACI, quadratic voting etc that we could adapt. I would suggest having a conversation with them to include that as a module and then start experiments from there. Secondly, perhaps starting some conversations about token utility so that we can frame reasonable experiments would be great. Token utility is a problem that every DAO faces so perhaps a coalition to tackle these efforts would be good rather than Gitcoin shouldering the entire burden (or resorting to ponzinomics). Some programs here 1, 2. ",
                    "links": [
                        "https://gov.gitcoin.co/t/roadmap-to-network-utility/10546",
                        "https://gov.gitcoin.co/t/the-utility-of-gtc/10071",
                        "https://gov.gitcoin.co/t/circuits-a-modular-scalable-way-to-think-about-network-utility/11085",
                        "https://gov.gitcoin.co/t/s15-proposal-integrated-fdd-budget-request/11224/8",
                        "https://www.urbandictionary.com/define.php?term=DARPA%20hard",
                        "https://benjaminreinhardt.com/wddw",
                        "https://benjaminreinhardt.com/wddw#at_the_end_of_the_day_the_arpa_model_depends_on_badass_program_managers_which_mirrors_the_obsession_with_%E2%80%9Ctalent%E2%80%9D_in_other_disciplines",
                        "https://github.com/clrfund/monorepo/tree/develop/contracts/contracts",
                        "https://ethereum.org/en/community/grants/",
                        "https://www.polygongrantshackathon.com/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.855555555555556
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nategosselin",
                    "index": "#19",
                    "likes": "1",
                    "time": "16/08/2022-13:16:32",
                    "content": "I am supportive of this budget given the positive comments reflected here and my first-hand experience of working with the MC team on the Grants 2.0 work. I think this plan reflects a strong focus and I look forward to working with Moonshot in S15. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.934343434343434
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#20",
                    "likes": "1",
                    "time": "16/08/2022-23:43:24",
                    "content": "I’m supportive of this budget after reviewing it at a high level and seeing the positive comments from stewards especially those who worked closely with the workstream on feedback. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.109090909090909
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#21",
                    "likes": "3",
                    "time": "17/08/2022-00:14:40",
                    "content": "I’m supportive of this budget and will be voting yes. In my S14 voter guide, I wrote: “As we crisp up the DAO’s Purpose & Essential Intent throughout Season 14, I am cognizant of MSC and its place in the DAO - and as we move to becoming a Protocol DAO, it’ll be increasingly important that MSC continues to drive towards outcomes that serve the DAO-wide purpose” I am encouraged since then by the leadership & diligence of MSC in adding more structure to their efforts and focusing on protocol & protocol-adjacent work over the past 3 months, while still maintaining an experimental, fast-paced innovation hub vibe. One thing I do hope to see in S15 is closer MC <> PGF <> GPC collaboration. I think we sowed the seeds for this in S14 with some great dialogue, and I’d love for us to bring some more structure & proactiveness to how these groups collaborate looking ahead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.704545454545454
                }
            ]
        }
    ],
    "group_index": "174"
}