{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-provide-token-governance-framework-for-gitcoin-grants-recipients/3247",
            "title": "[Proposal] Provide token governance framework for Gitcoin Grants recipients ",
            "index": 3247,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/paul2",
                    "index": "#1",
                    "likes": "4",
                    "time": "27/05/2021-23:21:29",
                    "content": "What Gitcoin just created with this DAO and its GTC launch is extremely powerful. Many of the public good projects that Gitcoin funds would benefit from having something similar for their own community. I propose setting up something along the lines of a 1Hive Garden as an option for projects that are ready and suitable to run their own token market. I believe this will encourage more projects to be self-sustaining more quickly. ",
                    "links": [],
                    "GPT-summary": "The author proposes setting up a token governance framework for Gitcoin Grants recipients, similar to 1Hive Garden, to encourage more projects to be self-sustaining. The post receives constructive criticism and questions from third parties, while some extend their support to the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.551282051282051
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Yalor",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/05/2021-01:29:07",
                    "content": "Are you suggesting that we create a playbook for how to DAO or something else ? We actually talked about this previously and I do agree if we had some kind of an operational manual that laid out the broad strokes and the avenues available to do so it would be a very useful tool. The question is who wants to lead such an endeavor  could be a good working group for sure, would happily consult for such a group. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending support to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.452430555555555
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/paul2",
                    "index": "#3",
                    "likes": "1",
                    "time": "28/05/2021-18:30:27",
                    "content": "I mean providing the actual framework. Gardens is close to launching and will make it easy for DAOs to set up with Conviction Voting + Social Contract + Arbitration - there are a few ways Gitcoin could integrate. I’ve been contributing to Gardens so it’s the framework I’m most familiar with, but I know there are plenty of other options too. I would be happy to help out! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.946759259259259
                }
            ]
        }
    ],
    "group_index": "385"
}