{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/builders-of-the-dao-soon/10704",
            "title": "Builders of the DAO (soon\\xe2\\x84\\xa2) ",
            "index": 10704,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "Moonshot",
                "contributors"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#1",
                    "likes": "17",
                    "time": "25/05/2022-13:53:08",
                    "content": "Builders of the DAO (coming soon™) The Why: After moonshot reorganized it was evident that we had a strong band of our community that we were not engaging with in a meaningful way. At the same time, builderband was taking polls to determine what the community wanted to focus on. After listening to both communities it became clear that they both wanted much of the same thing; to learn, teach, grow and build! At the moment, this battery of talent discusses and convenes across multiple fronts. There are three builder communities within GitcoinDAO, all having many overlapping tasks, efforts and missions. There is not enough paid work for expert levels, let alone beginners. We need to be better at retaining and engaging one of our most important assets, the “Golden Geese,” as Austin Griffith calls them.  Screen Shot 2022-05-25 at 9.49.21 AM586×529 36.1 KB   Screen Shot 2022-05-25 at 9.52.02 AM734×256 17.5 KB  The How The Moonshot collective intends to transform the community surrounding them with that of the builder band (winners of gitcoin hackathons) to become the builder community’s home in GitcoinDAO. We plan to skill up this group by delivering highly technical workshops and curated content from our partners to make Gitcoin’s builder community a unique movement within web3. In doing so, we are forming one of the industry’s most highly skilled talent pools. This evolution is not only for GitcoinDAO but also for this world’s builders more generally. Some might call it a public good? Soon we plan to make slight changes to both the Moonshot Collective Discord channels and Builderband’s to streamline communications and permissions. We plan to archive the builderband, builders-general, and the ops channels associated with that community. We will add similar channels to MC, including a builders support channel. Current and previous hackathon winners will be given the option to opt-in and we will be creating a new role specific for them. One of the most pressing concerns is that we want to ensure that the transition is smooth on both sides of this move. We realize that the product arm of moonshot is something different than the heart of this community! So instead of always telling you what moonshot product is building, let’s flip the script and provide you with the opportunities you want! Success Metrics: The key results we are chasing from this collaboration:  Create many dedicated intermediate and advanced workshops with partners Increased bounty completion rate, especially rollover bounties Community engagement in events and social content Increased reoccurring hackathon participation Internal talent pipeline of web3 builders for the DAO Increased economic opportunities for our builder community  The vision is to become the place to be for builders in the wider DAO community. Not just devs, truly cross-functional skilling up! We have various partners and a community that is more than willing to deliver this content. git skills, git frens, git coins! ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-19-2022/10737"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.056355218855218
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/michaelgreen06",
                    "index": "#2",
                    "likes": "4",
                    "time": "25/05/2022-15:07:55",
                    "content": "Excited for this new chapter of building the buidler community in GitcoinDAO! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.363636363636363
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tricelex",
                    "index": "#3",
                    "likes": "2",
                    "time": "26/05/2022-12:06:01",
                    "content": "Nice initiative from Moonshot Collective, looking forward to making this our reality🚀 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ivanmolto",
                    "index": "#4",
                    "likes": "3",
                    "time": "27/05/2022-09:29:09",
                    "content": "It is a brilliant initiative. Thank you @emudoteth for sharing in a clear and promising way. Excited for the next weeks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.574999999999999
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Stride01",
                    "index": "#5",
                    "likes": "1",
                    "time": "01/06/2022-10:12:29",
                    "content": "Nice, I love the new Approach. This will definitely help the Builders Advance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.545454545454545
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#6",
                    "likes": "1",
                    "time": "03/06/2022-14:27:55",
                    "content": "Thanks Ivan! I really appreciate the time you spent with us to help shape this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#7",
                    "likes": "1",
                    "time": "03/06/2022-14:32:03",
                    "content": "I am looking forward to making this a reality as well. We plan to ramp up throughout the month of June. One of the first things that is being planned is a technical deep dive with the nomad.xyz team, specifically how it can be used for cross chain governance! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#8",
                    "likes": "2",
                    "time": "07/06/2022-03:42:36",
                    "content": "    emudoteth:  We need to be better at retaining and engaging one of our most important assets, the “Golden Geese,” as Austin Griffith calls them.   question: if i am a builder who is loosely interested in the dao, or interested in the dao, why would i come to “Builders of the DAO”?  what is the hook?  how/when do i find it?  what are the vibes i think a KPI is “MAB - Monthly Active Builders”.  thats a simple KPI that measures how successful this is ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.608333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#10",
                    "likes": "1",
                    "time": "07/06/2022-19:45:19",
                    "content": "If you were a builder interested in the innovation of web3 and helping gitcoinDAO pursue its essential intents, why wouldn’t you want to be here? That’s the vibe. I like this KPI, it makes a ton of sense! Do you have any ideas how you would quantify this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#11",
                    "likes": "3",
                    "time": "07/06/2022-21:40:12",
                    "content": "    emudoteth:  If you were a builder interested in the innovation of web3 and helping gitcoinDAO pursue its essential intents, why wouldn’t you want to be here? That’s the vibe.   hmm… i get thats the vibe we’re going for, but what are the tangible draws that get people in the door + keep them here?  what is the engagement loop?     emudoteth:  I like this KPI, it makes a ton of sense! Do you have any ideas how you would quantify this?   monthly active developers in a monthly call?  or in a discord channel perhaps? theres probably something to learn from the attrition when ppl churn out of that ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.194444444444445
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#12",
                    "likes": "0",
                    "time": "07/06/2022-23:17:35",
                    "content": "Git skills, git frens, git coins     emudoteth:  We plan to skill up this group by delivering highly technical workshops and curated content from our partners to make Gitcoin’s builder community a unique movement within web3. In doing so, we are forming one of the industry’s most highly skilled talent pools. This evolution is not only for GitcoinDAO but also for this world’s builders more generally. Some might call it a public good?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/emudoteth",
                    "index": "#13",
                    "likes": "0",
                    "time": "07/06/2022-23:21:55",
                    "content": "My replies never appear to reply until after I delete them thinking I made an error… so just in case Builders of the DAO (soon™) - #12 by emudoteth ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#14",
                    "likes": "2",
                    "time": "08/06/2022-12:17:09",
                    "content": "    emudoteth:  technical workshops and curated content from our partners   i will be curious to see if this going to draw & retain the top builders in the space. if the engagement loops are approached with a sense of data-driven iteration & experimentation, then perhaps the organizers of this group will figure out what engagement loops (and on what cadence) would need to be there for this group to be successful ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/GTChase",
                    "index": "#15",
                    "likes": "2",
                    "time": "08/06/2022-15:09:39",
                    "content": "I would also say having meaningful opportunities for these builders to contribute to the core initiatives that are focused on gitcoin’s essential intents is another core way to attract and retain. i.e. How do we bring in the community to help build a GTC utility mechanism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#16",
                    "likes": "0",
                    "time": "08/06/2022-16:48:39",
                    "content": "    GTChase:  I would also say having meaningful opportunities for these builders to contribute to the core initiatives that are focused on gitcoin’s essential intents is another core way to attract and retain.   is there any way to surface & validate opportunities to this group? if im a member of this group, how do i know about the next opportunities? fwiw right now when i have a shower thought idea i’ll tweet it + link to a gov post/telegram group to gather people.  thats about 25% successful for validating an idea + finding a team to work on it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.535714285714286
                }
            ]
        }
    ],
    "group_index": "114"
}