{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/the-internet-of-jobs-is-here/9340",
            "title": "The **Internet of Jobs** is here ",
            "index": 9340,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "19",
                    "time": "05/12/2021-21:07:20",
                    "content": "  Screen Shot 2021-12-04 at 4.38.13 PM1292×696 74.9 KB   Screen Shot 2021-12-04 at 4.38.05 PM1348×726 79.3 KB  i’ve been talking a lot about the internet of jobs for a few months, and since doing so i’ve had a few interactions that look like this .  What is the internet of jobs? the objective of this post is to articulate the size, scale, & scope of the internet of jobs (IoJ) and produce a canonical reference for this emergent trend.  TLDR the internet of jobs (IoJ)  is going to happen. is going to happen soon. is how blockchains go mainstream. is a wide open design space. is happening already.   Details  The IoJ is going to happen. The argument from first principles:  one of the primary uses of money is the purchase of labour or skills.  what we call “jobs” blockchains create the internet of money. ergo, one of the categories of use cases for blockchains will be “the internet of jobs”   The IoJ  is going to happen SOON ICOs + NFTs + DEFI are all major use cases for blockchains that have already been proven.  They have created a multi-billion $$$ marketplace for their products, and the emergent industry around these 3 use cases has had the following externality: it created a class of knowledge worker who is crypto-native + likely paid in crypto. Many ico, nft, or defi projects have elected to organize themselves as daos.  because DAOS employ many crypto-natives, DAOs are the bootloader for the internet of jobs The TAM (total addressable market) for the internet of jobs is massive.  There are 7.753 billion people in the world, and many of them would like to earn an income.   The IoJ  is how blockchains go mainstream The median internet citizen thinks about their job, not their investments, when they think about their financial life & financial soveirgnty. For 99% of the world, their financial lives are their jobs - not their investments. For this reason, I predict that Web3 won’t go mainstream until the internet of jobs is mainstream.  The IoJ is a wide-open design space.  1. Framing The Design Space   The internet of information enabled computers to send information across a computer network.  This radically changed anything in society that relies on information. (entertainment, media, politics, social media) The internet of finance enables computers can send value across a computer network. This could radically change anything in society that relies on value transfer.  (banking, insurance, finance, art, jobs) Of course, if you were looking forward from 1997, it would be very hard to predict the rise of google, facebook, twitter, or the iPhone.  But looking forward, it feels obvios. The use cases for the internet of jobs are similar.  From 2021, its hard to predict exactly what the breakout use cases will be.  2. Some IoJ tools will be Skeuomorphic Skeuomorphism is a term most often used in graphical user interface design to describe interface objects that mimic their real-world counterparts in how they appear and/or how the user can interact with them. Whenever there is a new category of computing, the first products are usually Skeuomorphic. For example, when the internet happened, Yahoo & Google both had the same mission: to organize the worlds information.  But,  Yahoo just took the library card catalogue system + put it online. (a skeumorphic way of solving the problem) Google invented a fundamentally new way of traversing information, the search bar. (a non-skeumorphic way of solving the problem)  The lesson here is that a lot of the value that will be unlocked by the IoJ will be in fundamentally new, non-skeumorphic, use cases that deliver value in ways that are both compelling & novel themselves. An IoJ-era example of Skeumorphic vs non-Skeumorphic mechanisms:  LinkedIn is an example of a skeumorphic use case, they’re just taking resumes and putting them online.  Quadratic Funding is an example of a non-skeumorphic way of funding talented people - it just didnt (and couldnt) exist before.   3. The IoJ is not the Gig Economy A common misconception is that the IoJ will be like the gig economy.  It is true that gig sites like upwork, fiver, uber, & others have been a hallmark web2 marketplaces… But they have been limited because they are shimmed onto the old financial system + the old internet. Without Ethereum providing easy tools to make such marketplaces transparent, immutable, global, or governable by their communities, the design space was much more limited. We now have Ethereum, so we can build an IoJ that is more:   global, meaning you can participate from anywhere.  immutable, which means your assets cant be seized.  transparent, which means no more information asymmetries  governerable by communities, creating more aligned incentives.  efficient because intermediaries have been replaced with smart contracts.  The IoJ is NOT just gigs.  Gigs are part of the IoJ, but they are just one part of the design space.  4. Many important attributes will be unbundled from our legacy employment infrastructure & rebundled into the IoJ There are many important benefits that are globbed onto the employment infrastructure in much of the world.  Insurance Healthcare Retirement Protections against discrimination or other abuse Other benefits  There are also other important attributes built into the employment infrastructure of the wordl:  Taxation Regulatory Compliance Equality of opportunity Other responsibilities  These attributes will be rebundled into the IoJ. Each of these attributes are important and worth their own post. An early example of this is the Opolis employment commons, a tool that shims many of the benefits from the legacy world (insurance, healthcare, etc) into the IoJ. As the IoJ grows, new infrastructure will emerge that handles these attributes.  As the infrastructure emerges, more people will work within the IoJ, creating a positive feedback loop.  5. Articulating the IoJ value function Lets get into the fun part:  Designing mechanisms for an IoJ native world. Here is a generalized function of how ALL internet of jobs-era projects work:  token emission = f(time, materials, skills, work output, … other signals)  Read in plain english, the tokens you earn via some mechanism f, are the results of f(inputs) where inputs are the time, materials, skills, work output you create. So basically, the tokens earned are a function of the time, materials, skills, and output of your work.  Example 1: Bounties One example is Gitcoin bounties, a .  Bounties are tool to reward coders for discrete tasks that has been used 8500+ times on Gitcoin to move $5.55m+. In the bounties example, the mechanisms’ social contract is tokens exchanged for the delivery of a pull request. Expressed as the above funciton this is how they work.  token reward = a merged pull request  broken down further  merged pull request = the combination of a coder’s time, skills, and materials   Example 2: Gitcoin Grants Gitcoin Grants is a crowdfunding campaign that matches contributions to your favorite projects with funds from a pool that GitcoinDAO maintains.    Gitcoin Grants has distributed $25mm to 100s of projects, and has seen over 2million lifetime contributions In the Grants example, the mechanims’ social contract is that rewards are proportional to whether or not your peers are willing to fund your project. Expressed as the above funciton this is how they work.  token reward = sum(all crowdfund contributions) + matching_contribution  broken down further:  matching_contribution = square root of each contributor’s contribution, add these values together, and take the square of the result.   What else can be invented here? The design space of the IoJ is so fast, and the upside so large - that there is going to be a race to come up with compelling use cases to reward contributors The design space will be explored by many different enterprising projects exploring how to tune this formula:  token emission = f(time, materials, skills, output, other signals)   6. The IoJ will have many diverse implications beyond just money. Of course it would be foolish to believe that you can boil down all this down to just money.  There are many other implications on human welfare, and they will be explored as well. So really,  the formula for the IoJ is not just.  token emission = f(time, materials, skills, output, other signals)  Taking into account these things, we could restate the formula as  token emission + reputation + learning  + impact = f(time, materials, skills, output, other signals)  It would not be an understatement to say that this is a multidimensional design space.  There is a lot of possibilities here.  So how should we explore it?  What pitfalls we should we avoid. I think we should each start by exploring mechanisms that match our values.  7. What are our Values? Blockchains offer the ability to create smart contracts.  In these smart contracts, we can literally program our values into our money. So what are our values? This deserves its own post.  Whats the relationship of capital to labour?   How do supply & demand fit in together?  How do we measure success?  How to balance short-term incentives with long-term incentives? Where do social safety nets fit in?  Where can we further align incentives?  There are complicated political theories & economic histories to analyze, we have first principles arguments to make, and the surface area is extremely large.  If you want me to write a post about this, send me a tweet and let me know. I will provide a WIP take on the “What are our values?” question though. Caveat emptor, this is my individual opinion.  This is subject to change. My present personal view is that the true endgame for the IoJ is to build a world that is abundant in each of the individual eight circuits of human consciousness for as many people as possible for as long as possible.  8-Circuits800×340 101 KB  As you stack web3-native mechanisms on top of the eight circuits of concsciousness, this is what you start to get:  59810c55-d076-40f8-b872-8aee47d3c97e2768×1124 303 KB  Further nuance is required when you consider there are multiple people involved in each transaction on the internet of jobs.  Screen Shot 2021-12-05 at 1.58.20 PM1174×992 121 KB  I think that one important design criteria is that persons should be able to (1) mutally benefit (2) proportionally benefit to the value they each provided (3) have the option to walk away from any of these relationships. This is course, not just theoretical.  It’s happening already.  Here is what a slice of the Gitcoin contributor graph looks like:  ce8853cb-5e09-4974-a340-3801b8527f551128×928 106 KB  Even this view I think doesnt do justice to the diversity of the humanity that will be using the Internet of jobs.  Will the IoJ be accountable to humanity, or humanity accountable to it?  Will the IoJ create human thriving? I’d like to believe we are  designing a regenerative internet of value for the thriving of a global citizenry, an aggregation of 3-dimensional humans, each w differing values, ambitions, backgrounds, geographies, psychological orientations, financial endowments, privilege levels, abilities, and physical archetypes.  We celebrate our diversity but also recognize our common human needs to live in healthy ecosystems, attain economic empowerment + maintain individual sovereignty. I’d like to believe this.  Maybe if other people would too, we can achieve a consensus on that north star + build it together   It’s happening already List of internet of jobs products I’m aware of:  SourceCred - a tool that measures an intersubjective consensus of where value is created in communities + creates token rewards for them. Radicle - a networked tool for earning tokens for OSS devs Opolis - an employment commons that handles common benefits + regulatory tasks. CoordinAPE - a tool that measures an intersubjective consensus of where value is created in communities + creates token rewards for them. OpenSea - a NFT marketplace where artists can sell their work. ETHGlobal - a hackathon provider; earn tokens for accomplishing coding tasks or starting something new. Gitcoin Grants - a quadratic funding based crowdfunding + matching tool. Gitcoin KERNEL - a web3 university Gitcoin Hackathons - a hackathon provider; earn tokens for accomplishing coding tasks or starting something new.  Coordination Party Kit - a toolkit under development at Gitcoin for DAO-era employment.  Some of these tools are skeumorphic, and some are fundamentally & radically new constructions of the internet of money era. Did I miss any amazing IoJ tools?  Let me know below. ",
                    "links": [
                        "https://wtfisqf.com/",
                        "https://opolis.co/",
                        "https://gitcoin.co/explorer",
                        "https://gitcoin.co/grants",
                        "https://twitter.com/owocki",
                        "https://en.wikipedia.org/wiki/Eight-circuit_model_of_consciousness",
                        "https://gov.gitcoin.co/t/coordination-party-kit/9231/6",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-23/9370"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.59128081003081
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/CoachJonathan",
                    "index": "#2",
                    "likes": "4",
                    "time": "11/12/2021-12:34:29",
                    "content": "Thanks for sharing these great perspectives. Your point about the true endgame for the IoJ really hits home for me. A concept I’ve seen applied outside of Web3 in other organizations is having people work in their “Zone of Genius”. This is a term coined by Gay Hendricks in his book The Big Leap. The idea is that we can operate in one of 4 zones in our lives:  Zone of incompetence (we are not good at the task) Zone of competence (we are not good, but we wish to improve) Zone of excellence (We are really good and, with great effort, produce great results) Zone of genius (We produce masterfully AND it feels easy… maybe even fun)  I often wonder what it would look like to live more and more into my own Zone of Genius AND to have everyone around me doing the same. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.619507575757575
                }
            ]
        }
    ],
    "group_index": "620"
}