{
    "poll_list": [
        {
            "id": "0xd65bb1c535d0c83ec197df8d000464c6fb7a6ef000ad59df48af82d39d23e42e",
            "title": "dGTC Workstream Q4 Budget Proposal",
            "discussion": "",
            "body": "This request is to send 127k GTC (138k minus remaining 10k GTC & 40k DAI from Q3) to the dGTC multisig to fund their Q4 2021 budget.\n\n### Workstream Mandate: Progressively Decentralize Gitcoins core services and products.\n\n### Q3 Achievements & Budget Deployment\nIn Q3 of 2021 the dGTC workstream utilized the budget granted to take the Decentralized Grants platform from a rough draft concept to working POC. We have kicked off a Grant Round for the Moonshot Collective team which contained 11 grants. Since the start of the round we have had 3 new grant submissions which have gone through the approval process and you can see on the platform at https://grants.gtcdao.net/\n\n### Out of the 41,300 GTC received for Q3, we have 10k GTC and 40k DAI remaining which we are moving forward to our Q4 budget.\n\n### Q4 Goals High Level\nDuring Q4 the Decentralize Gitcoin workstream will (and has already started to) continue to collect feedback and improve the user interface and user experience, build additional features based on what is most important to run the round in GR12 and for claiming payouts, start working on implementing active sybil resistance and basic curation, and kick off the DID/Sybil Score Aggregation project and DevOps/Data initiative.\n\nReference previous budget [here](https://gov.gitcoin.co/t/decentralize-gitcoin-workstream-budget-request/8121).\n\nFor detailed budget proposal and breakdown see [this post on the governance forum](https://gov.gitcoin.co/t/proposal-decentralize-gitcoin-workstream-budget-request-q4-2021/8895).\n\nGnosis Safe address: 0x931896A8A9313F622a2AFCA76d1471B97955e551",
            "choices": [
                "Yes - Send 127k GTC to dGTC",
                "No - Do not fund dGTC"
            ],
            "scores": [
                5275972.129517252,
                6.998
            ],
            "start": 1635523200,
            "end": 1635955200,
            "snapshot": "13512764",
            "state": "closed",
            "author": "0x6BF1EBa9740441D0A8822EDa4E116a74f850d81B",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "id": "QmchtUum2drB3NAgCqDxKWVhqs8JrCdGHX5W5s4CHsVMw1",
            "title": "Decentralize Gitcoin Allocation",
            "discussion": "",
            "body": "Through this proposal, the Decentralize Gitcoin workstream is requesting a governance reward budget of 41,300 GTC to be deployed over Q3 2021.\n\nThese funds will be utilized to help further the mission of decentralizing Gitcoin starting with Gitcoin Grants as outlined in the proposal linked below.\n\nhttps://gov.gitcoin.co/t/decentralize-gitcoin-workstream-budget-request/8121\n\nThis proposal is critical to enabling the workstream to continue progress toward a decentralized Gitcoin. If this proposal passes, the treasury will empower a group of team and community members with a budget of 41,300 GTC, managed by a public 2 of 3 multisig including the following members:\n@phutchins\n@thelostone-mc\n@bendi",
            "choices": [
                "\"Yes\" 41,300 GTC to DCGTC",
                "\"No\" No GTC to DCGTC"
            ],
            "scores": [
                3021246.9816053044,
                779.4852406612056
            ],
            "start": 1628686800,
            "end": 1629205200,
            "snapshot": "13005088",
            "state": "closed",
            "author": "0x6BF1EBa9740441D0A8822EDa4E116a74f850d81B",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        },
        {
            "title": "dGTC Workstream Q4 Budget Proposal ",
            "date": "Proposed on: Nov 3rd, 2021",
            "yes_votes": "4.61M",
            "no_votes": "0"
        },
        {
            "title": "Decentralize Gitcoin Allocation ",
            "date": "Proposed on: Aug 20th, 2021",
            "yes_votes": "5.04M",
            "no_votes": "0"
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/decentralize-gitcoin-workstream-budget-request/8121",
            "title": "Decentralize Gitcoin - Workstream Budget Request ",
            "index": 8121,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/phutchins",
                    "index": "#1",
                    "likes": "12",
                    "time": "02/08/2021-20:56:34",
                    "content": "Hey team! Over the last three months, the Decentralize Gitcoin Workstream has made great progress toward decentralizing Gitcoin Grants. Progress & Work To ensure transparency on what we are building and to encourage participation from the community we operate openly.  Decentralized Grants code is hosted on Github here  Issues can also be found on Github here which contain:  Discussion posts → where a problem statement is explained and the team arrives on best path of execution Tasks → once the clear has been defined , a task issue is created so that whoever form the team / community picks knows exactly what changes are expected to mark the issue complete   The team has discussions on the Gitcoin Discord which is open to everyone Additionally we also give in high level updates here    Decentralized Grants V0.1 The Decentralize Gitcoin workstream will deliver a working prototype of decentralized Grants which works end to end. This will be tested by partnering with Gitcoin and running a Grants CLR round with a limited number of grants. From the dApp standpoint, users can  Create GrantRound (this will be done by Gitcoin to start) Users can create a Grant via UI (Grant Owner) Users can contribute to the Grant (Grant Contributor) Grants Owners can view the contributions received Users can view the grants on the Grants Round Users can view details about the Grant Once the round ends CLR matching distribution being determined based on the contributions Grant owners being able to receive / claim their funds based on the above distribution  From the development standpoint  Working dApp to ensure Solidity contracts with good test coverage Automated Tests + CI to enforce code quality while PR are raised Documentation on how to contribute + build the dApp  In the short term we intend to:  Blog Post Release (share proposal docs, announce call) (done)  Begin involving those that have signed up to contribute Workstream Call (intro dGrants, Q&A w/ panel) (scheduled)  Release Overall Spec for Review Hold discussion around protocol creation (and what we have so far) Announce protocol definition & facilitate feedback Release minimal working prototype with simple UI running a side round for Gitcoin Building Gitcoin with up to 10 grants  Budget Through this proposal, the Decentralize Gitcoin workstream would like to continue its efforts and is formally requesting a governance reward budget of 41,300 GTC to be deployed over Q3 2021 in the following areas:   Team  Budget: 37,000 GTC Detail: Covers Workstream Lead & Project / Product Management, 2 Senior Developers, 3+ full time community contributors (or more with less time commitment)    Infrastructure  Budget: 1,800 GTC Detail: Hosting for testing & convenience layer, Decentralized Storage    Tools  Budget: 300 GTC Detail: Build & Test Services    Security  Budget: 2200 GTC Detail: Smart Contract Audit    The funds contributed will be managed by a public 2 of 3 Gnosis Safe multisig which you can see here: 0x931896A8A9313F622a2AFCA76d1471B97955e551. Additional signers will be added selecting from active members of the community and workstream. Over time we plan on moving more in the direction of a sub DAO and even launching sub DAOs within our workstream. We welcome your feedback and thoughts on this draft prior to submitting for official vote! Signed, @phutchins @thelostone-mc and the rest of the Decentralize Gitcoin workstream team! ",
                    "links": [
                        "https://github.com/dcgtc/dgrants/issues",
                        "https://discord.gg/gitcoin",
                        "https://gov.gitcoin.co/t/workstream-decentralize-gitcoin/180",
                        "https://gov.gitcoin.co/t/proposal-issue-clr-fund-a-40k-gtc-grant/8240/10",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-8/8357",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-9/8422",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-6/8161",
                        "https://gov.gitcoin.co/t/what-is-the-governance-surface-area-for-gtc/9377",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
                        "https://gov.gitcoin.co/t/s15-proposal-gitcoin-product-collective-workstream-proposal-budget-request/11058/6",
                        "https://gov.gitcoin.co/t/proposal-decentralize-gitcoin-workstream-budget-request-q4-2021/8895",
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-7/8229"
                    ],
                    "GPT-summary": "The post is an explanation of the progress made by the Decentralize Gitcoin Workstream towards decentralizing Gitcoin Grants. The post also includes a request for a governance reward budget of 41,300 GTC to be deployed over Q3 2021 in various areas. The author invites feedback and thoughts on the draft prior to submitting for an official vote. The post also provides links to Github for further information.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.765126050420168
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "3",
                    "time": "05/08/2021-22:16:10",
                    "content": "This looks great. I wonder if the sc audit should be higher? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/phutchins",
                    "index": "#3",
                    "likes": "2",
                    "time": "06/08/2021-17:34:19",
                    "content": "Potentially. I imagine we will do a quick audit prior to the first round we run then a much more in depth audit a few iterations after that so we let the dust settle on the contracts before putting too much in. Cost with those audits can creep up however so it might be smart to bump this up a little as you suggest. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.455059523809523
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/phutchins",
                    "index": "#4",
                    "likes": "2",
                    "time": "12/08/2021-15:12:48",
                    "content": "This is up for vote on Snapshot.org currently here. Please cast your vote before we move to the next stage! ",
                    "links": [
                        "https://snapshot.org/#/gitcoindao.eth/proposal/QmchtUum2drB3NAgCqDxKWVhqs8JrCdGHX5W5s4CHsVMw1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#5",
                    "likes": "1",
                    "time": "16/08/2021-18:28:16",
                    "content": "So excited about this!!! Got my vote! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.57763671875
                }
            ]
        }
    ],
    "group_index": "546"
}