{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/schelling-point-event-workstream-setup-proposal/11083",
            "title": "Schelling Point Event Workstream Setup Proposal ",
            "index": 11083,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "regen",
                "events",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#1",
                    "likes": "16",
                    "time": "08/07/2022-13:02:44",
                    "content": "TL;DR: This proposal signals the intent to setup Schelling Point up as a self-funding workstream “lite” and how it is the best path forward for the event. Context: As most of the community knows, Schelling Point (SP) is a key event in the Ethereum ecosystem calendar and has been creating and expanding a space for meaningful conversations, conference structure innovation and web3 cultural celebration for the past two years. The pandemic slowed us down but we returned this year with two incredibly successful events in Denver and Amsterdam, with a third to follow in Bogota just before Devcon. We also ran an SP Pop Up unconference at the Protocol Labs Funding the Commons event during NYC Blockchain Week this June. It is my belief that SP is an essential piece in maintaining, sharing and strengthening our culture as well as continuing to seed and grow regenerative beliefs within the web3 community. Timeline/Milestones: The goal is to have two SP events a year, one just before ETHDenver and the second around Devcon. We may also run unconference/POP UP style activations at events like Funding the Commons and more depending on value alignment and sustainable bandwidth.  The structure: The Schelling Point workstream is intended to work as follows:  Fully self funded via sponsorships per event Pulling in contributors from other workstreams/external for the planning & running of the events. Post event, said contributors return to their respective roles in their respective workstreams I will be the sole permanent member of the workstream to start with since I handle most content curation, structural ideation and vision for SP SP continues to grow into one of the leading events on the crypto conference circuit and a trend setter in terms of format innovation and content curation  Next Steps: Any questions, feedback and thoughts welcome. Immediate next steps:  A vote is proposed to create the workstream If the vote passes, SP becomes a workstream lite in the DAO We all enjoy SPs around the world for the foreseeable  ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindigest-28-2022/11215",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-27-2022/11163",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-26-2022/11134"
                    ],
                    "GPT-summary": "The author proposes to set up Schelling Point as a self-funding workstream \"lite\" to continue organizing events that promote meaningful conversations, conference structure innovation, and web3 cultural celebration. The proposal outlines the timeline, structure, and next steps for the workstream. The author welcomes questions, feedback, and thoughts from the community. Positive feedback and constructive criticism are given, and questions are asked about the proposal.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.076058201058201
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#2",
                    "likes": "3",
                    "time": "08/07/2022-13:26:28",
                    "content": "    Pop:  Fully self funded via sponsorships per event   This is great to have a WS be self funded. Historically SP events have actually made money and we have moved the excess to the matching pool. Have you considered if this is a trend we want to continue? Would funds go to the matching pool or to the DAO treasury long term?     Pop:  Pulling in contributors from other workstreams/external for the planning & running of the events. Post event, said contributors return to their respective roles in their respective workstreams   Are you thinking of pulling FT contributors? I am just wondering how disruptive this may be to their workstream. ie, I am working with Jane on a project, then Jane goes MIA to work on SP, then Jane is back after the deadline has passed for some scope of work (Jane is a made up person). I like the idea of drawing from the strength/context of the DAO, just curious how we might balance delivery of previously agreed to outcomes.     Pop:  If the vote passes, SP becomes a workstream lite in the DAO   Does this mean there is a new unique seat opened on CSDO? I dont think we have defined in our governance process what a lite workstream is, or at what level they participate. Would love your thoughts on this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.377570346320346
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#3",
                    "likes": "2",
                    "time": "08/07/2022-13:39:43",
                    "content": "Thank you for your comments - answers below!  This is great to have a WS be self funded. Historically SP events have actually made money and we have moved the excess to the matching pool. Have you considered if this is a trend we want to continue? Would funds go to the matching pool or to the DAO treasury long term?  We already have a tier in the sponsorship selection that enables the use of sponsor funds in the matching pool - I see this growing and potentially continuing the pattern. I would also like to be able to explore supporting aligned partner organisations in the ecosystem with any event activations they may host or leftover funds ensuring flexibility in running POP UP events without additional funding.  Are you thinking of pulling FT contributors? I am just wondering how disruptive this may be to their workstream. ie, I am working with Jane on a project, then Jane goes MIA to work on SP, then Jane is back after the deadline has passed for some scope of work (Jane is a made up person). I like the idea of drawing from the strength/context of the DAO, just curious how we might balance delivery of previously agreed to outcomes.  Any work by contributors would obviously be mindfully attributed and balanced. Everything about SP is about balance.  Does this mean there is a new unique seat opened on CSDO? I dont think we have defined in our governance process what a lite workstream is, or at what level they participate. Would love your thoughts on this.  I already have a seat in CSDO so this would simply continue. We may choose to add something in the governance process but at this stage this is an experiment, I would like to first see how it pans out vs cementing any rules before we even get started. Let us be comfortable with unknowns for now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.717276936026936
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#4",
                    "likes": "5",
                    "time": "08/07/2022-16:49:42",
                    "content": "I support this idea.  Attending SP Denver/EthDenver last year changed me for the better.  (not the covid!)  For the first time I was able to feel the culture…to get immersed.  High quality conferences boost the entire space.  Gitcoin already has momentum and brand awareness attached to the SP events.  No logical reason to slow down or change course in this regard, unless default-dead looms nearby. It is probably important to define the term workstream-Lite to avoid confusion and misunderstanding in the future.  Lots of consequences to creating a second category of workstream.  How do we allocate resources to the Lite ones?  Should there be a ratio of Lite to Reg or can we have any number of either?  Will there be different accountability or reporting requirements to the Dao?  It makes me wonder if we shouldn’t consider it a smaller, but typical workstream like any other?  What possible benefits could be created by sub-groups of differing workstreams?  A ‘B-List’ (in size, not quality) of workstreams?  What possible negatives might exist? I trust Simona implicitly and will back just about anything they suggest after a quick read.  Happy to support this going forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.522883597883598
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#5",
                    "likes": "1",
                    "time": "08/07/2022-17:01:47",
                    "content": "Thank you, @David_Dyor - I am so happy it was a positive experience, it’s what I always aim for in terms of maximum vibes  thank you for your kind words and pledge of support! My aim with “lite” is that the WS is fully self funded - resource allocation should not be a problem for its existence as it is for “regular” workstreams. I do maybe see a point in defining how contributors flow in/out as per @kyle’s point above too…let me give it some thought  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.221590909090909
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#6",
                    "likes": "7",
                    "time": "08/07/2022-17:31:54",
                    "content": "Hi Simona, So great to see this coming together. I’m very proud of the work that was done at SustainWeb3 2020, Schelling Point Denver 2022, Schelling Point Amsterdam 2022, and while I didnt go to the SP Pop up at Funding the Commons NY 2022, I heard it was great too!  The lineage of these events have been a strong social + educational schelling point (pun intended) for the regen x web3 community.  The videos of the talks have lasting power in educating people about regen x web3 as well. I want to highlight that you in particular have taken the event series to the next level.  Each one is better than the last, and I think that has set a high bar for what these events look like over time!  This is a testament to your skills in curating, organizing, and executing these events. Also isnt it cool abbreviation of both Schelling Point and Simona Pop is SP!  There is something karmatic or predestined about that… hehe. For the avoidance of doubt, I want to ask a few specific questions about how this formalization imbues the relationship between GitcoinDAO + Schelling Point Event Workstream  Who owns the Schelling Point brand?  How can the brand be licensed? If there is excess revenue from SP events, where does it go?  Say the SP Workstream does an event at Devcon Bogota and it does $250k in revenue and costs $200k (including all costs, production, travel, marketing, salaries, etc), what happens to that extra $50k?  EDIT: looks like you answered this above in your response to Kyle.   Will Gitcoin be a title sponsor (or top tier) of these events in perpetuity?  Will there be any financial sponsorship required from the DAO to do that? In the spirit of decentralization, do you plan to decentralize leadership of the workstream over time?  Will the workstream it ever become its own DAO?  If you are the one sole permanent member of the workstream, what checks/balances exist if any?  What mechanisms exist for your constituents to give feedback?  I know these are pointed questions, and there aren’t answers to some of them today.  I look at this as a conversation starter.  Thank you in advance for your grace in perceiving these questions as being good faith. Thanks again for your work on SP, SP.  Excited for the next event. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.399166666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#7",
                    "likes": "4",
                    "time": "08/07/2022-20:13:44",
                    "content": "Thanks for this proposal Simona, I can only echo the sentiments already expressed that the previous Schelling Points were just fantastic events. I loved everything you and @gloria and the whole team accomplished in Amsterdam (and Denver before this) and can’t wait for the next ones. I share some of the questions shared above by Kyle, Kevin & David, the main one for me what the benefit is of creating a separate workstream if there are no fixed contributors for now, except for you (part-time). A workstream entails quite some overhead, part of this for me is objective settings & metrics, budget transparency (even if you’re break even or better), a separate seat at CSDO and deep reporting. When it comes to creating new workstreams I’m not too comfortable with unknowns to be honest, the more clarity there is now, the easier processes become. This is also a net positive for the DAO as a whole. For reasons of simplicity and logic it would make the most sense to me if Schelling Point becomes a part of the ‘web3event.co’, the rebranding of the gitcoin holdings company, SP would logically become one of its key events. It would lower the overhead and it could just focus on its core mission, creating a series of great and impactful events supporting and promoting public goods. If this is for some reason not desirable or possible, a candidate within the DAO could be either PGF or MMM. From our conversations I know you feel PGF would make more sense because SP is more than just Gitcoin, and I agree with this. This initiative could fall under the ‘grassroots community’ effort. My hesitation about this is that PGF already hosts a whole lot of initiatives and its core mission is Public Goods funding, not PG promotion. I do believe MMM could incorporate this initiative, their mission imo is more or could be more than just  communicating about Gitcoin. But I would not oppose this to be initiative under PGF if a strong case is made for this. Appreciate all you do and from my side as well, just seeing this as a conversation starter, I am not sure what the most efficient way forward is, but will definitely support the continued existence and success of Schelling Point in any way I can. ",
                    "links": [
                        "https://gov.gitcoin.co/t/s14-proposal-amended-public-goods-funding-budget-request/10443"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.179098679098679
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#8",
                    "likes": "2",
                    "time": "08/07/2022-22:45:24",
                    "content": "Hey Simona! Thank for the proposal! What is a lite self-funded workstream? I fee llike this needs definition reading the questions by all other stewards here too. So it would not need any funding from the DAO? Then why be a workstream at all? I feel like I probably misunderstood something? (haven’t been to a schelling point event myself yet but only heard good things). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#9",
                    "likes": "1",
                    "time": "11/07/2022-01:22:56",
                    "content": "Hi @Pop I love this proposal, thank for raising it. (although I didn’t have a chance to join any SP, I heard it is a great success) by the way, I have several questions (besides the questions from Kyle, Kevin and others)  what’s the purpose to set up SP workstream what is the workstream lite (the same as lefteris) what’s the possible connection/coordination between SP workstream and other workstream is there other possible way to run SP event  From my view, SP event is very successful, and hope it could be the leading web3 event! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.175000000000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#10",
                    "likes": "2",
                    "time": "11/07/2022-02:03:40",
                    "content": "I attended the Schelling Point in Amsterdam and thought it was really well done so I’m supportive. However, similar to others, I’d just want to better understand what workstream lite would mean and if it’s self-funded, what does being part of a workstream mean in this case? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.479166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#11",
                    "likes": "3",
                    "time": "11/07/2022-16:43:03",
                    "content": "Having attended Schelling Point and personally seen the value it generated for public goods (a portion of sponsorships actually went back to the matching pool) I’m hugely supportive of this. As @owocki’s mentioned I would love to hear more about how the workstream lite model evolves, and how the brand is managed. But even further, I’d love to discuss how we ensure a sizeable portion of Schelling Point profits go towards our shared needs in web3 once the workstream is instantiated. Thanks for everything you’ve done to get Schelling Point to this stage @Pop! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Maxwell",
                    "index": "#12",
                    "likes": "0",
                    "time": "11/07/2022-17:55:48",
                    "content": "As someone who attended SP in Denver and the pop-up in NYC, I’m highly supportive of this proposal. SP is cementing itself as both an educational and cultural cornerstone in web3, and one that produces immense positive externalities while pushing forward the Gitcoin brand. I echo Krisis’s comment above regarding the relevancy between SP and PGF grassroots initiatives. Regardless of whether SP becomes a Gitcoin workstream, migrates to web3event.co, or becomes it’s own DAO, I greatly look forward to ongoing collaborations between PGF and SP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.548295454545454
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tayken",
                    "index": "#13",
                    "likes": "0",
                    "time": "12/07/2022-10:28:09",
                    "content": "Hope you’re feeling better @Pop  I’d be excited to support this evolution of SP, and perhaps explore intersection points with this proposed salon series under the ImpactDAO category. Event fatigue is already very real (you know as well as anyone). How do we avoid the risks associated with over-saturation? Less rhetorical, more genuine curiosity. There’s a ton of latent energy (i.e. human capital) locked up in legacy systems and structures. If we’re to cross the proverbial chasm… together, I think we need to be more intentional about bridging the web2/3/5/n communities. This also relates to the educational track structure we’ve been working to formalize (now incubated @ ETHDen/BCN/CC). Kernel is an epic onboarding and mental model maximizer for the digital/web3 native. What might a meat-space model for the masses look like? Helping to map a path/trajectory for the 99% (maybe it’s 95% now) is still drastically under-prioritized imho. *makes note to reread Strategy of Conflict  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.090972222222222
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#14",
                    "likes": "0",
                    "time": "12/07/2022-22:18:39",
                    "content": "It’s awesome to see this proposal out in the wild and so much support for the event from so many. Both Schelling Point events have been great so far and I’m really happy to see a conversation happen here about how we can support it in a post-disaffiliation world. It seems that there are some concerns about the complexity of adding a “workstream lite” from a governance perspective - not all that surprising. In fact, I was hoping that we would have a bit more clarity in this proposal about what would/wouldn’t require from the workstream lead. Assuming that the proposal goes through as is and SP is stood up as a workstream lite, it would be really helpful to have regular insight into the goals and general activities of the workstream to make sure that we’re aligning priorities between our two organizations. IRL events are generally an important marketing channel for most organizations as they provide a unique opportunities to connect with partners, influencers, press, potential contributors & more, and it’s very important that our messages are aligned in these different places! Looking forward to more collaboration and seeing more discussion on this topic and generally supportive of this direction, as you already know from our initial conversations after SP Amsterdam!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.926041666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#15",
                    "likes": "0",
                    "time": "15/07/2022-13:48:56",
                    "content": "Thank you @owocki - love that you love it.    Who owns the Schelling Point brand? How can the brand be licensed?    Have not fully thought about this yet - it may spin out at some point.    Will Gitcoin be a title sponsor (or top tier) of these events in perpetuity? Will there be any financial sponsorship required from the DAO to do that?    Gitcoin actually only “sponsored” travel and staff for SP Amsterdam so it could contribute if it wanted to but it would be considered a regular sponsor.    In the spirit of decentralization, do you plan to decentralize leadership of the workstream over time? Will the workstream it ever become its own DAO? If you are the one sole permanent member of the workstream, what checks/balances exist if any? What mechanisms exist for your constituents to give feedback?    Over time, perhaps (re decentralization and it becoming its own DAO). The checks/balances will be success of the events, attendee & social media sentiment around the event, innovation in event design, content curation and experiential best practices etc. Hope this helps! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.7243589743589745
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#16",
                    "likes": "2",
                    "time": "15/07/2022-13:52:42",
                    "content": "Thank you all for the great support and the feedback! Responding to the “what is a workstream lite” question from a few of you: I made it up  but essentially it means that it does not carry bulk. It is an agile, streamlined workstream that comes together twice a year then dissipates and that it funds itself. There will be no budget proposals from this workstream. The reporting for this workstream will be around recaps of the events, attendance, content, reactions/feedback and will be delivered post event. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/sarahdw",
                    "index": "#17",
                    "likes": "1",
                    "time": "25/07/2022-14:26:23",
                    "content": "Also a Schelling Point fan - literally volunteered at the Amsterdam one as I was so keen to attend & tickets had gone. Much here makes sense - SP is bigger than Gitcoin, but wants to contribute profits back to the pot; some workstream lite mechanism seems to make sense. I’m curious about the first point tho - given we’re thinking through sustainability overall rn, are there repeatable sponsors potentially already in the mix for SP? When we think about brand and positioning, do you/we already have a sense of who we would not take sponsorship from in order to maintain the vision of Schelling Point? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.34375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/connor",
                    "index": "#18",
                    "likes": "5",
                    "time": "26/07/2022-07:25:34",
                    "content": "I’m fully supportive of this proposal! Schelling point events have been a great success thanks to Simona. It’s important the Gitcoin mission has a physical presence and that we can foster in-person gatherings with our growing community. As someone who helped bring in sponsorships in the past two SP’s, I can say fairly confidently that SP will be the first “sustainable” workstream if this goes through (aka revenue > costs). The demand is there and our partners and friends want to support and be involved. I do think there could be better clarity on what is required for pulling in contributors from other workstreams to help with SP,  however anecdotally I was able to help out where I could while still managing my main role in PGF. And at the end of the day, SP sponsorships could certainly pull in more funds to the matching pool over time, so there are a lot of synergies with PGF here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.526984126984127
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#19",
                    "likes": "5",
                    "time": "28/07/2022-14:16:56",
                    "content": "    Pop:  Gitcoin actually only “sponsored” travel and staff for SP Amsterdam so it could contribute if it wanted to but it would be considered a regular sponsor.   Hmmm. I think actually GitcoinDAO (and web3events - formerly Holdings) people also contributed to selling sponsorships for the last two events.  Let me know if that is mistaken.     Pop:  Have not fully thought about this yet - it may spin out at some point.   OK, for the avoidance of doubt, I think the DAO owns the brand right now.  It was one of the assets that web3event.co (formerly Holdings) created and then spun out during the asset transfer. One low lift arrangement to get this mini-workstream going quickly would just be to have GitcoinDAO license the brand to the workstream-lite in exchange for a title sponsorship on an event by event basis. ",
                    "links": [
                        "https://gov.gitcoin.co/t/proposal-the-gitcoin-foundation-a-proposal-to-represent-the-gitcoin-dao-irl-by-a-cayman-islands-foundation/9983"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.55952380952381
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#20",
                    "likes": "3",
                    "time": "28/07/2022-15:58:17",
                    "content": " One low lift arrangement to get this mini-workstream going quickly would just be to have GitcoinDAO license the brand to the workstream-lite in exchange for a title sponsorship on an event by event basis.  I like that dynamic! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.555555555555555
                }
            ]
        }
    ],
    "group_index": "154"
}