{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kyles-voter-guide/9856",
            "title": "[SUMMARY] S13 Budget Proposal Recap - Kyle's Voter Guide ",
            "index": 9856,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#1",
                    "likes": "2",
                    "time": "09/02/2022-05:29:56",
                    "content": "Hey all - edit - Revised voting guide for dCompass based on feedback given - 2/9/22 edit 2 - Revised as I misrepresented FDD budget request - 2/10/22 What a flurry of budget proposals we have to review. I wanted to offer my voter’s guide for folks who may be struggling to digest the nuances in these proposals. I am not yet an expert on the amazing work each workstream is doing, but I have spent hours pouring over each workstreams goals, linked docs, budgets, and past results. Hopefully my growing context helps you all. I want to note, I am a single person with a limited view. Please DYOR and bring to me questions if you want clarification. Season 13 has brought about a total of 6 total requests from 7 workstreams. Here are the highest level details on the budgets as requested: Budget Requests S13 (Q1 2022) - I also denoted where I know Holdings is propping up some of the workstream budgets to make sure its an apples to apples comparison. MMM - 30K GTC (likely another 20K funded by Holdings right now) PGF - 100K GTC (likely another 30K is funded by Holdings right now) FDD - 93.5K GTC (No real funding by Holdings right now) DAO Ops - 40K GTC (likely another 30K is funded by Holdings right now) dGrants - 0 GTC (On Hold) dCompass - 38K GTC (No funding by Holdings right now) MSC - 130K GTC (likely another 20K is funded by Holdings right now) Total request of ~431.5K GTC Heres a visual breakdown:  Screen Shot 2022-02-10 at 10.38.50 AM1090×682 47.7 KB  S13 will bring about some great outcomes across the workstreams (if they deliver on all outcomes outlined):  MMM - Build a marketing machine, shape and grow a leading Web3 brand MMM - Support the DAO’s marketing, design needs, and improve MMM team health and growth. PGF - Continue to grow and scale Grants Rounds (new cause rounds, new ecosystem rounds, operational execution of GR13, etc.) PGF - Growing community partnerships and the Public Goods Coalition PGF - Grow the Public Goods Community FDD - Advance Sybil Defense through community owned ML FDD - Increase Participation, transparency, and legitimacy FDD - Measure FDD health and increase that health rating DAO Ops - Bootstrap User support, Accounting, Regulatory considerations, community experience, community governance, and People Ops teams. dCompass - Beta launch the project dCompass - Launch 3 knowledge-base handbooks for teams, and grow adoption of the knowledge-base MSC - Launch successful products: Optimism collab, dPoPP, CPK and grow the innovation factory  Here is my take on how I will be voting:   MMM Voting as-is (30K GTC), with the caveat I would like to see funds moved from the DAO Mart to the Steward Report Cards given the criticality of those. –This is a modest budget to help bootstrap some of the new initiatives Sean is bringing to the group. I am eager to see the results they can deliver now that they are more focused on Marketing in addition to the great work of previous seasons.  PGF already passed (100K GTC), noting the partnerships budget is fairly large and could be revised (perhaps with some commission percentage?) –This is the heart of the DAO and what Gitcoin is and delivers. I love the progress they are making with each round and I want to continue that growth.  FDD Requesting a budget reduction to a total of 35K  This is substantially lower than their request, but this is because there was a request made for double what they have budgeted, and I am suggesting some minor cuts to S13 budget, with larger cuts/reallocation to S14. – FDD keeps much of the engine running each Grants round, and also has some of the most leaned in contributors. I have appreciated the vision Joe has put forth, and I would love to see that vision come to fruition. The cuts I am suggesting appear to be “just in case” budget, which reduces the accountability on a quarterly cadence.  DAO Ops already passed (40K GTC) - It is worth noting, I proposed this budget with the workstream so I am likely very biased on the work they/we are doing. – DAO Ops is shaping up to be the backbone of How to DAO runs and coordinates (with consent from all workstreams). I am excited to see this group settle into their roles.  dCompass Voting as-is (38K GTC) - I am still worried about Gitcoin’s future in this work, but there seems to be good faith in the exit they describe and the core connection will hopefully remain. – This work was originally requested by the core team, and it still valuable for us to make progress on this.  MSC split to two seasons (65K GTC for S13), noting the need for more accountability on the multisig (ideally a 4 of 7 with at least one “customer”) and more transparency in the future on funds spent for both prototype and product builds. – There was clarification that this was for one season, which feels too large to me. I have not seen accounting for this workstream, like other workstreams have provided, and the streams being deployed obfuscate payments without a budgeting sheet. – This workstream has delivered some great results in growing our public goods funding, but has had some missteps in finding market fit on these new tools. I would love to better understand how much funding is going to which initiative as part of this request. This request feels like a “lets ask for lots of funds and figure it out later” type of play.  Given this rationale, Snapshot budgets that resemble the following is reasonable: MMM - 30K GTC (pending) PGF - 100K GTC (already approved) FDD - 35K GTC (pending) DAO Ops - 40K GTC (already approved) dCompass - 38K GTC (pending) MSC - 65k (pending) ",
                    "links": [
                        "https://gov.gitcoin.co/t/abundance-scarcity/10045/5",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-5-2022/9862",
                        "https://gov.gitcoin.co/t/proposal-fdd-workstream-season-13-budget-request/9826/31",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-6-2022/9949",
                        "https://gov.gitcoin.co/t/s14-voter-guide-template/10488"
                    ],
                    "GPT-summary": "The author of the post provides a summary of the S13 budget proposal and offers their own voting guide for the proposals. They explain the budget requests of each workstream and provide their own take on how they will be voting. The post also includes some constructive criticism and suggestions for budget reductions for some of the workstreams. The author notes that they are not an expert and encourages readers to do their own research and ask questions for clarification.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Law and regulations",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.900270562770562
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#2",
                    "likes": "2",
                    "time": "09/02/2022-15:35:42",
                    "content": "I’d encourage voters to look at our conversation on the FDD budget proposal and the conversation between Kyle and I. Here are a few things to note in the method of communication here:   In the visual graph he shows the FDD budget as the total of our Q1 budget plus reserves. FDD has been asking for reserves since our first budget to ensure mission critical functions are covered even in the case of political delays or other issues.  We have not abused this and have in fact made $70k in treasury management returns.   He suggests a total of 35k GTC. We put our whole budget in dollar values as requested by stewards and even put that we would adjust the total GTC before going to tally (with up or down price movements) because our budget is functional. $879k with $596k for this season, the rest is for reserves. That is a 33% cut to take out just the reserves. This would leave us with 75k GTC at the prices initially used in the proposal.   So where does the other 40k GTC come from? He goes over it in his response to our budget proposal here. This suggestion is to completely eliminate our budget for doing any operations within the workstream (which some are necessary). It aims to lower our budget from last season even after successfully spinning out the DAOops and User Support streams. It also aims to eliminate all of our building for the future and only fund our operational needs for season 13. Taking Kyle’s suggestion is akin to saying “We don’t believe any innovation should happen in the FDD workstream”.     kyle:  MMM - 30K GTC (likely another 20K funded by Holdings right now) PGF - 100K GTC (likely another 30K is funded by Holdings right now) FDD - 113K GTC (No real funding by Holdings right now) DAO Ops - 40K GTC (likely another 30K is funded by Holdings right now) dGrants - 0 GTC (On Hold) dCompass - 38K GTC (No funding by Holdings right now) MSC - 130K GTC (likely another 20K is funded by Holdings right now)   FDD is a real innovation experiment. Again here you use the amount with reserves as an example of how large our budget is without the recognition of the reserves we have done every budget before. Why say our budget is 113k here rather than 75k? It is strange to me that the workstreams that are good on this report are the ones where Holdings is funding 20-30k GTC of their budget. If the stewards want us to change the reserves, why did none of them say this to us or on the forum the last 6 months? If you want us to cut our budget by over 50%, maybe holdings should donate 20-30k each quarter like it does for the other streams. I really appreciate your effort to create this guide for stewards and your guidance in helping the people at Gitcoin grow. You’ve directly coached me about bringing things up to people before bringing them to the public forum. Why did you not mention these issues in the last week? Thank you for updating your recommendation for dCompass. I have updated this post to remove my critique. I’m not mad though, I’m disappointed. I don’t want to fire half of FDD this quarter. ",
                    "links": [
                        "https://gov.gitcoin.co/t/proposal-fdd-workstream-season-13-budget-request/9826/12"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.342308047249907
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "2",
                    "time": "09/02/2022-17:44:19",
                    "content": "I’ve updated the GTC request amounts according to the current market value on the FDD budget request. FDD is requesting $879,000 (93,500 GTC*) to fund Season 13 (S13) and replenish its reserves for S14.  High Level Budget Breakdown Season 13 Budget Total = $596,295 = 63.5k GTC ($9.40/GTC*) PLUS Season 14 Reserves = $596,295 Total Needed = $1,192,590 MNUS Current Reserves = $313,000 Total Amount requested at this time = $879,590 =93,500 GTC ($9.40/GTC*)  Prices last updated 2/9/22  The GTC total will be adjusted based on the current market value at the time this proposal is moved to Snapshot and to Tally. The vote will be to send $879,590 in GTC at the current price when moved to Tally or the 20 day moving average (whichever is lower). FDD Season 13 (Q1) 2022 Budget ",
                    "links": [
                        "https://gov.gitcoin.co/t/proposal-fdd-workstream-season-13-budget-request/9826/31"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.271428571428571
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#4",
                    "likes": "1",
                    "time": "09/02/2022-19:26:22",
                    "content": "    DisruptionJoe:  Why say our budget is 113k here rather than 75k?   Perhaps I am misunderstanding your budget request - How much GTC would come out of the Treasury as part of this proposal? I am opposed to building up “reserves” to materially fund the next season. The point of Quarterly Budget reviews is to ensure there is accountability at the quarterly level, not that the 6mo mark. I did not intend to misrepresent anything in the graph. I was taking the amounts each workstream was proposing and charted it for everyone to see side by side.     DisruptionJoe:  This would leave us with 75k GTC at the prices initially used in the proposal.   This seems inline with my intention, and then also subtract the reserves you currently have. which is how I got to the 35k in my suggestion. 35k may be slightly too low given the volatility, but I did include a roughly 10% margin for price fluctuations.     DisruptionJoe:  It is strange to me that the workstreams that are good on this report are the ones where Holdings is funding 20-30k GTC of their budget.   This feels like a comment in bad faith. These workstreams are also the workstreams that are working on staffing and scaling… moving people from Holdings to the DAO as they see fit. They do not have the longevity of others.     DisruptionJoe:  If the stewards want us to change the reserves, why did none of them say this to us or on the forum the last 6 months?   I wasn’t a steward then, and I cannot speak for others. I am calling this out now, as a single voice in the community.     DisruptionJoe:  If you want us to cut our budget by over 50%, maybe holdings should donate 20-30k each quarter like it does for the other streams.   Holdings still has material “parenting” that happens within those workstreams. This feels like a request you may not actually want (having holdings “parent” FDD). This is also moving us in the wrong direction. It is my understanding that many of the Holdings employees are interested in moving to the DAO for S14. Those budgets can be adjusted accordingly as that happens, with similar accountability on their spend.     DisruptionJoe:  Why did you not mention these issues in the last week?   This is a really valid question. Frankly, I didn’t prioritize the time to dig into the proposals and budget until just last night. This is something I noted to a few folks was that I wish I had done this analysis and post earlier so that is wasn’t such a crunch. That definitely puts you and others on the heels of trying to defend their budgets, which was not my intention.  Given Budget numbers you revised (thanks for doing this!) Season 13 Budget Total = $596,295 = 63.5k GTC ($9.40/GTC)* I would deduct the existing reserve you have $313,000 = 33.3K GTC Gives a net reward of 30.K GTC, plus 10% bring us to 33K GTC, which brings us nearly inline with the 35K suggestion I made. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 5.114484126984127
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#5",
                    "likes": "1",
                    "time": "09/02/2022-20:27:05",
                    "content": "    DisruptionJoe:  Additionally, dCompass is a truly decentralized output from GitcoinDAO. I think funding them is critical to this continuing to be a DAO. To recommend we delay their funding until we have negotiated our side of the deal or preset conditions for the spin-off is not the web 3 way.   I think this is a misunderstanding, at least as far as I’m reading @kyle’s feedback here, he would be voting yes on this: ‘voting as-is’ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/02/2022-20:51:59",
                    "content": "    kyle:  Perhaps I am misunderstanding your budget request - How much GTC would come out of the Treasury as part of this proposal?   93.5k GTC at todays price, but the stipulation is there to use the price of GTC on the day we move to Tally or the 20 day moving average price of GTC, whichever is lower. (I think all streams should do this. )     kyle:  The point of Quarterly Budget reviews is to ensure there is accountability at the quarterly level, not that the 6mo mark.   Before we were just choosing our time periods and establishing norms. I think the reserves are good, especially for mission critical functions. I do not want to work with only 3 months of pay in the runway, constantly having to wonder if someone will try to reason drastically reducing our budget the last day it is on the forum and I will have to fire half of FDD. Free people just a little bit from the mental anguish of chaos and the results will be better. The removal of reserves only provides the ability for the DAO to more quickly call off the direction of a workstream. We have accounted for the reserves and not only that, but we turned them into some gains that the DAO benefits from as a whole through the work of FDD. Do you really think we should return our treasury management gains AND not have access to the benefits of the treasury management working groups stable coin purchasing? One of the core Gitcoin OKRs is decentralization. In your arguments here you have cited the efficiency vs decentralization tradeoff multiple times, but you continually prefer efficiency. Why is this?     kyle:  This seems inline with my intention, and then also subtract the reserves you currently have. which is how I got to the 35k in my suggestion. 35k may be slightly too low given the volatility, but I did include a roughly 10% margin for price fluctuations.   That makes sense.     kyle:  This feels like a comment in bad faith. These workstreams are also the workstreams that are working on staffing and scaling… moving people from Holdings to the DAO as they see fit. They do not have the longevity of others.   It is not in bad faith. It is real and important to those who are dedicating themselves to the DAO whose paycheck is at the will of the stewards. Welcome to DAO life! Shouldn’t there be some grace given for the level of transparency, oversight, and execution we have had thus far? Shouldn’t we be rooting for, not pulling back on a workstream that held the risk without support from Holdings? What would it be worth to have FDD:  Be an example of a workstream decentralizing its operations Lauch a sub-dao for a data sharing network for sybil detection Build GTC staking opportunities into our GIA system  These things are the innovation that would be crushed by having FDD simply execute it’s GR13 duties without funding for innovation, decentralization, and scalability advancements. We are looking at a 34% spending increase. Is this out of line with the other workstreams? Why is this stream specifically being targeted here?     kyle:  Holdings still has material “parenting” that happens within those workstreams. This feels like a request you may not actually want (having holdings “parent” FDD). This is also moving us in the wrong direction.   True. Let us shine. Papa, were going to college!     kyle:  Frankly, I didn’t prioritize the time to dig into the proposals and budget until just last night. This is something I noted to a few folks was that I wish I had done this analysis and post earlier so that is wasn’t such a crunch. That definitely puts you and others on the heels of trying to defend their budgets, which was not my intention.   Thank you for clarifying this. It might be why I felt ok posting something close enough to a “bad faith” argument that it would be called out. I respect your hard work in reviewing this and hope to see more stewards actively engage in this way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.331632653061225
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#7",
                    "likes": "1",
                    "time": "09/02/2022-20:53:22",
                    "content": "Thanks. You can see Kyle’s revisions to the original post. I was objecting to his suggestion to delay funding. I will remove this from my critique now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#8",
                    "likes": "0",
                    "time": "09/02/2022-21:39:24",
                    "content": "An updated graphic reflecting what FDD is actually requesting for Season 13 https://share.getcloudapp.com/12u0lYnq ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#9",
                    "likes": "0",
                    "time": "09/02/2022-22:15:13",
                    "content": "    DisruptionJoe:  Do you really think we should return our treasury management gains AND not have access to the benefits of the treasury management working groups stable coin purchasing?   This is an interesting question. I guess I wonder whose money it is… is it still Gitcoin’s while it is in workstreams hands, or is it more like a Grant and there is no more accountability to the DAO once it leaves the treasury. If it’s the latter, then I strongly feel the accountability needs to be quarterly. If its the former, I could see the case for more runway.     DisruptionJoe:  Why is this?   This is likely just my past work experience, and running operations and startups where efficiency was needed for survival.     DisruptionJoe:  a workstream that held the risk without support from Holdings?   This workstream still has support from Holdings, Holdings is the counter party to BlockScience (though FDD is funding Block Science Work). Holdings built the vast majority of the anti sybil tech that is being used. Holdings is supplying the data and operationalizing because we have been unable to build an integration despite talking about one for months (the 12 hour CSV is not the intention we have had for this work). This may be a place our vantage points offer different opinions, but Holdings has been integral in making sure Sybil protection is in place. Now, I don’t mean to sound ungrateful for the work from FDD, but FDD has inherited much of the heavy lifting Holdings did, and expanded it to ensure it is more decentralized and robust. I am proud of the work FDD has done, and the way the workstream has taken ownership of this area and continued to advance it. It seems also in bad faith to say this was “without support form Holdings.”     DisruptionJoe:  We are looking at a 34% spending increase. Is this out of line with the other workstreams? Why is this stream specifically being targeted here?   We are likely talking past each other. I am only calling for a reduction in budget to remove the reserves, which I don’t agree with and then to cut less than half of the operations budget as there is redundancy in pay happening. This is a reduction in 33% of total funding, but there is no reduction to the budget for the work you are doing. The innovation and outcomes should remain the same IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.247916666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#10",
                    "likes": "0",
                    "time": "09/02/2022-22:25:02",
                    "content": "    kyle:  We are likely talking past each other. I am only calling for a reduction in budget to remove the reserves, which I don’t agree with and then to cut less than half of the operations budget as there is redundancy in pay happening. This is a reduction in 33% of total funding, but there is no reduction to the budget for the work you are doing. The innovation and outcomes should remain the same IMO.   I did misunderstand this. I’d like to know where you see the redundancies in pay or efforts? The only place where I see this would be a total of $6,500 for the quarter and I do think it is earned. Open for discussion too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.678030303030303
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#11",
                    "likes": "1",
                    "time": "09/02/2022-23:34:26",
                    "content": "I am likely missing some context on the payments, but It looks like ~20% of the ops budget (Chris and Sam) are also going to be covered by DAO ops. I don’t have the context to debate the merits of other folks. I see my role as one who is evaluating if the team is delivering on the outcomes they commit to… not comment on HOW they get there. I want to trust the workstreams to determine that. So, I am revising the voter guide to increase the budget by an additional 2.5K GTC to fold in some of the reduced Ops budget, and also grow the cushion for the quarter. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.458333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#12",
                    "likes": "0",
                    "time": "10/02/2022-12:33:15",
                    "content": "I know we are in discussion about hiring Sam at the DAO level through DAOops, but I didn’t know that started yet. He and I haven’t pushed forward with any larger agreements for FDD as I think the DAO ops decision is higher priority at this time. If he were to be hired, we would probably remove him from this role in FDD. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#13",
                    "likes": "0",
                    "time": "10/02/2022-17:43:29",
                    "content": "    DisruptionJoe:  93.5k GTC at todays price   I updated the chart, sorry for getting that wrong. I was looking only at the top line request, not the net. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#14",
                    "likes": "0",
                    "time": "10/02/2022-21:41:19",
                    "content": "93.5k would be the total request at todays price including reserves. We disagree whether we should request reserves, but comparing that to the Season 13 amounts for the other streams as though the reserves . The total amount for FDD for Season 13 is currently at 63.5k. Here is a diagram that compares Season 13 requests. https://share.getcloudapp.com/12u0lYnq ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.84375
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/summary-s13-budget-proposal-recap-kris-s-voter-guide/9895",
            "title": "[SUMMARY] S13 Budget Proposal Recap - Kris\\xe2\\x80\\x99s Voter Guide ",
            "index": 9895,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#1",
                    "likes": "3",
                    "time": "15/02/2022-07:12:33",
                    "content": "Hi! Below you can find a direct link to my comments on the current GitcoinDAO Workstream proposals that are up for funding for Season 13. This can help other Stewards on voting. If you’d like a more in-depth view on the various proposals and linked objectives before voting I’d highly recommend looking into Kyle’s voter guide. Moonshot Collective: Abstain FDD: Proposal to reduce funding MMM: Voting yes dCompass: Abstain DAOops: Proposal passed previously, abstained, part of the team PGF: Proposal passed previously, voted yes DGitcoin: on hold ",
                    "links": [
                        "https://gov.gitcoin.co/t/moonshot-collective-workstream-budget-request-q2-2022/9824/24",
                        "https://gov.gitcoin.co/t/proposal-fdd-workstream-season-13-budget-request/9826/31",
                        "https://gov.gitcoin.co/t/proposal-mmm-season-13-budget-request/9818/10",
                        "https://gov.gitcoin.co/t/proposal-dcompass-season-13-budget-request/9794/11",
                        "https://gov.gitcoin.co/t/proposal-dao-operations-workstream-budget-q1-2022/9488",
                        "https://gov.gitcoin.co/t/proposal-public-goods-are-good-pgf-q1-budget-request/9416",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-6-2022/9949",
                        "https://gov.gitcoin.co/t/s14-voter-guide-template/10488",
                        "https://gov.gitcoin.co/t/kris-voter-guide-s14/10554"
                    ],
                    "GPT-summary": "The post is a summary of the S13 Budget Proposal Recap, where the author provides a direct link to their comments on the current GitcoinDAO Workstream proposals that are up for funding for Season 13. The author also recommends Kyle's voter guide for a more in-depth view of the various proposals and linked objectives before voting. The author provides their stance on each proposal, and some proposals have been passed previously.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 4.64675925925926
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#2",
                    "likes": "1",
                    "time": "15/02/2022-16:07:32",
                    "content": "Thanks so much for posting! I love seeing more voters guides crop up. I am hoping more stewards and workstream leads can post their thoughts to build a culture of accountability and collaboration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.950000000000001
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/02/2022-16:29:44",
                    "content": "To any voter who look at this guide, please look at this thorough rebuttal of the points Kris has made in justifying his recommendation to reduce funding to FDD. I am also directly asking him to sustain for the reason outlined in the response.     [Proposal] FDD Workstream Season 13 Budget Request 📜 Proposal Discussion       Thank you. That means a lot!   I think you are underestimating our Stewards. Some might have skimmed it, but take @akrtws for example. She is part of our multisig as a steward providing oversight of our workstream and is not a paid contributor of FDD. (FDD set ourselves up with a 4/7 multisig designed to represent our stakeholders and provide an additional layer of oversight which the other streams haven’t done.)  She participated in a 2 hour overview session giving very tough criticisms and th…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.157407407407407
                }
            ]
        }
    ],
    "group_index": "681"
}