{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-grants-analysis/9582",
            "title": "Gitcoin grants analysis ",
            "index": 9582,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/reza",
                    "index": "#1",
                    "likes": "1",
                    "time": "31/12/2021-19:34:57",
                    "content": "Hello frens, Just aped into this and here’s my analysis work.   GitHub    GitHub - rezahsnz/gitcoin_grants_eda Contribute to rezahsnz/gitcoin_grants_eda development by creating an account on GitHub.      ",
                    "links": [
                        "https://github.com/rezahsnz/gitcoin_grants_eda"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-grants-lifetime-exploratory-analysis/9585",
            "title": "Gitcoin Grants Lifetime Exploratory Analysis ",
            "index": 9585,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/omnianalytics",
                    "index": "#1",
                    "likes": "3",
                    "time": "31/12/2021-21:51:01",
                    "content": "Gitcoin is a data rich platform that is moving steadily towards leveraging its treasure trove of information in novel and interesting ways. This analysis of the lifetime Gitcoin grants data seeks to be both comprehensive and insightful with just enough quirkiness thrown in to highlight just how interesting the analysis of this data can be. Article: https://crypto.omnianalytics.io/apps/gitcoin-grants-lifetime-analysis/grant.html  image1313×1929 321 KB  Application: https://crypto.omnianalytics.io/apps/gitcoin-grants-lifetime-analysis/  image1938×761 120 KB  Repo: GitHub - Omni-Analytics-Group/gitcoin-grants-lifetime-analysis  image1905×1144 150 KB  ",
                    "links": [
                        "https://crypto.omnianalytics.io/apps/gitcoin-grants-lifetime-analysis/",
                        "https://github.com/Omni-Analytics-Group/gitcoin-grants-lifetime-analysis"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.541666666666667
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-grants-round-12-analysis/9601",
            "title": "Gitcoin Grants Round 12 Analysis ",
            "index": 9601,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Troyb",
                    "index": "#1",
                    "likes": "3",
                    "time": "01/01/2022-20:22:51",
                    "content": "My analysis is available in this repo: GitHub - Tburm/gitcoin-grant-analysis: An analysis of Gitcoin Grant data for rounds 1-12 Or you can access the analysis directly here: Gitcoin Grants Analysis — Gitcoin Grants Analysis ",
                    "links": [
                        "https://grants.troyb.xyz/title.html"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/cemgundogan",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/01/2022-16:53:51",
                    "content": "Great insights, thank you for the effort! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-grants-2-0/9981",
            "title": "Gitcoin Grants 2.0 ",
            "index": 9981,
            "category": [
                "\\xf0\\x9f\\x8c\\xb1 Grants"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#1",
                    "likes": "37",
                    "time": "01/03/2022-17:00:02",
                    "content": " Grants 2.0 Authors Lindsey Thrift Kevin Olsen  Purpose of this document:  Bring awareness to the current thinking inside the Gitcoin Product Collective (GPC) to the rest of the Gitcoin ecosystem Broadcast our intentions to the workstreams in the DAO to align efforts and identify overlapping efforts or unaccounted for needs Build the muscle of communication, anticipating the need to participate in governance in the near future.   Who this doc is for:  DAO Workstream participants Stewards Engineering, Design, and Product within GPC frens   Intro: By: Kevin Owocki Grants 2.0 is the accumulation of all that we’ve learned since launching Gitcoin Grants in January 2019 + evolving it for the last 3 years. Not only are we solving for decentralization with 2.0, we are also solving for the “meta-problem”.  The “problem” is public goods funding. The “meta-problem” is finding the optimal capital allocation tool for public goods funding.  Instead of a centralized monolith (1.0), grants 2.0 will be forkable, modular, and decentralized. Instead of having a grants protocol w QF in it (what we did with 1.0), we will create a protocol w a deep liquidity of grants on it, & create an ecosystem on top of it where different flavors of public goods funding can compete to optimally allocate capital on top of it (2.0).  1380×646 73.8 KB  Once grants 2.0 is launched, we will have created an environment where the community can test different public goods funding mechanisms on top of a deeply liquid registry of grants. This tool will allow us to speedrun the “hill climbing problem” of finding optimal democratic mechanisms for funding public goods.   Product Vision From open source software to public goods in the physical world, DAOs and other ecosystem builders (collectives of people) are seeking to gather community signal on where to invest as well as get their initiatives funded. As an impact and protocol DAO, Gitcoin envisions a world with thousands of public goods funding rounds running at any given time, distributing capital in an optimal manner that is governed by the community being served. We imagine a future where DAOs and ecosystems can spin-up/skin/fork our Gitcoin Grants experience to participate directly in the Gitcoin Grants ecosystem, and allow them the flexibility to rapidly experiment and to best deliver a grant experience that matches the needs of their community. Gitcoin will build the foundation for on-going, open source development of the tooling, standards, and substrates necessary to reach maximum scale of public goods funding distribution through development of the Gitcoin Grants Protocol. In accomplishing our vision, grant owners, round owners, and grant funders are all sovereign actors that facilitate their funding coordination through the Gitcoin Grants Protocol.  Strategy Outline To achieve our vision, we will build a protocol with a SAM (simple, antifragile, modular) design and plugin architecture such that we are not too tightly coupled to any particular elements of the protocol. By doing so, the protocol is a container that:  allows Gitcoin to speedrun the evolution of optimal capital distribution by being able to rapidly test and scale novel mechanisms and embed grants everywhere public goods projects are organizing and launching (such as integrations with DAO service platforms or Retro Public Goods Funding). enables the simple adoption of powerful tools that prevent fraud and sybil attacks, and encourage manipulation and curation of the data presented (ie, the Grants that are visible in the interface, the grants that are eligible in a round, the matching funds available, any matching fund caps, etc.). Creates opportunity for DAOs to use governance mechanisms to curate and govern their grants program, consequently creating utility for their governance tokens  The protocol must be built in a fundamentally open source manner that not only allows but encourages contributions from the community to advance it - developers are a first class citizen in the Gitcoin Grants ecosystem, and the Protocol will be well documented and have a thriving developer community. If we are successful, a plugin marketplace will emerge and the opportunity for anyone to contribute to the evolution of funding public goods will be within reach. We will build for the L2 and multichain world by maintaining most data in decentralized schemas off-chain and allowing smart contracts to be round specific and composable based on where a round manager chooses to deploy and what token they choose for funding and governance. Finally, we will decouple grants from rounds so that grantees have a credibly neutral means by which they can create, manage, and update their grants agnostic of any grant round in which they may participate.  Architecture Overview: We envision the solution as 4 new code bases: decentralized Proof of Personhood Passport (dPopp), Grants Explorer, Grant Publisher, and Round Manager. These four apps correspond 1:1 with the core processes and domain concepts that exist within the current centralized and monolithic gitcoin code base.  1600×966 135 KB  Note: there is an important architectural change that is implied here that differs from the current gitcoin.co experience. Namely, that each round is a distinct end to end experience, as opposed to the current gitcoin.co that is something of a meta-experience or round aggregator - whereby many grants corresponding to different rounds are presented together with a unified ‘checkout’ experience. Here, we are imagining each round having a grant explorer that is a distinct dApp that would launch to provide a customizable experience, putting grant curation and discovery in the hands of the community governing that round.  1600×1169 119 KB   The road to decentralization: Our goal is that by the end of Q1 2023 we can run Gitcoin Grants Rounds on a new constellation of software products that cover the core capabilities that gitcoin.co currently provides - giving our platform credible neutrality, opening up our protocol to a broader grants ecosystem, and allowing us to prototype & test different funding mechanisms more rapidly.   1373×727 91.9 KB   Starting immediately after GR13 the Gitcoin.co web application will effectively go into maintenance mode. This means the GPG team will only be addressing critical issues to the platform. As we make progress on our delivery of the decentralized applications we will begin deprecating portions of the gitcoin.co experience and migrating to the new dapps that deliver the corresponding functionality.  dPopp We will kick off the development of dPopp before the end of Q1 2022, and hope to have an MVP before the end of 1H 2022, with the stretch goal of deprecating the trust bonus UI and migrating the gitcoin.co trust bonus experience to dPopp. It is our backstop estimate that the trust bonus in gitcoin.co will be replaced in Q3 2022.  Round Manager and Grant Publisher We will proceed to move through the core functions of the main web application, deprecate functionality in the main web application, and migrate to the corresponding dApps as we deliver them. The Round Manager and Grant Publisher will kick off in Q2 2022 and we hope to have a working end to end system sufficient to allow an alternate protocol to share the underlying decentralized grant registry in GR14. We are orienting this work to enable CLRFund to run a parallel round in GR14 that would demonstrate the decentralization of our registry, while also allowing for a comparison of CLRFund MACI with the existing Gitcoin QF fund distribution mechanism.  Grant Explorer Finally, we will begin development of the Grant Explorer in Q2 2022 to build up to an end to end system that will allow gitcoin to open up our grant protocol to other DAOs.  The End of the Monolith It is our goal to deprecate most of the core gitcoin experience by GR16. Given the UX differences between the multiple separate rounds from the current centralized gitcoin experience we expect we may need an additional quarter to deliver a unified UX that replicates the multiple round grant exploration our users expect from gitcoin.co. By Q1 2023 it is our hope that this last piece of development will allow us to completely migrate away from the original gitcoin.co web application, and for us to retire the monolith.  Questions You Might Have Now  How is this good for the Gitcoin DAO?  It enables a project to start up with Gitcoin and for Gitcoin to gain utility from projects that find product community fit (PCF) through governance token swaps etc. This is a critical component of achieving the impact DAO protocol DAO sandwich mission.   Will Gitcoin DAO continue to run grants rounds or will they all be self-run by DAOs and ecosystems?  Growth of the Gitcoin grants rounds have shifted from vertical scaling (more money into the main round for the Ethereum community) to horizontal scaling (more matching pools funded by other novel ecosystems and collectives with shared cause based missions).We have identified that the total addressable market of this horizontal scaling and very large and feel confident the growth of this scale on the centralized platform is validation to continue investing in this scale through decentralizing the platform into an open source protocol. Gitcoin DAO will continue to run their own round while also assisting others in the running of their rounds (what we call side rounds today). We expect the Gitcoin Grants Protocol will enable Gitcoin DAO to continue to experiment with initiatives such as Aqueduct to discover the highest impact ways of running rounds and supporting ecosystem growth.   Why would we separate rounds from grants?  So that rounds can be run on any chain, by any party, in any manner they wish and grants can be included in those rounds as (1) the grant owner desires to be included and (2) the grant project meets the eligibility criteria of the round   Why not just SaaS-ify the the round management platform to expedite the building and maintenance of it?  By making round management independent of a centralized platform, round managers can configure and build upon the round structure to fully tailor to their needs and to make simple mechanism decisions that fit their needs; it’s likely that the value of creating token utility for DAOs to be able to use their governance tokens for curation and for ecosystems L1/L2 builders to use their native tokens for matching payout increases the inherent value of the Gitcoin Grants Standard and Schemas over building it themselves or using something “off the shelf”. Building a fully open-source protocol also means that we are building a public good that no longer depends on Gitcoin to exist and creates the opportunity for the emergence of a plugin marketplace.   Why doesn’t this vision and strategy center on quadratic funding?   Where do we go from here? We have been working this past month to align this roadmap with Kevin, Kyle, the FDD, GrantOps, our delivery partners, and the GPG. It is our hope that this document will serve as a strong foundation for continued evolution. We welcome any and all feedback to this plan! So what do we need to pull this off? Besides the focus and a bit of inspiration we’ll need to actually build this thing, we’ll need some help keeping people oriented on the end state while gitcoin.co slows down the rate of improvements. Going into maintenance mode might be hard for some of the team; namely, customer service, or sales might feel neglected as we build the future platform. Helping keep the community and team oriented on the goal of a decentralized multi-DAO future will take everyone’s help articulating the benefits, and weighing the tradeoffs between current and future pains and gains. If you have any questions, if you see things we may have missed, or have any feedback please tell us. We would love to have the broadest community buy-in to this plan that we can achieve, and we look forward to working together with this community to bring the gitcoin core technologies into the great revival. ",
                    "links": [
                        "https://otherinter.net/research/positive-sum-worlds/",
                        "https://gov.gitcoin.co/t/the-impactdao-protocoldao-sandwich/8944",
                        "https://ethereum-magicians.org/t/a-rollup-centric-ethereum-roadmap/4698/57",
                        "http://proofofpersonhood.com",
                        "http://gitcoin.co",
                        "http://gitcoin.co",
                        "http://gitcoin.co",
                        "https://twitter.com/owocki/status/1496513186442395649",
                        "http://Gitcoin.co",
                        "http://gitcoin.co",
                        "http://gitcoin.co",
                        "http://gitcoin.co",
                        "http://gitcoin.co",
                        "http://gitcoin.co",
                        "https://gov.gitcoin.co/t/the-impactdao-protocoldao-sandwich/8944",
                        "http://gitcoin.co",
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855",
                        "https://gov.gitcoin.co/t/ditch-quadratic-funding/10316/2",
                        "https://gov.gitcoin.co/t/grants-2-0-is-how-we-scale-our-impact/10015",
                        "https://gov.gitcoin.co/t/dao-vibes-1-12-3-2/9995",
                        "https://gov.gitcoin.co/t/proposal-gr14-round-structure-grants-eligibility-update/10632",
                        "https://gov.gitcoin.co/t/proposal-gr15-round-structure/11272",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522",
                        "https://gov.gitcoin.co/t/proposal-gr15-round-structure/11272/9",
                        "https://gov.gitcoin.co/t/gitcoindao-as-a-generator-function-for-coordination/10078",
                        "https://gov.gitcoin.co/t/devrel-gitcoindao/10161",
                        "https://gov.gitcoin.co/t/s14-voters-guide-kyles-guide/10567",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-public-goods-funding-budget-request/10443",
                        "https://gov.gitcoin.co/t/weekly-grants-2-0-update-2022-5-30/10760",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-8-2022/10032",
                        "https://gov.gitcoin.co/t/how-soulbound-tokens-can-make-gitcoin-grants-more-pluralistic/10077",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-7-2022/9996",
                        "https://gov.gitcoin.co/t/messari-governor-note-decentralizing-gitcoin/11776",
                        "https://gov.gitcoin.co/t/articulating-gitcoindaos-impact-on-the-world/9994",
                        "https://gov.gitcoin.co/t/discussion-series-future-of-the-grants-program/11252",
                        "https://gov.gitcoin.co/t/weekly-grants-2-0-update-2022-6-14/10916",
                        "https://gov.gitcoin.co/t/weekly-grants-2-0-update-2022-6-7/10835",
                        "https://gov.gitcoin.co/t/suggestions-to-gitcoin-grants/10694/2",
                        "https://gov.gitcoin.co/t/devrel-gitcoindao/10161/3",
                        "https://gov.gitcoin.co/t/weekly-grants-2-0-update-2022-5-16/10625",
                        "https://gov.gitcoin.co/t/a-world-where-qf-enhances-every-income/10202",
                        "https://gov.gitcoin.co/t/the-plateau-of-productivity/10269",
                        "https://gov.gitcoin.co/t/gr14-round-structure-future-of-the-main-round/10391",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-14-2022/10414",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-20-2022/10789",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-15-2022/10453",
                        "https://gov.gitcoin.co/t/weekly-grants-2-0-update-2022-5-23/10679",
                        "https://gov.gitcoin.co/t/the-overton-window-for-grants-2-0/10461",
                        "https://gov.gitcoin.co/t/quadratic-funding-x-effective-altruism/10016",
                        "https://gov.gitcoin.co/t/rethinking-fdd-defending-against-fraud-optimizing-capital-allocation/11090"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "Token economics"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.459573899322101
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#2",
                    "likes": "8",
                    "time": "02/03/2022-04:29:16",
                    "content": "Thank you @kevin.olsen and congratulations on your first forum post! (great meeting you irl at ETHDenver and Boulder btw) Based on the current architecture, I would imagine that the Public Goods Funding Workstream might evolve to support this as a ‘round manager’ that could run all sorts of different types of funding rounds for different ecosystems and causes with this product suite as the underlying stack. Potentially this might mean even educating other organisations and foundations on how to run rounds of their own. What do you think? @ceresstation I really like how grants will be evolving and am excited to see it happen! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6706730769230775
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nategosselin",
                    "index": "#3",
                    "likes": "4",
                    "time": "02/03/2022-15:05:45",
                    "content": "Very excited to see this out in the world. Can’t wait to start building  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.4375
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/thelostone-mc",
                    "index": "#4",
                    "likes": "3",
                    "time": "02/03/2022-15:19:03",
                    "content": "Would these individual teams also share quarterly plans to ensure DAO is informed of the progress as these units likely are to operate independently and overlap over common pieces ? I would advocate for these and hold them at the same level as other streams so as to ensure these team doesn’t work alone but instead with input / feedback from DAO at a high level ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.810714285714286
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lthrift",
                    "index": "#5",
                    "likes": "6",
                    "time": "02/03/2022-17:51:37",
                    "content": "A lot of this architecture and product vision have been informed by the way the Gitcoin Grants program/Public Goods Funding Workstream have evolved over the the last 12-18 months with the significant scaling of siderounds and community appetite for aqueduct. So yes, the modularity and composability of the architecture are to support that continued evolution as we seek to build the tech that enables the amazing work Public Goods Funding Workstream is embarking!  Potentially this might mean even educating other organisations and foundations on how to run rounds of their own.  Yes! We have heard from PGF that they plan to educate others on best practices for running founds. We hope this is another flywheel effect between the tech and operations of scaling public goods funding. It should also provide a short feedback loop between how the tech is (or is not) enable round management since we’re working together within the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.869791666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#6",
                    "likes": "2",
                    "time": "03/03/2022-11:06:28",
                    "content": "I think we’re still in the phase where we’re building up our governance muscles here in the Gitcoin Product Collective but you’re spot on that the end state vision is one where we are converging on the workstream governance model. It’s our hope that posts like these will help broadcast our intentions and bring in collaboration from the DAO, and ultimately create a smooth transition when this work finds it’s home as one or more funded workstreams inside the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#7",
                    "likes": "4",
                    "time": "03/03/2022-12:14:09",
                    "content": "I especially like this line of thinking. With the new setup, we will be thinking less about “who will donate” and more about “how do we help them grow their ecosystem”. I see PGF being instrumental in:  Listening to customer feedback and suggesting tools to improve round running UI/UX to Moonshot Collective Continuing operations for a main and/or Ethereum round Building playbooks of “round running best practices” Discovering best practices by enabling round experiments like what are being discussed in the https://gov.gitcoin.co/t/proposal-gitcoin-gr13-matching-pool-allocations/9915/20  Setting up materials with MMM to begin collecting top of the funnel contacts to solicit for future rounds  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.898601398601398
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#8",
                    "likes": "3",
                    "time": "03/03/2022-21:06:23",
                    "content": "I’ll likely edit this to respond in more detail when time permits, but I just want to say amazing job on this roadmap @kevin.olsen @lthrift. I’m super optimistic about the direction put forward here, and specifically about the level of thought put into our path towards decentralization. Excited for the great revival. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.173611111111111
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lthrift",
                    "index": "#9",
                    "likes": "3",
                    "time": "03/03/2022-22:57:08",
                    "content": "  Listening to customer feedback and suggesting tools to improve round running UI/UX to Moonshot Collective   I don’t think this feedback would/should go to Moonshot Collective, but directly to the product team that is building this tooling. Innovation and continuous improvement should be a principal and practice of all teams building software for Gitcoin, not just Moonshot Collective. A bit of a tangent for a separate post, but Moonshot Collective has the opportunity to really be the “blue ocean” focused team on the continuum of the product development lifecycle within Gitcoin Product Collective.  Screen Shot 2022-03-02 at 7.35.23 PM1124×330 27.3 KB  ",
                    "links": [
                        "https://i.imgflip.com/66ckr5.jpg"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#10",
                    "likes": "3",
                    "time": "04/03/2022-18:31:16",
                    "content": "I am starting to see a marketplace develop that allows a user to plug and play their own rules for a grants round. They would select inclusive vs exclusive logic for grant eligibility, funding mechanism, and a sybil vendor. One example of these might be community curated, using QF Pairwise, and dPoPP standard sybil defense. Do you see moonshot innovating on the marketplace for each of these solutions or on new protocols and dapps altogether? (While acknowledging that it is their decision) Is that how you see the Gitcoin ecosystem expanding as well? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.536363636363636
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#11",
                    "likes": "4",
                    "time": "05/03/2022-02:11:33",
                    "content": "Very excited for this proposal. Super well-crafted and clearly a lot of long-term thinking here. This will be critical to making grants our grants program even better accessible to the community & scalable for years to come. Thank you for all this work! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.574652777777778
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lthrift",
                    "index": "#12",
                    "likes": "5",
                    "time": "08/03/2022-04:38:08",
                    "content": " I think Moonshot could certainly be innovating on new protocols and dapps in this space, but I don’t think they will be exclusively. My hope is that the future of Gitcoin Grants is not only built in an open source manner, but that strategy enables the open source expansion of the Gitcoin ecosystem.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.292207792207792
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#13",
                    "likes": "2",
                    "time": "15/03/2022-04:22:28",
                    "content": "Great and visionary overview, finally caught up on this and all comments below. I believe this post will be quoted often in the future, so for that reason, a little possible thing to edit is under 'questions you might have, this last bullet point…     kevin.olsen:  Why doesn’t this vision and strategy center on quadratic funding?   … seems to be missing an answer? Another question I personally have: will any of the work previously done by the dgrants team be recycled? Is part of what was done in that workstream over the past 6 months worth integrating into this new initiative? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.127768065268066
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/thelostone-mc",
                    "index": "#14",
                    "likes": "3",
                    "time": "21/03/2022-06:51:40",
                    "content": "    krrisis:  Another question I personally have: will any of the work previously done by the dgrants team be recycled? Is part of what was done in that workstream over the past 6 months worth integrating into this new initiative?   The work done by the dgrants team was to build out a POC which I believe we succeed. Building out the actual integration using the learning from the dgrants POC. While it is too early to say if code would be re-used, I do believe our decisions made here would be based off what we built out on dGrants ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0854978354978355
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#15",
                    "likes": "4",
                    "time": "24/03/2022-10:29:17",
                    "content": "Good eyes spotting that dangling question there, that definitely got lost in the writing/editing process. The answer was hinted at here:     kevin.olsen:  opening up our protocol to a broader grants ecosystem, and allowing us to prototype & test different funding mechanisms  more rapidly   So to flesh that out: our goal is to unbundle the gitcoin grants user and management experiences and provide a container that allows for a pluralistic future with many parallel mechanisms being deployed by different communities. Imagine a smaller ecosystem with high levels of trust, perhaps a DAO funding grants for internal teams, or an IRL community offering a small curated list of grants for their member to steer. We could see non-QF mechanisms being the right fit, and we want the grants 2.0 protocol to be the logical first place to stand up that grant program, and let these communities experiment on the meta-problem space of optimal distribution of funds for public goods. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.822268907563025
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#16",
                    "likes": "1",
                    "time": "06/04/2022-23:31:02",
                    "content": "i love this so much! is there more progress on this? is there a way I can be part of this conversation more often? it seems like there’s a symmetry for the work you guys are doing with modular design to facilitate mechanism design prototyping and what we’re doing in “The Matrix” (which I’m renaming to “Mechanism Design” for next season) squad within FDD. part of the vision is to build a simulation environment to do agent based behavioral analysis (using reinforcement learning/game theory) in an environment that is as close to reality as possible. Here is a rough document explaining our vision. i think it would be amazing if we met in the middle of our orthogonal perspectives and collaborate. ",
                    "links": [
                        "https://gov.gitcoin.co/t/ditch-quadratic-funding/10316/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#17",
                    "likes": "4",
                    "time": "11/04/2022-10:54:23",
                    "content": "    nollied:  i love this so much!   Awesome!     nollied:  is there more progress on this? is there a way I can be part of this conversation more often?   Yes, we’ve kicked off 2/3 workstreams, and will be kicking off the explorer/round manager here soon. I’d love to get you across the project, especially given the amount of overlap in thinking about mechanism plurality, data sharing, personhood/community anti-fraud signals… the list goes on. It’s great to see the dialogue unfolding across multiple channels, but I’m noticing the challenge of broadcasting, and sustaining a conversation around Grants 2.0. If you have some thoughts on a better way for us to keep people informed and involved (updates, community calls, dedicated channel in discord) I’d appreciate your ideas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.388888888888889
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#18",
                    "likes": "5",
                    "time": "12/04/2022-17:51:17",
                    "content": "Would love to help you get this support, definitely part of how a product marketer could help. Haven’t gotten any submissions to this yet, would love any help from anyone in promoting or making introductions to folks who might be interested.   twitter.com   seanmac.eth @smacmannis  This is it ❣️ @GitcoinDAO is seeking an ✨amazing product marketer✨ for our upcoming \"Grants 2.0\" suite. You'll work closely with @thrift_lindsey and yours truly.   RFP: https://t.co/UtvDtK66Ki   🔥Proposals due by 15 April, 2022 (early submissions welcome and encouraged!) 🔥 https://t.co/6TngE7fej5   seanmac.eth @smacmannis   alpha alert: an incredible opp is about to drop   tag in the best web3 product marketers you know     2:14 PM - 6 Apr 2022           9                4            ",
                    "links": [
                        "https://twitter.com/smacmannis/status/1511814732914651138?s=20&t=LnWwE5ZwrwV-1C_qjewb4w",
                        "https://twitter.com/smacmannis/status/1511814732914651138?s=20&t=LnWwE5ZwrwV-1C_qjewb4w",
                        "https://twitter.com/smacmannis/status/1511483092254425093",
                        "https://twitter.com/smacmannis/status/1511814732914651138?s=20&t=LnWwE5ZwrwV-1C_qjewb4w"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.291666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#20",
                    "likes": "4",
                    "time": "29/04/2022-04:53:38",
                    "content": "for sure! honestly having a discord channel dedicated to grants 2.0 where i and other interested parties can communicate with you guys that would be cool. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#21",
                    "likes": "4",
                    "time": "05/05/2022-12:03:05",
                    "content": "I think you’ve joined, but for transparency in the conversation here we’ve just spun this up! Currently limited to DAO contributors, with the potential to open up wider as we build our community engagement muscles: Discord ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8809523809523805
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/zkWolf",
                    "index": "#22",
                    "likes": "1",
                    "time": "20/05/2022-20:20:46",
                    "content": "Hi guys. We built a coordination tool for DAOs and creators to collect feedback. I created a sequence for this Gitcoin Grants 2.0 post as an example of how DAOs can use the tool.  Please have a look and let me know what you think. I also put together a quick write-up on how the tool works and how DAOs can use it here. Sorry for the slightly off-topic post. I blame @owocki for getting me jazzed up about DAO coordination tooling  Hopefully, the Grants 2.0 team will find the tool helpful for keeping in sync with the DAO at large!   ",
                    "links": [
                        "https://mirror.xyz/zeevoco.eth/v8hH_cLES4HASpKb9dgJq-_G9kL-u_PioaYykkS5-PA"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.918154761904762
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/thetagan",
                    "index": "#23",
                    "likes": "2",
                    "time": "24/06/2022-22:05:18",
                    "content": "My favorite part about this is that it is expanding the science laboratory. Though QF is an older concept, Gitcoin is testing new variables with new equipment. Now, we are able to upgrade after analyzing the test results. Creating better systems for funding public goods is the goal. So, what role will data scientists play in the future development of Gitcoin? How will they work with product designers? Furthermore, how can Gitcoin have a macro impact on policy design? What data from Grants 2.0 can help inform economic and governance design? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.188552188552189
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-grant-round-12-data-analysis/9526",
            "title": "Gitcoin grant round 12 data analysis ",
            "index": 9526,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/okeaguugochukwu",
                    "index": "#1",
                    "likes": "3",
                    "time": "26/12/2021-21:20:48",
                    "content": "Gitcoin grant  round 12 started on Wednesday  1st of December to Thursday 16th of December 2021. In gitcoin grant round 12 over  $6.1M was raised . More than 27k contributors  donated to gitcoin grant 12 .Gitcoin grants round 12 is the most successful grant round so far. WHY GITCOIN GRANT ROUND 12 MOST SUCCESSFUL GRANT Round 1 in Q1 of 2019 $38k was raised Round 2 in Q2 2019 $56k was raised Round 3 in Q3 2019 $270k was raised Round 4 in Q1 2020  $344k was raised Round 5 in Q2 2020 $475k was raised Round 6 in July 2020 $401k was raised Round 7 in September 2020 $700k was raised Round 8 in December 2020  $1M was raised Round 9 in march 2021 $1.9M was raised Round 10 in june 2021 $1.6M was raised Round 11 in September 2021 $2.5M was raised Round  12 in December 2021 $6.5M was raised showing the above Data using bar chart  20211230_203614978×663 62.7 KB  In gitcoin grant round 12  was improved with new features like polygon checkout , many new side rounds and thematic rounds . TOP 10 GRANT BY MATCHING AMOUNT  20211230_1908371080×1727 248 KB  INTRODUCTION OF SINGLE POOL single pool experiment was introduced  in gitcoin grant round 12 which is divergence from main pool . GITCOIN GRANT ROUND 12 ECOSYSTEM gitcoin grant round 12 proved be more successful,  by running 5 ecosystem round in GR12 (uniswap grants , polygon Grant’s, synthetix grant, Forefront Grant’s and Zk tech Grant’s) compared 1 ecosystem round  in GR11(Uniswap grants). GR12 also saw the introduction of Gitcoin’s decentralized grant protocol (Dgrants) CONCLUSION Am profusely happy for the record breaking grant 12 . Gitcoin is always getting better. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.279349618635333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "2",
                    "time": "27/12/2021-15:59:23",
                    "content": "    okeaguugochukwu:  While Ecosystem Rounds are aimed at rallying funding for and signaling sentiment within a particular project’s community,   Hi @okeaguugochukwu , thanks for taking a stab at this bounty ( analyze lifetime Gitcoin Grants Data Rounds -12 | gitcoinco Funded Issue Detail | Gitcoin | Gitcoin ).  Do you have any original analysis to add?  Most of your post looks copied from official materials. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.552083333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/okeaguugochukwu",
                    "index": "#3",
                    "likes": "2",
                    "time": "27/12/2021-17:44:29",
                    "content": "thanks for correcting me , I will look into it and correct my errors ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-round-12-grants-analytics/9538",
            "title": "Gitcoin Round 12 Grants Analytics ",
            "index": 9538,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/lljxx1",
                    "index": "#1",
                    "likes": "5",
                    "time": "28/12/2021-09:25:15",
                    "content": "DataStudio Full Report:  Google Data Studio    Gitcoin Round 12 Grants Analytics Google Data Studio turns your data into informative dashboards and reports that are easy to read, easy to share, and fully customizable.       PDF Report:  raw.githubusercontent.com    Gitcoin_Round_12_Report.pdf 1242.42 KB       Resource:   GitHub    GitHub - lljxx1/gitcoin-data-analytics Contribute to lljxx1/gitcoin-data-analytics development by creating an account on GitHub.      ",
                    "links": [
                        "https://datastudio.google.com/reporting/c310c50d-37b2-40e8-b210-b9efb836e101?utm_source=gitcoin",
                        "https://raw.githubusercontent.com/lljxx1/gitcoin-data-analytics/main/reports/Gitcoin_Round_12_Report.pdf",
                        "https://raw.githubusercontent.com/lljxx1/gitcoin-data-analytics/main/reports/Gitcoin_Round_12_Report.pdf",
                        "https://raw.githubusercontent.com/lljxx1/gitcoin-data-analytics/main/reports/Gitcoin_Round_12_Report.pdf",
                        "https://github.com/lljxx1/gitcoin-data-analytics?utm_source=gitcoin",
                        "https://github.com/lljxx1/gitcoin-data-analytics?utm_source=gitcoin"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.270833333333333
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-round-12-analysis/9549",
            "title": "Gitcoin Round 12 Analysis ",
            "index": 9549,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/kalverra",
                    "index": "#1",
                    "likes": "2",
                    "time": "29/12/2021-16:56:04",
                    "content": "This post is in response this Gitcoin bounty: analyze lifetime Gitcoin Grants Data Rounds -12 | gitcoinco Funded Issue Detail | Gitcoin | Gitcoin. See the work completed on my GitHub here: gitcoin-grants-analysis/main.ipynb at main · kalverra/gitcoin-grants-analysis · GitHub See the overall repo and README here: GitHub - kalverra/gitcoin-grants-analysis: An open-ended analysis of Gitcoin's grant system ",
                    "links": [
                        "https://github.com/kalverra/gitcoin-grants-analysis/blob/main/main.ipynb",
                        "https://github.com/kalverra/gitcoin-grants-analysis"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                }
            ]
        },
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-grant-analysis-round-1-12/9576",
            "title": "Gitcoin Grant analysis round 1 - 12 ",
            "index": 9576,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/stopdihode",
                    "index": "#1",
                    "likes": "2",
                    "time": "31/12/2021-10:05:07",
                    "content": "This post is an submission for the following Gitcoin bounty: Analyze Lifetime Gitcoin Grants Data Rounds -12 The results can be found here: Time-based trends in (Quadratic Funding) Gitcoin Grants See the github for the entire code script, with additional text: Gitcoin Bounty ",
                    "links": [
                        "https://ayrtonsambo.medium.com/time-based-trends-in-quadratic-funding-gitcoin-grants-546243a2b748",
                        "https://github.com/stopdihode/data_bounty/blob/main/nlp_preprocessing.ipynb"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "642"
}