{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-digest-38-bogota-recap-open-data-science-hackathon-continues-and-dao-stewards-v2-vote-is-up/11709",
            "title": "Gitcoin Digest #38 \\xe2\\x80\\x93 Bogot\\xc3\\xa1 recap, Open Data Science hackathon continues, and DAO Stewards V2 vote is up! ",
            "index": 11709,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "contributors",
                "stewards",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/alexdwagner",
                    "index": "#1",
                    "likes": "1",
                    "time": "21/10/2022-00:57:37",
                    "content": " 1442×260 92.3 KB  In this issue: Bogotá recap, Open Data Science hackathon continues, and DAO Stewards V2 vote is up!  First off, we want to know what you think of the Digest! Leave your thoughts here.  High-level, here’s what’s happening in the DAO this week:   Schelling Point/DevCon/ETH Bogotá Recap. Here’s a Youtube playlist of the best DevCon talks, according to Owocki. Schelling Point talks are live too!   DAO Stewards V2 vote on Snapshot – Vote now!   The Open Data Science hackathon continues through 10/31. Sign up here.   The discussion around how best to run GR16 continues.     In This Issue of the Digest  DAO Kudos   Hot Topics   Twitter Roundup   New Posts in the Governance Forum   This Week’s GreenPill Episodes   Weekly Gitcoin Blog Roundup     New and Active Governance Proposals  Upcoming Events   If you’d like to get the Digest in your inbox, sign up here. And now, this week’s DAO Kudos!    DAO Kudos Kudos from Core and Trusted DAO Contributors.  Kudos to June for locking down ops at MMM while CoachJ and Virya were at DevCon – CoachJ   Saf for stepping up and being a deep thought partner in DAO Ops S16 planning/reorg & pod thinking - kris Kudos to Lindsey for being a top-notch facilitator in our MMM <> GPC Strategy Sprint sessions – CoachJ   ePowell is crushing it with the open data hackathon AND the seeds to starting an open data community - Joe  To Nate for navigating a call remote with a full in person team. Big kudos to you - Janine  Will for doing an awesome job driving the development of our design system – Lindsey  Melissa & Laura H for jamming on this - Will  Tigress for driving our S16 objective setting workshops in a spectacularly thought provoking and effective way. - Joe   Shawn for his super structure skills - kris  Kudos to Azeem for killing it in Bogotá and doing an all-around amazing job representing Gitcoin - CoachJ      Hot Topics A roundup of interesting topics of the past week from within the GitcoinDAO ecosystem.   From Twitter   On Twitter, we posted the question, “Who inspires you to build in Web 3?”. The result, a “super kudos” thread. See the responses here.   The Reserve Protocol Hackathon begins on 10/25, with $250k in prizes! There are several workshops happening in the meantime. More details on the workshops and hackathon here.   What was your favorite Schelling Point moment? We’re putting together a thread, reply with your favorites.    Read this thread of Evan Powell’s thoughts on running the first two weeks of the Open Data Science Hackathon. Here’s a link to a Twitter Space that happened on 10/17 titled, “Open Data: building web3 native tools and dashboards”   Kyle Weiss asks, “How can we migrate Grants data from the platform to the protocol?”. Join the discussion here.      From the Governance Forum This week, we continued our discussions about the V2 Stewards Council, and how best to run GR16.   Proposal: V2 of the Steward Council, by shawn16400  Last week, Shawn16400 posted this proposal to improve the Steward Council. Since then, the proposal has gone to Snapshot! The proposal runs until Oct 25, 2022, 9:00 AM. Add your vote here.   [Request for feedback] Proposed Future for the Grant Programs and GR16 as we Transition to the Protocol, by Janine  This proposal was also shared in the Digest last week. Since then, the active discussion has continued, with numerous thoughtful comments by GitcoinDAO community members. From last week: “In the proposal, Janine proposes that GitcoinDAO should consider running a modified, smaller Grants Round for GR16 in December, or perhaps not running a Grants Round at all, so that Gitcoin workstreams can focus their attention towards shipping the new grants protocols(Passport, Grants Hub, Round Manager).” Catch up on the discussion and add your thoughts here.   Knowledge Transfer: Getting 1000x more sybil resistance out of POAP, by Owocki Owocki explores how the DAO might use POAP x Gitcoin Passport to create “1000x more sybil resistance”. Replies in the comments explore ways to flesh out the concept, and how to potentially offer a bounty to research how to build this.   FDD: some security & privacy issues in a protocol based grants system, by j-cook This post summarizes the discussions around privacy and security happening in FDD. TL;DR: The transition to Grants 2.0 is a huge opportunity to level up public goods funding in web3. However, this large upgrade brings with it a new set of attack vectors and privacy concerns that must be mitigated. Overall, increased security and privacy are the likely outcomes from the transition thanks to the removal of data from the protocol through the integration of Gitcoin Passport.      From the Gitcoin Blog This Week   The Secret to a Healthy web3 Community, by Alex Wagner Alex writes about how Web3 projects survive and thrive because of their communities, with a focus on cultivating healthy dev communities in your ecosystem, as well as how exactly community helps your web3 ecosystem grow.     Latest Episodes from Green Pill    Green Pill #52: Employment Commons with John Paller of Opolis. John Paller is the founder of Opolis, the next-generation employment ecosystem, as well as the Executive Steward of ETHDenver. Additionally, John is active in Colorado state politics, helping to drive his state towards a brighter and more just digital future. As a bridge builder between the old and new worlds, John discusses his approach to the regenerative Web3 movement as a buidler and leader. Building digital public infrastructure is paramount to creating a more positive future, and in America, Colorado is the place to do it.   Green Pill #53: MetaGame with Peth. Peth is working on MetaGame, the MMORPG interface for exploring the crypto world. As a place to explore and onboard into the ecosystem, users choose a house based on their interests and dive down a rabbit hole of building the MetaGame. In this episode, we explore MetaGame’s role in promoting the idea of Game B—creating an omni-win human civilization through coordination and collaboration. We provoke questions about emergent systems, and how we can first route talent into projects, and then route that talent into a more just ideological system.   Green Pill #54: Web3 Social with Stani Kulechov. Stani and team are building Lens Protocol, a permissionless, composable, & decentralized social graph that might just be the future of Web3 social platforms. In this episode, we dive into the current state of social media, how Lens Protocol is disrupting web2 social as we know it, and why the future of web3 social is so important.   Green Pill #55: Pluralistic Political/Economic Spaces w Jeff Emmett & Michael Zargham, BlockScience. On this episode Kevin chats with Jeff Emmett and Michael Zargham of BlockScience, an engineering, R&D, and analytics firm specializing in complex systems. In this episode, the three go deep on fascinating topics and discuss rabbit holes such as, what BlockScience actually is, the intricacies of complex adaptive systems, quadratic lands, and web3’s purpose.      Gitcoin Governance Overview Snapshot polls GTC Holders and Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, move on to Tally after being ratified on Snapshot.  Active Proposals:   Version 2 of the Steward Council – Ends Oct 25, 2022, 9:00 AM (Snapshot)   Proposal Discussions:   [Request for feedback] Proposed Future for the Grant Programs and GR16 as we Transition to the Protocol, by Janine    Latest Completed Proposals:   Public Goods Funding S15 Budget Request (second try) – Passed (Tally)     Upcoming Community Events If you have an event you’d like us to include in the Digest, reach out to @alexdw5 on Twitter or Discord. Every Wednesday:  12p ET – DAO VIBES – our weekly open community vibes call. Happens in the Citizen Forum on Discord.  Every Thursday:  1p ET - Gitcoin Gathering – Gitcoin Gathering is a series of personal development workshops led by Jon and Laura! Open to Core and Trusted Contributors. Let Saf know if you have any Trusted Contributors to add to the calendar invite!  For up-to-the-minute updates on Gitcoin events, check out our Events Calendar!    New to GitcoinDAO?    TLDR - What is Gitcoin?   Become a Gitcoin Citizen!    Sign up here to get the Gitcoin Digest in your inbox. Help us improve the Gitcoin Digest by interacting with this pol.is! Add your statements and vote on what others have put forward. Remember to check back regularly to vote on new statements. Thank you!  Previous edition ",
                    "links": [
                        "https://twitter.com/leafbauer/status/1582078056046678016?s=20&t=C0W2CFsjFECOGQbVhsqAVw",
                        "https://twitter.com/gitcoin/status/1583159311672684544?s=20&t=s6cJAgkCtRdyM3HzjO80TA",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x3c66d92024528cdcac3d541cfaf1842d4539f4b577e9a95ff6c62285506e1f26",
                        "https://gitcoin.co/hackathon/datascience/onboard",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624/7",
                        "https://twitter.com/CoachJ87",
                        "https://twitter.com/safderwords",
                        "https://twitter.com/thrift_lindsey",
                        "https://twitter.com/CoachJ87",
                        "https://twitter.com/epowell101",
                        "https://twitter.com/DisruptionJoe",
                        "https://twitter.com/heynate_g",
                        "https://twitter.com/JanineLeger",
                        "https://twitter.com/thrift_lindsey",
                        "https://laurawinn.studio/",
                        "https://twitter.com/charlize_io",
                        "https://twitter.com/DisruptionJoe",
                        "https://twitter.com/shawnlgrubb",
                        "https://twitter.com/krrisis",
                        "https://twitter.com/azeemk_",
                        "https://twitter.com/CoachJ87",
                        "https://twitter.com/gitcoin/status/1582851552921866240?s=20&t=vZEgPWCvxF9db4dKlDzhwg",
                        "https://twitter.com/gitcoin/status/1582756881759899648?s=20&t=ny-MvR9VhGOxZL-qPIhDhw",
                        "https://twitter.com/reserveprotocol/status/1582369839708262405?s=20&t=pJf_iuNbOY5dCJLHVTap_g",
                        "https://twitter.com/gitcoin/status/1582468213186535424?s=20&t=ny-MvR9VhGOxZL-qPIhDhw",
                        "https://twitter.com/epowell101/status/1582037553418379265?s=20&t=y657J8CvB5gdXx8zDDEdzg",
                        "https://twitter.com/epowell101/status/1582071737830625281?s=20&t=y657J8CvB5gdXx8zDDEdzg",
                        "https://twitter.com/kbw/status/1580716853835747328?s=20&t=kuiF-HIxpn36lZdb7Q2R6g",
                        "https://gov.gitcoin.co/t/proposal-v2-of-the-steward-council/11639/1",
                        "https://gov.gitcoin.co/u/shawn16400",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x3c66d92024528cdcac3d541cfaf1842d4539f4b577e9a95ff6c62285506e1f26",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624/7",
                        "https://gov.gitcoin.co/u/J9leger",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624/22",
                        "https://gov.gitcoin.co/t/knowledge-transfer-getting-1000x-more-sybil-resistance-out-of-poap/11677",
                        "https://gov.gitcoin.co/t/knowledge-transfer-getting-1000x-more-sybil-resistance-out-of-poap/11677",
                        "https://gov.gitcoin.co/t/knowledge-transfer-getting-1000x-more-sybil-resistance-out-of-poap/11677/2",
                        "https://gov.gitcoin.co/t/fdd-some-security-privacy-issues-in-a-protocol-based-grants-system/11678",
                        "https://gov.gitcoin.co/u/j-cook",
                        "https://go.gitcoin.co/blog/essence-of-a-healthy-web3-community",
                        "http://availableon.com/greenpill",
                        "https://www.youtube.com/watch?v=iNEYsF4arVE",
                        "https://twitter.com/PallerJohn",
                        "https://twitter.com/opolis",
                        "https://www.ethdenver.com/",
                        "https://www.youtube.com/watch?v=LyDwK9a8KrQ",
                        "https://twitter.com/petheth",
                        "https://twitter.com/MetaFam",
                        "https://www.gameb.wiki/index.php?title=Game_B",
                        "https://www.youtube.com/watch?v=eUi6rHYzupE",
                        "https://twitter.com/StaniKulechov",
                        "https://twitter.com/StaniKulechov",
                        "https://www.youtube.com/watch?v=JaOlug9tOQ8",
                        "https://twitter.com/jeffemmett",
                        "https://twitter.com/mZargham",
                        "https://twitter.com/block_science",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x3c66d92024528cdcac3d541cfaf1842d4539f4b577e9a95ff6c62285506e1f26",
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624/7",
                        "https://gov.gitcoin.co/u/J9leger",
                        "https://www.tally.xyz/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/39",
                        "https://twitter.com/alexdw5",
                        "https://calendar.google.com/calendar/u/0?cid=Y19pdHMwdGlmb2wybWtyZWVvbDQyOW5qNmhoa0Bncm91cC5jYWxlbmRhci5nb29nbGUuY29t",
                        "http://gitcoindao.com",
                        "https://primer.gitcoindao.com",
                        "https://gitcoin.notion.site/Become-a-Gitcoin-Citizen-7b83f9b5ca06487f84e0142d0180970a",
                        "https://form.typeform.com/to/ttNCMt8w",
                        "https://pol.is/2dc3urtbjf",
                        "https://pol.is/2dc3urtbjf",
                        "https://gov.gitcoin.co/t/gitcoin-digest-37-to-gr16-or-not-to-gr16-the-dao-deliberates-the-pros-and-cons/11649/2",
                        "https://gov.gitcoin.co/t/gitcoin-digest-39-halloween-weekend-plus-multiple-hackathons-running-on-gitcoin-this-week/11758"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.628729791865386
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/qijin",
                    "index": "#2",
                    "likes": "3",
                    "time": "28/10/2022-14:17:28",
                    "content": "周报#38中文版，欢迎订阅并关注中文twtitter（@GitcoinCN）参与互动！   news.gitcoinchina.com    DAO newsletter - Issue #38 波哥大回顾，开放数据科学黑客马拉松继续进行，DAO Stewards V2 投票结束！首先，这是本周 DAO 中发生的事情：Schelling Point/DevCon/ETH 波哥大回顾，根据 Owocki 的说法这是最佳 DevCon 演讲的Youtube 播放列表。Schelling Point 会谈也在直播中！DAO Stewards V2 在 Snapshot 上进行投票！Open Data Science黑客松将持续到 10/31。 在此注册。围绕 如何最好地运行...      中文可以订阅周报： http://news.gitcoinchina.com/ ",
                    "links": [
                        "http://news.gitcoinchina.com/issues/dao-newsletter-issue-38-1407548",
                        "http://news.gitcoinchina.com/",
                        "http://news.gitcoinchina.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "224"
}