{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-akita-create-credit-markets-for-akita/3920",
            "title": "[Proposal - Akita] Create Credit Markets for AKITA ",
            "index": 3920,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/algocrypto",
                    "index": "#1",
                    "likes": "5",
                    "time": "29/05/2021-13:59:41",
                    "content": "Motivation Based Loans has recently started money markets for the under-served community-driven projects such as Akita, filling a significant gap in the lending market. The announcement has motivated me to write this proposal. Why I believe Gitcoin should deposit its Akita tokens in lending markets for the following reasons:  Having a large credit market for Akita enables its trading on the market. Traders and asset management platforms use lending markets to deploy strategies that trade billions of dollars every day. By building a thick lending market for Akita on Based Loans, and the likes of it, Gitcoin and Akita communities stand to benefit from having a tradable token on the market. A large money market for Akita will likely generate revenues (interest, farming rewards, etc.) to Gitcoin’s treasury as well as Akita token holders. These revenues can be put to work for the community. It offers the token asset, and the project behind it, the legitimacy it needs. Many argue today that community-driven tokens such as Akita are not serious projects because of the lack of a clear value proposition. I personally disagree with this notion, however, it is a common view. Having thick credit markets on lending protocols offers Akita a better presence in the market, increasing its utility and perceived value.  Implementation  Deposit $25-50M worth of Akita (or more) to Based Loans. Allocate additional 10% of the total deposited Akita amount as rewards. This will encourage Akita token holders to deposit their tokens in the market. Non-token holders will have an incentive to buy the token and deposit it for the rewards. Ask Based Loans to offer additional rewards for depositing Akita.  Links https://based.loans/app/ ",
                    "links": [],
                    "GPT-summary": "The author proposes that Gitcoin should deposit its Akita tokens in lending markets to create a thick credit market for Akita, which will enable its trading on the market and generate revenues for Gitcoin's treasury and Akita token holders. The proposal includes depositing $25-50M worth of Akita to Based Loans and allocating additional rewards for depositing Akita. The post does not contain entirely positive or negative feedback, but rather constructive criticism and advertising of the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.221790890269151
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#2",
                    "likes": "0",
                    "time": "03/09/2021-15:35:49",
                    "content": "    algocrypto:  Because of the lack of a clear value proposition   Hi @algocrypto, I think this proposal make sense, this could be a great side investment project for GitcoinDAO. Why should we lock 25-50M worth of Akita token, why not 500K or only 1M? Does the loan require to lock collateral? If so, why should we lock 25-50M worth of Akita? There is about no risk to lend a loan with locked collateral. Also, why should we keep 10% for additional reward when we are going to offer loans at a fixed or variable rate and make a ROI on these loans, we should use this amount to reward the contributors instead or using a 10% witch is roughly around 2.5M from 25M. I think this proposal is not clear, neither what we will do with the allocated funds. I might be wrong, this is just my opinion but a more detailed proposition or formal breakdown would be required here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.840909090909091
                }
            ]
        }
    ],
    "group_index": "402"
}