{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoins-orbit/8812",
            "title": "Gitcoin's orbit \\xf0\\x9f\\x8c\\x97 ",
            "index": 8812,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "10",
                    "time": "15/10/2021-04:57:59",
                    "content": "In his most recent podcast appearance, Ethereum DevRel Personality Austin Griffith described the circles of “orbits” in ethereum dev as follows.  Outer orbit is heard the name Ethereum Inner - used metamask or Ethereum Inner 2 - wrote a smart contract Inner 3- working in the ecosystem  He says his job is to pull people into the inner orbits of Ethereum at scale. I thought it was such an interesting way to think about ecosystem onboarding, that I went ahead and tried to outline what a similar model for Gitcoin looks like. Here is a simplistic one:  Screen Shot 2021-10-14 at 11.21.54 AM1096×864 65.8 KB  Building open that, if you consider where we’re having a positive impact on our communities further:  Screen Shot 2021-10-14 at 11.21.49 AM1146×868 78.5 KB  Here is an orbit model that considers what  “DAO of DAOs” might look like.  Eg partner ecosystems which we are technologically or culturally or economically integrated who participates in our success and visa versa.  Screen Shot 2021-10-14 at 10.56.07 PM1738×846 47.6 KB  If people think this type of model for thinking about the DAO health is helpful pls let me know. ",
                    "links": [
                        "https://gov.gitcoin.co/t/a-brief-history-of-gitcoin-from-2017-2022/9431",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-formerly-week-in-governance/8844"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.481737012987013
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/0xhxu",
                    "index": "#2",
                    "likes": "1",
                    "time": "15/10/2021-07:25:32",
                    "content": "The last picture is impressed. If community grows up in this way I think we are doing amazing DAO… Btw,what’s the meaning of visa versa? Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lee0007",
                    "index": "#3",
                    "likes": "1",
                    "time": "16/10/2021-21:42:34",
                    "content": "As a new DAO contributor, I find this overview very helpful. I have applied this model to indicate and gather consensus on where Ambassadors will operate - throughout the orbit of contributors. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.840909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/boris",
                    "index": "#4",
                    "likes": "4",
                    "time": "21/10/2021-04:18:23",
                    "content": "For further reading, see the Orbit Model orbitmodel-dot-com and the Github repo github-dot-com/orbit-love/orbit-model, which is more about community than Kevin’s broader point — which is great!  The Orbit Model contains five fundamental concepts: Gravity, Love, Reach, Orbit Levels, and Presence.   Gravity is the attractive force of a community that acts to retain existing members and attract new ones.  Love is a member’s overall level of engagement and impact in the community.  Reach is a measure of a community member’s sphere of influence.  Orbit levels are a practical tool for member segmentation and help you create different programs for different types of community members.  Presence is a measure of a community member’s activity over a period of time.  The goal of the Orbit Model is to increase the Gravity of your community.  Thinking about specific tasks that people can do that help them engage — but also “gain influence” to spread to others as Kevin has done is a useful exercise. Maybe this is a series of “Onboarding” tasks. The Discobot here in Discourse can even be customized to help people learn and take actions. (Don’t have Discourse gravity to be allowed to post links — maybe @staff can help) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.556818181818182
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#5",
                    "likes": "3",
                    "time": "04/11/2021-22:18:33",
                    "content": "One of the desginers in our network ( @octaviantroudt) made this version of the orbit which is v visually appealing!  39a0bfed-fa30-4ef9-8b0b-7d2c6c804b331040×442 51 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                }
            ]
        }
    ],
    "group_index": "592"
}