{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/using-kleros-in-the-appeals-and-dispute-resolution-of-the-gitcoin-grants-protocol/12511",
            "title": "Using Kleros in the appeals and dispute resolution of the Gitcoin Grants Protocol ",
            "index": 12511,
            "category": [
                "\\xf0\\x9f\\x8c\\xb1 Grants"
            ],
            "tags": [
                "FDD",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/gmkung",
                    "index": "#1",
                    "likes": "4",
                    "time": "06/01/2023-15:42:59",
                    "content": "As Gitcoin moves ahead with the Grants Protocol this month, I’d like to propose a solution for the decentralization of the dispute and appeal resolution processes (which are now primarily carried out by the FDD). Kleros has served as a reliable independent judiciary for DAOs and decentralized communities since 2017, serving more than a hundred different projects, including Uniswap, 1Inch,  Ledger, Gnosis, Galxe, Lens Protocol and Panther Protocol. Managing grant approval, dispute and appeals is a highly subjective process that is challenging to decentralize, and finding a robust solution for it is therefore ever more pertinent. I’m proposing to have Kleros Court serve as one of the (primary) options for the decentralized handling of disputes and appeals. In this setup, the FDD will serve as the legislators and custodians of the process, curating and managing the ruleset that will be used by the Kleros jury to arbitrate on each dispute. This presents not only a credibly neutral dispute resolution solution for Gitcoin’s community, but also greatly increases the scalability of the operations of the protocol by leveraging the wisdom of a crowd-sourced jury. I welcome feedback from the community and the FDD on this proposal before diving into more details for a potential integration. ",
                    "links": [
                        "https://kleros.world/",
                        "https://kleros.io/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Interoperability and Scaleability",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.771428571428571
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ludoviko.poh",
                    "index": "#2",
                    "likes": "1",
                    "time": "06/01/2023-19:59:10",
                    "content": "Hi, I am was a lurker of gitcoin forums but this post made me sign up for the forum to write a reply. I do not have much time to give an exhaustive reply at the moment, but I will write one in the relative near future. In my opinion, which I think it is shared with some others in the space, Kleros would be the worst Organization to hand over the dispute resolution. Their principle of decentralized justice is perfect in its design, but in reality the protocol is highly concentrated and the conflict resolutions are biased towards whales in their system, some of the whales directly associated with one of the founders (proof upon request, cannot post URLs now) to protect their interests. In Proof of Humanity, a DAO that I am a member and a highly-voted author, we are struggling with Kleros and its tactics since the beginning, just to obtain a minimum degree of autonomy and sovereignty. We are in the process of splitting the DAO precisely due to this conflict. Handing this power to Kleros would be handling the power to a limited amount of actors. I would research the PNK token distribution, and the governance manipulation tactics they have done in PoH before moving any further. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.16525974025974
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/gmkung",
                    "index": "#3",
                    "likes": "4",
                    "time": "07/01/2023-05:21:36",
                    "content": "Thank you for showing interest in this thread, Luis. I think the points you raised are very important in the selection process for a dispute resolution system, especially for a project as important as Gitcoin. The mechanism design of Kleros Court follows the principles of Credible Neutrality mentioned by Vitalik, in which “just by looking at the mechanism’s design, it is easy to see that the mechanism does not discriminate for or against any specific people”. This is a point that has been largely acknowledged thus far in this thread. To address a side topic so we hopefully concentrate on the topic at hand: Kleros have been stalwarts of decentralization since the beginning and Proof of Humanity DAO was designed by Kleros with a one-person-one-vote voting system. The decision to separate the Kleros tokens (the PNK) from the PoH DAO governance was conscious and intentional. Regarding the fork in PoH DAO: Kleros acknowledged the presence of differing and irreconcilable opinions in the community and actually initiated the peaceful fork, a move that would have been unnecessary if Kleros Cooperative indeed had dominance over the DAO. With that aside, I’d like to ask for comments from other members of the Gitcoin community to discuss this proposal for the next step in Gitcoin’s progressive decentralization. ",
                    "links": [
                        "https://blog.kleros.io/proof-of-humanity-building-the-internet-of-humans/",
                        "https://snapshot.org/#/poh.eth/proposal/0xe23fa2fc78fe95c9b904e6197eb88135dff859956f4474d13f5c622ec2188da5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.67593537414966
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#4",
                    "likes": "1",
                    "time": "07/01/2023-16:03:39",
                    "content": "I’m not super deep on this topic, but @owocki was a big proponent of forking Kleros to run on GTC and having that as the arbitration mechanism for the protocol. I believe the concerns that @ludoviko.poh raises were the driver for this recommendation. Curious what folks think of this direction… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/gmkung",
                    "index": "#5",
                    "likes": "2",
                    "time": "07/01/2023-16:28:06",
                    "content": "Hi @kevin.olsen on this topic, the usage of a DAO’s own token for arbitration in a Kleros-style court is intuitive, but can be problematic as it tends to interfere with the original tokenomics of the DAO’s token (e.g. GTC). One situation in which this can become problematic is when the DAO’s token is used for other activities such as staking or voting in other parts of the DAO. As Kleros-style courts require jurors’ tokens to be immobilised in the court they choose to stake in, these tokens become unavailable in other activities of the DAO. Likewise, if it is desirable to have large components of the DAO’s token be directed towards voting/staking in DAO governance, they become unavailable to secure the arbitration Court. A purpose-specific token (i.e. meant only for arbitration) is therefore desirable, and the most efficient way to build the value and community around such a token and court system is if it is used for as many dApps and projects as possible (i.e. not project specific), allowing the community expertise, experience and token liquidity to be pooled together. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.790816326530612
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/griff",
                    "index": "#6",
                    "likes": "1",
                    "time": "07/01/2023-18:00:59",
                    "content": "Which chains is Kleros on? How easy is it to resolve disputes on a less popular EVM chain, like Celo, for instance? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.444444444444445
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/gmkung",
                    "index": "#7",
                    "likes": "2",
                    "time": "07/01/2023-18:21:24",
                    "content": "Kleros is on Ethereum and Gnosis chain at the moment, but we will be announcing the roadmap for bridging to other EVM chains in the near future. Kleros can theoretically solve disputes in any environment or chain (even off-chain ones like this one in Mexico), though trustless enforcement of rulings will require either the grant payout contracts to be on the same chain as Kleros Court, or on a chain where Kleros Court has a bridge to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.975
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ludoviko.poh",
                    "index": "#8",
                    "likes": "1",
                    "time": "07/01/2023-19:07:26",
                    "content": "    gmkung:  The mechanism design of Kleros Court follows the principles of Credible Neutrality mentioned by Vitalik, in which “just by looking at the mechanism’s design, it is easy to see that the mechanism does not discriminate for or against any specific people”. This is a point that has been largely acknowledged thus far in this thread.   Again, things that are on paper are nice, but in practice the facade of ideal mechanisms falls pretty rapidly. Vitalik himself questioned how is it possible that credible neutrality and I quote him directly from his blog post “DAOs are not corporations”, where he speaks directly about Kleros:  Whether through a more widely distributed token supply, or through more use of non-token-driven governance, a more credibly decentralized form of governance could help Kleros avoid such concerns entirely.  I beg to differ, then, that Kleros represent a credible neutralty.     gmkung:  To address a side topic so we hopefully concentrate on the topic at hand: Kleros have been stalwarts of decentralization since the beginning and Proof of Humanity DAO was designed by Kleros with a one-person-one-vote voting system. The decision to separate the Kleros tokens (the PNK) from the PoH DAO governance was conscious and intentional.   Kleros designed PoH so that it never becomes an independent DAO, and has used dirty tactics to attack whoever tries to reach some level of DAO sovereignty, so I am very doubtful of that claim. Kleros exploited peoples’ innocence during the registry mechanism so that it bloated it’s base dispute numbers, which up to the creation of PoH was failing to reach some credible amount. In terms of decentralization, Clement Lesaege campaigned to remove the Proof of Humanity’s Mission Board, hours after he was removed due to an accumulations of dictatorial behaviour, such as hacking the one-person-one-vote mechanism by mass recruiting vulnerable people in Myanmar, creating his own Hermit Kingdom of people that pre-delegated their vote to him, without letting them know of the alternatives (proof on request). These are the sort of anti-values that Kleros represents: the opposite of everything Gitcoin tries to build on web3. It would be a huge mistake to cede a critical aspect of GTC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5675170068027215
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#9",
                    "likes": "0",
                    "time": "08/01/2023-15:38:17",
                    "content": "Thank you for sharing. I’d heard there was drama but hadn’t been able to learn more about this yet. What alternatives would you recommend we look at for dispute-resolution systems as we investigate this space? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/M0nkeyFl0wer",
                    "index": "#10",
                    "likes": "2",
                    "time": "13/02/2023-20:00:56",
                    "content": "Would love to dig into this discussion more with along Shawn and allies. This is such an important part of the DAO space and all of our work and there are a lot of options and lessons learned from the digital democracy space in general. Full disclosure I’m a fan of multi attribute decision making and tools focused on fairness tied to roles as opposed to models that strictly attribute more voting power to those with more tokens (or staked tokens). Cheers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.555555555555555
                }
            ]
        }
    ],
    "group_index": "285"
}