{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/03-16-dao-vibesss/10191",
            "title": "03/16 DAO Vibesss ",
            "index": 10191,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#1",
                    "likes": "2",
                    "time": "23/03/2022-15:54:07",
                    "content": "Gitcoin’s DAO Vibes is a weekly hour (Weds @12 EST) for the community to hangout and discuss DAO values, current events, and crypto twitter. Gracefully hosted by Loie and Owocki. We have discussed everything from campfire Schelling points to baboon coordination mechanisms and the war in Ukraine. Catch up on prior DAO Vibes by reading the notes below and be sure not to miss the next one in the Gitcoin Discord Add Event to your calendar   3/16 DAO Vibezzz       Loie destressing from travel by working for the DAO   DAO contributors are a third breed of tech workers: less gritty than startups/FAANG, more spiritual and looking for belonging. See Tweets:  https://twitter.com/owocki/status/1504110829511225351?t=mKuqzGXHlZ8OE3E1wiNfqQ&s=19 https://twitter.com/smacmannis/status/1504125312971390981   Solarpunk comes from steampunk and cyberpunk and gives us grit. We’re also on the frontier and surviving winters (like the great bear: https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855)   Lindy Effect is a measure of how far a technology has survived in capital and time  https://en.wikipedia.org/wiki/Lindy_Effect If something survives for five years then it’s likely to survive five more Lindy is like accumulating stability Thanksgiving turkeys show where Lindy stops: they live 800 days until day 810 they get their head chopped off Are DAOs being fattened up to get eaten? The difference between fragility and anti fragility: when stress is applied to the system it gets more stable WeWork was not Lindy. It had a lot of value and was overinflated before it collapsed. It was fragile and unstable.  A real estate company trying to be a software company   Example of something that was Lindy till it wasn’t is the British Empire (and the dutch empire before it)  See Ray Dalio’s Changing World Order: great book! https://www.amazon.com/Changing-World-Order-Nations-Succeed/dp/1982160276/  Link to 45 minute Youtube Summary: https://www.youtube.com/watch?v=xguam0TKMw8      Tulip Bubbles  We think we’re training flowers but they’re training us  Apples, Cannabis, Tulips, Potato Explored in the book Botany of Desire: https://www.amazon.com/Botany-Desire-Plants-Eye-View-World/dp/0375760393    Tulip Trade: There was a Tulip economy in the Dutch Empire. Similar to crypto experiment. Breeding of Tulips for rare, coveted trades created Tulips as a store of value, and were a form of currency Mushrooms are also something we feel we manipulate but actually they can take over the brain of a being and makes it eat food that the Mushroom likes  Mushrooms can take over and turn ant bodies into spore carrying members of mushroom club Kind of like Mind-Flayers     How’d you get into Web3? What sparked your curiosity and why are you working in it today?   Ben West: was introduced to Blockchain Technology when a friend was mining bitcoin in the back of a Yoga Studio. As an environmental activist he needed a place to host an event. His friend showed him the bitcoin mining rig in the back (being used to dehydrate fruit haha). His friend was an anarchist and activist who set the stage for how he saw crypto. There was a community of counterculture people who discussed big banks and how to change the power/control they had over things like financing fossil fuels. DAOs remind him of the most exciting things happening in nonprofit sector and bringing visionary people together. Visionary DAOs making new systems. Legitimate Concern about Energy Use: is the massive amount of energy being used for mining serving a useful function? Further, it is important to not just focus on the demand but also the supply of energy. Need to focus on supply source (using not fossil fuels). Enjoys being part of a cultural shift about the world being arranged in a new way. Crypto is about the people who are trying to fix broken systems. Big fan of Eth because switch to Proof of Stake driving down energy usage.  Colton: A year ago quit his job working on a SpiderMan Video Game and heard about people making a lot of money on NFTs. Crypto journey had a lot of chapters. Came in for the money, stayed for the memes, stayed for the community. Really interested in using crypto to make gamification mechanics to incentivize people & communities to build the right world. His work on GreatestLarp put the Fun in Fundraising. Play to Earn Mechanics “for good”. Crypto enables a digital-first point system with real value. Jane McGonigal doing some great work on gamification: https://janemcgonigal.com  Armando: Using Game Theory + crypto to come up with mechanics for good Leon: Civ 6 has some built-in quadratic engines Ben West: Think Tanks and Military are both using games to recruit people. Storytelling is a vital component of what it means to be a human being    Umar: greatestlarp.com sent him DAOwn the rabbit hole about coordination and coordination failure. The story of Anon v Moloch introduced a framework for thinking about coordination. Being a person from a poor neighborhood, he sees rich people with plenty of money and poor people who are homeless or don’t have food to eat, as a coordination failure. There is enough food and money in the world but it’s not distributed properly. Crypto is the coordination layer that could help fix this  Sean: Paid attention to crypto for years. He remembers when Dread Pirate Roberts got arrested down the street from him. He never thought he could work in it as a non-technical person. But having spent 15 years in online advertising, he was able to see Crypto as a new business model for the internet, an internet without middlemen. His former employer Pinterest and other online companies like Facebook use users and user data to make profit/make their flywheel run. He saw crypto and blockchain as a way of building an internet that allowed the average user to have control over their data and get power back from the internet companies  Colton: also didn’t know there ways for nontechnical people to contribute to Crypto but now knows there are. Owocki: need more systematic linear onboarding so people can find opportunities and not just bounce around on twitter/discord    Loie: In her early days in web3 did not feel like there was a space carved out for people people. As a nontechnical person, she did not feel welcome as a nontechnical person or like crypto people realized how much value she could bring. But now it feels like people do know that.  Owocki: Loie is inspirational because she is creating that niche for people-people and nontechnical people Armando: if people hear web3 right now, they may think its just a rebranding of crypto still filled with a lot of Ponzi schemes. In web2 companies created B-corp certification that gave seal about the company creating positive externalities. Q to everyone: should we create new branding that leads to positive or regeneration web3?  Owocki: Impact DAOs are the core unit creating positive externalities. We’re creating maps of Impact DAOs Armando: the narrative outside web3 is very different from the narrative inside. as we onboard new people how do we make a clear narrative of web3 as having two paths, regenerative/positive vs ordinary web3? Kevin Olsen: Regen vs Degen meme is along those lines. DAOs don’t have an obligation to maximize profit for shareholders and this changes the value alignment. We could establish a pattern-language for regenerative projects or Impact DAOs Umar: Need to spread the greenpill meme and resources to more people outside of Web3  GreenPill Podcast: https://www.youtube.com/watch?v=3_8CPpVaaGA&list=PLmkdAgtxf3ah0Vmyy1B3OU8BPacX4_gVY  GreenPill Book: https://store.gitcoin.co/products/green-pill-book-digital-edition  GreenPill DAO + Docuseries: https://garysbrain.notion.site/Greenpill-DAO-The-Web3-Powered-Movement-to-Regenerate-The-World-Design-Doc-d5b05585cbc14f48a80382ac02606a15         Ale Borda: She remembers her first time coming across crypto she saw it as a money-making machine for gaming. She came from a non-profit background (building houses, social entrepreneurship) before she jumped into web3 and learned more.  Then she saw new ways to build monetary systems or local economies to fix problems. She saw people who had switched from extractive to regenerative, abundance mindset over scarcity mindset, and she wanted to be a part of this! Lots of Impact DAOs trying to do regenerative work and have a positive impact. Web 3 is a schelling point of people who want to create an impact. ReFi is regenerating environment and economy. She sees a big shift towards projects focusing on positive externalities. She hopes talented people seeking a way to make a meaningful impact on the world find their way to Web3 and Impact DAOs.  Amira: She had worked in some toxic work environments, curious about web3, but didn’t know the legitimacy of it.  She agrees that from the outside, if you don’t know about Web3, it seems like a space you can’t understand. It’s important to attract the right kind of people with positive values. The values of Web3 are so crucial and aligned with her personal values. Folks on the outside don’t know about the values  Ale: In no other community can I talk about meditation, physics, biomimicry, coordination, economics, values other than this web3 community    Huxwell: he was a non-technical person worried he couldn’t make it but got into web2 development. In 2017 he learned about solidity/ethereum in a workshop. In 2019 at a conference he learned about the future of software development, future of work, and gitcoin. He was sick of the hierarchal models in traditional world which extracted value from users and decided to take the plunge into Web3. Onboarding people is hard — so many new people, new concepts, new projects all claiming to be the best. It’s too easy to get trapped in Ponzi schemes. Could we have a curated list of projects? For example could grants review system provide a greenpill badge that a project is verified ?  Lindsey: She is very passionate about self-organizing teams and the human aspect of building software. A friend (Kyle W) of 10 years introduced her to Gitcoin’s mission. She was thinking about how we build high-performing product, software teams and that sent her down the rabbit hole. Interested in human impact, making a difference in the world, and flexing her skills building self-organizing teams.  ",
                    "links": [
                        "https://www.addevent.com/event/Df11942915",
                        "https://www.youtube.com/watch?v=D6ovaCmBBPE",
                        "https://twitter.com/owocki/status/1504110829511225351?t=mKuqzGXHlZ8OE3E1wiNfqQ&s=19",
                        "https://twitter.com/smacmannis/status/1504125312971390981",
                        "https://gov.gitcoin.co/t/the-great-bear-the-great-reset-the-great-revival/9855",
                        "https://en.wikipedia.org/wiki/Lindy_Effect",
                        "https://www.amazon.com/Changing-World-Order-Nations-Succeed/dp/1982160276/ref=sr_1_1?crid=XPBVTJDK2VEJ&keywords=changing+world+order&qid=1647452147&s=books&sprefix=changing+world+ord%2Cstripbooks-intl-ship%2C337&sr=1-1",
                        "https://www.youtube.com/watch?v=xguam0TKMw8",
                        "https://www.amazon.com/Botany-Desire-Plants-Eye-View-World/dp/0375760393",
                        "https://janemcgonigal.com/",
                        "http://greatestlarp.com",
                        "https://www.youtube.com/watch?v=3_8CPpVaaGA&list=PLmkdAgtxf3ah0Vmyy1B3OU8BPacX4_gVY",
                        "https://store.gitcoin.co/products/green-pill-book-digital-edition",
                        "https://www.notion.so/The-Web3-Powered-Movement-to-Regenerate-The-World-Design-Doc-d5b05585cbc14f48a80382ac02606a15"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.702908328010787
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "1",
                    "time": "23/03/2022-18:36:42",
                    "content": "Thanks Umar, this is great to have  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "31"
}