{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/poap-edition-gitcoindao-digest-13-2022/10363",
            "title": "POAP Edition! GitcoinDAO Digest #13 2022 ",
            "index": 10363,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#1",
                    "likes": "2",
                    "time": "14/04/2022-22:13:36",
                    "content": " 1600×381 61.7 KB  - Weekly highlights and hot topics from the GitcoinDAO community Welcome to the GitcoinDAO Digest, a community-led publication with TLDR-summaries of the most important discussions and proposals in the GitcoinDAO, along with relevant links for further reading. Without further ado, let’s dive in!  If you would like to receive this newsletter in your inbox, sign up here!   Key actions for this week:  Vote on the proposal to start a Partnership and Mutual Grant with Wonder  Help us improve the GitcoinDAO Digest by answering a couple of quick questions and qualify for a very special POAP!  Jump in to Owocki’s AMA that will run for the month of April!    Meta-Governance    @ceresstation announced the start of Constructing a Mutual Grants Committee as opportunities continue to emerge to align with partners who are committed to a public goods related mission. The committee will fill the current lack of formalization behind mutual grant agreements. Stewards and members of the Public goods funding-Workstream are invited to join a working group   The discussion about a Partnership and Mutual Grant with Wonder now includes takes from several community members and Stewards. Those in favor generally approve of reducing the grant to 50k GTC from 100k and point out that Wonder is being built by KERNEL alumni. Those against the proposal point out that Wonder is not yet open-source, and does not appear to have a clear or special strategy to build a public good.   Huxwell gives an update on the dCompass project nearing alpha release and asks the community for advice on how to continue funding the project. Check out the staging app now!   In DAO Design Best Practices, David_Dyor and Layn describe how Gitcoin does not have an IRP (Incident Response Plan) like the ones used by organizations to respond to emergencies or natural disasters. David encourages Layn to start drafting an IRP for Gitcoin and Layn updates us on their research findings. Few DAOs have IRPs but MakerDAO notably has a well-documented Emergency Shutdown plan.   Bob gives Gitcoin grants advice based on [his] observations that grantees did not have enough information about the status their grant was in and why. He proposes creating additional grant statuses to provide greater granularity and detail to the grantee.   Follow and join the GitcoinDAO Contributor List on Twitter     GitcoinDAO Governance Overview:     Proposal Discussions Active Proposals Latest completed proposals     [Forum] Partnership and Mutual Grant with Wonder  Partnership and Mutual Grant with Wonder Ends: April 15th  Ratify the Results of Grants Round 13 and Formally Request the Community Multisig to Payout Matching Allocations For: 100%   Proof Of Impact      Data Science @ Gitcoin DAO     Treasury Diversification Part II - Welcoming Strategic Partners        Workstream Discussion    Public Goods Funding    Every Wednesday, the Public Goods Library hosts a philosophical discussion in the Gitcoin Discord server, with topics ranging from DAOs, community, governance, and everything in between that ties back to web3 and public goods. Check out one of our past calls on Open Source Community and Grassroot Blossomings by Tua from Parents’ Nook! Don’t miss the next one – add this event to your calendar.   Round 13 results were ratified and payouts will go live this Friday 4/15!   @ceresstation is discussing a partnership with Protocol Guild for an upcoming grants round to provide more curated support to Ethereum Protocol Devs.     Moonshot Collective    Green Pill Podcast Episode 8 hosted by Kevin Owocki is live! This episode features Simona Pop, who is the founder of the bounties network, builds community at Status, and works on DAO engagement strategy at Gitcoin. They discuss the meaning of human thriving, how crypto spreads to new communities, and the power of bounties.   Moonshot Collective builds prototypes of decentralized tools for DAOs. Are you interested in demoing Tip Party(reward participation) or Pay Party(vote on contributions) for your DAO, Workstream, or Team? Send us a DM on Twitter!     Fraud Detection & Defense (FDD)    We are hosting a Big Sybil Event on Monday 4/18 to collectively build a roadmap for the future of our sybil defense efforts.   Our Season 13 Contributor Experience survey found that many FDD contributors see themselves as co-creators, share enthusiasm, and feel on fire! However, some contributors experience ambiguity and uncertainty around roles and responsibilities. We are looking into improving ourselves continually by more clearly defining roles, making information easier to find, and establishing feedback loops.   Season 14 OKRs, outcomes, and deliverables are being planned this week with feedback from the leadership retreat attended by Disruption Joe & Tigress from FDD     Merch, Memes & Marketing    We’re hard at work getting ready for Schelling Point Amsterdam! We’ve submitted final production designs, a bunch of POAPs and special merch for the affair. Looking forward to throwing a coordination party!   The Can Devs Do Something-meetup series will activate in Amsterdam. This time will be a special Art Edition where we’ll take a group trip to The Van Gogh Museum to connect together away from keyboards! Claim ticket here.   We’re working on an artist outreach program to expand our contributor list and keep the creative juices flowing.   We welcomed back our operations gurus Coach J and Laura from their 2-week meditation treat. Mental health is wealth! Welcome back!     DAO Operations    We are hiring! We need a Hiring Manager, and Support Lead.   Our Knowledge Base has been migrated. The latest and greatest information can be found at support.gitcoin.co   We’ve established a public google calendar for GitcoinDAO. Add and follow it to see the details on the Forum Improvement Project on 4/15   Read our new events policy to find out what costs can be covered when traveling to a conference     Upcoming community events    Drop in on our weekly DAO Vibes & Office Hours w. Kevin Owocki on Wednesdays at 12PM ET on Discord! We have been seeing great attendance and engagement and we would love for you to join us. Afterwards there is the Gitcoin Contributors Happy-Hour starting at 13.30PM ET.   Community Onboarding Call! New to Gitcoin? The next event will be Monday, April 25th from 1:00 to 2:00 PM EST. We’ll tell you all about how we’re organized and how you can become an active contributor. If you haven’t applied, do this first!)     New to GitcoinDAO?    TLDR - What is Gitcoin?   Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page.   Have you already applied but have yet to join a Gitcoin Workstream? Start here to learn more about where you might fit in.   Thanks for reading! Previous edition ",
                    "links": [
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x77b9cfe4130db0c852394b66991248ed5305c0a495639878338ce2a6c568f8f0",
                        "https://gitcoin.typeform.com/to/Ttuw401y?typeform-source=dvsvwyompza.typeform.com",
                        "https://gov.gitcoin.co/u/owocki/summary",
                        "https://gov.gitcoin.co/t/ama-april-2022/10273",
                        "https://gov.gitcoin.co/c/governance-meta/6",
                        "https://gov.gitcoin.co/u/ceresstation",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-wonder/10170/30",
                        "https://gov.gitcoin.co/u/huxwell/summary",
                        "https://gov.gitcoin.co/t/discussion-dcompass-release-plan-and-beyond/10356/6",
                        "https://dcompass-staging.herokuapp.com/",
                        "https://gov.gitcoin.co/t/dao-design-best-practices/10219/9",
                        "https://gov.gitcoin.co/u/david_dyor/summary",
                        "https://gov.gitcoin.co/u/layn/summary",
                        "https://gov.gitcoin.co/t/irp-research-for-gitcoin/10340",
                        "https://docs.makerdao.com/smart-contract-modules/shutdown",
                        "https://gov.gitcoin.co/u/bobjiang/summary",
                        "https://gov.gitcoin.co/t/gitcoin-grant-advices-based-on-my-observations/10317",
                        "https://twitter.com/i/lists/1512065573026697218",
                        "https://gov.gitcoin.co/t/proposal-partnership-mutual-grant-with-wonder/10170/23",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0x77b9cfe4130db0c852394b66991248ed5305c0a495639878338ce2a6c568f8f0",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xe0c6d911e8c06e8ed28071ebfe84d8dfa90c1381dbfc0f3a6ccdb96ec3147de6",
                        "https://gov.gitcoin.co/t/proof-of-impact-proposals-wanted/10179",
                        "https://gov.gitcoin.co/t/data-science-gitcoindao/10088",
                        "https://gov.gitcoin.co/t/treasury-diversification-part-ii-welcoming-strategic-partners/9825",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://www.youtube.com/watch?v=L-sI4_LOwC0",
                        "https://twitter.com/Parents_Nook",
                        "https://www.addevent.com/event/PA8738644",
                        "https://gov.gitcoin.co/u/ceresstation/summary",
                        "https://gov.gitcoin.co/t/can-gitcoin-be-doing-more-to-support-ethereum-protocol-devs/10151/15",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://availableon.com/greenpill",
                        "https://twitter.com/owocki",
                        "https://twitter.com/Sim_Pop",
                        "https://twitter.com/ethBounties",
                        "https://twitter.com/ethstatus",
                        "https://tip.party/",
                        "https://app.pay.party/",
                        "https://twitter.com/MoonshotCollect",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=MTB0NnJzMnJ1MjU0bW5xMW81bWd1c3VrNXEgam9lQGdpdGNvaW4uY28&tmsrc=joe%40gitcoin.co",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://schellingpoint.gitcoin.co/",
                        "https://www.eventbrite.com/e/can-devs-do-something-developer-meet-up-art-edition-tickets-320601075447",
                        "https://gitcoin.notion.site/DAO-Ops-84f425e281ae49579a2b4acf0bad5dd5",
                        "https://twitter.com/GitcoinDAO/status/1509185588599083014?s=20&t=Xs18hYXcltlTH658zdlzLA",
                        "https://twitter.com/GitcoinDAO/status/1511043414317584384?s=20&t=Xs18hYXcltlTH658zdlzLA",
                        "http://support.gitcoin.co/",
                        "https://calendar.google.com/calendar/u/2?cid=Y190dDRnMzhhNjZ1bWptZXExNTRhZ2NwMmQ0c0Bncm91cC5jYWxlbmRhci5nb29nbGUuY29t",
                        "https://www.notion.so/gitcoin/Events-Policy-c80f5d08f99e4e3a89d45e04b16f395d",
                        "https://www.addevent.com/calendar/pz351122",
                        "https://www.addevent.com/event/Vn9031075",
                        "http://gitcoin.co/discord",
                        "https://www.addevent.com/event/oE11316997",
                        "https://www.addevent.com/event/NX9316935",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "http://gitcoindao.com/",
                        "https://gov.gitcoin.co/t/tldr-what-is-gitcoin-updated-oct-2021/8694",
                        "https://form.typeform.com/to/DiMdHaWe",
                        "https://www.notion.so/Learn-about-the-DAO-onboarding-experience-5856a0032e73494888b92b84d9be6af5",
                        "https://www.notion.so/gitcoin/GitcoinDAO-be541eac15354fdc94655965aa7fbc39",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-14-2022/10414"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.890889644209957
                }
            ]
        }
    ],
    "group_index": "63"
}