{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/crossstream-daoops-community-xp-funding/8883",
            "title": "CrossStream DAOops & Community XP Funding ",
            "index": 8883,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "4",
                    "time": "25/10/2021-21:34:40",
                    "content": "The issue that is being presented is about how the CrossStream DAOops Governance squad (CSDG), which makes decisions that affect the entire DAO, should be governed. Second, what is the best path forward to get us to that point. Option 1 CSDG restructures with a plan to apply directly to the DAO for it’s funding. Part of this process includes aligning on a governance model prior to the funding request. (May not receive funds until late November. Gitcoin Holdings or FDD could fund and administer payments in the meantime.) Option 2 CSDG applies direct to the DAO with a multisig without a governance framework ensuring fair representation for all streams. Who makes the decision for who is on the multisig or leading the stream? Are they Gitcoin Holdings employees or strong DAO contributors? (I think it is ok to have both as long as the decision is made together.) Option 3 DAO supports FDD proposal as is. FDD is responsible to fund and administer payments for CSDG for Q4. FDD has already shown that it will allow this squad to self govern. FDD only continues this until the fair governance model is agreed upon. At that time, FDD would transfer balance of budget to the new stream’s multisig.  Are there other options we are not considering?  This is a continuation of the conversation started on the FDD Q4 Budget Proposal  Our current plan is to bring the topic back to the CSDG meeting on Tuesday afternoon. If we can reach a consensus, the budget proposals will be adjusted to recognize it. If not, we will move this to a snapshot vote for stewards.         ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17/8897"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.942971380471381
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Sirlupinwatson",
                    "index": "#2",
                    "likes": "1",
                    "time": "25/10/2021-22:06:47",
                    "content": "In this case, I think option No.2 would be the best one, but since we are a little far in the process and  to remain on top of everything, we might choose the option No.3 until Q4 and until that the governance model is established. I feel like Option No.2 is going back in time and does not offer a positive progression, but once everything will be in place, it might be the best one to choose. I’d like to get more feedback on this… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.962357954545455
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#3",
                    "likes": "1",
                    "time": "25/10/2021-23:42:16",
                    "content": "Hi Joe, Would you state the strong/weak for options? And share more background? I know that cross stream daoops which is from FDD and MMM (maybe I am wrong), but the stewards don’t know the history, and why we come out option3. Thanks Joe for your updates and transparency! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                }
            ]
        }
    ],
    "group_index": "597"
}