{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/knowledge-transfer-the-gitcoin-hyperstructure/11335",
            "title": "Knowledge Transfer: The Gitcoin Hyperstructure \\xf0\\x9f\\x8f\\xa2 ",
            "index": 11335,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "10",
                    "time": "22/08/2022-13:16:41",
                    "content": " Preamble I was chatting with @annika about the concepts below and she mentioned it might be worth sharing on the gov forum, so here it goes.  This post is meant to be a knowledge transfer and represents my limited vantage point.  Please treat it as just a data point + part of the knowledge transfer.  Definitions   Socialware - Mechanisms that create assurances through human relationships, incurring a high social coordination cost.  Trustware - Mechanisms that create assurances through technology, incurring a low social coordination cost.  Hyperstructure - crypto protocols that can run for free and forever, without maintenance, interruption or intermediaries  Credit for these definitions: Orca: socialware to trustware , Zora: Hyperstructures.  TLDR Gitcoin started as socialware (high social coordination cost) + more trustware (low social coordination cost) has evolved over time. Once Trustware runs all of the core operations of Gitcoin’s products, then Gitcoin is a hyperstructure (a crypto protocol that can run for free and forever, without maintenance, interruption or intermediaries). The four phases of this evolution of trust @ Gitcoin are:  Socialware Modular socialware Trustware at the center with socialware at the edges (hyperstructure phase) Growth via network effects  As Gitcoin Progressively decentralizes over time, I believe it’ll move from centralization to a decentralized and modular set of protocol-based codebases.  The evolution of socialware => trustware of GitcoinDAO  Trustware1920×1200 147 KB   The Gitcoin Hyperstructure As noted above, Hyperstructures are crypto protocols that can run for free and forever, without maintenance, interruption or intermediaries. Once Gitcoin Grants is run primarily on trustware, I believe that it has fully become a Hyperstructure. Here is a more-artistic (and less technical) visualization of the Gitcoin Hyperstructure by IamJvck, created via this design bounty.  180141183-620ba87c-8c8e-40db-88a0-ea797280ef5b1920×1920 220 KB  ",
                    "links": [
                        "https://orca.mirror.xyz/T70CmuhX95ubkw_JHOxSEy8d_EFeYXgtJnF13mPtaZE",
                        "https://jacob.energy/hyperstructures.html",
                        "https://github.com/gitcoinco/skunkworks/issues/272",
                        "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q3-2022/11132/5",
                        "https://gov.gitcoin.co/t/knowledge-transfer-hardness-a-feature-of-gitcoin/11508",
                        "https://gov.gitcoin.co/t/gitcoin-digest-30-2022/11351"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.628809523809524
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "1",
                    "time": "22/08/2022-13:18:52",
                    "content": "    owocki:   Growth via network effects    I did not cover this phase in the OP, but perhaps it’s worth reading this post about Network Effects to learn more about the fourth phase. From that post:    The Network Effects of GitcoinDAO's Protocols        ",
                    "links": [
                        "https://gov.gitcoin.co/t/the-network-effects-of-gitcoindaos-protocols/10973/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#3",
                    "likes": "4",
                    "time": "22/08/2022-14:43:57",
                    "content": "Thanks for the great post @owocki (and incredible visuals @octaviaan!) Reflecting on our journey so far, even the fully socialware to modular socialware this year has been a massive change and we have a ways to go. IMO, we should work to start to weave in elements of trustware wherever we can, even as we continue on improving our ‘modular socialware’ structures in the interim. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/carlosdp.eth",
                    "index": "#4",
                    "likes": "4",
                    "time": "22/08/2022-16:15:17",
                    "content": "Super excited to see you adopt the Socialware/Trustware model from Orca, I think it’s a great way of analyzing how a DAO operates  Also really love that you’re seeing a vision of Gitcoin moving into Trustware as much as technology allows. I think all DAOs need to be moving in this direction constantly to take advantage of the technology platform they’re built on to allow the organization to scale without compromising values/mission. Big opportunity for GitcoinDAO to be a leader in showing the DAO space in general the way to the next level! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25462962962963
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/oak",
                    "index": "#5",
                    "likes": "1",
                    "time": "24/08/2022-12:45:48",
                    "content": "Very compelling! My project enables organisations like Gitcoin to build and run decentralised off-chain Trustware which can be owned directly by the DAO. Just wanted to drop the idea here because it could be very useful for running things like fraud analysis and governance decisions autonomously. Here’s more info: https://autonolas.network – feel free to reach out if of interest! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.98125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/rubinovitz",
                    "index": "#6",
                    "likes": "0",
                    "time": "24/08/2022-20:20:07",
                    "content": "Very cool, been thinking a lot about data science trustware and I think there is a ton that could be done for Gitcoin specifically. Including socialware to find consensus on what data science is used/what trade offs you want → turn the chosen result of the socialware into trustware. Given data science model drift, you may want iterative socialware where humans keep tuning the models and deploying them to trustware. EDIT: I think this may be what you mean by having fraud analyzers and governance continue as socialware? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.35625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#7",
                    "likes": "1",
                    "time": "25/08/2022-10:59:41",
                    "content": "I like to think of it as “Can we confirm that data scientists have access to the same data (not even gitcoin has an advantage of data proprietary to them)?” to enable reproducibility and observability. Then we might say “Does the protocol infrastructure have low barriers to swapping one properly formatted algo for another?” I’d love to connect to hear more about how you think of this! Find me on discord and I’ll send you a calendly link! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.28125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#8",
                    "likes": "3",
                    "time": "22/02/2023-12:56:06",
                    "content": "Two components to this post are topical for our current phase of Gitcoin:   The migration from socialware to trustware as an orientation for how we think about the DAO post protocol stabilization.  I think our focus on the next few months are clarifying, but is it time we think about the DAO post stabilization?  What are the necessary components,  what is the protocol governance structure, and what forms do the remaining supporting structures look like in order to deliver the hyperstructure?   The importance of the network in the realization of the hyperstructure.  This feels topical because I think we just defunded the “engage the community” surface.  I think for the network effect to happen we can deliberately leverage a community of hard core fanatics, or buy eyeballs.   Q1: Is someone working on these things already? Q1: If not, should we consider these topics now? Q2: If not now, when is the right time to consider these topics? Q3: who do you think should take the lead for driving these conversations (org structure post stabilization, community engagement) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0244708994708995
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/02/2023-14:07:57",
                    "content": "I think starting a trustware model for the hyperstructure is going to be impossible while we are too concerned about accidentally overpaying people. The hyperstructure only works (as far as we have seen so far) in a way were people are payed rewards or bounties which are irregular. Gitcoin chose the path of salaries, but that was at the expense of decentralization and the potential to be a hyperstructure. The risk inherent in moving to a bounty or reward based system must be compensated to kickstart the value flywheel. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.611111111111112
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tigress",
                    "index": "#10",
                    "likes": "5",
                    "time": "22/02/2023-23:06:47",
                    "content": "Here is my take on     shawn16400:   The importance of the network in the realization of the hyperstructure.        shawn16400:  Q1: Is someone working on these things already? Q1: If not, should we consider these topics now? Q2: If not now, when is the right time to consider these topics? Q3: who do you think should take the lead for driving these conversations (org structure post stabilization, community engagement)   I raised this in a different yet similar context: S17 Musing - Gitcoin's \"Most important Thing\" - #4 by tigress … with a little bit of a twist: less from the perspective of Community Engagement and more based on the craft of Token Engineering.   As a protocol DAO with an impact arm, shouldn’t we look more at how the relationships between the 3 most important things outlined above are intended to develop: Which incentives (utility) drive which behaviours and how the protocols interact in order to enable a thriving ecosystem?  And interestingly, Shawn, your own personal reflection on refactoring Gitcoin makes me aware of what is stopping me from empowering myself, initiating and wanting to co-own this work and moving forward with accountability to make it happen: I fear that this work “towards a hyperstructure”  does not matter / is not valued fear this work is not inline with other ideas somewhere else fear my work is going to be torpedoed at the 11th hour by some last moment dismissal  From my empowered stance I can overcome #1 and #2 but the number 3 has continuously worsened throughout the past year(!) and is not under my control. Contributing factors are:  Wild-wild west (combative) style of managing expressed as e.g. hostile commenting on this forum Changes in GTC delegations and therefore continuously discontinuous top-level leadership direction and alignment Lack of meaningful feedback and inspection and adaption on the whole-system level  I highly encourage the reader to dig into this underlying, very human “wild wild west” drama and the very natural feelings of unworthiness, blaming and trying to compensate and protect (in times of scarcity). And to even further explore the concept of psychological safety at work.    conscious.is    The Drama Triangle | Conscious Leadership Group Learn the about the roles that keep you stuck in the drama triangle and have you repeating issues in your life. Also learn about the roles that support you in living in presence where you can permanently solve your life's challenges.      If this does not speak to you, I can offer an alternative: Think about the leverage points in our system. Which one(s) would you tackle first? Where can we 10x? PLACES TO INTERVENE IN A SYSTEM (Source)  in increasing order of effectiveness! 9  Constants, parameters, numbers (subsidies, taxes, standards). 8 Regulating negative feedback loops. 7 Driving positive feedback loops. 6 Material flows and nodes of material intersection. 5 Information flows. 4 The rules of the system (incentives, punishments, constraints). 3 The distribution of power over the rules of the system. 2 The goals of the system. 1 The mindset or paradigm out of which the system — its goals, power structure, rules, its culture — arises. My conclusion is: intervene in our system now and work on leverage point 8 as well as 4 to 1 and know that there are still human beings involved who need to feel a sense of safety in order to be able to problems of this complex and creative caliber! (watch video) … and if there is capacity shortages of people doing this work: Prioritise with System Thinking in mind.  The less fear, the less burdened we feel, the more effective and efficient we can deliver something outstanding! And the more support we can give to others!  Tagging here @kyle and @kevin.olsen for visibility. ",
                    "links": [
                        "https://gov.gitcoin.co/t/refactoring-gitcoin-what-falls-between-the-cracks/13026",
                        "https://gov.gitcoin.co/t/s17-musing-gitcoins-most-important-thing/12875/4",
                        "https://www.youtube.com/watch?v=LhoLuui9gX8",
                        "https://conscious.is/video/understanding-the-drama-triangle-vs-presence",
                        "https://conscious.is/video/understanding-the-drama-triangle-vs-presence",
                        "https://donellameadows.org/archives/leverage-points-places-to-intervene-in-a-system/",
                        "https://conscious.is/video/locating-yourself-a-key-to-conscious-leadership"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.937855596784169
                }
            ]
        }
    ],
    "group_index": "187"
}