{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoindigest-28-2022/11215",
            "title": "GitcoinDigest #28 2022 ",
            "index": 11215,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "contributors",
                "stewards",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#1",
                    "likes": "2",
                    "time": "02/08/2022-15:34:53",
                    "content": " 1600×270 81 KB  Season 15 is officially here! It runs from August 1st to October 31st!   If you would like to receive this newsletter in your inbox, sign up here!   Key actions for this week:  Sign the on-chain ratification of the Gitcoin Product Collective Workstream S15 funding request.    Help us improve the Gitcoin Digest by interacting with this pol.is! Add your own statements and vote on what others have put forward. Remember to check back regularly to vote on new statements. Thank you!      Hot Topics:  As we look back on a year of rapid onboarding, and get ready for the upcoming budget season, Kyle asks “What should the DAO budget be?‘’ As a starting point, “It is common to have roughly 60% of a tech startup’s costs borne from development.” With the recent passage of GPC’s ~$1MM quarterly budget and about half of Moonshot Collective (another $200k) conceivably combining to form our development costs, that leaves $800k. Kyle suggests keeping 250k seperately carved out for Grants Ops to protect the DAO’s ability to run quarterly rounds. Kyle and Lindsey visualize one potential option for the DAO budget, by workstream, below:   1600×1175 175 KB    Owocki asks “What can we learn from BrightID’s Aura Sybil Defense Software?” In this system, high-trust users are marked by BrightID founders or other high-trust users as a trusted seed, given some ‘energy’, and are able to traverse the social graph. They can mark others as honest or sybil and are rewarded with more ‘energy’ if they correctly identify sybil attackers.   Johnx25bd urges the Gitcoin community to move forward with the Carbon Neutral Policy Proposal and identify ”which carbon tokens we want to retire to offset historical emissions.” He poses a few possible ways to make this decision including through subcommittee, twitter poll, or quadratic voting.   Simona shares an updated Budget Proposal Process for Gitcoin DAO that outlines a five-week process: each proposal would have two initial weeks on the forum as a draft for feedback, an additional week on the forum after integrating feedback, a week on Snapshot to vote, and a week on Tally to ratify. If a proposal does not pass then it can be resubmitted using a template which requires highlighting the essential Intents the workstream is aligned with.   Nate provides an update on how the GPC team is responding to Lefteris’ proposal to remove lifetime funding received from gitcoin grants page. “We’ve decided to update the grant page to say “Estimated lifetime funding received”, to display the amount rounded to the nearest thousand, and to include a “this number should not be used for accounting purposes” statement.”   Owocki shares his updated Q3 steward delegations and emphasizes a few criteria which might dominate his thinking for Q4 including: Grants 2.0, Passport, empowering stewards who can get people out of the wrong roles, and decentralizing leadership towards up and coming leaders.   In a thread on flexible voting, Ben from ScopeLift shares details about the Open Zeppelin Governor Contract: “Because it’s written in a modular manner, it allows for the developers deploying the DAO contracts to customize it by extending or writing extensions. This means if you want, you can definitely modify the OZ Governor to break that Bravo Compatibility to differing degrees, depending on how you choose to customize it.”     Gitcoin Governance Overview: Snapshot polls GTC Holders and Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, move on to Tally after being ratified on Snapshot.   Active Proposals:  Gitcoin Product Collective Workstream S15 funding request ratification [Tally]    Proposal Discussions:  Schelling Point Event Workstream Setup Proposal Upgrading the Gitcoin Governance Contracts Improve GTC Liquidity with Tokemak  Carbon Neutral Policy at Gitcoin    Latest Completed Proposals:   Gitcoin Product Collective Workstream Proposal & Budget Request for Season 15  Result: Passed      Workstream Discussion    Public Goods Funding    We’re working on reporting for Season 14 and preparing our budget for Season 15!   With GR15, PGF will focus on setting up the grants program for a transition into a protocol world. We will be more intentional about what sub-rounds we fundraise for and what constitutes a “minimum viable round” for side rounds. We will also decouple the main and side rounds, taking a step toward a permissionless protocol and improving our scalability processes, based on some of the challenges (e.g., tagging) in GR14.     Moonshot Collective    Passport Identity Staking: This week, we iterated on our staking contract, wrote goals based on our essential intents, and created a new passport stamp that verifies if you gave GTC staked. We also have a demo of what it’s like to stake GTC on the goerli testnet and get that verified as a stamp.   Operations and Strategy: We gathered feedback on our S15 budget request, are getting closer to finalizing it, and will be posting on the forum next week.     Fraud Detection & Defense    FDD kicked off last week with a deep discussion on budget, roles, and outcome ownership for season 15. The core focus remains achieving a high ROI in our execution of fraud & defense detection across the grants round. We also aim to provide useful data insights to the Moonshot and Gitcoin Product Collectives to close the gap between Sybil detection and Passport identity.   Joe, Omni and Carl gave a presentation on how on-chain data (your NFTs, POAPs, Snapshot voting records, Lens profile, etc) can be integrated into Sybil detection and Passport stamps, and ultimately towards a protocol for decentralizing DeSoc data analysis. It also includes some fun data visualizations showing the grant preferences of different communities.    1346×704 86 KB      Merch, Memes & Marketing    We’re getting ready for GR15 by clearly defining roles and responsibilities so we can build a strategy and timeline for execution. Our designers are hard at work creating original assets for the round. We’re very focused on working closely with the PGF team and coordinating our efforts.   We’re working on updating our brand identity and preparing for this to be an ongoing conversation that benefits with input from all sides. Emerging themes include “harmony” and “networked.”   Our Grants 2.0 product marketing effort is really ramping up! We are synthesizing a lot of research into audience personas to help us position our messaging. We’re also considering how we tell stories around our protocols and beginning content creation.     DAO Operations    Cross Stream DAO Ops (CSDO):  We put a switch to six month budget proposals on hold and are continuing with three month budgets. After season 15, we will reassess the budget term. We also discussed the best way to have conversations about budgeting, following Kyle’s recent forum post, and whether a post like that should have been brought to CSDO before going on the forum. Instead of moving the post into a google doc, CSDO requested Kyle remove ‘Proposal’ from the title and we continue the conversation async. We talked about using WorkDAO to simplify the contributor experience regarding compliance, benefit availability, retirement accounts, etc. There is a 12% fee for each contributor and open questions about whether to use it and where the budget would be drawn from.      Gitcoin Product Collective    Grants Hub: We worked on a proof of concept that will allow us to encrypt and decrypt PII data (Personally Identifiable Information) in order to share with Round Manager. We also determined the requirements and userflow for verifying a project’s Twitter and Github information. Now we’re moving toward being dev-complete with Phase 2 of the project, and deploying to production.   Round Manager: We built a userflow for approving and rejecting grant applications. We also started using a new CI (Continuous Improvement) tool called Slither on the team. Now, we’re moving toward deploying on Optimism.   Passport: We’ve integrated LinkedIn and Discord as new stamps and identified a list of additional stamps for our backlog. We’re also paying out hackathon prizes and refactoring passport.gitcoin.co to an SDK.     Upcoming community events    Drop in on our weekly DAO Vibes on Wednesdays at 4:00 PM UTC on Discord! We have been seeing great attendance and engagement and we would love for you to join us.   Join our weekly Public Goods Library on Discord! Tune in every Wednesday at 3:00 PM UTC! This week’s topic: \"The Infinite [Knowledge] Machine” hosted by @hebbianloop from @opscientia. DM @_madison_adams to be added!     New to GitcoinDAO?    TLDR - What is Gitcoin?   Become a Gitcoin Citizen!   Previous edition ",
                    "links": [
                        "https://www.tally.xyz/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/31",
                        "https://pol.is/2dc3urtbjf",
                        "https://pol.is/2dc3urtbjf",
                        "https://gov.gitcoin.co/u/kyle/summary",
                        "https://gov.gitcoin.co/t/discussion-how-might-we-think-about-budgeting-what-should-the-dao-budget-be/11171",
                        "https://www.builtinchicago.org/blog/how-much-should-software-startup-budget-development-and-operations",
                        "https://about.crunchbase.com/blog/startup-product-spend/",
                        "https://gov.gitcoin.co/t/s15-proposal-gitcoin-product-collective-workstream-proposal-budget-request/11058",
                        "https://gov.gitcoin.co/u/lthrift/summary",
                        "https://gov.gitcoin.co/u/Owocki",
                        "https://gov.gitcoin.co/t/what-can-we-learn-from-brightids-aura-sybil-defense-software/11159",
                        "https://gov.gitcoin.co/u/johnx25bd/summary",
                        "https://gov.gitcoin.co/t/proposal-carbon-neutral-policy-at-gitcoin/10823/32",
                        "https://gov.gitcoin.co/u/Pop",
                        "https://gov.gitcoin.co/t/budget-proposal-process-for-gitcoin-dao-v2/11168",
                        "https://gov.gitcoin.co/u/nategosselin",
                        "https://gov.gitcoin.co/t/proposal-remove-lifetime-funding-received-from-gitcoin-grant-page/10981/14",
                        "https://gov.gitcoin.co/u/lefterisjp/summary",
                        "https://gov.gitcoin.co/t/proposal-remove-lifetime-funding-received-from-gitcoin-grant-page/10981",
                        "https://gov.gitcoin.co/u/Owocki",
                        "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q3-2022/11132/4",
                        "https://gov.gitcoin.co/t/introducing-flexible-voting-an-extension-to-the-governor-enabling-new-voting-mechanisms/11115/5",
                        "https://gov.gitcoin.co/u/bendi",
                        "https://www.scopelift.co/",
                        "https://github.com/OpenZeppelin/openzeppelin-contracts",
                        "https://www.tally.xyz/governance/eip155:1:0xDbD27635A534A3d3169Ef0498beB56Fb9c937489/proposal/31",
                        "https://gov.gitcoin.co/t/schelling-point-event-workstream-setup-proposal/11083",
                        "https://gov.gitcoin.co/t/upgrading-the-gitcoin-governance-contracts/10721",
                        "https://gov.gitcoin.co/t/improve-gtc-liquidity-with-tokemak/10725",
                        "https://gov.gitcoin.co/t/proposal-carbon-neutral-policy-at-gitcoin/10823",
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xc6309348f43ba77bb488d2d5f154db3264f86a890b500fa8286fe089c6ddc9a0",
                        "https://gov.gitcoin.co/c/workstream-discussion/9",
                        "https://gitcoin.notion.site/Public-Goods-4ccd579f433c4dff9d8952314468d6e8",
                        "https://gov.gitcoin.co/t/proposal-prototyping-workstream-moonshot-budget-request-q4-2021/8785",
                        "https://gitcoin.notion.site/Moonshot-Collective-ffa78f44a0de412cb607f9b69d3a376f",
                        "https://discord.com/channels/562828676480237578/978322275893907526/1001513881568563230",
                        "https://gitcoin.notion.site/Fraud-Detection-Defense-2bde13c0b8e74fda81435d94e49e2703",
                        "https://docs.google.com/presentation/d/1eINBNP9Ikbs1Melr_g4KDjeNSjAsc-NPyBz4XPo9L8k/edit?usp=sharing",
                        "https://gitcoin.notion.site/Merch-Memes-and-Marketing-60cc693f0fe14be1879a05587922c8a3",
                        "https://gitcoin.notion.site/DAO-Ops-84f425e281ae49579a2b4acf0bad5dd5",
                        "https://www.youtube.com/channel/UCWEiZu1Jqkqn-axtQdtrNLg",
                        "https://gov.gitcoin.co/t/discussion-how-might-we-think-about-budgeting-what-should-the-dao-budget-be/11171",
                        "https://www.theworkdao.com/",
                        "https://www.notion.so/gitcoin/Grants-2-0-f2860138cbb24505b5cb2d8576119a78",
                        "https://drive.google.com/file/d/1p5icokDyS7LfDA8CAPx95WlQZ0Zuv2Ng/view?usp=sharing",
                        "https://www.loom.com/share/1807335986004c5f9d8b4e2149b158ae",
                        "https://gitcoin.notion.site/Week-of-Mon-7-25-Fri-7-29-319c6e6ac24244f78b2d5a2e4f56776a",
                        "http://passport.gitcoin.co",
                        "https://www.addevent.com/calendar/pz351122",
                        "http://gitcoin.co/discord",
                        "http://gitcoin.co/discord",
                        "https://twitter.com/hebbianloop",
                        "http://twitter.com/opscientia/",
                        "https://twitter.com/_madison_adams",
                        "http://gitcoindao.com/",
                        "https://primer.gitcoindao.com/",
                        "https://gitcoin.notion.site/Become-a-Gitcoin-Citizen-7b83f9b5ca06487f84e0142d0180970a",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-27-2022/11163",
                        "https://gov.gitcoin.co/t/gitcoin-digest-29-2022/11260"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.423982683982684
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#2",
                    "likes": "2",
                    "time": "09/08/2022-02:55:50",
                    "content": "中文版本：https://news.bobjiang.com/issues/gitcoindao-28-2022-1290723 订阅中文：http://news.bobjiang.com/ ",
                    "links": [
                        "http://news.bobjiang.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "175"
}