{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-treasury-diversification-update/10932",
            "title": "Gitcoin Treasury Diversification Update ",
            "index": 10932,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/HelloShreyas",
                    "index": "#1",
                    "likes": "8",
                    "time": "14/06/2022-22:47:51",
                    "content": "Authors: @schlabach & @HelloShreyas from Llama, @Kyle from Gitcoin Summary We propose moving $15 million of GTC (~4.6m GTC at time of writing) to a multisig wallet to execute the previously proposed treasury diversification. Of this $15m in GTC, $3m will be exchanged for USDC via an agency desk in order to support critical DAO workstream funding needs. The remaining $12m will be used in the treasury diversification for strategic partners. Any GTC that remains after the strategic diversification will be returned to the treasury. Given current market conditions and Gitcoin’s operating needs, we think this is a prudent action to take. State of GitcoinDAO’s Treasury Today, GitcoinDAO’s treasury holds 23m GTC (roughly $73.4m). GitcoinDAO’s Treasury Vester holds another 26m GTC which will be distributed to the DAO over time. The vast majority of the DAO’s treasury is held in GTC, with very little in stablecoins. At the end of May, the DAO held $280k in DAI and USDC. Treasury Diversification We previously proposed a treasury diversification for GitcoinDAO to diversify some of its GTC into stablecoins. The Treasury Diversification Working Group is still in ongoing conversations with potential strategic partners, and we are hopefully nearing the end of the process. The process took longer than expected; Kyle outlined some of the reasons in this thread. In order to complete the diversification, GTC will need to be sent to a multisig wallet, where it will then be swapped for stablecoins with strategic partners. Rationale for Exchange Due to the treasury diversification taking longer than initially expected, individual DAO workstreams have been funded in GTC and are now facing an asset-liability mismatch. Many contributors have wages denominated in USD terms, yet workstreams only have GTC with which to pay said contributors. With the market downturn, workstreams now face an increased risk of not being able to meet these obligations. Because the timing of the treasury diversification is not certain, we wanted to quickly ensure that workstreams can meet their obligations. We’re proposing engaging with a reputable agency desk to execute this transaction. The agency desk will utilize a broad range of liquidity sources to execute the transaction with approximately 10 bps of slippage or less. The agency desk will charge 20 bps as a fee and will likely be able to execute the transaction within 3 days. This will ensure that each workstream has the stables needed to meet near term expenses. We’ve proposed working with a trusted agency desk on the transaction as an alternative to requiring workstreams to sell GTC on the open market, which would be inefficient, costly, and operationally riskier. Other Notes Any GTC that remains after these two actions will be sent back to the treasury. Execution We will create the on-chain proposal to transfer GTC from the treasury to a 5/6 multisig. Signers on the multisig will be the the following Gitcoin Stewards:  Kyle Weiss Annika Lewis Shreyas Hariharan Kris Simona (We’re looking for one more member)  A Snapshot proposal will be posted to Gitcoin’s Snapshot for a community vote. Please let us know if you have any questions or feedback! ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-treasury-diversification/9698",
                        "https://etherscan.io/address/0x57a8865cfB1eCEf7253c27da6B4BC3dAEE5Be518",
                        "https://etherscan.io/address/0x44aa9c5a034c1499ec27906e2d427b704b567ffe",
                        "https://gov.gitcoin.co/t/treasury-diversification-working-group-updates-thread/10231/9",
                        "https://gov.gitcoin.co/t/gitcoin-financial-reporting/8867/36",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-22-2022/10972",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-24-2022/11060",
                        "https://gov.gitcoin.co/t/poap-edition-gitcoindao-digest-23-2022/11004"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.299990699404762
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#2",
                    "likes": "2",
                    "time": "16/06/2022-09:42:46",
                    "content": "I’m fully supportive of this and think it is important to make sure the DAO treasury has enough funds in stablecoins for long-term sustainability. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "1",
                    "time": "17/06/2022-09:18:27",
                    "content": "Fully supportive and happy to see action. Happy to support however I can. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#4",
                    "likes": "2",
                    "time": "20/06/2022-14:47:18",
                    "content": "I really appreciate you proposing this @HelloShreyas. As most folks know, Llama is helping us with our treasury diversification and we see this option ($3MM) as a bridge of sorts while we work to finalize the TD. I am supportive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/James",
                    "index": "#5",
                    "likes": "3",
                    "time": "20/06/2022-19:41:01",
                    "content": "_  supports this proposal fully, and is happy for FireEyes or Wildfire to be a signer on this multisig. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#6",
                    "likes": "3",
                    "time": "21/06/2022-16:31:46",
                    "content": "Im a supporter of that proposal (add fire eyes as our final signer  ) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#7",
                    "likes": "0",
                    "time": "22/06/2022-01:03:18",
                    "content": "Support this proposal, we (as gitcoindao) need to push treasury diversity to move forward quickly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/HelloShreyas",
                    "index": "#8",
                    "likes": "2",
                    "time": "22/06/2022-22:32:38",
                    "content": "Update: we think it makes sense to start with a $3m diversification. Next steps are to get the onboarding and KYC set up with the agency desk. Thanks to @James for volunteering to be on the multisig! We’ll let everyone know as there is progress on this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/HelloShreyas",
                    "index": "#9",
                    "likes": "1",
                    "time": "06/07/2022-21:52:22",
                    "content": "Latest update: @kyle from Gitcoin has begun the onboarding and KYC process with the agency desk and the Snapshot proposal to execute the $3m diversification is live. ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-treasury-runway-analysis/11077"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.590909090909091
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#10",
                    "likes": "1",
                    "time": "08/07/2022-13:30:49",
                    "content": "Supportive of this proposal - thank you for driving this forward kyle & shreyas!     HelloShreyas:  Latest update: @kyle from Gitcoin has begun the onboarding and KYC process with the agency desk and the Snapshot proposal  to execute the $3m diversification is live.   Good to see we’re starting with a lower amount, until strategic partners are found. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.961363636363636
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#11",
                    "likes": "4",
                    "time": "25/08/2022-21:12:33",
                    "content": "An update for folks on this process  We have moved $1MM back to the treasury (Tx is here) - and another $1.5M will be coming over soon too (just need to video confirm with our OTC desk). I will continue work to diversify the remaining balance of GTC in our account (per agreement on CSDO) to bolster the stables in the treasury. I want to flag this is a slight deviation from the proposal which stated excess GTC would go back to the treasury. Let me know if there are any questions! ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-digest-31-2022/11392"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.722222222222222
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#12",
                    "likes": "2",
                    "time": "12/09/2022-17:50:23",
                    "content": "I was able to close out the $3MM diversification and sent the full amount ($3MM) back to the treasury  There was some excess that is still in our OTC account which is being used to help workstreams with their TD efforts now too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                }
            ]
        }
    ],
    "group_index": "134"
}