{
    "poll_list": [
        {
            "id": "0x8a801597d8b068d2b53fcff75f9b5f132a99aebfff3f8cdf433bd6e7e4a9cb63",
            "title": "DAO Ops S14 Budget Request",
            "discussion": "https://gov.gitcoin.co/t/s14-proposal-amended-dao-operations-s14-budget-request/10447/2",
            "body": "This is a renewal proposal for the DAO Ops workstream requesting budgetary funds for Season 14 (May 1, 2022 through July 31, 2022). Revised on May 10, 2022.\n\nUpdate: For S14, we request $948k USD or 377k GTC* This request also includes a $26k reduction over the original S14 request, assuming the scaled back release of the coaching and professional development initiative ratified by CSDO in S13.\n\n*Inclusive of 60-days of reserves and S13 budget rollover. Note: The GTC total will be adjusted based on the current market value at the time this proposal is moved to Snapshot and to Tally. The vote will be to send $ in GTC at the current price when moved to Tally or the 20 day moving average (whichever is lower).\n\nTL;DR:\nAs one of the newer workstreams, DAO Ops continues to grow with the aim of operationalizing GitcoinDAO with the consent of each structured workstream. \n\nKey objectives: \n\n- Develop sustainable DAO-wide treasury strategy and scale accounting operations ensuring timely payments and treasury diversification within workstreams \n\n- Streamline contributor onboarding process with clearer entry points, support CSDO, and set high standard for community management \n\n- Support steward participation via enhanced information flow \n\n- Improve community tooling, increase community adoption, service DAO infrastructure, and provide enhanced security\n\n- Improve the hiring experience, and provide clear, accessible People Ops guidance; Scale the peer review and role documentation to support additional contributors \n\n- Rebuild the user support team and improve its performance \n\n You can find the full proposal [here](https://gov.gitcoin.co/t/s14-proposal-amended-dao-operations-s14-budget-request/10447/2)\n\nThank you for your vote!\n\n\n",
            "choices": [
                "Yes",
                "No",
                "Abstain"
            ],
            "scores": [
                7536390.583197293,
                328422.16709481966,
                461539.8039282561
            ],
            "start": 1652288473,
            "end": 1652720400,
            "snapshot": "14756069",
            "state": "closed",
            "author": "0x7E052Ef7B4bB7E5A45F331128AFadB1E589deaF1",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/s14-proposal-amended-dao-operations-s14-budget-request/10447",
            "title": "[S14 Proposal - Amended ] DAO Operations S14 Budget Request ",
            "index": 10447,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#1",
                    "likes": "9",
                    "time": "28/04/2022-22:06:18",
                    "content": "This is a renewal proposal for the DAO Ops workstream requesting budgetary funds for Season 14 (May 1, 2022 through July 31, 2022). Revised on May 10, 2022.  Preface  DAO Operations (or DAO Ops) was formalized as a workstream with a passing Snapshot vote on January 19, 2022 during Season 13 (S13). In Season 14 (S14), we would like to continue building this workstream to lead by example and in service of the DAO and workstreams. This means, though we operate as an independent workstream like all others, we take direction from the workstreams, and offer non-binding best practices, support, and guidance, with a strong focus on operational needs. Our initiatives this season are Accounting, Community Experience, Community Governance, Dao Tooling/DevOps, People Ops and User Support.  TL;DR:  As one of the newer workstreams, DAO Ops continues to grow with the aim of operationalizing GitcoinDAO with the consent of each structured workstream. To accomplish that goal, in S13, DAO Ops moved quickly on several fronts, including:  supporting greater stewardship participation through experimentation with governance incentive structures (i.e., Steward Council), forming the Gitcoin Foundation, augmenting and scaling our shared tools and resources, hiring critical contributors (including co-workstream lead and 2 new People Ops team mates), and facilitating important cross-stream tactical and strategic meetings/retreats (think the Gitcoin Retreat, CSDO, and leadership retreat).  Though there is much more to do, we are making significant progress in setting GitcoinDAO on the path of operational excellence (1). Update: For S14, we request $948k USD or 276k GTC (inclusive of 60-days of reserves and S13 budget rollover(1). This request also includes a $26k reduction over the original S14 request,  assuming the scaled back release of the coaching and professional development initiative  ratified by CSDO in S13. (1) Note: The GTC total will be adjusted based on the current market value at the time this proposal is moved to Snapshot and to Tally. The vote will be to send $ in GTC at the current price when moved to Tally or the 20 day moving average (whichever is lower).  S13 Recap In its inaugural season, DAO Ops set the following objectives and outcomes: through the below summary you can read more on how we evaluate our own performance of this past season.     Initiative Objectives EoQ Outcomes/Lessons Learned     Accounting Payments within this workstream happen within 21 days of service being performed (net 21). On track - FDD and DAO Ops payments are averaging 3-4 business days.    Budgeting templates are well received and adopted by the majority of workstreams. In process - The budgeting template is currently used by FDD, DAO Ops, and MMM. Moonshot Collective and other workstreams will be trained throughout S14. The biggest constraint in training is the size of Accounting, which is currently represented by 1 core contributor.    Monthly financial reporting is available and shared with outside contributors (i.e., Llamas). On track - FDD and DAO Ops’ workstream reporting is up to date and transparent. Llamas provides monthly DAO-wide treasury diversification reports via the governance forum.   Community Experience Users are not confused when interacting within the GitcoinDAO ecosystem (Notion, Discord, forum and other entry points), and can easily find initiatives and squads to contribute to. On Track - This season, community experience made updates to Notion that improved navigability. In addition, the team integrated more levels on Discord, and updated the Gitcoin website.    Onboarding is a streamlined process with clearly defined entry points both on the overall level & workstream level. Not on Track - The bi-weekly onboarding calls create a safe space, and the Notion homepage helps new users find entry points (i.e., weekly community events). However, potential Gitcoiners still experience friction in 1) applying through the new contributor onboarding flow and 2) connecting to workstreams as contributors. The problem spaces will be investigated during S14.    Workstream leads are complimentary of CSDO interactions and governance. On track - CSDO is up and running. DAO Ops will continue to make improvements to the flow of the meeting and overall transparency based on feedback and needs of workstream leads and Stewards.    Processes are streamlined to ensure regular sync calls (i.e. CSDO, community experience call, team demos, and hangouts) are effective and productive. On track - DAO Ops will continue to iterate on processes based on feedback from the community.   Community Governance Ensure 75% of the top 15 stewards are engaged and able to hold workstreams accountable to outcomes. On track - In S13, DAO Ops launched the Stewards Council to highlight and promote active and engaged stewards. This initiative will be improved further in S14 (see below).    Ensure stewards feel informed of key information to guide their voting and interaction. On Track - This season, DAO Ops reformatted the monthly Stewards calls with deeper involvement of the various workstream leads, giving clear and concise updates. Also the dao’s weekly newsletter has become a useful tool in informing Stewards.    Ensure a quarterly / season update cadence of the report cards. On track - Metrics in report cards were optimized, so DAO Ops can assess which Stewards can be in the Stewards Council.   People Ops Ensure 75% of DAO contributors who contribute more than 30 hours a week have had a 360 review. In process - Approximately 50% of DAO and soon-to-be DAO contributors were onboarded on the peer review process during S13. People Ops also made significant progress supporting workstreams in role documentation, which is an important preceding step to peer review.    Roll out a conflict resolution program that helps at least three workstreams. On track - So far, 5+ conflicts were managed by People Operations.    Provide guidance on job description and roles thereby improving how 5+ people work. On track - People Ops implemented a role documentation process which has been adopted by 3 DAO workstreams. DAO Ops is continuing to work with the Sobol team to address technical issues that have delayed DAO-wide progress   User Support User questions are responded to within 24 hours. Not on track - Response times in Discord are on track, but email responses are not available during the weekend. The S14 OKRs have been adjusted to accurately reflect the team’s availability and the weekday response accountability will be communicated to email support users.    NPS of experience with support is >7. Not on track - The User Support team isn’t receiving sufficient measurable feedback on the community’s support experience. In S14, the team will work on a new approach to increase feedback, including the potential for a revamped ticketing system.    Knowledge base is up to date and is used by the community In process - In addition to the commitments mapped below, User Support will continue to edit dated knowledge base posts.   Regulatory Considerations (2) DAO entity guidance is delivered in Q1 Complete - Foundation formation vote has passed and DAO negotiations with Holdings will be completed in S14.    Workstream guidance is delivered in Q1 In process - Engaging with WorkDAO and Opolis to help guide and limit liability for WS and WS leads. These functions will be taken over by People Ops in S14.    Ongoing questions are answered within 3 business days On Track - Questions are answered within 3 business days.    (2) Note: With the formation of the Foundation and the scaling of other legal functions within People Ops, this initiative will be discontinued in S14.  S14 OKRs & Budget Request Over the next season DAO Ops will pursue the following activities, objectives, and key results in service of our fellow DAO workstreams:  [AMENDED] Budget Breakdown      Budget Category Assumptions Amount USD Amount GTC Change from Original Budget     General Ops General fund for cross-stream and team events and meetings. Also includes 2 core contributors/workstream leads. $95,100 27,725    Accounting Includes 2 core contributors, consulting expenses for DAO Ops treasury diversification costs, and a hold for a future CFO/Treasury Management Lead hire. $83,100 24,227 -$6k   Community Experience Includes 1 core contributor, strategic planning (external consulting), and a hold for a future Community Lead hire. $67,500 19,679    Community Governance Includes 1 core contributor and a hold for a future scribe to support Steward Council and other governance meetings. $53,550 15,612    DevOps/DAO Tooling Includes 2 contributors and tooling expenses. $60,000 17,492    People Operations Includes 4 core contributors, and reserves for two new initiatives (i.e., employee legal services and coaching/professional development). $132,128 38,521 -$20k   User Support Includes 3 core contributors and a hold for a Support Lead hire in S14. $56,930 16,597    S14 Totals  $608,308 159,853 (-$26k)     Budget Ask      USD GTC     Original S14 Total $634,308 x   Reduction ($26,000) x   60-day reserves $405,539 x   Current treasury balance ($66,000) x   Amount Requested from Treasury $947,846 *276k (3)    (3) Note: Based on a spot price of $3.43 USD as of 5/10/2022.  Accounting Develop sustainable DAO-wide treasury strategy and scale accounting operations ensuring timely payments and treasury diversification within workstreams - 24k GTC ($83.1k)  Hire a Treasury Lead or Fractional CFO by the end of S14. Consult Grants 2.0, Moonshot Collective, and Public Goods Funding during S14 to understand accounting needs, and train accounting contributors to support payments and accounting. Publish guidance for multisig safes and payments wallet maintenance processes. Payments within DAO Ops happen within 10 days of service being performed (net 10). Train payment leads in various workstreams on how to create reporting systems. Ensure that supported workstreams have payment and accounting tools that are integrated into workstream processes. Create guidance for diversification to inform and inspire the other workstreams.   Community Experience Streamline contributor onboarding process with clearer entry points, support CSDO, and set high standard for community management - 19.7k GTC ($67.5k)  Deploy updated intake form based on WS feedback. Roll out a new contributor survey or community experience working group to update the onboarding process. 50% of new core contributors come through the DAO onboarding flow. Create regular syncs with the hiring manager & talent coordinators. Increase transparency by reporting on CSDO decisions through the weekly newsletter, contributor calls and work on other forms of documentation. Organize and monitor moderation of channels, educate and manage community managers Hire Community Management Lead.   Community Governance Support steward participation via enhanced information flow - 15.6k GTC ($53.5k)  Ensure 75% of the top 14 stewards are engaged and able to hold workstreams accountable to outcomes; continue to evaluate who should be in the Steward Council and how they are incentivized. Each quarterly workstream budget is reviewed in-depth by at least two Stewards. Create self-assessing workstream report cards for insight into performance by mid-S14. Create a treasury dashboard for broader transparency on budget impact and treasury health in close collaboration by the end of S14. Ensure stewards are informed with key information to guide their voting and interaction. Introduce timekeeping, one representative per workstream, and 80/20 constructive discussion to monthly and bi-weekly steward calls. Standardize quarterly budget review process for greater insight into previous and current treasury impacts.   DevOps/DAO Tooling Improve community tooling, increase community adoption, service DAO infrastructure, and provide enhanced security - 17.5k GTC ($60k)  Develop clear guides and host live training sessions for all tools used by core contributors and new joiners. 80% of core contributors are made aware of and provide feedback on DAO-wide tooling. Create a plan that lays out a security road map for the next year by the end of the quarter. Respond to all infrastructure service requests within 24 hours. Help to prepare a smooth transition of infrastructure from Holdings to the DAO. Create metrics and monitoring that helps us to maintain a 90% up time. Prepare a ceramic node template that can be used multiple times.   People Ops Improve the hiring experience, and provide clear, accessible People Ops guidance; Scale the peer review and role documentation to support additional contributors - 38.5k GTC ($132k)  Build out and communicate the People Ops Hub on Notion from which workstreams can find existing program guides and other resources. Develop well-researched compensation, work contracts, and parental leave policies. Support core contributors in the selection of professional development programs to follow individually or to run within their workstream. Ensure all people coming from Holdings easily find their place within the DAO. Partner with WorkDAO and Opolis to provide core contributors with jurisdiction-specific legal, benefits, and payroll support. Ensure 75% of DAO contributors who contribute more than 20 hours a week have had a peer review. Create a clear to use and technically smooth role documentation framework.   User Support Rebuild the user support team and improve its performance - 16.5k GTC ($57k)  Hire a User Support Lead contributor. Launch user support office hours to retrain the team in user support principles and Gitcoin products (i.e., grants, bounties, kudos, etc.). Reorganize the evaluation and payment logic for the User Support team. Host GR14 user support planning sessions with FDD and Grants Ops with User Support Lead and existing team. Respond to all user questions (tickets and email) within 24 hours during the work week. Update or create 30 Gitcoin Support Knowledge Base entries by mid S14.  Our OKRs were adapted and summarized for the purpose of communicating key commitments to the DAO. For the full list of our objectives and key results, please navigate here.  Team Updates Core Contributors Workstream Leads - Kris Decoodt and Jodi Callender Accounting Lead - Chris Dean Community Experience Lead - Kris Decoodt Onboarding Lead - Mitzy Community Governance - Simona Pop DevOps - Nick Kammerdiener DAO Tooling - Puncar People Ops Lead - Loie Taylor People Ops Support - Kyle Weiss People Ops Team Member - Sandy S. Hiring Coordinator - Safder Raza User Support Coordinator - Bob Jiang User Support Team Member - Yuki Ling Community Management Lead - to be hired Cross-Team Scribe - to be hired Treasury Management Lead - to be hired User Support Lead - to be hired  Looking ahead  Building on the successes and lessons learned in S13, we anticipate that the initiatives and commitments we make in S14 will set up our team and the DAO for long-term success. We cannot predict the future, but we have big dreams for GitcoinDAO and in collaboration with our fellow workstreams, will continue to scale existing initiatives to meet the needs of the DAO. Some examples of the DAO-wide objectives and commitments we hope to tackle in S15 are described in the table below:     Initiatives Potential S15 Objectives Potential Commitments     Community Experience Streamline the onboarding process for new contributors to the DAO. Increase engagement on Discord    Set a high-level standard of DAO-wide community management. Align and train community managers in various workstreams and core contributors on best practices.   Accounting Develop a sustainable financial strategy that supports GitcoinDAO’s mission and contributors over the long-term. Develop a financial strategy that balances treasury needs (maximize liquidity vs growth)     Present regular, high-quality reports to GitcoinDAO stewards and contributors, including a quarterly treasury diversification and performance update to the workstream leads & stewards.   User Support Provide professional user support on our various platforms. Build out a social media support program.    Rebuild and empower the user support team Train and mentor highly skilled, remote-first team contributors with clear roles and responsibilities     ",
                    "links": [
                        "https://snapshot.org/#/gitcoindao.eth/proposal/0xaf6b1e2a1a7ed4022b214baccd5e3d12b9037b009e4ea49ec8b9f782a5003c1c",
                        "https://docs.google.com/document/d/17p83gR39lsa7I8FAxobxk56-jxt-jfDVO-0o0ltQLMY/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/griffs-s14-voter-s-guide/10594",
                        "https://gov.gitcoin.co/t/bobs-voter-guide-season-14/10575",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-15-2022/10453",
                        "https://gov.gitcoin.co/t/kris-voter-guide-s14/10554/2",
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v3/10358",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17-2022/10597",
                        "https://gov.gitcoin.co/t/kris-voter-guide-s14/10554",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522",
                        "https://gov.gitcoin.co/t/s14-voters-guide-lefteris-guide/10585"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Board composition",
                        "Smart contract updates",
                        "Privacy, Security and risk management"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.547985058922559
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#2",
                    "likes": "4",
                    "time": "29/04/2022-01:29:16",
                    "content": "As user support coordinator and Gitcoin steward, I support the S14 budget request from DAO OPS workstream. DAO OPS ws provides basic and fundamental services to the whole DAO like onboarding, accounting, devops, tooling, hiring etc. Great jobs! ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#3",
                    "likes": "4",
                    "time": "01/05/2022-10:11:11",
                    "content": "As an essential part of Gitcoin DAO evolution, it’s key to have operations running smoothly and the people working on many of the flows needed in a DAO is paramount. Fully in support of this as there are many areas we need to continue improving on ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#4",
                    "likes": "3",
                    "time": "02/05/2022-10:07:01",
                    "content": "Thanks for all of the DAO operations work that is being done. I’m supportive of this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fishbiscuit",
                    "index": "#5",
                    "likes": "1",
                    "time": "02/05/2022-21:13:18",
                    "content": "Thanks for working on this critical aspect of the DAO! I’m starting to see some of this work pop up in my calendar (training sessions etc). Looking forward to working with the team to help streamline our ops. As a note, I like the format for this budget, and with a view to S15, it gives my a bit more sense of how each pieces fit together to help the larger goal so thank you for this added clarity ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#6",
                    "likes": "1",
                    "time": "02/05/2022-22:28:27",
                    "content": "This budget proposal was an education about what happens deep in the dao operations and I appreciate the great detail that was used.  Very well written y’all.  And fully supported ofc! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#7",
                    "likes": "2",
                    "time": "03/05/2022-04:31:39",
                    "content": "I have been compiling my Voter’s guide and I want to offer some of my questions and observations ahead of posting the voter guide. I do intend to update my voter guide as we discuss here, but hopefully we can keep the DAO Ops relevant convo in this thread. tl;dr on my current sentiment:  DAO Ops - Requesting a reduction (from 115K to 110K GTC), DAO Ops is in a precarious situation having taken on multiple funding obligations for the entire DAO. CSDO ratified DAO Ops should fund career growth and mentorship opps for core contributors, continue to offer best practices and support Accounting, Community Governance, etc. People Ops is also handling onboarding, hiring and “how to DAO” from a legal perspective at the request of CSDO. I fear DAO Ops may be centralizing too many entry points of the DAO and eroding autonomy of workstreams, but WSs seem to prefer this approach for now (this is no fault of DAO Ops merely pointing out they are no longer their own masters, but instead at the behest of CSDO). One criticism, a Community Lead hire does not feel necessary right now, and the growth in People Ops team size (which includes me as well!) is fairly large, but that is largely due to the obligations they have been asked to take on.  As a member of DAO Ops it is hard to abstract my personal opinion from the work they are doing so I want to largely reframe from talking about the validity of the post. The sentiment I am carrying through to every workstream is - how might you be able to reduce your spend for S14 and S15 to really focus on accelerating our protocol development and advancement. Are there places we can press pause that are not necessary? I would love some thoughts from the DAO Ops team on - how might we cut this budget down? Are there areas that can be slowed. To reiterate, this request and feedback is going out to all workstreams. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.860355253212396
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#8",
                    "likes": "3",
                    "time": "03/05/2022-21:29:23",
                    "content": "Hey Jodi thank you for the proposal. This is a really important workstream. Questions about the budget. Is my understanding correct that the budget of $989,000 is to fund the salaries of 17 people (core contributors section) for 5 (3 + 2 reserves) months? That would amount to a monthly salary of $11,635.29 per person which is in my opinion way too high. As I have written in other proposals too we are in a bear market that may get a lot worse before it gets better and we have to make sure that the DAO can survive and deliver on its goals. To that end I think we need to tighten the belt and I believe that can be achieved with a monthly salary of $7,500 which would then bring the total budget to $637,500 or 115,280 GTC based on the spot price of $5.53 you gave. Note that this is still higher than what many Berlin companies (including rotki atm) pay. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.991666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#9",
                    "likes": "2",
                    "time": "04/05/2022-10:45:59",
                    "content": "    Jodi_GitcoinDAO:  Community Experience   I’d like to see more about the connection to the customer (other workstreams). For example, instead of “Deploy updated intake form based on WS feedback” it might help to define an outcome rather than an output. Example: “Workstreams feel that GitcoinDAO is successfully onboarding new contributors in a way that is impactful to them” This would imply that you are doing more than simply putting up a form and hoping it works. If my viewpoint on this workstream was negative, I would say “they want $67k/season to put up a typeform???” Now, I know that is not the intention here, but there are serious concerns around defining outcomes and setting metrics for success. The binary deliverables here are nice for giving us an idea of what direction you are moving (which I think is the correct direction). What they don’t give is any real accountability. Early on in the workstream life it is difficult to set good metrics, but I would like to see  Clear Round over Round metrics for improvement. How do I know if this stream is improving over time? Sourcing of each outcome goal to a current tension. Which workstream(s) are suffering this problem? Accountability attached to a person or persons. Who will be responsible for getting what done? If it isn’t an individual and the thing doesn’t get done, does the whole workstream get held responsible?      Jodi_GitcoinDAO:   Create a treasury dashboard for broader transparency on budget impact and treasury health in close collaboration by the end of S14.    Didn’t MMM already create this?     Jodi_GitcoinDAO:   Create metrics and monitoring that helps us to maintain a 90% up time.    Does this mean we want our services to be available 9/10 times we log on? Where does this 90% number come from? What is the current uptime?     Jodi_GitcoinDAO:   Ensure 75% of DAO contributors who contribute more than 20 hours a week have had a peer review.    It would be great if this was a service offered to workstreams rather than work assigned to workstreams which we didn’t budget for.     Jodi_GitcoinDAO:   Update or create 30 Gitcoin Support Knowledge Base entries by mid S14.    This is one place where I will go Kyle on the subject! We have one single source of truth for everything Gitcoin and it is F&%$#D. With almost a million $$$s requested, can’t we hire a copywriter do a thorough review and rewrite? Isn’t this a priority?  In conclusion Overall, I am supportive of this proposal. I cannot say better than you what it takes to get your objectives done. I don’t agree with @lefterisjp assessment precisely, but I would like to see some transparency on what/why people are being paid what they are. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.647966914038342
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#10",
                    "likes": "2",
                    "time": "04/05/2022-11:27:38",
                    "content": "Hi @lefterisjp Thanks a lot for your feedback about the budget. I could have some explanation here, take support team as an example, besides me (Bob) as full-time ($7k/m) and Joshua (support knowledge base lead, $4k/m) as half-time, other budgets will be paid to the support contributors (aka. support team members) who are paid $100-$300/week based on support efforts. And the support team members are not counted in core contributors. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.7916666666666665
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#11",
                    "likes": "1",
                    "time": "04/05/2022-15:02:57",
                    "content": "@kyle we appreciate this feedback.     kyle:  DAO Ops - Requesting a reduction (from 115K to 110K GTC) ,       kyle:  how might you be able to reduce your spend for S14 and S15 to really focus on accelerating our protocol development and advancement. Are there places we can press pause that are not necessary?   In reviewing our budget we think we can save GTC in the following areas:   Accounting (Remove 100% of Reserves) - 1,255 GTC / $6,000  If needed, we can utilize the 60-days of reserves and remove this line from the budget.    People Ops (reduce Professional Development budget 50%) - 4,184 GTC / $20,000  With notice to CSDO, we could slow the rollout of this program in S14 and S15.    These changes would equal a total savings of 5,439 GTC in S14 (based on today’s price of $4.78). Either way, we are taking your feedback into consideration and will wait for more stewards to weigh in on whether a reduction is necessary at this point. The DAO’s cost savings this season would mostly limit opportunities for coaching & professional development, which hampers our ability to rapidly evolve the DAO. If all of these funds are not used this quarter, they can be rolled over to the next quarter. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.615384615384615
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#12",
                    "likes": "2",
                    "time": "04/05/2022-15:28:53",
                    "content": "    lefterisjp:  Questions about the budget. Is my understanding correct that the budget of $989,000 is to fund the salaries of 17 people (core contributors section) for 5 (3 + 2 reserves) months?   Hey @lefterisjp, appreciate the question and stewardship over this season’s budgets. To answer your first question: yes, our request (like all workstream requests) includes 60-days reserves, which complies with this CSDO proposal ratified in April. These reserves are designed, in part, to provide contributors assurance that their workstreams have some runway when market conditions turn bearish. However, the total budget of $989K includes a whole lot more than just core contributors’ salaries (more below).     lefterisjp:  That would amount to a monthly salary of $11,635.29 per person which is in my opinion way too high.   I will gently push back on your view of contributor salaries for a couple reasons:   Our budget includes a number of initiatives that benefit the DAO as a whole (not just DAO Ops), including a professional development program and 4 PT user support contributors (see @bobjiang’s  note in the comments above).   We currently have a total of 7 FT contributors, including 2 contributors moving from Holdings this season. A more accurate reflection of salaries would be $7,749.43 per month per contributor, the sum of those salaries ($271,230) divided by 5 months (3+2 months reserves), divided by the number of FT contributors. Arguably, the budget would be much larger per month if our PT contributors moved to FT.   Our budget includes several key hires that will serve the DAO, including a new User Support Lead and Treasury Management Lead.       lefterisjp:  we are in a bear market that may get a lot worse before it gets better and we have to make sure that the DAO can survive and deliver on its goals.   But to respond to your valid point here, we are taking another look at our budget to understand where we can save and will also discuss with other workstreams if they are considering reductions in their budgets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7872529644268775
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#13",
                    "likes": "1",
                    "time": "04/05/2022-18:31:47",
                    "content": "Thank you both @Jodi_GitcoinDAO and @bobjiang for the comments and the extra details. It would be beneficial to have a full breakdown of costs with expected monthly salary in $ of each contributor and then all extra expenses forecasted. Then we would be able to judge the budget much more effectively. Same goes for all other workstreams ofc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.703125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#14",
                    "likes": "0",
                    "time": "05/05/2022-13:55:54",
                    "content": "    lefterisjp:  It would be beneficial to have a full breakdown of costs with expected monthly salary in $ of each contributor and then all extra expenses forecasted.   Hey Lefteris, thx for your critical feedback, really appreciated, and you are right. That’s why we linked it from the start, but I know there’s a lot of info - you can find that detailed breakdown here:     Jodi_GitcoinDAO:  Our budget spreadsheet can be found here .   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.811224489795919
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Jodi_GitcoinDAO",
                    "index": "#15",
                    "likes": "4",
                    "time": "05/05/2022-19:47:10",
                    "content": "    DisruptionJoe:  I’d like to see more about the connection to the customer (other workstreams). For example, instead of “Deploy updated intake form based on WS feedback” it might help to define an outcome rather than an output.   Hey, @DisruptionJoe, your feedback reflects the tension we contended with when drafting the commitments we made this quarter. Heading into S14, DAO Ops has many initiatives we feel responsible for delivering to the DAO, but not as many established metrics to go along with them. I’m also interested in seeing more metrics-based accountabilities as we develop as a team. To get into some of you specific points, I would offer the following directional responses:     DisruptionJoe:  Clear Round over Round metrics for improvement. How do I know if this stream is improving over time?    A number of our S13 OKRs did roll into S14 with explanation of outcomes provided in the S13 Recap of the budget narrative. An example of this is the User Support S13 OKR around timely payments. We had mixed results in S13 due in part to the accountability being out of step with the team’s current capabilities. In S14, that specific OKR was modified from User questions are responded to within 24 hours\" to “User questions via tickets and email are responded to within 24 hours during the work week”. But this connection should have been clearer, and we will make that true in future budget requests.      DisruptionJoe:  Sourcing of each outcome goal to a current tension. Which workstream(s) are suffering this problem?    Similarly, making explicit the current tensions we are solving for workstreams is something we can make clearer, but we don’t make these decisions in a vacuum. Instead, we prioritize our work based on discussions with contributors, CSDO, and Stewards. As an example, one of the S14 People Ops OKRs reflects the need to draft and seek the consent for a parental leave policy. We’re making this a priority because this is a priority of DAO contributors.      DisruptionJoe:  Accountability attached to a person or persons. Who will be responsible for getting what done? If it isn’t an individual and the thing doesn’t get done, does the whole workstream get held responsible?    Attaching accountabilities to specific team members are recommendations we will evaluate as we move into S14. For now, the outcome owners in DAO Ops are the initiative leads (Christine - Accounting, Kris - Community Experience, Loie - People Ops, Puncar - DAO Tooling/DevOps, Simona - Community Governance, Kris until lead is hired - User Support). Getting better at measuring success is definitely a good call, and we hope to tap in some of the data analytics you are planning to set up (and expressing what we’re currently not able to measure well).      DisruptionJoe:      Jodi_GitcoinDAO:   Create a treasury dashboard for broader transparency on budget impact and treasury health in close collaboration by the end of S14.    Didn’t MMM already create this?   No, Community Governance and MMM worked out a steward report card and updates to the newsletter in S13. The treasury dashboard is a separate initiative. You actually created some quick graphs, which were great for this season, and would be nice if this could be part of DAO-wide treasury management moving forward.     DisruptionJoe:      Jodi_GitcoinDAO:   Create metrics and monitoring that helps us to maintain a 90% up time.    Does this mean we want our services to be available 9/10 times we log on? Where does this 90% number come from? What is the current uptime?   I refer back to your earlier point here, we cannot adequately measure uptime at the moment for all the data, because we are missing some input here. We’ll be working with the devops/dao tooling team team to better map out what we can & cannot measure at the moment and improve here. cc: @puncar     DisruptionJoe:      Jodi_GitcoinDAO:   Ensure 75% of DAO contributors who contribute more than 20 hours a week have had a peer review.    It would be great if this was a service offered to workstreams rather than work assigned to workstreams which we didn’t budget for.   This is another example of another S13 OKR that has been adapted for S14, and one that People Ops is responsible for facilitating, not workstreams. So to be clear, there will be no budget requirements here for you, just some time required to actually participate in the process.     DisruptionJoe:      Jodi_GitcoinDAO:   Update or create 30 Gitcoin Support Knowledge Base entries by mid S14.    This is one place where I will go Kyle on the subject! We have one single source of truth for everything Gitcoin and it is F&%$#D. With almost a million $$$s requested, can’t we hire a copywriter do a thorough review and rewrite? Isn’t this a priority?   It is most definitely a priority and our knowledge base contributor has made enormous progress on this subject, a lot has already been rewritten and daily improvements are being made, we can definitely organize a more detailed debrief on the progress that has been made so far. Are there specific topics you can point out where you feel it is still F&%$#D?  At the heart of your feedback is a desire to see DAO Ops clearly community how its OKRs support the other structured workstreams, which is fair, and appreciate the feedback. ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.626848845598845
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#16",
                    "likes": "1",
                    "time": "05/05/2022-21:46:03",
                    "content": "    Jodi_GitcoinDAO:  Similarly, making explicit the current tensions we are solving for workstreams is something we can make clearer, but we don’t make these decisions in a vacuum. Instead, we prioritize our work based on discussions with contributors, CSDO, and Stewards. As an example, one of the S14 People Ops OKRs reflects the need to draft and seek the consent for a parental leave policy. We’re making this a priority because this is a priority of DAO contributors.   Great response. Thank you for the clarity.     Jodi_GitcoinDAO:  This is another example of another S13 OKR that has been adapted for S14, and one that People Ops is responsible for facilitating, not workstreams. So to be clear, there will be no budget requirements here for you, just some time required to actually participate in the process.   I appreciate the response to our feedback!     Jodi_GitcoinDAO:  Are there specific topics you can point out where you feel it is still F&%$#D?   Not without going through it and taking notes. I looked at it a week ago and saw that the first 5-10 pages i looked through weren’t updated or current info. I didn’t take notes though. I wouldn’t want someone fairly new with this responsibility to feel that this is a dig at them. I simply would like to see this expedited. Thank you for your response. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.61584595959596
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#17",
                    "likes": "0",
                    "time": "06/05/2022-09:04:56",
                    "content": "Let’s make sure we are always mindful about not doxxing or risk putting people in a vulnerable position re traceability. Some recent events have brought this in prime focus for me in terms of being so publicly visible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lefterisjp",
                    "index": "#18",
                    "likes": "2",
                    "time": "06/05/2022-09:17:18",
                    "content": "Sure there is no reason to put names to positions. But without seeing how much is being spent on what position I personally can’t judge a budget. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#19",
                    "likes": "0",
                    "time": "06/05/2022-09:44:27",
                    "content": "Ofc - just stating so people are aware since some roles are specifically held by one individual vs a group. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/annika",
                    "index": "#20",
                    "likes": "3",
                    "time": "09/05/2022-04:26:19",
                    "content": "@Jodi_GitcoinDAO & @krrisis, thanks for your leadership here. Jumping in to provide my two cents as I go through all the proposals. My overarching feedback in going through the S13 Recap & S14 objectives is similar to what @DisruptionJoe had shared - I would also love to see more of a customer focus in these objectives. For example, people outside DAO Ops don’t necessarily care that “payments within this workstream happens within 21 days”, but we really care about the Accounting support you are providing across the DAO as a whole. In addition, there are several domains largely marked as ‘On Track’ that, from my perspective as a WS-lead-customer & DAO contributor, I would not categorize as such. I think the domains themselves are roughly the right ones for DAO Ops to be focused on, but I think each domain’s specific objectives for success could be better pre-socialized & defined collaboratively with customers - and their success measured retroactively with customers, too. All that said - I am tremendously excited about the work DAO Ops did in S13, and view the two big wins to be the advancement of CSDO / strategy work therein, and the Foundation setup, both of which are absolutely crucial to the advancement of the DAO. I am supportive of this proposal for S14 and will be voting yes. While I could be nit-picky and suggest a couple areas for reduction, I believe this budget to be pretty reasonable and would focus more on refining the customer focus & involvement than on penny-pinching, given how foundational this work is to all of us across every workstream. Thank you for your work! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.047142857142857
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#21",
                    "likes": "0",
                    "time": "09/05/2022-11:54:36",
                    "content": "Hope you saw my answer here. Some worries in the workstreams whether or not this detailed breakdown is enough for you, because we indeed do not want to go further than indicating how much everyone is making, which is already a whole lot of detail and easy to tie to people. Privacy wise this is already a few steps too far according to some.     [S14 Proposal] DAO Operations S14 Budget Request 📜 Proposal Discussion       Hey Lefteris, thx for your critical feedback, really appreciated, and you are right. That’s why we linked it from the start, but I know there’s a lot of info - you can find that detailed breakdown here:     Would love to hear if this level of detail suffices or if there’s anything else you are missing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.006349206349206
                }
            ]
        }
    ],
    "group_index": "77"
}