{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/the-network-effects-of-gitcoindaos-protocols/10973",
            "title": "The Network Effects of GitcoinDAO's Protocols \\xf0\\x9f\\x93\\x88 ",
            "index": 10973,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "Grants2",
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "1",
                    "time": "21/06/2022-02:11:18",
                    "content": "Network effects are a a phenomenon whereby a product or service gains additional value as more people use it…  Screen Shot 2022-06-20 at 7.55.01 PM1078×446 154 KB  Typically the network effects of marketplaces grow n^2 where n is the number of users in the network. By way of example, here is how you could think about the network effects of the Gitcoin entwork:  On average, every funder who joins Gitcoin adds more grant funding to every other grant in the network. On average, every grant who joins Gitcoin generates more value for each funder on the network.   Screen Shot 2022-06-20 at 7.59.29 PM768×630 66.1 KB  The value flow is rather circular here.    This is really powerful because as network effects are spun through this infinite loop, it enables exponential growth in the utility of the network.  5ae77475d1b2b98154f3467b_GeometricLinearGrowth-12727×1879 37.6 KB   The Gitcoin Grants 2.0 Network Effects These network effects are what enable the Gitcoin Grants 2.0 flywheel  We enable Community/Ecosystem builders to get their JTBD (Build their ecosystem/community) done (and get feedback about which parts their community is worth funding). The way we do that is we enable Grant Owners to get their JTBD (raise $$$) done. (and get feedback about which things their community thinks is worth funding)  The way we do that is we enable Contributors to get their JTBD (find great projects, support them) done. (and give feedback about which things they think is worth funding)     The Gitcoin Passport Network Effects These network effects are what enable the Gitcoin passport are  More users using more dapps creates more utility (stamps). More stamps creates more utility(stamps/sybil resistence) for users/dapps that integrate passport. More dApps create more utility(stamps/sybil resistence) that attracts more users.   Why is this powerful?  Because once market networks start to get their network effects flowing, that creates much much more utility for the network. For the DAO to realize it’s essential intent I advise that it may want to consider bootstrapping these network effects as much as possible.  One the exponential growth of network effects begin to really compound on itself, that is a very strong position for the DAO to be in. ",
                    "links": [
                        "https://ncase.me/loopy/v1.1/?data=%5B%5B%5B1,474,245,0.5,%22more%2520users%22,4%5D,%5B2,561,387,0.5,%22more%2520utility%22,4%5D,%5B4,716,261,0.5,%22more%2520dApps%22,4%5D%5D,%5B%5B2,1,70,1,0%5D,%5B2,4,-58,1,0%5D,%5B1,4,11,1,0%5D,%5B1,2,-31,1,0%5D,%5B4,1,34,1,0%5D,%5B4,2,22,1,0%5D%5D,%5B%5B616,185,%22Gitcoin%2520Passport%2520Flywheel%22%5D%5D,7%5D",
                        "https://gov.gitcoin.co/t/proposal-community-input-on-gitcoindao-s-draft-purpose-essential-intents/10662",
                        "https://gov.gitcoin.co/t/knowledge-transfer-characterizing-the-sybil-resistance-problem/11235",
                        "https://gov.gitcoin.co/t/circuits-a-modular-scalable-way-to-think-about-network-utility/11085",
                        "https://gov.gitcoin.co/t/knowledge-transfer-hardness-a-feature-of-gitcoin/11508",
                        "https://gov.gitcoin.co/t/passport-is-our-aws/10995"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.629166666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#2",
                    "likes": "1",
                    "time": "21/06/2022-02:48:58",
                    "content": "One addendum: The cold start problem refers to the problem of getting enough critical mass to trigger a positive feedback loop. If the people on a network produce the majority of value for other users, how do you get the first users to join? Gitcoin Grants 2.0 already has passed the cold start problem because of the momentum of Gitcoin Grants 1.0.  But Gitcoin passport has not. There are some great resources out there that give suggestions about how to solve the cold start problem:    NFX – 25 Jul 19    19 Tactics to Solve the Chicken-or-Egg Problem and Grow Your Marketplace An inside look at 19 tactics top marketplaces have used to solve the chicken-or-egg problem and kickstart growth.  Est. reading time: 7 minutes       A lot of them boil down to \"do things that dont scale to boostrap the network. For example, we could bootstrap the “more utility” portion of the Gitcoin Passport product by adding more integrations.   We could bootstrap the “more users” portion of the network by releasing toy use cases with token rewards in them (eg “prove you have at least $100 worth of cost of forgery in Gitcoin Passport and get a 50 DAI reward”). ",
                    "links": [
                        "https://www.nfx.com/post/19-marketplace-tactics-for-overcoming-the-chicken-or-egg-problem",
                        "https://gov.gitcoin.co/t/poap-edition-gitcoindao-digest-23-2022/11004"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.373974116161616
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#3",
                    "likes": "0",
                    "time": "21/06/2022-05:39:02",
                    "content": "    owocki:  A lot of them boil down to \"do things that dont scale to boostrap the network.   One idea is to offer to fund the deposit on proofofhumanity.id for Gitcoin Passport users to start earning UBI and become more sybil-resistant. I think we already do this within the DAO? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#4",
                    "likes": "2",
                    "time": "22/08/2022-13:09:25",
                    "content": "@octaviaan just put together these excellent graphics depicting then nfx of the protocols.     this is a task that had been on the design backlog since before holdings’ disaffiliation.  the figma is here if anyone in the DAO wants to own these graphics in the future.  Grants Efex1920×1200 141 KB   Passport Efex1920×1200 153 KB  ",
                    "links": [
                        "https://www.figma.com/file/pLkK6c0c1FlSTa68pS1ezX/Infographics?node-id=3%3A695",
                        "https://gov.gitcoin.co/t/the-gitcoin-hyperstructure/11335/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                }
            ]
        }
    ],
    "group_index": "139"
}