{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/bobs-voter-guide-season-14/10575",
            "title": "Bob's voter guide [Season 14] ",
            "index": 10575,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/bobjiang",
                    "index": "#1",
                    "likes": "2",
                    "time": "12/05/2022-09:27:50",
                    "content": "I would thank a lot for @kyle and @krrisis for your initiatives to create the norm for steward voting. love the voter guide (template), here is Bob’s voter guide forked from Kris. Note:  yes, means I support the proposal no, means I do not support the proposal, but it doesn’t mean they (the worksteam) didn’t do the work well. I appreciated all the work you have done, GitcoinDAO contributors!      Workstream Amount Recc Comment     MMM 152K GTC Yes - MMM starts from GR10 and they did great job. I definitely support MMM WS with clear objectives, although the budget is a bit high. MMM is the soul of GitcoinDAO, looking forward S14 and S15.   PGF 185.5K GTC Yes I am supportive for PGF ws. PGF is essential WS in GitcoinDAO and connect multiple DAOs and partners together.   KERNEL 150K GTC No although I am kb5 fellow, I would say no for this kernel. From individual view, I would support kernel absolutely, but from steward view, I would not say yes for this proposal. The reasons are 1. it’s bear market now, as GitcoinDAO we would focus on limited and value stuff (4 things below in this post). 2. it’s a bit high budget request for 150k GTC. 3. this is a new WS, not sure the process for new ws with budget request. 4. alternative solution is the mutual grants. Additional reference to Annika’s comment [S14 Proposal - Amended x2] KERNEL Budget Request of 49K GTC - #17 by annika , I would support Kernel with other way of coordinations with GitcoinDAO, not workstream.   FDD 118K GTC Yes Support FDD workstream, because FDD is the most innovative WS in GitcoinDAO (maybe I am wrong). As I known, the financial parts and DAOops ws, and council working model are from FDD ws. Although it looks messy in FDD, it is clear that the goal is to decentralize and control by community.   DAO Ops 115K GTC Abstain  n/a - I am support team coordinator (belongs to DAO Ops ws), so I would not vote for this proposal.   MSC 83.5K GTC Yes Moonshot is an innovative machine for innovation, which is the source of protocolDAO of GitcoinDAO. Support MSC ws. We can see there are several ships from MSC like coordination party toolkit, popp, and grant 2.0 etc.   Kudos 6.6k GTC No Based on below 4 key things , I won’t not say yes for Kudos.   dCompass 19K GTC No This is a tough proposal, dCompass comes from GR11 with the idea dQuest. But from last 2 rounds, I cannot see the benefits for GitcoinDAO.    Quotes from Kris as following: 4 important things GitcoinDAO would focus:    Kris' Voter Guide S14   we want to focus on 4 points as a DAO (random order!):  Improve Coordination Intra Gitcoin DAO Gitcoin Grants 2.0 (Protocol) Grow Grants GMV Financial Sustainability    ",
                    "links": [
                        "https://gov.gitcoin.co/t/s14-proposal-public-goods-funding-budget-request/10443",
                        "https://gov.gitcoin.co/t/s14-proposal-kernel-a-gitcoin-workstream-proposal/10444",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-x2-kernel-budget-request-of-49k-gtc/10444/17",
                        "https://gov.gitcoin.co/t/s14-proposal-fdd-season-14-budget-request/10448",
                        "https://gov.gitcoin.co/t/s14-proposal-dao-operations-s14-budget-request/10447",
                        "https://gov.gitcoin.co/t/s14-proposal-moonshot-collective-budget-request/10446",
                        "https://gov.gitcoin.co/t/s14-proposal-decentralize-gitcoin-kudos-budget-request/10442",
                        "https://gov.gitcoin.co/t/s14-proposal-dcompass-budget-request/10412",
                        "https://gov.gitcoin.co/t/kris-voter-guide-s14/10554/1",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17-2022/10597"
                    ],
                    "GPT-summary": "The post is a voter guide for GitcoinDAO's Season 14, where the author explains their support or lack thereof for various workstreams and proposals. The post contains entirely positive, negative, and abstaining feedback on different proposals, along with constructive criticism and questions. The author also explains the four key points that GitcoinDAO should focus on.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.374228759456033
                }
            ]
        }
    ],
    "group_index": "95"
}