{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/experiments-and-learnings-in-community-engagement/12529",
            "title": "Experiments and Learnings in Community Engagement ",
            "index": 12529,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/Viriya",
                    "index": "#1",
                    "likes": "6",
                    "time": "09/01/2023-20:31:39",
                    "content": "As the conversation on community relations (namely, GTC holder relations) unfolds here, it felt appropriate to share some context with the wider group in order to further the conversation on community engagement and make some operational suggestions on how to move forward.  tl;dr  As of right now, MMM has failed to produce a meaningful community engagement plan due to a variety of reasons (both within and outside of our control) which are outlined in this post We feel that we as a DAO we need to be more intentional in how we resource community engagement We feel this work requires a dedicated team to support the development of a meaningful strategy and this post is intended to solicit a conversation about this direction The end of this post details what we feel needs to be true for community engagement initiatives to be successful at Gitcoin  When the DAO launched in 2021, PGF, DAO Ops and MMM had all embarked on working their own community engagement initiatives—DAO vibes, Public Goods Library, Public Goods are Good, Memepalooza, to name a few efforts. As the DAO began to make moves to its protocol future, there wasn’t a clear picture on how community engagement in its former state would support its new direction. Additionally, there was a lack of enthusiasm for having all of the community engagement efforts being spread across all of the workstreams - duplicative work was being done and there was a general lack of strategy & coordination amongst the teams. This made it extremely difficult to measure the ROI of these initiatives…which was especially pertinent as the market turned. So moves were made to slowly align and consolidate community engagement efforts. As we sunsetted the Public Goods Library (RIP), refocused the efforts of the (former) Grassroots substream at PGF to specifically support grantee engagement and began to shift the focus of DAO Ops away from community engagement and more towards streamlining ops and strategy across the DAO, community engagement seemed to fit under the umbrella of the MMM workstream. At the time, this made sense to all of us for 2 reasons:  Community engagement is heavily tied to building brand affinity and a brand community, if meaningfully engaged, can support a grassroots proliferation of a project’s mission. MMM has historically (although not strategically) been one of the main centres of community, creativity and vibes at Gitcoin. At least from our perspective, it seemed like a reasonable thing for MMM to take on. MMM also owned public-facing channels (like Twitter) where some of these activities were still taking place.   Summary of Community Engagement @ MMM So, MMM declared our intentions around community in our seasonal OKRs and we spent the latter half of Season 15 and the beginning of Season 16:   auditing the different groups (whether we want to call them stakeholders, sub-communities, customers, users, etc.) that might matter to the DAO’s future; and identifying what is being done to support these groups  coming up with recommendations for how we might resource these groups (also in a matrix of stakeholders vs workstreams responsible) engaging in DAO-wide conversations to address resource gaps and started seeding conversations on a direction for a community-engagement strategy with some great preliminary (but uncoordinated) thinking laid out by myself, Scott and Kyle with help from Kris began to draft a community hub in Notion that segments our different audiences and provides key info those stakeholders need to make sense of our they can interact and participate with and within the DAO  Challenges we faced & what we learned Aligning on a community engagement strategy was more difficult to coordinate than we had originally expected. Over these months, we have encountered some challenges as they relate to building out a meaningful, widely-accepted plan:   Implicit deprioritization. Over the course of the year, the DAO has increasingly focused its resources to develop and launch the protocols. In light of those changes, resourcing meaningful community engagement activities (which are often longer-burn initiatives) has been difficult to make a case for—often with pushback during budgeting season. Moreover, with this initiative being cross-functional, complex and seemingly lower priority than, say, building our products and planning changes to the program, it moved slow and consensus was difficult to find as attention was elsewhere.   Internal shifts were happening at a people level. As we began this work in S15, our working culture suffered a bit from a series of offboards and shifts in leadership. Many changes were happening at the DAO that left contributors uncertain of their future—I believe this created a lack of psychological safety for the initial audit that was performed. Moreover, this audit was performed by Gary Sheng, who was a new (and therefore unknkown) contributor at the time.   Lack of business strategy. The historical lack of a business strategy (which is now being amended by CSDO) and lack of clarity on key audiences (which has been amended - see MMM’s S16 audience breakdown) has made it difficult to create an intentional community engagement strategy that discerns which constituents count as community members vs. audiences and clarifies goals that ladder up to specific business outcomes.   Lack of authority and unclear decision rights. A meta-challenge we faced in addressing these challenges was the issue of DAO decision rights and MMM’s authority to lead in the absence of consensus. As we discovered, different contributors have different mental models of what community is. This work also impacts our DAO roadmap and is directly tied to our culture and values as a DAO. We noticed that these conditions created a slight political predicament as we began to make recommendations to operate from. This meta challenge relates to the larger operational and strategic challenges of the DAO—which ultimately fell out of the scope of this work.    What MMM could have done differently As a co-lead of the MMM workstream, I’d like to acknowledge our WS failures in being able to effectively move this work forward. I don’t think our efforts were fruitless—many lessons were learned but I want to personally acknowledge that we could have done more to coordinate efforts in this area. Here are areas we feel we could have improved upon:   We got started with the community engagement audit and development of a community engagement strategy without having explicit buy-in from the different cross-workstream stakeholders. We made the assumption that we had DAO-wide buy-in to undergo an audit and we did not do foundational work to create a sense of psychological safety and enthusiasm around the process. Relatedly, we didn’t sufficiently interrogate whether the MMM workstream (aka the marketing team)—or any current workstream—was well-suited to lead this work (both in contributor skillset and organizational decision rights).   We did not align on the most foundational pieces of this strategy, which is establishing a shared definition of terms and creating shared mental models amongst DAO members as they relate to community engagement. The terms “community” or “community engagement” are used liberally across the org (and the entire web3 ecosystem) without a shared, agreed-upon definition. The definition of “community” we initially used to unblock our work (although, perhaps prematurely) is that community engagement = activities that progress our priority stakeholder groups through their respective acquisition-retention funnels; and that community = the sum of our priority stakeholder groups. Which, to me, feel more aligned to a marketing paradigm vs. an org cultural paradigm. I feel that more work needs to be done to align the DAO on this foundational piece but it is complex and difficult to find rough consensus on.   It took time to recognize the nature of the challenges we were experiencing, but we could have been more proactive in raising our challenges to our Stewards & DAO leadership.   We could have been more proactive in laying out and implementing the following recommendations we’re outlining out in this document.    We’d like to discuss the potential of a thin workstream to be created to support community engagement  Given the challenges outlined above, our team believes that community engagement should not live within the domain of the marketing team. We believe that a community strategy, important, impacts all of our work and is something that should be lead by a small, skilled team specifically empowered by DAO leadership to:  Host design sessions to co-create a community strategy that includes lots of opportunity for DAO contributors across streams to weigh in lead the execution of the strategy solely own the key results of this strategy  We believe this team should have enough resources on its own to not have to draw resources from other workstreams, and repeat confusing coordination challenges. There are a few additional things worth noting re: why we think this is our best option as a DAO:   There is an inherent understanding that as a DAO and a leader in web3, community engagement is important for us to achieve our mission but there is still a lack of shared agreement on how community (or various sub-communities beyond a developer community) will serve protocol adoption and/or how community should be engaged to achieve our shared goals. We think that having a dedicated team to seek answers and strategize around these questions will best serve this initiative.   A skilled driver needs to be appropriately positioned to align us around shared definitions and determine our best foot forward. This person would lead strategy development and execution in this area with input from the workstreams and added p/t support if need be. We believe it will be more effective for a community strategy to be developed by a small team of people who are wholly focused on this initiative vs. solely staffed by contributors who only have a part-time focus on community work.   And last, but certainly not least, as the marketing team, we would like to dedicate our resources to focus on the product marketing work that is needed to drive protocol adoption—as we launch and grow 3 protocols, we have made MAJOR strides in this area and we would like to keep up our momentum here. Given the amount of foundational work that needs to be done in order to create a community strategy and then execute said strategy, we feel we are currently not resourced appropriately to give the time and attention this deserves.   Here are some initial goals we believe a community team should achieve in the first season of its existence, in sequential order:   Run design sessions with a select group of contributors to secure and document concepts such as:  community ecosystem community engagement community support users    Run design sessions with a select group of contributors to secure and document answers to these questions:  What is the purpose of this team? What does success look like? What are their objectives? How does this team support Essential Intents and protocol adoption? How does this team’s roadmap ladder up to an overall DAO strategy/roadmap? How does this team interact with other workstreams? What are the team’s lines of authority, roles and responsibilities within the DAO’s structure? How do our protocol user bases relate to “community”? How does community relate and differ from DevRel? Are there multiple communities? Or sub-communities? How will you prioritize which ones are served?    Summarize findings and propose a strategy that answers the above and solicit for DAO-wide feedback   We also think that the lead of this initiative should be embedded in the CSDO body and/or the Steward Council to bolster a connection to our overall strategic direction   Moreover, in order to set a community team up for success, we believe that as a DAO we should…   clearly articulate and socialize long-term organizational goals that a community strategy can ladder up to. We’re happy to report that there are internal discussions and forum discussions happening around this but wanted to make this super explicit here.  secure strong organizational buy-in and a shared agreement around decision rights as it comes to this area. There should be be no question on what kinds of decisions the community team has authority to make at its inception.  Optional: propose tentative definitions and answers to the words and questions above, with the understanding that the community team can thoughtfully modify these tentative answers. This is to ensure that the work the community team does has legitimacy from DAO leadership from the start.   In conclusion  Community work, under most reasonable definitions of “community,” can support the success of Gitcoin DAO. But in order for a community team to be successful, they need strong buy-in from DAO leadership from the start and it needs to be clear how their work ladders up to DAO-wide organizational goals. Under the “Summary of Community Engagement @ MMM,” section of this post we share some documents that will help get the new team on the right foot. Finally, we’re happy to advise and participate in this process as needed.  If we collectively feel that this work should still live under MMM, we’re happy to reassess and co-create an approach that will create a shared desired outcome. Thanks to co-authors @garysheng and @CoachJonathan ",
                    "links": [
                        "https://gov.gitcoin.co/t/request-for-feedback-proposed-future-for-the-grant-programs-and-gr16-as-we-transition-to-the-protocol/11624",
                        "https://www.notion.so/Summary-of-Community-Experience-Audit-0e5aea172bf84766b7dd0c681f6f7fb6",
                        "https://www.notion.so/New-Recommendations-About-Gitcoin-Community-Strategy-Dec-2022-fb035d75d60b455e90885b32ac707cf9",
                        "https://www.notion.so/Gitcoin-Priority-Stakeholder-Engagement-Strategy-WIP-a63c604bf366468181489b79bb370a2a",
                        "https://miro.com/app/board/uXjVPRbH3xI=/",
                        "https://gitcoin.notion.site/Thoughts-on-Community-Engagement-3dcf99c2a22444b581ac3ef54dc0835a",
                        "https://docs.google.com/document/d/1cQVZj4rKbelBU0uoeKZKUZ9eRW50PhIyymfo1Ru8LRY/edit",
                        "https://gov.gitcoin.co/t/discussion-gitcoin-2023-future-essential-intents-and-organization/12533",
                        "https://www.notion.so/The-Three-or-Four-Audiences-MMM-Should-Care-Most-About-1d3a5def908741d89809d1e8282a8768",
                        "https://gov.gitcoin.co/t/improving-dao-community-relations-long/12484/16",
                        "https://gov.gitcoin.co/t/s17-proposal-integrated-mmm-budget-request/12733",
                        "https://gov.gitcoin.co/t/discussion-gitcoin-2023-future-essential-intents-and-organization/12533/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7564296469575975
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/carlosjmelgar",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/01/2023-20:08:50",
                    "content": "I’m keen to support with community work ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kyle",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/01/2023-21:52:50",
                    "content": "I really appreciate the details on our learnings, and on the opportunity to still serve this. I would love for @0xZakk to also read and offer his take  As we get further along with our DevRel efforts, I could see “community” at large folding in. So, this may be a thing we want to live with MMM for one more season, but then evaluate as we build more muscle with our Devrel interactions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4647495361781075
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#4",
                    "likes": "2",
                    "time": "12/01/2023-14:14:10",
                    "content": "Thanks for this detailed post Laura. I noticed MMM has been struggling in making process on the community engagement topic for all the reasons you outlined above, although I think you all did start off extremely strong, with the segmentation exercises by @garysheng. I think this season has been particularly challenging because we have done a lot of reorienting towards our protocol future, and on top of this working and decision making in a DAO is hard. I have however deep trust in MMM being able to make decisions here, with a lot of skilled people within the team, and would strongly suggest to keep this key topic under the umbrella of MMM, I do not see real advantages on creating a separate workstream for this at this point.     Viriya:  We believe that a community strategy, important, impacts all of our work and is something that should be lead by a small, skilled team specifically empowered by DAO leadership to:  Host design sessions to co-create a community strategy that includes lots of opportunity for DAO contributors across streams to weigh in lead the execution of the strategy solely own the key results of this strategy  We believe this team should have enough resources on its own to not have to draw resources from other workstreams, and repeat confusing coordination challenges.   Big plus one on a dedicated team. However, I fear that by pulling this into a separate workstream you risk to increase the difficulty on achieving the desired results here, as this is really your core business imo. MMM is and should feel empowered to host these sessions, to lead the execution and own these key results, with a dedicated driver and (part-time) team focusing on this. It is a tough nut to crack, but I think you are halfway there, just pushing it out is not the solution. What MMM is doing in terms of product launch communication needs to be deeply interlinked with community engagement. Who else are you communicating to than to our community? I like the way @garysheng phrases it here: our community is the people we serve, the people for whom we are building our products. That’s it. These are simply put the end users (grantees & donors) and the power users (grants protocol & passport tech users). Imo the first one will probably evolve into the one Marketing (mmm) focuses most on (as an integrated part of other workstreams, or as the standalone entity it currently is), the second one is where Devrel will focus most on.     kyle:  I would love for @0xZakk to also read and offer his take  As we get further along with our DevRel efforts, I could see “community” at large folding in.   So I am in semi-agreement with the above.  Dev community yes, end users, no - this is MMM, this is your and our core and largest, deeply valued audience. Without our large community of end users and supporters we simply have no reason to exist. You are however indeed still missing some puzzle pieces and I feel your pain, deeply, both as a ‘retired’ comms lead and the daily complexity of driving DAO Operations. In the upcoming season we will refine our essential essents, and hopefully we’ll also agree on a very clear value proposition, but at the same time I hope MMM will not get discouraged and burn out on making decisions on efforts related to our core audience(s). We are a consent based organization. You might not always get strong buy-in, but if you don’t get ‘blockers’ I would push forward on making some decisions, as long as you have consulted with key stakeholders within our DAO. Hope this helps. Open to more live chats at any moment too! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.736470573077716
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Viriya",
                    "index": "#5",
                    "likes": "1",
                    "time": "12/01/2023-17:52:12",
                    "content": "Really appreciate your thoughts here, @krrisis. After posting my brain dump, I’m feeling a little more clear and have a renewed energy to tackle community engagement. I’m also meeting with @0xZakk this afternoon to discuss a variety of topics–I imagine this will come up in our conversation. Given @kyle’s suggestion to keep community engagement at MMM for at least another season (we’ll see how the DAO structure evolves from there)–I will (obviously) not let community engagement become an afterthought for us. I plan to take some of the steps outlined above to build a strong foundation for the DAO to operate from in our protocol future. One thing that I think needs to be distinguished is the different between marketing, comms, support & community engagement. In traditional orgs they are distinct pieces of an overall “customer/audience relations” play. It feels like for us they are blurred and I’m not sure if this is the most effective approach. I will facilitate some more thinking on this in the coming weeks to try to decipher and clarify some foundational pieces for us. Please let me know if there are existing documents that detail these distinctions or provide definitions on the concepts above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6655092592592595
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/safder",
                    "index": "#6",
                    "likes": "2",
                    "time": "16/01/2023-23:34:22",
                    "content": "I really appreciate this thoughtful reflection on MMM’s community learnings over S16 - building intentional community is such an essential part of our work at Gitcoin and one that’s made doubly difficult (as are many other things haha) with the unique challenges that come with working as a DAO.     Viriya:   But in order for a community team to be successful, they need strong buy-in from DAO leadership from the start and it needs to be clear how their work ladders up to DAO-wide organizational goals.    This is the crux of our problem - we have no cohesive branding/platform/metrics/narrative for community work, and I believe this is why it made sense for MMM to build these things. But it’s really hard to make progress without cross-stream buy-in, and community happens to be one of the things everyone has very strong opinions on. I would be strongly in favour of a Community Workstream that is recognized as the subject-matter experts in this domain, and has the authority to fully own this. Currently, literally each workstream sort of has their own “communities” (DAO Ops: Stewards; MMM: Discord Citizens/regen Twitter community; PGF: grantees/program managers; FDD: Open Data Community; GPC: DevRel) and their own very different, ways of engaging them + little to no communication between these groups. This to me makes no sense at all. If we think of Gitcoin’s Protocols as a 4-sided marketplace:   Developers: They create new tools/apps etc to enable more successful use of our products/build new ones that grow the ecosystem. This is the group the DevRel team is being brought on to focus on (GPC), and I believe there is strong community potential here. I think the Open Data Community FDD is developing is a part of this, and I think we’d do well to recognize the overlap here.   Program Managers: To me, these are sort of like the “sellers” in two-sided marketplaces such as Etsy. I’m not sure if we’ve defined them in this way before but without Program Managers/matching funders, I can’t think of a good reason why projects would want to raise funds through Gitcoin vs. any other grants program (other than maybe using Gitcoin as the UX in the future). I think a community of Program Managers could be hugely beneficial (same way Etsy’s community of sellers is to them), and is worth a team dedicating resources to the same way we’re dedicating resources to DevRel.   Grantees: Imo these are closer to the “buyers” in a traditional two-sided marketplace rather than “sellers”, other than the fact that we want to ensure that the buyers in this case meet certain thresholds for quality (kind of like Airbnb guests). Similar to Program Managers, I think there is huge potential in turning this group into a community rather than keeping it as a transactional relationship. I think we write off both this and the Program Managers group too easily as beneficiaries instead of potential communities.   Donors: These are our “Citizens” - they’re the essential + under-appreciated regen labour force that keep the flywheel spinning. Airdrop/POAP farmers aside, people donate to Gitcoin grants because they believe in the revolutionary potential of the tools we’re building. Often they might not even care so much about the grants they’re donating to (like a worker might not care for their job), but they contribute because they believe in the world they (think they are) helping to build by signal-boosting Gitcoin. The act of “donating” for a Citizen is like voting - it feels fulfilling but it’s low-effort and they don’t get to immediately see tangible results of their individual actions. This is when they seek out things like becoming a Steward (a sub-community), in the hopes that they’ll be able to play a more hands-on role. And currently that’s really the only role we have for them. Because that role isn’t what everyone is looking for as a next step (imagine if voting + running for government was the only way you got to participate in society), we lose their interest if we fail to provide them with other more fulfilling roles at this stage. If we continue to ignore them, they’ll leave the community feeling unappreciated and disillusioned (and eventually also stop donating). I’m very bullish on this segment and I believe we should be dedicating the same amount of resources/effort we’re starting to put into DevRel, into building and maintaing this community.   I think it makes a lot of sense for all of these community groups to be served under one Community Workstream that shares tools/resources/platforms/learnings etc. However, I think if it were to happen now, such a workstream would immediately fall out of favour and we’d dust off our hands and call it a failure. Community development is a slow, intentional process, and I don’t think the DAO can be convinced that spending money on a new function that will potentially take 6+ months before it starts yielding any significant results is worthwhile - not before we’ve launched the Protocol and (hopefully) found ourselves in a more comfortable financial position. I also don’t think the various workstreams are ready to fully let go of their current “community” functions (as unideal as they are). For these reasons I would agree with @kyle here that it makes sense for MMM to continue to own this for now, and potentially also think about what a consolidated Community Workstream might look like + how it can be set up to succeed (and how we can convince workstreams to let go of their disparate community projects so that they can truly fluorish). Very bullish on MMM’s ability to continue to give this the care that it deserves! This topic is super interesting to me, so I’d love to remain a sounding board/thought partner here. I launched and helped develop the Citizens community in S14+S15 so I’m especially interested in how we can continue to nourish that group, but also super interested in engaging with general community strategy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.91021300128443
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Maxwell",
                    "index": "#7",
                    "likes": "3",
                    "time": "17/01/2023-22:00:08",
                    "content": "Thanks so much for this thoughtful post Laura and crew! This comment below by Kris largely captures my sentiment.     krrisis:  It is a tough nut to crack, but I think you are halfway there, just pushing it out is not the solution. What MMM is doing in terms of product launch communication needs to be deeply interlinked with community engagement. Who else are you communicating to than to our community?   Obviously community matters, and I’d argue we are more-or-less effectively engaging our community through Twitter, documentation, strategic partnerships, grantee groups + calls, Schelling Point, our new Community Gathering we are testing this year, etc. imo I think we shouldn’t over-complicate community strategy, and we should probably focus on less, not more. I also definitely believe the best way to know and engage our community is to be out there with them, whether it’s having our contributors be active in different DAOs, friend groups, IRL events, etc. The more active Gitcoin contributors are in the wider Ethereum ecosystem, the more we’ll have a better sense of what we are really doing together. Overall - I think we should probably have a fairly simple community strategy. I trust MMM and especially Vermeer in the social media manager role. And I trust our event planning team / squads. Echo the above sentiments about this work remaining in MMM, and agree with Saf that I’m happy to be a thought partner here as we continue developing this work. It’s exciting! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.830881566992678
                }
            ]
        }
    ],
    "group_index": "288"
}