{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/circuits-a-modular-scalable-way-to-think-about-network-utility/11085",
            "title": "Circuits - a Modular/Scalable Way to think about Network Utility ",
            "index": 11085,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "5",
                    "time": "08/07/2022-18:36:38",
                    "content": "In this post, I would like to articulate the way I think about the DAO building Network Utility.  I will not prescribe any particular mechanism, but I will try to build a vocabulary for thinking about these mechanisms. By having visuals and by sharing a common vocabulary + a modular, composable, scalable way of thinking about network Utility, the DAO will have less of a coordination lift to build network utility + network Utility. Post TLDR  Circuits are a composable way of connecting governance Utility to Network Utility in a positive sum way Adapters are the primary mechanism within a circuit. Circuits & Adaptors can be stacked modularly. The remainder of the post explores stacking circuits in practice.   Circuits Per https://gitcoin.co/results we know that Gitcoin delivers $6m/quarter in financial network value & a ton of social value too to the ecosystem.  Because Gitcoin is a double sided marketplace (grant owners <> funders), The Network Effects of GitcoinDAO's Protocols 📈 (in theory) create an exponential growth in the network utility for both sides of the marketplace. For the purposes of simplicity in this post, I will abstract this double sided marketplace into one node:  This post will articulate how the DAO might build a circuit that, when combined with an adapter, could create both more network utility and governanceUtility  An adapter is a credibly neutral mechanism that connects the network (which is already creating utility for the ecosystem but has governance problems) to GTC governance token (which is held by people who have the context to govern Gitcoin, but has no utility). In this circuit, the adapter exports governance to the parts of the circuit that needs governance, and utility to the part of the circuit that needs utility.   GTC governance tokens have little utility + a lot of ability to govern. The network has a lot of utility + lots of governance problems An adapter bridges the two, creating more utility for governance (reducing governance problems) + also more utility.  At least in theory!   More legitimacy - the first bonus feature It gets better. Since the network  utility is now being governed better according to the preferences of its users (who bc of the retro airdrop have GTC), the end result is more legitimacy, which creates more utility.  The whole thing is even more positive sum.   Modularity - the second bonus feature Know what else is cool about these circuits?  They can stack on top of each other fairly modularly! Lets stack some circuits!  Heres what that could look like:  An aside: @kyle has sent me a great post about how NOT to do this here. Any such adapters should likely innovate so they are positive sum (past DAO staking tools have not really done this well) Weee !  Bitcoiners stack sats.  At Gitcoin, we stack circuits  Stacking Circuits in Practice  Example 1 - Passport GTC Staking One idea I’ve seen kicked around the DAO is the idea to add more total sybil resistance into the Gitcoin ecosystem + web3 ecosystem with Gitcoin passport by adding more stamps to the  system.  The post Passport is our AWS goes into this idea in depth. One thing that could be done is to build an circuit that creates sybil resistance (network utility) with GTC.  Imagine an adapater is built that allows people to stake on each others identities to increase the sybil resistence of each user staked.  So for example,  I know @kyle is a real human, so I take $300 worth of GTC on him.  If his Gitcoin Passport ID had a cost of forgery of $50 before, he now has a $350 cost of forgery. I know @linda is a real human, so I take $1000 worth of GTC on her.  If her Gitcoin Passport ID had a cost of forgery of $337 before, she now has a $1337 cost of forgery. and so on.  Heres what I think this looks like:   Example 2 - Conviction Voting GTC Staking Here’s a circuit that is already built!  A GTC conviction voting app! It consists of an adapter hosted at voting.gitcoin.co where anyone can go in and stake their GTC on which grants they think are higher quality than other grants.    This provides fairer starting conditions to the Gitcoin Grants rounds, so it does not become a horse race (where ppl get more contributions => higher matching => repeat) Heres what I think this circuit looks like:   Example 3 - Mutual Grants One thing that I think is fairly upside for Gitcoin could be Mutual Grants - which again, are already happening. Mutual Grants allow Gitcoin to invite our partner ecosystems to participate in Gitcoin governance, which increases Gitcoin governance utility. The same could be true in reverse (Gitcoin creating partner ecosystem utility). For more on this idea, checkout updates from @ceresstation on this thread: Constructing a Mutual Grants Committee Heres what I think this circuit looks like:   Stacking Circuits = SuperCircuit! Here is a stacked circuit of these 3 circuits.  Notice how once the circuits are setup correctlly (positive sum) utility flows around the supercircuit like water flowing downhill. Now that we’ve looked at the expanded version of this circuit, we could perhaps simplify. This stack of circuits could be further simplified by looking at the circuits from the to down as opposed to stacked next to each other.  eg as follows:  For those skilled at reading between the lines, the total Utility is bounded by  total network utility how much of that utility is translated into governance utility by adapters.  Feedback welcome. ",
                    "links": [
                        "https://gov.gitcoin.co/t/the-network-effects-of-gitcoindaos-protocols/10973",
                        "https://ncase.me/loopy/v1.1/?data=%5B%5B%5B1,527,391,0,%22GTC%2520Utility%22,4%5D,%5B2,714,379,0,%22adapter%22,5%5D,%5B3,966,379,0.16,%22network%2520utility%22,3%5D%5D,%5B%5B2,1,73,1,0%5D,%5B1,2,66,1,0%5D,%5B2,3,33,1,0%5D,%5B3,2,53,1,0%5D,%5B2,2,126,1,21%5D,%5B3,3,130,1,58%5D%5D,%5B%5B745,276,%22more%2520legitimacy%2520%253D%253E%2520more%2520utility%22%5D%5D,22%5D",
                        "https://ncase.me/loopy/v1.1/?data=%5B%5B%5B1,527,391,0,%22circuit%2520GTC%2520Utility%22,4%5D,%5B2,714,379,0,%22adapter%22,5%5D,%5B3,966,379,0.16,%22circuit%2520network%2520utility%22,3%5D,%5B15,723,534,0,%22adapter%22,5%5D,%5B16,719,221,0,%22adapter%22,5%5D,%5B17,533,220,0,%22circuit%2520GTC%2520Utility%22,4%5D,%5B18,989,230,0.16,%22circuit%2520network%2520utility%22,3%5D,%5B19,974,527,0.16,%22circuit%2520network%2520utility%22,3%5D,%5B20,512,539,0,%22circuit%2520GTC%2520Utility%22,4%5D,%5B21,249,390,0,%22total%2520GTC%2520Utility%22,4%5D,%5B22,1194,396,0.5,%22total%2520network%2520utility%22,3%5D%5D,%5B%5B2,1,73,1,0%5D,%5B1,2,66,1,0%5D,%5B2,3,33,1,0%5D,%5B3,2,53,1,0%5D,%5B3,22,-27,1,0%5D,%5B22,3,-30,1,0%5D,%5B22,18,-26,1,0%5D,%5B18,22,-10,1,0%5D,%5B19,22,-18,1,0%5D,%5B22,19,59,1,0%5D,%5B22,22,117,1,74%5D,%5B18,16,9,1,0%5D,%5B16,18,-19,1,0%5D,%5B16,17,4,1,0%5D,%5B17,16,22,1,0%5D,%5B15,20,-30,1,0%5D,%5B20,15,-30,1,0%5D,%5B15,19,14,1,0%5D,%5B19,15,57,1,0%5D,%5B21,1,-16,1,0%5D,%5B1,21,-21,1,0%5D,%5B17,21,-18,1,0%5D,%5B21,17,-59,1,0%5D,%5B20,21,-9,1,0%5D,%5B21,20,-49,1,0%5D%5D,%5B%5D,22%5D",
                        "https://cobie.substack.com/p/apecoin-and-the-death-of-staking",
                        "https://gov.gitcoin.co/t/passport-is-our-aws/10995",
                        "https://gov.gitcoin.co/t/gtc-conviction-voting-dapp-gtc-utility/10523",
                        "http://voting.gitcoin.co",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://gov.gitcoin.co/t/constructing-a-mutual-grants-committee/10347",
                        "https://ncase.me/loopy/v1.1/?data=%5B%5B%5B1,473,212,0.16,%22Circuit%2520GTC%2520Utility%22,4%5D,%5B2,669,203,0,%22adapter%22,5%5D,%5B3,928,199,0.16,%22total%2520sybil%2520resistence%22,3%5D,%5B4,1111,157,0.5,%22other%2520sybil%2520resistence%2520tools%22,1%5D,%5B5,921,356,0.16,%22total%2520grants%2520GMV%22,3%5D,%5B6,689,369,0,%22adapter%22,5%5D,%5B7,522,376,0.16,%22Circuit%2520GTC%2520Utility%22,4%5D,%5B8,316,366,0.16,%22Total%2520GTC%2520Utility%22,4%5D,%5B9,1233,354,0.16,%22total%2520network%2520utility%22,3%5D,%5B10,1193,522,0.66,%22other%2520grants%2520drivers%22,1%5D,%5B11,526,511,0.16,%22Circuit%2520GTC%2520Utility%22,4%5D,%5B12,697,514,0,%22adapter%22,5%5D,%5B13,893,521,0,%22GTC%2520partner%2520ecosystem%2520utility%22,3%5D,%5B14,1047,592,0.5,%22other%2520partner%2520ecosystem%2520utility%22,1%5D%5D,%5B%5B2,1,94,-1,0%5D,%5B1,2,89,1,0%5D,%5B4,3,40,1,0%5D,%5B2,3,20,1,0%5D,%5B3,2,49,1,0%5D,%5B3,9,23,1,0%5D,%5B9,3,14,1,0%5D,%5B5,9,12,1,0%5D,%5B9,5,35,1,0%5D,%5B6,5,38,1,0%5D,%5B5,6,28,1,0%5D,%5B6,7,-33,1,0%5D,%5B7,6,-40,1,0%5D,%5B7,8,-31,1,0%5D,%5B8,7,-17,1,0%5D,%5B8,1,-17,1,0%5D,%5B1,8,-56,1,0%5D,%5B10,5,14,1,0%5D,%5B5,10,39,1,0%5D,%5B3,4,14,1,0%5D,%5B14,13,-15,1,0%5D,%5B13,14,-30,1,0%5D,%5B8,11,-2,1,0%5D,%5B11,8,49,1,0%5D,%5B11,12,26,1,0%5D,%5B12,11,49,1,0%5D,%5B12,13,34,1,0%5D,%5B13,12,29,1,0%5D,%5B13,9,26,1,0%5D,%5B9,13,22,1,0%5D%5D,%5B%5B465,138,%22Sybil%2520Resistence%2520Circuit%22%5D,%5B530,317,%22Gitcoin%2520Grants%2520Circuit%22%5D,%5B523,602,%22Mutual%2520Grants%2520Circuit%22%5D%5D,14%5D",
                        "https://ncase.me/loopy/v1.1/?data=%5B%5B%5B6,654,389,0,%22many%2520adapters%22,5%5D,%5B8,458,392,0.16,%22Total%2520GTC%2520Utility%22,4%5D,%5B9,910,385,0.16,%22total%2520network%2520utility%22,3%5D%5D,%5B%5B6,6,152,1,74%5D,%5B9,6,-32,1,0%5D,%5B6,9,-87,1,0%5D,%5B6,8,-23,1,0%5D,%5B8,6,-34,1,0%5D,%5B9,9,173,1,73%5D%5D,%5B%5B484,289,%22Simplified%2520SuperCircuit%22%5D%5D,14%5D",
                        "https://gov.gitcoin.co/t/decentralizing-gitcoin-holdings-work-within-gitcoindao/11069/8",
                        "https://gov.gitcoin.co/t/discussion-what-is-the-purpose-of-gtc/11462",
                        "https://gov.gitcoin.co/t/s15-proposal-integrated-moonshot-collective-budget-request/11214/18"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.108042515317106
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#2",
                    "likes": "3",
                    "time": "11/07/2022-20:17:55",
                    "content": "I appreciate this breakdown Kevin.  It is easy to follow. We’ve been kicking around the GTC-utility idea for a while in the FDD.  I like to think utility-concerns are appropriate to anyone interested in survival and health of the Dao…or basically every Dao member. Gitcoin already has a grant ‘Flagging’ system by which any member-of-the-public can dispute a grant in the Gitcoin system.  In GR14 we saw increased use of the Flagging system for posting personal conflicts.  Somebody alleged plagiarism and someone else alleged financial fraud in GR14, which are examples of types of personal conflict that can be hard to manage through the Flagging system. There is no disincentive to prevent malicious use of the flagging system. There is no incentive to properly use the system beyond personal ethics and diverting funds from possible bad actors (which might change quadratic matching amounts). I think this Flagging system can be modified into a simple circuit as you describe, plus increase Dao-efficiency by reducing spam flags.  There are really just 2 additional mechanisms needed:  Gitcoin Dao require a small GTC deposit by a person to flag a grant. Flags that are found to be valid upon FDD assessment shall cause the deposit to get returned to sender (+ 1 GTC or a poap/passport stamp for incentive).  Invalid flags cause GTC deposit to get added to matching pool.  This would have the additional benefit of decreasing centralization-debt with regard to crowd-sourcing the anti-sybil hunt as we saw some other ecosystems experiment with recently.  I suggest this might be one of the low-hanging-fruits Gitcoin can use without needing to start from a blank slate.  I am unsure how Grants2.0 will affect the Flagging system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.951754385964912
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/07/2022-20:30:41",
                    "content": "    David_Dyor:   Gitcoin Dao require a small GTC deposit by a person to flag a grant.    yeah this could be powerful. i could also see a circuit in grants 2.0 whereby someone must do a small GTC stake in order to get their grant into the review queue.  that GTC collateral would be burned if the grant owner is cheating or in violation of the rules in some way ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/GTChase",
                    "index": "#4",
                    "likes": "1",
                    "time": "12/07/2022-13:07:53",
                    "content": "This is such an awesome walk through of GTC utility, especially for someone like me who needs it broken down. This is one of the main reasons that im super bullish on the work that Moonshot is doing for staking GTC on ones Passport! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.734126984126984
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ZER8",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/07/2022-16:54:04",
                    "content": "Hello @David_Dyor and thank you @owocki for this post and ideas presented, I also read it and since then I’m ideating how to stake/bet GTC on a grants outcome…still plotting on that. The reason I jumped in here is to inform you that if we require a small GTC deposit to flag a grant we could actually loose valuable insights/info because of this. I don’t think we should place a barrier for people that want to help us. BUT, maybe we switch that to if you flag a grant and you are right you could get a X return on the GTC you deposited.(5-20 GTC cap or more or with a different mechanism)   This could have vulnerabilities and could be gamed, but if designed correctly we could at least avoid some issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.132326007326007
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#6",
                    "likes": "1",
                    "time": "13/07/2022-16:27:24",
                    "content": "    ZER8:  if we require a small GTC deposit to flag a grant we could actually loose valuable insights/info because of this.   Great point Zer8.  I sense community interest in moving into a creative supportive direction versus a prohibitive policing direction.  Your suggestion completely aligns with this.  We need to ensure that whatever circuits are used in GTC-utility do not compromise on our regen solarpunk ethos. Legitimate grant projects should have no hesitation to stake serious collateral as they should have full confidence in getting approved.  This might even provide new metrics which can help defend GC or determine optimal capital allocation.  Ofc it could be gamed like anything. We could even prioritize grant-reviews in descending order of collateral staked, so that those weak projects without confidence don’t consume valuable dao resources until we’ve served the probable-legit-grants first.  Just thinking out loud. The system is not perfect and sometimes exploitive grants get approved and legit grants get denied.  For whatever reason.  If we start slashing stakes we may find ourselves in litigation.  It is less likely a denied Grantee will sue if they didn’t lose anything.  Surely there is a workaround… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.479512674825174
                }
            ]
        }
    ],
    "group_index": "155"
}