{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/meeting-hygiene-suggestions/8413",
            "title": "'Meeting Hygiene' suggestions ",
            "index": 8413,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#1",
                    "likes": "12",
                    "time": "27/08/2021-16:59:36",
                    "content": "After attending some calls I came up with some humble and very basic suggestions during the weekly Community Improvement Call, w/ a.o. @linht.tran @Fred @ceresstation,  to improve the efficiency of both recurring & ad-hoc calls. Sharing these here to get some input before we possibly turn these into guidance that we would share with all workstream leads. All thoughts/comments hugely appreciated.    BEFORE  Have an agenda before the meeting and share in the appropriate discord channel, preferably 30’ before call Do not share editable Notion notes if possible but ‘comment only’ to avoid accidents    DURING  Assign a note taker at the start of the call, can rotate but not necessary RESPECT timing  Schedule longer if needed. Leave room for dialogue and do not go overtime. Migrate notes to Notion nested under Gitcoin DAO notion, ask access via Fred/Joe - great org work by MMM there! One platform for calls?  Ideal would be Jitsi (open source but not stable enough for larger groups. Own server worth it?) 2nd option: Zoom. (group acct available for recordings?) 3rd Google (=no recording/streaming)   Start recording all meetings  Assign one person to upload all to YT? (Jitsi works with streaming key = way easier)      AFTER  Add YouTube link in meeting notes Note taker shares meeting notes after the event in the chat    ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-9/8422"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.973684210526315
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#2",
                    "likes": "5",
                    "time": "30/08/2021-18:26:25",
                    "content": "Suggestion by @Fred: \"I think it would be valuable if we proposed every note taker to also provide a 2-5 sentence TL;DR at the very top of their notes. Some meeting notes, for example the bookclub ones, can get pretty heavy. Having a quick recap could be valuable. \" ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/09/2021-20:49:24",
                    "content": "I support almost all of this. Only worry is if Jitsi is worth the hassle if we will have crashes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/09/2021-22:24:56",
                    "content": "Supported by me but also suggest adding a cut-off for attendance.  Like if you haven’t joined by halfway time of meeting don’t bother joining at all. Very late arrivals are disruptive and unproductive.  Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.525
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/anneconnelly",
                    "index": "#5",
                    "likes": "2",
                    "time": "30/09/2021-02:05:03",
                    "content": "I disagree on this. People have other responsibilities and sometimes they take priority over Gitcoin meetings. We need to give people flexibility to join for as much as they can. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/dereksilva",
                    "index": "#6",
                    "likes": "1",
                    "time": "30/09/2021-17:10:22",
                    "content": "Given my needs with my firm, I could probably justify hosting a Jitsi server for myself and others to use. We can discuss ensuring all Gitcoin’s needs are serviced if you’re interested in this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#7",
                    "likes": "0",
                    "time": "05/10/2021-18:27:53",
                    "content": "hmmm.  Yes I get this.  Maybe I can revise my statement in a way that meets both goals. I support the meeting-hygiene ideas but add 1 small request, which is kinda common sense: If someone arrive late to a meeting, please do your best to enter or exit the meeting silently (check audio settings) and do not ask the facilitator to repeat all the information you missed.  This is imo disrespectful to the rest of the participants & host. It is possible to get caught up on the notes or agenda without disturbing the meeting flow. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#8",
                    "likes": "0",
                    "time": "06/10/2021-11:40:57",
                    "content": "Hey Derek, would be awesome if you could make this happen! I’m sure we can justify paying for any hosting costs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/dereksilva",
                    "index": "#9",
                    "likes": "0",
                    "time": "08/10/2021-18:25:53",
                    "content": "Working on it this afternoon. One less reason to rely on Zoom.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                }
            ]
        }
    ],
    "group_index": "560"
}