{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/breakdown-of-round-manager-personas-for-the-protocol/11775",
            "title": "Breakdown of Round Manager Personas for the Protocol ",
            "index": 11775,
            "category": [
                "\\xf0\\x9f\\x8c\\xb1 Grants"
            ],
            "tags": [
                "operations",
                "personas",
                "Grants2",
                "community",
                "protocol-launch"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#1",
                    "likes": "7",
                    "time": "28/10/2022-12:40:13",
                    "content": "Our current planning initiatives are trending toward lumping three distinct personas into one. We are currently using the term “Round Owner” or “Round Manager” as our catch-all bucket for personas that interact with a matching pool and/or the round manager interface. This post is intended to spark conversation around the clearly different interest & incentives for each persona in the Round Manager value chain.  This is an initial attempt at breaking down these personas. Use this link to zoom in  1600×1308 345 KB  Here is the Miro link (edit - Gitcoin team & comment - everyone else) The protocol will incentivize “Round Operators” to solicit “Ecosystem Owners” who in turn have obligations to the provider of the matching pool funds.  Things we can say about Ecosystem Owners  They are interested in building the community round over round Finding funding is their primary objective to exist They may work for a Lead Match Pool Funder Are likely very motivated by the CAUSE or ECOSYSTEM they support May have to act as the round operator until their ecosystem is large enough   Things we can say about Round Operators  Their primary focus is executing flawless end to end operations during a round They are not concerned with finding matching pool funders Many ecosystems will hire Gitcoin to operate their rounds   Conclusion It would be great to have the conversation continue here and in the Miro! ",
                    "links": [
                        "https://miro.com/app/board/uXjVPJc88tc=/?share_link_id=755374366478",
                        "https://miro.com/app/board/uXjVPJc88tc=/?share_link_id=755374366478",
                        "https://gov.gitcoin.co/t/gitcoin-digest-40-s16-budget-requests-everscale-hackathon-and-the-fantom-alpha-round/11836"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.390505584950029
                }
            ]
        }
    ],
    "group_index": "227"
}