{
    "poll_list": [
        {
            "id": "QmZTskr6yb4tSF7Jnnvd5a2YsuJJBDveEv4hbK6QJM83SB",
            "title": "GR10 Matching Pool: Use Gitcoin to build GitcoinDAO",
            "discussion": "",
            "body": "This proposal seeks to add a $50k DAI “side round” to Gitcoin Grants Round 10 (with funds outside of the current matching pool) in support of those who are building components, prototypes, products, and tools for GitcoinDAO.\n\nProposal & Stake - $50k in funds for the DAO, from Gitcoin Holdings Inc., pledged towards this matching round, to build GitcoinDAO.\n\nDeliberation - Through discussion on this proposal and a Snapshot vote, the stewards will ratify the creation of a $50k side-round for GR10 that creates a matching pool for anyone working on the DAO.\n\nImplementation - The community will be invited to post Grants for their GitcoinDAO related work. The $50k from Gitcoin Holdings will be sent to the multisig. The round will be run, and paid out as per normal.\n\nRead more here: https://gov.gitcoin.co/t/proposal-gr10-matching-pool-use-gitcoin-to-build-gitcoindao/6372",
            "choices": [
                "Yes $50k to fund GTCDAO building",
                "No, no soup for you"
            ],
            "scores": [
                2025468.7755964135,
                143.98494500585852
            ],
            "start": 1623790800,
            "end": 1623938400,
            "snapshot": "12641178",
            "state": "closed",
            "author": "0x34aA3F359A9D614239015126635CE7732c18fDF3",
            "space": {
                "id": "gitcoindao.eth",
                "name": "Gitcoin"
            }
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/proposal-gr10-matching-pool-use-gitcoin-to-build-gitcoindao/6372",
            "title": "[Proposal] GR10 Matching Pool: Use Gitcoin to build GitcoinDAO ",
            "index": 6372,
            "category": [
                "\\xf0\\x9f\\x93\\x9c Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/austingriffith",
                    "index": "#1",
                    "likes": "59",
                    "time": "14/06/2021-21:32:52",
                    "content": " Summary Gitcoin building GitcoinDAO is likely the highest leverage work we can do as a community. Dogfooding further reinforces our understanding of the value quadratic funding provides, while offering a case study for other ecosystems who might want to leverage it in the future. This proposal seeks to add a $50k DAI “side round” to Gitcoin Grants Round 10 (with funds outside of the current matching pool) in support of those who are building components, prototypes, products, and tools for GitcoinDAO.   Abstract We have found Gitcoin Grants to be a highly effective way to build & fund an ecosystem. With the launch of GitcoinDAO, we now have an ecosystem to build ourselves, and the core Gitcoin team can’t do it alone. We want to dogfood quadratic funding for our ecosystem! Let’s put A&B together and run a $50k side round to build & fund the Gitcoin ecosystem using Gitcoin Grants. We propose we create a $50k round that is designed around the community working towards building GitcoinDAO. The main criteria for this round is that you’re actively doing work that accelerates GitcoinDAO or Gitcoin’s mission towards funding digital public goods. This can be anything, but we are especially interested in:  anything involved in the DAO workstreams a. governance for the public good b. prototypes for the public good c. decentralization of Gitcoin itself d. anti-fraud communication - creating content or memes for the public good in general - anyone who is advancing GitcoinDAO’s goals/mission through their actions.  A good example might be, “Who is building an app that allows me to poll/chat with my GTC delegates?” …We need this, and so many more tools and products!  Motivation Quadratic Funding is a great way for the community to self organize and fund the work that it values the most. Dogfooding Gitcoin to build GitcoinDAO:  allows those who are working on the DAO to build empathy for end-users (grant owners, customers) by becoming an end-user themselves. rewards those who are spending their time & energy on our mission, thus making it more likely that they will continue to spend time/energy here. creates a positive feedback loop between the community + DAO stewards. offers transparency in how initiatives are being funded and developing. hopefully creates really great product UX the entire ecosystem can use!   Specification We see this proposal going through 3 steps:  Proposal & Stake - $50k in funds for the DAO, from Gitcoin Holdings Inc., has been pledged towards this matching round, to build GitcoinDAO. Deliberation - Through discussion on this proposal and a Snapshot vote, the stewards will ratify the creation of a $50k side-round for GR10 that creates a matching pool for anyone working on the DAO. Implementation - The community will be invited to post Grants for their GitcoinDAO related work. The $50k from Gitcoin Holdings will be sent to the multisig. The round will be run, and paid out as per normal.   Vote Once we have gathered feedback on this proposal, we will submit a Snapshot vote. ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-dao-week-in-governance-edition-1/7424",
                        "https://gov.gitcoin.co/t/gitcoin-building-gitcoin-round-now-open-for-gr10/6873",
                        "https://gov.gitcoin.co/t/public-goods-funding-workstream-budget-request/7993"
                    ],
                    "GPT-summary": "The proposal suggests adding a $50k DAI “side round” to Gitcoin Grants Round 10 to support those who are building components, prototypes, products, and tools for GitcoinDAO. The proposal aims to use quadratic funding to build and fund the Gitcoin ecosystem and create a positive feedback loop between the community and DAO stewards. The proposal will go through three steps: Proposal & Stake, Deliberation, and Implementation. Feedback will be gathered, and a Snapshot vote will be submitted.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.793976348854397
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ceresstation",
                    "index": "#2",
                    "likes": "5",
                    "time": "15/06/2021-13:21:08",
                    "content": "Love this idea @austingriffith, are there already some projects in the prototyping workstream you have in mind that would be a fit here? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#3",
                    "likes": "5",
                    "time": "15/06/2021-14:53:37",
                    "content": "Into it and in full support! I feel it will also promote engagement further than the top stewards and encourage broader participation  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/pleaner",
                    "index": "#4",
                    "likes": "9",
                    "time": "15/06/2021-15:18:29",
                    "content": "May we create associated Gitcoin Bounties for these tasks with the Dogfood label. This will allow us to create a reasonable set of acceptance criteria, should be loose and board to prevent suppressing of community creativity, like:  Stewarts can communicate with delegates. Stewards can see aggregated sentiment feedback from delegates.  Every version I think of in my own head turns into lobbyist politicking. Idea: teams are made up of Designer, Frontend, Smart Contract, Domain Expert and Cloud Engineer roles (not exhaustive). What if the UI allowed participants to select their roles and then get auto grouped into a complete team with equal bounty shares? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.864468864468865
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/linda",
                    "index": "#5",
                    "likes": "2",
                    "time": "15/06/2021-16:44:52",
                    "content": "I love this idea and 100% support it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/sandrogomes94",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/06/2021-17:48:23",
                    "content": "This is really a awesome idea! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Rocco",
                    "index": "#7",
                    "likes": "2",
                    "time": "15/06/2021-18:35:41",
                    "content": "This is a fantastic idea. Would love to keep pushing on the anti-fraud work stream especially as it relates to both grants rounds and grant recipients. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/martz",
                    "index": "#8",
                    "likes": "2",
                    "time": "15/06/2021-19:46:10",
                    "content": "this is the way agree with @Pop - this will be an amazing way to involve the larger community  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/walidmujahid",
                    "index": "#9",
                    "likes": "0",
                    "time": "15/06/2021-21:35:54",
                    "content": "    austingriffith:  Once we have gathered feedback on this proposal, we will submit   I love this idea. I support this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/STYJ",
                    "index": "#11",
                    "likes": "0",
                    "time": "16/06/2021-02:17:06",
                    "content": "I really like this suggestion and it’s always good to have more structure. In the event there are multiple teams working on a similar idea, how would the payouts work? Do all teams get funded or only the best? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.714285714285715
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/fu58889",
                    "index": "#12",
                    "likes": "1",
                    "time": "16/06/2021-06:22:30",
                    "content": "我真的很喜欢这个建议，有更多的结构总是好的。如果有多个团队在研究类似的想法，支出将如何运作？是所有团队都得到资助还是只有最好的？ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Skyfly201",
                    "index": "#13",
                    "likes": "0",
                    "time": "16/06/2021-08:22:30",
                    "content": "This is interesting love the idea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/PersonChile",
                    "index": "#14",
                    "likes": "1",
                    "time": "16/06/2021-16:46:15",
                    "content": "Buena Idea, se podria aplicar un consumo responsable para que toda la comunidad cree una economia sana                                                                                           - ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party giving feedback on proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DMats",
                    "index": "#15",
                    "likes": "0",
                    "time": "16/06/2021-16:59:18",
                    "content": "If the GitcoinDAO implemented quadratic voting for governance, would sybil resistance mechanisms fall under the dogfood category? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/raullen",
                    "index": "#16",
                    "likes": "0",
                    "time": "16/06/2021-20:52:09",
                    "content": "How many projects are aimed to be supported by this 50K fund? If so, how to split the fund among multiple projects? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/pleaner",
                    "index": "#18",
                    "likes": "2",
                    "time": "17/06/2021-06:44:19",
                    "content": "@STYJ Hey Simon, I would suggest Quadratic Funding, the community can vote (fund) on the teams proposal they choose with pooled funding matched through the QF algo. Challenge is building things and communicating things are two separate skills. Its easy to end up rewarding effective communicators more than effective builders. Its our responsibility (the funders) to look passed the comms to the quality. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.633333333333333
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/BTCCEO2",
                    "index": "#19",
                    "likes": "1",
                    "time": "18/06/2021-00:01:55",
                    "content": "Excellent, looking forward to the project can have more as, take us to success! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/hunch222",
                    "index": "#20",
                    "likes": "0",
                    "time": "18/06/2021-02:29:36",
                    "content": "Will there be induced cheating within the project? This is an issue that needs to be considered. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#21",
                    "likes": "9",
                    "time": "18/06/2021-19:32:54",
                    "content": "Heads up - This proposal passed + you can now create a “Building Gitcoin Grant” at https://gitcoin.co/grants/new for GR10  Screen Shot 2021-06-18 at 1.31.55 PM1394×610 23.9 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/stevegachau",
                    "index": "#22",
                    "likes": "3",
                    "time": "21/06/2021-09:36:49",
                    "content": "@owocki Done. Have been waiting for approval for a couple of days. 💰 Grant Monitor - Mobile Alerts for Grant Contributions | Grants | Gitcoin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ENZO29126812",
                    "index": "#23",
                    "likes": "1",
                    "time": "25/06/2021-12:11:30",
                    "content": "Hope to be able to participate in it, and willing to make their own efforts ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Luvlynj",
                    "index": "#24",
                    "likes": "3",
                    "time": "25/06/2021-15:41:59",
                    "content": "This is a welcoming idea, I love the fact that its all for the growth of gitcoin community and its ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/yanghelong",
                    "index": "#25",
                    "likes": "3",
                    "time": "26/06/2021-12:29:42",
                    "content": "This is really a good idea，It’s funny i like this idea very much ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.016666666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/zyks678",
                    "index": "#29",
                    "likes": "0",
                    "time": "01/07/2021-01:52:04",
                    "content": "This is a great idea and I hope it can be implemented as soon as possible. Although this process will take time, I am looking forward to it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/252228767",
                    "index": "#30",
                    "likes": "1",
                    "time": "01/07/2021-02:07:05",
                    "content": "提案已经通过了，非常感谢，感谢         ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/lin123210",
                    "index": "#32",
                    "likes": "2",
                    "time": "22/07/2021-03:59:09",
                    "content": "If the GitcoinDAO implemented quadratic voting for governance, would sybil resistance mechanisms fall under the dogfood category? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "476"
}