{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gtc-financial-model/12574",
            "title": "GTC Financial Model ",
            "index": 12574,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/picciobellina335",
                    "index": "#1",
                    "likes": "2",
                    "time": "16/01/2023-04:13:41",
                    "content": "(DISCLAIMER: This is not financial advise.  Do your own research.  Talk to an accountant.  This post and the document linked from it are provided for informational purposes only.) There isn’t a financial model for Gitcoin publicly available on the forum, so I have been working with @a33titude on one in order to understand the potential value of Gitcoin’s economies. In this document, we took the most plausible revenue models for GTC Utility and built a spreadsheet around how growth of those revenue models could happen. We had to make some educated guesses about what growth could look like in order to build the model.  Here is a key (rows in blue were just total guesses):  There are about 8 tabs in the spreadsheet.  The most interesting ones are the revenue ones, which model what the various business models of Gitcoin could look like as it matures.  tabs866×560 88.9 KB  Get the model here.   We would love to see other people fork the model and present their own view of Gitcoin back to us. Some things we learned by playing with this model.  1. Mutual Grants & Protocol Fees could all be lucrative over the long term.  But they will take years to grow. Here is a view on what these economies could look like if their growth compounds.  growthovertime1904×590 74.4 KB   2. GTC is vulnerable to running out of stables in treasury. Here is what the treasury value in stables looks like if stablecoin costs stay low relative to revenue (left) vs if they do not.  base948×576 29.7 KB   toomuchspend948×606 31.6 KB  Because revenue will take years to develop, Gitcoin needs to find a way to pay it’s bills that isn’t stablecoin outflows until it’s business models take off. Of course Gitcoin currently pays most of it’s bills in GTC.  It’s not clear how long that will last, but it seems to be working for now.  This model makes no attempt to model GTC outflows, (1) because thats really hard to model given how volatile GTC is and (2) a sustainable Gitcoin would be cash flow positive and not overly dependent on GTC.  3. A rising tide lifts all boats. One nice attribute that Gitcoin has is that it’s based around the Ethereum economy, which is growing quite rapidly.  This rising tide lifts all boats, though we can’t say how much.  The first cut of this model is in USD, but we are considering doing an Ether denominated one. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1l35c-yCG-_kxOFZIz-S85mboelqrO_YBV1jrQ-NRVG8/edit",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/1/1ad8ffd78dae44a0b663cfecc86fc807bbc5c00d.png",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/9/99af97f59fc4187a28389e835c081f513ab85bf6.png",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/d/d0bbe4e670b7082f1bda845fa0bb35efc8c82854.png",
                        "https://gov.gitcoin.co/t/a-bull-bear-case-for-gitcoin-gtc-in-2023/12442/25",
                        "https://gov.gitcoin.co/t/an-interactive-model-for-gitcoin-revenue-growth-forecasting/12625"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.707442067736186
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kevin.olsen",
                    "index": "#2",
                    "likes": "1",
                    "time": "17/01/2023-10:52:41",
                    "content": "Thanks for posting and getting this first draft of a model documented and shared out. On the Mutual Grants, can you say more about how you set up some of the assumptions for future value there? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#3",
                    "likes": "4",
                    "time": "18/01/2023-02:09:26",
                    "content": "    kevin.olsen:  On the Mutual Grants, can you say more about how you set up some of the assumptions for future value there?   Per the model, the hypothesis behind the Mutual Grants tab is  Currently called “Mutual Grants”. This is the idea that Gitcoin is a source of alpha for the space + would do a token swap with up & coming projects on the platform. The strategy would be to do investments in alumni, put their tokens in treasury, and to catch the next Uniswap that comes into the platform.  The main insight that powers this hypothesis is that Gitcoin is a source of signal for what projects are up and coming in the space.   The ETH ecosystem has MEV.  The GTC ecosystem has DEV (data extractable value).  77uc81800×450 67.6 KB  To explore the power of this opportunity, let me illustrate a counterfactual history of Gitcoin wherein Gitcoin had taken 1% of Uniswaps token supply back when it was a Gitcoin Grant. In this counterfactual, UNI is as valuable as it is today - the fully diluted network value of UNI is $6,385,373,549 as of today.  In this scenario Gitcoin’s stake of Uniswap is worth $63,853,735.49. In this scenario, Gitcoin has no worries about it’s cash position or size of it’s burn because it’s got a highly liquid very valuable asset that it got on its “Balance Sheet” early before anyone else saw the value of UNI. Lets dive deeper into this counterfactual scenario.  In this counterfactual scenario, in their infinite wisdom and foresight, Gitcoin’s team also took 1% positions in Yearn, 1Inch Exchange, Rotki, WalletConnect, and others.    That counterfactual Gitcoin has $100 million in liquid assets to invest into Grants Stack.  winning1446×1000 68.6 KB   UX The UX of implementing a feature like this feels pretty simple for me.  Rounds run as per normal. After the round, the Round Manager sends an email to a subset of grants on the platform (curated by the round manager). The email looks EXACTLY like this TO THE PIXEL:   download-2500×654 85 KB   The User submits information about their business plan and takes a short 30 minute call with the round manager. The offer amount can be negotiated in a token swapping app.  If both sides accept the offer, a token swap is facilitated. Repeat until deal is closed (or abandoned). Over time Gitcoin gets access to the Data Extractable Value (DEV) in it’s ecosystem. If it gets really sophisticated,  Gitcoin can charge large VCs for the DEV coming out of Gitcoin. Gitcoin can share this data with its ecosystem building partners (like Fantom or Uniswap).     Model OK now to answer your question about the model @kevin.olsen . As the trope goes “all models are wrong, some are useful”.  The model is 99.99% likelihood wrong about the upside of mutual grants.  How wrong? IDK.  What does the next Uniswap look like?  IDK.  But I do know that whoever those founders are, it is will likely get $$$ from Gitcoin (bc Gitcoin Grants & QF = a source of data signal about whats hot in the ecosystem). The model assumes that Gitcoin will offer standard deal teams  1k GTC / deal (column H) in exchange for 1% of future tokens (column I)  But it could easily support variable deal terms (eg the standard offer is just “double your match payout for 1% tokens”, and Gitcoin puts a blended deal into its financial model in column I/H).  Portfolio Number Go Up   Over time Gitcoin will hold  Column F Num Grants Invested In Yearly Column G Cumulative Grants Invested Column K Total GTC Investment Yearly Column L Cumulative GTC Investment   So how do you value that portfolio? If we assume that  Average Project Value at Investment Time (column L) then we have Total Ecosystem Value of Alumni  (column N) and Total Portfolio Value (column O)  Of course the giant elephant in this room is “How much is this token worth?”  There is NO way to know which token will be the next UNI, YFI, etc… So the solution is to take many bets.  If we assume  45% Average Project Value Growth YoY (column M) place many bets  then we will see Total Portfolio Value (column O) grow by about 45% per year. Of course most projects will grow 0%, some projects will grow 30%, but maybe 10% will grow 400% and bring the average up for everyone.  Execution I think the most important thing if Gitcoin does this it  preserves its capital makes many small bets earlier than anyone else can over time tries to get better and finding signals that a project is about to ramp it’s network  The key thing that would excite me as a GTC part time fanboy/part time critic is to build a market intelligence engine that can invest in projects BEFORE anyone else knows about them.  (Market Intelligence Engine = a combo of tech, product, marketing, data, operations, etc)  vc model1172×818 42.5 KB  Let me know if any questions. ",
                    "links": [
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/f/f06227b188a39945bcece1787bf5560a93532450.jpeg",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/9/921d4acdc0802f0d6fda773cea85058cb8172cf7.jpeg",
                        "https://gov.gitcoin.co/uploads/db4391/original/2X/d/d3edc16fa4316742ccd66701b8067ee4b2785195.jpeg",
                        "https://gov.gitcoin.co/t/gtc-tam-sam-som-analysis/12603"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.387651331719129
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/epowell101",
                    "index": "#4",
                    "likes": "0",
                    "time": "20/01/2023-19:29:59",
                    "content": "Just catching up on this.  Really excited to see the model & the meme slinging in one post. Seriously inspirational and thoughtful work IMO. Quick note - there is also a mechanism that Gitcoin has looked at called aqueduct which could also give Gitcoin exposure to the upside of projects.  If you have time, it would be interesting to hear what you thought about that as an alternative approach to the token swap. Tally example Secondly - as you know Gitcoin is in the process of launching protocols and a Grants Stack so that all communities could fund their shared needs more easily - without permission from Gitcoin.  The addition of this approach is perhaps “just a detail” in your model however I wanted to mention these ongoing discussions about how / whether to capture value such as revenues from that shift in model.  IMO this might shift the curve left somewhat - potentially - as round operators like Unicef succeed and increasingly learn to run their own rounds.  What do you think? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.55448717948718
                }
            ]
        }
    ],
    "group_index": "297"
}