{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/gitcoin-ethereum-and-the-growth-of-web3-and-open-source/9563",
            "title": "Gitcoin, Ethereum, and the Growth of Web3 and Open Source ",
            "index": 9563,
            "category": [
                "\\xf0\\x9f\\x91\\x8b News and Community"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/shr1ftyy",
                    "index": "#1",
                    "likes": "2",
                    "time": "30/12/2021-12:50:15",
                    "content": " Gitcoin, Ethereum, and the Growth of Web3 and Open Source  Introduction Ever since the inception of Gitcoin, the amount of attention to the site itself, along with the web3 ecosystem as a whole has continued to garner increased widespread attention and funding for the grants of which the site contains. This report seeks to analyse relevant data points with the goal of finding possible causations behind the drastic increase in funding that web3 grants have received on Gitcoin, and do so in a succinct manner.  Funding and Attention Firstly, this report would not have an effective dataset to base its analysis on without its most important one, of which is shown below.  grants_amount_contrib1872×1442 122 KB  Figure 1 - Overview of contributors, and total matched funding provided to grants overtime in each grants round (categorised by start dates) (1-12). From the graph above, it is obvious that the amount of attention and total matched funding that Gitcoin grants have received have increased over time. To find possible causations for this, a few other key datasets were gathered. These included search interests from Google Trends with regards to topics such as ‘gitcoin’ and ‘web3’, along with the daily close price of ETH-USD. They were collated into the excel graph seen below.  image2730×1078 215 KB  Figure 2 - ETH price movements alongside Gitcoin Grant matching amounts and public interest in Gitcoin and web3. A trend that is highly apparent in the data above, is the fact that the interest for web3 has increased over time, and is also highly correlative to the market price of ETH tokens. One can reasonably assume from such a trend, that the increased interest in the Ethereum this year due to its native token’s drastic upward price movements (and the crypto market as a whole) and adoption has also been transferred over to the its vast ecosystem of Web3 projects. The total number of contributors, along with matched funding for grants in Gitcoin also follow the same trend. It is also notable to mention that, prior GR10, there was a sudden spike in interest for the platform, which may have directly contributed to the continued increase in matched funding for grants.  image836×486 12.9 KB  Figure 3 - Unique Ethereum Addresses over time, showcases the rapid adoption rate of Ethereum.  (Source: Ethereum Unique Addresses Chart | Etherscan)  Conclusion - Key Takeaways  The attention Gitcoin, and the web3 projects which are present on the platform are receiving is increasing over time. As a result, so is the total amount of contributors and matched funding to said projects. The bullish state which the crypto market has retained in the past year has caused helped with the adoption rate of Ethereum increase, and as a result also helped garner more attention for web3 projects, and platforms such as Gitcoin and the grants present on the platform.  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.301111111111111
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/03/2022-19:59:54",
                    "content": "Thank you for providing this thoughtful analysis.  It appears we will get to see the effects of a bearish market state during GR13. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                }
            ]
        }
    ],
    "group_index": "645"
}