{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/csdo-charter-v1/12490",
            "title": "CSDO Charter V1 ",
            "index": 12490,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "contributors",
                "governance",
                "CSDO",
                "strategy"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#1",
                    "likes": "4",
                    "time": "04/01/2023-17:23:51",
                    "content": "A question often asked outside and within our DAO is: ‘What is CSDO and what does it do?’ This question also regularly came up during CSDO worksessions, meaning we ourselves were struggling with this, so we decided it was time to ratify some clear definitions. Below you can find our charter, our operating rhytm and our membership definition. The below is a co-created document, and can be considered as an initial version (v1). As everything in our DAO, we fully intend for this document to evolve in the future, and are looking forward to feedback and suggestions from the community. The CSDO Charter is an agreement and a commitment between the workstreams as to how we work together. It ensures alignment and an agreement on what CSDO is, to emphasize our shared ownership and need for time allocation, and decide on a rhythm and content for strategic calls. Note: the CSDO charter (1) should suffice to give you a good overview on how we operate, the operating rhythm (2) and member charter (3) we included mostly for transparency and completeness. Big thank you to @samspurlin from The Ready for sharing the below templates, and strategic input on how to adapt these to fit the unique context of our DAO. Thank you to all CSDO members on their deep support in cocreating this living document.  1. CSDO Charter  Purpose Why does CSDO exist? What is it here to do? CSDO cultivates coherence. CSDO provides the space and conditions for higher-stake cross-workstream decisions to be vetted and discussed, to enable our DAO to efficiently and responsibly fulfill its purpose.  Principles What beliefs inform how we operate?  We align all we do with our purpose and essential intents  We co-own the strategic direction of our DAO We believe in workstream autonomy and sovereignty as our default decision making model without explicit consent. We respect each other’s limited time, and cover only topics that impact a majority of the DAO and need a synchronous check-in We know our peers are highly skilled and value aligned, there is shared trust We make our work highly transparent, visible, and legible to all DAO contributors We recognize our responsibility to patiently lead in the direction of decentralization, one of our core values We are smarter together and all need constructive feedback We believe in and make space for thoughtful experimentation We think outcome-oriented at all times   Responsibilities What ongoing work is this team responsible for?  Creating venues for sensemaking and strategic direction Helping workstreams align their work (eg. budgets and objectives). Acting as decision-making body for topics that don’t live within individual workstreams (e.g., audits, essential intents, GTC utility, business model, sustainability, gtc utility, team values). Creating conditions for documenting & evolving Gitcoin’s OS (eg deepdive workshops) Holding ourselves and the wider DAO accountable (e.g., peer & steward feedback) Representing the interests of our DAO with the Stewards and at the Steward council   Decision Rights What concentrated authority does CSDO hold?  How our Purpose is translated into Essential Intents & strategic outcomes DAO-wide governing agreements (except what’s passed to Snapshot vote) How CSDO works and decides, who its members are   Working agreements How will we use tools, communicate, meet, and manage workflow together?  Gathering: Jitsi, for easy streaming Transparency: Via notes, decisions here, calls recorded here, a weekly summary is shared on discord with DAO Core, a monthly recap is shared on Discourse  Facilitation: We follow an adapted version of the action meeting process for our Ops Calls, facilitation alternates as indicated here, more below for sensemaking calls. Efficiency: Every agenda topic should always have a desired outcome stated, and next steps should be logged Accountability: Action items will be logged in the action item database and reviewed at the start of csdo ops meeting Time Commitment: We commit 2-4 hours to CSDO each week for async reviewing and attending the CSDO Ops and sense making calls. This means a minimum of +/- 9 hrs/month, but this can easily increase to 17 hrs/month or more, depending on extra calls, ad-hoc task forces and pod work.   Evaluation Criteria How do we evaluate whether or not CSDO is functioning well?  Workstream Leads subjective feedback (scoring, peer reviews). Whether topics that require cross-stream buy-in, advice, coordination or consent move forward. Whether key decisions are being made. Steward Council feedback.    2. CSDO Operating Rhythm ‘CSDO’ could be seen as any meeting that enables cross-workstream decision making. However, in our definitions below we focus on our key touchpoints*: the tactical CSDO ops calls, the #csdo-ops channel, and our ad-hoc/bi-weekly strategy worksessions. *Other touchpoints are the weekly pods update call, ad-hoc calls between workstreams, discussion threads in #csdo-strategy, and the various pods.  CSDO Ops call Purpose:  Primary: To unblock whatever is blocked. Members bring topics that require cross-stream buy-in, advice, coordination or consent. Secondary: To hold ourselves accountable. Are we actually making progress on what matters?  Attendees: CSDO members (2 representatives from each workstream, see more under member charter) Facilitator: Rotates between volunteers among the representatives Frequency: Weekly Duration: 60 minutes Format:  Check-in Action Item review Agenda  This meeting is action-oriented, i.e. the proposer states a desired outcome and we drive to next steps. Every agenda topic should be stated in max 2-3 minutes and wrapped up within 15’ max (depending on importance), have a desired outcome stated, a driver and next steps logged, more here  Desired outcome categories: Requests for action, questions, decision, information, announcements, temp check More on agenda building here    Check-out  Output: decisions, action Items & projects, topics for strategy deep dives  #CSDO-ops Channel Purpose: Prepare for and/or follow up on actions brought to the CSDO Call. Participants: CSDO members (2 representatives from each workstream, see more under member charter) Format:   Threads for deep dives and sense making on open topics   Threads to follow up on action items   Threads to pass proposals or get feedback for an irl IDM session   Context sharing of key information CSDO members should not miss   More in the decision making process guide   Output: decisions, action Items & projects, topics for strategy deep dives  CSDO Sensemaking Purpose: To have the time and space to align and decide on topics that are deemed strategically impactful Attendees: CSDO members Facilitator: For a deep dive session (3h) this will be a trained external facilitator (eg. The Ready). For a sensemaking session (1h) or complex proposals which cannot be handled async, this can be the ‘OP’. Frequency:   Placeholder 1h biweekly for IDM & sensemaking   Placeholder 3h monthly for deep dives/blue ocean strategic sensemaking   Ad-hoc during irl events (eg. yearly retreat)   Duration: 60-180 minutes Format:  Topics should be raised at the latest in the preceding Ops call or async linking to a short write up of problem or opportunity discussed. Note: If no topics the call will be cancelled. Format is freefloating on sensemaking or follows the IDM format for complex decisions. For deepdive or blue ocean workshops (3h) the format will be defined by the (external) facilitator. Next steps & owner should be assigned before checkout.  Output: next steps and decisions for strategic DAO OS topics that have a cross-workstream impact, eg. on purpose, strategy, resources, information, …   3. CSDO Member  Responsibilities  Attend and actively participate in every CSDO Ops & Strategy call* Attend and prepare for monthly Steward Sync calls (min. 2/3 per season)* Attend and prepare for fortnightly Steward Council calls and related ad-hoc calls*,** Review proposals and actively comment during the async discussions Follow up on and report back on open action items assigned to members Surface agenda topics which can have a dao-wide impact Provide input on relevant forum discussions Represent the point-of-view and needs of respective workstream Commit the appropriate time to fulfill the above responsibilities (see work agreements)  *If you cannot make it ensure a delegated representative can replace you **If you are the representative of your workstream  Decision rights  How to best represent their workstreams’ point-of-view and needs (whether to bring a topic out of the workstream and into CSDO) See more in team decision rights (CSDO Charter)   Evaluation criteria  Quarterly peer review organized by CSDO, reviewing if responsibilities are actively being fulfilled   Qualifications  Being a Workstream Lead, or being delegated by your workstream lead Strong leadership and strategic skills Broad knowledge and comfort with our DAO OS topics  Being able to dedicate the necessary time   Staffing  2 representatives from each workstream, ideally the workstream lead(s) and/or someone assigned by the workstream lead(s) to represent the workstream  ",
                    "links": [
                        "https://gov.gitcoin.co/t/update-gitcoindaos-adopted-purpose-and-essential-intents/10984",
                        "https://www.notion.so/gitcoin/CSDO-1ab473386f74461c80b9409d0d400f0e#3431b7891a26453fab6adc7ee6e2c5e4",
                        "https://www.notion.so/gitcoin/CSDO-Governance-Proposals-dc117e21ea71400ea448cd9924230a71",
                        "http://youtube.com/@gitcointransparency",
                        "http://gov.gitcoin.co",
                        "https://www.notion.so/gitcoin/CSDO-1ab473386f74461c80b9409d0d400f0e#b1d97f288fcd43dab21b4a66658ec46d",
                        "https://www.notion.so/gitcoin/Pods-957596edb1b94236a3d76c7eae10c17d",
                        "https://www.notion.so/gitcoin/CSDO-1ab473386f74461c80b9409d0d400f0e#b1d97f288fcd43dab21b4a66658ec46d",
                        "https://www.notion.so/gitcoin/CSDO-1ab473386f74461c80b9409d0d400f0e#b1d97f288fcd43dab21b4a66658ec46d",
                        "https://docs.google.com/document/d/1YKEeNdOI7zRjYRNvMt4WOHNh2qx51huY2Zg9Ew4SW_I/edit?usp=sharing",
                        "https://docs.google.com/document/d/1YKEeNdOI7zRjYRNvMt4WOHNh2qx51huY2Zg9Ew4SW_I/edit?usp=sharing",
                        "https://docs.google.com/document/d/1YKEeNdOI7zRjYRNvMt4WOHNh2qx51huY2Zg9Ew4SW_I/edit?usp=sharing",
                        "https://gov.gitcoin.co/t/proposal-v2-of-the-steward-council/11639",
                        "https://miro.com/app/board/uXjVPDpwv9o=/?share_link_id=910533481642",
                        "https://gov.gitcoin.co/t/gitcoin-community-proposal-post-vote-appeal-process-aka-to-reconsider-a-vote/13165/3",
                        "https://gov.gitcoin.co/t/proposal-gitcoin-dao-budgeting-process-redesign/12493",
                        "https://gov.gitcoin.co/t/gitcoin-runway-update/12503",
                        "https://gov.gitcoin.co/t/digest-48-how-do-we-make-gitcoin-sustainable/12498",
                        "https://gov.gitcoin.co/t/s17-proposal-dao-ops-budget-request-integrated/12741",
                        "https://gov.gitcoin.co/t/january-csdo-digest/13040",
                        "https://gov.gitcoin.co/t/february-csdo-digest/13140"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.728468614718615
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#2",
                    "likes": "1",
                    "time": "04/01/2023-23:31:56",
                    "content": "Thank you for the post @krrisis !  This helps me understand how the DAO works.     krrisis:  CSDO Sensemaking   One thing I think might really help with DAO/Community relations is if there were good notes for the CSDO Sensemaking sessions posted publicly.  This would help ppl like me understand the strategic issues confronting the DAO & how they are being handled.  And it supports your purpose of “CSDO cultivates coherence.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#3",
                    "likes": "0",
                    "time": "05/01/2023-13:05:40",
                    "content": "Great to hear this is useful! There are currently no good notes available from previous sessions tbh. We have a number of Miro & mural boards, but no clear notes. If there are notes, these will be linked in the CSDO monthly recap, and recordings will be added to our transparency channel. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.840277777777779
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/a33titude",
                    "index": "#4",
                    "likes": "0",
                    "time": "25/01/2023-16:38:50",
                    "content": "    krrisis:  recordings will be added to our transparency channel .   Are there plans to post the last 2 weeks of CSDO meetings to youtube?  I dont see them. ",
                    "links": [
                        "https://www.youtube.com/playlist?list=PLdGQKwXzBAceH-ewgFy9nRPbjAk_Rj5n7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/shawn16400",
                    "index": "#5",
                    "likes": "0",
                    "time": "25/01/2023-19:52:12",
                    "content": "@a33titude good question… I do not know the answer, but I have been using the notes as a substitute: Jan17 meeting:   Notion    Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. A new tool that blends your everyday work apps into one. It's the all-in-one workspace for you and your team       Jan24 meeting:   Notion    Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. A new tool that blends your everyday work apps into one. It's the all-in-one workspace for you and your team      ",
                    "links": [
                        "https://www.notion.so/gitcoin/CSDO-Cross-Stream-DAO-Ops-66-6b062239b1d14bb4a4c7c157486f2f0d",
                        "https://www.notion.so/gitcoin/CSDO-Cross-Stream-DAO-Ops-67-713182800d734399b5e41dd071c63a1c",
                        "https://www.notion.so/gitcoin/CSDO-Cross-Stream-DAO-Ops-67-713182800d734399b5e41dd071c63a1c",
                        "https://gov.gitcoin.co/t/s17-proposal-draft-dao-ops-budget-request/12741/27"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.572727272727272
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/krrisis",
                    "index": "#6",
                    "likes": "1",
                    "time": "25/01/2023-20:27:27",
                    "content": "We’ve had an issue with the recordings. The one from this past week will go up in a few days (recorded locally). But you can always find the meeting minutes here as Shawn mentioned as well. Happy to see those recordings are useful! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.725
                }
            ]
        }
    ],
    "group_index": "278"
}