{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/contributor-tiers-mmm-trusted-contributor-experiment/10296",
            "title": "Contributor tiers & MMM trusted contributor experiment ",
            "index": 10296,
            "category": [
                "\\xf0\\x9f\\xa7\\x99 \\xf0\\x9f\\xa7\\x99\\xe2\\x80\\x8d\\xe2\\x99\\x80\\xef\\xb8\\x8f Ideas and Open Discussion"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#1",
                    "likes": "8",
                    "time": "02/04/2022-18:42:21",
                    "content": "For Season 14, the MMM workstream plans to experiment with  a three-tier system of contributors: core, trusted, and regular contributors. Based on these tiers, contributors will be eligible for different benefits, roles, and project assignments. They will also be associated with responsibilities - including time commitment, background & identity transparency, project accountability, and objective/key result accountability. This post outlines current thinking on these topics, with the goal to receive feedback from other workstream leads & contributors within GitcoinDAO and in the broader DAO community. After receiving feedback on these ideas/plans, I plan to follow up with a revised approach for Season 14. Core contributors Core contributors are dedicated to GitcoinDAO and the MMM workstream. They are typically (but are not required to be) dedicated to the workstream on a full-time basis. They are compensated using a base “salary” and a token vesting agreement. The base salary of a core contributor is set by the price of labor based on past experience & other qualifications. Core contributors are in almost all circumstances contractors and not “employees” based on traditional legal definitions. This tier is most similar to the traditional FTE (full-time employee) role at technology companies and other similar organizations based on compensation & responsibilities. In order to be eligible to be a core contributor and receive the benefits outlined above, the contributor must disclose their government-based identity to GitcoinDAO. For clarity, this requirement is not taken lightly and is not a desirable end state. However, it is required at this time because we do not yet have a valid substitute authentication method. Question: is there a similar policy or standard for this already established within GitcoinDAO? If so, how does this deviate? Trusted contributors Trusted contributors are a new designation for MMM for Season 14. Trusted contributors are generally not exclusive to GitcoinDAO or to the MMM workstream. They are, however, assigned to one or two substreams within the MMM workstream. They are compensated using two types of compensation: a “basic income” and project-based compensation. Basic income is set at a fixed level for the entire workstream before a season begins. For clarity, there are no adjustments made to “basic income” based on the individual, including role, background, or anything else. It is expected that the majority of a trusted contributor’s compensation comes from their project-based compensation, not from their basic income. While trusted contributors are not required to disclose their government-based identity to GitcoinDAO, this is encouraged, and they are expected to discuss their background, experiences & goals via video conferencing with all core contributors prior to receiving the trusted contributor designation. The maximum number of trusted contributors for a particular season is set prior to the beginning of that season by the workstream lead & core contributors with the goal to designate specific trusted contributors to specific MMM substreams prior to the start of the season. Regular contributors Regular contributors are the most common designation for DAO contributors. There is no expectation of any particular time commitment. Identify disclosure is not required or encouraged. Regular contributors are only eligible for project-based compensation, and may not receive token vesting agreements or basic income compensation. They are typically, but not always, compensated after submitting a project-proposal and delivering the services contained therein. There are currently no plans to put in place a fixed or expected number of regular contributors for MMM prior to the start of a season. What are the expectations of a trusted contributor in order to receive basic income? Trusted contributors are expected to:  Read & understand all of the communication associated with their assigned substream(s) including in Discourse, Discord, email and other communication channels. Participate in relevant discussions to their projects on a timely basis Outline and publish their roles & responsibilities Provide constructive feedback on other DAO members during a review process Assist with contributor evaluations & onboarding  What is the purpose of adding a trusted contributor level? It is hoped that adding this level will enable the MMM workstream to increase impact in an efficient manner by increasing contributor quality, accountability, reliability & retention. While we have not yet put in place mechanisms to measure contributor retention, there is a widespread belief that our ability to reliably deliver expected impact has been limited by our ability to identify, train, empower and retain talented contributors in an efficient manner. How do contributor tiers relate to objectives and key results? Prior to the start of each season, the MMM workstream publishes and commits to a set of objectives and key results. Accountability for delivering against each of the key results are in turn “owned” by one or two contributors. Only core & trusted contributors are eligible to be assigned to be accountable for achieving key results. When a trusted contributor is assigned as the primary owner of a key result and not a core contributor, that key result must have a secondary responsibility assigned to a core contributor. How much compensation will trusted contributors receive? Trusted contributors are to be paid $300 weekly for Season 14 for the basic income portion of their compensation. As outlined above, it is expected that they would also receive at least 3-5x this amount in project-based compensation. This amount is not fixed and does not have a cap at this time. Basic income will be paid in GTC tokens at this fixed USD amount. We have not yet determined how the exchange rate will be made. Is compensation paid immediately or vested/locked? Basic income compensation is to be paid either immediately/gradually or on weekly basis. It will not be vested/locked at this time. How do you go from a regular contributor to a trusted contributor? When does this happen? It is possible to “graduate” from a regular contributor to a trusted contributor at any time. However, the goal is to identify trusted contributors for the upcoming season in the 3 weeks prior to the start of that season. Are there a maximum/minimum number of trusted contributor slots for a workstream or substream? Yes, we do expect to set a maximum number of trusted contributor slots for the MMM workstream for Season 14 and to assign a certain number of them to each substream based on need and budget. We expect that for Season 14 there will be roughly 12 trusted contributor slots for the MMM workstream, with 1-3 for each substream based on need. The trusted contributors assigned to these slots will be determined at the discretion of the core & trusted contributors in a process that is yet to be determined. Is it possible for a contributor to begin their work with MMM as a trusted contributor? Yes Is it possible for a contributor to start as a core contributor? Yes, though this is not generally a best practice. The goal is for most contributors to begin as trusted or regular contributors. Conclusion I would love any feedback on this proposal, especially from other workstream leads who have used or experimented with similar practices in the past so that it can be refined and improved! Thank you for providing any feedback prior to April 10 so it can be incorporated into this plan prior to the start of the season. Thanks, Sean ",
                    "links": [
                        "https://gov.gitcoin.co/t/introducing-stewards-governance/41/211",
                        "https://gov.gitcoin.co/t/a-compensation-commitment/10830/22",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-memes-merch-marketing-budget-request/10440",
                        "https://gov.gitcoin.co/t/s14-proposal-amended-memes-merch-marketing-budget-request/10440/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.999573236042308
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/thelostone-mc",
                    "index": "#2",
                    "likes": "2",
                    "time": "03/04/2022-07:02:19",
                    "content": "Having the flow go from Regular → Trusted → Core seems like a natural lifecycle for someone joining the stream.  government-based identity to GitcoinDAO  I wonder why this is pre-requisite at this point and if we would want to move away from this eventually step away from this. I’m curious about the existing plan we have for the DAO in terms of  type of roles pay bracket  Ideally having something common across the DAO would be easier / less confusing. cc @loie ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.095238095238095
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jonas",
                    "index": "#3",
                    "likes": "1",
                    "time": "04/04/2022-09:00:44",
                    "content": "    seanmac:  What are the expectations of a trusted contributor in order to receive basic income? Trusted contributors are expected to:  Read & understand all of the communication associated with their assigned substream(s) including in Discourse, Discord, email and other communication channels. Participate in relevant discussions to their projects on a timely basis Outline and publish their roles & responsibilities Provide constructive feedback on other DAO members during a review process Assist with contributor evaluations & onboarding    As a Core contributor within MMM I hope this could be a great catalyst to improve our efficiency as a workstream and increase our impact. Onboarding trusted contributors would mitigate a majority of the onboarding we need to do before projects. This would also work as a mechanism for MMM to include a wider subset of DAO contributors into decisions being made within our workstream, and ultimately decentralize MMM more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.84375
                }
            ]
        }
    ],
    "group_index": "49"
}