{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://gov.gitcoin.co/t/data-science-gitcoindao/10088",
            "title": "Data Science @ GitcoinDAO ",
            "index": 10088,
            "category": [
                "\\xf0\\x9f\\xa4\\x96 DAO Governance and Vision"
            ],
            "tags": [
                "data-scientist",
                "contributors"
            ],
            "content": [
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#1",
                    "likes": "7",
                    "time": "15/03/2022-22:05:39",
                    "content": "I think there is so much potential in investing data science at Gitcoin. This is informed by a few things   Prior Experience. A few years ago, I was the Director of Engineering at a clean energy startup that set up a fairly robust data warehouse ETL/snowflake schema system to run advanced analytics on time series data.  I’ve also been in a few different product oriented positions at various web2 startups that had mission critical ecommerce checkout flows with A/B testing, marketing emails to optimize those funnels.  This one time, when i was CTO of an online dating site (a double sided marketplace, just like Gitcoin), I built a matching engine that matched users on 20 dimensions. Per gitcoin.co/results, Gitcoin has helped 66,712 funders reach an audience of 292,817 earners. Gitcoin has facilitated 1,740,075 complete transactions to 10,247 unique earners.  Understanding the 4 years of data at Gitcoin, particularly the Grants Rounds data, gives me a hunch that there are interesting opportunities in understanding the data.  The objective of this thread is to start a conversation. What should the data science practice at Gitcoin look like? Here are the data science opportunities matters I’m aware of at GitcoinDAO   Product Analytics &  Data Science  Responsible for understanding how users use the platfrom.    Marketing Analytics & Data Science  Responsible for understanding how to drive more core actions (like Grants checkouts)    Complex Systems Insights  Responsible for guiding the QF matching engine with deep analytical insights (perhaps one day even simulating agent-based contributor behaviour) Responsible for  publishing advanced analytics-based insights from our datasets.  Heres an example of what this could look like.     Fraud insights  Responsible for (Joe, correct me if I’m wrong) surfacing fraud on the Gitcoin Grants network (whether sybil or collusion) and partnering with Governance to remediate in a legitimate way.    An assortment of tools are used in these practices at Gitcoin.  Here are the ones I’m aware of:  Etherscan Dune Analytics The Graph PostgresSQL Google Analytics Metabase Google spreadsheets Google presentations Acquia CADCAD Machine Learning Tools (not sure which ones)  I’d welcome corrections from any workstream leads on the above.  The above is just my best approximation of the tools/roles as they currently stand int he DAO. I’d be curious if people in the community would be interested in putting forward a proposal to the DAO to formalize a data science practice at GitcoinDAO (which currently resides in multiple different groups at varying levels of coordination) I’d like to end on this questions:  What should the data science practice at Gitcoin look like? If Data Science was an area of practice at Gitcoin, what would it look like? How could it span multiple workstreams or squads(teams) & cross-pollinate between them?   Screen Shot 2022-03-15 at 3.58.14 PM1122×730 85 KB  ",
                    "links": [
                        "https://gitcoin.co/results",
                        "https://gitcoin.co/results",
                        "https://twitter.com/owocki/status/1441415242009886723",
                        "https://www.gwern.net/docs/psychology/okcupid/themathematicsofbeauty.html",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-12-2022/10326",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-10-2022/10209",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-9-2022/10110",
                        "https://gov.gitcoin.co/t/poap-edition-gitcoindao-digest-13-2022/10363",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-edition-11-2022/10277"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.647357723577235
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/simba-sandy",
                    "index": "#2",
                    "likes": "3",
                    "time": "17/03/2022-13:26:35",
                    "content": " Have a dedicated analytics person working with every team- MMM, DAOops. While central teams have their advantages, core teams will either always be stuck in prioritization queue or forever unaware of how data can help and wont be as impactful as they could have been with data. It might also be fair for contributors to expect to know where their grants are being put to work. An opt-in visibility tool which also helps set expectations. While we have FDD for flagging and preventing fraud, we might need a function to raise the bar on best practices for governance and fund utilization using data.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/seanmac",
                    "index": "#3",
                    "likes": "4",
                    "time": "18/03/2022-17:02:30",
                    "content": "This would be so incredibly helpful. We are dramatically underinvested in this area. We have a wealth of incredible data that we can and should be using to better understand how we can better serve our stakeholders and increase our impact. MMM is just starting to scratch the surface here with work that we’re doing in the growth substream but we have a long way to go. Getting support from a DAO-wide data science team is essential to our work and our ability to fulfill our mission. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/jonas",
                    "index": "#4",
                    "likes": "5",
                    "time": "20/03/2022-09:17:59",
                    "content": "For the time being I think that there is a lot of work being done in silos. And just as you say, more cross-pollination between ppl that do data currently could have great benefit to improve our products. Data that I use day to day include; Traffic data Grants performance (add to carts, checkouts) Mobile performance Monitoring traffic sources Campaign monitoring (newsletters etc) A powerful link would be data to be set in comparison with grants data from Metabase to compare and identify new opportunities for growth. How do we structure all this? Maybe;  A data scientist who can identify interesting data and create datasets based on our grants data, and do all the queries. A google analytics (or similar tool) wizard who monitors user behavior and run A/B tests to continually improve our product. A product manager. 1 and 2 should work closely with the PM to understand their product better and identify pain points in the funnel and where there is potential to improve.  One pitfall we could encounter is to create fantastic datasets and insights, but no idea how we can execute on the data. Identifying the right stakeholders and making everyone onboard will be important for the project’s success. This also needs to align with the Web 3.0 ethos to collect as little data as possible to be able to do our job. I think transparency and inclusion of the GitcoinDAO would be crucial to be able to do this well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3707160894660895
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nategosselin",
                    "index": "#5",
                    "likes": "4",
                    "time": "21/03/2022-21:29:32",
                    "content": "I’d love to see us invest more in this area. My .02 gwei would be to separate the idea into two pieces:  How do we build a scalable, modular, anti-fragile data backbone across GitcoinDAO? How do we encourage a culture of using data across the opportunities within the DAO?  In my mind, #1 should be a data-focused product team with the remit to build a scalable data warehouse/system that can make data more easily available to analyst-level data users. In other words, how do we knit all of our data sources together and let SQL users get value out of it (given they have the business context)? #2 feels like building a group of analysts and scientists (i.e. more advanced data users) that can be embedded on specific workstreams. Maybe it lends itself to a guild model like the Gitcoin Product Collective? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.671875
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/nollied",
                    "index": "#6",
                    "likes": "3",
                    "time": "22/03/2022-00:23:29",
                    "content": "it’s interesting you post about this, i was just thinking about the feasibility of launching an AI workstream, similar to moonshot collective.     owocki:  perhaps one day even simulating agent-based contributor behaviour   this is what the matrix squad in FDD is working on btw.     simba-sandy:  Have a dedicated analytics person working with every team- MMM, DAOops. While central teams have their advantages, core teams will either always be stuck in prioritization queue or forever unaware of how data can help and wont be as impactful as they could have been with data.   i think this point should be wrestled with a little more. one interesting benefit of having a dedicated AI workstream would be that these services could be provided, with the goal of creating data unions/revenue streams (carefully of course to avoid negative incentivizations). if we did have an AI workstream, it should play a supportive role, facilitating collaborations and acting as a service to the DAO.     jonas:  A powerful link would be data to be set in comparison with grants data from Metabase to compare and identify new opportunities for growth.   this is another benefit, the ability to cross-correlate data for insights.     jonas:  This also needs to align with the Web 3.0 ethos to collect as little data as possible   and for the data that we do collect, the reports should be openly available.     nategosselin:  In my mind, #1 should be a data-focused product team with the remit to build a scalable data warehouse/system that can make data more easily available to analyst-level data users. In other words, how do we knit all of our data sources together and let SQL users get value out of it (given they have the business context)?   beautifully put. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.921590909090909
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/tigress",
                    "index": "#7",
                    "likes": "2",
                    "time": "23/03/2022-20:01:54",
                    "content": "    owocki:   What should the data science practice at Gitcoin look like? If Data Science was an area of practice at Gitcoin, what would it look like? How could it span multiple workstreams or squads(teams) & cross-pollinate between them?    Having Data Science as an Area of Practise or sometimes also called Community of Practise in larger web2 IT organizations is a common pattern. However, this DS-Area would not do any particular work for projects, OKRs or initiatives. Their goal is to reflect upon and improve their craftmanship by ways of learning from each other and presenting or socialising at events. If they get really productive they might develop and provide trainings for other Areas. For example: enabling developers so they learn from Data Scientists. There is this idea of “Team Topologies” out there that could be helping us design and visualize how we work together. And also discuss several options how Data Science could look like and interacts with others.     slideshare.net    Beyond the Spotify model - Team Topologies - DevTestNorth - 2019-09-2… Key takeaways: Why using the “Spotify Model” of team design is not enough The four fundamental team topologies needed for modern software delivery The three te…      ",
                    "links": [
                        "https://www.slideshare.net/matthewskelton/beyond-the-spotify-model-team-topologies-devtestnorth-20190925-matthew-skelton"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.007575757575758
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#8",
                    "likes": "3",
                    "time": "28/03/2022-11:31:52",
                    "content": "@ivanmolto from Builderband helped the MMM Workstream create a Dune Dashboard with an overview of the GitcoinDAO governance and finances. These visuals greatly increase the transparency of our DAO - and they look super cool! Feel free to reach out with feedback. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.463541666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#9",
                    "likes": "1",
                    "time": "29/03/2022-02:48:15",
                    "content": "100% support this Giving people access to quality data, with a data dictionary, and the ability to use tools like SQL and Python will probably drive them to generate insights on their own. Data-savvy contributors who want answers will look for them – they just might need the infrastructure/access to do so. This is what AWS is really good at – although a centralized technology – it makes it easy to have your data somewhere people can find and run more advanced analytics on using tools like SQL, & Jupyter Notebooks. It also allows for granular role-based access control. I don’t know what the decentralized alternative is but would love to ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.611111111111111
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/DisruptionJoe",
                    "index": "#10",
                    "likes": "5",
                    "time": "30/03/2022-18:24:17",
                    "content": "Great work here. I’d love to see the number of delegators each steward has delegating to them as well. Something like this:  Image 2022-03-08 at 9.43.32 AM566×867 46.1 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#11",
                    "likes": "4",
                    "time": "15/04/2022-09:35:47",
                    "content": "Number of delegators has been added to the table. @ivanmolto have also been working hard on an additional deep dive into our Governor Alpha set up. Some very interesting data can be found here: Dune Analytics ",
                    "links": [
                        "https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v3/10358/2",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-14-2022/10414"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.597222222222222
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/owocki",
                    "index": "#12",
                    "likes": "2",
                    "time": "17/04/2022-03:24:52",
                    "content": "    Fred:  These visuals greatly increase the transparency of our DAO - and they look super cool!   was just messing around with breadcrumbs.app tonight and was able to come up with this sankey diagram that allows ppl to follow the flow of GTC out of the timelock + to the workstreams + to their contributors. pretty neat!  screenshot_16501657921231920×1628 199 KB  ivan, would love to show u breadcrumbs.app sometime. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.402777777777779
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#13",
                    "likes": "1",
                    "time": "17/04/2022-19:22:18",
                    "content": "This is cool! We have discussed creating a subgraph for the Steward Health Card-project as a potential metric of engagement. The theory being that Stewards receiving GTC less than 4 hops from the multisig is a strong indicator of engagement. Especially if it’s occurring month after month. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.704166666666667
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ivanmolto",
                    "index": "#14",
                    "likes": "2",
                    "time": "20/04/2022-21:22:54",
                    "content": "Yes, of course. I would love it. I didn’t know about this tool. It is a result outstanding visually! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#15",
                    "likes": "3",
                    "time": "01/05/2022-09:55:21",
                    "content": "this is great - I would love to use some of this for the workstream and treasury health dashboard to be added as DAO tools alongside the steward health cards ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#16",
                    "likes": "9",
                    "time": "12/05/2022-21:18:49",
                    "content": "@ivanmolto  and I have been looking into the correlation between GTC outflow from GitcoinDAO and GTC spot price. A common belief is that Workstreams compensating contributors with GTC would somehow negatively impact the price of GTC. We put this theory to the test through a number of queries in this Dune Dashboard to see if it holds any water. In order to produce a meaningful analysis we couldn’t just track GTC outflow from Workstreams and compare that to GTC price. To accurately test this hypothesis we need to take one step further and track GTC outflow from contributors in relation to price. A common conception about contributors receiving compensation in GTC is that they will immediately sell their tokens for other assets, causing a massive sell wall and negative price movement as a result. After analyzing 269 unique contributors over time we can see that this is far from the truth. The data show that contributors of GitcoinDAO are likely to hold their GTC and the average amount of GTC held by this group is increasing. The first figure below shows the number of contributors who hold more than 0, 100 and 1000 GTC respectively. The second figure displays the amount of GTC held (x100) in total by this group as well as their average GTC holdings. These metrics are all increasing.  1600×1120 203 KB  We could not find a correlation between GTC outflow from Workstreams and GTC price movement:  1600×464 99.8 KB  As we looked further into what could impact GTC we found a correlation between GTC and other governance tokens. In general, GTC seems to be following the movements of the market sector. The figure below show the price movement of other governance tokens and GTC, relative to their price on May 25th 2021:  1430×445 84.3 KB  In conclusion; the hypothesis that sending GTC to Workstreams who then pay contributors would negatively impact GTC price can not be proven through the data. GTC is however correlated to similar tokens in the sector. We encourage you all to look through the dashboard and we welcome feedback on ways to improve these further. A couple of additional visuals and tweaks will be added to the dashboard in the coming days. Enormous shoutout to @ivanmolto for the amazing job. Our two previous dashboards can be found here: GitcoinDAO: Governance & Financial overview GitcoinDAO: Governor Alpha & Timelock ",
                    "links": [
                        "https://dune.com/ivanmolto/Interaction",
                        "https://dune.com/ivanmolto/Gitcoin-DAO",
                        "https://dune.com/ivanmolto/GitcoinDAO:-The-case-for-Governor-Alpha",
                        "https://gov.gitcoin.co/t/gitcoindao-digest-17-2022/10597",
                        "https://gov.gitcoin.co/t/a-compensation-commitment/10830/31",
                        "https://gov.gitcoin.co/t/gtc-6-23-govern-as-a-member-live-discussion-in-chinese/5837/24"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.186868686868687
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/ivanmolto",
                    "index": "#17",
                    "likes": "2",
                    "time": "12/05/2022-22:08:31",
                    "content": "The same to you @Fred It has been an amazing job side by side with you. Please all you enjoy the insights! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Lunacat",
                    "index": "#18",
                    "likes": "1",
                    "time": "12/05/2022-23:42:21",
                    "content": "Great to see some data!  Thanks for taking effort and time to put together.  After analyzing 269 unique contributors over time we can see that this is far from the truth.  Does this mean data set is limited to these 269 individuals over the entire time frame?  So any contributor that may have joined in Feb 2022 would not be counted?  In conclusion; the hypothesis that sending GTC to Workstreams who then pay contributors would negatively impact GTC price can not be proven through the data.  Assuming the population is constant throughout the period, the conclusion is undeniable.  But concerns right now are more forward looking – it’s easy to hold an appreciating asset, especially given most contributors have likely been sitting pretty from wider market during this time.  Will be interesting to revisit this after each round and see how trend develops in response to wider market turmoil ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.905588624338625
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#19",
                    "likes": "0",
                    "time": "13/05/2022-05:54:44",
                    "content": "I could have clarified the “269” number a bit better. 269 is the current number of total contributors we are able to identify on-chain. On May 25th 2021, when GitcoinDAO launched, we had 0 on-chain contributors. Now we’ve reached 269. A visual for the number of total contributors over time can potentially be added to the dashboard for clarity! In my opinion we have seen some pretty big market turmoil in the last months but I absolutely agree, it will be very interesting to see how things evolve. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.903846153846154
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/kishoraditya",
                    "index": "#20",
                    "likes": "3",
                    "time": "13/05/2022-07:10:22",
                    "content": "This is great @Fred and @ivanmolto It would also be great to see if or not rounds exhibit any trend in pricing of GTC! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#21",
                    "likes": "1",
                    "time": "13/05/2022-07:57:15",
                    "content": "Totally missed this in March - what an interesting insight into representation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Pop",
                    "index": "#22",
                    "likes": "5",
                    "time": "13/05/2022-08:05:49",
                    "content": "Great work @Fred and @ivanmolto - It is always important to look towards data, especially in a highly charged dynamic like a market downturn. It’s easy to make assumptions yet we must always keep ourselves in check to ensure governance decisions are not made emotionally but rather objectively and from a fully informed place of intention. When we were discussing this and even though I had an inkling the contributor sell could not affect things as much, I really did not grasp just how much hodling was actually going on. The same with the pattern of other gov tokens which is why I made the suggestion to add that chart in order to give place this analysis against the broader market background. I am keen to see these analyses progress and become a tool in the gov process. Perhaps, something we look to include in the improved versions of workstream accountability flow or in any voter matrix we may choose to adopt - provided they achieve balance between objectivity and personal takes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.857051282051282
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/myceliumcoordinator",
                    "index": "#23",
                    "likes": "2",
                    "time": "16/05/2022-15:34:35",
                    "content": "    Fred:  In conclusion; the hypothesis that sending GTC to Workstreams who then pay contributors would negatively impact GTC price can not be proven through the data.   The inverse is also true!   This analysis does not show that selling tokens to market DOES not create downward price.     Fred:  We could not find a correlation between GTC outflow from Workstreams and GTC price movement:    How can you draw that conclusion from that graph?  You just showed a bunch of data that has a bunch of outflows and a large decline in price.  There’s no rigor to this analysis method.  There’s no control group, nor is there any analysis of the liquidity of the market in this analysis.     Fred:  In general, GTC seems to be following the movements of the market sector.       Fred:  GTC is however correlated to similar tokens in the sector.   GTC is down 50% vs ETH over the last 30 days, so I dont think you can say the outflows are in line with the rest of the market decline. This chart is from coingecko:  foto.jpeg996×188 10.6 KB  I think doing an analysis about this could be important, but more rigor is needed to be able to form conclusions backed by data in my opinion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7482864357864365
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/umarkhaneth",
                    "index": "#24",
                    "likes": "1",
                    "time": "16/05/2022-17:57:48",
                    "content": "Hey! I really enjoy the discussion here. I would love to get an hour on the calendar to pull together various people with data backgrounds or interest within the DAO. We could do some introductions and share projects we’re working on. Please fill out this lettuce meet if you’re interested: LettuceMeet - Easy Group Scheduling All are welcome! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.152777777777778
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/php",
                    "index": "#25",
                    "likes": "0",
                    "time": "16/05/2022-21:38:08",
                    "content": "Maybe this way: the practise only deal with data anonymisation, and data infrastructure, and model performance evaluation. With anonymised data, all the rest can be put as bounty so be publicly worked on by any contributors ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/David_Dyor",
                    "index": "#26",
                    "likes": "1",
                    "time": "24/05/2022-22:25:12",
                    "content": "What an interesting and unexpected find.  Thanks for this work! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/Fred",
                    "index": "#27",
                    "likes": "4",
                    "time": "01/06/2022-08:16:11",
                    "content": "Late reply here, but we’ve been hard at work getting data from off-chain CEXs added to the dashboard. This has proven to be harder than we anticipated, however we are now able to track sales from contributor addresses across all of the major CEXs which has been a big milestone.     myceliumcoordinator:  The inverse is also true! This analysis does not show that selling tokens to market DOES not create downward price.       myceliumcoordinator:  How can you draw that conclusion from that graph? You just showed a bunch of data that has a bunch of outflows and a large decline in price. There’s no rigor to this analysis method. There’s no control group, nor is there any analysis of the liquidity of the market in this analysis.   I think you misunderstood my previous post; we could not find a correlation with our current data and methodology. Not being able to prove a hypothesis does not necessarily mean that the opposite is true. Circling back to sell pressure from contributors; We’ve recently added a graph over relative GTC price vs daily total contributor sales (DEX+CEX). (A correlation analysis has not yet been initiatied at this point):  bild1488×516 53.9 KB  Even though we are now able to track contributor sales on CEXs we’ve yet to find a way to get accurate total CEX volume into the dashboard. Until we have this data available natively in Dune I’ve grabbed the daily volume (CEX+DEX) from Coinmarketcap and Coingecko and plotted this graph:  790×602 56.9 KB  The volume has stayed between 1M - 10M GTC per day for the majority of GTC’s history. Median GTC volume according to Coinmarketcap = 2.7M GTC/day. Median GTC volume according to Coingecko = 2M GTC/day. This is the graph of total GTC sales from contributors on DEX & CEX:  bild1656×455 58.6 KB  Even on days of relatively large GTC sales from contributors, 10k GTC/day, contributor sell pressure is still less than half a percent of the median daily volume. (10k GTC/day is roughly equivalent to the 90-95th percentile. A normal distribution graph of contributor sell pressure is in the works. This will allow you to grab any percentile of contributor sell pressure and compare that to the total daily volume.)     myceliumcoordinator:  GTC is down 50% vs ETH over the last 30 days, so I dont think you can say the outflows are in line with the rest of the market decline.   I think you’ve misunderstood the governance token part of the dashboard as well. We are comparing GTC to other governance tokens, which are all down vs ETH. For convenience we’ve now grouped together other governance tokens into a basket on the graph. Although we haven’t initiated a proper correlation analysis to define the strength of the association, a correlation is clear:  bild1481×515 51.6 KB      myceliumcoordinator:  I think doing an analysis about this could be important, but more rigor is needed to be able to form conclusions backed by data in my opinion.   As stated earlier, the dashboard will receive continuous updates as we are able to track more data. I’d be happy to continue the conversation and discuss things further if you are interested in helping out! (Please note that Dune is performing internal upgrades at the moment and some graphs will not load properly until this work has been completed. The dashboard may also be slower to load) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.55338663243075
                },
                {
                    "author_link": "https://gov.gitcoin.co/u/keneeze.eth",
                    "index": "#28",
                    "likes": "0",
                    "time": "06/06/2022-11:09:20",
                    "content": "Thank you for all the good work you do, I agree that Data Science should be one of the priorities of the Gitcoin DAO, the insights that can be gleamed from a well done data analysis model could be a big help in further optimizing the entire grants system. There is a popular saying where I come from, it goes this way. “In God we trust, everyone else should bring data” I believe that at the heart of everything Gitcoin is trying to achieve with public goods, being able to keep track of the true impact of Gitcoin’s operations both within the Gitcoin Ecosystem and to the wider ethereum community could give the leadership a true sense of where the DAO is and precisely where it should be going, the results of a good data culture could serve as the best possible compass for Gitcoin DAO, the answers are all in the numbers.  keneeze.eth🔥_🌱 (Wildfire DAO, Public Goods Operator)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.642857142857142
                }
            ]
        }
    ],
    "group_index": "18"
}