{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
            "title": "Delegate Round-up - June 2022 ",
            "index": 16570,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "7",
                    "time": "13/07/2022-15:02:15",
                    "content": " Delegate Round-up June 2022  Introduction Note, this edition was delayed while we formalized the first payouts for the Recognized Delegate Sourcecred instance. Scroll down for more information on this! Welcome to the June 2022 edition of The Delegate Round-up. The Delegate Round-up aims to provide an overview of the Recognized Delegates operating within Maker Governance. It also serves as a one-stop forum post where members of the Maker Community can monitor how Recognized Delegates are performing. In June there were nineteen Governance Polls and four Executive Votes published to the voting portal. We welcomed Chris Blec, mhonkasalo & teemulau, ChicagoDAO, and Governance House as and London Business School as new Recognized Delegates in June, bringing us to a total of nineteen Recognized Delegates at Maker. MakerMan also announced that he will be stepping down as a Recognized Delegate when his delegate contract expires. On the topic of delegate contract expiry, the first expirations are expected in July 2022. GovAlpha, DUX and GovComms are currently collaborating in an effor to make migration to new contracts as smooth as possible for Recognized Delegates and their delegators. In June, there was an overall increase in the amount of MKR delegated to the Recognized Delegates with an increase of 26,425.79 MKR, or 28.61%, compared to May. There was also a large re-distribution of delegated MKR that occurred during the month of June, reflected below. A break-down of payments to Recognized Delegates for June is available here.  Recognized Delegates At the end of June, nineteen Recognized Delegates were active in the Maker Protocol. In descending order of MKR delegated on the 30th of June, these were:     Delegate Delegated MKR Monthly Change Monthly Percentage Change     Flip Flop Flap Delegate LLC 15,772 -2,137 -11.97%   Hasu 15,230 5,143 50.99%   Feedblack Loops LLC 14,451 2,356 19.48%   Doo 13,083 12,993 14,499.93%   JustinCase 13,022 9000 223.77%   schuppi 9,960 -6,374 -39.02%   Flipside Crypto 9,005 9000 177,864.43%   Penn Blockchain 6,184 6,174 61,127.72%   GFX Labs 5,031 2000 65.98%   Chris Blec 4,225 New Recognized Delegate New Recognized Delegate   MakerMan 3,436 -5,005 -59.29%   ACREinvest 3,100 -3,000 -49.18%   Gauntlet 3,000 -3,000 -50.00%   mhonkasalo & teemulau 1,040 New Recognized Delegate New Recognized Delegate   Governance House 1,001 New Recognized Delegate New Recognized Delegate   [email protected] 1,000 1,000 Not Applicable   monetsupply 312.40 -8,304 -96.24%   London Business School 1 1 Not Applicable   ChicagoDAO 0.20 0.20 Not Applicable   Total 118,803.40 26,425.69 28.61%     Recognized Delegates Visualized Please note, based on feedback, I have changed the colours being used in these graphs to be more accessible to people with impaired colour vision. Let me know if there are any issues with this.  bar chart showing MKR delegated to each Recognized Delegate1050×639 14.9 KB   pie chart showing relative vote weight of Recognized Delegates996×584 61.9 KB  Up-to-date visualizations can be seen on GovAlpha’s Governance Dashboard.  Delegate Metrics GovAlpha tracks metrics that monitor Recognized Delegate performance. These are useful to both current and prospective delegators in gauging how active Recognized Delegates have been and are used to calculate compensation for Recognized Delegates. The metrics currently tracked for Recognized Delegates center on participation in on-chain voting and communication by Recognized Delegates regarding their voting choices. These metrics can be seen on the delegate cards on the voting portal. In addition, a further breakdown of the participation metric is available for each delegate on their pages on the voting portal - here is a link to Flip Flop Flap Delegate LLC’s metric page as an example.  Participation For Participation, a score of 100% means that a Delegate has voted in all possible polls since they started their role as a Recognized Delegate. GovAlpha tracks Participation in Governance Polls and Executive Polls separately, then combines them to form an overall participation rating. Note that if Recognized Delegates choose not to support an Executive Vote and communicate this clearly, this will be counted as participating in the relevant Executive Vote. This is because there is no option to vote “No” to an Executive Vote. As of the end of June, the Delegate Metrics for Participation were as follows:     Delegate Name Poll Participation Executive Participation Overall Participation     Flip Flop Flap Delegate LLC 100% 100% 100%   Hasu 50.65% 72.73% 53.41%   Feedblack Loops LLC 94.04% 100% 94.88%   Doo 100% 100% 100%   JustinCase 100% 100% 100%   schuppi 99.38% 100% 99.47%   Flipside Crypto 94.74% 92.31% 94.38%   Penn Blockchain 100% 100% 100%   GFX Labs 100% 96.15% 99.39%   Chris Blec 100% 100% 100%   MakerMan 96.65% 91.67% 95.92%   ACREinvest 98.40% 100% 98.64%   Gauntlet 74.10% 48.00% 70.12%   mhonkasalo & teemulau 100% 100% 100%   Governance House 100% 100% 100%   [email protected] 100% 100% 100%   monetsupply 88.37% 83.78% 87.70%   London Business School No Data No Data No Data   ChicagoDAO No Data No Data No Data     Communication For Communication, GovAlpha tracks how Recognized Delegates have communicated their votes. Recognized Delegates are rewarded with a higher score for providing the reasoning behind their voting decisions. For example, a score of 100% would mean a Recognized Delegate communicated all of their voting decisions AND gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Delegate communicated their decisions but did not provide any reasoning for these decisions. Their scores for each vote are combined to give an overall communication rating. At the end of April, the Delegate Metrics for Communication were as follows:     Delegate Name Overall Communication     Flip Flop Flap Delegate LLC 100%   Hasu 27.78%   Doo 100%   JustinCase 100%   Feedblack Loops LLC 98.96%   schuppi 100%   Flipside Crypto 97.62%   Penn Blockchain 100%   GFX Labs 98.14%   Chris Blec 100%   MakerMan 94.85%   ACREinvest 89.31%   Gauntlet 82.18%   mhonkasalo & teemulau 100%   Governance House 100%   [email protected] 90.91%   monetsupply 72.77%   London Business School No Data   ChicagoDAO No Data     Delegate Sourcecred June marked the first month where Recognized Delegates were separated into their own sourcecred instance. Payments were sent to opted-in delegates who had received cred for their posts on 2022-07-12. The breakdown of payments was as follows, where delegates represent a team or group, only one account may participate, the participating account has been indicated:     Delegate Amount (DAI)     ACREinvest 760   Flip Flap Flop Delegate LLC 684   Doo 673   Chris Blec 578   MakerMan 340   Hasu 210   JustinCase 200   schuppi 146   Penn Blockchain (Juanbug) 143   Flipside Crypto (rspa) 101   Feedblack Loops 88   Governance House (Governance House) 37   Gauntlet (inkymaze) 18   GFX Labs (GFXlabs) 10   [email protected] ([email protected]) 9   ChicagoDAO (sm-UC) 4     Executive Votes By looking at how long it takes for an Executive Vote to pass, we can infer whether or not the Recognized Delegates are helping streamline the Governance Process. In June, the Governance Facilitators and Protocol Engineering Core Unit posted four Executive Votes to the voting portal, three of these were scheduled as part of the regular Governance Cycle, and one was an out-of-schedule Executive Vote. All of these votes passed successfully. No Executive Votes were opposed by any of the Recognized Delegates this month.     Executive Vote Date Posted Date Passed Duration (Days)     Parameter Changes, Starknet Bridge Limit and Authority Changes, Recognized Delegate Compensation, SH-001 Budget Distribution 2022-06-08 2022-06-08 0   Temporarily Disable the Aave DAI Direct Deposit Module (D3M) 2022-06-15 2022-06-15 0   MKR Vesting Transfers 2022-06-22 2022-06-29 7   Core Unit MKR Transfer and Advancing Collateral Offboardings 2022-06-29 2022-07-02 3     Delegate On-boarding At the end of June there were two new applications to become Recognized Delegates. These were:  Pvl - platform. Unfortunately Pvl’s Meet Your Delegate call had some technical difficulties, a follow-up Q&A session is tbd. Deimos - platform. Meet Your Delegate TBD.  If anyone else wants to hear more about becoming a Recognized Delegate or has any questions, please reach out to one of the GovAlpha team. We will be happy to help. To review the Recognized Delegate documentation, please see the Maker Operational Manual.  Previous Delegate Round-ups  May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021   cc: @GovAlpha-Core-Unit @gov-comms-core-unit @Recognized-Delegates ",
                    "links": [
                        "https://forum.makerdao.com/t/delegate-compensation-breakdown-june-2022/16266",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/hasu-delegate-platform/13892",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366",
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456",
                        "https://forum.makerdao.com/t/penn-blockchain-delegate-platform/14419",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556",
                        "https://forum.makerdao.com/t/chris-blec-delegate-platform/15544",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473",
                        "https://forum.makerdao.com/t/governance-house-delegate-platform/15191",
                        "https://forum.makerdao.com/t/blockchain-columbia-delegate-platform/15202",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203",
                        "https://forum.makerdao.com/t/chicagodao-delegate-platform/15358",
                        "https://www.makerdao-governance-dashboard.com/",
                        "https://vote.makerdao.com/delegates",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://etherscan.io/tx/0xb76e93cd5ca6816e1047af313cf5c8e3d536207d500e2a78a686cc2c22796804",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022/4",
                        "https://forum.makerdao.com/t/deimos-delegation-platform/15860",
                        "https://manual.makerdao.com/governance/what-is-delegation",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630/",
                        "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
                        "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
                        "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
                        "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
                        "https://forum.makerdao.com/t/delegate-round-up-november-2021/12082",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2021/11336",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-14-20-de-julio-del-2022/16911",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-7-13-de-julio-del-2022/16740",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/6",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/5",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785"
                    ],
                    "GPT-summary": "The post provides an overview of the Recognized Delegates operating within Maker Governance, including their performance metrics and recent updates. It also includes information on new Recognized Delegates and their applications. The post is not a proposal, but rather a report on the current state of Maker Governance.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.556115901402786
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#2",
                    "likes": "2",
                    "time": "13/07/2022-15:12:32",
                    "content": "This is great - thanks for putting it together! The Delegate metrics are great, really provide all the insight needed to make an informed decision. Would it be possible to add what % of total MKR token are currently held by each Delegate? E.g., what % of total MKR is delegated to Flip Flop Flap? BTW is there a cap, i.e. Maximum delegated amount?     Patrick_J:      Delegate Delegated MKR Monthly Change Monthly Percentage Change     Flip Flop Flap Delegate LLC 15,772 -2,137 -11.97%       ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.28125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#3",
                    "likes": "4",
                    "time": "13/07/2022-15:17:15",
                    "content": "Thanks! Do you mean the percentage of the circulating supply? Worked it out for you based on the circulating supply of 901,130 listed by coingecko (actual number may be slightly off but this was a quick way of doing it):  Note these numbers are the amounts as of 30th of June, up-to-date numbers are slightly different. And to answer the question about a maximum amount - no, MKR holders are free to delegate as much as they want to any delegate. Delegates stop earning additional compensation above a threshold - currently set to 10,000 MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.352083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/07/2022-18:17:48",
                    "content": "Thanks Patrick, that is what I was looking for! The delegation % of circulating MKR appears to distributed in a safe way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
            "title": "Delegate Round-up March 2022 ",
            "index": 14586,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "11",
                    "time": "12/04/2022-12:05:56",
                    "content": " Introduction Welcome to the March 2022 edition of The Delegate Round-up. The Delegate Round-up aims to provide an overview of the Recognized Delegates operating within Maker Governance. It also serves as a one-stop forum post where members of the Maker Community can monitor how Recognized Delegates are performing. The Delegate Round-up is a relatively new initiative from GovAlpha. If there is anything else you would like to see added, please send me a message or leave a comment below. In March there were seventeen Governance Polls and four Executive Votes published to the voting portal. We welcomed three new Recognized Delegates in March, with @Hasu, @Doo_StableLab (Doo Delegate) and the Flipside Crypto team (represented by @fig and @rspa) all joining the ranks of Recognized Delegates at Maker. In March, there was an overall increase in the amount of MKR delegated to the Recognized Delegates with an increase of 4,961 MKR, or 6.23%, compared to February. March saw the passage of MIP61, Recognized Delegate Compensation. A break-down of payments to Recognized Delegates for March is available here.  Recognized Delegates At the end of March, twelve Recognized Delegates were active in the Maker Protocol. In descending order of MKR delegated on the 31st of March, these were:     Delegate Delegated MKR Monthly Change Monthly Percentage Change     Flip Flop Flap Delegate LLC 17,859 -15,034 -45.71%   schuppi 15134 -5111 -25.24%   Feedblack Loops LLC 11,095 1000 9.91%   monetsupply 8,286 3,000 56.75%   MakerMan 8,043 3,012 59.86%   Hasu 6,080 6,080 N/A   ACREinvest 6,000 3,000 100.00%   Gauntlet 6,000 3,000 100.00%   JustinCase 3,062 3,000 4,823.62%   GFX Labs 3,031 3,001 9,923.15%   Doo 8.58 8.58 N/A   Flipside Crypto 4.87 4.87 N/A   Total 84603.14 4961.06 6.23%     Recognized Delegates Visualized Please note, based on feedback, I have changed the colours being used in these graphs to be more accessible to people with impaired colour vision. Let me know if there are any issues with this.  bar chart showing MKR delegated to each Recognized Delegate895×548 9.24 KB   pie chart showing relative vote weight of Recognized Delegates886×549 40.8 KB   Delegate Metrics GovAlpha tracks metrics that monitor Recognized Delegate performance. These are useful to both current and prospective delegators in gauging how active Recognized Delegates have been. The metrics currently tracked for Recognized Delegates center on participation in on-chain voting and communication by Recognized Delegates regarding their voting choices. These metrics can be seen on the delegate cards on the voting portal. In addition, a further breakdown of the participation metric is available for each delegate on their pages on the voting portal - here is a link to Flip Flop Flap Delegate LLC’s metric page as an example.  Participation For Participation, a score of 100% would mean that a Delegate has voted in all possible polls since they started their role as a Recognized Delegate. GovAlpha tracks Participation in Governance Polls and Executive Polls separately and a combined overall participation rating. Please note that if Recognized Delegates choose not to support an Executive Vote and communicate this clearly, this will be counted as participating in the relevant Executive Vote. This is because there is no option at present to vote “No” to an Executive Vote. As of the end of March, the Delegate Metrics for Participation were as follows:     Delegate Name Poll Participation Executive Participation Overall Participation     Flip Flop Flap Delegate LLC 100% 100% 100%   schuppi 100% 100% 100%   Feedblack Loops LLC 92.26% 100% 93.30%   monetsupply 83.55% 75.00% 82.39%   MakerMan 95.24% 86.96% 94.12%   Hasu 0.00% 100% 6.25%   ACREinvest 96.77% 100% 97.22%   Gauntlet 62.34% 30.77% 57.78%   JustinCase 100% 100% 100%   GFX Labs 100% 100% 100%   Doo 100% 100% 100%   Flipside Crypto 69.23% 100% 71.43%     Communication For Communication, GovAlpha tracks how Recognized Delegates have communicated their voting decisions. Recognized Delegates are rewarded with a higher score for providing reasoning for their voting decisions. For example, a score of 100% would mean a Delegate communicated all of their voting decisions AND gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Delegate communicated their decisions but did not provide any reasoning for these decisions. Their scores for each vote are combined to give an overall communication rating. At the end of March, the Delegate Metrics for Communication were as follows:     Delegate Name Overall Communication     Flip Flop Flap Delegate LLC 100%   schuppi 100%   Feedblack Loops LLC 98.50%   MakerMan 94.38%   monetsupply 82.76%   Hasu No Data   ACREinvest 97.86%   Gauntlet 95.74%   JustinCase 100%   GFX Labs 95.74%   Doo 100%   Flipside Crypto 100%     Executive Votes By looking at how long it takes for an Executive Vote to pass, we can infer whether or not the Recognized Delegates are helping streamline the Governance Process. In March, the Governance Facilitators and Protocol Engineering Core Unit posted four Executive Votes to the voting portal, three of these were scheduled as part of the regular Governance Cycle, one of these was an out-of-schedule Executive Vote to mitigate a post-shutdown vulnerability. All of these votes passed successfully. No Executive Votes were temporarily opposed by any of the Recognized Delegates this month.     Executive Vote Date Posted Date Passed Duration (Days)     Core Unit Budget Distributions, Recognized Delegate Compensation, MOMC Parameter Changes 2022-03-04 2022-03-04 0   Mitigate Post-Shutdown Flash Loan Vulnerability 2022-03-09 2022-03-09 0   Curve stETH-ETH Onboarding, Rate Limited Flapper, Immunefi Bug Bounty Payouts 2022-03-11 2022-03-11 0   Authorizing the ESM on DssFlash and Adding Support for TUSD Implementation 2022-03-25 2022-03-26 1     Delegate On-boarding At the end of March there were no new applications to become Recognized Delegates. However, Penn Blockchain represented by @juanbug posted their delegate platform on the 4th of April here. There will be a Meet Your Delegate Call hosted by @Patrick_J 2022-04-13T19:30:00Z. If anyone else wants to hear more about becoming a Recognized Delegate or has any questions, please reach out to one of the GovAlpha team. We will be happy to help. To review the Recognized Delegate requirements, please see this forum post.  Previous Delegate Round-ups  February 2022 January 2022 December 2021 November 2021 October 2021   Apologies for the delay this month, illness got in the way. cc: @GovAlpha-Core-Unit @gov-comms-core-unit @Recognized-Delegates ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891",
                        "https://forum.makerdao.com/t/hasu-delegate-platform/13892",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556",
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456",
                        "https://vote.makerdao.com/delegates",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://forum.makerdao.com/t/penn-blockchain-delegate-platform/14419",
                        "https://forum.makerdao.com/t/meet-your-delegate-11-penn-blockchain/14458",
                        "https://forum.makerdao.com/t/recognised-delegate-requirements/9421",
                        "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
                        "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
                        "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
                        "https://forum.makerdao.com/t/delegate-round-up-november-2021/12082",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2021/11336",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712",
                        "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630",
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785"
                    ],
                    "GPT-summary": "The post provides an overview of the Recognized Delegates operating within Maker Governance, including their metrics and performance. The post also highlights the new Recognized Delegates and the passage of MIP61, Recognized Delegate Compensation. The post is not asking for feedback or advertising the proposal, but rather explaining the initiative and providing updates on its progress.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.4999722499722505
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#2",
                    "likes": "2",
                    "time": "12/04/2022-17:13:41",
                    "content": "This is a very interesting development.  Looks like somebody decided to pursue more diversity by redistributing their MKR among the delegates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/04/2022-19:11:38",
                    "content": "It seems logical, but are these really the same MKRs that were withdrawn? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630",
            "title": "Delegate Round-up May 2022 ",
            "index": 15630,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "2",
                    "time": "06/06/2022-12:19:48",
                    "content": " Introduction Welcome to the May 2022 edition of The Delegate Round-up. The Delegate Round-up aims to provide an overview of the Recognized Delegates operating within Maker Governance. It also serves as a one-stop forum post where members of the Maker Community can monitor how Recognized Delegates are performing. In May there were twenty-three Governance Polls and three Executive Votes published to the voting portal. We welcomed [email protected] and London Business School as new Recognized Delegates in May, bringing us to a total of fifteen Recognized Delegates at Maker. In May, there was an overall increase in the amount of MKR delegated to the Recognized Delegates with an increase of 1,770 MKR, or 1.95%, compared to April. A break-down of payments to Recognized Delegates for May is available here.  Recognized Delegates At the end of May, fifteen Recognized Delegates were active in the Maker Protocol. In descending order of MKR delegated on the 31st of May, these were:     Delegate Delegated MKR Monthly Change Monthly Percentage Change     Flip Flop Flap Delegate LLC 17,859 No change No change   schuppi 16,334 200 1.24$   Feedblack Loops LLC 12,095 No change No change   Hasu 10,087 1,511 17.62%   MakerMan 8,441 No change No change   monetsupply 8,304 8 0.10%   ACREinvest 6,100 No change No change   Gauntlet 6,000 No change No change   JustinCase 4,062 -40 -0.98%   GFX Labs 3,031 No change No change   Doo 89.61 81.03 944.41%   Penn Blockchain 10.10 10 10,000%   Flipside Crypto 5.06 No change No change   [email protected] 0 New Recognized Delegate New Recognized Delegate   London Business School 0 New Recognized Delegate New Recognized Delegate   Total 90,607.58 6,004.44 7.10%     Recognized Delegates Visualized Please note, based on feedback, I have changed the colours being used in these graphs to be more accessible to people with impaired colour vision. Let me know if there are any issues with this.  bar chart showing MKR delegated to each Recognized Delegate895×546 11.7 KB   pie chart showing relative vote weight of Recognized Delegates885×551 42.4 KB  Up-to-date visualizations can be seen on GovAlpha’s Governance Dashboard.  Delegate Metrics GovAlpha tracks metrics that monitor Recognized Delegate performance. These are useful to both current and prospective delegators in gauging how active Recognized Delegates have been and are used to calculate compensation for Recognized Delegates. The metrics currently tracked for Recognized Delegates center on participation in on-chain voting and communication by Recognized Delegates regarding their voting choices. These metrics can be seen on the delegate cards on the voting portal. In addition, a further breakdown of the participation metric is available for each delegate on their pages on the voting portal - here is a link to Flip Flop Flap Delegate LLC’s metric page as an example.  Participation For Participation, a score of 100% means that a Delegate has voted in all possible polls since they started their role as a Recognized Delegate. GovAlpha tracks Participation in Governance Polls and Executive Polls separately, then combines them to form an overall participation rating. Note that if Recognized Delegates choose not to support an Executive Vote and communicate this clearly, this will be counted as participating in the relevant Executive Vote. This is because there is no option to vote “No” to an Executive Vote. As of the end of May, the Delegate Metrics for Participation were as follows:     Delegate Name Poll Participation Executive Participation Overall Participation     Flip Flop Flap Delegate LLC 100% 100% 100%   schuppi 99.30% 100% 99.40%   Feedblack Loops LLC 93.19% 100% 94.20%   Hasu 50.00% 75.00% 53.57%   MakerMan 96.17% 90.63% 95.35%   monetsupply 87.24% 81.82% 86.46%   ACREinvest 97.96% 100% 98.28%   Gauntlet 68.14% 42.86% 64.18%   JustinCase 100% 100% 100%   GFX Labs 100% 100% 100%   Doo 100% 100% 100%   Penn Blockchain 100% 100% 100%   Flipside Crypto 91.84% 90% 91.53%     Communication For Communication, GovAlpha tracks how Recognized Delegates have communicated their votes. Recognized Delegates are rewarded with a higher score for providing the reasoning behind their voting decisions. For example, a score of 100% would mean a Recognized Delegate communicated all of their voting decisions AND gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Delegate communicated their decisions but did not provide any reasoning for these decisions. Their scores for each vote are combined to give an overall communication rating. At the end of April, the Delegate Metrics for Communication were as follows:     Delegate Name Overall Communication     Flip Flop Flap Delegate LLC 100%   schuppi 100%   Feedblack Loops LLC 98.82%   MakerMan 94.12%   monetsupply 79.35%   Hasu 28.57%   ACREinvest 90.63%   Gauntlet 93.98%   JustinCase 100%   GFX Labs 100%   Doo 100%   Flipside Crypto 96.23%     Executive Votes By looking at how long it takes for an Executive Vote to pass, we can infer whether or not the Recognized Delegates are helping streamline the Governance Process. In May, the Governance Facilitators and Protocol Engineering Core Unit posted three Executive Votes to the voting portal, all of these were scheduled as part of the regular Governance Cycle. All of these votes passed successfully. No Executive Votes were opposed by any of the Recognized Delegates this month.     Executive Vote Date Posted Date Passed Duration (Days)     Recognized Delegate Payments, Lowering WBTC Stability Fees, and Onboarding wstETH-B 2022-05-11 2022-05-14 3   Foundational L2 Work, Authorize New Flash Mint Module, MKR Vesting 2022-05-18 2022-05-19 1   Raise the ESM Minimum Threshold, MKR Vesting, Adjust the lid Parameter on the Rate-limited Flapper 2022-05-25 2022-05-27 2     Delegate On-boarding At the end of May there were four new applications to become Recognized Delegates. These were:  Governance House - platform - Meet Your Delegate Call 15th of June, announcement pending ChicagoDAO - platform - Meet Your Delegate Call 8th of June  mhonkasalo and teemulau - platform - Meet Your Delegate Call 8th of June  Chris Blec - platform - Meet Your Delegate Call 9th of June   If anyone else wants to hear more about becoming a Recognized Delegate or has any questions, please reach out to one of the GovAlpha team. We will be happy to help. To review the Recognized Delegate documentation, please see the Maker Operational Manual.  Previous Delegate Round-ups  April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021   cc: @GovAlpha-Core-Unit @gov-comms-core-unit @Recognized-Delegates ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366",
                        "https://forum.makerdao.com/t/hasu-delegate-platform/13892",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556",
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246",
                        "https://forum.makerdao.com/t/penn-blockchain-delegate-platform/14419",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456",
                        "https://forum.makerdao.com/t/blockchain-columbia-delegate-platform/15202",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203",
                        "https://www.makerdao-governance-dashboard.com/",
                        "https://vote.makerdao.com/delegates",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://forum.makerdao.com/t/governance-house-delegate-platform/15191/1",
                        "https://forum.makerdao.com/t/chicagodao-delegate-platform/15358/3",
                        "https://forum.makerdao.com/t/meet-your-delegate-13-mhonkasalo-teemulau-and-chicagodao/15481",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473",
                        "https://forum.makerdao.com/t/meet-your-delegate-13-mhonkasalo-teemulau-and-chicagodao/15481",
                        "https://forum.makerdao.com/t/chris-blec-delegate-platform/15544",
                        "https://forum.makerdao.com/t/meet-your-delegate-14-chris-blec/15585",
                        "https://manual.makerdao.com/governance/what-is-delegation",
                        "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
                        "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
                        "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
                        "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
                        "https://forum.makerdao.com/t/delegate-round-up-november-2021/12082",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2021/11336",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043",
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785"
                    ],
                    "GPT-summary": "The post provides an overview of the Recognized Delegates operating within Maker Governance, including the amount of MKR delegated to each delegate, their participation and communication metrics, and the success of Executive Votes. The post also mentions new applications to become Recognized Delegates. The post is an explanation of the current state of Maker Governance and an audit of the Recognized Delegates' performance.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.551632395382395
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
            "title": "Delegate Round-up April 2022 ",
            "index": 15139,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "6",
                    "time": "12/05/2022-15:46:54",
                    "content": " Introduction Welcome to the April 2022 edition of The Delegate Round-up. The Delegate Round-up aims to provide an overview of the Recognized Delegates operating within Maker Governance. It also serves as a one-stop forum post where members of the Maker Community can monitor how Recognized Delegates are performing. The Delegate Round-up is a relatively new initiative from GovAlpha. If there is anything else you would like to see added, please send me a message or leave a comment below. In April there were twenty-one Governance Polls and six Executive Votes published to the voting portal. We welcomed Penn Blockchain as a new Recognized Delegate in April, bringing us to a total of thirteen Recognized Delegates at Maker. In April, there was an overall increase in the amount of MKR delegated to the Recognized Delegates with an increase of 6,004 MKR, or 7.10%, compared to March. A break-down of payments to Recognized Delegates for April is available here.  Recognized Delegates At the end of April, thirteen Recognized Delegates were active in the Maker Protocol. In descending order of MKR delegated on the 30th of April, these were:     Delegate Delegated MKR Monthly Change Monthly Percentage Change     Flip Flop Flap Delegate LLC 17,859 No change No change   schuppi 16,134 1,000 6.61%   Feedblack Loops LLC 12,095 1,000 9.02%   Hasu 8,576 2,496 41.05%   MakerMan 8,441 398 4.95%   monetsupply 8,296 10 0.12%   ACREinvest 6,100 100 1.67%   Gauntlet 6,000 No change No change   JustinCase 4,062 1,000 32.66%   GFX Labs 3,031 No change No change   Doo 8.58 No change No change   Flipside Crypto 5.06 0.19 3.90%   Penn Blockchain 0.10 0.10 N/A   Total 90,607.58 6,004.44 7.10%     Recognized Delegates Visualized Please note, based on feedback, I have changed the colours being used in these graphs to be more accessible to people with impaired colour vision. Let me know if there are any issues with this.  bar chart showing MKR delegated to each Recognized Delegate896×549 9.97 KB   pie chart showing relative vote weight of Recognized Delegates880×543 39.8 KB   Delegate Metrics GovAlpha tracks metrics that monitor Recognized Delegate performance. These are useful to both current and prospective delegators in gauging how active Recognized Delegates have been. The metrics currently tracked for Recognized Delegates center on participation in on-chain voting and communication by Recognized Delegates regarding their voting choices. These metrics can be seen on the delegate cards on the voting portal. In addition, a further breakdown of the participation metric is available for each delegate on their pages on the voting portal - here is a link to Flip Flop Flap Delegate LLC’s metric page as an example.  Participation For Participation, a score of 100% would mean that a Delegate has voted in all possible polls since they started their role as a Recognized Delegate. GovAlpha tracks Participation in Governance Polls and Executive Polls separately, then combines them to form an overall participation rating. Note that if Recognized Delegates choose not to support an Executive Vote and communicate this clearly, this will be counted as participating in the relevant Executive Vote. This is because there is no option to vote “No” to an Executive Vote. As of the end of April, the Delegate Metrics for Participation were as follows:     Delegate Name Poll Participation Executive Participation Overall Participation     Flip Flop Flap Delegate LLC 100% 100% 100%   schuppi 99.17% 100% 99.29%   Feedblack Loops LLC 92.61% 100% 93.69%   Hasu 43.75% 100% 50.00%   MakerMan 95.83% 89.66% 94.92%   monetsupply 85.55% 80.00% 84.73%   ACREinvest 97.59% 100% 97.96%   Gauntlet 68.37% 47.06% 65.22%   JustinCase 100% 100% 100%   GFX Labs 100% 100% 100%   Doo 100% 100% 100%   Flipside Crypto 88.24% 100% 90.00%   Penn Blockchain 100% 100% 100%     Communication For Communication, GovAlpha tracks how Recognized Delegates have communicated their votes. Recognized Delegates are rewarded with a higher score for providing the reasoning behind their voting decisions. For example, a score of 100% would mean a Recognized Delegate communicated all of their voting decisions AND gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Delegate communicated their decisions but did not provide any reasoning for these decisions. Their scores for each vote are combined to give an overall communication rating. At the end of April, the Delegate Metrics for Communication were as follows:     Delegate Name Overall Communication     Flip Flop Flap Delegate LLC 100%   schuppi 100%   Feedblack Loops LLC 98.70%   MakerMan 95.08%   monetsupply 85.38%   Hasu 11.76%   ACREinvest 90.96%   Gauntlet 97.26%   JustinCase 100%   GFX Labs 95.74%   Doo 100%   Flipside Crypto 94.44%     Executive Votes By looking at how long it takes for an Executive Vote to pass, we can infer whether or not the Recognized Delegates are helping streamline the Governance Process. In April, the Governance Facilitators and Protocol Engineering Core Unit posted six Executive Votes to the voting portal, five of these were scheduled as part of the regular Governance Cycle, one of these was an out-of-schedule Executive Vote to mitigate a vulnerability. All of these votes passed successfully. No Executive Votes were temporarily opposed by any of the Recognized Delegates this month.     Executive Vote Date Posted Date Passed Duration (Days)     Core Unit Budget Distributions and Vesting Streams Setup, Gelato Keeper Network Budget Stream Setup 2022-04-01 2022-04-02 1   MOMC Parameter Changes, CRVV1ETHSTETH-A Debt Ceiling Increase, Recognized Delegate Compensation, ETHAmsterdam Event SPF Funding 2022-04-08 2022-04-09 1   Out-Of-Schedule Executive 2022-04-14 2022-04-14 0   Offload TUSD and DAI Transfers 2022-04-15 2022-04-16 1   Oracle Whitelist Additions, Replacing the Curve stETH/ETH Oracle 2022-04-22 2022-04-25 3   Core Unit Budget Distributions 2022-04-29 2022-05-02 3     Delegate On-boarding At the end of April there were no new applications to become Recognized Delegates. If anyone else wants to hear more about becoming a Recognized Delegate or has any questions, please reach out to one of the GovAlpha team. We will be happy to help. To review the Recognized Delegate documentation, please see the Maker Operational Manual.  Previous Delegate Round-ups  March 2022 February 2022 January 2022 December 2021 November 2021 October 2021   cc: @GovAlpha-Core-Unit @gov-comms-core-unit @Recognized-Delegates ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366",
                        "https://forum.makerdao.com/t/hasu-delegate-platform/13892",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556",
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456",
                        "https://forum.makerdao.com/t/penn-blockchain-delegate-platform/14419",
                        "https://vote.makerdao.com/delegates",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://manual.makerdao.com/governance/what-is-delegation",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
                        "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
                        "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
                        "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
                        "https://forum.makerdao.com/t/delegate-round-up-november-2021/12082",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2021/11336",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630",
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785"
                    ],
                    "GPT-summary": "The post provides an overview of the Recognized Delegates operating within Maker Governance, including their metrics and performance. The post also includes a breakdown of payments to Recognized Delegates for April and a list of previous Delegate Round-ups. The author invites feedback and questions from the Maker Community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 5.457847707847709
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
            "title": "Delegate Round-up January 2022 ",
            "index": 13006,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "8",
                    "time": "02/02/2022-23:36:38",
                    "content": " Introduction Welcome to the January 2022 edition of The Delegate Round-up. The Delegate Round-up aims to provide an overview of the Recognized Delegates operating within Maker Governance. It also serves as a one-stop forum post where members of the Maker Community can monitor how Recognized Delegates are performing. The Delegate Round-up is a relatively new initiative from GovAlpha. If there is anything else you would like to see added, please send me a message or leave a comment below. January was a busy month from a Governance perspective, with 23 Governance Polls and 4 Executive Votes published to the voting portal. January was the first month where we saw an overall reduction in the amount of MKR delegated to the Recognized Delegates with a fall of 178.67 MKR, or 0.23%, compared to December. This may be attributable to volatile market conditions, so it remains to be seen whether or not this represents an anomaly. January is the third month included in the Delegate Compensation Trial, a break-down of payments to Recognized Delegates for January is available here.  Recognized Delegates At the end of January, nine Recognized Delegates were active in the Maker Protocol. In descending order of MKR delegated on the 31st of January, these were:     Delegate Delegated MKR Monthly Change Monthly Percentage Change     Flip Flop Flap Delegate LLC 32,893.07 13.46 0.04%   schuppi 20,244.67 0.00 0.00%   Feedblack Loops LLC 10,102.26 0.00 0.00%   monetsupply 5,043.67 0.00 0.00%   MakerMan 5,031.02 -200 -3.82%   Gauntlet 3,000.00 0.00 0.00%   ACREinvest 1,000.00 0.00 0.00%   JustinCase 59.45 5.41 10.00%   GFX Labs 30.24 2.47 8.89%   Total 77,404.38 -178.67 -0.23%     Recognized Delegates Visualized Please note for, based on feedback, I have changed the colours being used in these graphs to be more accessible to people with impaired colour vision. Let me know if there are any issues with this.  bar chart showing MKR delegated to each Recognized Delegate895×548 4.54 KB   pie chart showing relative vote weight of Recognized Delegates882×547 35.2 KB   Delegate Metrics GovAlpha tracks metrics that monitor Recognized Delegate performance. These are useful to both current and prospective delegators in gauging how active Recognized Delegates have been. The metrics currently tracked for Recognized Delegates center on Participation in on-chain voting and communication by Recognized Delegates regarding their voting choices. These metrics can be seen on the delegate cards on the voting portal. In addition, a further breakdown of the participation metric is available for each delegate on their pages on the voting portal - here is a link to Flip Flop Flap Delegate LLC’s metric page as an example.  Participation For Participation, a score of 100% would mean that a Delegate has voted in all possible polls since they started their role as a Recognized Delegate. GovAlpha tracks Participation in Governance Polls and Executive Polls separately and a combined overall participation rating. As of the end of January, the Delegate Metrics for Participation were as follows:     Delegate Name Poll Participation Executive Participation Overall Participation     Flip Flop Flap Delegate LLC 100% 100% 100%   schuppi 100% 100% 100%   Feedblack Loops LLC 91.60% 100% 92.70%   MakerMan 93.69% 82.35% 92.19%   monetsupply 81.03% 66.67% 79.10%   Gauntlet 29.27 0.00% 26.09%   ACREinvest 92.31% 100% 93.33%   JustinCase 100% 100% 100%   GFX Labs 100% 100% 100%     Communication For Communication, GovAlpha tracks how Recognized Delegates have communicated their voting decisions. Recognized Delegates are rewarded with a higher score for providing reasoning for their voting decisions. For example, a score of 100% would mean a Delegate communicated all of their voting decisions AND gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Delegate communicated their decisions but did not provide any reasoning for these decisions. Their scores for each vote are combined to give an overall communication rating. At the end of January, the Delegate Metrics for Communication were as follows:     Delegate Name Overall Communication     Flip Flop Flap Delegate LLC 100%   schuppi 100%   Feedblack Loops LLC 98.82%   MakerMan 94.49%   monetsupply 84.62%   Gauntlet 100%   ACREinvest 96.30%   JustinCase 100%   GFX Labs 100%     Executive Votes By looking at how long it takes for an Executive Vote to pass, we can infer whether or not the Recognized Delegates are helping streamline the Governance Process. In January, the Governance Facilitators and Protocol Engineering Core Unit posted four Executive Votes to the voting portal, three of these were scheduled as part of the regular Governance Cycle, and one was an emergency Executive Vote. All of these votes passed successfully. None of the Recognized Delegates opposed any of the Executive Votes in January.     Executive Vote Date Posted Date Passed Duration (Days)     Recover DAI from Optimism Escrow, Changes to Uniswap LP Vault Debt Floor Parameters, Delegate Compensation 2022-01-14 2022-01-15 1   MOMC Parameter Changes, Decrease the GUNIV3DAIUSDC2-A Liquidation Ratio 2022-01-22 2022-01-22 0   Temporarily Prevent Surplus (flap) Auctions and MKR Burn 2022-01-24 2022-01-24 0  (This urgent Executive Vote passed within 18 minutes of being posted)   Core Unit Budget Transfers and Streams 2022-01-28 2022-01-29 1     Delegate On-boarding At the time of writing, GovAlpha has received one new application to become a Recognized Delegate: @Hasu has thrown their hat into the ring. A Meet Your Delegate Call is scheduled for Wednesday, Febuary 09 at 18:00 UTC. If anyone else wants to hear more about becoming a Recognized Delegate or has any questions, please reach out to one of the GovAlpha team. We will be happy to help. To review the Recognized Delegate requirements, please see this forum post.  Previous Delegate Round-ups  December 2021 November 2021 October 2021  cc: @GovAlpha-Core-Unit @gov-comms-core-unit @Recognized-Delegates ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556",
                        "https://vote.makerdao.com/delegates",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://forum.makerdao.com/t/meet-your-delegate-9-hasu/12944",
                        "https://forum.makerdao.com/t/recognised-delegate-requirements/9421",
                        "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
                        "https://forum.makerdao.com/t/delegate-round-up-november-2021/12082",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2021/11336",
                        "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094",
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630",
                        "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
                        "https://forum.makerdao.com/t/fire-drill-request-for-discussion-informal-polls/13799",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-02-04/13050"
                    ],
                    "GPT-summary": "The post provides an overview of the Recognized Delegates operating within Maker Governance, including their monthly change, monthly percentage change, and participation in on-chain voting and communication. The post also includes a breakdown of the participation metric and communication metric for each delegate. Additionally, the post mentions the new application to become a Recognized Delegate and provides links to previous Delegate Round-ups.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.677620802620802
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
            "title": "Delegate Round-up February 2022 ",
            "index": 13657,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "9",
                    "time": "04/03/2022-21:08:39",
                    "content": " Delegate Round-up February 2022  Introduction Welcome to the February 2022 edition of The Delegate Round-up. The Delegate Round-up aims to provide an overview of the Recognized Delegates operating within Maker Governance. It also serves as a one-stop forum post where members of the Maker Community can monitor how Recognized Delegates are performing. The Delegate Round-up is a relatively new initiative from GovAlpha. If there is anything else you would like to see added, please send me a message or leave a comment below. In February, sixteen Governance Polls and two Executive Votes were published to the voting portal. In February, there was an overall increase in the amount of MKR delegated to the Recognized Delegates, with an increase of 2,237.70 MKR, or 2.89%, compared to January. This increase followed a slight reduction in January, but overall, there has been an increase in the amount of MKR delegated this calendar year. February is the fourth month included in the Delegate Compensation Trial. A breakdown of payments to Recognized Delegates for February is available here.  Recognized Delegates Note: A considerable redistribution of delegated MKR occurred on the 1st of March. These figures reflect the delegated amounts on the 28th of February, and as a result, are slightly out of date. Up  to date amounts of delegated MKR can be seen on the voting portal. At the end of February, nine Recognized Delegates were active in the Maker Protocol. In descending order of MKR delegated on the 28th of February, these were:     Delegate Delegated MKR Monthly Change Monthly Percentage Change     Flip Flop Flap Delegate LLC 32,893.07 0.00 0.00%   schuppi 20,244.67 0.00 0.00%   Feedblack Loops LLC 10,102.26 -7.68 -0.08%   monetsupply 5,286.31 +242.64 +4.81%   MakerMan 5,031.02 0.00 0.00%   Gauntlet 3,000.00 0.00 0.00%   ACREinvest 3,000.00 +2,000 +200.00%   JustinCase 59.45 +2.74 +4.61%   GFX Labs 30.24 0.00 0.00%   Total 79,642.08 +2,237.70 +2.89%     Recognized Delegates Visualized Please note, based on feedback, I have changed the colours being used in these graphs to be more accessible to people with impaired colour vision. Let me know if there are any issues with this.  bar chart showing MKR delegated to each Recognized Delegate893×547 4.54 KB   pie chart showing relative vote weight of Recognized Delegates886×549 34.9 KB   Delegate Metrics GovAlpha tracks metrics that monitor Recognized Delegate performance. These are useful to both current and prospective delegators in gauging how active Recognized Delegates have been. The metrics currently tracked for Recognized Delegates centre on Participation in on-chain voting and communication by Recognized Delegates regarding their voting choices. These metrics can be seen on the delegate cards on the voting portal. In addition, a further breakdown of the participation metric is available for each delegate on their pages on the voting portal - here is a link to Flip Flop Flap Delegate LLC’s metric page as an example.  Participation For Participation, a score of 100% would mean that a Delegate has voted in all possible polls since they started their role as a Recognized Delegate. GovAlpha tracks Participation in Governance Polls and Executive Polls separately and a combined overall participation rating. Please note that if Recognized Delegates choose not to support an Executive Vote and communicate this clearly, this will be counted as participating in the relevant Executive Vote. This is because there is no option to vote “No” to an Executive Vote. As of the end of January, the Delegate Metrics for Participation were as follows:     Delegate Name Poll Participation Executive Participation Overall Participation     Flip Flop Flap Delegate LLC 100% 100% 100%   schuppi 100% 100% 100%   Feedblack Loops LLC 91.11% 100% 92.26%   monetsupply 81.20% 70.00% 79.74%   MakerMan 94.53% 84.21% 93.20%   Gauntlet 49.12% 12.50% 44.62%   ACREinvest 95.24% 100% 95.83%   JustinCase 100% 100% 100%   GFX Labs 100% 100% 100%     Communication For Communication, GovAlpha tracks how Recognized Delegates have communicated their voting decisions. Recognized Delegates are rewarded with a higher score for providing reasoning for their voting decisions. For example, a score of 100% would mean a Delegate communicated all of their voting decisions AND gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Delegate communicated their decisions but did not provide any reasoning for these decisions. Their scores for each vote are combined to give an overall communication rating. At the end of January, the Delegate Metrics for Communication were as follows:     Delegate Name Overall Communication     Flip Flop Flap Delegate LLC 100%   schuppi 100%   Feedblack Loops LLC 98.95%   MakerMan 94.49%   monetsupply 80.17%   Gauntlet 98.28%   ACREinvest 96.74%   JustinCase 100%   GFX Labs 100%     Executive Votes By looking at how long it takes for an Executive Vote to pass, we can infer whether or not the Recognized Delegates are helping streamline the Governance Process. In February, the Governance Facilitators and Protocol Engineering Core Unit posted two Executive Votes to the voting portal. Both of these were scheduled as part of the regular Governance Cycle. All of these votes passed successfully. One Executive Vote was temporarily opposed by a Recognized Delegate this month.     Executive Vote Date Posted Date Passed Duration (Days)     Recognized Delegate Compensation, Raise the Emergency Shutdown Threshold, MOMC Parameter Changes, Core Unit DAI Budget Stream Corrections 2022-02-04 2022-02-04 0   GUSD PSM Maximum Debt Ceiling Increase, MakerMan Retroactive Delegate Compensation 2022-02-25 2022-02-27 2*    * Executive Vote initially opposed by a Recognized Delegate.  Delegate On-boarding At the end of the month, GovAlpha had received three new applications to become a Recognized Delegate: @Doo_StableLab signalled their intention to become a Recognized Delegate by posting the Doo Delegate Platform. @fig from Flipside Crypto posted the Flipside Crypto Delegate Platform. Both Doo and Flipside Crypto Recognized Delegates attended a Meet Your Delegate Call hosted by @LongForWisdom on Wednesday, 02 March at 18:00 UTC. The video for this call is available on the MakerDAO Youtube channel here for anyone who missed it. @Hasu has thrown their hat into the ring. Unfortunately, their Meet Your Delegate call was temporarily postponed. It will now be held on the 9th of March at 18:00 UTC. If anyone else wants to hear more about becoming a Recognized Delegate or has any questions, please reach out to one of the GovAlpha team. We will be happy to help. To review the Recognized Delegate requirements, please see this forum post.  Previous Delegate Round-ups  January 2022 December 2021 November 2021 October 2021  cc: @GovAlpha-Core-Unit @gov-comms-core-unit @Recognized-Delegates ",
                    "links": [
                        "https://vote.makerdao.com/delegates",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556",
                        "https://vote.makerdao.com/delegates",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456",
                        "https://forum.makerdao.com/t/meet-your-delegate-10-doo-wan-nam-and-flipside-crypto/13248",
                        "https://www.youtube.com/watch?v=hNMKg9BNWjU",
                        "https://forum.makerdao.com/t/meet-your-delegate-9-hasu/12944",
                        "https://forum.makerdao.com/t/meet-your-delegate-9-hasu-no-longer-postponed/12944",
                        "https://forum.makerdao.com/t/recognised-delegate-requirements/9421",
                        "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
                        "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
                        "https://forum.makerdao.com/t/delegate-round-up-november-2021/12082",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2021/11336",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
                        "https://forum.makerdao.com/t/fire-drill-request-for-discussion-informal-polls/13799",
                        "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-february-2022/13726",
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630"
                    ],
                    "GPT-summary": "The post provides an overview of the Recognized Delegates operating within Maker Governance, including the amount of MKR delegated to each delegate, their participation and communication metrics, and the success of Executive Votes. The post also includes information on new applications to become a Recognized Delegate. The post does not explain the proposal itself, but rather provides an update on the current state of Maker Governance.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.573379140239605
                }
            ]
        }
    ],
    "group_index": "635"
}