{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-would-you-spend-70-000-mkr-to-get-rid-of-the-usdc/9052",
            "title": "[Informal Poll] Would you spend 70,000 MKR to get rid of the USDC? ",
            "index": 9052,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#1",
                    "likes": "1",
                    "time": "30/06/2021-15:36:54",
                    "content": "I know this has been asked before and rejected, but I think we’re in a different spot now so I’d like to take the community’s temperature. I arrived at the number (70k) because at todays prices it would allow the DAO to pay roughly 3% on the current Dai supply. To be clear, this Dai would be paid to Vault users that mint Dai, not on Dai itself. It would increase our market share (by effectively causing the USDC in Maker to be redeemed or increasing the total amount of Dai generated) and remove the existential risk/PR issues. The downside, of course, is that (a) it may not work as intended and (b) it dilutes MKR holders. It also wouldn’t permanently solve the problem, it would just buy us more time to do something like refinancing into Real World Assets at scale. We’d also still likely have some USDC in the system given the current growth rate of Dai demand, but it would hopefully be an inconsequential amount. I’m bringing this up now because there’s been a lot of creative solutions thrown around to “quickly” achieve this goal, and while they’re interesting and should potentially be pursued in parallel, I think we should rule out the simplest method first if we’re going to devote resources to this.    Would you spend 70,000 MKR to (hopefully) get rid of the USDC?  Yes No Abstain     0 voters     ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing a solution to get rid of USDC in Maker and is asking for feedback from the community. The proposal involves spending 70,000 MKR to pay roughly 3% on the current Dai supply, which would be paid to Vault users that mint Dai, not on Dai itself. The proposal has potential downsides, such as diluting MKR holders and not permanently solving the problem. The author is asking the community if they would spend 70,000 MKR to get rid of USDC.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.627450980392156
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#2",
                    "likes": "1",
                    "time": "30/06/2021-15:41:56",
                    "content": "I messed up the poll so if you already voted please vote again ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#3",
                    "likes": "6",
                    "time": "30/06/2021-15:55:55",
                    "content": "I view this as more of a last resort. I think we have plenty of options left including the one we haven’t even started yet of QE bombs into the farming pools such as cUSDC cropjoin and SushiJoin. It’s also not trivial to add this on the smart contracts side. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "5",
                    "time": "30/06/2021-16:04:08",
                    "content": "I really think we’re missing the boat if we view all this USDC as something to get rid of as soon as possible. I’d love to see it be a much smaller percentage of DAI backing, But this is literally money we are being paid to hold and are not charged interest. We can find ways to swap some it or get yield on it or simply grow the total portfolio to lessen its impact. I certainly don’t think we should pay money to offload it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.446428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#5",
                    "likes": "1",
                    "time": "30/06/2021-16:26:11",
                    "content": "This feels like a nuclear option. I don’t like the reliance on USDC, but it’s also the case that if USDC goes under, then DeFi more broadly will be a radioactive wasteland. I’d really like to explore the idea of paying part of liquidation fees to Vault holders, now that Liq2.0 makes auctions more efficient. It wouldn’t be as much as you’re suggesting, making it more of a lottery (a BT or Scary Wednesday-type event might wipe out some users’ fees entirely), but it’s another tool to explore. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9140625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#6",
                    "likes": "2",
                    "time": "30/06/2021-16:27:47",
                    "content": "I think vaultholder incentives are necessary in an environment where the system’s natural market incentive to mint dai for speculative purposes (i.e. via a high peg) have been dampened by other forces. I suspect there’s some novelty and dry powder on the sidelines that would enter at much smaller incentive rates, say 0.5%, which would be paid for out of the stability fees we’re charging. It would result in a lower return for MKR holders for sure, but I wouldn’t frame it as MKR lost any more than I’d frame reducing rates as MKR lost. It’s just where the market is at. I think of this as the missing “Dai Generation Rate” that would complement the “Dai Savings Rate” at the other side of the peg. Anyways, It’s not necessary to go entirely out of pocket to provide some incentive for vaultholders so I don’t really agree with the way that this is worded. If MKR holders are willing to do “whatever it takes” to maintain the Dai peg, I don’t see how vaultholder incentives as a solution are any more extreme than taking on billions in regulated stablecoins. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.490104166666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#7",
                    "likes": "2",
                    "time": "30/06/2021-16:59:47",
                    "content": "I completely agree with this assessment. I worded it this way to put a concrete number on the table and kick off the conversation. I’ve founded that past polls and requests were too abstract to generate a meaningful opinion from the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#8",
                    "likes": "0",
                    "time": "30/06/2021-19:29:00",
                    "content": "I voted abstain because the amount is probably too high and the reward should be directed to some key vault such as eth-c or eventually uni dai pair. Let’s be honest we are in a market where competitors are rewarding we probably need to have this tool in place. Compound just launches its new feature. We won’t last long if we are just accumulating usdc and dai. Also the last big up was triggered by curve and compound. If no one is doing anything it is not going to bring more people into defi and dai supply won’t increase. Most importantly, when a dollar is bringing into Ethereum it rarely leaves therefore if more people are coming we are also building our future. Think about Ford. Note: I am not 100% convinced but I am more and more accepting it. Interestingly at the end I am ending accepting all @brianmcmichael ideas . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.327990430622011
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#9",
                    "likes": "2",
                    "time": "03/07/2021-17:50:25",
                    "content": "PSM too large? Just wait until the Fed issue an official US stablecoin - the PSM will grow to unfathomable size. So just learn to love the thing, it will probably be around forever. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#10",
                    "likes": "0",
                    "time": "03/07/2021-17:59:38",
                    "content": "If you consider usdc at 4% premium risk, and eth-c at let’s say 0.05% ( my guess) Would you prefer 3b USDC at 0% or 3b eth-c at -0.5%? The fed guy was wrong when he described his views of dai using shadow bank and the analogy with 1930 something. But he would have been probably 100% correct if you replace dai by USDC. At some point someone would have to pay the risk premium and we are holding 10% of it. BTW 4% is probably the lower range. Edit : I believe it is good to have it in place as it can take 3 to 6 months to build it, not necessary use it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#11",
                    "likes": "3",
                    "time": "03/07/2021-18:48:01",
                    "content": "    Planet_X:  Just wait until the Fed issue an official US stablecoin   I wouldn’t mind that PSM at all. The problem is when the Fed issues a stablecoin and bans USDC at the same time or Circle goes bust - then we’re screwed because we’re holding on to all this USDC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#12",
                    "likes": "0",
                    "time": "03/10/2021-00:48:27",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}