{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/clarity-around-collateral-onboarding-process/14221",
            "title": "Clarity Around Collateral Onboarding Process ",
            "index": 14221,
            "category": [
                "Governance"
            ],
            "tags": [
                "collateral-onboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#1",
                    "likes": "11",
                    "time": "25/03/2022-17:31:28",
                    "content": "Hi all! This applies to not only MIP68 but to other collaterals (or collateral technologies) involved with onboarding collateral. CES wants to bring in a little clarity to the collateral onboarding (COB) process especially as it relates to activities that follow a different process, non-MIP6 (MIP68, D3Ms, SRs, onchain polling, etc.) To date, Maker has primarily used the COB process, https://collateral.makerdao.com/, to onboard collateral. While less than perfect, the CMON and CMOFF stakeholders are spending a lot of time iterating to make the process better and provide more transparency. Today, the COB process starts with a MIP6. Currently, there are a variety of paths proposers of collateral are taking and initiating  with a non-MIP6 process. CES is open to supporting the community and evolving as new processes are presented. CES’s responsibility is to follow our mandate as most of you have voted us to do. As part of that process, Maker has to find ways to balance the priorities of onboarding what I will term “greenlit” collateral. In the past, Maker referred to greenlit collateral as something that has followed the MIP6 process leading to an onchain poll. Today, the community is experimenting with a variety of ways to signal there is a collateral Maker wants to add to the protocol. To support the needs of the community, CES will recognize a collateral as “greenlit” if a non-MIP6 is ratified or an onchain vote positive vote has occurred for a specific collateral type. Taking this approach, the collateral stakeholders (Domain Teams) will be able to correctly prioritize all collateral work, regardless of how collateral is greenlit, to determine which collaterals are scheduled to be onboarded and continue with the COB process. CES is also committed to bringing greater transparency to the collateral onboarding priorities and statuses of WIP for collateral being implemented. We hope this increased level of communication will alleviate some of the growing pains we’re all feeling right now. ",
                    "links": [
                        "https://forum.makerdao.com/t/request-for-definitive-description-of-collateral-onboarding-process/14330/3",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219/11",
                        "https://forum.makerdao.com/t/monthly-governance-review-march-2022/14428",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-24-30-2022/14332",
                        "https://forum.makerdao.com/t/mip65-project-clydesdale-monetalis-arrangement-i-liquid-bond-strategy-execution/13148/15",
                        "https://forum.makerdao.com/t/mip68-monetalis-vault-v2/13789/23",
                        "https://forum.makerdao.com/t/mip68-monetalis-lusitano-uk-green-economy-sme-wholesale-lending/13789/39",
                        "https://forum.makerdao.com/t/launch-of-the-new-collateral-status-index-csi/14723/8",
                        "https://forum.makerdao.com/t/ces-sprint-update-4-2022-q1-mar-14th-to-mar-25th-2022/14451",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-truefi/14563/25",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2"
                    ],
                    "GPT-summary": "The author of the post is explaining the collateral onboarding process and how it relates to activities that follow a different process. They are also introducing a new approach to recognizing \"greenlit\" collateral and committing to bringing greater transparency to the collateral onboarding priorities and statuses. A 3rd party could give constructive criticism, ask questions, or want to collaborate on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.971779126670431
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "10",
                    "time": "25/03/2022-18:08:11",
                    "content": "Moved this to its own thread to avoid the MIP68 topic getting more cluttered. I think this makes sense generally, and is a sensible path to take given the current ambiguity in onboarding processes. I will just point out that the ‘experimentation’ with new ways to onboard collateral is not really a new development, nor is it really experimentation. This has occurred because there are ambiguities around which ‘process bucket’ varying items should fall into. For something like onboarding a crypto-token, the collateral application process under MIP6 is pretty standard, and fits quite well, given that it was designed with that sort of token in mind. However this falls apart when it comes to things that are collateral types, but are also something else, ie:   PSMs - Incoming stablecoins end up as collateral of DAI, but MIP6 would not have been an appropriate process for onboarding the first, or even subsequent PSMs. As such, they went down the road of having technical MIPs, and signal requests.  RWA collateral - These required technical innovations and varying legal and transactional details that were not accounted for in MIP6, and so ended up as a mix of technical MIPs, and signals.  New vault-types for collateral that is currently supported. Stuff like ETH-B, wBTC-B, ETH-C, etc. This will become collateral, but it is collateral upon which governance has already voted, the collateral-part isn’t in question, the parameter-part is in question, so signals fit better than MIP6.  D3M’s are the latest in this line of ‘things that don’t quite fit.’  The top-level MIPs process and the Signal Request process are both specifically designed to be as flexible as possible, which is why they are used more in the case of ambiguity. The way to standardize collateral onboarding is to define and ratify processes such that this ambiguity is no longer present, or such that it’s captured by a separate process. At this point, I would strongly recommend removing MIP6 and the associated MIPs, and replacing them with something built from the ground up to deal with the ambiguity in various collateral structures in such a way that encourages standardization. MIP6 and the other early MIPs were not built with this in mind, and will likely always be weaker and less suitable than a process designed around our current goals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7149535899535895
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#3",
                    "likes": "4",
                    "time": "26/03/2022-18:01:37",
                    "content": "    LongForWisdom:  At this point, I would strongly recommend removing MIP6 and the associated MIPs, and replacing them with something built from the ground up to deal with the ambiguity in various collateral structures in such a way that encourages standardization. MIP6 and the other early MIPs were not built with this in mind, and will likely always be weaker and less suitable than a process designed around our current goals.   I agree. The short-term approach is to accommodate the ambiguity in the system. The long-term approach would be to modify the application process (MIP6, etc). I think we can do this in parallel to prevent blockages with the current collateral flowing through the system. The top priority right now is to increase the transparency of the COB process. We’ll start to roll this out in the next few weeks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.459126984126984
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "1",
                    "time": "27/03/2022-22:09:00",
                    "content": "    monkey.irish:  The short-term approach is to accommodate the ambiguity in the system. The long-term approach would be to modify the application process (MIP6, etc). I think we can do this in parallel to prevent blockages with the current collateral flowing through the system.   Yep, agreed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party wanting to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ctcunning",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/05/2022-15:29:58",
                    "content": "@monkey.irish and @LongForWisdom I’m surprised this thread only got some interest from you both. As I read it, it’s actually pretty significant how impactful some of this thinking could be. I’m not sure I agree (maybe I’m misunderstanding) why we’re combining technical and collateral risk here? As I understand it, D3M is a technical solution, no different than MIP-21, MIP-22, or “new vault-types” as @LongForWisdom rightly called out. But I’m curious why MIP-6 is getting thrown into this thinking here. I could be reading wrong so I wanted to put down some of my thoughts and get a simple True or False as a way to clarify the process. If I’m way off the mark, maybe it’s just a matter of having a quick call and then reposting to the Community (I’m happy to do it) and get some cross-unit / cross-domain thinking here. So here is my list of statements for True / False:   MIP-6 is a required step for all collateral, whether CMON (on-chain) or CMOFF (off-chain) - Launch of the New Collateral Status Index (CSI)   MIP-6s that are evaluated by the Real World Finance Core Unit (RWF CU) are now held to the Methodology for Review by the vote that ratified MIP-67 into the Collateral Onboarding Process.   Any applicant, no matter which technology solution they choose, must have submitted a MIP-6.   A final assumption I’ve been working with: As it pertains to RWA collateral, that is natively off-chain, but may be brought on-chain through Centrifuge or underpin some of the loans that Maker makes through various technology solutions, the MIP-6 (and now accompanied by MIP-67) was responsible for housing the legal and collateral risk evaluated for any applicant seeking capital from Maker. I might be over-placing importance on MIP-6, but without it and MIP-67, I don’t see how the Maker Community has an overarching document in place to ensure all collateral is risk assessed. Excited to work through this as always with you. ",
                    "links": [
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://vote.makerdao.com/polling/QmWt5fov"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.413433788433788
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#6",
                    "likes": "3",
                    "time": "03/05/2022-16:02:36",
                    "content": "While I highly recommend collateral applicants use a MIP6 to start the process, I can’t force anyone to do that. Today, the Collateral Onboarding process is built around starting with the MIP6. Why? For me, the more complete the application, the quicker it moves through the process. Yes, there is more upfront work to do and I feel that is properly placed. For example, why would we want to wait until the assessment phase to figure out what collateral is actually being onboarded? Some of the Signal Requests right now will force us to do that therefore delaying the process of moving the collateral through the system. Let’s have a complete collateral application, upfront, so we don’t have to spend time later in the process to figure it out. The newly ratified collateral application updates, the MIP guidelines, and the MIP67 allow us to do this.   False. This is based upon the Maker governance process. What I can provide is to publish guidelines (as we’ve done) to help collateral applicants understand how they get the time with the CES CU and the collateral stakeholders. This process is my commitment to give all collateral a consistent and timely process when applying. If applicants decide to use a different process, that is up to them and I have no idea of the results or timing.   True. MIP67 has been ratified by the community. RWF has clearly stated they are using MIP67 to help applicants prepare for a MIP6 application. @williamr Please comment if needed.   False. See #1. Also, you can’t onboard technology, only assets. Every applicant that does not clearly outline the collateral to be onboarding is at risk of consuming a lot of time from many stakeholders leading to a frustrating process. My request is to define all this upfront, in a MIP6, to achieve harmony with the process and stakeholders.   To reply to your final comments, the only thing I can say is, we have a process and I would ask that applicants follow the process. It starts with a MIP6 application. In the past there was an issue with getting collateral through the system and knowing statuses for collateral in the process. That is no longer the case. There is a little more clean up to do (the basis of some of your questions) so keep that in mind. We have several collaterals that have not followed the COB process so we’ll have to see how that plays out. As you can expect, there are a few exceptions to the MIP6 application. These mainly deal with creating new vaults with collateral that has already been onboarded. The above is not this. I only bring that up since there will be Signal Requests for these situations and it’s the correct vehicle to bring those changes (parameters, etc.) into the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3430719532992255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#7",
                    "likes": "1",
                    "time": "03/05/2022-16:12:00",
                    "content": "    ctcunning:  As I understand it, D3M is a technical solution, no different than MIP-21, MIP-22, or “new vault-types” as @LongForWisdom rightly called out.   I am not entirely sure this entirely accurate. As requested by @Growth-Core-Unit, I am reviewing some of the underlying contractual agreements that “implement” the D3M solution. The fact that there are underlying contractual agreements on which Maker will rely suggests that D3M will be more than simply technical. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.668367346938775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ctcunning",
                    "index": "#8",
                    "likes": "2",
                    "time": "03/05/2022-16:24:00",
                    "content": "Thanks as always  On point #1 and #3, effectively you’re saying this:  The CES CU and other CUs would strongly prefer that anyone seeking to onboard collateral begin with a MIP-6 At the same time, you cannot enforce any MIP-6 be used by any applicant Any applicant, can submit collateral to be financed in any way they choose, and “how that plays out” may lead to a “frustrating process”  If that’s all true (and let me know if it’s not  ) it leaves me with a following thought: My sense is that although it may be frustrating, or not what the CES CU prefers (and maybe other CUs), it doesn’t seem that there’s any penalty / dis-incentive for Applicants? Correct me if my logic doesn’t make sense: but if I was applying to finance collateral through MakerDAO, and there are no indication of how Applicants are prioritized (whether they follow preferred process of the CUs or not), wouldn’t I simply apply in the way that best benefits me and creates greatest opportunity for success? It feels like there’s a dislocation between the process that the CES CU and other CUs are working hard to articulate as preferred path…versus the path future applicants may prefer to take. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.880208333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ctcunning",
                    "index": "#9",
                    "likes": "0",
                    "time": "03/05/2022-16:29:29",
                    "content": "I was operating off of some of the back and forth @teej posted recently here, I think he may see it as purely technical as well?     A North Star - DAI as the Destination Real World Finance       I think this whole section was poorly approached and confusing to folks, which probably means that I did not think hard enough about what I meant before publishing. After contemplation, I meant: collateral with credit risk will be evaluated as such, regardless of if it lives natively on chain or is a “real world asset”.   Exactly.   I don’t think there’s any canon because this is virgin ground. To me, the D3M will be an effective wholesale lending solution insofar as the institution/protocol ge…     But to my line of thinking, technical vs collateral risk, is the review work that you’re doing related to on-chain / smart contract risk of D3M? I wouldn’t categorize that as legal in the sense of collateral risk legal. If you can expound a bit more for us, would be helpful to make sure I’m not confusing things. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.505654761904761
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#10",
                    "likes": "1",
                    "time": "03/05/2022-17:27:07",
                    "content": "When a process works (as you’ll see demonstrated in the new few months), there is a huge disincentive to work against that. The Phase II of the COB process is being worked on now and will provide even more clarity for onboarding collateral. It will also streamline some things and reduce timeframes. Re: prioritization, what is being fixed is helping applicants understand where they stand. The dimensions on the Prioritization tab are being reviewed and updated, where needed, and will be the basis for a prioritization summary. This will provide more specific information to applicants. When that gets implemented (<4 weeks), an incomplete collateral application would rank very low in prioritization and the applicant would need to spend time updating whatever they used as their collateral application (MIP6, SR, MIP). That would be a huge issue for MIPs since they might have to be amended…another 60 day cycle. With SRs, there might be a lot of back and forth with the clarification leading to frustration and extended timeframes. While there might be a dislocation in the process and future applicants, it’s probably due to an applicant either with a lack of understanding of the COB process and/or getting advice from non-collateral stakeholders. I love feedback to help make our processes better. Getting involved, like you are doing, supports improving what we do and how we do it. I’ll continue to share that CES is available to help collateral applicants understand the process and technology with collateral onboarding. We are here so please reach out if you have question. I’m pretty sure Growth and RWF would make the same offer. Ultimately,  the collateral applicant makes the choice. Choose wisely!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.937229437229438
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#11",
                    "likes": "1",
                    "time": "03/05/2022-17:46:31",
                    "content": "    ctcunning:  But to my line of thinking, technical vs collateral risk, is the review work that you’re doing related to on-chain / smart contract risk of D3M? I wouldn’t categorize that as legal in the sense of collateral risk legal.   Not the on-chain/smart contract risk per se, but some of the agreements / covenants that implement what happens next (these are off-chain). I am trying to understand the extent to which the agreement/covenants are divorced from the smart contract. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.591836734693878
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#12",
                    "likes": "1",
                    "time": "03/05/2022-17:57:31",
                    "content": "I’ll let @teej clarify his comment where needed. For CES, the implementation work we do is to understand the technical implications of using current collateral technology when onboarding a piece of collateral. Today, many of the collateral technology solutions are multipurpose. This is challenging since we talk about an “out of a box” solution but I’ve yet to see one. For the D3M, PE has developed the collateral technology and when the audits and such are complete, we’ll use the latest refactor they have been working on. The overall technical risk of the D3M is being handled through the development process. When CES onboards collateral using a D3M, there is a lot to look at. A Compound D3M is different than a Maple Finance D3M. There is the initial development and the ongoing maintenance for any collateral onboarded using the D3M. All of this has to be evaluated for technical risk. Technical, collateral, and legal risk are intertwined as we have learned. The good news is that we have CUs/people to look at each of these risks and make assessments so the protocol is covered. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "02/08/2022-23:57:31",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}