{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/project-compass-thought-process/8846",
            "title": "Project Compass: Thought Process ",
            "index": 8846,
            "category": [
                "Governance"
            ],
            "tags": [
                "project-compass"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#1",
                    "likes": "5",
                    "time": "18/06/2021-18:55:02",
                    "content": " Project Compass: Thought Process The Project Compass working group started in March to establish and formalize a process for vision-setting on the DAO-wide level. Because of the diversity of stakeholders in the DAO, this post should serve as a walkthrough of the various contexts that led us to publish the current framework. Please note that the goal of the Project Compass working group was not to create a vision, but rather to propose a framework for future DAO-wide consensus-seeking around that subject.  The initial assumptions Several assumptions around the following topics were made at the start of our work:  The importance of a DAO-wide consensus-seeking mechanism The stakeholders’ role in a checks-and-balances-oriented vision-setting mechanism The process needing to lead the content The definition of a vision   The importance of a DAO-wide consensus-seeking mechanism The first assumption relates to the DAO’s need of being able to make multi-layered, high-level decisions to thrive. Nowhere is it as visible as in the case of something as intangible and high-level as vision. A process for consensus-seeking among all stakeholders of the system is, however, time-consuming and involves much governance overhead. Onchain votes can be difficult to access in terms of why proposals were favored or opposed. The restrictive governance monthly cycle and the limited accessibility of on-chain votes in terms of why proposals were favored or opposed, both make that task more complex than in traditionally-hierarchical companies.  The stakeholders’ role in a checks-and-balances-oriented vision-setting mechanism. The initial process we’ve created came down to the interplay between the three following groups of stakeholders: Mandated Actors are the core of the DAO: having been given trust from both governance communities, their mandate is the only formally-existing one in the DAO. The skin-in-the-game factor also plays a role. After all, it’s often their livelihoods on the line. Consequently, mandated actors are both financially incentivized to make good decisions as well as entrusted with decision-making capabilities. In addition, the mandated actors’ expertise plausibly trumps all others in the system. As a result of previous points, mandated actors are expertly prepared, financially incentivized, and uniquely mandated to take final responsibility for the vision-setting processes. On-chain governance community is the on-chain voters. Without any mandate, they have financial skin in the game. There’s a strong argument to be made that for this reason they should have more to say in establishing any vision than off-chain governance. They should be presented with a set of proposals and express their opinion on them as the most efficient way of any potential decision-making. Off-chain governance community is the off-chain voters. Without any mandate and any financial skin in the game, off-chain governance is important in checking the on-chain voters. Their opinion on the vision setting is important insofar as the (hopefully growing in the future) multitude of informed voices will always be wiser than one informed whale. Similarly to on-chain voters, they should be presented with a set of proposals and express their opinion on them.  The process needs to lead the content Our assumption that proved to require the most revision, was the focus on process and not the outcome. The most vital initial goal was to find consensus among the three governance communities with as little governance overhead as possible, thus making sure that the issue of DAO’s vision enjoyed overwhelming consensus without too much resources being invested. You can find the newest version of the process here.  The Definition of a vision Vision, strategy, high-level objectives, all of those terms would be used interchangeably, admittedly a mistake on the part of our working group. Having established a need for a vision and a potential governance process, we’d still have to go back to the actual concept later on.  Initial feedback Firstly, there’s been a positive affirmation of the need for a DAO-wide vision. This came from all of the assumed stakeholder groups: off-chain governance (in various forum threads), on-chain governance (MKR holders and voters), and Mandated Actors (spanning a range of Core Units). Vision is important for aligning Core Units. That sentence could sum up the initial feedback we’ve received. Facing a rapidly-changing environment with the Maker Foundation’s dissolution and the introduction of the Core Unit framework, the DAO would need to make sure that the work performed horizontally aligns with the overall goals and vision of the system. The lack of an overarching entity, e.g., a supervisory board, may very well be expected to surface later on, for example in dispute resolution.  But what about the definition? While everyone agrees on the need for a vision, the DAO is constructed by people from all kinds of different backgrounds, creating various expectations as to what a ‘vision’ entails. Is it a tagline? Is it a list of high-level (but still tangible) objectives? How granular should it be, not to become too prescriptive but still provide value to Core Units? The issue here has become increasingly clear when we’d present our process: the only consensus out there turned out to be around the need for a vision, with everyone having their own idea of what framework it should fit. In other words, we’d need to address conflicting ideas even before we get to the content of any particular vision.  Can we ever reach true alignment and/or should we let vision materialize organically? Another argument views any formal process of reaching a vision in a decentralized environment as fundamentally futile. Any such process would supposedly require more governance bandwidth that even a successful outcome can justify. This approach advocates that the governance bandwidth would be better spent in singular occurrences of necessary “alignment”. For example, faced with a decision on what to do with 84k MKR in the treasury, vision alignment needs to limit itself to particularities rather than generalities. In other words, should we just do our jobs and expect vision to materialize organically? What adds to this point is the fact that the ecosystem changes quickly and with it our perception of MakerDAO. For this reason, vision should never be too overarching or it risks becoming obsolete when unable to quickly adapt. It’s for this reason that an expected vision should be defined as follows:    Project Compass: Conceptual Framework   Driven by the purpose, a Vision Statement describes where the company wants a community, or the world, to be as a result of the company’s success. Vision statements give people a sense of aspiration, inspiring action toward opportunity. A vision statement is future-looking, aspirational, and opportunity-exploring. What is the world like 5 years from now if Maker DAO is successful? Who benefits and how? What sort of collaboration or alliances are forged? How does it enrich the development of humanity? How does the overall landscape change? Example Vision Statement #1  A fully transparent world where anyone has access to financial markets without middlemen, all while being able to help build the financial system of tomorrow.    Current thinking The answer to the questions of definitions and MakerDAO’s ability to reach alignment/vision materializing organically, we propose now a conceptual framework. Whether a governance process is feasible and desirable, will hopefully be decided in the resulting discussions. Such a process would require any statements to remain as adaptable as required, i.e., a vision statement may remain constant but the same can’t be said for a mission statement. It’s also to be noted that we’re intentionally cautious in proposing one particular governance process for vision-setting. It’s crucial for the community to reach consensus around high-level concepts beforehand, lest we risk semantics defeating the effort. The DAO needs to understand what they’d be voting on first, regardless of whether we decide to use Snapshot, on-chain polls, a MIP, or any other tool for actual consensus-seeking. ",
                    "links": [
                        "https://forum.makerdao.com/t/project-compass-conceptual-framework/8845/1",
                        "https://forum.makerdao.com/t/project-compass-a-conceptual-framework/8845",
                        "https://forum.makerdao.com/t/governance-and-risk-call-227-thursday-february-23-2023-17-00-utc/19929"
                    ],
                    "GPT-summary": "The post explains the process of establishing a framework for vision-setting on the DAO-wide level. The author discusses the initial assumptions, the stakeholders' role, the importance of a DAO-wide consensus-seeking mechanism, and the definition of a vision. The post also includes initial feedback and the current thinking on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.719364836552336
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "18/09/2021-00:55:41",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}