{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-utility-of-collateral-applications-mip6-and-greenlight-polls-mip9/12689",
            "title": "The Utility of Collateral Applications (MIP6) and Greenlight Polls (MIP9) ",
            "index": 12689,
            "category": [
                "Governance"
            ],
            "tags": [
                "collateral-onboard",
                "greenlight-polls"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "11",
                    "time": "17/01/2022-15:03:44",
                    "content": "Continuing the discussion from Compound D3M Risk Assessment:    Compound D3M Risk Assessment    Does GovAlpha believe that putting on the brakes on RWA MIP6 applications is the right move until the Arranger structure & the proposed RWF Collateral Risk level guidelines are set in stone? Or, should we continue to get an overwhelming response of Delegates abstaining?    GovAlpha believes that delegates can remove MIP6 and/or MIP9 using MIP4c4 if they feel that applications and greenlight polls are no longer useful. Personally, I don’t believe the delegates are treating greenlight polls the way they were intended to be treated. MIP9c1 says the following as part of its first point:  … Community greenlight is the process through which early sentiment is measured and used to direct the work of domain teams towards assets that MKR Holders will be willing to onboard after work has been completed.  It’s just supposed to be a signal that you support CU teams working on the asset. Not a promise that it will be onboarded, or worked on, or prioritized. It’s mainly a way for governance to save CU members time by deferring anything they are sure they wouldn’t onboard in a later vote. If lots of governance members participate, then it gives the CU’s a good idea of how popular any given collateral is with the community, and helps direct prioritisation. The fact that the above has not always been obvious to collateral applicants is partially a result of the lack of structured communication from MakerDAO to those applicants. But it also reflects a tendency for collateral applicants to make assumptions about Maker’s governance processes that are not accurate, based on experience with traditional finance and/or other crypto-projects. @Recognized-Delegates @collateral-core-unit ",
                    "links": [
                        "https://forum.makerdao.com/t/compound-d3m-risk-assessment/12580/5",
                        "https://mips.makerdao.com/mips/details/MIP6",
                        "https://mips.makerdao.com/mips/details/MIP9",
                        "https://mips.makerdao.com/mips/details/MIP4#MIP4c4",
                        "https://mips.makerdao.com/mips/details/MIP9#MIP9c1",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/24",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721/17",
                        "https://forum.makerdao.com/t/forum-at-a-glance-january-14th-20-2022/12752"
                    ],
                    "GPT-summary": "The post discusses the utility of collateral applications and greenlight polls in the context of Compound D3M Risk Assessment. The author asks whether GovAlpha believes that putting a hold on RWA MIP6 applications is the right move until the proposed RWF Collateral Risk level guidelines are set in stone. GovAlpha believes that delegates can remove MIP6 and/or MIP9 using MIP4c4 if they feel that applications and greenlight polls are no longer useful. The post also discusses the intended purpose of greenlight polls and the lack of structured communication from MakerDAO to collateral applicants.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.816043083900226
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "17/01/2022-17:56:49",
                    "content": "    LongForWisdom:  Personally, I don’t believe the delegates are treating greenlight polls the way they were intended to be treated.   100% agree with this point. Not sure where and at what time things got confused that an educated opinion can’t be made by Delegates/MKR token owners as to what they want to Greenlight. In the previous Forum Post my point pertains to RWA MIP6 applications and the near future changes that are being proposed by a 2-Core Unit model of underwriting and compliance. New RWA applications will first need to be review by the 2-Core Unit structure (as I understood it), then MKR token owners will have their say. So, I was wondering if its best to “freeze” all future RWA MIP6s until such structure is approved by MKR token owners. Personally I’m okay with continuing to Greenlight all types of MIP6 apps., but I’m not sure how, somewhere, somehow, Recognized Delegates have gotten into the habit of dodging the MIP6 Greenlight question. And hey, at times 3F Delegate has also been guilty as charged–we’ve voted yes to Greenlighting silly MIP6 apps that shall remain nameless  but, as you said its just a signal that Delegates support CU teams to workin on such asset. Anyhow, thank you for your reply. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.838804713804714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/04/2022-23:57:05",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}