{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-restructuring-incentives-for-recognized-delegate-compensation/16469",
            "title": "[Informal Poll] Restructuring Incentives for Recognized Delegate Compensation ",
            "index": 16469,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "informal-poll",
                "compensation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#1",
                    "likes": "1",
                    "time": "10/07/2022-13:43:35",
                    "content": " Preamble Author(s): Andrew Burban Contributors:  tags: governance, delegate, compensation, poll Status: Informal Poll Date Applied: <2022-07-09> Date Ratified: <yyyy-mm-dd>    Motivation MIP61 introduced incentives for our Recognized Delegates. Staying on top of every vote is a demanding task and appropriate compensation is not unwarranted. However, it appears that the current compensation model, while a good first step, does not appropriately align interests between delegates, MKR holders, DAI users, vault users, our builders, and the rest of our community. The current incentive structure is broken. Naturally, the surrounding confusion could have been predicted. Luckily, it’s not beyond repair and can still be fixed in its early stages.   Proposing Additional Factors We should consider introducing several additional factors to the Delegate Compensation model.  Weighting for Community Presence To me, this is a no-brainer and is relatively easy to measure. When was someone’s first activity on the Maker Forums? There’s a timestamp. Frequent activity or not, the longer you’ve been there, the more history you’ve seen, and the deeper your understanding of Maker’s foundational values and core principles is. That’s not to say fresh minds should be disregarded. We need new ideas to keep growing, but our governors MUST know where we came from as well.  I would weight this factor at up to 30%.   Whale Backer Registry    If a sizeable share of a Delegate’s MKR backing is from single sources, there should be clear transparency. I would not weight it, though. Just an important fact to be public about.   Skin In The Game To be remotely aligned with Maker’s interests, you should probably own some MKR yourself before considering taking on a delegate role. All Delegates should be required to post some of their own MKR as collateral before any compensation. The minimum required shouldn’t be too high, but delegates should stand to lose some to slashing or burning for being ineffective. Conversely, the more MKR the delegate wishes to stake, the greater this would factor towards their compensation.   Note on “Skin In The Game”:  I would not hard REQUIRE that Delegates commit so much of their own MKR to become a delegate.  A reasonable minimum may be like 5-10 MKR, but compensation would be weighted accordingly. For “full” compensation, I would like to see Delegates put up at least 100 of their own MKR.       Compensation in MKR I don’t know if this has been discussed, but it does not appear to be part of the current model. We take DAI from our Surplus Buffer to hand over for Delegate Compensation. Nothing wrong there per se, but I would prefer to see compensation in both DAI and MKR. It’s a little unique, but would go approximately as follows:  30-50% of DAI compensation is diverted to buying MKR (maybe using DSSKILN?)  This MKR should NOT come from the MKR in our treasury.   Of the MKR that is purchased:   100% of this MKR is added to the delegate’s voting power.  35% vests linearly over four years. 40% vests linearly over the following six years. 25% is never distributed.    Note: If a delegate resigns or takes a sabbatical:  After a three or six month cliff period, the purchased MKR would start to be burned. How it’s burned can be debated.  It can all be burned in one shot. It can be burned linearly over six or twelve months, maybe even longer.   Any MKR staked personally by a Delegate would also be subject to burning, but I would picture 0% - 50% returned after four years? Alternatively, possibly a reasonable penalty is simply not having access to the staked MKR for 4yrs+.  These specifics can be debated.          Polls Should delegate compensation be weighted based on how long they have been in the community?     Yes No Other ( please respond with suggestion) Abstain     0 voters     Should we require delegates to disclose whale backings?     Yes No Other ( please respond with suggestion) Abstain     0 voters     Should we encourage delegates to stake their own MKR?     Yes No Other ( please respond with suggestion) Abstain     0 voters     Should we weigh personally staked MKR when compensating delegates?     Yes No Other ( please respond with suggestion) Abstain     0 voters     Based on the model above, should we compensate delegates, in part, with vested MKR?     Yes No Other ( please respond with suggestion) Abstain     0 voters     Should we burn MKR that would have been vested if a delegate leaves or gets fired (delegated MKR falls below some threshold value)?     Yes No Other ( please respond with suggestion) Abstain     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-199-thursday-july-14-at-17-00-utc/16575/2",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-julio-del-2022/16629",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/5",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/4",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-7-13-de-julio-del-2022/16740"
                    ],
                    "GPT-summary": "The post proposes restructuring incentives for recognized delegate compensation in the Maker community. The author suggests introducing additional factors to the current compensation model, such as weighting for community presence, transparency in whale backer registry, skin in the game, and compensation in both DAI and MKR. The post also includes a poll to gather feedback on the proposed changes. The post explains the proposal in detail and invites constructive criticism and collaboration.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.5367176608702025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "2",
                    "time": "10/07/2022-14:16:05",
                    "content": "I hope it’s not about trying to divert Maker’s attention to your SH CU to delegates. Especially when you get high compensation in DAI and on top, gets MKR as well. Why should this apply to delegates but not your CU?     aburban90:  30-50% of DAI compensation is diverted to buying MKR (maybe using DSSKILN?)  This MKR should NOT come from the MKR in our treasury.    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#3",
                    "likes": "3",
                    "time": "10/07/2022-14:30:13",
                    "content": "Time is not a good indicator I think Cred can be used as a good indicator. However, it brings the disadvantage that opinions that correspond to the majority are more likely to be rewarded than someone who says what no one wants to hear, for example, a year ago budget cuts, MKR bruner off or on. Each delegate should be free to talk about their MKR holdings. If someone openly shows how much MKR he personally has, it is also more appealing delegate to him. At least for me. We all probably have different financial backgrounds, we shouldn’t discriminate anyone if someone doesn’t have much MKR but for him it means the world because he comes from a different background and represents small holders. Also a discrepancy of VCs and the individual hodler performing as a delegate. No one should feel forced to buy MKR from the compensation, we don’t demand that from the CU either. If the system of delegates becomes too non-transparent and several mechanisms make it not logically comprehensible for me to delegate my MKR to someone, I would rather vote myself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.428571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "1",
                    "time": "10/07/2022-15:54:37",
                    "content": "I think weighting to length of time in community is interesting as this signals ‘how well’ someone might know Maker.  I have been here 4 years and still don’t know everything and I forget changes (like GSM is now 48 vs 24hrs).  I was trying to figure out when polls changed to not requiring MKR to be in governance contract. I have always felt a delegate should have some minimum personal MKR stake but this will put out people who are not fairly wealthy?   Should we create this as a hurdle to governance.?   I think so because if you can’t even muster your own MKR and have your own MKR stake should you even be allowed to be a delegate?    Like saying a board director of a company can not own any of the company.  BOD members are actually some of the largest shareholders (for obvious reasons). As to disclosing whale backings.  Seriously I think we should pay @PaperImperium to give an MKR ownership report with numbers not names and then we can list what whale # is backing what delegate(s) with what amount of MKR.  I don’t need a name just a number and this is just an idea.   I think knowing who is doing what is important.  I don’t think there is any way to really control or manage this though. Yes to delegates staking their own MKR. Yes to weighing personally staked MKR (include vested MKR in this too btw) when compensating.  Have a reasonable minimum to not be punished like 100 MKR give or take. Something else not considered in the above. EVERY employee of the DAO gets DAI in cash as a reasonable salary, MKR vesting is considered on top of.  In the past I wanted to make MKR vesting directly connected to profitability of the protocol.  Like why should people get a MKR bonus when the protocol is losing money.   This aligns ALL stakeholder interests to Maker being profitable. I also suggest some component of MKR vesting be tied to people taking part of their salary to buy MKR.  Every place I worked there was this matching component to retirement.  You put in like 3% of your salary to retirement you got a 3% match.   Point here is salary in DAI should be sufficient to encourage people to take positions, the MKR vesting should be tied to profitability AND a part of this should be tied to the contractor/employee taking part of their DAI salary and buying MKR.  When I look at something like SES - MKR Incentive Plan Details - v0.1 - Google Docs (chart on page 14) shows MKR vesting to run from about 35-50% of salary.     So if I was going to alter vesting I would tie MKR vesting to Maker profitability as I suggested in my delegate platform here:  MakerMan delegate platform - #11 by MakerMan The only change I would make to this is that a contractor needs to actually allocate some of their salary (say up to 20%) to buy MKR on the open market to get up to 50% of their vested MKR.   So If I have a salary of 150K (12.5K DAI salary) and I am going to get something like 4MKR vested that month I should have to buy up to 2.5K DAI worth of MKR (currently 2.5MKR) to get another 2MKR worth of vesting on top of the 2MKR vesting I’d get for free. What the above change would do is to get CU contractors to start buying MKR with DAI salaries to earn their available MKR vest.  It won’t burn MKR but it would encourage the use of DAI being paid to contractors (and delegates) to buy MKR.  This would be even more important for delegates above because the MKR they buy on the Market could/would go to their MKR held and would potentially increase their compensation. Lastly MKR vested should not be burned, it was earned, just like CUs. I think it is unfair to treat delegates differently in this regard than CUs. ",
                    "links": [
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/11"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.703703703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#5",
                    "likes": "2",
                    "time": "10/07/2022-18:40:10",
                    "content": "    Doo_StableLab:  it’s not about trying to divert Maker’s attention to your SH CU to delegate   No, not at all. Take me out of the picture when thinking of this. Pretend an anon account posted it. These are just thoughts I had that I think would make for good conversation.     makercaesar:  No one should feel forced to buy MKR from the compensation, we don’t demand that from the CU either.   The MKR commitment is an opt-in more or less, but any MKR deposited is more or less “gone” for quite some time. It can be a weighting factor.     MakerMan:  weighting to length of time in community   This is one of the ideas I wanted to really get out there. Of course, everyone enters the space at their own pace… but, how much of its history have you been present for? It deserves weight, IMO.   This post was meant as a conversation starter, btw. I invite everyone to treat it as if an anon put it up.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.033333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#6",
                    "likes": "0",
                    "time": "10/07/2022-19:02:23",
                    "content": "It seems to me to be a reaction regarding the recent discussions of which CU are eligible and which are not, or budget reduction, I believe one should not try to fight fire with fire, but rather show why one was appointed as a CU in the first place! Should you not spread joy, however, the forum in terms of budget delegates lately seems like an arena! Do not misunderstand, I think this needs to be played out! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8046875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#7",
                    "likes": "0",
                    "time": "10/07/2022-20:22:57",
                    "content": "I’m not sure what pre-committing MKR would do that vesting MKR compensation wouldn’t, and it avoids a “pay to get paid” model that could look like a scheme ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#8",
                    "likes": "2",
                    "time": "10/07/2022-21:08:18",
                    "content": " Should we require delegates to disclose whale backings?  I agree with having delegates disclose large delegators to the best of their ability. I would love if that was integrated into the UI as well. Right now, there are large wallets that veterans know belongs to a particular party but for more casual users it can be difficult to analyze. This creates an information disparity in the DAO where some people understand the politics a lot better than others.  Based on the model above, should we compensate delegates, in part, with vested MKR?  Your model puts delegates in a golden handcuffs position, where they are encouraged to hang on after they would otherwise leave in order to unlock that vested Maker. That is bad for the protocol.  Should we encourage delegates to stake their own MKR?  This gets interesting. In effect, this would encourage whales themselves to be delegates or to appoint people they trust to be delegates. I am not sure how that would shake out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8846726190476195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#9",
                    "likes": "4",
                    "time": "10/07/2022-22:27:35",
                    "content": "    aburban90:  Should delegate compensation be weighted based on how long they have been in the community?   No, comp should not be linked to this. MKR holders can choose who they delegate to. If they want to delegate to someone who has been here for years, they can. If they want to delegate to someone who is new, they can do that too. Also… just because someone has been here for years doesn’t make them a better delegate. I’ve been here for 3’ish years and many here would say that I suck.      aburban90:  Should we require delegates to disclose whale backings?   This is a no-brainer. Not linked to delegate comp. But still critical for transparency.     aburban90:  Should we encourage delegates to stake their own MKR?       aburban90:  Should we weigh personally staked MKR when compensating delegates?   When I became a delegate, I announced that I do not own any MKR. I am a delegate because I’m interested in getting the DAO to a place where I’d feel comfortable investing my own money into the token. If I can achieve my goals as a delegate, then I will personally invest in MKR. MKR holders have delegated to me because this was compelling to them. Requiring delegates to own MKR personally would rule out people like delegates like me who want to fundamentally change the way that the DAO operates. (Maybe that’s the intention? Not sure. But if not, something to consider.)     aburban90:  Based on the model above, should we compensate delegates, in part, with vested MKR?   Requiring delegates to hold MKR for 6+ years to get their full comp will also change the nature of the delegates that are willing to participate. If the DAO is interested in only attracting delegates that appreciate the current direction of the DAO and is already invested in MKR, then this will work. But if the DAO wants diversity of opinion and wants to retain the ability to attract delegates who are willing to bring new ideas for fundamental change (now or in the future), then the current comp model is the way to go. I know that many reading this may be thinking “Nice! Yes, we only want delegates who agree with us. Get rid of the rabble-rousers.” But keep this in mind - things may not always go the way you want them to go. Whales may shift the balance in a way that you do not like. You may want to get delegates in here that think differently in a year or 3 or 5.  Block this pathway to change at your own peril. The best decentralized systems are the ones that encourage & allow independent ideas & thoughts with merit to rise to the top no matter who or where they come from. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.092532467532468
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#10",
                    "likes": "5",
                    "time": "10/07/2022-22:45:43",
                    "content": "    ChrisBlec:  I know that many reading this may be thinking “Nice! Yes, we only want delegates who agree with us. Get rid of the rabble-rousers.” But keep this in mind - things may not always go the way you want them to go. Whales may shift the balance in a way that you do not like. You may want to get delegates in here that think differently in a year or 3 or 5. Block this pathway to change at your own peril. The best decentralized systems are the ones that encourage & allow independent ideas & thoughts with merit to rise to the top no matter who or where they come from.   +1 to this. I think Hasu has also spoken about this before - we should be trying to find delegates who bring independent expertise and sound decision-making to the protocol. Gatekeeping possible delegates just because they haven’t been around on the Maker forum or don’t own MKR seems like an unnecessary own goal, an impediment to getting the best delegates possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.641666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#11",
                    "likes": "9",
                    "time": "11/07/2022-14:39:29",
                    "content": "Hi Andrew, thanks for posting this. I consider myself pretty familiar with the delegate compensation system and am part of a group comprising members of GovAlpha, SES and SF that are currently looking at changes to the current system. I am also involved in discussions with prospective delegates from time to time. There have been calls from the community and CUs to try and attract “experts” as delegates at Maker. I think a number of the points you’ve raised might actually make this harder if we adopted them. However, feel free to make suggestions, sometimes we find things we’ve missed or haven’t considered. GovAlpha office hours (Mondays 17:00 UTC) are always a good time to come and jam with us about this kind of thing and we can discuss the rationale for why things are the way they are as quite a lot of thought has gone into the current system and into potential changes.     aburban90:  The current incentive structure is broken.   It would be helpful if you could specify what aspects of the current system you consider to be broken and why. I see you’ve highlighted incentive alignment - which I agree is something we can work towards improving; but remember, delegates are already incentivized to work towards MKR holders’ interests, if they don’t then MKR holders can un-delegate and move their MKR elsewhere which will financially impact the delegate.     aburban90:  Weighting for Community Presence   I’m not sold on this idea. As you note, sometimes it is useful for someone who has not been part of the community to bring in new ideas. Especially if we are targeting experts in various fields to come on board. And to some extent, we already do this through the delegate sourcecred instance. Also, some delegates are not one individual, so how do you weigh the community presence of a group of individuals?     aburban90:  Whale Backer Registry       aburban90:  Should we require delegates to disclose whale backings?   A reasonable idea. Although bear in mind that a delegate might not know the identity of a whale that has delegated to them - in which case it’s difficult to be transparent. However, we can look at the blockchain for some clues. And of course, some whales like Rune are open when discussing their delegation decisions. We can see individual breakdowns of delegators per delegate on the voting portal already - here’s an example from Hasu’s page:  image1010×803 50.8 KB  and you can also view a breakdown by delegator if you click on the address - example.  image963×837 70.8 KB  Perhaps a visualization of MKR by address is something we could add to the Governance Dashboard (@hernandoagf).     aburban90:  Skin In The Game To be remotely aligned with Maker’s interests, you should probably own some MKR yourself before considering taking on a delegate role.   Disagree with this. Again, requiring this narrows the pool of potential delegates with minimal gain to MakerDAO. However, the compensation formula already rewards delegates for delegating to themselves. So I don’t really think a change is needed here.     aburban90:  For “full” compensation, I would like to see Delegates put up at least 100 of their own MKR.   This is like 100,000 DAI at current prices, over half a million DAI at ATH MKR price. This is far too high a requirement and essentially makes delegation pay-to-win.     aburban90:  Compensation in MKR I don’t know if this has been discussed, but it does not appear to be part of the current model.   Not part of the current model, but being discussed between relevant CUs. No formal plan as yet, but IMO it should have the following key points:  Based on DAI compensation and trailing MKR price. Similar to the GovAlpha model. Not activated until a Recognized Delegate has completed at least 12 months in the role. If a delegate resigns they are entitled to a pro-rata amount for that year (unless they have not yet completed 12 months in the role) Cliff date of 12 months from stream set-up - incentivize long-term thinking and alignment with MKR holders  It was discussed whether delegates should be able to lock-up with a longer cliff duration for a higher amount of MKR e.g. lock for 2 years instead of 1 and get a 10-25% MKR bonus - not yet formalised but is an option.    However, a key point is that we should not reduce DAI compensation in order to provide MKR compensation. TBH the current maximum compensation level of 144k DAI/year is already too low if you are looking to attract financial or legal experts to become delegates. Reducing the stable portion of compensation and increasing the volatile portion won’t improve this situation.     aburban90:  100% of this MKR is added to the delegate’s voting power.   I don’t think we should do this - delegates can delegate to themselves once it has vested.     aburban90:  This MKR should NOT come from the MKR in our treasury.   Also disagree with this - doesn’t seem fair to the delegates if CUs are able to have MKR vested from treasury funds and they aren’t. Although I agree that DssKiln would be a good tool to buy MKR to replace vested MKR in the treasury generally - perhaps a Kilnv2 that can only buy MKR if treasury dips below a certain amount - although that’s a separate discussion  Happy to chat about any of the above at any time. ",
                    "links": [
                        "https://governance-portal-v2-git-poll-metadata-dux-core-unit.vercel.app/address/0xc0583df0d10c2e87ae1873b728a0bda04d8b660c",
                        "https://www.makerdao-governance-dashboard.com/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.522047760982187
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#12",
                    "likes": "1",
                    "time": "14/07/2022-17:44:14",
                    "content": "Hey @aburban90 - jumping in a bit late here. For Skin In The Game it seems fair and is something we and others already do as delegates. Requiring certain thresholds gets a bit tricky and can get predatory. 100 MKR (~$92,000) is no joke and would deter participation. For compensation weighted based on how long they have been in the community, I vehemently disagree. Many of us  - including myself - were not in crypto a year ago, let alone a specific DAO. By rewarding OGs we will deter talent with new perspectives and tools for thinking about growth. You can - and do learn the values of Maker without having a forum account more than a year old. We appreciate this conversation and hope we can create a framework that continues to encourage and attract some of the top delegates in Web3. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.000270562770562
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#13",
                    "likes": "0",
                    "time": "15/07/2022-15:17:20",
                    "content": "Backing up my ramblings with a bit of data. If you look at MKR holders YoY - they have increased across the board, by 9.63k since last year: Notable areas are:  larger holders (10,001+ MKR) +15.15%  small to mid-size (100-1000 MKR) +29.29    You can see the holders’ trends distributed across different categories below:  For more visualizations of this growth, see here: MKR Holder Stats - Flipside Crypto We hope this growth is leading to more engaged governance participants (such as ourselves) and is a case to encourage and welcome new participants - in the form of delegates and delegators. ",
                    "links": [
                        "https://app.flipsidecrypto.com/dashboard/mkr-holder-stats-jyDGFr",
                        "https://app.flipsidecrypto.com/dashboard/mkr-holder-stats-jyDGFr"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.093181818181818
                }
            ]
        }
    ]
}