{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/new-oasis-app-is-non-functional/7964",
            "title": "New OASIS App is non-functional ",
            "index": 7964,
            "category": [
                "Miscellaneous",
                "Site Feedback"
            ],
            "tags": [
                "oasis"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Somer",
                    "index": "#1",
                    "likes": "1",
                    "time": "10/05/2021-19:39:08",
                    "content": "The new OASIS app is giving me an error and I am unable to access my vaults. This is a serious issue for me, obviously. Details are here: https://twitter.com/SomerEsat/status/1391806132566384641?s=20 ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.128787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Somer",
                    "index": "#2",
                    "likes": "2",
                    "time": "10/05/2021-19:45:08",
                    "content": "For anyone else stuck on this, I found the link to the old site advertised on the new site:    oasis.app    Oasis Borrow Put your assets to work. Maker Vaults on Oasis Borrow make it easy to utilize your collateral by generating Dai against it. Realize liquidity through a Vault and ensure you don't lose long exposure to your collateral.      Seems to work for now. ",
                    "links": [
                        "https://oasis.app/borrow-old"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.774621212121211
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#3",
                    "likes": "4",
                    "time": "10/05/2021-21:57:10",
                    "content": "Update: we have deployed a fix, and you should not run into this issue anymore  Hi @Somer Thanks for your message. I’m sorry you have this issue. We are aware of the problem and are testing a fix right now. In the meantime you can indeed use the old oasis interface, as that’s left unchanged. Find it on: Oasis Borrow The other workaround is to clear your local browser storage and refreshing. To do this try:  Press F12 - That will open the Dev tools Look for a tab labeled Console  Type localStorage.clear()  Press F5 - that will refresh your page  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.368506493506493
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Somer",
                    "index": "#4",
                    "likes": "1",
                    "time": "10/05/2021-22:18:26",
                    "content": "Hello, @Frank_Brinkkemper, I really appreciate the fast response. I went though the steps you provided and they worked fine - thank you very much. The new site is really quite nice, visually. For efficiency, however, I do prefer the the old site. It seems to organize the information in a more readable fashion. This is probably unrealistic, but it would be nice to continue to offer it as a selectable ‘theme’. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.130429292929293
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#5",
                    "likes": "3",
                    "time": "10/05/2021-22:30:06",
                    "content": "We have deployed the fix, and after testing it it seems to be working great now. If you have any issues feel free to reach out to us again. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#6",
                    "likes": "2",
                    "time": "10/05/2021-22:33:51",
                    "content": "Hey @Somer, Thanks for this feedback. This is only the first iteration of this redesign. We will continuously improve this design, so in a bit you won’t want to go back to the old UI ever again  For at least the foreseable future, we will keep the old UI live, but it won’t get updated anymore. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.270202020202021
                }
            ]
        }
    ]
}