{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-january-25-31-2022/12953",
            "title": "Weekly Relay: January 25 - 31, 2022 ",
            "index": 12953,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "4",
                    "time": "01/02/2022-02:38:29",
                    "content": " 2020×545 83.6 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop-shop for MakerDAO updates.  The public PDF version is available here.   Current Events  This Week in Governance  Community Deep Dai-ve  Mark your Calendar  Useful Links  Have Feedback?   Current Events  Parameter Proposal Group Advice to Lower SFs and Rates Across the Board With the outcome of recent events and volatility in the crypto market, it’s important to bring light to today’s Parameter Changes Proposal. As per the Parameter Changes Proposal Post, “Competitive Rates in DeFi have been pretty stable until last week’s crash but have dropped significantly since then as borrowers deleverage their debt positions to protect against getting liquidated or reduce their long exposure in anticipation of bearish market sentiment…Aside from the overall Lending Market changes, there has also been a huge DAI supply through the USDC-PSM.”   1123×635 98.3 KB   In response to the event and subsequent activities mentioned above, the @ppg-omc-001 decided it’s best to propose to lower the rates across the board for non-stable-assets and LP-vault-types to stimulate DAI minting. Below are the proposed changes: (Please visit the original post for more information on these proposed changes)  ETH-A: decrease Stability Fee by 0.25% from 2.50% to 2.25% WBTC-A: decrease Stability Fee by 0.25% from 4.00% to 3.75% ETH-B: decrease Stability Fee by 2.50% from 6.50% to 4.00% WBTC-B: decrease Stability Fee by 2.00% from 7.00% to 5.00% WBTC-C: decrease Stability Fee by 0.75% from 1.50% to 0.75% AAVE-D3M: decrease Target Borrow Rate (bar) by 0.25% from 3.75% to 3.50% WSTETH-A: decrease Stability Fee by 0.50% from 3.00% to 2.50% GUNIV3DAIUSDC1-A: decrease Maximum Debt Ceiling (line) from 500 MM to 100 MM GUNIV3DAIUSDC2-A: decrease Stability Fee by 0.25% from 0.50% to 0.25%, increase Maximum Debt Ceiling (line) from 500 MM to 750 MM, and increase Target Available Debt (gap) from 10 MM to 50 MM UNIV2DAIETH-A: decrease Stability Fee by 1.00% from 2.00% to 1.00% UNIV2WBTCETH-A: decrease Stability Fee by 1.00% from 3.00% to 2.00% UNIV2USDCETH-A: decrease Stability Fee by 1.00% from 2.50% to 1.50% TUSD-A: decrease Stability Fee by 1.00% from 1.00% to 0.00%  If passed, the @ppg-omc-001 anticipate the effect on annualized revenue - assuming stable utilization levels - to decrease yearly revenue by about 6.7 MM DAI. This proposal is currently on-chain until Thursday, February 3rd at 16:00 UTC. Don’t forget to vote!  Pump up the Surplus Buffer or Burn Baby Burn? With the suspense from Flappy Friday slowly dissipating, the community begins to look forward to potential changes to help improve the Maker protocol in the case of similar future events. However, the path forward is yet unclear; a large amount of the community believes that we should significantly increase the surplus buffer, and the others suggest to continue burning MKR. “@hexonaut from the Protocol Engineering Team has drafted a sustainable short-term solution to burn MKR, which introduces rate limiting into the flapper, limiting the number of parallel auctions.” Whether to implement the Rate Limiting Flap is currently up for community vote on the forum and is leading with YES. On the other hand, @krzkaczor from PECU believes that a “big Surplus Buffer fuels future protocol growth by allowing us to get involved in riskier endeavors without risking flop auctions…Maker is in the place where we shouldn’t seek short-sighted gains by burning MKR but rather reinvest in growth. Increasing SB is the simplest way to do that.” Kris establishes fundamental reasoning behind why increasing the Surplus Buffer may eventually increase protocol revenue, which is currently up for discussion and feedback on the forum.   This Week in Governance  MIPs Weekly MIPs Update #72  1120×745 32.6 KB   RFC and FS Dates for reference and existing proposals can be seen here  We are entering a gap week. Formal submission opens up next Monday, February 7th!  Latest Proposals in RFC: This week we had @GFXlabs submit MIP4c2-SP16: Core Unit Offboarding Process Amendments. The offboarding process for facilitators and core units has recently shown a need for improvements. The changes proposed on this MIP attempt to make the process more transparent, orderly, and conducive to substantive discussion. Visit this week’s MIPs update for a detailed view of all the latest proposals in RFC.  Executive Vote Core Unit Budget Transfers and Streams - January 28, 2022 This executive proposal passed, and the following outcomes were executed:  Core Unit DAI Budget Transfers As per multiple successful budget proposals (linked below), a total of 10,070,519 DAI were transferred to several Core Units:     Core Unit DAI Amount Budget Proposal     StarkNet Engineering 229,792 DAI Proposal   TechOps 1,069,250 DAI Proposal   Oracles 6,966,070 DAI Proposal   Oracles 1,805,407 DAI Proposal     Core Unit DAI Budget Streams As per multiple successful budget proposals (linked below), a total of 11,017,146 DAI are streamed to several Core Units over the next 6-12 months:     Core Unit DAI Amount Budget Proposal     Development and UX 1,934,300 DAI Proposal   Sustainable Ecosystem Scaling 5,844,444 DAI Proposal   TechOps 2,486,400 DAI Proposal   StarkNet Engineering 257,500 DAI Proposal    Strategic Finance 494,502 DAI Proposal     Core Unit MKR Vesting Streams As per the Strategic Finance Core Unit successful MKR budget proposal, a total of 480 MKR will be vested to members of the Strategic Finance Core Unit over the next three years:     Core Unit Member MKR Amount     Aes 240 MKR   SebVentures 240 MKR     Revoking Content Production DAI Budget As a result of this successful budget proposal, the Content Production Core Unit budget was revoked. Note that when a token stream is revoked, it will prevent new tokens from accruing to the recipient but will still allow the recipient access to tokens that have already accrued.  Replacing the Real World Finance DAI Budget Stream Given that the facilitator for the Real World Finance Core Unit has changed, we received a request from the new facilitator to adjust the implementation of the existing Real-World Finance DAI budget stream. This request is detailed here. Given that this is an administrative change and budget amounts remain the same, we elected to include it in this executive proposal. The executive proposal passed, and the following occurred:  The existing Real-World Finance DAI budget stream will be revoked. A replacement stream will be set up, streaming 1,705,000 DAI to 0x96d7b01Cc25B141520C717fa369844d34FF116ec starting at 2022-02-01 and ending at 2022-12-31.   Protocol Engineering Housekeeping The on-chain changelog, also known as the chainlog, will be updated to include the CLIP_FAB contract. This proposed change is part of ongoing Protocol Engineering housekeeping efforts and will not directly affect the Maker Protocol.  Active Governance Polls  There are currently no active governance polls. Last week contained 13 governance polls that have all passed.  Check out January 17th’s issue of Weekly Relay for more information on the most recently ended polls.  Community Greenlight Polls     Collateral MIP9 Poll MIP6 Application     STABLE-TBILL Ends 02/07 4PM UTC Application   STABLE-NOTE Ends 02/07 4PM UTC Application    Check out an ‘at-a-glance’ view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests [Signal Request] bring back the MKR burn Signal Request Ends February 4th With the executive vote that was recently scheduled, we are going to have the Surplus Buffer set to 250 MM so no further burning will happen anytime soon (discussion). This has been done as a counteraction of the events of last Friday 5 is meant as a short term fix. @hexonaut from the Protocol Engineering Team already has drafted a more sustainable solution that has the potential to be activated on mainnet soon. This will introduce rate limiting into the Flapper, limiting the number of parallel auctions. However, multiple ideas of replacing the current Flapper have been floating around in the past. In response, @ultraschuppi submits a Signal Request to find out whether the community would like to either (A) do nothing and not burn any more MKR until we have a long term solution in place or (B) introduce Rate Limiting into the Flapper and bring back MKR burning as soon as possible. Offloading TUSD-A Signal Request Ends February 4th A discussion and signal-request submitted over a year ago passed and set the Debt Ceiling of TUSD-A to 0 DAI. Today, there is still about ~26MM DAI of outstanding debt, and the increase of the Stability Fee to 1% has not changed anything. In response, @ultraschuppi offers three options as potential changes to TUSD-A and asks the community whether they want to:  Offload to a new TUSD-PSM with a DC of 0. Activate liquidations on TUSD-A keepers. Keep as is and do nothing.    Community Deep Dai-ve  Tweet of the Week     twitter.com    David Spinks @DavidSpinks  What is the primary objective of a DAO?   Comment with your thoughts.   5:18 PM - 31 Jan 2022           13                3             Forum Insight How to make 320M DAI disappear (aka why Accounting matters) Having inaccurate data can easily lead to poor decisions, which is why the Strategic Finance Core Unit spends a lot of time checking data and trying to understand discrepancies. In a short post of actions and data, @SebVentures shows how someone can make 320M DAI “badly” accounted disappear. Previous discussion around this topic already exists. If you’re interested in the details of how the Strategic Finance Core Unit was able to showcase the flaw in data, check out the original post! Also, Check out the latest Forum at a Glance for additional forum insight.  Articles   Ethereum Money Markets See Record Liquidations as Ether Tanks; MakerDAO Revenue Surges  …As the cryptocurrency fell by over 14% on Friday, its most significant single-day drop in seven months, it triggered liquidations of collateral locked in prominent Ethereum-based lending and borrowing protocols, also referred to as decentralized money markets. At the same time, some of these decentralized finance (DeFi) applications made a handsome amount of money through liquidation fees.   Ethereum money markets AAVE, Compound, and MakerDAO processed a total of $200 million of liquidations on Friday – a record single-day tally – with MakerDAO accounting for more than half, data from Dune Analytics shared by Delphi Digital show. Typically, these DeFi protocols see less than $10 million of daily liquidations…      Meetings and Events  Last Week’s Call Recordings  Governance and Risk Call #176   Forum | Video      This Week’s Calls  Focus On #4: RWF Restructuring | February 2, 2022 7:00 PM UTC   Forum | Join Call - Password: COREUNIT      Governance & Risk   Join Link | Agenda - Thursdays at 16:00 UTC   Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Content Production - Wednesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC    Useful Links Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for Stakeholders; Protocol analytics, Dai analytics, collateral & liquidation metrics, governance history, and auctions data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs Dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is purely for information and communication purposes only. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2022-01-27/12883",
                        "https://vote.makerdao.com/polling/QmWReBMh?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/flappy-friday-clip-and-flap-analysis/12790",
                        "https://forum.makerdao.com/t/in-defense-of-bigger-surplus-buffer/12875",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn/12837",
                        "https://github.com/makerdao/dss/pull/244",
                        "https://forum.makerdao.com/t/weekly-mips-update-72/12945",
                        "https://docs.google.com/spreadsheets/d/10qxaRjm9T5LCgnYwwYqPqEjKu9yl2F1YHqdDD5SktJc/edit?usp=sharing",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-transfers-and-streams-january-28-2022?network=mainnet#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP47",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP29",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP53",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP13",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP45",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP13",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP45",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP18",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP52",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP10",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP55",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP29",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP53",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP47",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP27",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP46",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP49",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP5",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP1",
                        "https://mips.makerdao.com/mips/details/MIP41c4SP27",
                        "https://forum.makerdao.com/t/rwf-001-auditor-flow/12900",
                        "https://chainlog.makerdao.com/",
                        "https://forum.makerdao.com/t/weekly-relay-january-11-17-2022/12699",
                        "https://vote.makerdao.com/polling/Qmdf2bbL?network=mainnet",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-stable-us-treasury-securities-up-to-12-months-duration/12503",
                        "https://vote.makerdao.com/polling/QmUXDkKr?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-stable-us-treasury-securities-between-2-and-10-years-duration/12505",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn/12837",
                        "https://vote.makerdao.com/executive/template-executive-vote-temporarily-prevent-surplus-flap-auctions-and-mkr-burn-january-24-2022?network=mainnet#proposal-detail",
                        "https://manual.makerdao.com/parameter-index/core/param-system-surplus-buffer",
                        "https://forum.makerdao.com/t/urgent-signal-request-stop-mkr-burning/12806",
                        "https://forum.makerdao.com/t/flappy-friday-clip-and-flap-analysis/12790",
                        "https://forum.makerdao.com/u/hexonaut",
                        "https://github.com/makerdao/dss/pull/244",
                        "https://forum.makerdao.com/u/ultraschuppi",
                        "https://forum.makerdao.com/t/signal-request-offloading-tusd-a/12814",
                        "https://forum.makerdao.com/t/tusd-is-undergoing-a-material-change-to-its-ownership-structure-is-there-a-process-for-reducing-exposure-in-the-event-of-a-material-change/5691",
                        "https://forum.makerdao.com/t/signal-request-manage-tusd-exposure-due-to-ownership-change/5821",
                        "https://forum.makerdao.com/u/ultraschuppi",
                        "https://twitter.com/DavidSpinks/status/1488200103202476035?s=20&t=8EzvX5UbS3GssbKR7XwZMA",
                        "https://twitter.com/DavidSpinks/status/1488200103202476035?s=20&t=8EzvX5UbS3GssbKR7XwZMA",
                        "https://twitter.com/DavidSpinks/status/1488200103202476035?s=20&t=8EzvX5UbS3GssbKR7XwZMA",
                        "https://twitter.com/DavidSpinks/status/1488200103202476035?s=20&t=8EzvX5UbS3GssbKR7XwZMA",
                        "https://forum.makerdao.com/t/how-to-make-320m-dai-disappear-aka-why-accounting-matters/12940",
                        "https://forum.makerdao.com/t/makerdao-accounting-and-implications/5346",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://www.coindesk.com/markets/2022/01/25/ethereum-money-markets-see-record-liquidations-as-ether-tanks-makerdao-revenue-surges/",
                        "https://forum.makerdao.com/t/governance-and-risk-176-thursday-january-27-17-00-utc/12853",
                        "https://youtu.be/SDd6ndcIy9A",
                        "https://forum.makerdao.com/t/focus-on-4-rwf-restructuring/12943",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://us02web.zoom.us/j/7091120339?pwd=ek9XQWV0c0FJSCt2MHcwWmpWYkd3UT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-25-al-31-de-enero-de-2022/13007",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-jan-31-feb-11/13198"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.678499210689061
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "03/02/2022-14:44:15",
                    "content": "    Artem_Gordon:  Revoking Content Production DAI Budget As a result of this successful budget proposal, the Content Production Core Unit budget was revoked. Note that when a token stream is revoked, it will prevent new tokens from accruing to the recipient but will still allow the recipient access to tokens that have already accrued.   I am sad about this, honestly the team was committed in all aspects. We just have to move forward      Artem_Gordon:  Tweet of the Week    From my point of view protecting the protocol or creating the best destination for it, is for me the main goal, consensus should be the union of the best future of Maker. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP39c2SP5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9706439393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/02/2022-14:44:47",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}