{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-makerdao-treasury-of-tokens-originated-outside-maker-protocol/7678",
            "title": "[Discussion] MakerDAO Treasury of Tokens Originated Outside Maker Protocol ",
            "index": 7678,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "6",
                    "time": "27/04/2021-13:18:22",
                    "content": "With the likely (or so I hope!) passage soon of MIP50 and at least the potential for other assets from Maker Foundation activities, I think it’s smart we begin thinking now about how the DAO should handle outside tokens. To some extent this is a hypothetical, but it’s better to let people throw out their ideas and let it marinate when we’re not in a hurry. My own (non-binding, totally changeable) initial thoughts are that the DAO should not use any acquired tokens for involving ourselves in governance of other protocols. For one thing, our own governance is still somewhat rickety from what I’ve seen, and until we can operate our own structure without Twitter blasts and pleas for votes, we shouldn’t further entangle ourselves in other protocols and all the bandwidth just being up to date would consume. Obviously this may change as things like delegation become a reality. The other is whether we want to embrace our de facto position as a (de)central bank. If so, we should focus solely on our own currency, as we will live/profit and die/lose money by the health of the DAI supply and circulation. Becoming governors/equity holders of other protocols will force us sooner or later to make a decision that’s either bad for DAI or bad for a protocol we are vested in. I think both as a practical matter and to keep the DAI’s image untarnished, we need to avoid getting involved in what will be seen as market manipulations beyond what is necessary to secure the supply of DAI. Assuming you agreed with what I just wrote above, what would be the next step? I don’t know if we’d just want to sell any tokens into the market and pocket the proceeds. Maybe? Or perhaps there is room for a fund that takes an active role in other protocols as both a steady hand and a friendly ally? In which case we should spin off that fund as a separate entity that begins with the same ownership (just airdrop a token for that fund to current MKR holders). Common ownership somewhat negates the argument for this course of action if you share my concerns above, but it’s at least a degree of separation (optics matter) and over time the common ownership won’t be exactly the same as people buy/sell into both Maker and any spun-off entity. As stated, I am super open to hearing what other people think about this and reserve the right to dramatically change my mind. But we should think about this before we wake up in 6 months or a year with a bushel of AAVE or WORK or other tokens we might incidentally acquire. That way we can avoid arguments over a windfall of treasure and have a plan that will set everyone’s expectations ahead of time, regardless of what route we want to go. ",
                    "links": [
                        "https://opolis.co/coalition/"
                    ],
                    "GPT-summary": "The author of the post is proposing that the DAO should consider how to handle outside tokens, and shares their initial thoughts on the matter. They suggest that the DAO should not use acquired tokens to involve themselves in governance of other protocols, and instead focus on their own currency. The author invites feedback and suggestions from others on how to proceed.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.1054964539007095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#2",
                    "likes": "1",
                    "time": "27/04/2021-13:45:55",
                    "content": "Just some thought as I went through this exercise for MIP33 with comp. First thing to be cleared, We are not going to be a major holder, so voting is pretty useless. I found 3 ways : 1 / We can still move it and hold it into a sort of wallet ( MIP 36) 2 / sell it using uniswap ( easy way I believe) I preferred to use the dai poll to stimulate the dai pair even if it is not the best way. 3 / we can create our own poll bonustoken/dai to allow a sort of liquity liquidation poll (MIP 31) and get some fees on the exchange. MIP 33 uses a delegator that can be changed at anytime via governance, I believe that need to be implemented too. We may change our mind in 3 months time. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-45/9427",
                        "https://forum.makerdao.com/t/weekly-mips-update-44/9303",
                        "https://forum.makerdao.com/t/weekly-mips-update-43/9190",
                        "https://forum.makerdao.com/t/weekly-mips-update-42/9010",
                        "https://forum.makerdao.com/t/weekly-mips-update-41/8892",
                        "https://forum.makerdao.com/t/weekly-mips-update-40/8759",
                        "https://forum.makerdao.com/t/weekly-mips-update-39/8606",
                        "https://forum.makerdao.com/t/weekly-mips-update-38/8486",
                        "https://forum.makerdao.com/t/weekly-mips-update-37/8309",
                        "https://forum.makerdao.com/t/mips-update-36/8125",
                        "https://forum.makerdao.com/t/weekly-mips-update-35/7962"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.49702380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "27/04/2021-13:53:47",
                    "content": "Kind of keying off your trichotomy, step one might be do we want to think of any tokens as equity holdings for appreciation/governance or treat them as additional income-producing assets? If the latter, I can see it as entirely appropriate to keep them within the DAO and then just a matter of implementation ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/04/2021-14:25:43",
                    "content": "I would resume it : 1 / we hold 2 / we sell 3 / we use the token as uniswap. The 3/ is a bit tricky as we are currently all in liq2 solution. But if we have our own poll we can get direct input from the market before the others, for example closing the vault if we have a 20% drop, selling bad debt just before the poll get updated etc … ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "0",
                    "time": "27/04/2021-17:43:08",
                    "content": "    PaperImperium:  I think it’s smart we begin thinking now about how the DAO should handle outside tokens. To some extent this is a hypothetical, but it’s better to let people throw out their ideas and let it marinate when we’re not in a hurry.   Are you referring to Liquidity Mining, and/or airdrops of other Tokens–how will the DAO handle the usage of such? Or, what if the DAO has a VC Core Unit that invest in future protocols and the DAO receives tokens? As an example the Foundation helped bootstrapped a lot of protocols that are now prospering.     PaperImperium:  For one thing, our own governance is still somewhat rickety from what I’ve seen, and until we can operate our own structure without Twitter blasts and pleas for votes   Yes, this can get tiring–and it can also be a big turn-off. Delegation can’t come soon enough.     PaperImperium:  we shouldn’t further entangle ourselves in other protocols and all the bandwidth just being up to date would consume.   I do think it’s important to keep up with developments in this ecosystem-as you can see, things move very quickly here. You fall asleep and you’re pretty much behind. And as you know, Ideas have to achieve escape velocity. I once heard say somebody (can’t remember) say “Ideas/Innovations have to break free of the present and that requires consistency of direction”–IMO, without knowing where this ecosystem is headed, we might get lost in translation. Just my 2 gwei ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7632275132275135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "1",
                    "time": "27/04/2021-18:25:02",
                    "content": "    flipflopflapdelegate:  Are you referring to Liquidity Mining, and/or airdrops of other Tokens–how will the DAO handle the usage of such?   Most immediately, I’m referring to any AAVE tokens we would get as a byproduct of enacting MIP50 (if it passes). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.625
                }
            ]
        }
    ]
}