{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/vote-delegation-ui-release/9646",
            "title": "Vote Delegation UI Release ",
            "index": 9646,
            "category": [
                "Governance"
            ],
            "tags": [
                "governance-portal",
                "voting-portal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bainpm",
                    "index": "#1",
                    "likes": "29",
                    "time": "02/08/2021-18:00:05",
                    "content": "The DUX core unit is happy to share the soft-launch release of the voting delegation UI in the Governance Portal! As always we welcome your feedback or bug reports. The initial forum discussion describing voting delegation can be found here: https://forum.makerdao.com/t/delegation-and-makerdao/9429  Features released   Addition of the delegates page https://vote.makerdao.com/delegates   Ability to delegate and undelegate MKR into a delegate’s contract   Recognize a wallet’s delegate contract   Ability to vote as a delegate   Creation of delegate’s profile page   Dark mode   ENS name resolver (for accounts only)    Technical diagram  Untitled1408×783 87.2 KB   Known issues When you become a delegate, you can only operate as a delegate. You will not be able to vote with a vote proxy, for example. In the future, we will add capabilities for switching between your delegate and your normal account, but for now, this is limited in the UI. Of course, managing via the smart contract access is still possible.  Upcoming Releases In upcoming releases, the following features will be implemented:   Filtering and sorting of delegates   Inclusion of last voted date by a delegate   Navigate easily between delegates profile pages   Improving delegate profile information   Dynamic participation metrics   Export profile information   Testnet migration to Goerli from Kovan    Additional links   Release notes: https://dux.makerdao.network/Vote-Delegation-fd4779acd1ca4da78d12d4fda3a8dd5a   Support and feedback: https://discord.gg/AQwb5Sjncu   Governance Portal public roadmap: https://makerdao-dux.frill.co/roadmap   Verifying a delegated contract on Etherscan: https://www.notion.so/Verifying-a-delegate-contract-on-Etherscan-df677c604ac94911ae071fedc6a98ed2   ",
                    "links": [
                        "https://makerdao-dux.frill.co/b/6m4kow04/makerdao-governance-uis-featur",
                        "https://discord.gg/HTKd5cgh",
                        "https://forum.makerdao.com/t/delegation-and-makerdao/9429",
                        "https://vote.makerdao.com/delegates",
                        "https://www.notion.so/Vote-Delegation-fd4779acd1ca4da78d12d4fda3a8dd5a",
                        "https://discord.gg/AQwb5Sjncu",
                        "https://makerdao-dux.frill.co/roadmap",
                        "https://www.notion.so/Verifying-a-delegate-contract-on-Etherscan-df677c604ac94911ae071fedc6a98ed2",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-30th-august-5th/9708",
                        "https://forum.makerdao.com/t/maker-relay-ep-56/9649",
                        "https://forum.makerdao.com/t/mip39c2-sp18-adding-development-ux-core-unit-dux-001/9770",
                        "https://forum.makerdao.com/t/maker-relay-ep-56-en-espanol/9812"
                    ],
                    "GPT-summary": "The DUX core unit has released the soft-launch of the voting delegation UI in the Governance Portal. The post provides a list of features that have been released, known issues, upcoming releases, and additional links. The author is asking for feedback and bug reports, and there is a link to a forum discussion describing voting delegation.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.798941798941799
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "10",
                    "time": "02/08/2021-19:20:40",
                    "content": "Thanks to all of you for your hard work over the past months! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.326388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#4",
                    "likes": "7",
                    "time": "02/08/2021-19:32:44",
                    "content": "And congrats with the first release as the new DUX team!  The first one is the most challenging :). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.808712121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "5",
                    "time": "03/08/2021-13:32:06",
                    "content": "I get lost for a couple of days in the forum, and I see this beauty displayed, how great, really leaves me super impressed, you are a tremendous team, keep it up.      ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#6",
                    "likes": "4",
                    "time": "03/08/2021-14:46:30",
                    "content": "Incredible work, thank you for putting so much effort into this.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#7",
                    "likes": "9",
                    "time": "04/08/2021-08:05:18",
                    "content": "Thanks DUX, it looks amazing! Is it possible to have an additional feature? Many MKR holders will never bother to read the Delegate Profiles or listen to interviews. They just want to delegate quickly and go on to do other things. This will especially be the case if delegation is ever incentivized. To assist this group while preventing randomness I would like the following feature: Neutral Delegate: The neutral delegate option is just like another delegate except that any MKR delegated is divided evenly amongst the other delegates. This prevents lazy MKR holders from making a mess of the delegation process by just randomly selecting someone from the list. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.253472222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "1",
                    "time": "04/08/2021-10:03:55",
                    "content": "    Planet_X:  To assist this group while preventing randomness I would like the following feature: Neutral Delegate: The neutral delegate option is just like another delegate except that any MKR delegated is divided evenly amongst the other delegates.   Neat idea Planet! Might make life easier for some folks. Let’s see what Gov Alpha thinks–or, if some in the community think arbitrariness can be risky (thinking out loud) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.90625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#9",
                    "likes": "5",
                    "time": "04/08/2021-13:58:49",
                    "content": "Is an interesting idea. Is something that should be designed carefully because there are some edge cases.  The neutral delegate / or community vote, would not distinguish from recognized or shadow delegates. Because at smart contract level, all are the same. The amount should be distributed proportionally to the actual amount of MKR that those delegates already have. MKR can not be distributed evenly among all delegates because anyone could exploit this by deploying many new delegate contracts. The neutral delegate contract would be specially complicated for executive votes, because there are scenarios where the amount of MKR in the neutral contract would change between a delegate staking in an executive and the next delegate staking. So, it could impact differently on different votes. If the MKR was to be distributed among the delegates, that would mean paying a lot of transactions and that would be expensive. The alternative would be having a contract that votes proportionally to what all the MKR delegates are voting (based on their MKR amount). That also would be expensive to do and has edge cases.  Probably the best idea is to delegate your MKR in 3 or 4 different delegates if you are not very sure about what to vote on. If we had the governance layer on L2 it could be cheaper to do, but it is still pretty complicated. Probably people from the PE core unit can explain more about this.   Thanks for putting the idea on the table, we added it to our list of things to think about ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.173960414585414
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "04/08/2021-15:39:01",
                    "content": "    rafinskipg:  The neutral delegate / or community vote, would not distinguish from recognized or shadow delegates. Because at smart contract level, all are the same.   The front end knows which are which though, and the front-end constructs the transaction. Feels like it could handle this?     rafinskipg:  The amount should be distributed proportionally to the actual amount of MKR that those delegates already have. MKR can not be distributed evenly among all delegates because anyone could exploit this by deploying many new delegate contracts.   If we can lock it to Recognised Delegates, this is not a problem.     rafinskipg:  The neutral delegate contract would be specially complicated for executive votes, because there are scenarios where the amount of MKR in the neutral contract would change between a delegate staking in an executive and the next delegate staking. So, it could impact differently on different votes.   Oh! I see the confusion now, you’re imagining there would be a neutral ‘forwarding / management’ contract. I was picturing this without a contract, and just the UI splitting some MKR between x delegates.     rafinskipg:  If the MKR was to be distributed among the delegates, that would mean paying a lot of transactions and that would be expensive.   Yeah, this was my concern as well. The more divisions, the higher the cost.  I wonder if it would make sense to have buttons that do something like: “Split my MKR equally between the three lowest-weight recognised delegates (with metrics > x, not expiring in a month?)” “Delegate my MKR to the lowest-weight recognised delegate (with metrics > x, not expiring within a month?)” Feels like that is maybe as close to lazy-safe as we can get? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.110826673326674
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Katie",
                    "index": "#11",
                    "likes": "2",
                    "time": "05/08/2021-04:35:12",
                    "content": "Looks great, super smooth UI!  Great job you guys  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.041666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#12",
                    "likes": "0",
                    "time": "06/08/2021-06:49:00",
                    "content": "    bainpm:  Maker Governance - Delegates   Thanks! This is very exciting! Well done! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1484375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "05/11/2021-12:49:03",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}