{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/why-are-you-passionate-about-maker/12194",
            "title": "Why are you passionate about Maker? ",
            "index": 12194,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#1",
                    "likes": "36",
                    "time": "14/12/2021-11:35:32",
                    "content": "Now that we’re nearing the end of the year, it is also the perfect time to reflect. A lot of new people have joined Maker in the past year, and this made me very curious to hear the different reasons for why people are passionate about Maker. I believe that sharing the reason for your passion to the community can help the DAO understand its own mission better, and help it become a better force in fulfilling that passion to the fullest. So however long or short you have joined the MakerDAO community; Why are you passionate about Maker? ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-9-16-2021/12240"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9193181818181815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "23",
                    "time": "14/12/2021-14:42:24",
                    "content": "Love this thread idea  we did a similar reflection at the last GovAlpha team meeting for the year. There are so many reasons for me. Maker falls at this brilliant intersection of my love of finance and governance systems. We dream big here. As @twblack88 once said (sorry for the terrible paraphrase) it wasn’t enough to revolutionize finance, we also sought to redefine the workforce. Everyday I wake up excited to get to work because I feel what I’m doing here has a huge impact on the future. The people in our community are some of the smartest and most patient I’ve encountered in the space. I have found true joy here and it’s my hope I can help maintain the ethos so anyone can fall into Maker just as easily as I did. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9884259259259265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "20",
                    "time": "14/12/2021-15:43:09",
                    "content": "I started to work for Maker starting November of 2018. It’s simple for me. It takes weeks and more than 20 papers to get a collateralized loan in my country. On Maker platform, it takes just few clicks and I can pay back whenever I want. It’s indeed revolutionary and efficient, and I like efficiency  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makerburn",
                    "index": "#4",
                    "likes": "21",
                    "time": "14/12/2021-15:58:16",
                    "content": "I just really love the burn mechanic  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#5",
                    "likes": "9",
                    "time": "15/12/2021-02:06:30",
                    "content": "    prose11:  As @twblack88 once said (sorry for the terrible paraphrase) it wasn’t enough to revolutionize finance, we also sought to redefine the workforce.   yep, this sums it up more articulately. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "21",
                    "time": "15/12/2021-03:24:33",
                    "content": "I met this protocol named MakerDAO when I was seventeen years old And what I loved most, “She” had so much soul. She was old school when I was just a newb Never knew throughout my DeFi life she would be there for me On the regular, Not a church girl, she was secular. Never about the money, While those Black Thursday zero-bids were front-running her, I respected her. Then the community hit me in the heart A few Degens had mistreated her in the Ethereum park But she was there for me, and I was there for her Pull out a chair for her, turn on the air for her And just cool out, cool out, and listen to her. Sittin’ at home, wishin’ that Maker could make it Eventually if it was meant to be, then it would be 'Cause we related, emotionally and mentally And she was fun then, I’d be geeked when she’d come around MakerDAO was fresh, yes even then, when it was underground. Original, pure, untampered, a down DeFi Soul Boy, I tell you, I love her.        ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.886069340016709
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#7",
                    "likes": "5",
                    "time": "15/12/2021-06:33:41",
                    "content": "I like the name I like the idea, locking collateral and minting stablecoin, which opens up any possibility in DeFi I like that it aligns with Ethereum ethos I like that it is a quality project, and it focuses on quality rather than quantity I like that the team knows what is good for the protocol, and all decision made is for the good of the protocol. I am really a Maker fans ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#8",
                    "likes": "8",
                    "time": "15/12/2021-08:18:46",
                    "content": "Thanks for the responses thus far  I’ll also answer myself: At EthCC 2018 I saw a presentation by Rune on Maker, and right then and there I was like: 'WOW, alright, (1) these people get it and are fifty steps ahead of the competition. (2) This is the first presentation of an application on Ethereum that actually makes a lot of sense. From that moment I started following Maker. The year later @Gustav_Arentoft was sitting ever so confidently next to Stani at a panel to shill Multi Collateral Dai. Again my mind was blown. Now, I truly believe that Maker is making an impact on central bankers, where they are starting to see a counter-power in the world. I don’t necessarily see Maker overtaking the full fiat system anytime soon, but I strongly believe that it is balancing the powers of the (central) bankers. We are skewing the scale towards a more democratized financial system. That’s why I’m passionate about Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.602513227513227
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jenn",
                    "index": "#9",
                    "likes": "9",
                    "time": "15/12/2021-17:10:07",
                    "content": "My impression of Maker hasn’t changed since I joined a few years ago, it has some of the smartest and most talented people working on it and continues to be a pioneer, never compromising on its commitment to develop and release only the highest quality tech. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#11",
                    "likes": "19",
                    "time": "15/12/2021-18:04:55",
                    "content": "Love the idea @Frank_Brinkkemper  I’ll share my perspective as well. I think the reason why, even years down the road, I’m still as excited and fascinated about crypto and DeFi is rooted in the way I perceive modern society. I believe that ‘money’ as a social construct ended up becoming the most powerful and widespread coordination mechanism of mankind, even more powerful than religion! The notion of reinventing money in a digital-native manner—inspired by the ways in which the traditional financial system is fundamentally flawed—it just feels like a very relevant movement to immerse oneself in. Also it sure does help that this industry is such an intellectual wormhole that keeps feeding and rewarding curiosity  Besides Maker being one of the pillars of DeFi, the recent discussions about its future and mission has definitely kindled some kind of extra fascination and motivation specific to Maker. Let me elaborate; I’m a very skeptical person when it comes to solving the global coordination problems humanity faces (eg. climate change), but I’m a BIG believer of the efficacy of financial incentivization mechanisms using novel kinds of ‘money’. The notion of aiming DeFi’s/web3’s novel coordination mechanisms on the single most important and widespread coordination problem mankind has ever faced—well, that’s just incredibly exciting. The feeling of (even slightly) contributing to such an initiative and being part of that movement has summoned a driving force from within me that I don’t see fading anytime soon. So yeah, grateful to be around here  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.927894491129785
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#12",
                    "likes": "6",
                    "time": "15/12/2021-19:32:49",
                    "content": "For me, it’s simple: in the crypto space, Maker was the first project I invested some money in, and although many smaller/bigger/better/worse projects have come and gone since then, emotionally the first one will always be the first one. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MightyOx",
                    "index": "#13",
                    "likes": "5",
                    "time": "16/12/2021-13:15:54",
                    "content": "I’m passionate about Maker because it’s one of the original and hardest working communities in crypto. Like others said, we’re revolutionizing finance, working organizations, and even environmental impact of tech with things like clean money. There’s a lot of work to be done and I know the people here share the same passion to bring us to the next level.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.691666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#14",
                    "likes": "24",
                    "time": "16/12/2021-13:25:51",
                    "content": "Cuz Maker saved my life. I started at Maker in 2018 during one of the hardest economy moments in Vzla, in Maker I earned my first DAIs just for doing translations, in that time I get to understand DeFi, it just opened a whole new world for me. These first earnings allowed me to continue in university and stopped me to look for a job in other countries in Latin America, thanks to Maker I was able to remain here with my family and doing the things I like. Also, seeing Maker growing from SAI to MCD and now this whole new structure of the Core Units, from my perspective is even utopian, like a dream seeing all this achievements. I love Maker cuz it showed me the path to a bright future, not just for me but for all the ppl over the world, Maker shows that we can really change peoples lives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.210664335664335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#15",
                    "likes": "11",
                    "time": "16/12/2021-14:48:51",
                    "content": "My reasons are a mix of so many shared above.  Back when I was just starting to invest in crypto, ETH subprojects were very interesting to me and Maker was one of the very few that had the fundamentals of a good potential(at the time) business down. Redesigning financial infrastructure to be better for end-users, scalable globally, and decentralized, struck me extremely interesting and beneficial to human society. The joy of engaging with some extremely smart and hard-working individuals. The culture of sticking to the issues and figuring out the smartest way forward. The unrelenting focus on risk management as well as the original code security roadmap. I was very impressed by the formal verification work that was being done for the core contracts. The level of passion within the folks working on it was unmatched. They kept letting me hang and do work I thought was impactful (thanks @rich.brown)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.427297410192146
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#16",
                    "likes": "17",
                    "time": "16/12/2021-21:51:46",
                    "content": "Thanks for starting this thread Frank. I originally joined MakerDAO to learn more about the project as an investor, but as I got to meet more and more members of the community and think of how the project could look 5+ years from now, I couldn’t help wanting to go all-in working for the DAO. The first online crypto community I was introduced to was the cryptocurrency subreddit so my expectations for the MakerDAO forums were initially quite low. I was pleasantly surprised by the culture and professionalism in the MakerDAO community, one that fostered true intellectual discussion and discourse, openness where anyone in the community can work on a proposal and have it passed through Governance as long as the idea and proposal are strong enough. A community that seeks to generate real value for the real world, rather than YOLO into the next sh!tcoin (well, excluding @aburban90 at least) A few factors that led me to joining the DAO:  Working on the cutting edge of technology and finance (DeFi and Blockchain Finance) Pioneering a completely new way of working (DAOs) Ability to make a significant impact and add substantial value by building financial rigor and structure - I came from a $250B+ market cap company and making a true impact at that scale is like steering the Titanic Supporting the future of clean and sustainable energy financing - I truly believe this is the largest problem humanity faces Having a large bag of MKR and tremendous financial upside if it succeeds   image457×615 75 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.856872294372294
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#17",
                    "likes": "5",
                    "time": "17/12/2021-10:12:45",
                    "content": "Love the idea that we are shaping the future here. It is a beautiful sensation to feel part of something potentially capable of transforming the world and that will have a huge impact on the lives of many, many people. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.107142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#18",
                    "likes": "9",
                    "time": "17/12/2021-14:25:01",
                    "content": "I personally love MakerDAO because,  It is a project at the intersection of economics/finance and computer science, with ramifications in (geo)politics!  → A lot to learn! community members from several countries is the world, generally extremely knowledgeable, polite and welcoming.  → Many opinions and different viewpoints. It allows me to learn so many new things (little-)steps by step. Being a MKR holder helps giving me a sense of “stake in the game” in the learning process.  → Learning + Speculation = FUN It’s exciting to be around a project that could become (crazy-)huge in the next few years while it is still sufficiently small (~ https://en.wikipedia.org/wiki/Dunbar’s_number) to enjoy the presence of each single community member.  → Current community size gives a feeling of belonging (or at least being in touch) to some explosive underground culture, a.k.a., Maker mafia.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4621132543926665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#19",
                    "likes": "10",
                    "time": "17/12/2021-22:33:52",
                    "content": "It seems to me that we all feel something similar about this, which might be something like this:  image_d998e7c1-19fa-4ffe-b300-0a8d98d5737320211214_231000510×510 59.5 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#20",
                    "likes": "8",
                    "time": "18/12/2021-17:47:26",
                    "content": "It all starts by giving context of where I am from and where I come from, I am from Caracas the capital of Venezuela, I am 20 years old and all my life I have lived under the political model that has brought to my country, restrictions, hyperinflation, etc… The economy was prosperous before, but the country since 2014 fell into an economic crisis, the currency loses value every day and you have no other way to safeguard your income and continue in your daily life. Since then all Venezuelans have used different methods to safeguard our money. So I met this wonderful world of cryptocurrencies, back in 2017 when I was in high school and I saw the opportunity to spread this knowledge with people, beyond the fact that they did not understand I tried to explain to them that this was the future, that cryptocurrencies would somehow change the world. Obviously the first crypto I met was BTC along with all the other cryptos, I gave lectures in universities and various parts of Venezuela about cryptocurrencies, I worked with great friends in one of the largest stores in Venezuela (Traki) for the adoption of cryptos in their stores, I was an analyst and advisor. Then came the opportunity to be an ambassador of Dai in Vzla, an experience that I enjoyed to the end, where I created educational material, videos, about this whole world. So I fell into the rabit hole of MakerDao, DEFI, etc, I am very passionate about decentralization, how this can help everyone, the DAO a form of community governance where you bet on the creation of a common destiny. I also appreciate very much what DAI is as a concept a stablecoin, free without censorship that anyone can use, also backed by cryptocurrencies which makes it the most transparent stablecoin in the market, I think this is valuable in itself.  I am still contributing in Maker writing some calls for GC and in general translating content to Spanish in the forum. Thank you Maker and thank you DAI for everything you have given me in my life.  Some points I want to mention:  The MakerDAO community is amazing. The people I have met thanks to Maker are amazing.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.921120689655172
                },
                {
                    "author_link": "https://forum.makerdao.com/u/manomad",
                    "index": "#21",
                    "likes": "1",
                    "time": "18/12/2021-20:58:30",
                    "content": "I recently joined Maker, my passion is still a little baby but it grows every day. I can only say that passion here is contagious, and seeing everyone’s commitment and the joint effort to take Maker to the next level is just great. Great question @Frank_Brinkkemper  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.177083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#23",
                    "likes": "6",
                    "time": "22/12/2021-00:09:19",
                    "content": "So I love this posts, I’ve been around maker since 2019 so perhaps I will emphasize what I valued most in comparison to traditional organizations   Almost full transparency (except when there are NDAs), you can follow up on every matter of the protocol 24/7 and have access to amazing data, just looking at a DAO going full operational this year was amazing   Diverse, extremely skilled and open minded individuals at the forefront and backline of the DAO development, the culture fostered by people within maker is truly one of the most attractive ones that benefit innovation and constructive criticism, I dare say that it’s ethos is it’s biggest asset together with dai, you can fork a protocol but you cannot fork a community.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.136363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tobalgarcia",
                    "index": "#24",
                    "likes": "6",
                    "time": "27/12/2021-18:22:16",
                    "content": "Maker is a social, monetary and technological innovation. What passionates me the most is its capacity to run a complex economic system while coordinating very talented people accross a DAO. In short, it is possible because of Governance, and that’s the thing I like the most of Maker, and for me, that’s the fact I think will be a very disrupt reality for the future of humanity. Coordinating a great team in a decentralized way to achieve a specific goal that impacts everyone’s wellness, this is Maker for me  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.184722222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/keepitsurreal",
                    "index": "#25",
                    "likes": "1",
                    "time": "28/12/2021-01:36:10",
                    "content": "It simply works. It’s the first of its kind. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#26",
                    "likes": "9",
                    "time": "08/01/2022-00:16:12",
                    "content": "I recently met Maker and I belive what I am most passionate about is the infinite amount of possibilities that derive from the concept, because we are talking about an idea that implies many other ideas. First it has an economic base where we see how transactions are returned in a stable environment, it also has elements of sociology, because we can see how masses behave around common projects and decision making. We also see the philosophy of this proposal, because not everyone thinks the same way about how to get things done. I am from Venezuela, and the last few years have been difficult, that makes you appreciate things more and know how to pay attention to details. Thinking about this, I got the idea that perhaps this project has many similarities with taking the reins of a mini country at scale, where people have to decide what direction to take and how to solve the problems that are arising, it is something really incredible, I even think that a model similar to Maker could be the basis of an electoral system around the world, to choose presidents and governors. Even further, it could be implemented to practice a system of direct democracy, where the community reaches consensus on what is actually going to be done without limiting itself to choosing only leaders. Every time I think more about Maker, I see how more doors are opening and that really exites me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.557291666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/synesthesia",
                    "index": "#27",
                    "likes": "6",
                    "time": "12/01/2022-08:52:42",
                    "content": "I’ve been long interested in what the future of work would look like and in recent years it became quite obvious the world of work is moving towards hierarchy-agnostic and decentralised. With Maker I’m also uniquely getting a sneak peek into the future of economy. Plus it’s being built by some of the most brilliant folks I’ve ever met in my life. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.097222222222223
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davio",
                    "index": "#28",
                    "likes": "3",
                    "time": "12/01/2022-20:23:40",
                    "content": "Frank–I heard that you want to be a delegate.  Do you have time to talk?  I’d like to find out where you stand on different issues. David Carman Co-Founder/Board Director Global-DCA.org M–312-203-3122 ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-january-14th-20-2022/12752"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#29",
                    "likes": "8",
                    "time": "20/01/2022-10:16:24",
                    "content": "I liked to read why everyone is passionate about maker, especially from the folks from Venezuala, I was born in the Sowjetunion middle in the collapse and didn’t understand what was happening, through economic and social crisis, later my family moved to a first world country from one extreme into another, I understand now that decisions from a few mighty people could lead into suffering for Millions Billions of people. MakerDao is a powerhouse for governance and a good expale how decisions could take and I like to encounter with the community in the forum, it feels like the Dao benefits from enormous swarm intelligence, the success of MakerDao will not be only an economic one also a social one. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.688725490196078
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#30",
                    "likes": "5",
                    "time": "24/01/2022-15:37:26",
                    "content": "I got into MKR for the burn mechanic. But after reading the forum I understood alot of things are happening people are engaged, lively and passionate, from the Daos I looked into its the best. The Makerfoundation being disolved and giving back all the tokens to the DAO is what caught my attention. Also DAI is the best stablecoin. I trust it the most by far. DAI is vital for Ethereum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.741477272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#31",
                    "likes": "3",
                    "time": "28/01/2022-01:44:44",
                    "content": "I am very interested in the project because it is the gateway to a fair and accessible financial system for all, it is the basis of the DEFI, it was also the first to offer those solutions and financial opportunities that triggered a domino effect of innovation and technological development in the entire crypto ecosystem, in my opinion a very well thought out financial system but which can be even better. Don’t let the innovation stop!   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.237500000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/someone",
                    "index": "#32",
                    "likes": "2",
                    "time": "30/01/2022-16:06:46",
                    "content": "  I like the straightforward economics — an autonomous protocol that, in theory, provides massive value to both users and holders without active human interference required (sans Emergency Shutdown and other solid game theoretical threats). No hand-wavy “tokenomics” that feel like they amount to spending $10 to gain $1; only solid earnings that are returned to stakeholders.   I was hoping we would offer our own staked ETH vaults, so that we could offer self-repaying loans. We currently have <3% of all ETH locked but I believe that number could be much higher if we offered staking services and provided stablecoin loans against staked collateral (and before a competitor does). LR, SF, counterparty risk, and other parameters would be more favorable than stETH vaults (and 3rd party pool vaults generally) versus what we could offer on our own vaults.   I’m grateful for the thoughtful, long-term oriented community.   ",
                    "links": [
                        "https://www.reddit.com/r/MakerDAO/comments/r0jsqu/mint_dai_with_eth_plus_yield/hlt9w9y/?context=3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.597916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#33",
                    "likes": "5",
                    "time": "26/02/2022-04:07:42",
                    "content": "I’ll answer the question, but first I want to introduce you with a little bit of my story and how I got into this. Everything begins with the desire and the fight for transparency. I have witnessed economic and social problems where I come from. I have enlightened myself, reading and seeing many articles and documentaries about all the crises that have existed, and that unfortunately we must go through. I am from Argentina and I am 25 years old, so I was able to experience certain emotions of helplessness and sadness over time. For me, the oppression of human and individual rights are the main reasons why I am here. And it is that I intend to act on it and change what is happening. MakerDAO opened my eyes. From the first moment since I was introduced to cryptocurrencies, my attention turned to DAOs. Contrary to most, I first experienced the Ethereum network before Bitcoin. The reason why is simple, my attraction to smart contracts is beyond my own understanding, it was love at first sight. That is why by learning about DAI, and thoroughly investigating it, I affirm that this stable currency can be the healthiest alternative to the US dollar. Now things make sense, here is a much more important mission than becoming a millionaire. Knowledge is the true source of wealth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.268214285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#34",
                    "likes": "1",
                    "time": "26/02/2022-04:44:59",
                    "content": "Welcome @0xRami!!! hope you can add value to this community  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#35",
                    "likes": "0",
                    "time": "19/03/2022-01:08:04",
                    "content": "What I am most passionate about Maker is its horizontal structure, the way it works without an authority that monopolizes decision-making, that the rules are clear and precise, and that its execution through smart contracts gives the certainty that what is established in the operational manual will be fulfilled and that all holders of the token will also be able to participate in the governance. Likewise, the way in which the DAI token is backed by other cryptocurrencies gives us an even greater guarantee than that of the USDT. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.274553571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#36",
                    "likes": "1",
                    "time": "19/03/2022-01:17:36",
                    "content": "I’m passionate about Maker bc of the swag I got at Eth Denver! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#37",
                    "likes": "9",
                    "time": "21/03/2022-11:45:06",
                    "content": "Where else can you publicly converse with a pirate?! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Freakytainment",
                    "index": "#38",
                    "likes": "2",
                    "time": "21/10/2022-05:04:07",
                    "content": "It’s interesting to see how many people have considered the reasons why everyone else is so passionate about makers, and I’d like to provide an answer as well. Following my discovery of Maker, I spent a day researching the discourse forum and the maker notion to learn more about it. In all honesty, I used to think that Maker’s governance was unwelcoming and overly severe, but I later realized that it was actually a location where I could develop professionally and learn about Web 3 governance. Then I suddenly felt the need to do more research and engage, albeit I occasionally struggle with certain problems and am grateful that some members of the Maker Governance team ( @prose11 & @eleventh  ) have been able to guide me and provide solutions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.951530612244898
                }
            ]
        }
    ]
}