{
    "poll_list": [
        {
            "title": "Ratification Poll for Methodology and Review Process for Structured Finance Transactions (MIP67) - April 11, 2022",
            "index": "13737",
            "option": "Yes",
            "supporting_mkr": "87,752",
            "highest_fraction": 0.78
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
            "title": "MIP67: Methodology and Review Process for Structured Finance Transactions ",
            "index": 13737,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "impact-:-high",
                "collateral-onboard",
                "process",
                "love-cu",
                "mips",
                "mip-accepted",
                "rwf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#1",
                    "likes": "7",
                    "time": "08/03/2022-04:00:22",
                    "content": " MIP67: Methodology and Review Process for Structured Finance Transactions  Preamble MIP#: 67 Title: Methodology and Review Process for Structured Finance Transactions Author(s): @luca_pro, @williamr Contributors: @eumenes, @teej, @christiancdpetersen Tags: mips, rwf-001-cu, love-cu, process, collateral-onboarding  Type: Process Status: Accepted Date Proposed: 2022-01-07 Date Ratified: 2022-04-25 Dependencies: n/a Replaces: n/a Forum URL: https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737 Ratification Poll URL: https://vote.makerdao.com/polling/QmWt5fov   References  Methodology for Review of MIP6 Structured Finance Transactions [Informal Poll] RWF Collateral Risk Level SES Project Real-World Sandbox MIP67c3-Subproposal-Template.md Video - Focus on #4: Methodology for Structured Finance Transactions   Sentence Summary MIP67 intends to formalise the methodology and high-level process to evaluate structured finance transactions made under the MIP6 application process.  Paragraph Summary MIP67 intends to (1) formally approve the Methodology for Review of MIP6 Structured Finance Transactions published by the Real-World Finance Core Unit, and (2) introduce a high-level process that each MIP6-compliant application should undergo in order to receive, eventually, a positive endorsement from the relevant real-world CU stakeholder groups. E.g. RWF-001, SES-incubated Lending Oversight team, future CUs.  Component Summary MIP67c1: Proposal Submission Process Defines the high-level process to submit structured finance transactions to structured finance teams. MIP67c2: Methodology Amendment Process Defines the process to make amendments to the Methodology for Review of MIP6 Structured Finance Transactions. MIP67c3: Methodology Amendment Template Defines a template to propose amendments to the Methodology for Review of MIP6 Structured Finance Transactions defined in MIP67c2.  Motivation Background In continuing to reinforce the social contract that core units have with the Maker community, the following MIP seeks to further professionalise and standardise real-world asset onboarding. Onboarding use cases that are not yet part of the world of smart contracts, or complex use cases in general, come with a new set of challenges that have sparked wider questions about Maker’s role within the wider monetary and lending stack. The risk inherent to so-called structured assets takes many forms: some commercial, some technical, some legal, and some reputational. Nevertheless, the process by which this type of collateral is underwritten for Maker vaults should converge on the rigour and transparency applied to other crypto-native collateral. Motivation details The Real World Finance Core Unit (“RWF CU” or RWF-001) has proposed detailed criteria to evaluate proposed MIP6 structured finance transactions (each a “Proposal”) in its Methodology for Review of MIP6 Structured Finance Transactions (the “Methodology”). The Methodology and the criteria are built upon the [Informal Poll] RWF Collateral Risk Level and the SES Project Real-World Sandbox report. The criteria are intended to capture “best practices” in the structured finance market and may be considered appropriate for the onboarding of real-world collateral into Maker vaults. Similar criteria may be applied to structured exposure native to the blockchain environment. The MIP has two distinct objectives:  Formalise, through on-chain voting, the Methodology  Define the high-level process (the “Process”) that each Proposal should follow in order to receive a positive endorsement by relevant CU stakeholder groups.  E.g. RWF CU (RWF-001), the currently SES-incubated Lending Oversight team (or “LOVE” - here represented by @luca_pro), or future CUs The relevant stakeholder CU teams commit, as part of this MIP, to do their best to facilitate the review of each Proposal based on the process outlined below. In doing so, however, the teams will necessarily have to prioritise those Proposals that have, either, a higher chance of compliance, or a higher positive potential impact for the protocol. This prioritisation effort will necessarily come with some level of discretion, that the teams will try to qualify in their recommendations. For the avoidance of doubt, the relevant CU stakeholder teams commit, as part of this MIP, to publicly recommend a negative vote to the Community for those Proposals that do not incorporate the criteria set forth in the Methodology or do not follow the standardised Process described below. The teams will provide supporting evidence to both a positive and negative opinion; such evidence will include team-led analysis (when not protected by any NDA signed with the counterparty) and/ or the qualified opinion of the third-party service providers that have been engaged for their specialised, not internally available, skills. This intention applies not only to new onboardings, but also to requests for Debt Ceiling increases or any other change of terms. This behaviour has the aim of continuously improving the quality of the applicants and of installing the appropriate checks and balances within MakerDAO. The relevant CU teams will update the Maker community as to the extent of any proposed revisions to these guidelines. In the spirit of the decentralised and resilient governance mechanisms central to MakerDAO, neither a positive nor negative recommendation must be considered binding and any counterparty will retain all rights to bring forward their Proposal to the community.  Specification / Proposal Details  MIP67c1: Proposal Submission Process In summary, the relevant stakeholder CU teams expect each Proposal to follow, at a minimum, a streamlined process that includes the following phases:   Initial engagement with the relevant structured finance CU (e.g. RWF-001), providing the CU with a reasonably detailed Proposal (not necessarily formalised yet as a MIP or Signal Request) that conforms with the Methodology and with the appropriate time to review its high-level pillars   From a technical advisory perspective, the following information should also be shared:  Is the asset tokenized, if so, which standard does it conform to, and on which blockchain infrastructure is it deployed? Can the total supply be updated? If so, how? Is the asset controlled by a central actor or group? Can balances be arbitrarily modified by a central actor or group? Does the asset have KYC requirements? Does price feeds or market data for the asset exist? How can the asset be sold in case of a liquidation?  For more details see MIP6 Template amendment.     Legal consultation on the proposed structure provided by a reputable external law firm supporting the relevant CU (or potentially a future Legal CU) as external counsel   A public comprehensive assessment (commercial/ risk, technological, and legal) performed by the relevant stakeholder CUs e.g. RWF-001, the CES CU, and potentially a newly incubated Legal CU, resulting in a proposal that both (1) conforms with the Methodology and (2) is reasonably comparable to similar transactions in the asset class   A public second opinion provided by relevant oversight teams e.g. LOVE or newly incubated CUs   The proposed process is consistent with the Community’s intention to onboard high-quality, prepared, and professional counterparties with the potential to scale significantly in the medium to long term. The Process should ideally be completed prior to the submission of a formal and comprehensive MIP6 for Greenlight vote and will provide the Maker delegates with a pre-assessed transaction. The investment of time and financial resources up-front will accelerate the transition from a Greenlight vote to the activation of a Maker vault (i.e. delivery). In the spirit of a decentralised and censorship-resistant governance process, a negative opinion by the relevant CUs e.g. RWF CU, CES CU, or any other supporting CU or group, may dissuade applicants from submitting a Proposal for public voting. Applicants may still submit their proposal for greenlight and collateral onboarding poll votes using the MIPs process, regardless of the presence or absence of positive or negative assessments/opinions. The CUs will continue to engage, within their mandate, with applicants whose Proposal has been officially approved via MakerDAO’s governance mechanisms.  MIP67c2: Methodology Amendment Process The Methodology and Process presented in this document do not have to be considered as monolithic. We expect relevant stakeholder CUs (e.g. RWF CU, future LOVE CU, etc) to be actively involved in maintaining and evolving those, incorporating feedback coming from all internal and external stakeholders. Future MIPs will further detail how the amendment process will be approached by the CUs. We are currently working with several counterparties to officially onboard real-world assets by utilising the suggested Methodology and Process for the first time. Those applications will constitute the reference point for others to follow.  MIP67c3] Methodology Amendment Template MIP67c3-SPs will be used to define changes to the Methodology for Review of MIP6 Structured Finance Transactions. While the template provides the minimum set of fields required to submit an amendment to the Methodology, there is flexibility when it comes to adding more information. It is expected that the community will have a backlog of additional information when submitting an amendment proposal that is not yet contemplated in the MIP67C3 template. In order to submit a MIP67c3 SP, one must create a MIP from the provided template. MIP67c3-SP Template:   Feedback Period: 4 weeks  Frozen Period: 1 week  Subproposal Template: MIP67c3-Subproposal-Template.md   ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-rwf-collateral-risk-level/12254",
                        "https://forum.makerdao.com/t/real-world-sandbox-final-deliverable-for-consultation-round/11915",
                        "https://github.com/makerdao/mips/blob/master/MIP67/MIP67c3-Subproposal-Template.md",
                        "https://forum.makerdao.com/t/focus-on-4-mip6-review-methodology-for-structured-finance-transactions/12943",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://forum.makerdao.com/t/informal-poll-rwf-collateral-risk-level/12254",
                        "https://forum.makerdao.com/t/real-world-sandbox-final-deliverable-for-consultation-round/11915",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://forum.makerdao.com/t/mip6c3-sp2-modify-the-collateral-application-form/13787#list-of-changes-to-application-questions-5",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://github.com/makerdao/mips/blob/master/MIP67/MIP67c3-Subproposal-Template.md",
                        "https://forum.makerdao.com/t/mc-drop-mip6-application-monachil-capital-partners-lp-drop-senior-secured-credit-facility-for-a-private-credit-fund/8543/9",
                        "https://forum.makerdao.com/t/request-for-definitive-description-of-collateral-onboarding-process/14330/12",
                        "https://forum.makerdao.com/t/sb-ldb-mip6-application-solidblock-democratizes-real-estate-with-london-digital-bonds-a-smart-tradable-property-investment/6276/7",
                        "https://forum.makerdao.com/t/sb-ddc-mip6-application-membership-interests-in-detox-medical-digital-series-of-solidblock-holdings-llc-in-the-form-of-cryptographic-digital-tokens-ddcs-a-solidblock-offering/10063/11",
                        "https://forum.makerdao.com/t/reinno-mip6-collateral-onboarding-application-real-estate-new/6218/14",
                        "https://forum.makerdao.com/t/sb-bfdc-mip6-application-own-and-trade-a-piece-of-paradise-with-this-beachfront-hotel-in-phuket-thailand-managed-by-best-western-plus-a-solidblock-offering/6778/6",
                        "https://forum.makerdao.com/t/reif-drop-mip6-application-reif-drop-commercial-real-estate-assets/10169/8",
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215/33",
                        "https://forum.makerdao.com/t/ost-mip6-collateral-onboarding-application-by-uprets-real-estate-backed-digital-security/4438/19",
                        "https://forum.makerdao.com/t/kf-drop-mip6-application-kickfurther-drop-consignment-inventory-finance-for-ecommerce-retail-brands/4064/5",
                        "https://forum.makerdao.com/t/governance-and-risk-187-thursday-april-21-17-00-utc/14708/2",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/57",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219/21",
                        "https://forum.makerdao.com/t/relay-semanal-12-18-de-abril-de-2022/14724",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/68",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-18-de-abril-de-2022/14700",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-truefi/14563/27",
                        "https://forum.makerdao.com/t/weekly-relay-april-12-18-2022/14691",
                        "https://forum.makerdao.com/t/weekly-mips-update-83/14673",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-7-13-2022/14624",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-abril-de-2022/14616",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-11-de-abril-de-2022/14594",
                        "https://forum.makerdao.com/t/weekly-relay-april-5-11-2022/14590",
                        "https://forum.makerdao.com/t/governance-and-risk-185-thursday-april-07-17-00-utc/14464/2",
                        "https://forum.makerdao.com/t/off-chain-mips-collateral-update-what-s-going-on/14530",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-81/14443",
                        "https://forum.makerdao.com/t/request-for-definitive-description-of-collateral-onboarding-process/14330/5",
                        "https://forum.makerdao.com/t/rbld-mip6-collateral-onboarding-application-real-estate-new/11911/18",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219/11",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219/8",
                        "https://forum.makerdao.com/t/weekly-mips-update-80/14274",
                        "https://forum.makerdao.com/t/mip68-monetalis-vault-v2/13789/16",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152/53",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152/51",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152/30",
                        "https://forum.makerdao.com/t/weekly-mips-update-78/13903",
                        "https://forum.makerdao.com/t/mip68-monetalis-vault-v2/13789/5",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-emerging-markets-green-opportunity-financing-for-atd-combustors-egyptian-power-plant-efficiency-projects/14489/37",
                        "https://forum.makerdao.com/t/monthly-governance-review-april-2022/14986",
                        "https://forum.makerdao.com/t/tm2-drop-mip6-application-technology-metals-market-tm2-trade-finance-for-trading-of-physical-metals/10666/13",
                        "https://forum.makerdao.com/t/pa-drop-mip6-application-us-based-supply-chain-finance-for-large-oems/7787/18",
                        "https://forum.makerdao.com/t/sg-forge-socgen-risk-assessment/15638/14",
                        "https://forum.makerdao.com/t/mip6-pando-investment-grade-climate-assets-collateral-onboarding/16394",
                        "https://forum.makerdao.com/t/rwf-001-monthly-update-april-2022/15024",
                        "https://forum.makerdao.com/t/sb-frogi-coin-mip6-application-membership-interests-in-red-frog-digital-series-of-solidblock-holdings-llc-in-the-form-of-red-frog-digital-coin-frogi-coin-a-solidblock-offering/11258/9"
                    ],
                    "GPT-summary": "The post is a proposal for a methodology and review process for structured finance transactions. The proposal aims to formalize the methodology and high-level process to evaluate structured finance transactions made under the MIP6 application process. The proposal outlines the submission process, methodology amendment process, and methodology amendment template. The proposal also includes the motivation behind the proposal and the specification/proposal details. The post does not advertise the proposal, but rather explains it and invites feedback and collaboration.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.72438594014681
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#2",
                    "likes": "3",
                    "time": "08/03/2022-04:04:17",
                    "content": "@prose11 @blimpa I am locking a placeholder here to update the MIP during the RFC phase. It requires minor completions. Also relevant to incorporate Community inputs during the process. This proposal is to be taken into account this current cycle. @Recognized-Delegates @Real-World-Finance @luca_pro @SES-Core-Unit @collateral-core-unit @Growth-Core-Unit ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "6",
                    "time": "08/03/2022-15:47:01",
                    "content": "Hello All, searching for some words of wisdom as to how will RWF and LOVE (@luca_pro) respond to Riskier MIP6 applications that are the foundation of how MakerDAO and crypto were built on? I ask because some might interpret the above methodology as being Investment Grade Only. How does Joe and Jane get the opportunity to build a 10,000 Acre Wind-Turbine Farm in Piauí, Brasil via a MakerDAO Vault? I like to think that MakerDAO has gotten this far, because Risk is Real, and Fear is a Choice. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#4",
                    "likes": "6",
                    "time": "08/03/2022-16:13:21",
                    "content": "Thanks @flipflopflapdelegate, I see your argument thru two set of lens:   Maker partners with those who make a difference: there are several platforms that are actively engaging with markets that are less institutional, but that have the possibility to transform lives; traditionally, those markets have been the kingdom of very speculative investors that were asking multiple of the risk underwritten because others were too afraid to onboard it. We could change this, by asking for a fair return for the risk; based on my knowledge, if Maker would show interest in providing senior financing in the < 2% range we could find many counterparts ready to structure a senior exposure to us that satisfies the needs described above and allows borrowers to get their money and other investors to have higher returns while protecting Maker. We are starting by engaging counterparts that are large and operate in developed markets, but we can soon move to be more open to interact with reputable ones that operate in markets in need   Maker partners with start-up/ riskier borrowers that have a strong mission: we don’t want to be driven merely by financial ambitions, and we want to make a difference. This means that, in principle, it is my opinion that Maker could create a dedicated mandate to provide financing to those who cannot structure an investment grade type of credit quality. Obviously, this initiative would require: (i) governance approval, (ii) maybe a dedicated underwriting team, (iii) a very rigorous approach - we don’t want to open the doors to speculators masking themselves as saints, (iv) a more prudent debt ceiling.  Personally, I am enthusiastically looking forward for this. This is the reason that myself and the other contributors to the Real-World Sandbox project have aimed from the beginning to create a composable framework made of Underwriting Core Units, Oversight Core Units, and the required checks and balances with all the other governance mechanisms. We hope to have a wider and impactful mandate for the world, while maintaining the same rigorous mindset in assessing risks. Being rigorous in assessing risk doesn’t necessarily mean being risk adverse, it means being aware of the risk that can be reported to the token holders so that they can take the best informed decision possible. I say no to Fear! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.603257275132275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#5",
                    "likes": "2",
                    "time": "08/03/2022-18:44:37",
                    "content": "    luca_pro:  Personally, I am enthusiastically looking forward for this. This is the reason that myself and the other contributors to the Real-World Sandbox project have aimed from the beginning to create a composable framework made of Underwriting Core Units, Oversight Core Units, and the required checks and balances with all the other governance mechanisms.   Cheers to that. There is a ton of work to get here from a governance, process, scaling PoV. But at least now there is vision of what to aim for. As the old saying says: “No wind is good for a sailor that does not know where he’s going”.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#6",
                    "likes": "6",
                    "time": "08/03/2022-19:34:04",
                    "content": "    flipflopflapdelegate:  How does Joe and Jane get the opportunity to build a 10,000 Acre Wind-Turbine Farm in Piauí, Brasil via a MakerDAO Vault?   @elpro - Having advised on energy projects and financings in places like, Venezuela (gas), Mexico (gas), Chile (petroleum coke), Costa Rica (hydro), Panama (fuel oil), China (LNG, gas), Philippines (gas), India (gas, coal), Pakistan (LNG), Indonesia (coal), Mozambique (LNG), Finland (nuclear) and others, I am confident that there will be opportunities for these projects to come to Maker. But honestly, the considerations are often the same. In the project finance context, the due diligence and lender review is even more intense as the project is the sole and exclusive source of funds to repay the loan - therefore, you have to review the land contracts, the engineering, procurement and construction contract (contractor experience and credit), the operations & maintenance agreement (operator experience and credit), the off take agreement (the off taker credit, market demand, etc.), permits, and then make sure that you have a security interest over all of the above. It can be done, but “Joe and Jane” need to be professional and financially-backed. The U.S. solar market has probably been the only energy space where “Joe and Jane” can arguably play because the solar development space is very cookie-cutter and there is plenty of $ chasing deals. Personally, I hope we see more energy related projects come to Maker (that it why I even found Maker in the 1st place). And if we can get attractive projects in non-OECD countries, even better! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.294117647058823
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#7",
                    "likes": "1",
                    "time": "16/03/2022-01:58:45",
                    "content": "Community, bringing this back up to allow people to provide comments. Regards, Luca ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#8",
                    "likes": "3",
                    "time": "16/03/2022-03:41:09",
                    "content": "Having spoken with the different stakeholders, we believe that Data Insights CU can provide support bridging the data gap between RWAs and Maker. We look forward to collaborating with you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party wants to collaborate on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#9",
                    "likes": "2",
                    "time": "16/03/2022-11:56:38",
                    "content": "Thank you @tadeo, As I have discussed with you, I believe we could include a paragraph in the MIP that outlines clearly how:  Counterparties should have minimum data requirements and responsibilities in order to allow MakerDAO to perform appropriate monitoring of the collateral CUs involved in RWAs should produce and maintain minimum data standards the counterparties should comply with  I will discuss with @williamr and amend the MIP draft above to reflect those points. Thank you for your support, Luca. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#10",
                    "likes": "1",
                    "time": "24/03/2022-04:04:55",
                    "content": "Reminder that this proposal will enter its Frozen Period in one week, on March 31, 2022. Last day for modifications is March 30, 2022. Substantive modifications beyond that date will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. Please reach out if you have any questions ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#11",
                    "likes": "0",
                    "time": "24/03/2022-07:29:40",
                    "content": "Thanks for the heads up, @Gala. We have one addition involving technology requirements into the MIP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#12",
                    "likes": "4",
                    "time": "24/03/2022-14:03:07",
                    "content": "CES CU would like to extend the definition of the first phase suggested by RWF CU under the [MIP67c1]: Proposal Submission Process     williamr:   Initial engagement with the relevant structured finance CU (e.g. RWF-001), providing the CU with a reasonably detailed Proposal (not necessarily formalised yet as a MIP or Signal Request) that conforms with the Methodology  and with the appropriate time to review its high-level pillars    From a technical advisory perspective, the following information should be shared:  Is the asset tokenized, if so, which standard does it conform to, and on which blockchain infrastructure is it deployed? Can the total supply be updated? If so, how? Is the asset controlled by a central actor or group? Can balances be arbitrarily modified by a central actor or group? Does the asset have KYC requirements? Does price feeds or market data for the asset exist? How can the asset be sold in case of a liquidation?  The above token information request is a simplified selection from the overall technical questions from the MIP6 Template amendment ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6c3-sp2-modify-the-collateral-application-form/13787#list-of-changes-to-application-questions-5"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.453125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#13",
                    "likes": "3",
                    "time": "30/03/2022-23:28:06",
                    "content": "Update: The MIP67 had some slight amendments to include a summary of technical details outlined in the post above by @M_C ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.722222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#14",
                    "likes": "2",
                    "time": "04/04/2022-19:49:38",
                    "content": "@Gala @blimpa Adding this MIP for formal submission this cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#15",
                    "likes": "2",
                    "time": "14/04/2022-02:34:16",
                    "content": "This proposal is currently being voted on. Its RP will run from 04/11 to 04/25. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "771"
}