{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-8-0-august-12th-2022/17218",
            "title": "Unified Auctions UI Release v1.8.0 - August 12th 2022 ",
            "index": 17218,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "1",
                    "time": "12/08/2022-15:10:56",
                    "content": " Unified Auctions UI Release v1.8.0 - August 12th 2022 Version: v1.8.0 Name: Paddle8  v1.8.0 in a nutshell We are happy to announce the support of the 3rd auction type with today’s release: The debt auctions. During the last two weeks our main goal was to roll out the support for the debt auctions. Together with the collateral and surplus auctions, the debt auctions form the protocol’s core auction types. All of these are now supported by the Unified Auctions UI. Besides hitting this next major milestone as always we were able to make smaller adjustments and housekeeping improvements. Today’s release is called Paddle8, a former New York auction house that filed chapter 11 bankruptcy in 2020. This is not a particularly famous auction house or a spectacular case. Nevertheless, it serves as an example of what can happen when the necessary mechanisms to reduce debt are missing. So good to have the debt auctions supported via our UI from now on…  A closer look at some changes  Debt auction support  Screenshot 2022-08-12 at 11.19.373104×1974 554 KB  With the support of the debt auctions the Unified Auctions UI now covers all of the functionality that was only facilitated via the old auction UI so far. The Unified Auctions UI from now on can act as the single gateway for all auction interaction. For the debt auctions, we have also used proven UI concepts to provide the user with a consistent experience across the different auction types while also making the auction interaction as intuitive as possible. These concepts include the narration-based approach, enrichment of relevant auction information, proper covering of different auction states and the panel-based auction flow to guide the user in the best possible way. While hopes are that the debt auction UI in best case doesn’t need to be used we are still glad to have it in place and hence contribute to the overall security and robustness of the protocol.  Screenshot 2022-08-12 at 16.44.001380×1256 124 KB   Twitter bot extension After the release of the surplus auction support a couple of weeks ago we now also extended our twitter bot. The bot will inform about starting surplus auctions. Based on our experience with tweets about collateral auctions the bot proved to be a very effective channel to inform about auctions and funnel UI users. So in case there will be surplus auctions again at some point in the future, our bot will let everyone know.  Teaser: UI based barking As part of the upcoming sprint we will conceptualize the feature to start collateral auctions (or bark on underwater vaults) via the UI. With that step we further want to integrate and facilitate the whole auction lifecycle. If you have early thoughts on this, feedback is more than welcome as always. ",
                    "links": [
                        "https://auctions.makerdao.com/",
                        "https://twitter.com/MakerDAO_SAS",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-august-2022/16955"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0755397015265435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/11/2022-15:11:45",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-9-0-august-26th-2022/17465",
            "title": "Unified Auctions UI Release v1.9.0 - August 26th 2022 ",
            "index": 17465,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "3",
                    "time": "26/08/2022-16:33:25",
                    "content": " Unified Auctions UI Release v1.9.0 - August 26th 2022 Version: v1.9.0 Name: Swann Auction Galleries  v1.9.0 in a nutshell We are happy to announce the release v1.9.0 of the Unified Auctions UI. After the introduction of debt auction support in the previous release we’ve spent some more time in improving the overall user flow and officially deprecated the legacy auction UI. Following the similar path of extension as we did for the UI, we now added the support for surplus auctions to our keeper implementation. And besides these two streams of work we also pushed the conceptualisation for the planned feature that will enable users to bark on underwater vaults. Today’s release is called after the famous Swann Auction Galleries. If you imagine a normal city pond then a swan is certainly a focal point and eye-catcher. With the consolidation of the different UIs under the Unified Auctions UI, we are also trying to become the swan in the pond of the Maker Auctions. The swan that draws the attention of all those users interested to engage in auctions via a UI.  A closer look at some changes  Debt auction improvement  UnifiedOverview3104×1974 505 KB  After adding support for debt auctions to the Unified Auctions UI, the legacy UI that formerly facilitated participation in surplus and debt auction is now no longer needed. As this UI was no longer actively maintained it is now deprecated and redirects to the Unified Auctions UI. However, a big shout out at this point to @dux-core-unit who kept the legacy UI alive without it being their mandate. Besides that we were able to improve the user flow for participation in debt auctions. In order to test the whole interaction flow end to end we implemented a simulation script to start a debt auction. This end to end testing capability resulted in the addition of an authorisation panel and smaller adjustments to the depositing and bidding steps.  Keeper extension Besides the UI and the twitter bot, the keeper is the third product that we are actively working on. Up until today’s release users could use our code to spin up their own instance of a keeper that’s able to participate in collateral auctions. From now on our keeper implementation also facilitates participation in surplus auctions. In the known manner different environment variables allow to configure the keeper. So SUPPORTED_AUCTION_TYPES lets the keeper operator provide a list of auction types to participate in. An extensive overview on the keeper config can be found in the respective readme.  Concept: UI based barking  VaultMock2664×1808 260 KB  We’ve spent a decent amount of time during the last two weeks on the conceptualisation of the new feature that will allow users to bark on underwater vaults via the UI. Our rationale is to vertically expand and integrate all auction related interactions into Unified Auctions UI. While participation in active auctions is already facilitated, the planned barking feature aims to enable the start of auctions in the first place. Above you can see a first excerpt of our UI mock. Based on our design principles we want to keep the unique look and feel and adopt core components that we introduced for the Unified Auction UI in the past. This includes the narration based flow, the split layout and the panel based user flows. Other than that we are trying not to overwhelm a user with too much vault information. We rather restrict the information density to a level that allows one to make an informed decision whether to engage in liquidation of a vault or not. Feel free to have a closer look on the current state of the mock via the following link: MakerDAO vaults_Shared As always we encourage you to give feedback. ",
                    "links": [
                        "https://github.com/sidestream-tech/unified-auctions-ui/tree/main/bot#environment-variables",
                        "https://whimsical.com/makerdao-vaults-shared-K9wHerWJtLKeYywvLfzHqC@VsSo8s35VhoGNaGMSymFSR",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-august-2022/16955"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5893630179344465
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#2",
                    "likes": "1",
                    "time": "29/08/2022-08:09:34",
                    "content": "    danik:  After adding support for debt auctions to the Unified Auctions UI, the legacy UI that formerly facilitated participation in surplus and debt auction is now no longer needed. As this UI was no longer actively maintained it is now deprecated and redirects to the Unified Auctions UI. However, a big shout out at this point to @dux-core-unit who kept the legacy UI alive without it being their mandate.   I’m so stoked about this  Great work guys—I hope we won’t be seeing flop auctions anytime soon but having this infra in place definitely adds to MakerDAO’s resilience. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.638888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "27/11/2022-08:10:06",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1584"
}