{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/real-world-finance-decision-making-and-delegated-committee-proposal/15276",
            "title": "Real World Finance: Decision-Making and Delegated Committee Proposal ",
            "index": 15276,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "delegated-committee",
                "archive-rwf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#1",
                    "likes": "22",
                    "time": "19/05/2022-17:02:28",
                    "content": "Summary This post introduces a decision-making methodology for real world assets after collateral on-boarding. Based on that methodology, this post includes a proposal to delegate some decision-making to a committee of volunteers approved by MKR token holders. Go to the section “PROPOSAL” for details.  In anticipation of risk assessments for SG Forge and HVB being published soonest, @eumenes and @christiancdpetersen are providing to the Forum a modified version of their presentation of May 4, 2022 during the RWF CU office hours. Office hours #8 | RWAs: Taxonomy of decision-making - YouTube As discussed at the time, there are a multitude of commercial and administrative issues that occur after the approval of a financing that require a decision. Maker needs a methodology that is  Transparent Practical Commercially reasonable Responsive to MKR token holders  The proposed methodology is a starting point and the methodology may change depending on the asset, etc. We remain guided by MKR token holder inputs. Types of Decisions in Real World Assets Financing of real world assets and real world businesses requires more decision-making than financing crypto assets. Below is a mere sample of decisions made in the real world:  960×540 156 KB  In TradFi, these decisions can be classified between high impact, medium impact and low impact. The types of decisions may vary between financings - simple loan vs. investment grade bond securitization. The slides below show the difference between a simple loan and an investment-grade public bond securitization. Investment-grade bond securitization transactions are “trustless” because  The collateral pool requires little lender oversight  High quality collateral with consistent historical performance Well established borrower and servicer   The structure is robust, requiring little lender oversight or governance  Administrative functions are performed by established, independent third parties Key decisions are rarely required, requiring ⅔ bondholder approval     960×540 29.4 KB  960×540 45 KB  960×540 40.1 KB  960×540 61.1 KB  What constitutes “high impact” decisions? In the TradFi world, “high impact” decisions are called “Lender’s Sacred Rights”. For Maker, we can envision the “Lender’s Sacred Rights” as follows:  960×540 50.4 KB  After allocation of the “sacred rights”, all other decisions might be delegated to an independent third party, a delegated committee of Maker representatives or a combination of both. Due to the inherent conflict, Maker should not delegate decision-making, directly or indirectly, to the borrower (or the borrower’s agents).  960×540 70.5 KB  The precise allocation to an independent third party (e.g. trustee or independent director), a delegated committee of Maker representatives or a combination of the two can be determined on a case-by-case and may vary by transaction-type (securitization vs loan) or asset-class. PROPOSAL We propose a separate Committee of Delegated Maker Representatives be established for each on-boarded real world asset. The following outlines key principles for a Committee of Delegated Maker Representatives.  960×540 91.1 KB  Our objective is a methodology that is transparent, practical and responsive to MKR token holders. Request for MKR Contributors Other than decisions relating to “sacred rights” which will require MKR token holder votes, RWF CU and the incubating LTS CU respectfully seek Maker token holders and/or delegates to volunteer to serve on a delegated committee of decision-makers. We would envision separate committees for each asset - probably no more than 3-5 persons per committee. The relevant existing core units, who will be most familiar with the underlying asset and transaction, will provide recommendations and advice to the delegated committees. Each committee will be responsible to the Maker community. It is intended to be more formal than the existing RWA Committee (MIP57) - RWA Committee. Subject to the Maker “sacred rights”, each committee will have real decision-making power. Criteria for a volunteer will include:   Traditional finance experience (whether commercial, legal, executive, risk, etc.) and/or experience with the particular asset class   Willingness to be a decision-maker on matters delegated to the committee   Willingness to review and make decisions on complex issues quickly, given commercial timelines   Willingness to sign a Non-Disclosure Agreement with the borrower as the delegate may have access to confidential, non-public information   Willingness to represent the Maker community   The volunteer does not have an economic interest the proposed borrower or the proposed asset (subject to standard carve-outs for non-material ownership interests in public companies)   The volunteer does not have an economic interest in an existing borrower or on-boarded asset with Maker   Subject to the level of interest, we can then discuss more process related issues, including the formal delegation process, committee voting, decisions allocated to the delegated committee. The first two transactions will be SG Forge and HVB transactions. The delegated committee, its scope, and initial members will be included in the executive vote for the SG Forge and HVB transactions. Please let @eumenes and/or @christiancdpetersen know if you are interested. We also welcome alternative ideas to address post on-boarding decisions. @Real-World-Finance @collateral-core-unit ",
                    "links": [
                        "https://forum.makerdao.com/t/mip57-rwa-committee/9304",
                        "https://forum.makerdao.com/t/this-week-in-governance/16382/2",
                        "https://forum.makerdao.com/t/mip55c3-sp5-interim-chief-legal-officer/15981",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-additional-risk-assessment-love-cu-in-incubation/15886",
                        "https://forum.makerdao.com/t/sg-forge-socgen-risk-assessment/15638/14",
                        "https://forum.makerdao.com/t/rwf-collateral-onboarding-update-huntingdon-valley-bank/15015/10",
                        "https://forum.makerdao.com/t/relay-semanal-17-23-de-mayo-del-2022/15392",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-junio-05-de-julio-del-2022/16473",
                        "https://forum.makerdao.com/t/weekly-relay-may-17-23-2022/15346",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7",
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967",
                        "https://forum.makerdao.com/t/prospective-rwf-0x-july-2022-monthly-report/17003",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/20"
                    ],
                    "GPT-summary": "The post introduces a decision-making methodology for real-world assets after collateral on-boarding. It proposes delegating some decision-making to a committee of volunteers approved by MKR token holders. The post explains the proposed methodology, types of decisions in real-world assets financing, and the proposed committee's key principles. It also requests MKR contributors to volunteer to serve on the delegated committee and outlines the criteria for volunteers. The post mentions the first two transactions that will be subject to the proposed committee's decision-making power and invites alternative ideas to address post on-boarding decisions.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.511956521739131
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "20/05/2022-02:00:05",
                    "content": "This sounds similar to the Decentralized Voter Committees the Endgame Plan will implement. Will it carry over to the Endgame Plan, or is it a temporary solution to get SocGen and HVB across the finish line? Edit: Also, will these RWA meetings be recorded and release to the general  public (Maker Community) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/05/2022-13:56:32",
                    "content": "that is a good question - perhaps as Rune? In theory the meetings can be recorded and released but would need to respect confidential corporation information.  Remember the members will likely need to sign NDAs for each transaction involved. But certainly a summary must be posted timely summarizing the issues, discussions, options and actions taken. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.523809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "1",
                    "time": "20/05/2022-14:01:31",
                    "content": "I do want to also emphasize that two of the key principles of this Delegated Committee (& all RWA investments related activities) should be TRUSTLESS and TRANSPARENT. As such it is essential that MKR holders have transparency into the Delegated Committee’s decisions and the qualifications and any commercial entanglements of its members. And the ability to replace them if needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#5",
                    "likes": "1",
                    "time": "20/05/2022-16:55:59",
                    "content": "    flipflopflapdelegate:  This sounds similar to the Decentralized Voter Committees the Endgame Plan will implement. Will it carry over to the Endgame Plan, or is it a temporary solution to get SocGen and HVB across the finish line?   Any connection with the Endgame Plan is purely coincidental and the structure can be modified going forward as the MKR token holders deem appropriate. I am not sure it is a “temporary solution” per se, because any real world financing will require some form of decision-making. Bilateral loans will require more, investment-grade quality securitizations will require less.     flipflopflapdelegate:  Edit: Also, will these RWA meetings be recorded and release to the general public (Maker Community)   The results of decisions can certainly be made available subject to necessary considerations for confidentiality. Separately, as part of the overall enhancement of the real world finance process, we are working with applicants to develop more robust and frequent reporting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.675070028011204
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HospitableOryx",
                    "index": "#6",
                    "likes": "7",
                    "time": "20/05/2022-21:12:35",
                    "content": "Thank you for putting this together, Christian. I think this is the correct direction to go and will vote in favor of this. This proposal is aligned with a general trend I’m seeing in the governance discussions that our decisionmaking mechanisms need to evolve to suit the more complex waters we’re entering. The Office hours presentation was excellent. I urge other folks to watch it to understand the trade-offs in this structure (I found it still digestible at 2x speed). A few questions: Based on what I see on the forums, we obviously have a number of finance folks involved in this project, but do we have enough qualified people for MKR holders to have meaningful choices of who becomes a committee delegate?     christiancdpetersen:  The relevant existing core units, who will be most familiar with the underlying asset and transaction, will provide recommendations and advice to the delegated committees.   Will MKR holders who are also members of CUs be eligible to be on the committees? I don’t have an opinion on this, but there has been some community angst around the influence of CU members who also act as MKR holders, so I wanted to ask. Is there a minimum MKR ownership required to participate in a committee? Can we make a point to in the future revisit delegating additional decisions to third parties to increase decentralization? I think it makes sense to start w/ a heavier hand while we ramp up RWAs, but ultimately further decentralization will be valuable. Additionally, a comment: I have a hypothesis that this proposal might be the right kind of minutia to involve MKR holders in. I get frustrated that we MKR holders are having debates about event budgets and other execution details that don’t seem core to the business. Ideally those matters are treated as execution decisions, that can be governed at a high level (budget, hire/fire key personnel). In my opinion, we are unlikely to attract more bright minds excited and involved in this project if we are asking them to contribute to issues that aren’t related to the core business. On the other hand, these committees’ work actually sounds material and provides a means of engagement and contribution. I mean, maybe it’s kind of grunt work, but at least it utilizes the skillsets of finance professionals we want to attract, and it is directly contributing to our core business operations that generate a profit. If this proposal is passed, I will be reaching out to several of my friends in finance to see if they are interested in  buying some MKR to participate (or I’ll give them some of mine). Maybe someone can enlighten me on whether this hypothesis is accurate, or this is just annoying grunt work for the average finance professional. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.582276785714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#7",
                    "likes": "2",
                    "time": "21/05/2022-18:28:12",
                    "content": "    HospitableOryx:  but do we have enough qualified people for MKR holders to have meaningful choices of who becomes a committee delegate?   Good question. I do not know, but an initial judgment can be made if we get volunteers. We have all of 1 volunteer so far (but still early days)!     HospitableOryx:  Will MKR holders who are also members of CUs be eligible to be on the committees?   Ultimately up to the MKR token holders. But I would not propose that members of the relevant core units (RWF, CES, LTS, LOVE) serve on the Delegated Committee. I think the advisory role of the CUs is important and should not be diluted.     HospitableOryx:  Is there a minimum MKR ownership required to participate in a committee?   I suppose not. There are pros/cons for each approach. But if MKR token holders vote in favor of MKR ownership, then how much? It becomes a slippery slope. Hopefully participation/contribution will encourage MKR ownership (if none at the start).     HospitableOryx:  Can we make a point to in the future revisit delegating additional decisions to third parties to increase decentralization?   Absolutely. I think SocGen and HVB will be materially different than other MIP6 or MIPxx applications. We will learn as we go . . . improvise, iterate, etc.     HospitableOryx:  committees’ work actually sounds material and provides a means of engagement and contribution. I mean, maybe it’s kind of grunt work, but at least it utilizes the skillsets of finance professionals we want to attract, and it is directly contributing to our core business operations that generate a profit.   Agree. MKR requires the grunt workers. And it is the minutia that gets it all to work and succeed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.735119047619048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "0",
                    "time": "24/05/2022-09:55:33",
                    "content": "Not sure if this article is accurate, but it’s Interesting how the current leading RWA platforms (Centrifuge not reviewed) are decision-making via “Pool Delegates” and “Professional Credit Managers” — while some also require that their platform Tokens be used a collateral/staked: Undercollateralized Crypto Loans | Medium ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "2",
                    "time": "25/05/2022-17:33:57",
                    "content": "@Eumenes @christiancdpetersen Please pencil me in! As an active Delegate, student, and fan of on-chain/off-chain scaling of RWAs, I believe participating in this Committee is essential to the 3F Delegate Platform. Looking forward to contributing, participating, and learning. Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party expressing interest in collaborating on proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#10",
                    "likes": "5",
                    "time": "27/05/2022-14:21:12",
                    "content": "For the June 1 RWF Office Hours, @christiancdpetersen will discuss the Delegated Committee concept for the SG Forge and Huntingdon Valley Bank transactions. Of course everybody is welcome to attend the office hours, but we especially request participation of those that have expressed interest in serving (or are even thinking about it a little bit) to attend. If you are unable to attend, but have an interest, please reach out. We want to hear from you. @flipflopflapdelegate @psychonaut ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.140625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#11",
                    "likes": "6",
                    "time": "27/05/2022-22:22:50",
                    "content": "Terrific comments. +100 I just shared this post on my LinkedIn profile specifically encouraging peers in TradFi to get involved with MakerDAO and attend the Wed Office hours.   linkedin.com    Kianga D. on LinkedIn: Real World Finance: Decision-Making and Delegated... Opportunity! Your future in decentralized finance is calling. To my friends in TradFi (traditional finance), legal colleagues, credit, front office... ...      ",
                    "links": [
                        "https://www.linkedin.com/posts/kiangadaverington_real-world-finance-decision-making-and-delegated-activity-6936062024590262272-HQ6S?utm_source=linkedin_share&utm_medium=member_desktop_web"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party advertising proposal"
                    ],
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptickatz",
                    "index": "#12",
                    "likes": "5",
                    "time": "30/05/2022-19:09:55",
                    "content": "@christiancdpetersen @Eumenes. I have a TradFi background and extremely keen to be part of the committee. Could you please let me know what is the procedure to apply? Many thanks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party wanting to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#13",
                    "likes": "2",
                    "time": "31/05/2022-12:49:22",
                    "content": "We welcome your participation. We will hold an introductory session on Wednesday, June 1st during the Real World Finance office hours to introduce the committee concept. Here is the information Introducing: RWF-001 Weekly Office Hours! - #13 by williamr. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#14",
                    "likes": "2",
                    "time": "31/05/2022-22:10:21",
                    "content": "Hey what do you guys think of the Micro Lending Market? I was just reading that’s is pretty size-able: “* the global micro lending market size was valued at $134.35 billion in 2019, and is projected to reach $343.84 billion by 2027, growing at a CAGR of 12.6% from 2020 to 2027.*” —Allied Market Research If MakerDAO can grab 10% market share of that $300B, with a stability fee of 300 to 400 basis pts, that’s $900M to $1.2B to the surplus buffer!!!  Okay maybe wishful thinking, but I believe it’s a sector that Maker needs to pay attention to. And although I think we can say that HVB is part of the “micro-lending” sector—micro finance institutions and non-banking financial institutions will grow just as much as banks in the next 5 years, per the report. Here’s a small excerpt: “ Micro lending or micro finance is changing the lifestyle of various people in the developing nations of Asia-Pacific and LAMEA by helping them financially. In addition, surge in government initiatives for micro lending in various countries drives the growth of the micro lending market. Furthermore, increase in in micro lenders help various emerging countries for reducing poverty and also improves the standard of living of the poor people. For instance, according to a research study conducted in Bangladesh, micro finance accounted for 40% reduction of poverty in various part of the country. Moreover, various farmers across the African countries are adopting micro lending for buying crops, which drives the growth of the micro lending industry. In addition, people in rural areas are taking loans from micro lenders for setting their own business and to raise their standard of living, which propels the growth of the market.” “Region wise, the micro lending market was dominated by Asia-Pacific in 2019, and is expected to witness significant growth rate during the forecast period. This is attributed to surge in surge in government initiative to reduce poverty and to upsurge the living standard of the people. The outbreak of the COVID-19 pandemic has a significant impact on the micro lending market owing to affected cash flow among the financial sector and rising liquidity issues among the micro lenders. In addition, surge in unemployment in various emerging countries and closing of different small and medium enterprises negatively impacts the growth of the market during the first half of 2020. Moreover, banks and financial institutions across the globe are majorly focusing on digitizing their financial assets as well as lending schemes, which is expected to capture large customer base in the upcoming years.*” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None"
                    ],
                    "Sentiment": 5.156772844272845
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#15",
                    "likes": "4",
                    "time": "31/05/2022-22:30:37",
                    "content": "@flipflopflapdelegate  - Thank you for sharing. As you probably know from my earlier posts and my professional background, I am always interested in opportunities in the Asia-Pacific, LatAm and African markets. A few points for consideration: (1) Most jurisdictions (when dealing with micro-lending) will have a FX exposure that may be a challenge to quantify - especially if the revenues from the underlying borrowers are in local currency. (2) To ensure that our efforts are scalable, it will be important to underwrite an experienced underwriter. We will be challenged to do “one off” micro loans. A loan to an experienced, local micro-lender who manages the underlying loans is more efficient and safer for Maker. (3) To ensure that Maker’s interests are fully protected vis-a-vis the underwriter, it will be important for the underwriter to have “skin in the game” through a 1st loss position. And, I guess depending on the particular market, “micro” lending can be really, really, really small . . . hundreds of dollars vs. millions. We would need our loans to be in the millions to be efficient. I think this is the type of product that Maker will need to partner with a reputable, established and local institution. I have a pipe dream of partnering with the African Development Bank (or similar). But as these entities are typically funded by not-so crypto friendly nation states, it remains a pipe dream! But if we could find the partner, the optics would be really good! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.915364583333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "1",
                    "time": "31/05/2022-22:54:14",
                    "content": "Thank your for the valuable input CP! I came across the  Allied Market Research report while reading about Goldfinch, which Delphi claims has served ~$100M in uncollateralized loans to date with a superb utilization rate of ~98%, mostly from the micro-loan lending market. But, perhaps Delphi is referring to the TAM of micro loans from a different angle, since I believe Goldfinch is looking for  loans in the $1M++ category (I could be wrong). But yes, your description of such is super helpful and it would be neat to see your dream of serving the African market come into fruition. Thanks again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#17",
                    "likes": "1",
                    "time": "31/05/2022-23:12:02",
                    "content": "    christiancdpetersen:  We would need our loans to be in the millions to be efficient.   I have just the person in mind for emerging market debt investing. Jim Chu from Untapped Global has just raised $10 million from retail and institutional investors to democratize access to financial returns and at the same time provide a positive social impact. The online platform is in beta and only accessible to accredited investors, but will be open to retail investors by the end of the year. They have zero defaults and a super senior secured position in every loan.  Screen Shot 2022-05-31 at 4.11.45 PM872×736 128 KB   Screen Shot 2022-05-31 at 4.05.07 PM1268×681 206 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.538299663299663
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#18",
                    "likes": "0",
                    "time": "01/06/2022-19:31:48",
                    "content": "Thank you for the Delegated Committee presentation today, unfortunately we ran out time and I had a few questions I wanted to ask. With regards to establishing this Committee, can you please provide more color as to why a MIP is not needed (similar to MIP57) and what’s the thinking as to why it won’t need MKR token approval. I believe I know the answer, but perhaps the community can get some color on here( if it was disclose in your post, I apologize). And circling back to the DST structure for HVB, there’s a Calculation Agent included. I was wondering if you can provide more details as to their role for calculating values of the Collateral Types, Pricing (is it mark-to-market/fair value?), monitoring cash flows, etc.–and last but not least–does the calculation agent also perform “boots on the ground” services? Thanks in advance! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#19",
                    "likes": "4",
                    "time": "01/06/2022-21:48:05",
                    "content": "    flipflopflapdelegate:  With regards to establishing this Committee, can you please provide more color as to why a MIP is not needed (similar to MIP57) and what’s the thinking as to why it won’t need MKR token approval.   The MKR token holders will approve the formation of the Delegated Committee for each transaction as part of the Governance Process for that transaction.  Our intention is to describe the Delegated Committee in each Risk Assessment. We could do a MIP for the Delegated Committee. As I noted in today’s call, the Delegated Committee is, at this stage, for Maker RWA, an experiment. It may be useful to see how the proposal develops and then move towards a MIP once we have some useful datapoints.     flipflopflapdelegate:  I was wondering if you can provide more details as to their role for calculating values of the Collateral Types, Pricing (is it mark-to-market/fair value?), monitoring cash flows, etc.–and last but not least–does the calculation agent also perform “boots on the ground” services?   The Calculation Agent (perhaps better named the Confirmation Agent) will confirm whether a proposed loan participation submitted by HVB to the Trust meets the eligibility requirements of the Master Participation Agreement. If the Calculation Agent confirms that the proposed loan participation meets the eligibility requirements, the Calculation Agent will inform the Trustee and the Trust will then sign the Certificate of Participation (the instrument to evidence the Trust’s purchase of its share in a loan). If the Calculation Agent does not make such confirmation, then the Trust will not sign the Certificate of Participation. This role is common in securitization structures.     flipflopflapdelegate:  monitoring cash flows, etc.–and last but not least–does the calculation agent also perform “boots on the ground” services   We intend to have separate entities provide regular reports on cash flow, etc. Working from the underlying loans up to Maker, we are planning on the following reports:   HVB - Remittance report in respect of the underlying loans and principal, interest and other income distributed to the Trust.   Trustee - Remittance report in respect of the amounts paid by Trustee in accordance with the payment priority cash waterfall built into the Trust Agreement (tentative diagram below):    Screen Shot 2022-06-01 at 4.30.41 PM1496×820 129 KB   Crypto Servicer - Third party (TBD but likely to be the same company as the Calculation Agent) to roll-up the HVB and Trustee reports into a single report and then account for USD/DAI conversion costs as funds are remitted back to Maker through the exchange broker.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.445436507936508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "1",
                    "time": "01/06/2022-22:43:55",
                    "content": "    christiancdpetersen:  We intend to have separate entities provide regular reports on cash flow, etc. Working from the underlying loans up to Maker, we are planning on the following reports:  HVB - Remittance report in respect of the underlying loans and principal, interest and other income distributed to the Trust. Trustee - Remittance report in respect of the amounts paid by Trustee in accordance with the payment priority cash waterfall built into the Trust Agreement    Ah this is super cool!  Would it be possible to take those reports and feed the data to an RWA dashboard that Data Insights CU will be working on? Can those separate entities supply such? Tagging @data-insights-cu here for visibility. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.461309523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#21",
                    "likes": "2",
                    "time": "02/06/2022-11:49:52",
                    "content": "An interesting idea. Let us follow-up with @data-insights-cu. @teej @Eumenes ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#22",
                    "likes": "2",
                    "time": "02/06/2022-12:30:07",
                    "content": "    HospitableOryx:  Can we make a point to in the future revisit delegating additional decisions to third parties to increase decentralization? I think it makes sense to start w/ a heavier hand while we ramp up RWAs, but ultimately further decentralization will be valuable.   As outlined in the posts above, we will propose a Delegated Committee for each of SG Forge and HVB. To date, we have had 4 volunteers come forward to contribute. Thank you. And to all others, the invitation is always open! To re-emphasize a few points as the SG Forge and HVB transactions, in short order, come before the community for consideration:   The MKR token holders will have the ability to add or remove delegates at any time.   How the Delegated Committee functions in any deal is really a Maker token holder decision. Even after a transaction is implemented, the Maker token holders can, on an on-going basis, adjust how the Delegated Committee functions.   The Delegated Committee is an experimental process. We will continue to experiment, improvise and improve from deal to deal.   We will continue to push decentralization as much as possible. This will be part of the experimentation process.   We will also experiment with the cadence and quality of reporting from the Delegated Committees. Some transactions may require more or less.   We know what TradFi does in this area, but let’s design and implement a better process and one that is built for Maker DAO. @Eumenes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.358974358974359
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#23",
                    "likes": "4",
                    "time": "02/06/2022-20:53:28",
                    "content": "I’d like to point out that in my favorable view of this Delegated Committee we have participants who are decidedly NOT third parties. Rather, that this group be an extension of our decentralized core DAO structure and, therefore, must have people who are not otherwise significantly commercially involved with entities that are borrowers or other counterparties (unless properly disclosed and presenting no hazard to duties of care or loyalty to MakerDAO that would be appropriate for the role). @HospitableOryx ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#24",
                    "likes": "2",
                    "time": "02/06/2022-21:16:25",
                    "content": "Duty of care Duty of loyalty Key principles ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#25",
                    "likes": "0",
                    "time": "03/06/2022-03:35:15",
                    "content": "    christiancdpetersen:  I think this is the type of product that Maker will need to partner with a reputable, established and local institution   I personally know that Jim would love to work with MakerDAO to onboard emerging market bonds to DeFi. Untapped Smart Asset Financing was named one of Fast Company’s World Changing Ideas of 2022.  Screen Shot 2022-06-02 at 8.50.45 PM1276×584 61.1 KB     Untapped Global on Wefunder    Untapped Global: Profitable investing in emerging markets, made easy for... Profitable investing in emerging markets, made easy for everyone 🌍        docs.google.com    Google Slides This Slide is private      ",
                    "links": [
                        "https://wefunder.com/untappedglobal",
                        "https://docs.google.com/presentation/d/e/2PACX-1vRVJi9k7aseCQwqFic3GLjaS-ToFjmPFoylvR5kuiP7vK0yiXrxXCU4OyxkBothss8u6dDOqQ_A4bTq/pub?start=true&loop=false&delayms=30000&slide=id.g107300eb38b_0_1433",
                        "https://docs.google.com/presentation/d/e/2PACX-1vRVJi9k7aseCQwqFic3GLjaS-ToFjmPFoylvR5kuiP7vK0yiXrxXCU4OyxkBothss8u6dDOqQ_A4bTq/pub?start=true&loop=false&delayms=30000&slide=id.g107300eb38b_0_1433",
                        "https://docs.google.com/presentation/d/e/2PACX-1vRVJi9k7aseCQwqFic3GLjaS-ToFjmPFoylvR5kuiP7vK0yiXrxXCU4OyxkBothss8u6dDOqQ_A4bTq/pub?start=true&loop=false&delayms=30000&slide=id.g107300eb38b_0_1433"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.036796536796537
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptickatz",
                    "index": "#26",
                    "likes": "1",
                    "time": "03/06/2022-06:10:42",
                    "content": "Apologies I couldn’t attend as I had to undergo a surgery. Can I still attend the next office hours and contribute? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#27",
                    "likes": "6",
                    "time": "06/06/2022-17:57:36",
                    "content": "Thank you to all persons that have volunteered to participate in one or more of the Delegated Committees for the SG Forge and HVB transactions. To ensure the highest level of transparency and communication with the broader Maker community, RWF and the incubating LTS propose that each volunteer complete, and post on the Forum, responses to the following questions. This posting will enable the Maker community to have visibility on the proposed delegates.  Maker Forum Handle Describe experience and/or demonstrated interest in lending/credit investing, including financial, legal or operations Demonstrated interest in building better governance for DAOs Willingness to sign and abide by non-disclosure agreements with various counterparties Ability to attend regular (monthly) asset review meeting facilitated by RWF and LTS Ability to timely address commercial decisions needed on investment facilitated by RWF and LTS Willing to disclose any potential conflict of interest in respect of the particular investment to which an individual may serve on a Delegated Committee  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.660256410256411
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#28",
                    "likes": "4",
                    "time": "06/06/2022-22:14:38",
                    "content": "    Eumenes:  Maker Forum Handle   @psychonaut     Eumenes:  Describe experience and/or demonstrated interest in lending/credit investing, including financial, legal or operations   I don’t have any relevant formal education, but I worked as a software developer for investment banks in the 1990s. I’m almost 50 years old so I’ve been managing my own savings for some decades. My interest in finance was further piqued by the 2008 MBS debacle. I am happy to assist in onboarding RWAs at scale because this work is critical for the growth of MakerDAO.     Eumenes:  Demonstrated interest in building better governance for DAOs   I led the work on Recognized Delegate compensation.     Eumenes:  Willingness to sign and abide by non-disclosure agreements with various counterparties   I hereby declare my willingness to sign and abide by NDAs.     Eumenes:  Ability to attend regular (monthly) asset review meeting facilitated by RWF and LTS   I am able.     Eumenes:   Ability to timely address commercial decisions needed on investment facilitated by RWF and LTS    I am able.     Eumenes:  Willing to disclose any potential conflict of interest in respect of the particular investment to which an individual may serve on a Delegated Committee   I can’t imagine that I have any conflict with any of the assets involved in the SG Forge and HVB transactions. If a conflict does arise then I will recluse myself from the associated decision. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1157407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/humancapitol",
                    "index": "#29",
                    "likes": "1",
                    "time": "07/06/2022-13:33:41",
                    "content": "Think this is really powerful here - if there’s anything the BlockTower Team can do to put you in touch w/ calculation/paying agent + trustees, please let us know ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party offering help with proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Naren_Ramachandran",
                    "index": "#30",
                    "likes": "3",
                    "time": "10/06/2022-09:58:04",
                    "content": " Maker Forum Handle  Naren_Ramachandran  Describe experience and/or demonstrated interest in lending/credit investing, including financial, legal or operations  I have been in TradFi in various roles over the past 20 years, including structuring equity and debt transactions. Currently, I’m part of the senior management team of a small digital bank in Europe.  Demonstrated interest in building better governance for DAOs  I have recently started my journey with MKR and have contributed some of my thoughts in the Aggressive Growth strategy topic. Looking forward to further engagement.  Willingness to sign and abide by non-disclosure agreements with various counterparties  Yes, I’m able to.  Ability to attend regular (monthly) asset review meeting facilitated by RWF and LTS  Yes, I’m able to.  Ability to timely address commercial decisions needed on investment facilitated by RWF and LTS  Yes, I’m able to.  Willing to disclose any potential conflict of interest in respect of the particular investment to which an individual may serve on a Delegated Committee  Yes, I’m willing to fully disclose conflicts if any. I will have to do the same with my current employer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.514492753623188
                },
                {
                    "author_link": "https://forum.makerdao.com/u/humancapitol",
                    "index": "#31",
                    "likes": "5",
                    "time": "11/06/2022-19:38:50",
                    "content": "•\tMaker Forum Handle @humancapitol •\tDescribe experience and/or demonstrated interest in lending/credit investing, including financial, legal or operations Partner, Head of Credit at BlockTower VP/Head of ABS CDO Structured Credit Trading @ Citigroup Covered private + public securitized credit across residential + commercial RE, consumer loans, and other esoterics Director of operations (risk/underwriting) at Capchase (series B fintech lender) •\tDemonstrated interest in building better governance for DAOs Absolutely – we have been working closely w/ the Maker team to support across their various initiatives. As of today, we work closest with the RWF team, providing market color and credit analysis when requested. •\tWillingness to sign and abide by non-disclosure agreements with various counterparties Yes •\tAbility to attend regular (monthly) asset review meeting facilitated by RWF and LTS Yes •\tAbility to timely address commercial decisions needed on investment facilitated by RWF and LTS Yes •\tWilling to disclose any potential conflict of interest in respect of the particular investment to which an individual may serve on a Delegated Committee Yes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.313888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#32",
                    "likes": "3",
                    "time": "12/06/2022-19:48:23",
                    "content": "This is really interesting, thank you for sharing. I’m kinda late now but would like to be part of something like this in a future opportunity. Really keen on knowing more! I have a traditional finance/accounting background btw. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.854166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeremy_Kim",
                    "index": "#33",
                    "likes": "3",
                    "time": "15/06/2022-15:30:54",
                    "content": "    Eumenes:  Maker Forum Handle   @Jeremy_Kim     Eumenes:  Describe experience and/or demonstrated interest in lending/credit investing, including financial, legal or operations   In order from most recent to older:  Working with a team to bridge TradFi structured credit transactions into DeFi Worked with a structured credit hedge fund on analyzing and monitoring structured credit opportunities both in private credit (asset-based revolving warehouse lines, asset-based term loans, whole loan flow purchases) as well as public securitization markets (ABS, non-agency RMBS, etc). Worked with a bank on pricing and monitoring risk of various private credit and public securitization positions held on balance sheet. Worked with a financial data platform on pricing public securitization bonds and monitoring primary and secondary markets for those bonds. Worked with a public accounting firm on pricing and assessing credit risks of private credit and public securitization positions held on balance sheet of audit client companies, as well as reverse engineering public securitization deals to validate data/claims made on prospectuses. Here is my Linkedin for more details: https://www.linkedin.com/in/jeremiahkim/       Eumenes:  Demonstrated interest in building better governance for DAOs   I am a firm believer in the benefits of DAOs - less bloat, less rent-seeking/low value-add parties, etc. However, there are also definite benefits of centralized systems - quicker execution, easier accumulation of deeper specialized knowledge, etc. I think the implementation/execution of good governance is integral for a DAO in staying firmly on the “decentralized” side of the very fine line between decentralization and centralization, while minimizing the losses of the benefits of centralized systems (inversely, poor governance would result in extremely slow processes, or a system that is decentralized in name only). My interest in DeFi and DAOs started quite recently (beginning of 2021), but since then, beyond my day job (bridging TradFi structured credit into DeFi), I have been both actively and passively participating in a few RWA DeFi protocols.     Eumenes:  Willingness to sign and abide by non-disclosure agreements with various counterparties   Absolutely willing, and understand that this is common practice in the TradFi world.     Eumenes:  Ability to attend regular (monthly) asset review meeting facilitated by RWF and LTS   Yes.     Eumenes:  Ability to timely address commercial decisions needed on investment facilitated by RWF and LTS   Yes.     Eumenes:  Willing to disclose any potential conflict of interest in respect of the particular investment to which an individual may serve on a Delegated Committee   Yes, I am willing to disclose any potential conflicts. This is also very important, and a common practice in TradFi, and should be replicated/enforced in the RWA DeFi world as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.237326388888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#34",
                    "likes": "1",
                    "time": "21/06/2022-17:00:36",
                    "content": "    Eumenes:  Maker Forum Handle   @ElProgreso     Eumenes:  Describe experience and/or demonstrated interest in lending/credit investing, including financial, legal or operations   Participant of the original RWA Committee (MIP57), former employee of a financial services provider, and limited experience in Commercial Lending as an employee of one NYC largest commercial lenders.     Eumenes:  Demonstrated interest in building better governance for DAOs   Participant in Maker Governance since the crypto winter of 2018. Individually voted with my MKR since 2018, and as a Recognized Delegate since inception of the Delegation Platforms. Over the last 3.5 years we have tried to help in building a better decentralized governance via MakerDAO. And although not perfect, by public reactions  we have met this DAO is the premier DAO of DAOs.     Eumenes:  Willingness to sign and abide by non-disclosure agreements with various counterparties   Yes, I am able.     Eumenes:  Ability to attend regular (monthly) asset review meeting facilitated by RWF and LTS   Yes, I am able.     Eumenes:  Ability to timely address commercial decisions needed on investment facilitated by RWF and LTS   Yes, I am able.     Eumenes:  Willing to disclose any potential conflict of interest in respect of the particular investment to which an individual may serve on a Delegated Committee   Yes, I am able. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.684047619047618
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#35",
                    "likes": "9",
                    "time": "22/06/2022-13:14:04",
                    "content": "UPDATE @Real-World-Finance received 7 submissions to volunteer and serve as members of a delegated committee for HVB and SG Forge. Jeremy Kim    @Jeremy_Kim Kevin Miao    @humancapitol Naren Ramachandran  @Naren_Ramachandran Joshua Pritikin  @psychonaut Frank Cruz  @flipflopflapdelegate Aayush Katiyar @cryptickatz Justin Shee  @justin1066 For HVB, we will propose a committee of 5 persons. The proposal will be in the HVB Risk Assessment. In proposing a committee of 5 persons, our logic is as follows:   Have a reasonably sized Delegated Committee (3 vs 5 vs 7) with a measure of checks and balances   Have the Delegated Committee include some members with credit experience (especially given the size of the vault)   Have a member active in the Maker community (a recognised delegate or otherwise)   Ensure that we can propose a Delegated Committee with different members in subsequent transactions   No participants from the Real World Finance, incubating LOVE, or incubating LTS core units   As I have noted in the chain above and during Real World Finance office hours, the Delegated Committee is a proposal to address real world decision-making and to create a transparent mechanism for the Maker community to have visibility into the underlying assets. TO BE ABUNDANTLY CLEAR   Maker token holders have complete and total discretion to reduce the Delegated Committee to any figure (including zero) at any time so that ALL matters are determined by a Maker token holder vote   Maker token holders can replace any member at any time   Maker token holders can request more or less transparency   The Delegated Committee is an experiment   Objectively, my long-term goal is to delegate as much decision-making as possible to independent, third party actors - better yet, automate. This will come. In the TradFi space, investment-grade, public bond securitizations reflect this goal – bond holders are asked to make very few decisions because the assets are investment grade quality, the legal structures and covenant terms limit borrower flexibility, information gathering and sharing is high, and independent, third parties (not the borrower and not the bondholders) verify real world activities. As always, I welcome suggestions from each member of the Maker community on how to innovate and improve on this particular work stream. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#36",
                    "likes": "0",
                    "time": "22/06/2022-14:07:22",
                    "content": "    christiancdpetersen:  TO BE ABUNDANTLY CLEAR  Maker token holders have complete and total discretion to reduce the Delegated Committee to any figure (including zero) at any time so that ALL matters are determined by a Maker token holder vote Maker token holders can replace any member at any time Maker token holders can request more or less transparency    Hi Christian, just so we can be sure if GovAlpha gets approached for advice - is the proposed mechanism for MKR holders to make changes a Signal Request? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.738095238095237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#37",
                    "likes": "2",
                    "time": "22/06/2022-21:09:35",
                    "content": "@Patrick_J - Thank you and a good question. @flipflopflapdelegate had earlier asked if we intended to formalize as a MIP. My view is that the Delegated Committee is an experiment and the Maker token holders should have flexibility to make adjustments. To that end, I would propose that a Signal Request be the appropriate Maker governance tool to effect changes, etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#38",
                    "likes": "0",
                    "time": "22/06/2022-21:20:28",
                    "content": "The MIP58 already codify the creation of a committee. It might need the RWA Foundation to have the updated constitution. the SR way might allow to move quicker if the GovAlpha think it’s better. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#39",
                    "likes": "0",
                    "time": "23/06/2022-16:37:21",
                    "content": "Thanks, Christian, that’s what I thought would be the case but it’s always good to align expectations in advance. If you do go down the MIP route and want to design a governance process around this, feel free to reach out to me ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.144444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SupplyMECapital",
                    "index": "#40",
                    "likes": "0",
                    "time": "19/08/2022-05:36:52",
                    "content": "Hi, very interesting proposal. Since I’m new in this community (please see my recent post), I offer my expertise regarding the new RWA “Inventory” (both warehoused - Inventory Monetisation - see supplymecapital.com - and “in-transit”, for typical trade DEfinance transactions) All the best ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party offering expertise to proposal"
                    ],
                    "Sentiment": 6.463383838383838
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#41",
                    "likes": "0",
                    "time": "17/11/2022-05:37:32",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}