{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/interview-with-seamus-on-the-oracle-team/6425",
            "title": "Interview with Seamus on the Oracle Team ",
            "index": 6425,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "fun"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#1",
                    "likes": "11",
                    "time": "07/02/2021-13:44:44",
                    "content": " SAN FRANSOKYO – The toughest part of being an investigative crypto-journalist is having to be critical of the protocols you love.  Which is why it broke my heart to learn about Maker’s oracle outage a few months ago.  Alas, it is my duty to ask the tough questions, so I reached out to Seamus, a developer on Maker’s oracle team, to get to the bottom of the story. Maker Header.PNG855×268 28.6 KB Uncle: I’m just going to get right into it Seamus, WTF happened!? Seamus: Yeah, it was our bad. We missed the rapid growth in the Scuttlebot state size, which led to the oracle outage. But the event really opened our eyes to the over-complexity the system, so we gutted the whole thing and replaced it with something simpler. Uncle: Oh, wow, I didn’t realize Maker replaced the oracles. Seamus: Yeah, managing the light feeds, dark feeds, and VWAPs just got too complicated, so we switched to a multisig and are entering the prices manually. Uncle: Wait, did you say manually? Seamus: Yeah, the DeFi space is pretty comfortable with multsigs right now. I mean, if you knew how much value was secured by multisigs, you would vomit. But Maker has historically been criticized for not adapting to the times, so this is more or less a response to that. Uncle: So how do you use a multisig for the oracles? Seamus: Well, pretty much everyone on the oracle team is a yield-farming degenerate on a razor’s edge of liquidation (shout out to Mariano!), so we’re already plugged into CoinGecko 24/7. Then every hour we coordinate in our group TikTok chat to decide what prices to push. Maker Oracle Flow785×441 39.6 KB Uncle: And you don’t think that is a security risk? Seamus: Hardly. During the last ETH pullback one of the larger vaults was going to be triggered for liquidation by only $3.50. We were pretty confident ETH was going to rally by the next OSM update, so we rounded up and saved the vault. To me, that’s just good customer service. Uncle: I don’t know. Maker has billions of dollars locked in the protocol. It seems exceptionally irresponsible for prices to be determined by a small group of people in a chat room. Seamus: I mean, that’s pretty much how Chainlink works… As always, I’ll be following up on this story as it develops. Follow me on Twitter for the latest crypto news @UncleRewards.  Also, I’m trying to pay off my student loans through SourceCred so… ",
                    "links": [
                        "https://forum.makerdao.com/t/scheduled-grain-distribution-for-week-ending-february-14th-2021/6605"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.332163207163207
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "3",
                    "time": "07/02/2021-14:14:24",
                    "content": " I know this might be fun, for those who get the joke… But is it responsible to tweet this in the open?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "0",
                    "time": "07/02/2021-14:37:13",
                    "content": "I think its great. Funny work as always @Uncle! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/02/2021-22:39:41",
                    "content": "I assure you everyone at The Uncle Rewards pledges an oath daily to uphold journalistic integrity.  As the editor in chief, I am more than willing to print redactions when presented with accurate data. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iantgilbert",
                    "index": "#5",
                    "likes": "0",
                    "time": "10/02/2021-15:17:35",
                    "content": "Excellent.  Very funny.  Thanks  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.541666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "12/05/2021-21:17:59",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}