{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/6s-rwa001-a-document-roadmap/7413",
            "title": "6s - RWA001-A - Document Roadmap ",
            "index": 7413,
            "category": [
                "Governance"
            ],
            "tags": [
                "sixs",
                "rwa-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "10",
                    "time": "09/04/2021-15:43:27",
                    "content": "NOTE: This page will be updated with links as documents become available. For a review of the draft documents, please see the below links  Downstream Agreements Transfer Instructions  Broker Dealer  To / From   US Bank  Custody Agreement     Credit Agreement Security Agreement Trust Agreement  Please review all of the documents and provide any feedback in either the associated thread or to me directly at [email protected] Important note: All of the documents above, when executed, will require a legal enforceability opinion in the relevant jurisdiction(s). In addition, Wilmington Saving Fund Society (www.wsfsbank.com) and the RWA Senior Lending Trust are both represented by Richards Layton & Finger (www.rlf.com) in Delaware, so the focus should be on the salient business points. As downstream transactions continue to build-up, I am requesting the community to provide comments / feedback for possible integration within 10 calendar days after the last document is posted (which is presently looking like it will be the Trust Agreement). I will provide plenty of guidance as that time approaches. Once draft documents are posted, I will be scheduling conference calls multiple times per week to give the community multiple opportunities to ask questions to both become familiar with the structure and ask related questions. While I will do my best to recommend that all applicable feedback be integrated, I cannot guarantee it. All feedback must be within the framework of still being able to be blessed by legal counsel for the Trust and Trustee, as the legal opinion is essential for both the Trustee and the community in general (so the only assurance will be a commitment to try). After the community has provided its comments, we will integrate comments where possible and then go into closing mode. At that stage, all operative documents will be executed (less the downstream documents as those are reserved for each closing). Final versions of all applicable documents and form of legal opinion will be uploaded and referenced below with conformed signatures (e.g. /s/name). The final executed version with signatures will be shown to the mandated actors only. In parallel, we will be working with WSFS to get the custody account for the CayCo setup and then integrated with the Broker/Dealer. We will work with the Mandated Actors and the community as a whole to setup “test transactions” to demonstrate the flow of funds. Thereafter, we will follow the process established to raise the associated debt ceiling from the current 1000 DAI to the initial debt ceiling of 15MM DAI and get rolling! We have plenty of deals waiting to be financed.  Smart Contract Verification RWA001-A Operational Flow (Smart Contract)  For a review of the executed documents, please see the below links  6s Capital LLC  Formation / Good Standing   6s Capital Partners LLC  Formation / Good Standing   RWA International Ltd.  Formation Register of Members Resolutions Trust Broker/Dealer  DAI address confirmation & Transfer Instructions   Escrow Account & Transfer Instructions   RWA Senior Lending Trust  Formation Trust Agreement   Security Agreement Credit Agreement  Downstream Agreements (Same as drafts)   Flow of funds guide  DAI is drawn via MIP21 DAI arrives at the DAI address for CayCo at the Broker/Dealer and is exchanged for USD (pursuant to the irrevocable transfer instructions) USD arrive at the custody account (for CayCo) Per the custody account transfer instructions, USD fund the Trust account which is governed by the Trust Agreement. The Trustee is authorized to released capital pursuant to the Credit Agreement to LendCo based on agreed upon terms  #5 happens over and over until such time as the Trust Sponsor (CayCo) or LendCo want the funds to returned. Funds are then sent back to the custody account (for CayCo) which has irrevocable transfer instructions to send USD to CayCo’'s Broker Dealer account. The Broker Dealer then exchanges USD for DAI per the irrevocable transfer instructions, and then send the DAI to the input conduit on MIP21 for repayment.   Reference: Declaration of Intent RWA001-A How MakerDAO is protected ",
                    "links": [
                        "https://forum.makerdao.com/t/rwa-broker-dealer-transfer-instructions/8029",
                        "https://forum.makerdao.com/t/rwa001-a-custody-agreement/7724",
                        "https://forum.makerdao.com/t/6s-credit-agreement/8033",
                        "https://forum.makerdao.com/t/6s-security-agreement/7939",
                        "https://forum.makerdao.com/t/rwa-senior-lending-trust-trust-agreement/7721",
                        "https://investors.wsfsbank.com",
                        "https://www.wsfsbank.com",
                        "https://www.rlf.com",
                        "https://forum.makerdao.com/t/rwa001-verification-process-third-party/7722",
                        "https://forum.makerdao.com/t/rwa001-a-operational-flow-smart-contract/7760",
                        "https://forum.makerdao.com/t/6s-capital-llc-formation-good-standing/7414",
                        "https://forum.makerdao.com/t/6s-capital-partners-llc-formation-good-standing/7415",
                        "https://forum.makerdao.com/t/rwa-international-ltd-formation-articles-memo-rod/7416",
                        "https://forum.makerdao.com/t/rwa-international-ltd-register-of-members/7417",
                        "https://forum.makerdao.com/t/rwa001-a-rwa-international-ltd-resolutions/7725",
                        "https://forum.makerdao.com/t/rwa-international-ltd-charitable-trust/7418",
                        "https://forum.makerdao.com/t/6s-broker-dealer-dai-address/9780",
                        "https://forum.makerdao.com/t/6s-transfer-instructions-conformed/9778",
                        "https://forum.makerdao.com/t/rwa-senior-lending-trust-formation/7983",
                        "https://forum.makerdao.com/t/rwa-senior-lending-trust-amended-and-restated/9773",
                        "https://forum.makerdao.com/t/6s-trust-agreement-conformed/9776",
                        "https://forum.makerdao.com/t/6s-credit-agreement-conformed/9775",
                        "https://forum.makerdao.com/t/6s-capital-llc-downstream-agreements/7457",
                        "https://forum.makerdao.com/t/mip13c3-sp4-declaration-of-intent-commercial-points-off-chain-asset-backed-lender-to-onboard-real-world-assets-as-collateral-for-a-dai-loan/3914",
                        "https://forum.makerdao.com/t/6s-rwa001-a-how-makerdao-is-protected/7723",
                        "https://forum.makerdao.com/t/real-world-assets-strategy-for-2021/7570",
                        "https://forum.makerdao.com/t/a-walkthrough-of-the-6s-capital-trust-structure/8594",
                        "https://forum.makerdao.com/t/6s-capital-state-of-the-business/4420/34",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-9-15/7509",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-137-thursday-april-15-17-00-utc/7384/3",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-04/7798",
                        "https://forum.makerdao.com/t/calling-all-large-scale-secured-off-chain-lenders-e-g-future-competitors/7860",
                        "https://forum.makerdao.com/t/sixs-rwa-001-6s-preliminary-contracts-assessment/8233",
                        "https://forum.makerdao.com/t/ama-6s-capital-rwa-implementation/8585",
                        "https://forum.makerdao.com/t/executive-vote-request-raising-6s-rwa001-a-debt-ceiling/9893",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482"
                    ],
                    "GPT-summary": "The author of the proposal is requesting feedback from the community on a set of draft documents related to downstream transactions. The author provides links to the documents and asks for feedback within 10 calendar days. The author also mentions the need for legal enforceability opinions and the involvement of legal counsel. The post also outlines the operational flow of the proposal and provides links to relevant documents.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 5.774592731829574
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "1",
                    "time": "09/04/2021-19:15:50",
                    "content": "I’m not sure the forum is the best place to archive these documents. A static web page with links to download each PDF would seem preferable. If you want to ensure immutability then you could post sha1sum hashes as well. Or you might post additional links to identical docs on IFPS. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#3",
                    "likes": "5",
                    "time": "10/04/2021-08:31:51",
                    "content": "This really isn’t for archival as much as it is for transparency. All of the associated parties have copies (emphasis with the Trust Company). As we get to the draft documents, folks will have questions. There is a huge advantage i would have to do this “in the dark”. Though counterintuitively, doing it in a transparent and open manner will help A) get the community aware of what and how this happens and build trust and thereby be more likely to expand associated debt ceilings when needed and B) builds a roadmap for future LendCOs which will be essential for the protocol to grow to scale. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "2",
                    "time": "10/04/2021-08:53:44",
                    "content": "While the effort of transparency is great, reading images is a bit messy. A google drive with those pdf would be much easier to navigate. Happy to provide one if needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#5",
                    "likes": "1",
                    "time": "10/05/2021-08:46:16",
                    "content": "    mrabino1:  I am requesting the community to provide comments / feedback for possible integration within 10 calendar days after the last document is posted (which is presently looking like it will be the Trust Agreement). I will provide plenty of guidance as that time approaches.   At present there are three fundamental documents that remain. Drafts of:  Credit Agreement Transfer Instructions Trust Agreement (full)  Having received the most recent version of the Trust Agreement over the weekend, we are tracking to post all of the above in short-order. The Trust Agreement draft includes all of all of the controls mentioned on a recent G&R call whereby MKR governance retains throttle and liquidation control. More soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#6",
                    "likes": "1",
                    "time": "11/05/2021-08:33:03",
                    "content": "    mrabino1:  Flow of funds guide   Updated to include a flow of funds, and how the documents will interact with each other. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#7",
                    "likes": "8",
                    "time": "12/05/2021-17:07:19",
                    "content": "The remaining drafts credit agreement & trust agreement are being posted later today. I will be scheduling a couple zoom calls each week for the next two weeks to answer any questions the community will have related to how all of the documents flow together. As outlined at the top, we will try to get integrate all comments where applicable. Thereafter, a closing will be scheduled to finalize all of the documents and “arc-weld” everything together. A special shout-out and thank you to each of the law firms that help provide guidance and input to get us where we are today.  Walkers (Cayman Island) Richards Layton & Finger Delaware Counsel Group 6s’ counsel   On the dawn of all transactional documents related to this structure, some quotes to ponder… “Everything that can be invented has been invented.” - Charles H. Duell, Commissioner, U.S. Office of Patents, 1899 “If there’s magic in boxing, it’s the magic of fighting battles beyond endurance, beyond cracked ribs, ruptured kidneys and detached retinas. It’s the magic of risking everything for a dream that nobody sees but you.”  - ‘Million Dollar Baby’ (2004) “The electric light did not come from the continuous improvement of candles.” – Oren Harari “One day or Day one… You decide…” - Unknown “A journey of a thousand miles begins with a single step.” - Lao Tzu “The two most important days in your life… the day you were born and the day you find out why.\" - Mark Twain “Great moments are born (from) great opportunity” ― Nikola Tesla ",
                    "links": [
                        "https://www.rlf.com/lawyers/tara-j-hoffner/",
                        "https://delawarecounselgroup.com/ellisa-habbart/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#8",
                    "likes": "2",
                    "time": "17/05/2021-20:53:08",
                    "content": "For those that have questions on the structure, I am going to be holding an office hours zoom call tomorrow (1:30PM CST) and then again on Thursday at 4pm CST to review with the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#9",
                    "likes": "0",
                    "time": "20/05/2021-20:59:56",
                    "content": "Call reminder… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#10",
                    "likes": "0",
                    "time": "20/05/2021-21:03:41",
                    "content": "I can’t make the call, but would love to chat about if a form of this architecture could be used to house bonds and other fixed income instruments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#11",
                    "likes": "0",
                    "time": "20/05/2021-21:10:39",
                    "content": "DM me, and we can carry on the conversation. The short-answer is yes… BUT it would then be an investment company which pulls in a bunch of well intended securities laws (e.g. the 1940 act) that would then govern the structure. However, putting “loans” (as a defined term) in the structure would not be a “bond” and possibly / probably not be governed by the same laws. That said, securities attorneys are worth every dollar to ensure compliance with applicable laws. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#12",
                    "likes": "1",
                    "time": "04/06/2021-19:31:12",
                    "content": "Updated Trust Agreement posted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#13",
                    "likes": "2",
                    "time": "04/06/2021-19:48:16",
                    "content": "Updated Credit Agreement posted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#14",
                    "likes": "0",
                    "time": "04/06/2021-19:49:23",
                    "content": "There were no changes to the Security Agreement. No other comments from the community were received. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#15",
                    "likes": "0",
                    "time": "04/06/2021-19:52:30",
                    "content": "All documents have been circulated to the participants for the upcoming closing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#16",
                    "likes": "2",
                    "time": "11/06/2021-16:58:50",
                    "content": "All, A special thank you and shout out to those that provided feedback publicly (and those that did so privately) ! As a part of the overall upcoming closing, we are locking down change requests to the underlying transactional documents from the community. As such, all subsequent community change requests will need to get deferred until we have the first amendment of the transactional documents (which for certain will happen, my guess is within six months). This will then follow a similar process of being posted in the forums and getting consensus and then demonstrating to all relevant parties that the “affirmative vote of MakerDAO” approves those amendments before anything can change. The above being said, just like smart contracts, this is an iterative process to improve over time. Let’s roll forward to closing !! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.538728632478632
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#17",
                    "likes": "2",
                    "time": "12/06/2021-14:16:20",
                    "content": "Its been a long journey but it will be worth it in the end. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#18",
                    "likes": "8",
                    "time": "06/08/2021-16:56:12",
                    "content": "This transaction has closed. Documents will be posted early next week. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#19",
                    "likes": "0",
                    "time": "05/11/2021-22:57:10",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}