{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rwa-6s-yolo-and-winding-down-2021/12431",
            "title": "RWA - 6s - YOLO and winding-down 2021 ",
            "index": 12431,
            "category": [
                "Updates"
            ],
            "tags": [
                "sixs",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "6",
                    "time": "31/12/2021-18:31:59",
                    "content": " RWA - 6s - YOLO and winding-down 2021  On a personal note as 2021 winds-down  “Life is about finding out who you really are… and then figuring a way to be happy with what you find.”   \"Anything worth doing is worth overdoing…”  Each of us comes from a diverse background and is unique. This is the DAO’s collective strength. We were all drawn to this DAO for various reasons, purposes, or even missions. What binds us is the “why.” Imagine the following premise is you will  You are aged 25-55 (some outliers of course!). You either have a family or are thinking of having one. You want the change for your children as you endured the faults that you want to correct You are educated (formally or with a book). You understand enough about technology and economics to join with a community of like-minded folks. You are driven, even if you don’t know why.  For some it is greed, ambition, power, envy… the list goes on of negative attributes that painfully drive others… For some, it is the notion of change (micro or macro) or giving. For some it is beyond technology and has its impact to better the environment itself. Wherever you are on your individual path to financial freedom, take a moment and reflect on >> IF << you are already there and what would you do the following day? (some of you may already be there !) Assume for a moment you have made all the money you will ever need and never need to work again … not for your spouse, children, nor grandchildren. Tomorrow you will wake up and ask yourself “what contribution that is positive and beneficial in this world will you make?”  What gives you purpose? What drives you will be different from the next person. Personally, my motivator is change (for the better), the exclusive pursuit of profit is not the core-objective but is a nice byproduct (with some good ole’ economic innovation at work, that will cause challenges for incumbents).  “A stock’s historic performance is not representative nor can it be an accurate prediction of future performance. When it comes to people, the exact opposite is true.” - Unknown  There are fundamentally two paths, run a lending operation or manage an investment fund of bonds. There is no question that 6s is here for the former, >> not << the latter. Operating lenders provide loans that can target a specific borrower with a desired outcome (e.g. lending to solar increases solar usage). This is where 6s wants to singularly-focus. We want to be an agent of constructive mission-driven change for the greater good of humankind. As already shown, 6s has TradFi banks waiting to lend against its originated collateral and could secure a revolver to do the identical business model. In that context, what has been constructed between 6s and a Delaware Statutory Trust is >> NOT << unique. It was intentionally designed to replicate a classical bank revolver (but from a non-bank source); the novel component was “getting dollars to Delaware.” Once the Trust is capitalized, it is not unique, rather the mission is. Maker (or its legal embodiment) must compete on terms compared to TradFi, else it risks being replaced. That is to say that 6s doesn’t “need” Maker to execute its business model, it is purely a source of credit to marry to equity for its operations, this is per design. Buuuuut even if 6s doesn’t “need” MakerDAO as a credit provider… 6s wants it. The reasoning is simple. I know in my core what we are collectively building is something good, powerful, competitive, and useful to society. I very much hope this sentiment is shared by others. Once the perception of money / power / influence is tied to RWAs, politics follows. This is highly unfortunate but far from unexpected. It is for this reason that I continually advocate for more LendCOs / Arrangers to ensure a competitive landscape. This cannot happen soon enough.  “If you want a friend in Washington DC, get a dog”…  Politics is politics. This will never change. Not in DC nor any organization. There is always politics. (Painfully) Wherever there are people that work together, there will be politics. Many of the challenges in the modern world are that politics have been taken to such a degree that folks have forgotten for whom they are advocating. What is their motto? What is their north star? Are they purely self-serving or is their mission the pursuit of something better, something beyond themselves? While incredibly young, this DAO too shall succumb to the same fate as modern governments without an infusion of fresh energy being reaffirmed and maintained with a “north star” that guides us. How or even WHY will we be any different? How do we purge political infighting within the DAO? This is an excellent question, that each of us will have a different solution. If you are even considering how to solve this challenge when reading this, it is revealing on your character as much as the DAO itself. We need problem solvers, not problem creators. It is the >> pursuit << of a more perfect organization that guides me. The DAO will never be perfect. This I have accepted, though the constant pursuit of being better is a curious motivator. From my lens, what binds the DAO is something deeper.  \"Be better. Do better.”  Some will argue it is “us” against “them” (whomever “they” are). I disagree. Finding a common “enemy” to bind us empowers those with negative (even toxic) energy. When the DAO focuses on the positive, we let our “enemies” (whomever they are) go down while we take the high road. (That doesn’t mean we put our heads in the sand and don’t prepare !) The above said, I have no aspirations to be a career MakerDAO politician, rather only an operator (and grey-haired community member). I have been around Maker since Fall-2018 and have called for the need for RWAs since basically day 0. I am here to watch & participate as RWAs move from the background to being a luminary within the DeFi ecosystem.  Organizational politics is best left to others. Whether I am too crusty, edgy, or grumpy with age, I am just here to accomplish a mission (that is to have a plan and execute it). This will annoy some and may inspire others. I will have to just take my hits as I go. The political “calculus” on the best how and when to do X or Y may have to wait for another day. Today, there is an urgent need for targeted diversification and that is my mission.   So 2022 is almost here … Please ask yourself what can you do to help? What is your mission? Assume you could retire tonight at midnight, what would you do tomorrow and why!? Put bluntly… What is your objective? Only you can answer this nuanced yet insightful question. We have a world that needs change for the better. We need teams of folks whose pursuit is not driven by “number go up?” or “when airdrop?” but rather sustained constructive mission-oriented change that comes from within to make things better for others.  In closing, 2021 was an intense year of building for 6s Capital but from my lens well worth it. We are on a mission and the foundation has been put down. 2022 is where it all comes together! Happy Holidays from the 6s family to yours !! Let’s roll ! /fin ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.943877136893718
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#2",
                    "likes": "4",
                    "time": "31/12/2021-21:16:12",
                    "content": "I think you have hit the nail on purpose! Being part of something greater and world changing is what likely drives many of the regular maker contributors, I’m honestly amazed at how you managed to construct it all from scratch (remember dearly your open calls to answer any and all questions and going through the 6S model again and again). If there is something that defines you imo is patience and perseverance (or add strategic before if we get nostalgic). I have no doubts that 2022 will be an interesting year for 6s! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.078125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "31/03/2022-21:17:05",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}