{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dux-post-mortem-unavailability-of-on-chain-effects-tab/10007",
            "title": "[DUX] Post Mortem: Unavailability of 'On-Chain Effects' Tab ",
            "index": 10007,
            "category": [
                "Core Units",
                "Sustainable Ecosystem Scaling"
            ],
            "tags": [
                "executive",
                "governance-portal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bainpm",
                    "index": "#1",
                    "likes": "10",
                    "time": "24/08/2021-19:46:05",
                    "content": " Context On August 6th, DUX team discovered a bug that caused the Governance Portal’s “On-Chain Effects” tab on the executive vote detail page to display an error message. Upon investigating, we noticed that the data presented in this section relies on an external API hosted by ethtx.info, which was unavailable. We contacted the maintainers of the endpoint to learn why it was unavailable, and we learned that it was down temporarily due to an infrastructure upgrade, and that they are working on an upcoming v2 release. We changed the error message shown by the component slightly to reflect the nature of the issue being temporary. Soon thereafter we decided the best way to handle the situation was to temporarily remove the On-Chain Effects tab completely so as not to confuse our users. This was done and scheduled to be deployed on our next bi-weekly deployment, on August 31st. At the time we weren’t aware of the extent to which the On-Chain Effects feature was utilized by the Gov Alpha team, and that it was an important review step in their QA process for deploying executive votes. This past Friday @prose11 reached out to the DUX team asking why the on-chain effects feature was not available, upon which we explained the situation. Fortunately @prose11  and the resourceful Gov Alpha team were able to satisfactorily complete their review checklist and eventually launch the vote, however their process was negatively impacted by our feature being unavailable.  What’s Next The DUX team mission is to enable best-in-class decentralized decision-making for the Maker Protocol by providing a meaningful user experience for all governance participants. The On-Chain Effects feature fits into this as it is an important tool to bring more transparency, verifiability, and security to the product. As such, we want to make the changes that are needed to make this a more reliable feature. We will take the following steps to mitigate similar incidents in the future:  The first step we will take is focused on better understanding how different user types use the various products and features. We will meet with members of the Gov Alpha team to discuss their usage of the Governance Portal in order to identify their wants and needs. In addition, we have recently added a Product Manager to the team who will focus on adopting a more user-centric and data-driven approach to how we build and maintain products for MakerDAO. As a second step, we will do a thorough review on how our products rely on third-party APIs and libraries, and explore alternative implementations or redundancy. As mentioned in our vision statement, we strive for maximum availability of our products in the interest of protecting MakerDAO against governance attacks. Since the On-Chain Effects feature relies on an external endpoint of which the maintainers cannot assure reliability, we will explore alternative implementations or redundancy to handle service changes or downtime.  We expect that the aforementioned steps will mitigate similar incidents from occurring in the future. Since stakeholder communication is a unique challenge for DAOs, including MakerDAO, the DUX team upholds transparency as a key principle. This post mortem aligns with that principle and enables learning and improving ways of working in MakerDAO. As we continue building, we are committed to continuously learning and optimizing our process together with the other Core Units. If you have any questions or feedback, please join us in our Discord channel! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp18-adding-development-ux-core-unit-dux-001/9770",
                        "https://discord.gg/UdZHDtxx",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-august-29th-2021/10098",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-20-26/10032",
                        "https://forum.makerdao.com/t/executive-delay-2021-08-21/9970/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.696440972222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/11/2021-19:46:13",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}