{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govcomms-bi-weekly-update-oct-01-15/11070",
            "title": "GovComms Bi-Weekly Update: Oct 01 - 15 ",
            "index": 11070,
            "category": [
                "Core Units",
                "Governance Communications"
            ],
            "tags": [
                "com-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "4",
                    "time": "18/10/2021-12:04:39",
                    "content": " GovComms Bi-Weekly Update Oct 01 - 15, 2021  Administrative Update  Engagement Lead Hired! Thomas Flitter joined us on October 4th and has begun the onboarding process to familiarize himself with MakerDAO. Be nice, say hello, and don’t be afraid to meet! Thomas has over 20 years of stakeholder engagement experience at a major energy utility company in the United States—experience he is eager to leverage. I am excited that he is a part of our team and the greater Maker-DAO, together we’re looking forward to leveling-up the organization!  Budget Modification in RFC Budget modification proposal SP40 has been published to the forum. The main changes are:  Travel figures updated; More accurately reflects expenses by assuming one team-wide offsite for three people, and coverage for two people to attend up to three events per year. Salary line item updated; More accurate. Hourly Compensation item updated; More accurate. Operating Expenses item updated; More accurate.  For detailed figures visit the proposal linked above.  Work Being Done Since the launch of the CU, we have added a ton to our public drive. Supporting documentation around all our active projects is growing with project plans/descriptions, metrics tracking, and workflow process docs coming into existence and being iteratively improved upon.  MakerDAO Meeting Structure Revamp Our team, in partnership with GovAlpha and SES, are working on a plan for scaling MakerDAO meetings to accommodate the increasing number of teams and business initiatives. L2 and RWA initiatives were modeled out. More thought and research are being done before any definitive changes are recommended by our team.  Emergency Playbook Currently, we are working on completing resources for two emergency types; Market Events and Missing Persons. A draft of the full playbook is in the backlog and will become a major focus very soon, in the meantime we are working on the individual emergency-type resource documents.  MakerDAO People List We’ve made a good amount of progress and will continue to do so. Besides building the list through outreach, we are also developing a policy for the data collection and maintenance of this database. As a part of that effort, in the coming weeks, we will be meeting with legal counsel who specializes in this to further advise us on the appropriate setup.  Information Output Audit Artem and Thomas will both be working on it for the next two weeks as a joint side-project.  Issue Discussion Calls We recently hosted the second call of the Issue Discussion call series that focused on the various Fixed Rate Solutions. There is no set recurring schedule for this call series, we will be organizing them as needed, targeting a bi-monthly cadence. Additionally, we created a draft of the process documentation for organizing these calls.  Public Call Summaries The team is finally experimenting with software tools! Otter.ai is helping our contributors become more efficient producers of summaries, with the first workflows using it being tested this week.  Maker Relay Artem officially owns the full publication process for Maker Relay. Work is being done to determine an appropriate set of objectives & key results for the project as well as our overall content publishing strategy.  Content Project Archiving All content projects such as call summaries, Maker Relay, Snippets, Forum at a Glance, MGR, and more have been converted into PDF format and available on the COM-001 Google Drive.  Maker Governance Review September’s Maker Governance Review was published on Forums, Twitter, and Reddit.  Discord Migration Our team pitched in and helped @longforwisdom and @seth with the discord setup by collecting individual discord handles and mapping them to existing rocketchat accounts and roles. This information was also added to our internal stakeholder list.  Published 10/01/21 - 10/15/21 Maker Relay (Dual effort between MKT-001 & COM-001) [#65 Eng](https://forum.makerdao.com/t/maker-relay-ep-65/10697) | #65 Esp #66 Eng | #66 Esp Forum at a Glance 09/30-10/07 10/07-10/14 Other September Governance Review  Up Ahead  More meeting modeling and brainstorming. Coordinating the next Issue Discussion Call 2x sprints planned; Team Information Output Audit & Emergency Playbook Data Collection & Privacy Policy followed by Public MakerDAO people list More progress on everything mentioned above.  ",
                    "links": [
                        "https://drive.google.com/drive/folders/1GBAeTx4jmob7wRs7_LK32Bh_Y-pHzPvV?usp=sharing",
                        "https://forum.makerdao.com/t/issue-discussion-2-fixed-rate-vault-solutions/10845",
                        "https://docs.google.com/document/d/1QRA7aRRxM_CJzWMs-0HWlrHjxfbx48ou2QeeopkNSkI/edit?usp=sharing",
                        "https://forum.makerdao.com/t/maker-relay-ep-65/10697",
                        "https://forum.makerdao.com/t/maker-relay-ep-65-en-espanol/10784",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-30th-october-7th/10837",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-7th-october-14th/11003",
                        "https://forum.makerdao.com/t/maker-governance-review-september-2021/10645",
                        "https://forum.makerdao.com/t/mip39c2-sp24-adding-immunefi-security-core-unit-is-001/10810/9",
                        "https://forum.makerdao.com/t/maker-relay-ep-68/11182",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/maker-relay-ep-68-en-espanol/11250"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0169753086419755
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "16/01/2022-12:05:23",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govcomms-bi-weekly-update-oct-15-29/11301",
            "title": "GovComms Bi-Weekly Update: Oct 15 - 29 ",
            "index": 11301,
            "category": [
                "Core Units",
                "Governance Communications"
            ],
            "tags": [
                "com-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "2",
                    "time": "30/10/2021-01:07:51",
                    "content": " GovComms Bi-Weekly Update Oct 15 - 29, 2021  Administrative Update  Budget Modification We are under budget for the first two months of operations. Check out our public financials here. We will be publishing our actuals for October this coming week along with the higher quality github version. Additionally we are working on a streamlined process for recording and reporting our actuals month to month. Budget modification proposal SP40 has been published to the forum. The main changes are:  Travel figures updated; More accurately reflects expenses by assuming one team-wide offsite for three people, and coverage for two people to attend up to three events per year. Salary line item updated; More accurate. Hourly Compensation item updated; More accurate. Operating Expenses item updated; More accurate.  For detailed figures visit the proposal linked above.  Adding SES-style Status Update Calls In order to provide more opportunities for ourselves to report on the progress of our projects, we will be setting up recorded SES-style status update calls. The details are being worked out and will be posted soon.  Team Emails Our team is moving off our personal emails and onto new @makerdao.world emails, thanks to the Content Production team. This setup creates a dependency between our team and Content Production since they manage the @Makerdao.world email service.  [email protected] [email protected] [email protected]   Media/Press Relations Our team supports @Content-Production’s vision for a Press Relations function that is more proactive. Our team will remain as support for all incoming media requests and the media inquiries section in the forum. We support their team’s desire to hire a full time media relations person to draft Press Releases and to proactively manage media relationships–pushing important news that might otherwise be ignored.  Work Being Done Since the launch of the CU, we have added a ton to our public drive. Supporting documentation around all our active projects is growing with project plans/descriptions, metrics tracking, and workflow process docs coming into existence and being iteratively improved upon.  Lisbon Engagement @Davidutro traveled to Lisboa on a mission to participate in a MakerDAO off-site. To learn more about the engagement check out the overview here.  Meeting Models at MakerDAO We are continuing to formulate a vision for meetings and coordination at MakerDAO.  Translations Carrying forward the legacy work of some community development team contributors, our team has continued to fund translations of select publications into Spanish. We held a meeting with the contributor team to discuss where translations fit at MakerDAO. The key takeaways were that translations should be done for educational and evergreene materials rather than for short-term updates and that a framework for tracking, identifying, and executing on translations should be developed. Our next steps are to determine whether this initiative belongs with us or another Core Unit. Translations are not currently on our or any other team’s immediate mandate.  MakerDAO People List, now called the Stakeholder Database Our team met with a GDPR Compliance, Data Protection, and Product Privacy Lawyer. We are in the process of hiring them or a similar firm to provide us with the services we need to ensure this project is being executed in a globally compliant way. In the meantime we are continuing to collect data-minimized opt-in and public information about MakerDAO stakeholders. The plan to release a public version of the list is on hold until further notice. Also, we renamed the “MakerDAO People List” to the “Stakeholder Database” to more accurately reflect the nature of the list. View the project overview here.  Information Output Audit Artem and Thomas have been working on it for the last two weeks as a joint side-project. As the initial report is completed, Thomas will be meeting with Facilitators to present work and review findings.  Issue Discussion Calls We created a draft of the process documentation for coordinating and organizing these calls. The next call is being planned.  Maker Governance Review Our team will be including the Content Production team in the production process of this publication moving forward.  Published 10/15/21 - 10/30/21 Maker Relay (Dual effort between MKT-001 & COM-001) #67 Eng | #67 Esp #68 Eng | #68 Esp Forum at a Glance 10/14-10/21 10/21-10/28  Up Ahead  October Governance Review Mandate Refresh COM-001 MKR Comp Package More meeting modeling and brainstorming. Coordinating the next Issue Discussion Call Next Steps for Team Information Output Audit Progress on the Emergency Playbook Data Collection & Privacy Policy followed by Public MakerDAO people list  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp40-modify-core-unit-budget-com-001/10756",
                        "https://drive.google.com/drive/folders/1GBAeTx4jmob7wRs7_LK32Bh_Y-pHzPvV?usp=sharing",
                        "https://docs.google.com/document/d/1Ur8gQGGTJGbsJFEK4fEBgBGCD-wVDU-sQ_1BYSdcp4Y/edit?usp=sharing",
                        "https://forum.makerdao.com/tag/espa%C3%B1ol",
                        "https://docs.google.com/document/d/1VCO4rIa8lcQfu1lr1BVVW4SUQUAlPAY5kz88mUuQwr4/edit?usp=sharing",
                        "https://docs.google.com/document/d/1QRA7aRRxM_CJzWMs-0HWlrHjxfbx48ou2QeeopkNSkI/edit?usp=sharing",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/maker-relay-ep-68/11182",
                        "https://forum.makerdao.com/t/maker-relay-ep-68-en-espanol/11250",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-14th-october-21st/11135",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-21st-october-28th/11262",
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.938234384662956
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "30/10/2021-01:29:30",
                    "content": "    Davidutro:  Translations Carrying forward the legacy work of some community development team contributors, our team has continued to fund translations of select publications into Spanish. We held a meeting with the contributor team to discuss where translations fit at MakerDAO. The key takeaways were that translations should be done for educational and evergreene materials rather than for short-term updates and that a framework for tracking, identifying, and executing on translations should be developed. Our next steps are to determine whether this initiative belongs with us or another Core Unit. Translations are not currently on our or any other team’s immediate mandate.   I think it is important to take this into account, as the Spanish-speaking community is one of the most active in the forum, maybe the second most active after English, it would be interesting to see how far this goes. In terms of correspondence, I think it should be something in conjunction with the UC for content creation, as Gov+CC would be great to see them working together for the Spanish-speaking community. We read you   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.877314814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "28/01/2022-01:29:45",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "224"
}