{
    "poll_list": [
        {
            "title": "Inclusion Poll for MIP18: Meta-Parameter Adjustments - July 13, 2020",
            "index": "3118",
            "option": "Yes",
            "supporting_mkr": "6,734",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip18-meta-parameter-adjustments/3118",
            "title": "MIP18: Meta-Parameter Adjustments ",
            "index": 3118,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#1",
                    "likes": "2",
                    "time": "07/07/2020-20:11:21",
                    "content": "MIP18: Meta-Parameter Adjustments Preamble MIP#: 18 Title: Meta-Parameter Adjustments Author(s): @LongForWisdom, Charles St.Louis (@CPSTL), Rune Christensen (@Rune23) Contributors: n/a Type: Process Status: Formal Submission (FS) Date Proposed: 2020-07-07 Date Ratified: <yyyy-mm-dd> Dependencies: Replaces:   References n/a Sentence Summary MIP18 defines a process for modifying Maker Protocol Meta-Parameters. Paragraph Summary This proposal outlines and formalizes the concept of Meta-Parameters in the Maker Protocol. It also contains a list of the current meta-parameters used in Maker Governance, a meta parameter attributes table for each type of active meta-parameters, a meta-parameter Adjustments Subproposal process for modifications (changes, additions, or removal) of meta-parameters, and a meta-parameter option distributions list to which will be used for meta-parameter polls. Component Summary MIP18c1: Meta-Parameters Defines key terms related to the Meta-Parameter Adjustment process. MIP18c2: Meta-Parameter List Defines a list of the current meta-parameters. Furthermore, it describes the intentions behind the meta-parameters and how they affect other system parameters, vote frequencies, and poll options. MIP18c3: Meta-Parameter Attribute Table Defines the attributes for each type of meta-parameter poll, including vote frequency, vote type, and vote options. MIP18c4: Meta-Parameter Adjustments Process Defines a process component to modify MIP18c2 and MIP18c3 by adding, changing, or removing meta-parameters or their respective polling attributes. MIP18c5: Meta-Parameter Option Distributions Defines the available option distributions for meta-parameter polls. Motivation This proposal aims to formalize a process for adjusting meta-parameters to make adjustments to the Dai Savings Rate (DSR) Spread and the Base Rate. Specification / Proposal Details MIP18c1: Meta-Parameters Meta-Parameters are parameters that do not correspond directly to parameters within the Maker Protocol’s smart contracts.  MIP18c2: Meta-Parameter List Base Rate  Primarily a monetary policy lever. Adds a flat number to the Stability Fee for each collateral type in the Maker Protocol. Stability Fee = Base Rate + Risk Premium.  Dai Savings Rate Spread  Primarily a growth/profit lever. Modifies the difference between the Base Rate and the Dai Savings Rate (DSR).   MIP18c3: Meta-Parameter Attribute Table     Meta-Parameter Vote Frequency Vote Type Option Distribution Option Limits     Base Rate Weekly IRV Exponential-around-current -4, +4   DSR Spread Bi-Weekly IRV Exponential-around-current -4, +4, ≥ 0     MIP18c4: Meta-Parameter Adjustments Process The MIP18c4 modification process is done through a subproposal process, in which MIP18c4 subproposals are submitted to the Monthly Governance Cycle like any other proposal. MIP18c4 subproposals have the following parameters:   Default Feedback Period: 3 months  Frozen Period: 1 month  MIP18c4 subproposals must use the template located at MIP18c4-Subproposal-Template.md. This template is considered ratified once this MIP moves to Accepted status.  MIP18c5: Meta-Parameter Option Distributions Linear-around-current  Options for the DSR value around the current parameter value. Integer only Example (around zero) -4, -3, -2, -1, 0, 1, 2, 3, 4  Exponential-around-current  Options for the DSR for the current parameter value. Integer or non-integer Example (around zero) -4, -2, -1, -0.5, -0.25, 0, 0.25, 0.5, 1, 2, 4   MIP18 MIPs Github Repository Source: https://github.com/makerdao/mips/tree/RFC/MIP18 ",
                    "links": [
                        "https://github.com/makerdao/mips/tree/RFC/MIP18",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-101-thursday-july-16-9am-pst-4-00-pm-utc/3145/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-100-thursday-july-9-9am-pst-4-00-pm-utc/3023/4",
                        "https://forum.makerdao.com/t/mip18-ajustes-de-meta-parametros/4940",
                        "https://forum.makerdao.com/t/maker-relay-ep-6/3517",
                        "https://forum.makerdao.com/t/maker-relay-ep-5/3406"
                    ],
                    "GPT-summary": "The post is a formal submission of a proposal (MIP18) that outlines a process for modifying Maker Protocol Meta-Parameters. The proposal defines key terms, lists current meta-parameters, describes their attributes, and outlines a process for modifying them. The post does not advertise the proposal, but rather explains it and invites feedback and questions.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.441190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#2",
                    "likes": "3",
                    "time": "07/07/2020-21:17:52",
                    "content": "Looks great. One minor mistake in the DSR Spread definition: the lower limit is currently greater than or equal 0 and not strictly greater than. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "1",
                    "time": "07/07/2020-22:31:18",
                    "content": "Good catch, Sam. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/07/2020-18:17:49",
                    "content": "Updated to -4, +4, ≥ 0. Thanks, Sam. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-101-thursday-july-16-9am-pst-4-00-pm-utc/3145/2",
                        "https://forum.makerdao.com/t/maker-relay-episode-3/3199",
                        "https://forum.makerdao.com/t/weekly-mips-update-8/3189"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#5",
                    "likes": "0",
                    "time": "21/01/2021-10:02:50",
                    "content": "@hexonaut I believe this MIP is obsolete. Confirm? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#6",
                    "likes": "1",
                    "time": "21/01/2021-11:35:52",
                    "content": "Yeah we are working to produce a new MIP which will formalize the parameter setting in a more flexible manner. Like some of the other MIPs I think we were too specific and rigid with this one. I don’t think it applies anymore. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.639204545454546
                }
            ]
        }
    ],
    "group_index": "2473"
}