{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-mcd-ethereum-system-liquidation-report-and-black-thursday-compensation-analysis/2243",
            "title": "Maker MCD Ethereum System Liquidation report and Black Thursday Compensation Analysis ",
            "index": 2243,
            "category": [
                "Governance"
            ],
            "tags": [
                "analysis",
                "vault-compensation",
                "covid-crash"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "25",
                    "time": "28/04/2020-17:18:01",
                    "content": "Greetings Maker community, At long last the Maker MCD Ethereum Liquidation and Black Thursday Compensation Analysis reports are availble below.   drive.google.com    Maker_Liquidation_Report_Compensation_Analysis_20200428.pdf Google Drive file.      Lets keep discussion on the details of the report, questions, comments, etc. focused in this thread. Stay tuned for updates on when a conference call on this report will occur. ",
                    "links": [
                        "https://drive.google.com/file/d/1oK3zBVKz-tNVeYU1Pezzu2A-7GQqRMRp/view?usp=drive_open",
                        "https://forum.makerdao.com/t/black-thursday-vault-owners-report-thread/1566/24",
                        "https://forum.makerdao.com/t/what-is-the-next-step-for-compensating-vault-holders/1963/28",
                        "https://forum.makerdao.com/t/polls-to-determine-specific-black-thurs-vault-compensation/2275",
                        "https://forum.makerdao.com/t/black-thursday-vault-owners-report-thread/1566/48",
                        "https://forum.makerdao.com/t/mkr-holder-dai-gest-week-19-2020-use-bitcoin-wbtc-to-open-a-vault-on-makerdao/2435",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-30-9am-pst-4-00-pm-utc/2260/3",
                        "https://forum.makerdao.com/t/black-thursday-vault-owners-report-thread/1566/30",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-30-9am-pst-4-00-pm-utc/2260",
                        "https://forum.makerdao.com/t/signal-request-vault-compensation-working-group-payment/5562/10",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891",
                        "https://forum.makerdao.com/t/vault-compensation-plan-v2/3584",
                        "https://forum.makerdao.com/t/bidding-costs-for-liquidation-auctions/3577/2",
                        "https://forum.makerdao.com/t/vault-compensation-plan-proposal/2900"
                    ],
                    "GPT-summary": "The post provides a link to the Maker MCD Ethereum Liquidation and Black Thursday Compensation Analysis reports. The author invites the Maker community to discuss the details of the report, ask questions, and provide comments. The post also mentions that a conference call on the report will occur soon.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 4.520833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/04/2020-18:56:12",
                    "content": "I guess the next step is to pick a cell from Table 8 and decide on an ETH valuation model. I feel like there are too many options to decide without rank-choice voting in on-chain polls. Thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "3",
                    "time": "28/04/2020-19:22:55",
                    "content": "Inherently the biggest problem on the vault compensation report wasn’t doing 1 scenario but setting up to do a whole bunch of different ones.   I was already looking at ETH DAI valuations to present one but gave up after a short time. I think if there is some focus to discussion it will be to talk about the class of auctions we consider defective (1), and then (2) to decide what we think is a reasonable collateral return scenario under the market conditions where liquidation happened.   My arbitrary (based on my business experience) split the difference between what someone could expect or want vs. what I could expect or want is in the right ballpark (10-12% collateral return) and this is what we saw as a rough average when additional keepers came on line. So unless someone has a really strong arguement for more (perhaps an emotional compensation, since this was stressful for everyone), or less (because really under these circumstance expecting ANY collateral return is a pretty high expectation) landing right in the middle (give or take a few percent) honestly seems reasonable.    Then the issue becomes the auction criterion selection process, but honestly even if one selects all with a collateral deficiency relative to the nominal value chosen the amount doesn’t more than double from left (0-bid) to right (ALL with a collateral deficit relative to chosen nominal). The value of ETH in DAI - that is a whole different can of worms. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.697301587301587
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#4",
                    "likes": "6",
                    "time": "28/04/2020-22:09:14",
                    "content": "If this next poll is not to contradict the previous then it should ask the question of how to best achieve the benefits/objectives voted for already. Below are the  “Arguments for compensation” as presented to voters in the previous poll for reference: The protocol performed in a sub-optimal manner. Users (i.e. vault holders) were injured. It is in the interest of Maker holders to try to make their users happy. The purpose of the MKR token is to insure against precisely this kind of failure. No compensation may represent a distortion of symmetry and reciprocity i.e. the impression that we’re marketing the product and receiving the reward for growth of the platform, but leaving ecosystem/development risk entirely to the user. This could negatively impact reputation and future mass adoption. Avoid bad press and acrimonious gestures. https://vote.makerdao.com/polling-proposal/qmwfvvguaf8rz8xwgv2cqnzzt9t5h6epzh17qmk2ue99y4 Compensation done “down the middle” as suggested or any other fraction may appear reasonable, but will likely not achieve these objectives and in that sense be fruitless since you would have spent a great deal of DAI and still sit with the reputational damage, bad press, injured vault holders, negative impact on mass adoption etc. You would not have achieved the benefits voted for in the first poll. Further defending a “reasonable” percentage in front of the press, injured users and potential legal proceedings could be difficult and more so being represented by a collective. The cleanest, quickest route ending the matter and focusing on the future could prove an investment especially considering you are not dealing with a single party you can shake hands with - all you have are your actions signalling intent and impacting brand and reputation. For all these audiences you likely would have to be seen to have “done all you could” acting in the interest of users and that’s likely what will count in articles written on this issue. Considering the interest in the matter and competition in the space this could be defining for Maker. Having said this presenting too many choices could be misleading and I propose we rather focus on fewer options framing the poll in a way that extends directly to desired outcomes. Otherwise you could be caught in a classic “decision by committee” trap diluting the question at hand to averages and missing the outcomes altogether. A voter may think 12% is reasonable, but want the outcomes 24% would likely bring if the question was framed differently. This is not a strange concept - giving customers more than is reasonable is basically Amazon’s ethos. The framing of the poll should focus on outcomes and provide limited options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.324263038548754
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "4",
                    "time": "28/04/2020-23:11:42",
                    "content": "    Sandhaai:  Compensation done “down the middle” as suggested or any other fraction may appear reasonable, but will likely not achieve these objectives and in that sense be fruitless since you would have spent a great deal of DAI and still sit with the reputational damage, bad press, injured vault holders, negative impact on mass adoption etc.   No amount of compensation is going to make those things go away, frankly. Expecting 24% back is unreasonable in my view. Successful auctions on the day returned around at best 11% of collateral to Vaults. That gives us the best idea of what Vault Holders could have expected had there been enough (but not copious amounts) of keeper liquidity. I’d actually like to split the difference between 0% and 11%, and return 5.5%. Given that responsibility for the outcome is shared between like 5 different entities (of which MKR Token Holders are only one) this still feels more than generous.  On another point those arguments for compensation represent a subset of the communities opinions. I didn’t agree with them as stated, but I still voted in favour. I just want to be clear they should not be considered the canonical source of truth on what the responsibilities of MKR Token Holders are, or what their reasons for voting in favor would be.  Regarding what the poll looks like, we’ll do our best to structure it to capture as much signal as possible, as efficiently as possible. We’ll also try to make sure it’s objective as possible. I’m sure full compensation of 24% will be on the poll. I’m also fairly sure that 0% compensation will be on the poll, given that we now have more information regarding auction effectiveness and the cost of compensation than we did previously, and that this new information may have caused people to change their minds. Probably we’ll see a few options between those extremes too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.991358901515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#6",
                    "likes": "7",
                    "time": "28/04/2020-23:37:37",
                    "content": "I would really like to encourage the community to use this opportunity to get together and try to come up with a plan, or at least an outline of a plan, that clarifies how this process will work. There are a significant amount of stakeholders that need to coordinate, a lot of people that need to be informed about the contents of this report, and not a trivial amount of code that needs to be written to support the intention of the previous poll. There are also auditing and custody issues that need to be addressed. The success of this initiative will be far smoother if it begins to be treated as a real project, i.e. scoping, deliverables, scheduling, etc. Moving immediately into more polls dedicated to best guesses at next steps is going to be a messy and potentially drawn out process. Feels like there needs to be a working group here to pick up some of the coordination tasks… Just my opinion, feel free to disregard. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.926282051282051
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#7",
                    "likes": "4",
                    "time": "28/04/2020-23:44:02",
                    "content": "We should also consider onboarding a legal domain team. I’m concerned if MakerDAO is not legally incorporated anywhere, it runs the risk of being treated like a general partnership. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#8",
                    "likes": "4",
                    "time": "29/04/2020-00:16:53",
                    "content": "    rich.brown:  Feels like there needs to be a working group here to pick up some of the coordination tasks…   Maybe this is this first thing to be decided then? I.E maybe we need to elect a working group to hash out the details of a plan here and lay out the roadmap. Once we had that then the general beats of a plan laid out then we could start to distribute the work amongst people that might have the ability and expertise to execute the various tasks that would be required by that plan. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#9",
                    "likes": "4",
                    "time": "29/04/2020-02:30:56",
                    "content": "Personally I think 5.5% is still rather low considering Pre-Black Thursday and before the 0 bid auctions were taking place, the average vault holder was left with 17.7% after liquidation. If you ask me 17.7% should be up for consideration as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#10",
                    "likes": "4",
                    "time": "29/04/2020-05:08:29",
                    "content": "Since there is some discussion around the nominal collateral return forming I realized I offered a limited set focused around an arbitrarily and possibly bias selected 10%.    The nominal collateral return CAN be any number. If I was going to suggest brackets on a poll (should the poll be constructed to fix the nominal collateral return) perhaps 0, 0-5%, 5-10%, 10-15% 15-20% 20-25% might be the best working poll choices to rank on.   0, being no compensation, 25% being full theoretical with everything else falling in between into kind of normalish catagories.  0-(no compensation at all), 0-5 (yes, but only a little), 5-10 (yes, but more than a little), 10-15(yes, and roughly 1/2 theoretical), (yes, more than 1/2 theoretical but distincly less than full theoretical), 20-25(yes, pretty much full theoretical or very close). One could literally weigh the above MKR vote BY the compensation % chosen  to create a weighted by MKR voting compensation % along with the winning ranked choice %. Main goal of this post was to inform everyone this nominal collateral return % can be anything you want - just interpolate between matrix values for a good estimate of total. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.688137755102041
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Muchacho",
                    "index": "#11",
                    "likes": "1",
                    "time": "29/04/2020-09:32:59",
                    "content": "Hey, First of all, I’m new to this forums so I wanted to say hello. I’d like to thank you for this report, it’s greatly appreciated. However, I have a big concern here. This report says nothing about BAT vaults that got liquidated during Black Thrusday event. If you plan to reimburse all the victims, it’s only fair if you count BAT vaults as well. My BAT vault had almost 70k BAT in it and it got liquidated to 0 during Black Thursday event. best regards, Michal ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.085016835016836
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "1",
                    "time": "29/04/2020-10:17:54",
                    "content": "    Muchacho:  it’s only fair if you count BAT vaults as well   I’m fairly sure that we’ll end up applying the same level of compensation to BAT Vaults as we do to ETH Vaults. I think that from the perspective of analysing this data it was just easier to omit BAT. Don’t worry, no one’s forgotten you.     Vault2288:  Personally I think 5.5% is still rather low considering Pre-Black Thursday and before the 0 bid auctions were taking place, the average vault holder was left with 17.7% after liquidation.   True, but normal circumstances are different from the sort of market event we saw on Black Thursday. Personally I don’t think it’s realistic to expect compensation based on the average good case in ideal circumstances. Others may well see it differently though. Like in my mind we have something like this: 24% - Theoretical best case, unlikely in practice unless ETH price appreciates after liquidation but before auctions end. 17.7% - Average good case in normal circumstances. 11% - Best case on Black Thursday with limited Keeper liquidity. 0% - Worst case given 0-bids. Others may agree with you and suggest that 5.5% is low, and that 11% is already enough of a compromise. Difficult to say.     Andy_McCall:  Maybe this is this first thing to be decided then? I.E maybe we need to elect a working group to hash out the details of a plan here and lay out the roadmap.   I don’t think election is necessary. If you are willing to form part of this working group then please make yourself known. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.680272108843537
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#13",
                    "likes": "8",
                    "time": "29/04/2020-11:59:37",
                    "content": "Remember, we are not just talking about a technical problem here, but also of a false (or bad) advertising of the «13% liquidation penalty» that were only explained in the github README.md in a not precise manner. This number was displayed everywhere, not only on UIs, but in every Medium article of ETH dev & experts. We can be sure that a big majority of the impacted vault holders were expecting 13% penalty applied on their loan. Remember, if most of vault holders had known that in specific conditions they were going to receive 50% of what they should have received on a «normal day» (11% vs 24%, @LongForWisdom comment), they would have taken more care of their vault. (btw @LongForWisdom, I still don’t understand, as a User, where did you find the 11% and 17.7%?..). Remember, a class action has been made, it should take months/years to get the final statement and a lot of human efforts. Vault holders that will accept the compensation will not be able to participate. With all that points, me and other victims would appreciate a full compensation in ETH (~24.67% of total collateral). If not, we’ll feel like receiving a random compensation without any clear explanation: why 5.5% in DAI, why 11% in ETH, … ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "5",
                    "time": "29/04/2020-12:11:05",
                    "content": "    fullname:  Remember, we are not just talking about a technical problem here, but also of a false (or bad) advertising of the «13% liquidation penalty»   Which MKR Token Holders are not responsible for. As I said, I believe the responsibility for the loss is shared between like 5 entities. Imo these are: MKR Token Holders - For setting insufficiently defensive auction parameters. Various UI’s- For displaying 13% Liquidation price without explaining the details. Maker Foundation - For failing to ensure robust Keeper participation and production of appropriate tools. Ethereum Network - For failing to scale well. Vault Holders - For getting liquidated. I’m sure these are open to argument, but this is how I see the situation. The point is, MKR Token Holders are not fully responsible for the loss, why should they be fully responsible for any compensation.     fullname:  that were only explained in the github README.md   https://community-development.makerdao.com/makerdao-mcd-faqs/faqs/liquidation#how-much-collateral-is-left-after-a-liquidation     fullname:  I still don’t understand, as a User, where did you find the 11% and 17.7%?..)   From the report posted in the initial post of this thread. (Though I’ll note I only pulled out 11%, 17.7% came from @Vault2288)  As to the point as why DAI rather than ETH, that would be because the MKR Protocol can mint DAI and give it to you without anyone having to code or decide anything terribly complicated in order to source ETH. Compensation in DAI is likely to be a faster process than compensation in ETH. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nielsd",
                    "index": "#15",
                    "likes": "0",
                    "time": "29/04/2020-12:28:33",
                    "content": "Now eth is rising again, is this a factor to consider ? Lets say you take 100 dollar as piont off liquidation and base the compensation ( DAI) on that, it means the compensation would be peanuts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 0.9999999999999998
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#16",
                    "likes": "1",
                    "time": "29/04/2020-12:31:38",
                    "content": "Yeah, we started to prepare a poll for that (how does ETH price in DAI affect compensation), https://github.com/makerdao/community/pull/496 However, Rich keeps saying that we need to pull together a team to plan this out better before we do more polls. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.291666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nielsd",
                    "index": "#17",
                    "likes": "3",
                    "time": "29/04/2020-12:38:16",
                    "content": "I dont see a reason the a reason for pulling together a team. It feels we are wasting time and a lot of people when to close this chapter. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "1",
                    "time": "29/04/2020-12:47:19",
                    "content": "Yes, if we used the DAI value of the ETH at time of liquidation (or an average over Black Thursday) it would be less value than if we compensated in ETH (given the current ETH price). We’ve yet to decide what ETH price we would use to determine the amount of DAI compensation though. We could use the current ETH price, although I don’t think that is necessarily a good idea either. If I’m reading the report right (@MakerMan please correct me if I’m wrong) to compensate all ETH Vaults at 24% of collateral (~32k ETH) at a $200 ETH price comes to 6.4M DAI. Personally I think it’s doubtful that MKR Token Holders are going to incur that much more bad debt in order to compensate Vault Holders. But again, I could be wrong.     Nielsd:  I dont see a reason the a reason for pulling together a team.   Mostly because things don’t just magically happen. The reason Rich wants a team is because previously the proposed polls promised things that there was no plan in place to implement. Say for example we wanted to compensate in ETH, someone needs to figure out how to get the MKR Protocol to acquire that amount of ETH. The way this works is the Protocol can mint DAI, but then we’d have to use DEX’s to convert. Okay. But then we need to deal with slippage. Which DEX’s do we use? Who compiles the list of Vault Holders and how do we calculate how much we owe each one? Do Vault Holders need to be able to opt out? Ditto for BAT Vaults. If some Vaults do opt out, how does that process work? How does this interact with the class action lawsuit against the Foundation. Furthermore, the people that are sorting all this stuff out need to get paid, because frankly, it’s all work. We’ve never paid anyone from the Maker Protocol before, so how does that work? Payment in advance? On delivery? By hour using a streaming solution? It may sound simple, but it isn’t. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.335565476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#19",
                    "likes": "1",
                    "time": "29/04/2020-12:53:33",
                    "content": "    LongForWisdom:  We’ve yet to decide what ETH price we would use to determine the amount of DAI compensation though. We could use the current ETH price, although I don’t think that is necessarily a good idea either.   Which is why it doesn’t make sense for it to be paid in DAI, but it in ETH. It was ETH that was lost as a result of the 0 bid auctions ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "0",
                    "time": "29/04/2020-12:58:43",
                    "content": "From a process perspective it makes more sense to use DAI, because the Protocol has DAI. Exchanging DAI to ETH adds complexity and will delay any compensation you guys get. Setting the amount of DAI to equal the price of ETH at the time of compensation is functionally the same value compensated as if it had been denominated in ETH, though admittedly it means that if the compensated parties want to hold ETH, they would need to exchange it themselves as they received it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#21",
                    "likes": "3",
                    "time": "29/04/2020-13:13:43",
                    "content": "    LongForWisdom:  Furthermore, the people that are sorting all this stuff out need to get paid, because frankly, it’s all work. We’ve never paid anyone from the Maker Protocol before, so how does that work? Payment in advance? On delivery? By hour using a streaming solution?   It seems like this is the crux of it. We’re going to need at least two roles, a developer to create a website and smart contracts, and a coordinator / project manager type. Given that we’re talking about transferring more than 100k DAI in value, we can probably budget on the order of 10k DAI for paid staff to see that it gets done well and promptly. Is there a MIP to help make that happen?     LongForWisdom:  From a process perspective it makes more sense to use DAI, because the Protocol has DAI. Exchanging DAI to ETH adds complexity and will delay any compensation you guys get.   Yeah, that’s the conclusion I came to when I put together the draft poll. I’m not sure if we need that poll anymore. Is there consensus that compensation can be in DAI? Bear in mind that the amount of compensation is an orthogonal question to the token used to compensate. As LFW said, we could use today’s ETH price to determine the amount of DAI compensation which is practically the same as compensation in ETH. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.553571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#22",
                    "likes": "2",
                    "time": "29/04/2020-13:25:44",
                    "content": "    LongForWisdom:  MKR Token Holders - For setting insufficiently defensive auction parameters. Various UI’s - For displaying 13% Liquidation price without explaining the details. Maker Foundation - For failing to ensure robust Keeper participation and production of appropriate tools. Ethereum Network - For failing to scale well. Vault Holders - For getting liquidated.   The symmetry is broken in this picture. When talking about downside the question is who stood to gain on the upside of a growing network?. Vault holders - correctly as quoted - will eat their piece of the downside, but if the UI’s and Ethereum Network weren’t the direct beneficiaries of upside of users opening Vaults (like, for example MKR Token Holders) then pinning downside to them is plain scapegoating. The user you’re aiming at (“mass adoption” remember) interacts with Maker. Even the distinction between the foundation and the token holders is like the CEO saying he’s not responsible for wrong billing because the finance department didn’t do their job. The brand happy to present one face when selling a product & claiming benefits should be the same brand the user interacts with when things don’t go according to plan. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.092857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#23",
                    "likes": "1",
                    "time": "29/04/2020-13:31:04",
                    "content": "Second this. This issue won’t be resolved in a community / pitch in where you can fashion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/uvizhe",
                    "index": "#24",
                    "likes": "0",
                    "time": "29/04/2020-13:49:25",
                    "content": "    MakerMan:  My arbitrary (based on my business experience) split the difference between what someone could expect or want vs. what I could expect or want is in the right ballpark (10-12% collateral return) and this is what we saw as a rough average when additional keepers came on line.   I’d say that the split is between ~24.67% (what vault owners expected) and 10-12% (what should be expected). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.779761904761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#25",
                    "likes": "1",
                    "time": "29/04/2020-14:28:22",
                    "content": "Your interpretation of symmetry is fairly sketchy, in my view, for several reasons:  MKR Token Holders already suffered the downside from this in the form of FLOP auctions. Recapitalising the system is the only thing MKR Token Holders are obligated to pay for (by design). It’s also worth mentioning that UI’s in some cases do sell services that benefit from network growth (increased customer base.) I believe DeFi Saver charges for one or more of their services, though I forget which. You could also argue that the Ethereum network benefits from the DeFi projects built on top of it.  It may be beneficial for MKR Token Holders to pay some amount of compensation for Vault Holders in this situation, but they certainly aren’t obligated to do so. I appreciate you are all frustrated, but I’m doing as much as possible to approach this from a position of objectivity and trying to figure out how much compensation MKR Token Holders are actually responsible for rather than giving a knee-jerk response.      uvizhe:  I’d say that the split is between ~24.67% (what vault owners expected) and 10-12% (what should be expected).   Why? Are MKR Token Holders responsible for the expectations of Vault Holders? 24.67% is the theoretical maximum in a system that relies on auctions, it’s not a reasonable assumption to receive that much back. A reasonable assumption is based on historical return in the case of liquidations (17.7%), a reasonable assumption given what was possibly a once or twice in a lifetime event is 11%. Splitting the difference between the reasonable assumption given the situation and what was actually received seems like the fairest outcome to me given that the unprecedented market situation was made worse by insufficiently defensive auction parameters (the thing that MKR Token Holders are actually responsible for).  Like if anyone can provide a solid argument as to why MKR Token Holders are responsible for compensating the full amount given their role in Black Thursday, please share it. Note that I’m talking about responsibility, not what may or may not make sense given PR issues. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.386712749615975
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#26",
                    "likes": "0",
                    "time": "29/04/2020-14:32:05",
                    "content": "Just putting the numbers on what you said and offering some thoughts. For reference that would be: (Max) 24.67 / 2 = (Mid) 12.33500 (Max) 24.67+ (Mid) 12.335 = MaxMidAvg(37.005/2) MaxMidAvg = 18.5025% (0.8% above the 17.7% average remaining vault collateral pre BT) Note: The Avg between these two would be (18.5025+17.7/2) ~18.10125% ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.6250000000000004
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#27",
                    "likes": "1",
                    "time": "29/04/2020-14:45:52",
                    "content": "    psychonaut:  Yeah, that’s the conclusion I came to when I put together the draft poll. I’m not sure if we need that poll anymore. Is there consensus that compensation can be in DAI? Bear in mind that the amount of compensation is an orthogonal question to the token used to compensate. As LFW said, we could use today’s ETH price to determine the amount of DAI compensation which is practically the same as compensation in ETH.   I don’t get why there isnt a poll for compensation in DAI or ETH/BAT personally. Please don’t get me wrong as any compensation is better than no compensation - It just seems a little bit off as the compensation is regarding how much % of ETH and BAT should have been remaining in users Vaults effected by the 0 bid auctions taking place. To my understanding: A vote will take place with options to what extent of compensation should be made in terms of the remaining % of collateral Vaults should have been left with. MakerMan’s comprehensive report shows us the average was 17.7% before the 0 bid auction exploit became known. Once this is decided each Vault effected by the 0 bid auctions will be remunerated with that % of collateral - be it ETH or BAT so that everyone is equally made up the exact same % of remaining collateral. Perhaps just outlining how being paid in DAI wouldn’t be a disadvantage would help. The way I see it - it would be a disadvantage if compensation were made in DAI when the point here is to restore Vault collateral balances to an equal threshold of remaining underlying overcollateralized collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.947115384615385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#28",
                    "likes": "0",
                    "time": "29/04/2020-15:02:59",
                    "content": "    Vault2288:  Once this is decided each Vault effected by the 0 bid auctions will be remunerated with that % of collateral - be it ETH or BAT so that everyone is equally made up the exact same % of remaining collateral.   This is another thing that needs to be figured out. My assumption was that we’d just send DAI directly to the controlling address for each Vault, rather than trying to top up the Vaults directly. Maybe that would be a better way to do it though, not sure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#29",
                    "likes": "0",
                    "time": "29/04/2020-15:12:33",
                    "content": " My assumption was that we’d just send DAI directly to the controlling address for each Vault,  If it were paid in DAI it would be good to know how that would work. Example: A vault is owed 100 ETH in collateral compensation (at the time of compensation 100 ETH is $20,000) Would they get 20,000 DAI? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#30",
                    "likes": "2",
                    "time": "29/04/2020-15:18:34",
                    "content": "    LongForWisdom:   It’s also worth mentioning that UI’s in some cases do sell services that benefit from network growth (increased customer base.) I believe DeFi Saver charges for one or more of their services, though I forget which. You could also argue that the Ethereum network benefits from the DeFi projects built on top of it.    Ethereum network benefits are incidental. An example from the physical world would be that New York wil benefit if Amazon builds a DC there (taxes, gdp etc), but that doesn’t mean they’re responsible for the product. The same for on-sellers like the UI’s. If you’re a product manufacturer and the retail store made a mistake in the promotional display their liability is limited. If, as in this case, your product is sold by a limited number of UI’s and you don’t care enough to check the way they’re selling it then, well, that’s what you offer I suppose. The arguments I’m making are on the assumption that Maker wants to compete in this space with a good brand and a competitive product. I may be wrong about that if the corporate response will be limited to what we’re “responsible for” in the fine print. Maybe the excellence thing isn’t reachable for a DAO setup? Maybe it goes into the “tragedy of the commons” / communism phenomenon? I don’t know really, but I’d be concerned if I were a heavy Maker Token holder. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.281561147186147
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#31",
                    "likes": "0",
                    "time": "29/04/2020-15:22:05",
                    "content": "    Sandhaai:  If, as in this case, your product is sold by a limited number of UI’s and you don’t care enough to check the way they’re selling it then, well, that’s what you offer I suppose.   It’s not that we don’t care enough, it’s that the protocol is completely open for use (that’s kind of the point, right?) We could make changes so only approved UI’s could access the Protocol. It doesn’t feel like that is a win though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.008928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hsingh21",
                    "index": "#32",
                    "likes": "3",
                    "time": "29/04/2020-15:26:48",
                    "content": "This whole process is taking way too long, if i am not happy with the terms of compensation i will be joining the class action, simple. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#33",
                    "likes": "1",
                    "time": "29/04/2020-15:30:35",
                    "content": "    Sandhaai:  I may be wrong about that if the corporate response will be limited to what we’re “responsible for” in the fine print.   Part of this might be that we’re seeing the Maker Protocol differently. Like, MKR Token Holders aren’t a corporation, they are another set of ecosystem users who manage and grow the protocol in exchange for fees. You’re basically asking one set of users to be entirely financially responsible (outside the financial responsibility already built into the protocol) for a second set of users, this doesn’t seem reasonable to me. Like if that is consistently the case, then no one will want to hold MKR, and the system will be managed by whichever centralized entity decides it’s worth it, and we lose the whole aspect of decentralisation that the Protocol is aiming for. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.382783882783882
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#34",
                    "likes": "3",
                    "time": "29/04/2020-15:31:13",
                    "content": "    LongForWisdom:  My assumption was that we’d just send DAI directly to the controlling address for each Vault, rather than trying to top up the Vaults directly.   One idea is to require vault holders to withdraw the DAI from a compensation contract. As part of the process, they would agree to indemnify the protocol against legal action. This isn’t an airtight legal gesture, but it seems like better than nothing to me. I wouldn’t want vault holders to receive compensation and then join as a plaintiff in a class action suit against some facet of Maker. This would require a bit more software development and testing than the most expedient approach though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#35",
                    "likes": "1",
                    "time": "29/04/2020-15:34:29",
                    "content": "@Joshua_Pritikin With the right compensation being made available I’d support this fully, as someone effected greatly too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.476190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#36",
                    "likes": "2",
                    "time": "29/04/2020-15:35:45",
                    "content": "    hsingh21:  This whole process is taking way too long, if i am not happy with the terms of compensation i will be joining the class action, simple.   Do you think that the class action suit will be resolved more quickly than this process (genuine question)?      psychonaut:  One idea is to require vault holders to withdraw the DAI from a compensation contract.   Yeah, maybe. That gets way complicated in terms of work to be done to make this actually happen. Like my imagining of this process was always:  Get list of affected Vaults Decide percentage amount to compensate Decide DAI value of ETH to compensate at. Send the difference between amount to compensate, and amount received to the owners of each Vault in DAI using an executive spell. FLOP auctions cover the bad debt caused by generating unbacked DAI.  This is the quickest way I can see this working. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.993055555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/uvizhe",
                    "index": "#37",
                    "likes": "3",
                    "time": "29/04/2020-15:43:33",
                    "content": "    LongForWisdom:  Are MKR Token Holders responsible for the expectations of Vault Holders?   MKR Holders aren’t responsible. The compensation is a way to achieve some goal, not an obligation. I specified those numbers to point to what I feel is fair from a vault owner’s viewpoint. My reasoning is: a) vault owners was misinformed about risks (that’s why ~24.67%) b) the worst scenario in a properly(?) working system (as per the report) is 10-12% PS: There are no objective numbers exist. We can only bet on what numbers can do most to achieve the goal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nr2618",
                    "index": "#39",
                    "likes": "0",
                    "time": "29/04/2020-16:56:49",
                    "content": "Can someone clarify the following? The amount by which the system became undercollateralized (and the subsequent flop auctions rectified) is also exactly the amount by which vault owners should be compensated, assuming 100% compensation. Given that the price of ETH is going up every day, doesn’t it make sense to repeat the flop auctions, hold the ETH designated for compensation in the system surplus and then figuring out how to compensate the vault owners? If too much ETH is bought in this process (i.e. if vault holders are only partially compensated), the extra ETH can be converted back to MKR and then burned. This avoids needless loss due to the increase in the value of ETH during this decision making period. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.8625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#40",
                    "likes": "1",
                    "time": "29/04/2020-17:00:39",
                    "content": "    nr2618:  The amount by which the system became undercollateralized (and the subsequent flop auctions rectified) is also exactly the amount by which vault owners should be compensated, assuming 100% compensation.   I don’t think this is correct.     nr2618:  hold the ETH designated for compensation in the system surplus   The system surplus only holds DAI, not ETH.  We could buy ETH now and stash it somewhere though, I suppose. I believe we would need new smart contracts, so I don’t believe it would be a quick fix. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.778318903318903
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nr2618",
                    "index": "#41",
                    "likes": "1",
                    "time": "29/04/2020-17:26:25",
                    "content": "    LongForWisdom:  I don’t think this is correct.   I see. Could you explain why this isn’t the case? In general, what we need is an upper bound on the maximum possible compensation amount in terms of ETH.     LongForWisdom:  We could buy ETH now and stash it somewhere though, I suppose. I believe we would need new smart contracts, so I don’t believe it would be a quick fix.   I understand and it is an interesting question about how to execute this. However, it seems in everybody’s interest to figure out how to achieve this ETH stash now (maybe it could even be held by a centralized entity like the Foundation) then sort out the details of compensation later. I don’t have the answer to how but perhaps someone has an idea to secure and hold that stash. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907768157768158
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#42",
                    "likes": "3",
                    "time": "29/04/2020-17:36:20",
                    "content": "    nr2618:  I see. Could you explain why this isn’t the case? In general, what we need is an upper bound on the maximum possible compensation amount in terms of ETH.   So, the amount the Protocol needed to cover in bad debt was equal to the DAI lost in the unsuccessful (net negative) auctions minus the DAI gained in the successful (net positive) auctions. I forget the actual numbers involved now, but it’s important to note that if an auction is successful for the protocol, it isn’t necessarily successful for the Vault Holder due to the 13% penalty. In terms of an upper bound on ETH required, I believe this is just over 32,000, according to MakerMan’s report. And we would also need to worry about BAT.     nr2618:  I understand and it is an interesting question about how to execute this. However, it seems in everybody’s interest to figure out how to achieve this ETH stash now (maybe it could even be held by a centralized entity like the Foundation) then sort out the details of compensation later.   I can’t say for certain, but I suspect the Foundation wouldn’t do this, on the grounds that taking part in compensation could be argued to be an admission of guilt in court.  I appreciate the effort you’re going to here to try to come up with novel solutions. But realistically in order for any method of compensation to start happening, someone needs to volunteer to do it. See the working group suggestions earlier in the topic. Doing anything quickly is really difficult at this point, because there are no processes or procedures setup that detail how such things are to be done. We have literally never paid anyone anything using the Protocol, this is completely uncharted territory. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.420116341991342
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Three_Cents",
                    "index": "#43",
                    "likes": "4",
                    "time": "29/04/2020-17:43:42",
                    "content": "My 3 cents here (and i am mkr holder, was not a cdp owner).  At the end of the day we are choosing how to compensate those that took an unexpected loss during one of the most volatile days in recent history due to a confluence of events:   MKR as a system is something we want users to rely on and we as a system need to make it up to those when something goes wrong that was clearly not functioning as intended (even though the users should have been aware of the risks).  It doesn’t mean insuring against all losses, but in this case the keeper system was clearly not functioning properly and as a ‘business owner’ we should err on the side of the goodwill of our users.   I think we should pay 24.7% (or whatever the optimal amount was) of user losses in DAI valued at the time their CDP was liquidated (best estimate of USD/ETH value at the time).  Whatever happened to ETH value after that event should not be our liability.  I would bet if ETH was trading at $10 everyone would want to be paid in DAI at the liquidation value.  We should make them whole on at time of the loss.  I believe this is fair and definitely more generous than they would have received in keeper system was working as intended given the volatility at the time.  My guess is that this 24.7 packback is somewhere around 1.6mm DAI.  Arguing about whether it should be 800k DAI (11%) vs 1.0mm DAI (15%) is IMO small potatoes for the goodwill benefit of just doing the full amount.  Given the potential of the MKR system over the long run I think we should err on the side of what I think is doing the right thing particularly since MKR system already took 3x the losses of the CDP holders.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.678720238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nr2618",
                    "index": "#44",
                    "likes": "1",
                    "time": "29/04/2020-17:47:33",
                    "content": "    LongForWisdom:  But realistically in order for any method of compensation to start happening, someone needs to volunteer to do it   I undestand. Unfortunately, I’m not in the position to do so but I hope that post might be the catalyst for a better idea for someone who is able to execute a solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Three_Cents",
                    "index": "#45",
                    "likes": "3",
                    "time": "29/04/2020-17:54:44",
                    "content": "Sorry I forgot to add this, but I also think we should resolve this very quickly and with as little use of resources as possible (something that requires very little additional programming).  Let’s get this behind us so we can focus on growing and improving the system.  Perhaps let’s vote on a percentage, calculate the Dai owed, print it, do a flop auction and move forward.  If anyone if still unhappy, well we tried to make them whole and likely went above and beyond what they would have received in real time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.50094696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#46",
                    "likes": "1",
                    "time": "29/04/2020-18:05:33",
                    "content": "    Three_Cents:  Whatever happened to ETH value after that event should not be our liability. I would bet if ETH was trading at $10 everyone would want to be paid in DAI at the liquidation value.   Agree on that front, though not to the aforementioned 24.7% level on point of principle and to avoid setting bad precedent.     Three_Cents:  Sorry I forgot to add this, but I also think we should resolve this very quickly and with as little use of resources as possible (something that requires very little additional programming). Let’s get this behind us so we can focus on growing and improving the system. Perhaps let’s vote on a percentage, calculate the Dai owed, print it, do a flop auction and move forward. If anyone if still unhappy, well we tried to make them whole and likely went above and beyond what they would have received in real time.   Yeah, agree, I think everyone wants this to be over and done with as soon as possible. The issue is that those things you mentioned all require work from people, which the protocol has to pay, which requires more discussions, and more decisions. If anyone wants to work on this, let me know, I’m happy to group people together and make suggestions.     nr2618:  I undestand. Unfortunately, I’m not in the position to do so   All good, completely understandable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.1595643939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#47",
                    "likes": "0",
                    "time": "29/04/2020-22:31:36",
                    "content": "We need to build and test the tools required to complete the task of compensation. I’m not going to program it, but here are the requirements of what I think we need to build,    GitHub    jpritikin/BlackThurs Contribute to jpritikin/BlackThurs development by creating an account on GitHub.      Once there is reasonable consensus on the requirements then we get it written. Somebody can volunteer or we can queue up an executive to fund a gitcoin bounty. I believe the requirements are simple enough that the resulting code should be inexpensive to audit or formally verify. ",
                    "links": [
                        "https://github.com/jpritikin/BlackThurs"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Poligon_Assets",
                    "index": "#48",
                    "likes": "2",
                    "time": "30/04/2020-05:17:23",
                    "content": "I am interested in knowing more about this, can you contact me? I do not see that this is resolved quickly, it is taking too long and it is not being given the importance that it should have ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#49",
                    "likes": "4",
                    "time": "30/04/2020-06:21:45",
                    "content": "Compensation will have to take the current market value of ETH into account otherwise it will be no restitution to vault holders. At the current market prices the time it’s taking to resolve this issue is rapidly affecting everyone involved & I suspect the negative press will increase. At some point it will make more sense for the vault holders to go the legal route vs. being compensated a token amount based on very low market values of ETH. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianmcli",
                    "index": "#50",
                    "likes": "0",
                    "time": "30/04/2020-07:15:36",
                    "content": "I honestly think that poll should just go ahead. We spent a lot of time reviewing its text anyway. Considering the sunk cost, there is really not much additional cost of running the poll anyway to get another data point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianmcli",
                    "index": "#51",
                    "likes": "1",
                    "time": "30/04/2020-07:23:28",
                    "content": "    Sandhaai:  Maybe the excellence thing isn’t reachable for a DAO setup? Maybe it goes into the “tragedy of the commons” / communism phenomenon?   Well this is definitely the case as I have mentioned in another thread. The Maker Foundation seems to prefer to let the DAO take leadership rather than leading themselves. But the Foundation still has a lot of influence over what tools people use, and how people choose to conduct themselves in the ecosystem. In my opinion, they need to take a more proactive role rather than just “you guys make a plan and vote on it”. The fact that MKR token holders (and other stakeholders) have no mechanism to push back on the Foundation creates a form of moral hazard. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/uvizhe",
                    "index": "#52",
                    "likes": "2",
                    "time": "30/04/2020-09:25:34",
                    "content": "    LongForWisdom:  We could buy ETH now and stash it somewhere though, I suppose. I believe we would need new smart contracts, so I don’t believe it would be a quick fix.       LongForWisdom:  I can’t say for certain, but I suspect the Foundation wouldn’t do this, on the grounds that taking part in compensation could be argued to be an admission of guilt in court.       adrianmcli:  The fact that MKR token holders (and other stakeholders) have no mechanism to push back on the Foundation creates a form of moral hazard.   The Community alone seems unable to solve the isssue with compensation in a swift manner and the time is playing against Maker and all affected users. Maybe MKR Token Holders can ask the Foundation for help? To help with programming and money to stash ETH/BAT I mean. Also, honestly, I think that manual collateral purchase and distribution is far more simple and quick than programming/testing. The only thing to be done is a simple page asking to sign on-chain an agreement to receive X amount as a compensation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.466906791125541
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#53",
                    "likes": "0",
                    "time": "30/04/2020-13:49:14",
                    "content": "I wonder if we can fund a bounty directly from an executive spell? Answer: Yes ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#54",
                    "likes": "0",
                    "time": "30/04/2020-13:55:55",
                    "content": "    adrianmcli:  I honestly think that poll should just go ahead.   How would the outcome of the poll change the amount of compensation? It wouldn’t. Hence, I think the poll is a waste of time and attention. Writing the poll was valuable to clarify thinking around the next steps:  We can link the action of claiming compensation with indemnity. The token denomination of the compensation is irrelevant. Therefore, we can use DAI because it makes everything simpler. We clarified the pros and cons of different compensation levels.  That’s what I learned. I think it was a valuable exercise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#55",
                    "likes": "2",
                    "time": "30/04/2020-15:01:41",
                    "content": "@psychonaut In this example, if compensation works out to be 100 ETH and ETH is $200 at the time of compensation being distributed. Does this mean a Vault holder would receive 20,000 DAI at the time? So it is more or less the same? As I understand next steps would be: vote on % to distribute, calculate amount of ETH and BAT each vault holder was short fallen by, convert this amount of collateral to DAI at the time, distribute DAI via vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.017361111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#56",
                    "likes": "1",
                    "time": "30/04/2020-15:06:02",
                    "content": "    Vault2288:  Does this mean a Vault holder would receive 20,000 DAI at the time? So it is more or less the same?   Yes, if MKR holders decide to price ETH compensation at 200 DAI per ETH. The price of ETH in DAI is a number that will have to be decided by a poll. It’s an orthogonal question to how the compensation will be distributed. If vault holders really want compensation in ETH or BAT tokens then that would slow down and complicate the whole process. I can’t even imagine a timeline. Whereas with DAI compensation, we can fund a gitcoin bounty in 1-2 weeks, the contract will be ready in 1 week, maybe we need another week for auditing/verification, simultaneously polls can run to determine the amount of compensation, and then a week to fund the compensation contract with an executive vote. That’s about 5 weeks, assuming everything goes smoothly. If vault holders want to complicate things then it may add 1-2 months to that timeline. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.282638888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#57",
                    "likes": "1",
                    "time": "30/04/2020-15:08:55",
                    "content": "Ok got it. Thanks for clarifying. It seems pricing ETH and BAT at the time compensation is being distributed via DAI would be more fair as it would be the same essentially as if collateral was being returned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#58",
                    "likes": "2",
                    "time": "30/04/2020-15:13:01",
                    "content": "    Vault2288:  It seems pricing ETH and BAT at the time compensation is being distributed via DAI would be more fair   That’s a consideration that will factor into the decision by MKR holders on the exact compensation formula. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.416666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#59",
                    "likes": "0",
                    "time": "30/04/2020-15:53:17",
                    "content": "In the last poll MKR holders already voted against a  0 % compensation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#60",
                    "likes": "3",
                    "time": "30/04/2020-15:58:02",
                    "content": "We voted to compensate yes, but we did it with limited information. Seems reasonable to me that new information might change the decision. To be clear, I don’t expect it to, but it is something I would expect to see as an option in subsequent polls. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.3649350649350644
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#61",
                    "likes": "3",
                    "time": "30/04/2020-18:04:13",
                    "content": "    LongForWisdom:  We voted to compensate yes, but we did it with limited information. Seems reasonable to me that new information might change the decision. To be clear, I don’t expect it to, but it is something I would expect to see as an option in subsequent polls.   Why did we vote at all then? Sorry but you can possibly say that about every point in time. As a MKR and a CDP holder I want to state the following:   The image problem for Maker and the whole Ethereum DeFi system is huge and it is real. Imagine the wave of people coming into the crypto space in this new cycle. A lot of them will be fascinated by the possibilities DeFi is providing for the average Joe. At this time if you are talking about DeFi, you are talking about Ethereum and eventually about Maker and I firmly believe this is a “once in a lifetime chance”. If we don’t fully compensate the harmed vault owners, I bet 5 out of the 10 google results for the search “Maker” will cover this topic. This is an image catastrophy. We have to realize that this is a competition and it is going to be tough. We don’t want to loose against Binance and the likes. On the Binance Chain there is already a project called Bidao which is basically copying what the Maker DAO is doing. I can’t stress this enough. Imagine new customers who have to decide between a Maker CDP and a Bidao CDP and the internet is full of “Maker is a scam…” tweets. What are the gonna choose?   On the official CDP GUIs there was only talk of the “13 % liquidation penalty”. This is highly misleading. Just putting “In case of liquidation you may loose up to 100 % of your collateral. Learn more here (link to a decent explanation of how the liquidation process works).” beneath would have been enough. I don’t want to point my finger at anybody here, but I can hardly believe this was not intentional.   In this thread there is talk about a compensation between 0 % and 25 % and about whether to take into account the ETH value at liquidation time or the ETH value now. We have to make very clear to ourselves what this means. Let us look at an example. Say a user had 100 ETH locked in his CDP. If he was compensated with 25 % at liquidation time, it would have gotten him 25 ETH which is around USD 5,000 now. But if you only compensate him with say 12.5 % this would be only 12.5 ETH. And on top of that, if you really honestly think about taking into account the ETH price at liquidation time, say USD 100, he would only get back USD 1,250. So it is USD 1,250 compared to USD 5,000 he should get. In my opinion most of the vault owners would say you can keep that USD 1,250 too, join the legal class action, rant on social media and call it a scam. And on my behalf, I could not really say they are wrong.   To summarize this, I think Maker is in an unique and very fortunate position right now in the emerging DeFi space. Competition is heating up and MKR should try everything to avoid this public relations catastrophy. The user interface not mentioning the risk of loosing all of the collateral was clearly a failure on Maker DAO’s side. This was not the fault of the average user. I absolutely can not understand why on earth the ETH price at liquidation time should be taken into account. It is clearly not the user’s fault how long it takes Maker to sort this out. Maker DAO should compensate the harmed cdp owners fully and of course take into account today’s value of ETH. This is not only the best for the harmed cdp owners but also for the MKR holders in the mid to long term. I am myself a holder of MKR and firmly believe in this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.373330966727194
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#62",
                    "likes": "2",
                    "time": "30/04/2020-18:20:39",
                    "content": "    benita:  Why did we vote at all then? Sorry but you can possibly say that about every point in time.   Agreeing in principle to something without information and agreeing to a specific implementation with the details in hand are two are different things. I’m talking about having an option for reconsidering. What’s the problem with having an option on the poll? If, as you say, people already voted in favour, then you should expect the majority to be in favour. If the majority is not in favour of compensation at a later point, then we need to know that as well. Having the option on the final poll provides information, there is no reason not to include it. Like, you do understand that MKR Holders can always not vote for an executive, right? You cannot force the protocol to compensate based on that previous poll. The final implementation must pass a yes/no vote at some point. DAI cannot be removed from the protocol without MKR Holders voting for it, and thus far that hasn’t happened.     benita:  …I am myself a holder of MKR and firmly believe in this.   Awesome, I encourage you to vote to that end then. I’d also encourage you to volunteer to help make it all happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.216269841269842
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#63",
                    "likes": "1",
                    "time": "30/04/2020-18:45:09",
                    "content": "I did not want to be rude. I sincerely apologize if you got the impression. I value your input and really appreciate all the work you put in this topic.     LongForWisdom:  Agreeing in principle to something without information and agreeing to a specific implementation with the details in hand are two are different things.   It is wrong that we didn’t have any information. We can always gather more information but I think it is in the interest of all of us to solve this problem as soon as possible.     LongForWisdom:  I’m talking about having an option for reconsidering. What’s the problem with having an option on the poll? If, as you say, people already voted in favour, then you should expect the majority to be in favour. If the majority is not in favour of compensation at a later point, then we need to know that as well. Having the option on the final poll provides information, there is no reason not to include it.   I just don’t think it is right to let the people vote until it suits my opinion. For example I didn’t favor the possibility of a second Brexit vote although the result from the first vote didn’t match my opinion.     LongForWisdom:  Like, you do understand that MKR Holders can always not vote for an executive, right? You cannot force the protocol to compensate based on that previous poll. The final implementation must pass a yes/no vote at some point. DAI cannot be removed from the protocol without MKR Holders voting for it, and thus far that hasn’t happened.   I know that but I don’t think it would be right (see above).     LongForWisdom:  Awesome, I encourage you to vote to that end then. I’d also encourage you to volunteer to help make it all happen.   Thanks again for your input and if I can help I am happy to do so. I do some data analysis but probably not on a level with MakerMan for example. Can you give an overview what you think are the main challenges? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.784161490683229
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#64",
                    "likes": "3",
                    "time": "30/04/2020-19:20:13",
                    "content": "    benita:  On the official CDP GUIs there was only talk of the “13 % liquidation penalty”. This is highly misleading. Just putting “In case of liquidation you may loose up to 100 % of your collateral. Learn more here (link to a decent explanation of how the liquidation process works).” beneath would have been enough. I don’t want to point my finger at anybody here, but I can hardly believe this was not intentional.   The information about risks was available to vault owners, in the Oasis terms of service (https://oasis.app/terms) as well as the MCD docs (https://docs.makerdao.com). It seems irresponsible to make investment and lending decisions solely based on reading one sentence from the UI, without looking into the docs and terms of service. I’m personally in favor of making some sort of payments to vaults as a goodwill gesture, but I wish vault owners were more willing to accept responsibility for their actions as well. ",
                    "links": [
                        "https://docs.makerdao.com"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.730944055944056
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#65",
                    "likes": "0",
                    "time": "30/04/2020-19:30:16",
                    "content": "    monet-supply:  The information about risks was available to vault owners, in the Oasis terms of service (https://oasis.app/terms) as well as the MCD docs (https://docs.makerdao.com). It seems irresponsible to make investment and lending decisions solely based on reading one sentence from the UI, without looking into the docs and terms of service.   Yes but why not present it on the main GUI? It may be irresponsible but this is how the vast majority of consumers makes this kind of decisions.     monet-supply:  I’m personally in favor of making some sort of payments to vaults as a goodwill gesture, but I wish vault owners were more willing to accept responsibility for their actions as well.   Maker holders have every right to do so. I’m sure most vault owners were perfectly fine with the 13 % penalty but they did not accept that somehow hidden responsibility for loosing all of their collateral. You may call that unfair, call them dumb, you can even call them idiots, but most of them are never going to come back. ",
                    "links": [
                        "https://docs.makerdao.com"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6326058201058204
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#66",
                    "likes": "1",
                    "time": "30/04/2020-19:30:50",
                    "content": "    monet-supply:      benita:  On the official CDP GUIs there was only talk of the “13 % liquidation penalty”. This is highly misleading. Just putting “In case of liquidation you may loose up to 100 % of your collateral. Learn more here (link to a decent explanation of how the liquidation process works).” beneath would have been enough. I don’t want to point my finger at anybody here, but I can hardly believe this was not intentional.   The information about risks was available to vault owners, in the Oasis terms of service (https://oasis.app/terms) as well as the MCD docs (https://docs.makerdao.com). It seems irresponsible to make investment and lending decisions solely based on reading one sentence from the UI, without looking into the docs and terms of service. I’m personally in favor of making some sort of payments to vaults as a goodwill gesture, but I wish vault owners were more willing to accept responsibility for their actions as well.   I completely agree with this.   I do not have some illusion that IF I fall under liquidation that I ‘shall’ receive.  It is ‘may’ and ‘may’ is caveated on whether an auction fetches a certain value relative to what I borrowed. I like the idea of being able to buy some liquidation insurance.  For me it would simply be to buy some time until I could get some DAI moved to cover some of the debt.   Generally I try to keep my liquiidation exposure risk pretty well moderated with conservative CRs in most cases. I do think that the system should try to optimize against liquidations, and to optimize for return to vault holder in that case.   Adjustments of LR, LF can totally help optimizing return to vault holders.   As to liquidations they are also going to have some ‘market risk’ involved that could lead to 0 return.   The idea that IF I am liquidated I am entitled to some compensation for collateral lost isn’t going to fly very well with me. Here is what I am concerned about.  After compensation this idea that the system owes people some level of performance otherwise the system will owe them compensation. Lets drop all pretenses from this point forward for everyone.   You can lose all your collateral here.  Go and read the risks for all players in various Maker event scenarios.  If you don’t understand the risks simply don’t deposit.  It really is that simple.   The idea Maker or any other DeFI product centralized or not won’t experience problems in various situations that will eat your capital  - DO NOT KID yourself.   centralized and decentralized hacks/breakins happen all the time.  It WILL happen again.   Spread and minimize your risk against your gain exposure.  This way no one event till crush you financially. imo. ",
                    "links": [
                        "https://docs.makerdao.com"
                    ],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.740924592648731
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#67",
                    "likes": "0",
                    "time": "30/04/2020-19:37:08",
                    "content": "100 % agree IF the risk was mentioned on the main GUI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#68",
                    "likes": "3",
                    "time": "30/04/2020-19:52:12",
                    "content": "I’d agree that clearer messaging would be helpful. But MKR holders and the protocol don’t have a way of enforcing risk disclosures on GUIs. Ultimately the code and the docs are the source of truth about risks of the protocol and how everything works. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#69",
                    "likes": "0",
                    "time": "30/04/2020-20:01:13",
                    "content": "It is as it is. But do you think if, for example backed by a poll, Maker holders would have reached out to the foundation, it would not have put it on their GUI? I think this discussion goes in the wrong direction. I don’t blame us, the MKR holders. This is not about “who’s fault is it?”. I think full compensation lies in the very own interest of the MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#70",
                    "likes": "1",
                    "time": "30/04/2020-20:01:47",
                    "content": "    benita:  I did not want to be rude. I sincerely apologize if you got the impression.   Appreciate that. I was probably over-reading into it too, for which I also apologize.     benita:  I just don’t think it is right to let the people vote until it suits my opinion.   So this is a fair point, which I agree with in the abstract. However this situation is not the same as Brexit. Imagine Brexit if Brexit was not physically possible to enact without a second vote containing all of the details and the options of yes/no. That is closer to how the Maker Protocol behaves. It’s actually impossible for governance to credibly precommit to anything currently. The best we can do is signal intent at a specific time, with the information we have at that time. The only binding decisions the Protocol can make are through executive votes, and even then in most cases we can undo changes we make (for example to system parameters.) Minting and distributing DAI is obviously something that we can’t undo. But in order to do that smart contract code needs to be written and included within an executive vote.     benita:  I know that but I don’t think it would be right (see above).   This is unfortunately not a relevant point. It doesn’t matter whether it’s morally correct or not, it’s how the Maker Protocol works. The protocol has not yet distributed DAI (or whatever unit of compensation), up until the executive vote that distributes compensation passes, MKR Token Holders can still back out. The danger of excluding 0% from the polls is that everyone gets blindsided when the executive vote fails to pass because no one realized that sentiment had shifted earlier. We need as much signal as possible at every step of the process and that includes the signal from those that do not want to compensate.     benita:  Can you give an overview what you think are the main challenges?   Okay, so in terms of decision making, we need to decide the following: A) To what level of collateral are we compensating Vaults (0% - 24%) B) What ETH price do we use for compensation (assuming compensation in DAI for simplicity)? Someone needs to figure out: C) Do we need to create a working group to figure out the below? How are these people paid? Who organizes this? D) What are the actual mechanics (in terms of executive spell code) required to do this? E) Who will write this code? F) Do we need a smart contract outside of the executive spell? G) Do we need a UI / Frontend? H) Do we need some sort of legal declaration to exclude those that are compensated from the lawsuit? I) Do we make compensation opt in? Or do we just airdrop DAI? That’s what I have off the top of my head. I’m fairly sure there are things I haven’t thought of. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.661764705882353
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#71",
                    "likes": "1",
                    "time": "30/04/2020-20:09:33",
                    "content": "I think compensation is an opt-in with a sign off for litigation at a minimum at least we can start clearing people who aren’t going to wait for a class action.   Those who want to join the class action can sign up.   Either way.   I would like legal opinion on whether we can get a decent litigation sign off by those who accept. A-B are pretty much the first things to decide.  I think I is off the table.  We should not just airdrop the people need to do something to get their compensation.  How all of the mechanics after compensation is decided will probably take more time than A-B. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.814814814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#72",
                    "likes": "2",
                    "time": "30/04/2020-20:48:40",
                    "content": "Thanks for your answer. From a public relations point of view, one could argue that we should compensate all or nothing. E. g. if we only compensate to a level of say 12.5 %, I think the negative press a la “Maker only pays back half…” will outweigh the positive press a la “Maker compensates vault owners”. Any thoughts on this? I will give my personal opinion on your points below.     LongForWisdom:  Okay, so in terms of decision making, we need to decide the following: A) To what level of collateral are we compensating Vaults (0% - 24%) B) What ETH price do we use for compensation (assuming compensation in DAI for simplicity)? Someone needs to figure out: C) Do we need to create a working group to figure out the below? How are these people paid? Who organizes this? D) What are the actual mechanics (in terms of executive spell code) required to do this? E) Who will write this code? F) Do we need a smart contract outside of the executive spell? G) Do we need a UI / Frontend? H) Do we need some sort of legal declaration to exclude those that are compensated from the lawsuit? I) Do we make compensation opt in? Or do we just airdrop DAI? That’s what I have off the top of my head. I’m fairly sure there are things I haven’t thought of.   A) We should fully compensate. The money we could save is not worth the bad press in my opinion. We should show some generosity and it will pay out in the long term. B) This would backfire even more. Without doubt it is not the vault owners fault that it took Maker so long to get their stuff done. Please note that this is not neccessarily my own opinion but this is what the narrative will be. C) to I) Correct me if I’m wrong but I think it is the Foundation which may be sued. So I think the Foundation should step forward, get legal advice, and find out if it could get some legal advantage if the MKR holders compensate the vault owners, e. g. that owners who accept this offer can’t take place in the lawsuit. If this is the case I would be happy to help the Foundation by including a legal declaration, opt-in et cetera. I think the legal situation has to be clear before we talk about further proceedings (point C to I). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.565259740259741
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#73",
                    "likes": "1",
                    "time": "30/04/2020-21:09:23",
                    "content": "    benita:  I think the legal situation has to be clear before we talk about further proceedings (point C to I).   I reject the notion that the legal situation is not already clear. If the Foundation was going to make a statement, we’d have it already. Let’s not keep waiting.     LongForWisdom:  H) Do we need some sort of legal declaration to exclude those that are compensated from the lawsuit?   We don’t need a legal declaration, but it’s an opportunity to include one.     benita:  So I think the Foundation should step forward, get legal advice, and find out if it could get some legal advantage   Let’s not wait for this to happen. Let’s just include a legal declaration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#74",
                    "likes": "0",
                    "time": "30/04/2020-21:11:55",
                    "content": "    psychonaut:  We don’t need a legal declaration, but it’s an opportunity to include one.   What advantage does it bring then to include one? I think everybody agrees that an airdrop is far easier than creating a GUI and let everybody opt-in. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#75",
                    "likes": "0",
                    "time": "30/04/2020-21:12:41",
                    "content": "    LongForWisdom:  F) Do we need a smart contract outside of the executive spell?   Yes because the compensation needs to be opt-in via a smart contract. Even if we did an airdrop, it would cost too much gas for a single transaction. Hence, we need a smart contract either way.     LongForWisdom:  G) Do we need a UI / Frontend?   Yes, but is as simple as the burn button on https://daistats.com/#/ Instead of burn it would be claim compensation ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.551020408163265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#76",
                    "likes": "1",
                    "time": "30/04/2020-21:13:45",
                    "content": "    benita:  I think everybody agrees that an airdrop is far easier than creating a GUI and let everybody opt-in.   Certainly don’t agree. Please explain exactly how an airdrop might work? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.940476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#77",
                    "likes": "0",
                    "time": "30/04/2020-21:17:44",
                    "content": "    psychonaut:  Certainly don’t agree. Please explain exactly how an airdrop might work?   I certainly lack blockchain expertise. Only thing I can say for me it would be far less time consuming to write a script which sends 1 BTC to say 1000 adresses as to code a website with a GUI where verified users can claim their DAI. But I really have to trust people like you on this behalf. Can you please also comment on this one:     benita:  What advantage does it bring then to include one?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.579931972789116
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hsingh21",
                    "index": "#78",
                    "likes": "2",
                    "time": "30/04/2020-21:19:08",
                    "content": "Bentita, this is the kind of thinking that makes projects and teams thrive, well said. I am here as a individual customer on Maker Dao but i can tell you that i am heavily involved on the institutional fund side and i would make it my mission to let every fund know of my experience here, this is a defining moment for Maker Dao, my hope is that the project shines and does the rite thing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#79",
                    "likes": "2",
                    "time": "30/04/2020-21:20:35",
                    "content": "    benita:  for me it would be far less time consuming to write a script which sends 1 BTC to say 1000 adresses   Maybe this would be easier, but we’re trying to minimize trust. What if I promise to airdrop compensation and walk away with the cash? Given that the smart contract should be pretty simple, it’s much better to route the compensation trustlessly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.748015873015873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#80",
                    "likes": "2",
                    "time": "30/04/2020-21:23:19",
                    "content": "    benita:      psychonaut:  We don’t need a legal declaration, but it’s an opportunity to include one.   What advantage does it bring then to include one?   It helps people realize that they shouldn’t expect to claim compensation AND join a legal action against the Foundation. It’s one or the other. You shouldn’t try to choose both. Even if the declaration has no legal weight, it should be included as an educational device. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#81",
                    "likes": "0",
                    "time": "01/05/2020-01:41:38",
                    "content": "So well said! Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#82",
                    "likes": "0",
                    "time": "01/05/2020-01:45:34",
                    "content": "Well said! I feel exactly the same way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxlev",
                    "index": "#83",
                    "likes": "0",
                    "time": "01/05/2020-01:45:51",
                    "content": "It seems from this discussion there is strong preference to get compensated in ETH and to adjust for the upward drift in ETH price since Black Thursday. From a process perspective it makes sense to just do the grunt of various implementations of ETH-DAI settlement price:  Determine number of required price feeds for ETH-DAI to reduce bias from any one exchange during times of extreme market duress Select candidate price feeds Remove from set 2) feeds where ETH-DAI fall below an arbitrary N-day arithmetic ADV Bias correction mechanism e.g. for any cross-sectional set of price feeds, throw out the min/max, then take the median of remaining set Decide of averaging mechanism and duration e.g. exponential weighting (Beta=0.001; 1/(1-0.001) ~ spot price, Beta=0.98, 1/(1-0.98) ~ 50 days historical observations)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.034722222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#84",
                    "likes": "1",
                    "time": "01/05/2020-02:03:40",
                    "content": "    maxlev:  It seems from this discussion there is strong preference to get compensated in ETH and to adjust for the upward drift in ETH price since Black Thursday.   Do you mean to say DAI here instead of the first usage of ETH? If users are compensated in ETH there is no reason to adjust based on drift in the ETH price. Or do you mean to compensate for the price drift on the buy side? IE the Protocol goes and buys ETH with DAI, expending more/less DAI to compensate for the drift? I had trouble following this as written. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.779761904761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#85",
                    "likes": "4",
                    "time": "01/05/2020-14:45:04",
                    "content": "I had a wierd thought but have not looked at this in comparison to any price medianization to use the tab itself as the ETH in DAI valuing mechanism. Rough example: Say a tab is 4K DAI and the Tab*1.13 is 4520 DAI and the lot is 50 ETH.   Say governance decides the return on ETH collateral is 10%. So this means the 45 ETH had to sell for 4520 DAI or putting a tab price at 10% collateral return at 100.44DAI/ETH so the DAI owed here would be 5*100.44 DAI=502.20.   Effective DAI return on the tab in this case is 502.22/4520 = 11.1% Running this at 5 and 20%   we get 47.5ETH     4520      95.15DAI/ETH     2.5      237.89 DAI     gives 5.26% DAI return 45 ETH       4520      100.44DAI/ETH   5         502.22 DAI     11.11% DAI return 40ETH        4520      113DAI/ETH        10       1130DAI          25% DAI return. One can see with the higher nominal collateral return the effective return percentage is higher than the nominal collateral return % simply because the effective ETH price is higher.    Quick look at this is that the DAI return formula is like. NDR (Nominal DAI return) = TAB * NCR / (1-NCR)  where NCR = Nominal Collateral Return. Doing something like this basically removes all the market prices out of it and just focuses the DAI return on the TAB size offered at the time for the auction LOT.   Some thinking would have to go into implications of this vs. a price tab but easily doable from a numbers perspective.   I will take a look at seeing if I can do a table of the above with the data I have.   If someone wants to come up with a good median pricing based on what (time of auction kick/deal) we could compare resulting numbers. EDIT:  I was looking at the above for various tab %'s (columns in the table in compensation report).  The odd one is where people got an actual collateral return less than the nominal that we are making up the difference vs. the ones who got 0 collateral return.   (i.e. column 114 vs. all the other columns). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.962719298245615
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Who_is_John_Galt",
                    "index": "#86",
                    "likes": "1",
                    "time": "02/05/2020-00:35:04",
                    "content": "Well if you claim that MKR holders are only partially responsible and others are partially responsible, then you cant have a condition to accept partial comp from MKR holders that prevents you from seeking additional comp from Foundation. Otherwise, your just socializing losses and shirking responsibility. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Who_is_John_Galt",
                    "index": "#87",
                    "likes": "0",
                    "time": "02/05/2020-00:37:29",
                    "content": "WRONG. If Longforwisdom’s argument is that MKR holders are not fully responsibile therefore MKR holders dont need to comp you full amount of losses, then why shouldnt I be able to ask the Foundation for other share of loss/responsibiliyt? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.28125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#88",
                    "likes": "6",
                    "time": "02/05/2020-00:54:13",
                    "content": "Please keep the conversation civil. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ta32",
                    "index": "#89",
                    "likes": "0",
                    "time": "02/05/2020-04:53:57",
                    "content": "my questions:   What was the lowest ETH price through the black friday event ( including external dexs )?   If we compensate vaults using the lowest ETH price + the liquidation price what % of collateral will valut owners get.   Finally if 62842.93ETH were to be liquidated on the open market in the de-fi space ( dex’s ect ) there would have been slippage and the ETH price would have dropped by X% yielding a new ETH low.  If compensate values using the lowest ETH price - X% then apply the liquidation penalty what % of collateral will valut owners get?  for all these options how much will it cost MKR? I think the compensation should be made in DAI, or if it’s to be done with ETH how much will this cost ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.2310606060606055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andrew",
                    "index": "#90",
                    "likes": "3",
                    "time": "02/05/2020-07:23:14",
                    "content": "    fullname:  Remember, we are not just talking about a technical problem here, but also of a false (or bad) advertising of the «13% liquidation penalty» that were only explained in the github README.md in a not precise manner. This number was displayed everywhere, not only on UIs, but in every Medium article of ETH dev & experts. We can be sure that a big majority of the impacted vault holders were expecting 13% penalty applied on their loan.   This is the key point from my perspective - the advertised possible loss was 13% based on the published materials. Compensation should be vault value less 13%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.5606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#91",
                    "likes": "2",
                    "time": "02/05/2020-09:31:45",
                    "content": "    andrew:  This is the key point from my perspective - the advertised possible loss was 13% based on the published materials. Compensation should be vault value less 13%.   I’d agree a priori with this… but what about the opportunity cost that this loss had caused on people! We’ve been more than one month an a half without being able to operate with our vaults! Also, the emotional and reputational cost is important to consider!! Individuals has lost tens of thousends USD valued vaults, this has an strong impact in people’s lives, in their self esteem and their relationship with their beloved! Just think about how your wife could react against you when you told her that you have lost a huge a ammount of money during this global fears in the times of the pandeminc!!??? Of course these are costs impossible to calculate… Therefore I am in the opinion that this 13% of penalty should be forgiven… That seems to be a good compromise. Do you think? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.113095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#94",
                    "likes": "7",
                    "time": "03/05/2020-14:12:34",
                    "content": "Lowest ETH price really isn’t a good metric.   Have to think about market price during liquidation really as this was a rolling and moving black swan event.   back to back 25% pricing drops in 24hours. If one looked at rough averages across most exchanges a rough rolling average low probably would be between 75-80 USD/ETH as an average price bottom.   Vault 2288 had a sell of 2200 ETH in that band while self liquidating. In EVERY vault case given OSM never dropped below 100 - at a $75 market price price no vault would have gotten ANY collateral back. I also want to be clear about what people felt was advertised.   Liquidaiton fee indeed is 13% but if you did one bit of research about what it meant to be liqidated you would also have turned up ‘at auction’ which never guarantees a price.   IF the live market is > 20% down from the OSM during liquidation those vaults will probably NOT get any collateral back AND the auctions will have been ‘efficient’.    My point here is that the 13% liquidation fee IS correct, not a mistatement or deception and I don’t believe there was ANYWHERE (please correct if wrong) that guaranteed you would get any collateral back during liquidation - ONLY that the liquidation fee applied to liquidations was 13%. I really would like someone to go find what the actual statements are regarding what happens during collateral liquidation (not just for Maker but all DeFI products) and post them in another forum thread.   DeFI advertising.   I don’t read anywhere ANY guarantees of getting funds back during any liquidations, and tons of risks that say 'you could lose it all, due to smart contract bugs, market risks, liquidation risks, etc. etc.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1606854256854255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#95",
                    "likes": "0",
                    "time": "03/05/2020-17:14:28",
                    "content": "    MakerMan:  In EVERY vault case given OSM never dropped below 100 - at a $75 market price price no vault would have gotten ANY collateral back.   Can you please explain what you mean by that? The vaults we are talking about did not receive any collateral back.     MakerMan:  I also want to be clear about what people felt was advertised. Liquidaiton fee indeed is 13% but if you did one bit of research about what it meant to be liqidated you would also have turned up ‘at auction’ which never guarantees a price. IF the live market is > 20% down from the OSM during liquidation those vaults will probably NOT get any collateral back AND the auctions will have been ‘efficient’. My point here is that the 13% liquidation fee IS correct, not a mistatement or deception and I don’t believe there was ANYWHERE (please correct if wrong) that guaranteed you would get any collateral back during liquidation - ONLY that the liquidation fee applied to liquidations was 13%.   I think nobody in this thread said that the 13 % liquidation fee is incorrect.     MakerMan:  I really would like someone to go find what the actual statements are regarding what happens during collateral liquidation (not just for Maker but all DeFI products) and post them in another forum thread.   I don’t get what point you are trying to make. The topic here are Maker’s cdps not other defi products. I think part of this discussion is missing the point here. In my opinion the topic is missleading advertising. Can we agree that it was a failure to not include any text like “warning, you can loose all your collateral” in the main GUI? If we agree on this, we should make it our very own duty to compensate the harmed owners to the fullest extent. If the majority of MKR holders thinks that it was totally ok to not point out the risk to our “users”, we should not compensate at all in my opinion. EDIT: If any normal company would have run an ad without mentioning that risk, they would have been forced by law to compensate their customers fully, at least in my country. And exactly these are the rivals we are ultimatelly competing with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.039975000844566
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#96",
                    "likes": "3",
                    "time": "03/05/2020-18:02:15",
                    "content": "This has been discussed already but Maker holders are not responsible for the GUI of any websites, so that is a bit of a moot point. And as you said the 13% liquidation penalty is correct so I don’t understand how you are also claiming it is false advertising. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benita",
                    "index": "#97",
                    "likes": "0",
                    "time": "03/05/2020-18:08:51",
                    "content": "    monet-supply:  This has been discussed already but Maker holders are not responsible for the GUI of any websites, so that is a bit of a moot point.   Are you trying to say that MKR holders have no influence on the main GUI design. If this is your point then it is absolutely clear that we have zero responsibility, hence 0 compensation. What are we even talking about then?     monet-supply:  And as you said the 13% liquidation penalty is correct so I don’t understand how you are also claiming it is false advertising.   Do not quote me wrong. I never claimed this is false advertising. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.055555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#98",
                    "likes": "1",
                    "time": "03/05/2020-18:14:35",
                    "content": "    benita:  Are you trying to say that MKR holders have no influence on the main GUI design. If this is your point then it is absolutely clear that we have zero responsibility, hence 0 compensation. What are we even talking about then?   This is correct. The Protocol doesn’t have UIs, most MKR Token Holders have had no input on the Oasis design (possibly bar taking part in user research surveys). But to be clear, there is responsibility on MKR Token Holders, but that responsibility is for the auction parameters that led to sub-optimal liquidations in the event of a market crisis. How much responsibility is that? Well in my opinion it’s not zero, but it’s also not the lions share, hence my suggestion that we split between the received (0%) and the ideal-given-circumstances (11%) ending at 5.5%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.888888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#99",
                    "likes": "1",
                    "time": "03/05/2020-18:15:53",
                    "content": "Looks like I missed your questions/points.  My apologies. AFAIK Maker does not run ‘ads’ so there is no advertisement.  There is ‘documenation’. How about we focus on your primary point since making claims of false advertising, or misleading Terms or Service, etc. requires the plantiff to make the case.   I spent some time looking and frankly the documentation regarding liquidation risks were reasonably clear to me. Example: https://makerdao.com/en/whitepaper/#maker-protocol-auctions If enough Dai is bid in the Collateral Auction to fully cover the Vault obligations plus the Liquidation Penalty, that auction converts to a Reverse Collateral Auction in an attempt to sell as little collateral as possible. Any leftover collateral is returned to the original Vault owner. In fact the entire whitepaper here is clear on all the system risks and from what I can see was posted prior to MCD release. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.130681818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#100",
                    "likes": "2",
                    "time": "03/05/2020-18:32:35",
                    "content": "Personally while Maker expects the auction/liquidation system to work properly and be efficient and liquid at all times this can not be guaranteed.   This is particularly true during a Black Swan event described in the MCD whitepaper.    There are also documented all kinds of other risks. I think what is interesting here is that Maker is supposed to serve the masses of underserved yet we have zero control over secondary UIs and terms of service statements.   In fact I was looking for a Terms of Service for Maker and so far can’t find one.    Also while probably obvious to everyone else but it is not entirely obvious to me the family of websites/domain names controlled by the MakerDAO vs. other ones that are 3rd party built.   This contributes to loss of funds and I think a general misunderstanding of what is really Maker proper vs. someone elses Maker UI. Found the oasis TOS. https://oasis.app/terms Last Revised: 18 November 2019 (on release of MCD) 4.10 Financial Risks…   Seems pretty clear. 6.  Limitation on Liability. No TOS on MakerDAO.com which as far as I can tell is supposed to be the central hub  where MakerDAO users come to learn about Maker, the DAO, DAI, MCD, etc. Here is another version of liquidation info. https://community-development.makerdao.com/makerdao-mcd-faqs/faqs/liquidation No-where in this document (as contrasted with whitepaper which is clearer imo) does it specifically say anything about the collateral return being 0 if auction does not yield sufficient price on collateral. ",
                    "links": [
                        "http://MakerDAO.com",
                        "https://community-development.makerdao.com/makerdao-mcd-faqs/faqs/liquidation"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#101",
                    "likes": "0",
                    "time": "04/05/2020-11:39:00",
                    "content": "    MakerMan:  My point here is that the 13% liquidation fee IS correct, not a mistatement or deception and I don’t believe there was ANYWHERE (please correct if wrong) that guaranteed you would get any collateral back during liquidation - ONLY that the liquidation fee applied to liquidations was 13%.   no one is saying 13% liquidation fee is incorrect. the problem here is that in that event, part of the vault should has been liquidated (enought to guarantee the proper collateralization of the debt position), not the entire vault as it actually happened! --> https://community-development.makerdao.com/makerdao-mcd-faqs/faqs/liquidation#what-happens-during-a-liquidation     MakerMan:  I don’t read anywhere ANY guarantees of getting funds back during any liquidations, and tons of risks that say 'you could lose it all, due to smart contract bugs, market risks, liquidation risks, etc. etc.)   well, it was a governance decision that people will get funds back! you can read it here --> https://vote.makerdao.com/polling-proposal/qmwfvvguaf8rz8xwgv2cqnzzt9t5h6epzh17qmk2ue99y4 ",
                    "links": [
                        "https://vote.makerdao.com/polling-proposal/qmwfvvguaf8rz8xwgv2cqnzzt9t5h6epzh17qmk2ue99y4"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.794642857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#102",
                    "likes": "0",
                    "time": "04/05/2020-13:03:38",
                    "content": "I don’t entirely understand Table 8. Does this table show the gap between actual auction performance (columns) and collateral returned (rows)? You provide some analysis of past auction performance (rows); “Average auction collateral return was significantly lower than theoretical 24.7 percent and at best yielded 10% at best 1⁄2 to 1/3 of the auctions.” What about the columns? I think I don’t understand the columns. If the tab is 1.14 then what does that mean? Why is the gap larger for a tab of 1.14 in comparison to a tab of 0.01 (zero bid)? Shouldn’t the zero bid column have the largest gap? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.006944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#103",
                    "likes": "0",
                    "time": "04/05/2020-14:54:01",
                    "content": "    psychonaut:  I don’t entirely understand Table 8. Does this table show the gap between actual auction performance (columns) and collateral returned (rows)? You provide some analysis of past auction performance (rows); “Average auction collateral return was significantly lower than theoretical 24.7 percent and at best yielded 10% at best 1⁄2 to 1/3 of the auctions.” What about the columns? I think I don’t understand the columns. If the tab is 1.14 then what does that mean? Why is the gap larger for a tab of 1.14 in comparison to a tab of 0.01 (zero bid)? Shouldn’t the zero bid column have the largest gap?   Joshua, To answer your first question.  Yes the 114 column totals the collateral return deficit even for auctions that returned some collateral but not the nominal value. Regarding what the columns are:  I didn’t get to discuss the Compensation Matrix very much in the CC.   The columns there are a filter based on the amount of the tab returned.   All columns are less than vs. less than or equals.   If you look at the number of auctions and number of vaults in every column except the 114 the number is identical over the nominal collateral return percentage.   This was a sanity check that how I was calculating the data was consistent and correct.   Literally to calculate the 1% tab return you could take the 1% nominal collateral return and multiply by the nominal collateral return % you’d like to see (17.7% say) and get the exact number.  This is not true if one includes the auctions where full 113% of the tab was gotten but returned less than the chosen nominal collateral return (row) vs. 114% column matrix elements. The reason here is that every vault that returned < 113% tab also returned 0 collateral.   The quesiton was whether we wanted to compensate only the 0-bid auctions (1% Tab left most column) or perhaps we decide we only do everything under 113% (i.e. every auction that returned 0 collateral).   The 114% column though calculates the collateral deficit for auctions that paid the less than the chosen nominal collateral return (row) than AND equal to full 113% tab (column 114).   Example say an auction paid the full 113% tab but only returned say 5% collateral.   This auction and vault would only be included in rows where the nominal collateral return was expected to be greater than 5% and includes this as a difference in the total ETH to be compensated. It means that the total ETH to be compensated as well as number of vaults and auctions changes in that 114% column depending on what one decides the nominal collateral return is (row).  One can select the nominal collateral return row and take the difference between the 113 column ETH returned and the 114 column ETH returned and know this difference corresponds to all the vaults that paid the full 113% tab but did not return the nominal collateral return chosen vs. all the auctions/vaults that returned no collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.6295343137254905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#104",
                    "likes": "0",
                    "time": "04/05/2020-15:03:54",
                    "content": "    MakerMan:  It means that the total ETH to be compensated as well as number of vaults and auctions changes in that 114% column depending on what one decides the nominal collateral return is (row).   Is it plausible that all auctions could have raised enough to pay the full 114% tab, throughout the week of March 13? If so, then we only need to poll on the rows of column 1.14, correct? I’m trying to understand the array of vault compensation choices that we should poll. Can you speak to that? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#105",
                    "likes": "0",
                    "time": "04/05/2020-15:09:30",
                    "content": "IF you believe that all auctions should have returned collateral then you also believe that they would have ALL paid the nominal 113% tab (column 114) as well.   The tab % filter was simply to make sure I could do this calculation based on some kind of ‘auction performance filter’  tab, market price whatever…   It was an illustration of technical ability to be able to filter what is included in a compensation analysis based on a kind of ‘auction performance’. The reason for this was an idea that some people might say, hey the auction returned 100-113% of the tab (i.e. was profitable for the protocol) so why don’t we consider these good auctions.  Just because they didn’t return collateral to a vault holder doesn’t mean the auction ‘failed’ in some way. As to vault compensation choices and polling.   Basically one has to decide whether to have any additional criterion on the auctions selected to put into the compensation calculation.   I wanted to demonstrate as well as create a spreadsheet that basically could do that selection.    I think if I was going to poll on this conceptually I would poll on a simple question: Do we further filter the auctions or vaults based on some auction performance criterion:   Examples:  % of Tab,  % of Market (say CBP), % of OSM, % of Uniswap or some other criterion or combination of these? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.119318181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#106",
                    "likes": "0",
                    "time": "04/05/2020-15:17:46",
                    "content": "    MakerMan:  Just because they didn’t return collateral to a vault holder doesn’t mean the auction ‘failed’ in some way.   Yeah, I know. So the question is whether it is plausible that all auctions on the week of March 13 could have raised 114% or more. Doesn’t each particular vault’s liquidation price influence the likelihood of this outcome? During March 13, the OSM dropped to approx 100 DAI/ETH. If vault A had a liquidation price of 150 DAI/ETH then vault A is less likely to raise 114% than vault B with a liquidation price of 105, correct? Also, how would we decide the compensation of vaults that “self liquidated?” It seems to me that losses due to self liquidation are not the fault of the auction system because no Maker auction was involved. These people were just victims of extreme market volatility. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2734375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#107",
                    "likes": "0",
                    "time": "04/05/2020-15:33:53",
                    "content": "    psychonaut:      MakerMan:  Just because they didn’t return collateral to a vault holder doesn’t mean the auction ‘failed’ in some way.   Yeah, I know. So the question is whether it is plausible that all auctions on the week of March 13 could have raised 114% or more. Doesn’t each particular vault’s liquidation price influence the likelihood of this outcome? During March 13, the OSM dropped to approx 100 DAI/ETH. If vault A had a liquidation price of 150 DAI/ETH then vault A is less likely to raise 114% than vault B with a liquidation price of 105, correct?   To your first question.  Is it plausable that all auctions could have raised the full 113% of the tab and returned collateral.  Yes, lots of things are ‘plausible’.  Is it likely?  I think given what we were seeing at different points, unlikely.  But lets move to the real crux.  Your second question. You are right a vault with 150 liquidation price would be less likely to return collateral than one with a 105 liquidation price.   What happened to the OSM contributed to how this evolved. As to people who self-liquidated.   There is no simple answer really on those.   What I can say is that if people tried to preserve ETH one can just look at how much ETH they ended up with vs. how much they started with.   Vault 2288 for example (felix can correct me if I’m wrong) came up with 585.18ETH out of 5005 ETH his own self-liquidation trail is pretty clear.  If I have these numbers right he got 11.69% back. A vault by vault analysis over Black Thursday would be very interesting but also extremely time consuming.   It is something I am very interested in as an analysis project but simply don’t have the resources to even attempt it.   Paying Twicky out of the DAI I received for his nice work simply because I don’t have the technical ability to do the back end on-chain data gathering work.  I am not even sure if the community is interested enough to fund a greater analysis project encompassing these issues even if I had the manpower that could do it.   The goal would be to produce some kind of product one could use to apply to future market or Maker events but I don’t see this as a simple project.   Not entirely sure what we could learn but I think having a greater understanding of what is going on with vaults with a more detailed view particularly during events like Black Thursday would yield valuable information about the system generally. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.691387269193392
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#109",
                    "likes": "0",
                    "time": "04/05/2020-15:52:05",
                    "content": "    MakerMan:  A vault by vault analysis over Black Thursday would be very interesting but also extremely time consuming. It is something I am very interested in as an analysis project but simply don’t have the resources to even attempt it.   Too bad. I thought that we were at a place where we could poll for vault compensation, but now I think not.     MakerMan:  You are right a vault with 150 liquidation price would be less likely to return collateral than one with a 105 liquidation price. What happened to the OSM contributed to how this evolved.   In my mind, any sane estimate of vault compensation needs to take liquidation prices into account. If you don’t have time then we’ll have to commission the analysis via a gitcoin bounty or something. At least do you have time to spec out the requirements for such a project? Given your intimate familiarity with the data, you probably have the best understanding of what needs to be done. ",
                    "links": [
                        "https://forum.makerdao.com/t/polls-to-determine-specific-black-thurs-vault-compensation/2275/8"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.385531135531135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#110",
                    "likes": "0",
                    "time": "04/05/2020-16:02:32",
                    "content": "Let me correct something.  I can do the vault by vault compensation analysis and liquidations IN the system right now. When I said ‘vault by vault analysis’ above I mean EVERY vault not just the ones that were liquidated which would include vault 2288 and all the other vaults saved by DeFI saver, self liquidated etc.  I was talking a general analysis of what ALL vaults did on Black Thursday or at any other time.  I totally can do a vault by vault compensation analysis once governance pins down the details and produce a full vault by vault compensation report.   I just can’t do that until we settle on ideally the compensation scenario to apply. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.318632756132756
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#111",
                    "likes": "0",
                    "time": "04/05/2020-16:08:23",
                    "content": "    MakerMan:  I totally can do a vault by vault compensation analysis once governance pins down the details and produce a full vault by vault compensation report.   Great     MakerMan:  I just can’t do that until we settle on ideally the compensation scenario to apply.   I don’t even understand what are the choices to include in the poll. What scenarios do you think governance should choose among? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.894444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#112",
                    "likes": "0",
                    "time": "04/05/2020-17:48:11",
                    "content": "    psychonaut:  I don’t even understand what are the choices to include in the poll. What scenarios do you think governance should choose among?   I suggested above to poll first on nominal collateral return percentage and do it in ranges of 0, 0-5, 5-10, 10-15, 15-20, 20-25, >=25 on the 114 (ALL) as this will give the maximum ETH return any filter below will simply reduce the amount. Then poll on whether any filters should be applied to narrow the list (Yes/No). Examples:  Auction Performance (< Tab %, <Market %, Only 0-bid, etc.). Once we know the answers to the above on-chain polls I think then we shoud have at least some idea of what to do next.   All IMHO.     Maker MCD Ethereum System Liquidation report and Black Thursday Compensation Analysis Governance       Since there is some discussion around the nominal collateral return forming I realized I offered a limited set focused around an arbitrarily and possibly bias selected 10%.    The nominal collateral return CAN be any number.  If I was going to suggest brackets on a poll (should the poll be constructed to fix the nominal collateral return) perhaps 0, 0-5%, 5-10%, 10-15% 15-20% 20-25% might be the best working poll choices to rank on.   0, being no compensation, 25% being full theoretical with eve…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.988095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#113",
                    "likes": "0",
                    "time": "04/05/2020-18:05:46",
                    "content": "@MakerMan So you think compensation should not depend on liquidation price? In chat, MakerMan replied, “what I can say is that for the most part if auctions were functioning correctly they all would have returned collateral. We had two problems that day. A locked OSM that when it moved moved no more than 20%. There were no 150 ETH/USD vaults that went to liquidate into a market below $100. I can only say this based on what I see in the data. I have the OSM, UNISWAP, and CBP-H/L on the chart - please do look at it. The discount at auction to market when it was functioning wasn’t as big as you think to the LR. The 150 DAI/ETH liquidations happened earlier and imo for the most part would have yielded full tab even if they might have returned 0-10% collateral.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#114",
                    "likes": "9",
                    "time": "05/05/2020-19:30:47",
                    "content": "   Cointelegraph    MakerDAO Takes New Measures to Prevent Another ‘Black Swan’ Collapse The DeFi lending market MakerDAO has updated its governance protocols to prevent another occurrence of forced liquidations that lead to huge losses      @rich.brown please can we have some foundation/corporate energy go into solving this topic? The guys on this forum are putting in a good effort, but is it really on their shoulders to sort this out part time while the financially sound entity with paid employees sits back and waits for the result? Feels like this can go back and forth for another 6 months ",
                    "links": [
                        "https://cointelegraph.com/news/makerdao-takes-new-measures-to-prevent-another-black-swan-collapse/amp"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.960227272727272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#115",
                    "likes": "6",
                    "time": "05/05/2020-19:58:37",
                    "content": "Thank you for posting that article @Sandhaai I am going to add a main comment.   I still consider myself relatively new here, but I consider as probably the HIGHEST priority of Maker to deal with suring up the auction/liquidation system.   I have refrained from posting my DSR-L Liquidation back stop mechanism simply because some of the recommendations in my liquidation report are base requirements for the DSR-L.  We absolutely need to re-kick auctions if they don’t meet some minimum bid requirements not just in terms of price but also of number of participants. We need to stagger lot sizes in auctions.   This is key to gaining a better scientific view of auction processes. Change how the system operates if the auction price being offered or will fetch is significantly lower than the OSM.  (disjointed OSM to market) I think a review of the auction process itself with a goal of not just doing the least to sure up the system now is important but looking to the future to make a more efficient auction system which is easy to access for the most players.  Literally with the above I’d like to finally just nail down what I consider to be one of the biggest flaws in the Maker system, the liquidation process.   There are others to be sure but this one just stands out at me, probably because of how closely I have looked at the system. Maker community needs to take this seriously and really put some effort into driving this nail down. I am not going to MIPify my DSR-L proposal but at some point I am going to post it for consideration and leave it be.   What I have not done yet is to take the proposal and run it through a monte carlo simulation.   Honestly what I want to do is to just run the data from Black Thursday into it but I have not had the time, yet and the community seems to have its hands full of all kinds of other issues.   One other issue that cropped up from my work is this idea of the OSM and auction market bid/deal prices being disjointed.   This is a condition that needs to raise a flag operationally and ideally throttle or halt processes until the flag condition goes away.   To be sure I have looked at the risk scenarios here with the suggestions I will be making and frankly they are not worse than the ones we have in the system right now. Expect a post at least on the DSR-L at some point in the future.   I think there are so many steps in this process and so much discussion that literally nothing will happen for at least a year and I don’t think the DeFI space can wait.   We really need to fast track some solid approaches that can be overridden or managed manually by governance in a pinch.   12hrs may seem like a long time to wait to do something but if we design the system to be conservative and overly safe as we can by alleviating run-away conditions we already know about (OSM attack is one, black swan is another) we can then provide a solid and well defined operational backstop to the entire DeFi space that will provide a greater confidence to all participants during tail risk type events. The real problem here is everyone wants to run headlong into taking peoples capital and providing a service because it is ‘cool’ or ‘necessary’.  If at least one DeFI project doesn’t stand up and say, “we will go a little slower and more carefully for the sake of the entire DeFI space”, I have serious concerns during another Market crash ALL of DeFI will crash and burn, and everyone will throw up their hands and say “oh well, we did our best” and then hope we can rebuild. Heck with rebuilding after the DeFI a-bomb, lets just try to do the best we can to avoid the financial nuke we are building from laying waste to a massively growing but fragile space. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.605802272115832
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#116",
                    "likes": "6",
                    "time": "05/05/2020-20:14:08",
                    "content": "One last thing folks.  I am just working to clean up my spreadsheet and remove superfluous data before posting the data here for people to download and work with themselves. I have Twicky working on another dataset but did not put a rush on this.  My goal is to post the current ETH-A dataset in hand by next weekend (I am working 52hrs this week and have a family with 1yr 5yr old to take care of).   Also while I have been compensated for my work on the initial report and I am paying out of those funds for work from Twicky and there are no new funds for this work.    I have refrained from posting any addresses to raise funds as this just doesn’t feel right. I did and am putting up my 4K DAI  (now 3.85K roughly) against donations at 10:1 (1DAI from me for 10DAI from others) for a fully independent Maker Analysis Group to work on issues like this mostly so I have funds to pay other people.    Just e-mail [email protected] me if anyone is interested in doing work (paid or not) or making donations as I think it is important to form a fully independent Maker group dedicated to doing audits or other analysis because at some point the community needs to get off the Foundation Tit and walk on its own and I see no other way to do this but by simply doing it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.564920824789246
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Robin_masters",
                    "index": "#117",
                    "likes": "2",
                    "time": "11/05/2020-08:17:07",
                    "content": "    MakerMan:  ct something. I can do the vault by vault compensation analysis and liquidations IN the system right now. When I said ‘vault by vault analysis’ above I mean EVERY vault not just the ones that were liquidated which would include vault 2288 and all the other vaults saved by DeFI saver, self liquidated etc. I was talking a general analysis of what ALL vaults did on Black Thursday or at any other time.  I totally can do a vault by vault compensation analysis once governance pins down the details and produce a full vault by vault compensation report. I just can’t do that until we settle on ideally the compensation scenario to apply.   Just as expected, discussions about compensating vault owners slowly dies down, until no one remembers, only the people who lost all of their money and will never ever use Maker and will recommend the same to everyone they know. I will post on every forum that people should avoid the Maker system. Maybe centralized stable coins are what this society needs. Nevertheless, thanks to everyone in this forum who put in work to find a solution to this preposterous event! Sorry to see all this good intent be in vain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.156693817878029
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#118",
                    "likes": "3",
                    "time": "11/05/2020-09:36:54",
                    "content": "I’m willing to be on the working group if that is deemed necessary. I am a Javascript and React developer and so would be able to help put together a GUI. I can also help with analytics and other related work. I am not terribly experienced with solidity but I am learning. Probably cannot help very much with smart contracts atm but would love to be a part of any related meetings. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to collaborate on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None"
                    ],
                    "Sentiment": 5.599642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hsingh21",
                    "index": "#119",
                    "likes": "2",
                    "time": "11/05/2020-11:07:04",
                    "content": "This is totally unacceptable, Maker DAO can expect more press releases coming out soon, you cant just do this to us and expect to brush it under the carpet. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#120",
                    "likes": "0",
                    "time": "11/05/2020-17:31:40",
                    "content": "Agree that the lack of interest is illuminating. You could see where it was going a while away, but still ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Poligon_Assets",
                    "index": "#121",
                    "likes": "0",
                    "time": "13/05/2020-00:26:26",
                    "content": "I am one of those who let a notice pass in all the forums, warning about Maker→ and its mishandling to solve problems as serious as this. It cannot be that there is not yet a solution or are heading towards it ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#122",
                    "likes": "11",
                    "time": "13/05/2020-02:14:18",
                    "content": "This is to those who posted afterwards.  @Poligon_Assets @Sandhaai @hsingh21 @Robin_masters I understand everyones dissappointment with Maker.  Frankly I have my own beefs here far beyond what is being expressed by all of you that I endeavor to contain simply because it is my impression that we all have at our finger tips a possible avernue to a completely decentralized banking system.   All of us here are basically volunteers and guinea pigs.   Literally crypto proper - entire space on such a cutting edge that any time I turn in this space I have to realize I could lose all funds to a developer screw up no-one catches fast enough much less a catastropic market event… The idea that somehow decentralized little Maker is going to be something superior in every way possible and not living up to even doing the most basic things a CEX can do I can see as a great dissappointment to a lot of people. Every bold adventure has it’s share of good people that gave the last measure to see through. When it comes to discussion and status.   The few of us working on this are trying to gather enough working power and organization to move this through the next stages as quickly as reasonably practical.  We can’t even guarantee governance won’t stop us dead in our tracks at some point.  We don’t have huge MKR holders helping drive this train with any guidance or help (personal, financial, whatever) Right now status is such that a working group is forming to try to get a real plan of action in place that has an achievable time frame and a step by step process for governance to move through this to get from concept (voted on at 4/6/2020) to a result.    While any centralized system could just unilaterally move instantly and declare intent as well as back it with funds, Maker by design is decentralized and so by nature and practice is going to move more slowly than any centralized system. Would daily updates on compensation status help people feel better about this?   Perhaps people can comment. Has this whole thing died - most definitely NOT.   Will vault holders see compensation.  Governance has signalled it’s intent, a report finally generated, more people accumulating to work on this as a project. Current status a working group is forming and a master plan is being put together with a pretty aggressive time frame to completion. I am ok with vault holders venting on how slow this is and how they will never use Maker again, etc.  None of this is going to help anything move any faster and certainly isn’t going to fix the issues that still exist in the system now - today. I honestly hope people post warnings not just about Maker but the entire DeFI space because I do not want mom and pop joe six pack trying to use this stuff when it isn’t ready for prime time.   The reason there are high returns, and big money to be made in this space is because it is HIGHLY RISKY.  I cringe at the idea of retirement accounts getting into crypto because these people have no clue how much risk is in this space - both individually as well as collectively.   What I do know is that after everyone bitches about Ma ker, or Compound, or Synthetix, or whatever that with hard work, more blood sweat and lost money perhaps if this space doesn’t entirely implode on itself we might finally create a fully decentralized finance system that is reliable, robust, and the biggest piece impossible to shut down. So if you feel the need to vent - hey welcome aboard go for it - you want to post how this space sucks and Maker sucks - sure - how DeFI can eat ALL of your funds - DEFINITELY but don’t forget to point out that not everyone or everything in this space is screwed up and there is real HARD work being done to realize the vision in the space. What do they say - you can’t make an omlet without breaking a few eggs.  It is my hope that over time MakerDAO creates a system that breaks the least amount of eggs.   I know I have more ideas in my magic bag being buried in this whole compensation plan and data analysis I have not been able to post much less get any traction on the ones I have posted that sit unworked on. I will speak with folks and see if we can get a update thread up where we put in daily or at worst weekly updates on status on this issue and hope that people don’t completely lose sight that all of us in our own ways are trying to build a better eco-system.   It is our job to manage the huge risks here while doing our best not just to profit from the system, but to provide the environment for the system to grow and improve. It is my hope even if people feel Maker has let them down now, that perhaps some time in the near future you will find one or more reasons to give Maker another chance.  The beauty of this space is there are a hugely growing number of choices some better, most worse than others. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.596497584541062
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianmcli",
                    "index": "#123",
                    "likes": "6",
                    "time": "13/05/2020-10:34:39",
                    "content": "I have a feeling people are more angry at the Foundation than the DAO itself (i.e. MKR holders). There’s a perception that the Foundation has a lot of money and is just sitting on it paying high salaries to its team members who have been mostly silent on the matter. Not saying this is how I feel, but I know that there are many who do feel this way. @MakerMan your work is much appreciated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.716666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sah",
                    "index": "#124",
                    "likes": "2",
                    "time": "13/05/2020-14:52:48",
                    "content": "I think updates are great whenever you can do it daily/weekly. Getting updates often provides at least a little comfort through this difficult situation. Thanks again! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#125",
                    "likes": "0",
                    "time": "13/05/2020-15:03:45",
                    "content": "Weekly updates would be good, I think. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#126",
                    "likes": "0",
                    "time": "13/05/2020-15:19:25",
                    "content": "Yeah I think updates are important - should we just have a Maker Black Thursday Compensation Update Thread? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Poligon_Assets",
                    "index": "#127",
                    "likes": "0",
                    "time": "13/05/2020-23:41:57",
                    "content": "Your work is fantastic, but I don’t notice that this is aimed at a solution in the short term, and time is the most valuable thing we have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/execute007",
                    "index": "#128",
                    "likes": "0",
                    "time": "14/05/2020-00:47:22",
                    "content": "It’s already set in the “protocol”  go by that % ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andrew",
                    "index": "#129",
                    "likes": "6",
                    "time": "17/05/2020-23:52:49",
                    "content": "While I agree with this in concept, I think the longer it takes for compensation to be determined and distributed the more likely people will be to participate in the class action. Fair compensation is going to cover the vast majority of people and needs to be expedited for the benefit of the foundation and all concerned. I don’t understand why this is so difficult - if a compromise needs to be made to compensate in DAI - pick the highest DAI/ETH rate for Black Thursday then provide compensation to those in the liquidation range 763 to 4723 for their full vault values less 13%. If compensation in ETH is required then delaying this settlement may become increasingly more expensive the longer this is delayed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.371212121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/uvizhe",
                    "index": "#130",
                    "likes": "0",
                    "time": "21/05/2020-13:26:27",
                    "content": "Any news here? We definitely should have an updates thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ralph_Miclat",
                    "index": "#131",
                    "likes": "0",
                    "time": "24/05/2020-17:47:58",
                    "content": "Pls keep us updated on this. A lot of people are hoping for your ideas to work out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#132",
                    "likes": "1",
                    "time": "24/05/2020-17:51:15",
                    "content": "I see putting a link to updates fell through on this thread.     Maker Vault Compensation Updates and Status Governance       Greetings everyone.  I am starting this thread to have a single place for Updates on the above.   I will edit here so people can see the current status and items yet to be worked on.  My time is limited and LongForWisdom is a much better forum organizer so bear with me.  WORKING GROUP consists of @Joshua_Pritikin @LongForWisdom @MakerMan @monet-supply @Vault2288 @befitsandpiper  20200521 Status Update  While working on a comprehensive compensation plan we discovered there are more classes of peo…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.612244897959183
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#133",
                    "likes": "0",
                    "time": "25/05/2020-10:14:12",
                    "content": "It did. Going to close this thread. Discussion of updates should happen in the thread MakerMan linked above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#134",
                    "likes": "0",
                    "time": "25/05/2020-10:14:17",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}