{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-defi-dao-governance-report-a-review-of-major-defi-dao-governance-systems-in-the-ethereum-ecosystem/15156",
            "title": "Maker DeFi DAO Governance Report: A review of major DeFi DAO governance systems in the Ethereum ecosystem ",
            "index": 15156,
            "category": [
                "Resources",
                "Research"
            ],
            "tags": [
                "meta-governance",
                "research"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#1",
                    "likes": "20",
                    "time": "12/05/2022-23:17:08",
                    "content": "Hey, community! We want to share with you a DAO Governance Report we have put together with @ceresbzns of major DeFi DAO governance systems in the Ethereum ecosystem. The objective of our research is to provide a detailed and insightful analysis of the governance structures of Ethereum DAOs, so as to understand the state of the art and what learnings or best practices may be applied to Maker governance. The report was commissioned by the MakerDAO GovAlpha Core Unit in pursuit of its robustness initiative and we did our exploration trying to tackle the governance systems ups and downs of 8 of the most today’s prominent DAOs. Concepts such as broad participation, resistance to capture, resistance to attack, openness, and alignment of incentives run through the entire report as we move forward with the analysis of the different DAOs’ governance systems. These are key concepts to understand how these organizations are working today and what lessons they can teach us.  Short Summary As a short summary, we would like to highlight some initiatives that are happening out there that are worth paying attention to.  Dxdao’s Public Working Group Sessions This initiative makes the decision-making process of the working groups pretty transparent, allowing the attendance of other members of the community and recording each of their meetings. Many Maker Core Units do an excellent job of recording and disseminating information about their working group sessions. However, practices are not uniform across the CUs, nor are there explicitly requiring CU sessions to be open to anyone. We should consider implementing such an openness policy, in addition to baseline information sharing practices, in order to promote the free and open spread of high-quality information to all interested DAO contributors and Maker ecosystem participants.  Aave’s Governance Delay In the Aave ecosystem, an approved proposal focused on altering the protocol’s governance mechanism and tokens can be queued and will be executed after an execution delay of 7 days. In Maker, we have our Governance Security Module (GSM) pause delay currently set to 48 hours. This difference between the two protocols deserves our attention. We should consider modifying the 48 hour period to one that gives a greater margin of action in the face of a contingency that endangers the Maker ecosystem In short, these are just two of several actions/reflections that this research has left us. Quadratic Voting, Non-Transferable Voting Power, Voting Power Proportional to Vote-Escrowed Time Lock, Vesting Token Compensation for Contributors, Liquid Voting, Treasury Diversification and others are some of the mirrors we have found. Finally, we want to especially thank the @GovAlpha-Core-Unit  for their support, comments, and guidance throughout the entire process of preparing the report. ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-12-18-2022/15280",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-05-13/15172",
                        "https://forum.makerdao.com/t/signal-request-increase-the-esm-minimum-threshold/15006/18",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.863636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "4",
                    "time": "13/05/2022-00:02:51",
                    "content": "Excellent breakdown–nice work and very informative–you should publish it via a blog/tweet storm. If you decide to do v2, I request that you shed some light on how the Synthetix community played a role in the Optimism upcoming DAO Governance structure of the “Token House” and the “Citizens’ House” – the latter geared towards public goods funding and Soulbound (inspired by World of Warcraft) non-transferable NFTs. Sounds interesting, and like others–a challenging experiment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.857142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#3",
                    "likes": "4",
                    "time": "13/05/2022-04:35:03",
                    "content": "Thanks for this great report @TheExistence and @ceresbzns - a really helpful resource.     flipflopflapdelegate:  Governance structure of the “Token House” and the “Citizens’ House” – the latter geared towards public goods funding and Soulbound (inspired by World of Warcraft) non-transferable NFTs. Sounds interesting, and like others–a challenging experiment.   I agree with this, and would encourage anyone also interested in these topics to read this article published yesterday by Vitalik, Glen Weyl (author of ‘Radical Markets’) and Puja Ohlhaver. They set out a genuinely bold new vision for DAOs and DeFi (among other things), based on non-transferrable NFTs. Provocative and interesting!   papers.ssrn.com    Decentralized Society: Finding Web3's Soul Web3 today centers around expressing transferable, financialized assets, rather than encoding social relationships of trust. Yet many core economic activities—s      ",
                    "links": [
                        "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4105763"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.384343434343434
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/05/2022-14:16:54",
                    "content": "This is great. There is a wealth of information and a lot to learn from. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/05/2022-16:10:13",
                    "content": "Thanks for this wonderful report and the work that went into it. This is a very valuable resource and quite timely given the discussions that are going on right now. There was one part that wasn’t super clear to me:  Rather than dividing the political community into a class of ordinary citizens and a class of representative elites with decision-making power for the duration of a whole legislative period, liquid democracy divides the decision-making body in a given policy area into ordinary members with one vote and members with 2+N votes. To avoid this issue we need to reinforce a trustee, rather than a mere delegate model of representation with elements of deliberative democracy, and seek to increase the number of delegates (ideating rewards for their participation and follow up), mitigating existing whales and multiplying liquidity options.  Can you elaborate what is being said here? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.757936507936508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#6",
                    "likes": "1",
                    "time": "14/05/2022-17:34:37",
                    "content": "Thanks for the feedback! Yes, the project looks super interesting, it seems to be a bicameral system with crossed responsibilities and incentives. We should definitely keep an eye on its performance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#7",
                    "likes": "3",
                    "time": "14/05/2022-18:00:07",
                    "content": "    wouter:  Thanks for this wonderful report and the work that went into it. This is a very valuable resource and quite timely given the discussions that are going on right now.   Thanks!     wouter:  Can you elaborate what is being said here?   I meant that unlike what happens in a representative democracy where each citizen has one vote to elect representatives and where each representative has one vote to decide in the House of Representatives, in a liquid democracy the risk of rupture/splitting in two political castes lies in the unequal distribution of voting power and the possibility of discouraging ordinary members from directly participating in collective decision-making. Since their political resources to influence decisions are marginal compared to those of the delegates (with many more votes), ordinary members may have little reason to vote directly on policy issues. There, a possible solution lies in the multiplication of these “super representatives” via compensation, with regular accountability mechanisms, and the promotion of community participation via incentives and benefits to strengthen the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.074091478696742
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/08/2022-00:00:41",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}