{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dai-in-other-chains/7302",
            "title": "DAI in other Chains? ",
            "index": 7302,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "latin-america"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#1",
                    "likes": "3",
                    "time": "03/04/2021-23:14:53",
                    "content": "I am creating content for the DAG (DAI Action Groups) in Venezuela, and the question arose when I was talking to my team and some friends about creating content about DAI on other chains. Well, DAI is DAI, it only exists in Ethereum Mainet. How should these other versions of “DAI” be treated? I know that DAI is supported in Matic and RSK officially as far as I know. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.95
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "3",
                    "time": "03/04/2021-23:20:10",
                    "content": "As of right now, MakerDAO only supports/endorses Ethereum L1 and soon Optimism L2. Other “versions” (depending on the context) have no affiliation with MakerDAO at this time. Anyone can take DAI from Ethereum and “port” it to their sidechain. It’s up to those users to ensure that what they’re getting is actually backed by “real” DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.360714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "0",
                    "time": "03/04/2021-23:24:38",
                    "content": "Thanks for your input, so now my question is is it wrong for example to guide users from Venezuela or LATAM, to generate more “DAI” for these sidechains for example Matic’s Aave? And create that kind of content to guide them? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "2",
                    "time": "03/04/2021-23:41:54",
                    "content": "You can’t “generate” DAI from sidechains, only migrate it over if I understand your question. DAI can only be created on Ethereum. Sidechains could falsely generate as much DAI as they want but then it’s not backed by real DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#5",
                    "likes": "1",
                    "time": "05/04/2021-04:07:16",
                    "content": "I wonder if this is something Maker would want to explore at some point. If we could prove that the DAI on the sidechain is backed by DAI on Ethereum, this might be a nice boost for DAI adoption. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#6",
                    "likes": "0",
                    "time": "05/04/2021-05:45:10",
                    "content": "Yeah some third parties have added DAI support on other chains. 1:1 Bridges. Yeah, it’s cool for DAI adoption and it would give opportunities for liquidity mining programs to support DAI on other chains. And just using it as currency. There’s xDAI STAKE which uses DAI as it’s base currency for gas. multichain.xyz has a DAI bridge to Fantom and BSC Binance offers a DAI token on BSC but that’s a centralized bridge. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#7",
                    "likes": "0",
                    "time": "05/04/2021-18:24:16",
                    "content": "But do you think then that educating users and early adopters about the use of DAI on other networks, but encelando that the official support is still on Mainnet? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "1",
                    "time": "05/04/2021-19:01:37",
                    "content": "There’s also the Rainbow Bridge for DAI in NEAR. And back in twenty one nine–The Solana Community thought about getting DAI into their ecosystem–but you know how that goes…  image857×537 90.2 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                }
            ]
        }
    ]
}