{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967",
            "title": "MIP39c2-SP34: Creating RWF0x from a Split of RWF-001 ",
            "index": 16967,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "impact-:-high",
                "rwf-0x"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#1",
                    "likes": "14",
                    "time": "03/08/2022-10:41:06",
                    "content": " MIP39c2-SP34: Creating RWF-0x from a Split of RWF-001  Preamble MIP39c2-SP#: 34 Author: @christiancdpetersen Contributors: @teej and @eumenes Tags: core-unit, mandate, RWF-001 Status: Withdrawn Date Proposed: 2022-08-03 Date Approved: <yyyy-mm-dd> Forum URL: https://forum.makerdao.com/t/mip39c2-sp-creating-rwf0x-from-a-split-of-rwf-001/16967/1   Sentence Summary MIP39c2-SP34 splits the current Real World Finance Core Unit (RWF-001) into two separate Core Units and allocate the existing RWF-001 personnel and budget between the two separate Core Units. The proposal:  Iterates from @williamr’s original vision for RWAs. Promotes decentralization. Encourages competition. Reflects the global nature of Maker’s opportunities and the different time zones of the key contributors   Paragraph Summary MIP39c2-SP34 splits the current Real World Finance Core Unit (RWF-001) into two separate Core Units and allocate the existing RWF-001 personnel and budget between the two separate Core Units. The two Core Units will be RWF-0x and RWF-001. The existing RWF-001 budget for personnel and operational expenditures (including external legal) will be allocated as follows:  RWF-0x: 75% RWF-001: 25%  The Core Unit Facilitator for RWF-0x will be @christiancdpetersen. The Core Unit Facilitator for RWF-001 will remain @williamr. The proposal will not increase the administrative overhead for Maker token holders. Instead, the division of the existing Core Unit will encourage decentralization, specialization, transparency, accountability, and efficiency.  Specification  Motivation The current RWF-001 Core Unit Facilitator has long-standing relationships with some of the existing and potential MIP6 applicants. Further, the current RWF-001 Facilitator enhances Maker’s geographical diversity with a physical location in the Asia-Pacific. The split will allow RWF-001 to dedicate time to focus on opportunities in the Asia-Pacific region and not be impeded by the transactional demands of RWF-0x and associated transactions. Prospective RWF-0x Core Unit members have, working jointly:  Successfully structured, implemented and onboarded Huntingdon Valley Bank and Société Générale (130MM DAI in RWAs). Through the aforementioned transactions, developed the market standard for how RWAs are ledgered and financed on-chain. Professionalized the onboarding of real-world assets by developing and communicating investment guidelines. Transparently reviewed MIP6 applications and made reasoned recommendations for proposed collateral onboardings (for or against). Collaborated with Centrifuge to scale the Centrifuge offering for Maker through the indentured trust. Enriched the discourse around and long-term framework for how to approach RWAs more holistically. Implemented mechanisms to improve Maker token holder visibility over collateral. Demonstrated a propensity for working with one another synergistically.  As RWAs become increasingly fundamental to the success of the DAO, this reorganization supports the appropriate specialization and decentralization needed to proceed responsibly. The Maker token holders will benefit from a division of the existing Real World Finance core unit into two separate core units for the following reasons:  Separate Core Units will encourage contributors with similar skill sets, commercial approaches, and execution styles to collaborate more effectively, efficiently, and innovatively for the benefit of the Maker token holders. Separate Core Units will provide an opportunity for Maker token holders to measure and evaluate independent performance, as each Core Unit will be responsible for the development, execution, and maintenance of its transactions. Separate Core Units will promote more diverse innovation within and without the Maker ecosystem. Separate Core Units will result in more decentralization, dispersion, and competition with the best approaches and innovations winning out. Separate Core Units do not change or limit the authority of the Maker token holders. Over time, the Maker token holders may elect to devolve more or less authority to the Core Units depending on the Core Unit’s performance. Separate Core Units give potential MIP6 applicants more diverse options. Splitting the current Real-World Finance Core Unit achieves a strategic objective without associated fiscal expansion — a nice double-whammy during a bear market.   Core Unit ID RWF-0x  Core Unit Name RWF-0x  Core Unit Mandate Each of RWF-0x and RWF-001 will be independently responsible for the development, prioritization, and execution of its own generated transactions greenlit by the Maker token holders. RWF-0x and RWF-001 will compete for mandates from potential customers to the Maker protocol. Subsequent to the initial split budget, RWF-0x and RWF-001 may propose their own budgets, incentives, etc. Each of RWF-0x and RWF-001 will continue to interface with other Maker DAO Core Units as necessary to implement transactions. Unless the Maker token holders determine another allocation on existing collateral:  RWF-0x will be responsible for Huntingdon Valley Bank, Société Générale, 6S Capital, and New Silver. RWF-001 will be responsible for Fortunafi, ConsolFreight, and Harbor Trade Credit.  In respect of existing or greenlit MIP6 applications, RWF-001 will be responsible for Robinland and ATD Combustors. RWF-0x will be responsible for Pando (if greenlit). For pre-greenlit MIP6 applications arising after the date of submission of this MIP proposal, MIP6 applicants may choose to interact with either RWF-0x or RWF-001. RWF-0x and RWF-001 will coordinate activities to ensure that other Core Units are not burdened by the split.  Continuity Until RWF-0x is approved and receives its DAI budget within the 2-of-3 multisig, the current Facilitator of RWF-001 will continue to compensate Core Unit members @christiancdpetersen, @teej, and @eumenes as per the agreed upon MKR and DAI obligations. This will enable ongoing processing of the current and future pipeline of proposals. Further, until RWF-0x is approved and receives its budget allocation, @williamr will not make any additional modifications to the RWF-001 budget, included but not limited to returning DAI to the treasury. As such, if RWF-0x is for any reason, not approved, RWF-001 will continue to operate as is, with all obligations to Core Unit members in MKR and DAI being respected.  Monetalis (MIP65) and Liquidity Opportunities During the interim period, @christiancdpetersen will support the implementation of Monetalis MIP65 and other strategic finance initiatives greenlit and/or approved by Maker token holders and be compensated through RWF-001. RWF-0x will assume such amounts as a deduction from its budget when the actual budget split occurs. @christiancdpetersen will maintain detailed time and other records to evidence such amounts. After the formal split into RWF-001 and RWF-0x, @christiancdpetersen will provide support to the Strategic Finance Core Unit (SF-001) on various initiatives brought to the Maker token holders by SF-001. For such work, @christiancdpetersen’s time and any third-party legal expenses will be paid from the RWF-0x budget.   Related Documents  MIP40c3-SP78: RWF-0x Budget Proposal through 2022 MIP41c4-SP39: RWF-0x Core Unit Facilitator  ",
                    "links": [
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-rwa-collateral-onboarding-risk-assessment/15828",
                        "https://forum.makerdao.com/t/sg-forge-socgen-risk-assessment/15638",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219/18",
                        "https://forum.makerdao.com/t/monetalis-mip6-collateral-onboarding-risk-evaluation/13658",
                        "https://forum.makerdao.com/t/what-is-a-trust-indenture-what-is-an-indenture-trustee/14697",
                        "https://forum.makerdao.com/t/a-north-star-dai-as-the-destination/14838",
                        "https://forum.makerdao.com/t/charting-a-path-for-rwas-part-2-the-maker-standard/16725",
                        "https://forum.makerdao.com/t/real-world-finance-decision-making-and-delegated-committee-proposal/15276",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-transaction-documents-on-permaweb/16264",
                        "https://forum.makerdao.com/t/mip40c3-sp-rwf-0x-budget-proposal-through-2022/16968",
                        "https://forum.makerdao.com/t/mip41c4-sp-rwf-0x-core-unit-facilitator-onboarding/16969",
                        "https://forum.makerdao.com/t/mip41c4-sp39-rwf-0x-core-unit-facilitator-onboarding/16969",
                        "https://forum.makerdao.com/t/relay-semanal-02-08-de-agosto-del-2022/17223",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-28-de-julio-03-de-agosto-del-2022/17139",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-12/17264",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/9",
                        "https://forum.makerdao.com/t/governance-and-risk-202-thursday-august-04-at-17-00-utc/16978",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/9",
                        "https://forum.makerdao.com/t/mip40c3-sp78-rwf-0x-budget-proposal-through-2022/16968",
                        "https://forum.makerdao.com/t/mip40c3-sp78-rwf-0x-budget-proposal-through-2022/16968/2",
                        "https://forum.makerdao.com/t/mip41c4-sp39-rwf-0x-core-unit-facilitator-onboarding/16969/2",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-12-traduccion/17270"
                    ],
                    "GPT-summary": "The post is a proposal to split the current Real World Finance Core Unit (RWF-001) into two separate Core Units and allocate the existing RWF-001 personnel and budget between the two separate Core Units. The proposal aims to encourage decentralization, specialization, transparency, accountability, and efficiency. The post also provides details on the responsibilities of each Core Unit and the benefits of the split for Maker token holders. The post does not advertise the proposal, but it explains it in detail and invites constructive criticism and collaboration.",
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.846649409149409
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "1",
                    "time": "03/08/2022-10:41:07",
                    "content": "This is a summary of the potential impact of this proposal, from GovAlpha’s perspective:  This is a valid onboarding proposal under the currently approved governance process. This Core Unit onboarding proposal is composed of:  MIP39c2-SP34: Creating RWF-0x from a Split of RWF-001 MIP40c3-SP78: RWF-0x Budget Proposal through 2022 MIP41c4-SP39: RWF-0x Core Unit Facilitator Onboarding   If the onboarding proposal is ratified, RWF-0x will become a new Core Unit and @christiancdpetersen its Facilitator. The budget proposal would replace the current RWF-001 Core Unit’s budget. If this onboarding passes, 75% of the budget that is currently being allocated to RWF-001 CU, will be transferred from RWF-001 CU to RWF-0x CU. The budget proposal has a breakdown for the RWF-0x CU’s part (75%). RWF-0x commits to submit a budget for 2023 no later than October 12, 2022. There is no breakdown for RWF-001 CU’s portion (25%). This proposal has been assigned High-Impact based on the methodology listed here.  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967",
                        "https://forum.makerdao.com/t/mip40c3-sp78-rwf-0x-budget-proposal-through-2022/16968",
                        "https://forum.makerdao.com/t/mip41c4-sp39-rwf-0x-core-unit-facilitator-onboarding/16969",
                        "https://forum.makerdao.com/t/mip40c3-sp78-rwf-0x-budget-proposal-through-2022/16968",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152",
                        "https://forum.makerdao.com/t/mip40c3-sp78-rwf-0x-budget-proposal-through-2022/16968",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267",
                        "https://forum.makerdao.com/t/weekly-mips-update-101/17392",
                        "https://forum.makerdao.com/t/weekly-mips-update-103/17674",
                        "https://forum.makerdao.com/t/weekly-mips-update-102/17511"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.113636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "0",
                    "time": "03/08/2022-11:11:05",
                    "content": "From what I recall the spin off RWF was going to be North America specific. Is that still the plan?  I don’t see that above but may have missed it as I’m only on my first cup of coffee  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#4",
                    "likes": "10",
                    "time": "03/08/2022-11:16:44",
                    "content": "No. The “North America” proposal was William Remor’s alone. A formal geographic separation is, in my view, unnecessarily restrictive. I have extensive experience in Africa, Asia, Latin America, and Europe … a North America-only designation would arguably restrict my contributions. In my proposal, I want to encourage accountability, decentralization, competition and innovation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/08/2022-11:42:10",
                    "content": "Ok I see. Sounds good! What about LTS, is that incorporated into this or maybe something else? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#6",
                    "likes": "6",
                    "time": "03/08/2022-12:40:04",
                    "content": "My current goal is to bring short-term bonds to MakerDAO so we can get back to profitability. This includes MIP65 and Backed, but also some other opportunities that Strategic Finance, in collaboration with other CUs, is working on. Most of those projects are stalled for a week now due to the current situation (which is brewing for a time as you can expect). Every day we are delayed costs us $50k, every month it is above $1M. The pain is real. @christiancdpetersen is willing to work on MIP65 and other bonds-like SF projects but I would love to have confirmation from @williamr that he is willing to fund those expenses and the workers. Some projects also need the rest of the RWF team to work on and provide another set of eyes. We need to get things done. I also understand that some parties want to have MIP65 done and don’t care about the rest. This is very shortsighted. What we can learn from the ALM forecast is that we need to deliver on investing. The proposed RWF-0x team has a track record on that. Every days our Surplus Buffer is shrinking, reducing our ability to go back to profitability while protecting DAI holders. ",
                    "links": [
                        "https://forum.makerdao.com/t/unblocking-the-stalled-short-term-bonds-revenues-generating-initiatives/17073"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.466666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#7",
                    "likes": "1",
                    "time": "03/08/2022-12:51:21",
                    "content": "This definitely seems like it would increase long term administrative overhead. For now, maybe not much as it’s the same people, but as long as both RWAs are using the same people then you aren’t gaining any of the benefits you listed. The moment we have two truly independent RWA CUs, they are going to start competing with each other for budgets and headcount. They will exert pressure on delegates to divert funding and mediate disputes. They will need to be independently assessed on budget. Also, how do you see this working with the endgame plan? Will these be 2 different metadaos or clustered back into 1 metadao? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8522727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#8",
                    "likes": "6",
                    "time": "03/08/2022-13:54:22",
                    "content": "This is an extremely interesting evolution and, please pass this to me, a clear example of the usefulness of a audit/ oversight core unit like LOVE. By reading the proposal drafted by @christiancdpetersen and especially @SebVentures commentary, it is clear that RWF-001 has had internal dysfunctionalities that have led to this request. As @CodeKnight hints at, with the similar people being involved in RWF-001 under @williamr’s facilitation - namely all CU members, and seeking for spin-off into another core unit, this seems to me a de facto off-boarding of the CU Facilitator with a reduction in budget. Which, in my opinion as an external observer, seems plausible given the above mentioned dysfunctionalities and the fact that the individuals proposing this MIP have been involved in 100% of the workload performed to structure and pass the most recent RWF MIPs. Going back to @CodeKnight’s points, I agree that two independent core units should be:  Mandated independently Staffed and budgeted independently Assessed independently  For this reason, I truly hope that the discussion over this MIP aren’t commingled with the discussions with the performance of @williamr as facilitator of RWF-001. I would also like to understand in detail the gap analysis between RWF-001 mandate and this CU - the result could also be no difference but pure duplication of points of contact. I do not believe that this should cause any concern for an increase in costs, but rather please those who seek decentralisation. Unfortunately, without an third party audit function, there will not be anyone staffed at the DAO level able to review the quality and intensity of the independent yet partially overlapping core units. As part of the closing activities of the Lending Oversight incubation, I have already agreed with @wouter, @Juan, @Retro from SES to publish an audit report of RWF-001 activities. I will do this before the end of the RFC period for this proposal, to provide MKR holders potentially useful information for decision making. Regarding the below on Endgame Plan, I have fundamental questions that I will pose again.     CodeKnight:  Also, how do you see this working with the endgame plan? Will these be 2 different metadaos or clustered back into 1 metadao?    Can anyone truly articulate in a simple manner what MetaDAOs are, and what is their relationship with the existing Core Unit set up? I am not looking for a 50 pages summary Has the Endgame framework received any type of MKR endorsement that justify diverting significant CU resources to studying the transition? I have asked the question already below without any answer     Short take: Exciting news and opportunity for RWA teams   I wonder whether there is any vote that has been passed and gives authority to CU Facilitators to spend time and resources to adapt towards a new framework - in this case the MetaDAO framework which hasn’t been voted on. If I am wrong and missing something I apologise.   To clarify my position, I have had close to no interactions with anyone belonging to RWF-001 following the negative outcome of the LOVE-001 vote, nor I have been involved in drafting this proposal. However, being this consistent with the decentralisation process I had anticipated for important CUs (including RWF), I am now watching this with interest as community member. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.41562829062829
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#9",
                    "likes": "6",
                    "time": "03/08/2022-14:20:44",
                    "content": "    luca_pro:  As part of the closing activities of the Lending Oversight incubation, I have already agreed with @wouter, @Juan, @Retro from SES to publish an audit report of RWF-001 activities.   Hopefully this clarification is unneeded, but SES has been cited in the recent past of incubating “competitors” of current Core Units. Whether competition is good for the DAO seems to be beyond the point, as well as whether the actual incubees are competing for existing resources (should we have more specialized Core Units, or should we have big Core Unit working on several projects). As part of the unwinding of the LOVE incubation program, @luca_pro mentioned the programs he was working on and what he would like to accomplish as the program comes to an end. We didn’t explicitly request the audit. We believe in the independence of other Core Units, and we’ll keep supporting that ethos. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.71590909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#10",
                    "likes": "1",
                    "time": "03/08/2022-14:26:06",
                    "content": "All correct @Juan, apologies if my commentary wasn’t clear enough. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#11",
                    "likes": "0",
                    "time": "03/08/2022-14:50:09",
                    "content": "the DAO probably has grown sufficiently large to begin thinking about an Human Resource (HR) / People Function or at least Part time resource to help navigate this kind of situation. Another solution is to add these responsibilities to another CU, maybe Governance, to step in an perform an assessment of the situation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#12",
                    "likes": "10",
                    "time": "03/08/2022-15:02:47",
                    "content": "My proposal to form RWF-0x results from my conclusion that, after working as a team for nearly a year, myself, @eumenes and @teej can efficiently and effectively (and we have already done) execute on a Real World Asset vision supported by the Maker token holders. Also, we can, as experienced professionals in the traditional finance space, meaningfully and proactively engage with the Maker community to develop a holistic real world asset strategy - meaning communicating ideas and options, debating the same and, after approval, executing a real world asset strategy. I believe that RWAs are core to the protocol’s success and to MKR’s performance as an asset. As such, the DAO should promote core units with The Right Stuff—sometimes hard decisions have to be made in the short-term to protect the long-term. My proposal does not exclude or prohibit a MetaDAO or any other agreed upon approach. I have lost confidence in @williamr’s capacity and engagement in promoting real world assets. Over the last several months, I felt that, time and time again, @williamr set RWF-001 up for long-term failure in the Real World Asset space and with the Maker community. My lack of confidence substantially increased from May onwards, but I did not want to make any changes while we executed the HVB and SG Forge transactions. The details are not important, but it is sufficient to note that, last week, I told @williamr that I resigned from RWF-001 pending finalization of the HVB and SG Forge transactions. To ensure continuity in the RWA program, I (together with @eumenes and @teej) suggested to @williamr that he step down as core facilitator. He did not directly respond to this proposal. He did, however, indirectly respond by proposing that @eumenes and @teej spin out a North America-only core unit. Building upon this idea, we drafted a formal proposal in good faith to split RWF-001 into two core units. We shared this proposal with williamr and suggested it be co-authored, but again, he failed to respond. Several days later, we received a sort of response. This morning, each of myself, @eumenes, and @teej received a termination email. As any professional will probably agree, a lack of execution, lack of engagement, poor communication, and vindictive, non-performance based termination are not the trappings of leadership. To reiterate, my sole objective in the proposal to create RWF-0x is to assist the Maker community to develop, debate, and implement a long-term strategy for the on-boarding of real world assets. Maker has an enviable lead in the Real World Asset space and it will require dedication, finance experience, and proactive engagement to maximize the potential for merging Real World Assets with crypto and improve upon the existing financing structure. I have always indicated that I work for the benefit of the Maker token holders. I expect the Maker token holders to hold me accountable for professionalism, proactive engagement, and execution. ",
                    "links": [
                        "https://forum.makerdao.com/t/short-take-exciting-news-and-opportunity-for-rwa-teams/16849",
                        "https://forum.makerdao.com/t/a-message-to-maker-cp-eric-and-teej/17153",
                        "https://forum.makerdao.com/t/unblocking-the-stalled-short-term-bonds-revenues-generating-initiatives/17073",
                        "https://forum.makerdao.com/t/my-response-to-unacceptable-behaviour/17028",
                        "https://forum.makerdao.com/t/governance-and-risk-202-thursday-august-04-at-17-00-utc/16978/2"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.420975056689342
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#13",
                    "likes": "1",
                    "time": "03/08/2022-15:06:59",
                    "content": "    luca_pro:   Can anyone truly articulate in a simple manner what MetaDAOs are, and what is their relationship with the existing Core Unit set up? I am not looking for a 50 pages summary Has the Endgame framework received any type of MKR endorsement that justify diverting significant CU resources to studying the transition? I have asked the question already below without any answer      MetaDAOs are subsidiaries of the DAO, with more flexibility in structure and tokenomics designed to align incentives.   It received endorsement from Rune, who holds quite a bit of MKR. If CUs want to maintain the status quo, they are free to keep their heads down and ignore it. If they want to implement long-term organization changes like this, then they will need to study how those align with other plans to change the organization.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.828703703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#14",
                    "likes": "1",
                    "time": "03/08/2022-15:22:47",
                    "content": "Thank you, I personally find both answers unsatisfactory - but it is a personal opinion:  This means simply that we don’t have yet enough substance to judge what a DAO will be Either or: (a) Rune is recognised super-majority controller of the organisation that therefore is not a DAO and should be treated as such, or (b) Rune is a powerful yet not controlling holder of MKRs and therefore any significant shift in structure and strategy should be voted on-chain by the whole DAO community  Again, I am simply speaking my mind up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#15",
                    "likes": "2",
                    "time": "03/08/2022-15:28:21",
                    "content": "  That is fair.   As I said, CUs are free to stick to their mandate and ignore the politics. If they want to initiate their own organizational changes though, then they should consider how it will interact with other possible organizational changes.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.574999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#16",
                    "likes": "1",
                    "time": "03/08/2022-15:28:33",
                    "content": "    christiancdpetersen:  Several days later, we received a sort of response. This morning, each of myself, @eumenes, and @teej received a termination email.   This is deeply concerning. Is the CU set up as a legal entity? What is the contractual basis or terms under which you were purported to be “terminated”?     SebVentures:  Most of those projects are stalled for a week now due to the current situation (which is brewing for a time as you can expect).   What is the current situation you are referring to above @SebVentures ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.319444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#17",
                    "likes": "3",
                    "time": "03/08/2022-15:38:27",
                    "content": "There is no way that the appropriate response to CU personnel being fired after asking their boss to resign is for the DAO to give them a competing CU. Some level of healthy competition is good, but this sounds incredibly toxic. If you believe @williamr “set RWF-001 up for long-term failure” (and I am not saying he has or hasn’t), then a proposal to replace him seems far more suitable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.678571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#18",
                    "likes": "2",
                    "time": "03/08/2022-15:52:49",
                    "content": "@CodeKnight - Thank you for these questions.   For the remainder of 2022, the budget remains essentially the same (subject to my proposed reductions for legal spend). I have offered to support Monetalis (Clydesdale) MIP65 and @strat-fin-core-unit with the same budgeted dollars (more output and less aggregate cost). Of course, RWA-0x will be subject to the regular budgetary process for 2023. I expect Maker token holders to question and challenge any budgetary assumptions for RWF-0x.   Maker token holders should hold me accountable for work promised to be done and work done. I am about execution. That is why I have decided to make this proposal.   Competing, decentralized core units should increase the potential pie and rewards to Maker (not restrict it). Maker token holders should expect performance. If a core unit or member fails to perform, then budgets can be reduced and Core Units eliminated. Core units are, after all, servants to the Maker token holders.   In terms of “disputes”, I would argue that competing, decentralized core units minimize disputes and eliminate fears of “gate keeping” etc. A MIP6 applicant can “always go across the street”. This competition will force the core units to consider the Maker token holders and the customer.   Competition between two (or more) RWFs will give MKR holders more insight into each RWF as they can compare performance across each RWF, noting strengths and weaknesses.   In terms of MetaDAOs, nothing in this proposal excludes or prohibits MetaDAOs. In fact, competing teams might serve as an experimental petri-dish for the MetaDAO concept.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#19",
                    "likes": "0",
                    "time": "03/08/2022-15:53:10",
                    "content": "Totally agree - An offboarding proposal (facilitator) given the above explanation seems more reasonable. Also how can a CU member be fired without an offboarding. Thats possible? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#20",
                    "likes": "6",
                    "time": "03/08/2022-15:57:01",
                    "content": "Someone correct me if I am wrong, but CU facilitators are the only ones proscribed by the MIP. Facilitators are responsible for hiring people and are free to set up their own agreements with their employees. They don’t need DAO permission to hire or fire someone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#21",
                    "likes": "4",
                    "time": "03/08/2022-16:12:38",
                    "content": "Interesting, thanks for sharing. So the only way to fire/replace a facilator would be via another MIP which we would only know of any rationale if other CU members share insights or if KPIs are down (not possible at the moment). @christiancdpetersen seems you have support from the other CU members and if you are convinced that William will lead the CU to fail why not propose an offboarding or a replacement (Internally or externally) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.897222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#22",
                    "likes": "0",
                    "time": "03/08/2022-16:36:50",
                    "content": "Writing as a community member, not ISCU     christiancdpetersen:  RWF-0x   I assume this will be updated to the name RWF-002 or is there some other choice? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#23",
                    "likes": "0",
                    "time": "03/08/2022-16:51:40",
                    "content": "This is unfortunate to read. I hope all good faith efforts continue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#24",
                    "likes": "4",
                    "time": "03/08/2022-17:05:09",
                    "content": "The preference is RWF-0x … to blend real world assets and the prefix for ETH addresses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#25",
                    "likes": "0",
                    "time": "03/08/2022-17:07:50",
                    "content": "I like the 0x, seems like a perfect fit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#26",
                    "likes": "6",
                    "time": "03/08/2022-17:32:04",
                    "content": "we are also hard working Oxen! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.177083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#27",
                    "likes": "7",
                    "time": "03/08/2022-18:24:49",
                    "content": "Creating a competing RWF CU is not the way to handle this soap opera. The DAO needs to figure out a process for resolving human drama that takes place within a CU. In the meantime, rather than create another RWF CU, we should consider freezing the existing RWF CU (and all RWF activity) until it can functionally operate again. We can’t just have 8 RWF CUs, 4 Growth CUs, 5 PE CUs… etc… just because people can’t get along (always happens in every organization) and the DAO doesn’t have any process for handling that. This should be the top discussion topic on tomorrow’s GnR call. It’s critical. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#28",
                    "likes": "0",
                    "time": "03/08/2022-18:50:40",
                    "content": "    christiancdpetersen:  To ensure continuity in the RWA program, I (together with @eumenes and @teej) suggested to @williamr that he step down as core facilitator. He did not directly respond to this proposal. He did, however, indirectly respond by proposing that @eumenes and @teej spin out a North America-only core unit . Building upon this idea, we drafted a formal proposal in good faith to split RWF-001 into two core units. We shared this proposal with williamr and suggested it be co-authored, but again, he failed to respond.   From my point of view, I find the proposal very interesting, however I do not like the way it wants to be executed, from the accusation, whether true or not, that Williams does not work efficiently, to creating an unhealthy division between RWA . If we think in the future, to divide some CUs in a healthy and enjoyable way, this would be the best way to face the feeling of workers in some CUs, but with this conclusion they are probably placing a versus between both RWAs instead of emphasizing, lightening and at some point exchange ideas between CU. I wouldn’t mind if RWA sw would split even by continents, but if it would split thanks to a necessary conclusion to make jobs easier and not because a worker or some workers don’t work well. So if the new RWA does not have such a high labor morale, will we repeat the same procedure? Shall we blame a member and divide again? My point of view is, I love the idea of ​​geo-zoning but not doing it this way, due to a “cu-mate deficiency” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.91645202020202
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#29",
                    "likes": "0",
                    "time": "03/08/2022-19:33:28",
                    "content": "While I will have to understand the full background beyond what’s written here especially as @williamr haven’t written a response or stance here, I think we need to walk a fine line here. On one end, you have competition and specialization, but do we really want to make CUs redundant? If the concern is the current issue is it’s not efficient or effective enough, the Maker governance should pick the part that is working instead of sinking funds into parts that don’t work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.854166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#30",
                    "likes": "3",
                    "time": "03/08/2022-19:54:30",
                    "content": "Did William agree to your CU taking 75% of his CUs  budget? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#31",
                    "likes": "4",
                    "time": "03/08/2022-19:57:03",
                    "content": "    Doo_StableLab:  On one end, you have competition and specialization, but do we really want to make CUs redundant?   In my view the answer is a clear “yes”. While fostering competition can have some positive effects, I think the main argument lies in protocol safety. The link between CUs and the protocol is tenuous and if a critical CU decides to move on or becomes dysfunctional the survival of the protocol will be in danger. Being a DAO gives up efficiency for redundancy, we should embrace that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.411616161616162
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#32",
                    "likes": "1",
                    "time": "03/08/2022-20:41:43",
                    "content": "Using the same logic, the survival of the protocol will be in danger if there are many duplicate and redundant CUs and taking away needed resources. And as the protocol literally can’t pay its contributers, CUs will be offboarded or fall off. It’s not a case I look forward to. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MightyOx",
                    "index": "#33",
                    "likes": "1",
                    "time": "03/08/2022-21:15:24",
                    "content": "    Eumenes:  we are also hard working Oxen!   I hear that!     christiancdpetersen:  This morning, each of myself, @eumenes, and @teej received a termination email.   That is an unfortunate surprise to wake up to. However, wouldn’t this have to go through some offboarding vote, if I’m not mistaken? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 2.610677083333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#34",
                    "likes": "1",
                    "time": "03/08/2022-21:41:56",
                    "content": "    MightyOx:  That is an unfortunate surprise to wake up to. However, wouldn’t this have to go through some offboarding vote, if I’m not mistaken?   You don’t need onchain voting to offboard contributors. Onchain voting applies to facilitators and CUs themselves ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#35",
                    "likes": "1",
                    "time": "03/08/2022-22:06:17",
                    "content": "    MightyOx:  That is an unfortunate surprise to wake up to. However, wouldn’t this have to go through some offboarding vote, if I’m not mistaken?   To support @Doo_StableLab’s comment, my position was always as an independent contractor and terminable at will. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#36",
                    "likes": "11",
                    "time": "04/08/2022-00:50:48",
                    "content": "    ChrisBlec:  In the meantime, rather than create another RWF CU, we should consider freezing the existing RWF CU (and all RWF activity) until it can functionally operate again.   @ChrisBlec Using your comment to direct my response to the community. Onboarding and managing collateral is cross-CU process that is not solely dependent upon a single Core Unit. First, there is a well-documented process and many collateral applications have a fair amount of work already completed once they are posted on the forum.  We also have collateral stakeholders and domain teams that have a variety of responsibilities within this process. To freeze work due to internal conflicts would be an overreaction to something that can be adequately managed. Where there are dependencies and gaps, the collateral stakeholders identify them and work to resolve the issues. I’m asking everyone not to conflate a conflict or change in strategy with the actual work that is being completed as listed on the CSI. We are working with @williamr and the ex-RWF team members to ensure a smooth transition and business continuity. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit?pli=1#gid=1077340672"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.043452380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#37",
                    "likes": "7",
                    "time": "04/08/2022-00:56:44",
                    "content": "Many (maybe all) core units hire people as contributors (contractors). Each core unit facilitator defines their own policies as to how they interact with their contributors. A voting process to oversee the contributor agreements would be quite cumbersome and restrict the facilitator’s ability to run their core unit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#38",
                    "likes": "1",
                    "time": "04/08/2022-14:21:45",
                    "content": "My vote would be for an offboarding or a replacement MIP rather than multiple CUs ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rob",
                    "index": "#39",
                    "likes": "0",
                    "time": "04/08/2022-14:44:22",
                    "content": "Is it possible to just budget for this core unit, without trying to lower the other core unit budget? Maybe they’ll hire replacements at the original ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#40",
                    "likes": "1",
                    "time": "04/08/2022-14:51:54",
                    "content": "The short answer is “no”. We are currently in a process to reduce budgets so increased spending should be very carefully scrutinized. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.783333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#41",
                    "likes": "0",
                    "time": "04/08/2022-20:09:33",
                    "content": "It should be noted that this proposal would lower the current RWF-001 budget (i.e. new 001 vs 0x would be less than the current 001). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.962121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#42",
                    "likes": "0",
                    "time": "04/08/2022-20:26:40",
                    "content": "Isn’t combined budget still the same as before ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#43",
                    "likes": "0",
                    "time": "04/08/2022-20:31:20",
                    "content": "For clarity on the proposed budget through year-end 2022, the proposal is to split the existing budget spend on a 75:25 basis. From that RWF-0x reduced its anticipated legal fees for the remainder of 2022. Any 2023 budget will be wholly dependent on each prospective core unit, its proposal, budget assumptions, and the decision of the Maker token holders. Again, the RWF-0x proposal seeks to promote decentralization and competition. This includes in preparing the 2023 budget process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#44",
                    "likes": "0",
                    "time": "25/08/2022-18:28:26",
                    "content": "Reminder that this proposal will enter its Frozen Period in one week, on Thursday September 1st at 00:00UTC. Substantive modifications beyond that time will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-204-thursday-august-19-at-17-00-utc/17318",
                        "https://forum.makerdao.com/t/governance-and-risk-205-thursday-august-25-at-17-00-utc/17437"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#45",
                    "likes": "2",
                    "time": "26/08/2022-20:38:37",
                    "content": "@Gala - Please keep the proposal for RWF-0x in RFC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#46",
                    "likes": "1",
                    "time": "26/08/2022-21:32:51",
                    "content": "@psychonaut In the same wave as the other post, this part here also should be removed or adjusted:     christiancdpetersen:  Continuity Until RWF-0x is approved and receives its DAI budget within the 2-of-3 multisig, the current Facilitator of RWF-001 will continue to compensate Core Unit members @christiancdpetersen, @teej, and @eumenes as per the agreed upon MKR and DAI obligations. This will enable ongoing processing of the current and future pipeline of proposals. Further, until RWF-0x is approved and receives its budget allocation, @williamr will not make any additional modifications to the RWF-001 budget, included but not limited to returning DAI to the treasury. As such, if RWF-0x is for any reason, not approved, RWF-001 will continue to operate as is, with all obligations to Core Unit members in MKR and DAI being respected.   Same reasoning. Why would RWF-001 continue to have DAI payment obligations beyond termination dates? For what services, supervised by whom? RWF-001 is no longer supervising the activities of former contractors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.955357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#47",
                    "likes": "0",
                    "time": "26/08/2022-21:56:37",
                    "content": "This proposal will be kept under RFC until further notice from the author. —- ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/squid",
                    "index": "#48",
                    "likes": "2",
                    "time": "27/08/2022-17:00:13",
                    "content": "What a total shitshow. While we should be offloading USDC into real world assets, governance is instead trying to sort out internal CU politics and drama. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#49",
                    "likes": "1",
                    "time": "15/10/2022-13:04:28",
                    "content": "@Gala - I am permanently withdrawing this proposal for MIP39c2-SP34. You can remove from RFC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#50",
                    "likes": "0",
                    "time": "20/10/2022-14:32:32",
                    "content": "So currently RWF-001 is being offboarded and the only person left is Williamr? For this split to be justified, please highlight what is the scope for 001 and 0x. and also what leads are being open and a timeline for completion. to not drag out the offboarding? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#51",
                    "likes": "0",
                    "time": "20/10/2022-15:48:53",
                    "content": "The proposal for RWF-0x was withdrawn. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}