{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposal-maker3-0-the-future-of-crypto-lending-rfc/14374",
            "title": "Proposal: Maker3.0 - The future of crypto lending. (RFC) ",
            "index": 14374,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "11",
                    "time": "01/04/2022-15:18:37",
                    "content": " Maker3.0 - The future of crypto lending 1T DAI3 is just 1 Maker upgrade away NOTE:  Some terminology clarification Maker1.0 is SCD and SAI, Maker2.0 is MCD and DAI. An aggressive growth proposal for Maker.   Maker3.0 - Start fresh - utilize all available information, good and bad to create a new, more competitive, better Maker.  Part of why Maker3.0 is good is the promise of taking everything we now know in DeFI and applying it to the next incarnation of Maker and DAI3. a) Maker doesn’t have to risk MKR or existing code to beging to design Maker3.0 b) Easier to look at a new design than to make risky changes to existing design reducing change inertia resistance.  (governance in particular) c) Maker3.0 could be complementary to Maker2.0 both from ability to use MKR and/or MKR-DAI LP to borrow DAI3  from Maker3.0, or MKR3 and/or MKR3-DAI LP to borrow DAI from Maker2.0.   This allows for greater financial flexibility.   Create a MKR3 token with 1T issued and a)  fund an AMM LP (such as uniswap v2) MKR3DAI with 5M DAI and 5M MKR3 launching a 1T value MKR3 token out of the gate backed with 5M MKR3 in circulation paired with 5M DAI.  This starts MKR3 off with 100% circulation in LP the only way anyone gets any is to buy it from the LP. Initially, without additional issuance, the price can only go up from $1! PR from this event would likely be significant. Need to capitalize on this with a few other initiatives announced shortly after the initial Maker3.0 announcement.  b)  Commit to a tight issuance policy of MKR3 in such a way that at least 1/3-1/2 of all circulating MKR3 is paired with DAI into the LP.  Utilizing DAO owned LP towards building stable value and keeping high % of circulating MKR3 in LP. c)  Create a MKR3DAI v2 vault on Maker2.0 with low SF.  Use this vault with 130% LR, and low .5% SF, to borrow 5M DAI to pay SB back. This will encourage others to buy MKR3 pair with DAI so they can borrow more DAI. Reward this vault with MKR3 or MKR3DAI LP.  The financials both on the LP and the vaults can be designed so the collateral value could never drop below the DAI borrow.  This means in combination with DAO LP management and vault LR the risk of losing money on these vaults can be managed to be identically 0  The oracle price IS identically the AMM LP as this defines the market price and liquidity depth making oracle management trivial and cheap.   d)  Use MKR3 as a rewards token to help supercharge TVL in vaults on Maker2.0 (starting with TOKEN-DAI v2 LP vaults we already have such as ETH-DAI). e)  Use new DAI earned by Maker2.0 from the increased TVL in the MKR3 rewarded vaults to be slated to build MKR3-DAI owned LP. f)   Solicit for MKR3 sales to VCs to raise capital for what will become the Maker2.0 and Maker3.0 secondary loss backstop and/or treasury proper.  MKR3 and MKR3DAI LP (via using our own MKR3DAI v2 vault to borrow DAI) becomes the collateral to create a new surplus buffer via borrowing/sales. Sales to VC of MKR3DAI LP can have a vesting component to time lock MKR3 in the LP. Bonus here is all MKR3DAI LP earns return based on the AMM trading fees.  So finally VCs actually earn return here by holding MKR3DAI LP.  g)   Create and fund a unit to tasked with managing MKR3 markets, liquidity, price, and rewards flow. h)   Create and fund a unit to begin work on vision and design for Maker3.0 i)   Use MKR3DAI LP to do token swaps with other communities that support the creation and use of TOKEN-DAI v2 vaults. Examples: Gnosis, Nexo, Polygon - all of these communities have significant token exposures and trading.   The idea of these communities locking up GNODAI, NEXODAI, MATICDAI v2 LP to borrow DAI could be a significant way to grow DAI in Maker2.0 using Maker3.0 (MKR3 Token). This is a win-win-win for all players and allows for treasury assets that can both make market and borrow DAI for all these players in Maker2.0.  This allows these communities to earn MKR3 or MKR3DAI LP as well and become stakeholders in the new Maker3.0   State that MKR3DAI LP will be the backbone of governance in Maker3.0 NOT MKR3. a)   MKR3 alone, while useful, is not as useful as MKR3 paired with DAI in the AMM LP.   Put simply, having liquidity for trading should not compete with governance but should accentuate it. b)   Using MKR3DAI LP as compensation for work, for governance, and potentially for rewards in Maker3.0.  That LP will be the new money not  tokens.   We can consider doing rewards with MKR3DAI LP in Maker2.0 but should do this with care to preserve a number of key propoerties of the LP. c)   That in Maker2.0 the emphasis with rewards will be on vaults with tokens that both earn return (like staked ETH) but also vaults paired with DAI will earn a preferential return. d)   Use the promise of potential and the unit of currency for Maker3.0 (MKR3DAI LP) and a new focus on TokenDAI AMM LP as the focus for growing Maker2.0 while designing Maker3.0   The above forms the core principles of what I see for Maker3.0  Ability to be freed from anything in Maker2.0 when designing Maker3.0 and use everything learned by competitors when designing Maker3.0.  Maker3.0 can and should be a quantum leap in technology, design, and scale of finance.  $1T and beyond is the goal. Ability to use the financial component from Maker3.0 to supercharge Maker2.0 growth and revenues NOW (i.e. MKR3 and/or MKR3DAI LP token via rewards) to help grow Maker2.0. Ability to refocus Maker2.0 towards being cost efficient and growing in a sustainable way vs. trying to shoehorn aggressive growth into Maker2.0. A renewed focus on AMM Token-DAI vaults in Maker2.0 (since these lock away DAI and help create Token value for the various communities.   Uni v2 TOKENDAI vault volatility goes as sqrt(TOKEN) value and has price bottom and top caps related to DAO owned LP value.)   This can and should be a core component of future Maker growth both in Maker2.0 and for Maker3.0 as well as for crypto in general imho.  MakerDAO, with the ideal stablecoin, DAI and DAI3, serves as the stablecoin backbone for all other crypto. MKR3.0 value gives MakerDAO a means to raise cash while not diluting Maker2.0 MKR or affect Maker2.0 governance.  The cash raise here via MKR3 or MKR3DAI LP sales to VCs or in ICOs could be loaned to Maker2.0 as a backup buffer in exchange for return, which will help create a larger backup buffer for Maker3.0, or used to further build the MKR3DAI LP, allowing more collateral to borrow DAI. The idea of 2 versions of DAI, while not appealing, may actually be useful in that DAI3 could have significantly different properties than DAI (including what DAI3 is pegged to and how the PEG is managed). Having funds and funding from two different systems may actually be better than having one, as it can allow for greater flexibility in funding, governance and financial management.   It may be that with Maker3.0 promise, we might be able to grow Maker2.0 so that when we finally bring Maker3.0 online, these could act as complementary Maker products and not be competitive.  Discussion: I see no downside to the above, since all Maker is doing is creating another crypto token with value.  In fact doing the above overnight will increase the total TVL in crypto by 1T or 33%.   This would be a huge PR/news event by itself.  We do the drop of 5M of the MKR3 token via LP, not to any single wallet but directly in a market.  If you want to be part of MKR3 well then you need to pony up some DAI.  If you want to borrow against MKR3 at least on Maker you need to pair it with DAI in the LP to borrow.  BUT if you do you will earn rewards.  There will a temptation to airdrop MKR3 to MKR holders.   MakerDAO needs to look at MKR3 as the fully new Maker and to distribute MKR3 to those who are willing to pair MKR3 with DAI.  I believe the value to Maker and MKR holders here is to hold on to MKR3 and distribute it preferentially to people who pair their TOKENS with DAI to provide liquidity and token value via the AMMs.   This is the future for Maker AMM TOKEN-DAI and Maker3.0 via MKR3 and MKR3DAI LP and Maker2.0/MKR will benefit directly and indirectly from this completely new tokenomic vision. Maker itself loses nothing.  We isolate the revenues from the MKR3DAI v2 LP as well as increase in revenues from all the TOKENDAI v2 vaults and funnel the DAI to the CU slated to perform functions of (2g).  Maker2.0 gets another tool which is a form of rewards that is completely decoupled from MKR, significant PR, and the ability to focus significant change on creating a new Maker3.0 while working to efficiently manage and grow Maker2.0.  Maker gets the ability to build a secondary surplus and possibly a treasury using the $1T Market cap MKR3 token and MKR3DAI LP. While some work would need to be done, I believe the above to be the simplest and easiest approach to supercharge Maker2.0 growth and lead to the step change needed for Maker which is Maker3.0.  Maker3.0 allows for the greatest flexibility to design and implement a new Maker while giving significant benefits to Maker2.0 with the least cost.  In the end we can see straight away if the buy and burn model for MKR and Maker2.0 is better than the pair MKR3 with DAI in LP from a tokenomics and governance perspective. What would need to be done from a governance perspective.  Commit to the Maker3.0 initiative and Mint 1T MKR3 tokens. Create and fund the MKR3-DAI v2 LP Create the MCD MKR3-DAI v2 LP vault Create and implement a rewards model using MKR3 or MKR3DAI LP for all Maker2.0 Uni v2 Token-DAI vaults Create unit to manage MKR3 liquidity, rewards, markets, etc. (2g) Create unit to begin work designing Maker3.0 (2h)  MakerMan ",
                    "links": [
                        "https://forum.makerdao.com/t/the-real-legal-risks/17207/15",
                        "https://forum.makerdao.com/t/mip84-activate-protocol-owned-vault-emulation/17713/70",
                        "https://forum.makerdao.com/t/the-endgame-party-delegate-signup/15852/15",
                        "https://forum.makerdao.com/t/uni-v2-dai-yfi-mip6-collateral-onboarding-application/5606/15",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-31-april-6-2022/14502",
                        "https://forum.makerdao.com/t/financial-report-2022-07/17194/2"
                    ],
                    "GPT-summary": "The post is a proposal for Maker3.0, which aims to create a new, more competitive, and better Maker. The proposal suggests creating a new token, MKR3, and utilizing it to supercharge Maker2.0 growth and revenues. The post also suggests creating a unit to manage MKR3 liquidity, rewards, markets, etc., and another unit to begin work designing Maker3.0. The post does not receive entirely positive feedback, but some constructive criticism and questions are raised. The post also extends to the proposal by suggesting collaborations with other communities.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.6177287581699344
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zerocool",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/04/2022-16:26:05",
                    "content": "I read this twice but can’t really see what you’re proposing to actually do. I’m bearish on doing something if within the top 3 reasons for it are “PR”. I don’t think the MKR holders would vote to do this if they aren’t the ones that get control over the MKR3 tokens, but I might again be understanding this incorrectly. I don’t see the MCD system as broken, though I would like to hear from people who do see it that way. Any comment about how Maker isn’t popular enough or the Maker token isn’t pumped enough is not really interesting to me. It’s important to remember the game that you are playing, even if the game that people around you are playing (loudly) is different. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/04/2022-16:29:50",
                    "content": "The action points are laid out:     MakerMan:  What would need to be done from a governance perspective.  Commit to the Maker3.0 initiative and Mint 1T MKR3 tokens. Create and fund the MKR3-DAI v2 LP Create the MCD MKR3-DAI v2 LP vault Create and implement a rewards model using MKR3 or MKR3DAI LP for all Maker2.0 Uni v2 Token-DAI vaults Create unit to manage MKR3 liquidity, rewards, markets, etc. (h) Create unit to begin work designing Maker3.0        zerocool:  I don’t think the MKR holders would vote to do this if they aren’t the ones that get control over the MKR3 tokens, but I might again be understanding this incorrectly.   MKR and Maker2.0 governance/CUs at least until Maker3.0 design is completed is in complete control all of the MKR3 tokens and MKR3DAI LP as well as the design/implementation. When and how MKR3 or MKR3DAI v2 LP holders are included in this process is one of the great many topics that would go into the Maker3.0 design process. Here are a few problems this proposal addresses.  General Maker capitalization and liquidity (i.e. ability to fund raise to build a bigger surplus buffer, a secondary surplus buffer and/or treasury proper) not diluting MKR Maker2.0 inertia against significant change. Growth of Maker2.0 MCD until Maker3.0 comes online. (diminishing competitiveness of Maker2.0 relative to other players in DeFI).  Ultimately there is no reason Maker2.0 and Maker3.0 can’t co-exist as DAI and DAI3 may have different properties. I believe the above 6 action points address and potentially solve the above 4 problems. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.289473684210526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zerocool",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/04/2022-17:03:05",
                    "content": "    MakerMan:  Create unit to begin work designing Maker3.0   Wouldn’t it make sense then to start with #6? You are proposing to create a new token, create a pair for this token, incentivize demand for the pair through “utility”, then use the funds, in addition to raising more funds…to green field redesign Maker, not tied to existing mechanisms. Really feels like putting the cart before the horse here, why shouldn’t we take our existing resources and use them to further grow the 10 billion dollar product that we already have? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.636363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "0",
                    "time": "01/04/2022-17:21:04",
                    "content": "You assume that the markets need utility to determine Token pricing and valuation.   There are many examples of tokens that got huge valuations just on speculative value that (and in this part you are correct) in time needed to create a utility component to sustain a longer term value. I assert speculative value can come before utility and contend that utility does NOT need to come first.  In fact the actual utility being specified could ruin a speculative valuation or support a sustainable valuation.   I will also point out that by putting MKR3 paired with DAI in a v2 LP (and even utilizing v3 LPs on top of these) and controlling MKR3 issuance Maker can completely set the price and manage the market of MKR3 value using 2b above (notice 100% of the circulating MKR3 will start in the MakerDAO owned LP). The order of these 6 actionable items aren’t that important.  The whole point of doing (1-3) first is to provide a base level value that can be utilized to fund 5-6 as well as other things.  The real point here is to put out the idea of Maker3.0 (as a speculation the markets can choose to buy or ignore), back it with some Maker2.0 value (DAI from SB paired with MKR3 in MKR3DAI v2 LP) and then get to work on managing the MKR3 value created as well as begin designing Maker3.0. Implementation of (4) into Maker2.0 is something that should help Maker2.0 growth as well as provide a DAI revenue stream to MKR3 (i.e. say 50% of  the added Maker2.0 TVL revenues potentially being slated to (h) and diverted into buying MKR3 to pair with DAI in the Uni v2 MKR3DAI LP.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#6",
                    "likes": "2",
                    "time": "01/04/2022-22:43:41",
                    "content": "I had to read this a couple of time to grasp it fully. Now that I understand it, I’m impressed. Reminds me of when I first read the Bitcoin, and later Ethereum white papers. I am not a Bitcoin maximalist or an Ethereum maximalist, but after reading this proposal I am without any doubt an MKR3 maximalist. My only criticism @MakerMan is that you should have delayed revealing this plan by one day. I am concerned it may not be taken seriously by some people because you posted on April 1st. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.763888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/04/2022-01:10:14",
                    "content": "Sometimes the best delivery is joking a meme into existence @Spidomo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                }
            ]
        }
    ]
}