{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-weekly-update-jan-22-2022-psm-busd-we-want-your-opinion/12784",
            "title": "Growth CU weekly update: Jan 22 2022. PSM BUSD? we want your opinion ",
            "index": 12784,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "2",
                    "time": "22/01/2022-19:39:49",
                    "content": " General Updates  Institutional Vaults. Last week we announced Nexo’s IV would be live in February after PECU finishes the audits. That means Nexo will have four months of fixed SF starting as soon the executive passes for a DC of 1.5B DAI with ETH and wBTC as collateral. Currently, we have four institutions interested in having their IV. Still, as mentioned before, this is a long process as we have to educate their team about different aspects of the protocol: oracles, liquidations, risks, and legal/compliance.  PSM The paxos team will support DAI in April (later than they stated in their psm mip, q1 22). Paxos team will post this update in the forum thread to keep them accountable on delivery w the community.  1600×102 44.4 KB  One of the GUSD OTC had problems accessing the PSM as it doesn’t have a UI. Members of the community are working on it. They have the codebase ready and are testing it with GUSD. Meanwhile, @zxMori  worked with them to explain how to use it, and they started using it and will reach 10m shortly.  1600×99 34.1 KB                          *** We want your opinion ***  BUSD: We are in conversations with the Binance team on an agreement to propose the integration of BUSD in the PSM. We have been exploring various ideas (such as integrating Dai in their futures market), but any integration seems impossible, although they are open to doing something related to marketing with us. We want to hear your thoughts about it: Do we want BUSD in the PSM? What integrations do you want to see with Binance? What do you think could be good for Maker if we launch a marketing campaign with them?   Star-s- of the week   Did you see the Maker Starship? OSL listed DAI into their services. OSL is one of the biggest exchanges/OTC in Latam. With the listing, they created a New Coins Promotion where they are giving rewards for new clients. Lirium, a B2B solution that helps companies with the crypto integration added DAI and can give support in many Blockchains, with their API, traditional Fintech will be able to accept crypto natively on their apps. Dai in Tokocrypto: https://twitter.com/Tokocrypto/status/1484045721209020417?s=20  Tweet of the week   twitter.com    MakerDAO Growth @MakerGrowth  ✍️ Story time.  It's December 2021. A mysterious anon sent 10 million Dai to the 0x00 address on @optimismPBC by mistake. He was about to lose them forever.  Is there a solution for this catastrophe? Let's see 👇 https://t.co/Jv6EEJjisu   6:39 PM - 21 Jan 2022           120                34            ",
                    "links": [
                        "https://twitter.com/Nifty_Island/status/1482056005781540864?s=20",
                        "https://www.americas.osl.com/oslamnewcoinspromotion?_ga=2.265256328.663427488.1642172417-238381519.1642009964",
                        "https://www.lirium.com/",
                        "https://twitter.com/Tokocrypto/status/1484045721209020417?s=20",
                        "https://twitter.com/MakerGrowth/status/1484596410628689927",
                        "https://twitter.com/MakerGrowth/status/1484596410628689927",
                        "https://twitter.com/MakerGrowth/status/1484596410628689927",
                        "https://twitter.com/optimismPBC",
                        "https://t.co/Jv6EEJjisu",
                        "https://twitter.com/MakerGrowth/status/1484596410628689927",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.415088383838383
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "22/01/2022-20:14:29",
                    "content": "Clearly, if it seems important to me to have BUSD listed on the PSM, the importance that BUSD presents for its ecosystem in BSC and relevance of Binance worldwide is important. But what kind of futures markets will we have BTC/DAI, ETH/DAI BUSD/DAI? It would be interesting the latter, as it could give interest to large institutional investors to open side and side positions, generating great arbitrage opportunities. When the DAGs were active and the inclusion of DAI in the Binance P2P started, which was a campaign that I participated in, there was no doubt of great interest from Binance users for it, therefore a good campaign from both sides would be an excellent idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.06959706959707
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/04/2022-20:14:58",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}