{
    "poll_list": [
        {
            "title": "Inclusion Poll for MIP13c3-SP2 - Declaration of Intent - Dai Flash Mint Module - September 14, 2020",
            "index": "3635",
            "option": "Yes",
            "supporting_mkr": "3,871",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip13c3-sp2-declaration-of-intent-dai-flash-mint-module/3635",
            "title": "MIP13c3-SP2: Declaration of Intent - Dai Flash Mint Module ",
            "index": 3635,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "flash-mint",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "15",
                    "time": "11/08/2020-13:41:47",
                    "content": " MIP13c3-SP2: Declaration of Intent - Dai Flash Mint Module  Preamble MIP13c3-SP#: 2 Author(s): Sam MacPherson (@hexonaut) Contributors: n/a Status: Accepted Date Proposed: 2020-08-11 Date Ratified: <yyyy-mm-dd> --- Declaration Statement: Add support for flash-minting Dai. Declaration to Replace: n/a   Specification  Context and Motivation Flash mints allow anyone to mint as much Dai as they need with the one condition that they pay it all back in the same transaction with a fee. This allows anyone to exploit arbitrage opportunities in the DeFi space without having to commit upfront capital. A flash mint module will provide the following benefits:  Improves market efficiencies for Dai. Democratization of arbitrage - anyone can participate. Exploits requiring a large amount of capital will be found quicker which makes the DeFi space safer overall. Fees provide an income source for the protocol.   Declaration Detail MakerDAO Governance requests a Dai Flash Mint module be built and integrated with the Maker system. This module should include both an optional fee parameter as well as an optional debt ceiling which MakerDAO Governance can adjust after deployment via executive vote. This implementation is flexible beyond the core criteria of adding a Flash Mint Module with an optional fee and debt ceiling.  Relevant Links  Signal Request: Add a Dai flash mint module  ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-13-pt-br-portugues/4328",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313",
                        "https://forum.makerdao.com/t/maker-relay-ep-13/4310",
                        "https://forum.makerdao.com/t/maker-relay-ep-12/4153",
                        "https://forum.makerdao.com/t/maker-relay-ep-10/3907",
                        "https://forum.makerdao.com/t/signal-request-add-a-dai-flash-mint-module/3598/13",
                        "https://forum.makerdao.com/t/maker-relay-ep-14/4450",
                        "https://forum.makerdao.com/t/relay-ep-14-en-espanol/4457",
                        "https://forum.makerdao.com/t/weekly-mips-update-16/4536",
                        "https://forum.makerdao.com/t/makerdao-protocol-cover-using-nexus-mutual/4761/37",
                        "https://forum.makerdao.com/t/mip25-flash-mint-module/4400",
                        "https://forum.makerdao.com/t/mip25-modulo-de-acunacion-flash/5014"
                    ],
                    "GPT-summary": "The post is a proposal for the addition of a Dai Flash Mint Module to the Maker system. The author explains the benefits of the module and requests that MakerDAO Governance build and integrate it into the system. A relevant link to a signal request for the addition of the module is provided. The post does not contain entirely positive or negative feedback, nor does it involve collaboration or auditing/reviewing of the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.581632653061225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "13",
                    "time": "11/08/2020-13:55:13",
                    "content": "I think I’d like to see as many parameters as possible exposed to governance. Fee is definitely good, but I feel like the maximum borrow should also be tweakable by governance. There is a chance that we’d want to limit it in the short-medium term, or even in response to the use of the module to attack another DeFi project. In general it just seems like something that would be good to be able to adjust if necessary (it would also allow governance to turn it off if it caused unforeseen issues.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#3",
                    "likes": "4",
                    "time": "11/08/2020-14:04:52",
                    "content": "Added language for a debt ceiling. Good idea @LongForWisdom. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#4",
                    "likes": "8",
                    "time": "11/08/2020-14:47:17",
                    "content": "    hexonaut:   Auctions V2 can be settled via flash mint which provides an added layer of emergency liquidity. Improves market efficiencies for Dai.    First, let me say, I am more in favor of this than not.  I like the limiting parameters, and all the points you’ve made are dead on aside from the one I quoted. When the protocol liquidates a position it’s to reclaim the Dai debt and fees.  All of this is the protocol asking for Dai in return for the collateral from the position.  Since a flash lending module would expect Dai to be returned at the end of the transaction, and the new liquidation system expects Dai to be returned too, the only path that makes sense is to flash lend the Dai, so that one can give it to the liquidation system, so that one can use the collateral to source Dai on the market to return to the flash lending module.  This circuit has more steps than we’ve already envisioned for LIQ-2.0.  We are planning on simply flash lending the collateral with an expectation of Dai returned at the end of the transaction.  This is a simpler circuit requiring much less gas. This doesn’t take away from any of the other points you’ve made, and technically what you’ve written is correct; we are just envisioning a more efficient mechanism in LIQ-2.0 that would make this one feature of a Dai flash lending module superfluous for liquidations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.633953168044076
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#5",
                    "likes": "0",
                    "time": "11/08/2020-14:52:14",
                    "content": "I heard @wouter mention this in the chat the other day, but wasn’t aware it was being included now. Thanks for the clarification. I’ll remove this as a benefit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#6",
                    "likes": "5",
                    "time": "11/08/2020-14:54:43",
                    "content": "LIQ-2.0 is still under active development, so I can’t commit and say this feature will definitely be in the final release, but we think this would be the most gas efficient way to take advantage of existing DeFi liquidity for liquidations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wil",
                    "index": "#7",
                    "likes": "2",
                    "time": "11/08/2020-14:55:04",
                    "content": "which platform is originating the most flash loans these days i sincerely don’t know has anyone done a cost benefit analysis to determine if this would generate any revenue for MCD when you can just do feeless flash loans on dydx MCD flash loans would offer more liquidity ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#8",
                    "likes": "1",
                    "time": "11/08/2020-15:02:52",
                    "content": "I think Aave does a fair amount of volume. Details here: https://aavewatch.now.sh/flash-loans I know they charge a 0.09% fee as well, with 30% going to the protocol and 70% going to depositors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/montyly",
                    "index": "#9",
                    "likes": "7",
                    "time": "11/08/2020-16:03:57",
                    "content": "I would be extra careful with adding flash minting to DAI. It’s not uncommon for contracts to check only for underflow, and skip overflow checks to save gas. In these situations, flash minting would create new exploits. Overall I can see many ways where flash minting in DAI would lead to new hacks. If the community decides the move forward with this proposal, I think it requires to:  Evaluate all the contracts that rely on DAI to see what would be the impact of flash minting Evaluate what should be the limit of tokens to be minted within the same block  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.151515151515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#10",
                    "likes": "3",
                    "time": "11/08/2020-16:42:25",
                    "content": "This is a great point. It may make more sense to set an arbitrarily high debt ceiling that is well below the integer limit instead of no limit. In any case the debt ceiling parameter will cover this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal"
                    ],
                    "Sentiment": 7.433333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KentonPrescott",
                    "index": "#11",
                    "likes": "9",
                    "time": "12/08/2020-21:59:22",
                    "content": "    hexonaut:   Improves market efficiencies for Dai. Democratization of arbitrage - anyone can participate. Exploits requiring a large amount of capital will be found quicker which makes the DeFi space safer overall. Fees provide an income source for the protocol.    This is quite thought provoking. Since MakerDAO is the primary credit generation facility of DeFi, it has the privilege to mint Dai, which is already deeply integrated as collateral types and shares of Liquidity Pools, as opposed to the recently introduced Flash-Mintable-Tokens (FMTs). A Dai Flash Mint Module would stress-test all DeFi protocols, not just those touching Dai. Since Dai can be used as collateral on secondary lending protocols (i.e. Compound, Aave, etc), one could practically borrow all forms of collateral with an arbitrarily large amount of Flash Minted Dai (e.g. 10T). Therefore, even projects without Dai support wouldn’t be gated from the influence of a Flash Mint. Moreover, this acts as a second-order flash loan (in the borrowed asset), leading to improved market efficiencies beyond Dai. I agree with @LongForWisdom that we should enforce limits in the short-medium term, as it will allow projects to react with protocol improvements and defend against attacks needing limitless capital. But regardless of the guardrails, I agree with this MIP and think it’ll carry many long-term benefits to DeFi (and Maker) that are simply not found in Traditional Finance. As @montyly advised, if this comes to fruition, I’ll help to carry out two deliverables:  Notify and help mitigate any impact to other large DeFi protocols (think Compound, dydx, etc) Write a concise and coherent integration guide, improving the developer experience  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.739285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#12",
                    "likes": "1",
                    "time": "12/08/2020-22:33:22",
                    "content": "Setting mint limits reduces my fear of big surprises biting us quickly after the release. I’m very much for having a flash mint module. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.988888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#13",
                    "likes": "0",
                    "time": "17/08/2020-03:34:10",
                    "content": "Bump for visibility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#14",
                    "likes": "0",
                    "time": "25/08/2020-11:00:05",
                    "content": "Next Tuesday Sept 1st starts the frozen period for this proposal. Is anyone looking to add any changes before then? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#15",
                    "likes": "3",
                    "time": "25/08/2020-14:26:03",
                    "content": "I guess the only question I have (and I know it has not been determined) is how much Revenue is this instrument going to provide for Maker? I think DYDX has 0% fee and Aave is 0.09%. Wondering what if any revenue this instrument can bring to Maker. Another questions–as far as innovation–will it be user friendly? Trying to figure out what the competitive advantage would be versus others… image655×527 19.5 KB ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#16",
                    "likes": "4",
                    "time": "25/08/2020-14:32:25",
                    "content": "So the nice thing is that assuming Dai becomes the main currency of DeFi, we can undercut all the competition in terms of fees. All the other services require lenders on the other side locking up their collateral whereas we have no such constraint. There is a price point at which the cost of capital allows us to dominate the flash loan/mint arbitrage market. It’s not clear yet what this price point is, but we can play around with it. With regards to being user friendly, there doesn’t really need to be a GUI because flash mints require custom code anyways. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.651041666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#17",
                    "likes": "10",
                    "time": "07/09/2020-18:41:36",
                    "content": "So this is now in the formal submission phase. Thanks to everyone for the feedback. I’ve built out the module myself to save time: https://github.com/hexonaut/dss-flash ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-15/4243"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#18",
                    "likes": "1",
                    "time": "05/05/2021-20:34:11",
                    "content": "Updated to Accepted as per MIP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "2585"
}