{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/help-needed-contact-address-doesnt-work/11400",
            "title": "Help Needed - contact address doesn't work ",
            "index": 11400,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Alex",
                    "index": "#1",
                    "likes": "1",
                    "time": "03/11/2021-16:08:56",
                    "content": " Sorry if this is the wrong forum, but the email address listed on Polygon Scan for Maker Dao doesn’t work - and the main site doesn’t have a contact address or method.  Please see below for the attempted email.  Any and all help will be greatly appreciated. Hi. Yesterday, I transferred 690.895995426699955508 DAI to Crypto.org wallet address… 0xa32e8a897ed4b07083c4cfcd235b160b14c7adad. The transaction hash on Polygon Scan shows that the transaction was successful. You can click here for more details. Less than a minute later however, it shows that it went to the Maker Dao address: 0x4c9df57276dc17dee5635ded208c07b0be32afd0 - you can click here for more information. I didn’t make this transfer myself. The transfer also doesn’t appear in my Crypto.org as a transaction. It’s almost as if it disappeared into thin air. I need to know and understand why this was transferred. Was it a hack? Or was this intentional? I didn’t conduct or approve the second transaction (only the first transaction to Crypto.com) I have already discussed this with Polygon and Crypto.com - they both directed me to contact your team. Please help, asap. This has been over a day’s worth of inconvenience. Thank you. – Chat Soon, Alex ",
                    "links": [
                        "https://polygonscan.com/tx/0xf8bb2baa9ebd0983d8b36cb1d9659fe2294317e424f1e068de34508dcb77db95",
                        "http://Crypto.org",
                        "http://Crypto.com",
                        "http://Crypto.com"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.392857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "03/11/2021-16:26:22",
                    "content": "First of all, are you sure that Crypto.com supports DAI on the polygon network to your wallet, as far as I remember it was for now only with USDC. Secondly, in the TXID you pass you don’t notice any transfer of any assets. It could be my mistake and it is just a working contract. What you may have seen is that when you transfer an asset and it is properly documented by the browser it will show you the contract on that network, “remember DAI does not support DAI on Polygon” DAI only exists natively on Ethereum.  image1304×669 64.8 KB  talk well with Crypto.com team, take it easy and formulate your requirements a bit better, so we can help you here or there. ",
                    "links": [
                        "http://Crypto.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9907407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alex",
                    "index": "#3",
                    "likes": "0",
                    "time": "03/11/2021-16:29:11",
                    "content": "@Saludiego_201 - this is helpful.  Yet, still very confusing for where I am currently in my crypto understanding.  Is there any other next steps that I should take to find out where it is?  I’ve already discussed at nauseam with the Crypto.com team.  And thank you for your response. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.35625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "1",
                    "time": "03/11/2021-16:34:39",
                    "content": "When you deposit funds in exchange, depending on the demand, they usually move them immediately to their main wallet. Your wallet is understood as the wallet  the exchange gives you to the main wallet  the exchange. Your first step is to contact their team, find out if they support DAI on the Polygon network. The good thing is that you have the proof and you own your wallet, in case they ask you to authenticate that they are yours. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.361111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alex",
                    "index": "#5",
                    "likes": "1",
                    "time": "04/11/2021-12:07:14",
                    "content": "@Saludiego_201 - Thanks immensely for your help. The exchange now recognizes the error and is working actively to return the funds back to my wallet. I appreciate your help re-routing me back to them. And for giving me a sense of exactly what to ask for and bring their attention to. Cheers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.263888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "0",
                    "time": "04/11/2021-12:20:11",
                    "content": "Don’t worry, that’s the idea of community, to help each other. Let us know when you fully recover your funds, good luck! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s7acktrac3",
                    "index": "#7",
                    "likes": "0",
                    "time": "06/11/2021-10:55:31",
                    "content": "Good Morning so ironic that I found this after basically a night of no rest. [Polygon Transaction Hash (Txhash) Details | PolygonScan](Polygonscan Transaction) I have referred them also to your link in hopes that helps me out also. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alex",
                    "index": "#8",
                    "likes": "0",
                    "time": "06/11/2021-13:23:37",
                    "content": "GM @s7acktrac3 - I hate to hear that you’re going through the same thing and with more money on the chain.  I’ve got to say this has been a bad experience for the past 72 hours.  One day, I talked to them for 14.5 hours straight beginning at 6am in the morning. They finally agreed to refund the money, but told me that they would take 100 USDC to approve the refund.  When I asked for proof of policy, they told me that it was up to me if I wanted my refund or not.  I gave them the 100 USDC, they took it from my account… then never returned the money.  I followed up with them 3 times… and they just keep saying that there’s no timeline or ETA. Feel free to illustrate my experience when talking with them.  And it this point, I’m starting to feel they need to take the problem to other platforms. Good Luck!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1022727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s7acktrac3",
                    "index": "#9",
                    "likes": "0",
                    "time": "06/11/2021-13:35:33",
                    "content": "Damn man! Please get in contact with me via Twitter or Discord, telegram. @stacktrac3 on Twitter, S7acktrac3#1383 Discord. Did they explain what exactly happened? Same symptom as you, send dai from meta to crypto and I noticed it says it got to me but then another transactions to maker address that I definitely didn’t make and there’s no record of it in my app. Again I’ve transferred to and from back and forth blockchains, wallets ect so this is so unfortunate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s7acktrac3",
                    "index": "#10",
                    "likes": "1",
                    "time": "07/11/2021-22:59:13",
                    "content": "Hey Alex! Any updates? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "08/12/2021-09:00:04",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}