{
    "poll_list": [
        {
            "title": "Ratification Poll for Declaration of Intent to Develop a Comprehensive On-chain Monitoring Solution for RWA Vaults (MIP13c3-SP13) - January 9, 2023",
            "index": "19095",
            "option": "Yes",
            "supporting_mkr": "92,764",
            "highest_fraction": 0.99
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip13c3-sp13-declaration-of-intent-to-develop-a-comprehensive-on-chain-monitoring-solution-for-rwa-vaults/19095",
            "title": "MIP13c3-SP13: Declaration of Intent to Develop a Comprehensive On-chain Monitoring Solution for RWA Vaults ",
            "index": 19095,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#1",
                    "likes": "8",
                    "time": "08/12/2022-15:39:02",
                    "content": " MIP13c3-SP13: Declaration of Intent to Develop a Comprehensive On-chain Monitoring Solution for RWA Vaults  Preamble MIP13c3-SP#: 13 Author(s): @rspa Contributors: @twblack88 Tags: declaration-of-intent Status: Accepted Date Proposed: 2022-12-08 Date Ratified: 2023-01-23 Forum URL: https://forum.makerdao.com/t/mip13c3-sp13-declaration-of-intent-to-develop-a-comprehensive-on-chain-monitoring-solution-for-rwa-vaults/19095 Ratification Poll URL: https://vote.makerdao.com/polling/QmaKWQtf --- Declaration Statement: Declaring the intent to fund the development of a comprehensive on-chain monitoring solution for RWA vaults. Declaration to Replace: n/a   Specification  Context and Motivation Current RWA monitoring is lagging behind as much as 13 months in the case of New Silver. MakerDAO is scaling up RWA vaults for yield and diversification. We need to develop maximum transparency around that. Currently no core Unit is explicitly and directly responsible for monitoring RWA vaults for violations of covenants or reporting obligations. Strategic Finance (SF-001) has developed some solutions, in extension of their mandate, and at considerable extra cost and effort. Flipside Governance wants to applaud these initiatives. RWA counterparties have professed additional reporting.  Declaration Detail MakerDAO intends to pick a RWA on-chain monitoring solution by electing to fund a proposed SPF by a an external solution provider (the proposer). The proposer should demonstrate the ability and the credentials that they can develop a trustworthy and transparent solution to RWA monitoring. — Edited during RFC period: Solutions have three main areas to cover:  The first mile The infrastructure The presentation  ad 1.) This is the most important and the most difficult part any proposal must cover. Relevant data necessary to adequately judge RWA vault health needs to be gathered first. This could mean looking at detailed breakdowns of loans originated for a credit portfolio as well as the health of these loans. Or a detailed breakdown of the tenancy and cost of a real estate portfolio. Or the performance of installed solar panels, to give some examples. Ideally, this is done by more than one well-established third party so that multiple eyes perform cross-checks on each other, if feasible. The ideal proposer would include an initial list of data points to be monitored for at least one existing RWA vault as part of their proposal so the community can judge their acumen. If proposers host Q&A calls to field possible questions, even better. ad 2.) The more decentralized, permissionless, and uncensorable the transferring of data gathered is, the better. @NikKunkel from Chronicle Labs has expressed that Chronicle Oracles would be able to transport such data as well, given adequate standardization. We have mentioned Chainlinks Proof-of-Reserve protocol as a further example. MakerDAO wants to remain the gold standard for decentralization, and any proposed solution should ensure this is taken into account. ad 3.) While it is necessary to have the gathered data available in its raw format and as openly as is permissible without running into confidentiality issues, the ideal proposal should also develop a dashboard where interested community members can dig into vault health parameters at their leisure, and also have the most important parameters visible at a glance. Strategic Finance has recently published an accounting dashboard for Maker, which can definitely serve as a benchmark in this regard. (See link below) The proposer should include the following information in their SPFs:  Developer team with a spokesperson for the team Credentials or references to prior work Proposed data points gathered for a selection of existing RWA vaults How the solution is designed and how it will be implemented Milestones for development with costs for milestones Total budget breakdown Time for execution   Proposed process Should MIP13c3-SP13 be ratified by MKR holders, we propose a 30d window for interested parties to submit Special Purpose Fund requests to fulfill the intent of this MIP. After these 30 days, the SPF will enter an on-chain approval voting poll to determine the winner. The SPF shall not be paid out at once but according to the proposed milestones. Milestone specifications should be easy and unambiguous to verify. MakerDAO will determine a responsible counterparty together with the winning proposer, either in the form of multi-sig owners or a responsible core unit that can verify milestones have been met and then pay for the delivered milestone.  Relevant Links Maker Transaction Level Accounting Dashboard Monetalis Clydesdale Dashboard ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-transaction-level-accounting-dashboard/19143",
                        "https://dune.com/SebVentures/makerdao-mip65",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/37",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/118",
                        "https://forum.makerdao.com/t/quality-of-maker-s-risk-management/19269/7",
                        "https://forum.makerdao.com/t/weekly-mips-update-121/19437",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/13",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/87",
                        "https://forum.makerdao.com/t/mip97c2-sp1-dlo-on-chain-rwa-monitoring/19901",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/47",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/40",
                        "https://forum.makerdao.com/t/weekly-mips-update-120/19364",
                        "https://forum.makerdao.com/t/weekly-mips-update-119/19289",
                        "https://forum.makerdao.com/t/weekly-mips-update-118/19260",
                        "https://forum.makerdao.com/t/weekly-relay-recaps-of-current-events-at-makerdao/16382/29",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/36",
                        "https://forum.makerdao.com/t/governance-and-risk-219-thursday-december-15-at-17-00-utc/19174",
                        "https://forum.makerdao.com/t/weekly-mips-update-117/19148",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/117",
                        "https://forum.makerdao.com/t/request-for-proposals-for-a-on-chain-rwa-monitoring-solution/19535/32",
                        "https://forum.makerdao.com/t/mip95-100m-of-cogent-bank-loan-participations/19338/11",
                        "https://forum.makerdao.com/t/makerdao-2022-financial-results-and-retrospective/19636",
                        "https://forum.makerdao.com/t/mip100-stable-asset-allocation-framework/19556/25",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/36",
                        "https://forum.makerdao.com/t/request-for-proposals-for-a-on-chain-rwa-monitoring-solution/19535",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/33",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/151",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/39"
                    ],
                    "GPT-summary": "The post is a proposal for the development of a comprehensive on-chain monitoring solution for RWA vaults. The proposal explains the current state of RWA monitoring and the need for transparency. It outlines the three main areas the proposed solution should cover and the information that should be included in the Special Purpose Fund requests. The post also invites interested parties to submit their proposals and provides relevant links for further information. A third party could give constructive criticism, extend to the proposal, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.99142094677809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/12/2022-15:39:07",
                    "content": "This post has been reserved for GovAlpha’s proposal summary on proposal MIP13c3-SP#: Declaration of intent to develop a comprehensive on-chain monitoring solution for RWA vaults ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#3",
                    "likes": "8",
                    "time": "08/12/2022-15:52:27",
                    "content": "We’re in the process of onboarding @roo to develop monitoring and reporting for existing and prospective RWA collaterals and will be submitting a new MIP39/40 to take ownership of these activities given the current gap. Given MakerDAO’s significant expansion in RWAs and the fact that a majority of protocol income is derived from RWAs, we believe it is critical that these assets are monitored, reported on, and transparency around these assets given the off-chain nature and complexity is provided to the community in a digestible format. We have some exciting ideas and hope to share more soon! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.196969696969696
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/12/2022-16:14:38",
                    "content": "That’s very good to hear, and we’d deeply appreciate your input into this MIP13 during the RFC phase. Maker can only profit from more solution providers, especially those independent of the DAO and the RWA onboarding process. Thanks again for your tireless work here! ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.185714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#5",
                    "likes": "2",
                    "time": "12/12/2022-18:43:34",
                    "content": "Some feedback I gathered so far: The desired solution has three tiers:  Data Intake Middleware - Infrastructure Representation  1.) Needs trusted, capable third-party accountants checking the bank accounts and books and entering the data into the second part 2.) Would ideally be an oracle. We’ve looked into Chainlink’s Proof-of-Reserve, which already has some exciting applications like TUSD assets and low-cost for Oracle provision. Would love to have additional input on other infrastructure providers here. Maybe @NikKunkel can chime in if Maker oracles could build external adapters for off-chain data. 3.) Representation is more than UX. Ideally, the data is curated in a fashion that makes vault health available at a glance but allows interested parties to drill in deeper if desired. Would love to have some input here by @Aes or @Retro if some of that data needs permissioning or screening. Is any of the RWA counterparty data confidential? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.7019230769230775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/elidco",
                    "index": "#6",
                    "likes": "1",
                    "time": "12/12/2022-21:37:23",
                    "content": "    rspa:  1.) Needs trusted, capable third-party accountants checking the bank accounts and books and entering the data into the second part   For this to work, it will be key for the third party auditors to have full account access and not just receive electronic statements. There will be data confidentiality issues, but the account authorized persons should be able to waive these. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#7",
                    "likes": "1",
                    "time": "13/12/2022-11:34:24",
                    "content": "    elidco:  There will be data confidentiality issues, but the account authorized persons should be able to waive these.   A tricky one for sure. In my view at the current level of exposure MakerDAO cannot afford not to do everything possible to get to the best possible monitoring solution. The first mile from RWA counterparty accounts and books to chain/oracle/API is the hardest for sure. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#8",
                    "likes": "4",
                    "time": "13/12/2022-12:47:24",
                    "content": "speaking personally     rspa:  The desired solution has three tiers:  Data Intake Middleware - Infrastructure Representation    This DoI could spark some really interesting developments in the RWA space, and will be very curious to see what emerges. This is an intractable and very difficult problem with a very valuable solution that has the potential to improve the ecosystem for everyone. Regarding the tech stack as outlined here, imo the most important by far is the first. Naively I assume Chronicle would be a natural partner for 2 and on 3 I imagine the best endpoint is an API. Next step would be to plug in the oracle to the relevant vaults, next step after that an orderly on-chain liquidation mechanism like for decentralized collateral. One can dream.  DoI Long-Term Objective I think this DoI could frame a long-term objective to help drive any proposals that answer the call. In my view, it should be something along the lines of expecting participants in Maker RWA vaults to end up building out a fully on-chain ledger of record for any transactions in meatspace. Curious to hear the views of others, or if a LT objective or destination is necessary at all.  Expectations for Data Intake If we end up having three pairs of eyes look at the same website and punch it into a terminal, we are wasting our time and money. We can settle for something like this as an improvement on no information whatsoever–but we can do it quickly, efficiently and for cheap using existing tools e.g. MIP65 dashboard. This dashboard for e.g. by its own admission is more POC than prod but it’s strictly better than nothing. Please correct me if I am misrepresenting the work of Chainlink but this is essentially their much touted Proof-of-Reserves. I am imagining something like a bounty system or incentive combined with an open-data process that allows third-parties to independently verify legal claims and record expected values. The aim should be to have independent sources of auditable data that can triangulate to a median value. That being said, there is maybe a reason why some solutions won’t be able to reach this level of independent verifiability. It shouldn’t stop us from high expectations in the DoI. We have a chance to raise the standards for the ecosystem as a whole and we should ask for more than just regulatory paperwork or legal theatrics. Lehman Brothers filed all of their 10-Ks correctly.  Expectations by Asset Classification Another important point is that obviously not all RWA collaterals are the same, although they can be grouped in various ways. What might make it helpful for people answering the DoI is that we clarify what we are expecting when we ask for verification or audit as it will depend on the asset class. I don’t have a straight answer here and it goes beyond my experience. We don’t have to reinvent the wheel and we could ask the community to help us shape our expectations for data intake depending on the asset type following an ISO classification or something for eg.  => We should be as clear as possible upfront so that we can quickly ding proof-of-reserve cron jobs because frankly we can make those ourselves on Dune already. Curious to hear other views and disagreements. ",
                    "links": [
                        "https://forum.makerdao.com/t/request-for-proposals-for-a-on-chain-rwa-monitoring-solution/19535/36",
                        "https://forum.makerdao.com/t/request-for-proposals-for-a-on-chain-rwa-monitoring-solution/19535/24"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.727166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#9",
                    "likes": "1",
                    "time": "13/12/2022-13:15:13",
                    "content": "    adcv:  Another important point is that obviously not all RWA collaterals are the same, although they can be grouped in various ways. What might make it helpful for people answering the DoI is that we clarify what we are expecting when we ask for verification or audit as it will depend on the asset class.   Among the many important points you raise this is what caught my eye the most. Maybe we have to take a critical look at RWA collateral, find out what we can reasonably monitor and liquidate well and then focus on that and only that. Part of my intention for bringing forth this DoI is to bring some clarity into what kind of RWA collateral MakerDAO should onboard. In my mind,this would be primarily collateral with at least two independent API price feeds. But we can also work towards more remote collateral and develop price or health feeds there.     adcv:  but it’s strictly better than nothing.   100%. I want to give @SebVentures much-deserved credit for proactively developing this.     adcv:  touted Proof-of-Reserves   That is correct. Strictly speaking, it is simply the ability to connect so-called “external adaptors”, that feed off-chain data into the Chainlink oracle network and offer pretty dashboards for viewing the reported data. But as you pointed out earlier: When all we do is have 3 people look at the same website, we might as well run a cron job with a scraping tool. We need boots on the ground, for some of the collateral. People actually checking the books. As becomes clear pretty soon, the collateral that would make so much work worth the while would have to have both substantial yield and an appropriate debt ceiling. Thanks for your detailed reply. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jeroen",
                    "index": "#10",
                    "likes": "7",
                    "time": "14/12/2022-21:37:46",
                    "content": "Thanks for starting this discussion @rspa! At Centrifuge, we’ve spent a lot of time developing smart contracts that bring private credit on-chain, and are constantly thinking about how to take this to the next level. With the current Tinlake pools, including the BlockTower pools that were just onboarded, you can already find the following information on-chain:  Tranche structure (current subordination ratio, etc) Pool inflows and outflows (investments/redemptions) Asset-level cash flows (incl. overdue payments etc) Asset statistics (average maturity, average financing fee, etc) Portfolio valuation (calculated by the on-chain Net Asset Value logic) Historical tranche performance Cash balance (i.e. the pool reserve)  We’ve built the Tinlake UI to show all of this; e.g. for New Silver you can find this information here: Pool Overview: New Silver Series 2 | Tinlake | Centrifuge. All of the underlying data is available on Ethereum and we’d be happy to collaborate with anyone on building better dashboards tailored for MakerDAO’s purposes. It’s also worth noting that BlockTower has explicitly stated they want to take on-chain reporting for RWA to the next level, and this will be a key goal we are partnering and working together with them on for the next year. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.497176736307171
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#11",
                    "likes": "1",
                    "time": "04/01/2023-18:42:12",
                    "content": "I’m formally submitting MIP13c3-SP13 to the January Governance Cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#12",
                    "likes": "0",
                    "time": "13/01/2023-01:49:09",
                    "content": "This proposal is currently being voted on. Its Ratification Poll will run until 2023-01-23. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/quntangled",
                    "index": "#13",
                    "likes": "2",
                    "time": "23/01/2023-16:44:12",
                    "content": "With this DOI being passed, thanks and congrats to @rspa. This initiative really puts Maker at the forefront of RWA DeFi. On the actual implementation, I agreed with @adcv that it is much dependent on the underlying collateral asset classes. The RWA vaults that Maker has today broadly fall into 2 categories   Short term bonds - MIP65: if these bonds/ETFs are listed, valuation/price and existence of the collateral should be quite easily established   Private/structured credits - HVB Bank, BlockTower Credit, New Silver: establishing existence and valuation of these RWAs are more challenging as they exist in private ledgers and don’t usually have active secondary markets.   The reporting and monitoring of these (category 2) RWAs should be the focus of the proposal. Ultimately, if these RWAs are originated on chain in the first place then establishing existence and pricing (even through a valuation model) will be a lot easier. Another approach is to somehow tokenize them and ensure the process is checked by an auditor/validator at the point of tokenisation and at regular intervals. Untangled has been working on RWA origination and tokenisation and would be delighted to put forward a proposal, working by ourselves or with other partners and Maker community to implement this initiative. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.624700956937799
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vigilant",
                    "index": "#14",
                    "likes": "1",
                    "time": "23/01/2023-16:58:03",
                    "content": "What will happen to this if there are no interested parties in the 30d window? It does not seem like work that has a lot of interest. If there is only one party that submits a proposal, will an on chain vote still be required to allow voters to select nobody over that one party? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#15",
                    "likes": "1",
                    "time": "23/01/2023-18:05:09",
                    "content": "Hey vigilant, I’d certainly be disappointed if there’s no interest. Let’s see what happens. Maker is under no obligation to pick one proposal, if none suits its needs. So if there are 5 proposal, and none of them is good for MKR holders, then this DoI passes and nothing gets chosen. We might thinking about repeating the request for proposals, or not, depending on the dynamics at play. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#16",
                    "likes": "0",
                    "time": "23/01/2023-18:06:43",
                    "content": "Definitely agree that we this can help Maker lead the way to the future of RWAs. One possible outcome would be that we can only adequately monitor certain kinds of RWAs well enough to make them governable and ultimately usable here. It will be up to MKR holders to decide how that affects their decisions wrt new onboardings or even existing collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.37999037999038
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#17",
                    "likes": "1",
                    "time": "23/01/2023-18:52:52",
                    "content": "it’s a great point i hadn’t noticed the 30 day window tbh. MIP13-SP12 didn’t have a close date which probably put less pressure on inbound interest but also gave it time to mature. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#18",
                    "likes": "1",
                    "time": "23/01/2023-19:30:00",
                    "content": "Wanted to get some urgency. We’ll see if this is counterproductive. If so, and there’s ongoing interest, I might propose a poll.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#19",
                    "likes": "1",
                    "time": "21/02/2023-22:23:40",
                    "content": "It looks like this passed proposal is conflicted with also passed SF CU’s mandate. How can this be resolved? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#20",
                    "likes": "1",
                    "time": "22/02/2023-10:31:26",
                    "content": "A couple of things to note here: 1.) I moved this to a DLO and SFCU can propose to do work on the DLO and get paid there, in which case I’m confident that the appropriate funds would not be double charged. 2.) If SFCU does the initial risk analysis it might make sense to have an independent third-party do the monitoring to keep incentives squeaky clean. “Out of an abundance of caution” as they say. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.138888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#21",
                    "likes": "0",
                    "time": "22/02/2023-17:17:18",
                    "content": "The DLO framework is in RFC and is not yet approved for use by the community. How far is prudent to go with requesting input for this specific example prior to the method itself being fully vetted, finalized and approved by MKR holders? What’s the current schedule on proposing the DLO MIPs for a vote @Retro? We caution here and echo points in our recent Delegate Platform update comments that this organization needs to get better about sequencing efforts in line with actual onchain MKR approvals. Too many carts before horses increases confusion, duplication and waste of effort, and contributes to an overall atmosphere of chaos that is very counterproductive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                }
            ]
        }
    ],
    "group_index": "2011"
}