{
    "poll_list": [
        {
            "title": "Should we add KNC to the Maker Protocol? - June 22, 2020",
            "index": "2458",
            "option": "Yes",
            "supporting_mkr": "37,428",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/knc-mip6-mcd-application-kyber-network-knc/2458",
            "title": "[KNC] MIP6 MCD Application: Kyber Network KNC ",
            "index": 2458,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "knc"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/DenizOmer",
                    "index": "#1",
                    "likes": "19",
                    "time": "12/05/2020-08:40:25",
                    "content": "Hello everyone, This is our proposal to include KNC as a collateral asset for MCD. 1) Who is the interested party for this collateral application? The interested party for the collateral application is Deniz Omer, Head of Ecosystem Growth at Kyber Network protocol 2) Provide a brief high-level overview of the project, with a focus on the applying collateral token. Kyber Network is an on-chain liquidity protocol that aggregates liquidity from a wide range of reserves and powers instant and secure token exchange in any decentralized application. Almost a hundred dapps plug into this liquidity protocol to swap one asset to another while dozens of reserve managers, including bridges to other liquidity providers, provide the necessary liquidity. Kyber Network Crystal (KNC) is an ERC-20 utility token and an integral part of the Kyber Network protocol especially within the Katalyst protocol upgrade due end of Q2 2020. In Katalyst, KNC holders stake KNC in the KyberDAO and vote on important protocol level decisions such as rebates-rewards-burn ratios and network fees. In return, KNC holders receive rewards in ETH from network fees collected from swapping activities in Kyber Network. In its current iteration in place since launch in Feb 2018, 0.25% of each trade is paid by the liquidity reserves in the form of KNC. 70% burnt of this 0.25% is burnt while the remaining 30% of the KNC is forwarded to dapps that brought in the trade. 3) Provide a brief history of the project. Kyber Network was founded in early 2017 by Loi Luu, Yaron Velner, and Victor Tran, It acquired runway to build out the protocol through an initial coin offering in September 2017, deployed on the Ethereum Mainnet on February 11th 2018, and has been running non-stop since then with $1B worth of tokens traded over 900K transactions. kyber-ecosystem2198×1511 254 KB 4) Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated… Kyber Protocol Paper Developer Portal Source code 5) Link any available audits of the project. Both procedural and smart contract focused audits. Chain Security audit 6) Link to any active communities relating to your project. Twitter Discord Blog Youtube Developer chat On Chain Data Tracker 7) How is the applying collateral type currently used? KNC is currently required by market makers to provide liquidity on Kyber Network. 0.25% of each trade is paid for by the market maker in the form of KNC which is then split 30% towards the dapp the trade originated from (ie. to Instadapp, Fulcrum, 1inch or wherever the trade was initiated from) and the remaining 70% is burnt. After the Katalyst upgrade due end of Q2 2020, KNC will have an upgraded role and instead of KNC being required by market makers to trade, it will take on a governance utility role within the KyberDAO. KNC holders will govern the parameters of the Kyber Network by staking KNC. Some of the parameters they can vote on is how to distribute fees between: Participation rewards: KNC holders staking KNC in the KyberDAO and voting on parameters earn staking rewards (in ETH) collected from network fees on Kyber Network. Reserve incentives: A portion of the network fee is used as rebates for reserves (liquidity providers) Burning: Some of the network fees will be burned to reduce KNC supply permanently, providing long-term value accrual from decreasing supply. Over time, as more trades are executed, additional fees are generated for staking rewards and reserve rebates and more KNC tokens are burnt. 8) Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? No organization bears legal responsibility for KNC, nor does holding of KNC confer any equity rights in any entity. KNC is a decentralized utility token used within the Kyber Network protocol. 9) Where does exchange for the asset occur? Exchange of KNC occurs on over 50 different secondary exchanges including centralized exchanges such as Coinbase & CoinbasePro, Binance, Huobi, OkEx as well as decentralized exchanges such as KyberSwap and Uniswap. All exchange of KNC is initiated by KNC holders for personal reasons independent of the Kyber Network team. [Coinbase, CoinbasePro, Binance, HuobiGlobal, Huobi Korea, OKEx, Bithumb, Bitfinex, Bitkub, Poloniex, COSS, HitBTC, Radar Relay, Upbit, Tidex, Bancor, Mercatox, KuCoin, KyberSwap, IDEX, DragonEx, 55 Global Markets, AAx, BitAsset, ABCC, Bitbox, Bitrue, BKEX, BW.com, Cashierest, Coineal, CoinExchange, Coinnest, Coinone, CounPlace, CPDAX, CredoEx, Folgory, Gate.io, Gopax, Hanbitco, Korbit, P2PB2B, Livecoin, OTCBTC, Switcheo, Vebitcoin, Vinex, VinDAX, ZB.com, ZG.com] 10) (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. A legal opinion has been obtained regarding the regulatory standing of KNC stating KNC is not a security under the Securities and Futures Act of Singapore (“SFA”). Reach out to @denizomer for further info. 11) (Optional) List any possible oracle data sources for the proposed Collateral type.    feeds.chain.link    Decentralized Price Reference Data | Chainlink Access the most versatile list of decentralized pricing networks to build your smart contracts, powered by the Chainlink network      Than you for your consideration, Deniz ",
                    "links": [
                        "https://developer.kyber.network/",
                        "https://etherscan.io/address/0xdd974d5c2e2928dea5f71b9825b8b646686bd200#code",
                        "https://github.com/ChainSecurity/audits/blob/master/ChainSecurity_KyberNetwork.pdf",
                        "https://twitter.com/kybernetwork",
                        "https://discord.gg/NfFMVz6",
                        "https://blog.kyber.network/",
                        "https://www.youtube.com/channel/UCQ-8mEqsKM3x9dTT6rrqgJw",
                        "https://t.me/KyberDeveloper",
                        "https://tracker.kyber.network/",
                        "http://BW.com",
                        "http://Gate.io",
                        "http://ZB.com",
                        "http://ZG.com",
                        "https://feeds.chain.link/knc-eth",
                        "https://feeds.chain.link/knc-eth",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/16",
                        "https://forum.makerdao.com/t/mip12c2-sp2-domain-work-requirements-for-knc/2739",
                        "https://forum.makerdao.com/t/discussion-of-collateral-onboarding-process/3338/5"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.502248677248678
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#2",
                    "likes": "6",
                    "time": "12/05/2020-09:58:55",
                    "content": "Just regarding question 11, I think chainlink is probably not the type of data source we’re looking for because that’s already a processed data source. I think it’d be more along the lines of:  Coinbase Binance etc  Otherwise, I don’t have any reservations about KNC being added with the right (conservative) parameters ",
                    "links": [
                        "https://www.binance.com/en/trade/KNC_BTC"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DenizOmer",
                    "index": "#3",
                    "likes": "4",
                    "time": "12/05/2020-11:18:54",
                    "content": "Thanks for the feedback, I assumed the question was asking about on-chain oracles but in fact it’s any exchange centralized or decentralized with a price feed? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarkL",
                    "index": "#4",
                    "likes": "9",
                    "time": "12/05/2020-16:59:19",
                    "content": "Id like to see KNC added.  Its the right fit.  like Maker, Kyber helped lay the groundwork for defi most (about 85%) of token total supply is already circulating deflationary supply (>2% of total supply burnt). a highly used + decentralized protocol, with many defi integrations  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.318367346938776
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "5",
                    "time": "12/05/2020-19:44:04",
                    "content": "Also, KNC should be uncorrelated with ETH/BTC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BillDucoin",
                    "index": "#6",
                    "likes": "6",
                    "time": "12/05/2020-20:35:25",
                    "content": "_The trading Volume of Kyber Network was multiplied by 10 in a year. Its adoption rate is growing like no one else thanks to its numerous integrations, for instance in Enjin wallet, which has partnership with Samsung to be integrated in their Galaxy phones range.  Trust Wallet, Coinbase or MyEtherWallet. The upcoming Katalyst upgrade with KyberDAO allowing to stake KNC is one of the most awaited event of 2020. Kyber has always been supported by Vitalik : https://twitter.com/VitalikButerin/status/1229819782230241280 https://twitter.com/vitalikbuterin/status/874522987885670400 The Kyber Widget allows merchants to obtain any crypto and receive whatever crypto they want in the back end, so they can accept ETH and get DAI or whatever they want.    developer.kyber.network    KyberWidget Generator · KyberDeveloper · Powering Liquidity for the Ecosystem [//]: # (tagline)      I’m still learning about the project everyday but the more i learn the more i like it. It is already very complementary with Maker providing liquidity for Oasis Dex and allowing to swap Dai and MKR in many Dapps. ",
                    "links": [
                        "https://twitter.com/vitalikbuterin/status/874522987885670400",
                        "https://developer.kyber.network/docs/Integrations-WidgetGenerator/#docsNav",
                        "https://developer.kyber.network/docs/Integrations-WidgetGenerator/#docsNav"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DeFiDude",
                    "index": "#7",
                    "likes": "9",
                    "time": "12/05/2020-21:45:59",
                    "content": "100% in support here. KNC & Kyber have been around for multiple years now which shows that the project and underlying token have been battle tested on many occasions. On top of that, it’s one of very few DeFi tokens that actually have continuous growth in terms of users and holders. As seen by the binance report, Kyber Network was the most used dapp of all of 2019 based on unique addresses/users. Their solid tokenomics with a deflationary supply are only going to get better with Katalyst coming, and the support for Kyber is everywhere. They’re integrated almost everywhere and should definitely be considered for MCD support given their strong presence in the DeFi ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.061805555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#8",
                    "likes": "6",
                    "time": "12/05/2020-22:37:04",
                    "content": "Hope to see KNC added. We need to add this large category of exchange platform tokens. Stable transaction fee income. Deflationary supply. The user base is large. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.380952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JJ_Alio",
                    "index": "#9",
                    "likes": "4",
                    "time": "13/05/2020-04:13:30",
                    "content": "KNC soon will be the only staking token that giving out the rewards in ETH which will attract all of us to hold some of KNC. It means that if KNC becomes a one of collaterals, it should be easy to get adoption than others. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/taisuke_hory",
                    "index": "#10",
                    "likes": "3",
                    "time": "13/05/2020-09:25:50",
                    "content": "I believe adding KNC as a collateral makes DAI more stable. After Katalyst protocol upgrade, KNC holders who participate KyberDAO governance receive rewards in ETH from network fees.  It should be a strong evidence enough to substantiate the value of KNC. According to Kyber report, swapping activities (volumes) of Kyber in March recorded all time high while Maker system suffered from crushing ETH prices. But KNC price might be stable compared to ETH/other ERC20 especially in the time of crisis after Katalyst because high volume means good reward to KNC holders. So I think adding KNC is a good option to make DAI more stable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.776666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "6",
                    "time": "13/05/2020-12:10:59",
                    "content": "Seeing a number of first-time posting Kyber supporters here. Nothing explicitly wrong with this, but be aware that these threads are primarily intended for Maker Community members to discuss MIP6 applications. Some counterpoints:  Staking is being used as an argument as to why KNC would be a valuable include into MCD, however staking actually reduces the amount of KNC available for minting DAI. You can’t both stake your KNC, and borrow against your KNC (at least so far as I understand.) Tokenomics are actually not a huge input into the risk function (assuming something isn’t ridiculously inflationary or that may result in the price varying wildly). Arguing that KyberSwap volume increasing in periods of decreasing ETH price does not mean that ETH and KNC are uncorrelated. A high burn rate is not the only input into token price, and this doesn’t make KNC stable versus ETH. On Black Thursday the price of KNC was heavily correlated with ETH.  For the record, I’m saying all this as a supporter of Kyber. I agree the fundamentals are impressive in comparison to most other projects. I’m just not sure that many of the supporters here quite understand what properties MKR Holders are primarily looking for in collateral:  Uncorrelated with major cryptocoins Large marketcap Lots of demand for credit using that collateral. Decentralized where possible.  There are virtually no cryptotokens that meet all of these criteria. Kyber is decentralized, and I don’t think is any serious harm in adding it. But I also doubt that we’ll see more than a few million DAI minted against it in the near future due to the fairly low marketcap and the fact that staking will absorb much of the supply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.36089099702381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deniz_Omer",
                    "index": "#12",
                    "likes": "2",
                    "time": "13/05/2020-13:05:33",
                    "content": "    LongForWisdom:  Seeing a number of first-time posting Kyber supporters here. Nothing explicitly wrong with this, but be aware that these threads are primarily intended for Maker Community members to discuss MIP6 applications.   Thank you for highlighting this, we were given the impression that involvement and feedback on the application form from our community should be encouraged, and I think if the comments are adding insight and are supported by logical argument for inclusion into MCD it should definitely be welcome. I hope the Kyber community can be mindful of that, thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "3",
                    "time": "13/05/2020-13:23:07",
                    "content": "Involvement and feedback is absolutely encouraged, if the comments add insight and critical analysis to the application, that’s fantastic. Helping to answer any questions that crop up in the thread would also be appreciated. I see it like this:  Involvement and engagement with the Maker Community, absolutely great, please help answer questions, provide clarity, provide information, etc. Making statements on why KNC is a good inclusion into the Maker Protocol without making community affiliations clear is less good. Upvoting all the statements from the Kyber community is even less good.  The goal behind encouraging community involvement is so that there are people who can answer questions and provide information. Aim to inform rather than persuade. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fridaymark",
                    "index": "#14",
                    "likes": "0",
                    "time": "14/05/2020-02:03:35",
                    "content": "Agree that -Has a wide community coverage -Kyber’s team has a certain degree of popularity and accumulation in the industry, and has already received good attention in the early stage of financing -Very active in the Ethereum developer community -Kyber will enter the phase II, the addition of KNC will increase market liquidity for DAI ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.740952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Galaxy",
                    "index": "#15",
                    "likes": "0",
                    "time": "14/05/2020-02:03:48",
                    "content": "Kyber is one of the most successful blockchain projects. Hope KNC can be included in makerdao ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/a_mote",
                    "index": "#17",
                    "likes": "1",
                    "time": "17/05/2020-03:18:24",
                    "content": "Hi! I have also just registered to participate in the thread, this is not kind of brigading, just saw the proposal and thought it is interesting.  Arguing that KyberSwap volume increasing in periods of decreasing ETH price does not mean that ETH and KNC are uncorrelated. A high burn rate is not the only input into token price, and this doesn’t make KNC stable versus ETH. On Black Thursday the price of KNC was heavily correlated with ETH.  I believe that since the Kyber’s staking is live we could see different price reaction, because such huge movements like we saw on Black Thursday provide significant increase of the volume therefore increase in the rewards for the holders. I also don’t think that a lot of Dai would be minted against KNC, however I believe that it is definitely not worse collateral than BAT. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.390814393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#18",
                    "likes": "2",
                    "time": "17/05/2020-15:22:25",
                    "content": "@DenizOmer We appreciate your forthrightness in offering the Singaporean legal analysis. Would you mind summarizing the tl;dr from that memo for the community? Although I am no expert in Singaporean law, that would be helpful as we consider the potential implications of onboarding KNC. I also note that your team performed an ICO in September 2017 that, from what I remember, did not geo-block or prohibit participants from particular geographic regions. I think it’s safe to presume that US-based persons were involved in that ICO, so has your team conducted a Howey analysis under US law regarding KNC? If so, can you please provide the community with a tl;dr on the memo’s facts, analysis and conclusion? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#19",
                    "likes": "0",
                    "time": "17/05/2020-15:23:53",
                    "content": "@Deniz_Omer for a good example at how to address our initial questions, take a minute to review the recent information provided by 0x ([ZRX] - MCD collateral application). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deniz_Omer",
                    "index": "#20",
                    "likes": "2",
                    "time": "18/05/2020-07:18:45",
                    "content": "Thanks for the example, it’s really useful and I’ll be providing the full info shortly but in the meantime thought I’d mention the ICO was not open to US/China and a few other countries and everyone who participated was KYC’d by an independent Singaporean firm licensed to KYC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.180555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DenizOmer",
                    "index": "#21",
                    "likes": "1",
                    "time": "22/05/2020-09:02:07",
                    "content": "Regarding your US question, we barred US-based people from participating in the ICO by blocking all IP addresses from the US and in general we’re recognizant of different government and jurisdictions’ interpretations and application of security laws so we always default to the conservative approach. For example around the time of the Kyber ICO China announced a ban on participation of ICOs so we immediately excluded all Chinese citizens as well (we had done full KYC check on all ICO participants and excluded Chinese passport holders). And of course all citizens of countries on the UN sanctions list were also barred from participating. This ties in with your second question around a tl/dr of the Singaporean legal analysis since it parallels US securities laws and the Howey test. The applicable law in question is the Securities and Futures Act of Singapore (SFA) and the legal document details the definition of securities under this law with 8 different criteria including debentures, stocks or shares issued by a corporation, unit in a business trust, derivative of a unit in a business trust etc etc. It then covers how KNC tokens do not meet this criteria including the fact that it does not grant any right or interest in any debenture of the company or any right to call for redemption and goes into more detail on each one. In line with this, we never marketed KNC as an investment opportunity and just as designed, Reserve Managers have been using KNC to provide liquidity to the Kyber Network since mainnet launch in February 2018. KNC’s utility characteristic is recognized by multiple stakeholders including exchanges like Coinbase who are comfortable with this classification. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.734920634920635
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#22",
                    "likes": "7",
                    "time": "26/05/2020-03:42:43",
                    "content": "Oracle Team Collateral Onboarding Evaluation V1.1.0 Author: Niklas Kunkel Contributors: Date: 05/25/20 Disclaimer The collateral onboarding recommendations published by the Oracle Team in accordance with MIP6 are independent and non-binding. In other words, a recommendation by the Oracle Team does not impede the collateral onboarding process. Ultimately it is the community’s decision whether to include a collateral in the Maker Protocol. Like other Domain Teams, The Oracle Team has no authority to unilaterally include or exclude a collateral, it merely provides guidance to the community in relation to Oracles. This methodology is intended to evolve over time to adapt to the ever changing circumstances affecting Maker governance. The recommendations are evaluated in relation to the technical feasibility and technical complexity to create a secure Oracle for the proposed collateral type and don’t take any other factors into account. Technical Complexity Evaluation Determine how complex integrating Oracles for this collateral type would be and how long it would take to implement such a solution. Data Sources: Are there sufficient high quality data sources available to construct a reliable, resilient, and secure Oracle for the proposed collateral asset?  Yes, it appears there is a healthy diversity in listings between top exchanges including Coinbase Pro, Binance, and Upit.  Can the current tooling support the types of data sources that are needed?  Yes the majority of data sources are already supported in the Oracle tooling with the exception of Uniswap data.  Data Models: Can the current tooling support the type of data modeling that is needed?  Yes, the current tooling supports a median data model which would be applicable for this collateral type.  What would it take to expand the functionality of the current tooling to support the necessary data sources and data modeling?  N/A  Missing: Is a solution currently not possible because of a key missing component?  There are no missing pieces that would prevent the Oracle Team from creating a secure Oracle for KNC.  Externalities: What dependencies (both technical and system), risks, costs, and latency are added to the Oracle Protocol as a function of these added features?  N/A  Deliverables: Does adding these features interfere with ongoing or planned development of new tooling on the Oracle Team roadmap?  No.  Does adding these features require work and/or coordination from other stakeholders such as the Smart Contracts Team(s)?  No.  How long would it take to design, implement, test, and deploy such a solution?  ~2 weeks  Recommendation Should the community decide to greenlight the collateral onboarding process for KNC, the Oracle Team sees no blockers to create a secure Oracle for KNC given the ample data sources from a diverse group of exchanges. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.172453861927546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#23",
                    "likes": "3",
                    "time": "27/05/2020-03:06:56",
                    "content": "Thanks for taking the time to submit this additional data. I truly appreciate it, and in my opinion the DAO’s decision making is better informed because of your efforts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                }
            ]
        }
    ],
    "group_index": "2346"
}