{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposal-system-reserve-vault/1841",
            "title": "Proposal: System Reserve Vault ",
            "index": 1841,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "idea",
                "reserves"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "3",
                    "time": "28/03/2020-21:41:55",
                    "content": "Tl;dr: Mint and auction MKR tokens in exchange for collateral assets (ETH, then possibly BAT and/or USDC). Lock the collateral into a system reserve vault. Use the reserve to assume bad debt from user vaults and strategically manage DAI liquidity. Current State Market disruptions surrounding Black Thursday reduced supply of DAI from vaults while increasing demand from vault holders seeking to pay down debt and auction participants looking to bid for collateral. The need for MKR to run debt auctions to recapitalize the system further increased demand and constrained supply, deepening the liquidity crunch. Maker holders attempted to mitigate the liquidity issues by onboarding USDC as a collateral asset, and while utilization has been robust, overall DAI liquidity remains low. After clearing the system debt, it would be understandable for Maker holders to seek to increase the system surplus to improve resilience to future crises. But doing this while market confidence remains low could further restrict liquidity. Proposal Maker holders need a mechanism to increase system loss capacity without reducing DAI liquidity. Current debt auctions result in DAI accumulation by participants followed by reduction in liquid supply. And accumulating surplus from operating cashflow would spread the impact over a longer timeframe but would still reduce liquid supply. Instead, Maker could design a new auction mechanism which auctions off MKR for approved collateral assets (ETH/BAT/possibly USDC). This could be structured as a reverse auction, with the initial collateral lot size and minimum bid being set by the system, and buyers accepting progressively less MKR for their collateral assets. After accumulating a pool of collateral assets from minting and auctioning MKR, they would then be locked into a reserve vault, which would be owned and controlled by Maker governance. Any future bad debt in the system could be transferred to the reserve vault initially. This would ensure that DAI holders have a backstop of collateral available for them to claim in case of emergency shutdown. This would also allow Maker governance to delay debt auctions through liquidity crises and down markets, potentially avoiding outsizes MKR dilution events and DAI supply contractions. In the case where the bad debt in the system exceeded 66% of the reserve vault’s collateral value (150% minimum collateralization ratio for ETH), auctioning reserve collateral to remain compliant would cause severe price and liquidity impact. Instead of processing collateral auctions, Maker holders could accumulate and lock additional collateral by auctioning MKR. This would apply some countercyclical price pressure for collateral assets and would not reduce DAI liquidity. When DAI is consistently trading far above the peg, the reserve vault could be tapped by Maker to increase supply. After generating DAI from vaults, Maker could auction the DAI for additional collateral assets. Once increases in market confidence and DAI supply bring the price down to the peg or below, Maker would then begin to auction collateral from the reserve vault to buy back DAI and repay debt. Maker governance may be able to better enforce the peg by using the reserve vault to directly manage supply and demand, and the additional reserve would also protect DAI holders from losses in case of global settlement. Does anyone have any thoughts on this? Potential risks, why this would be a good/bad idea? How much of a lift this would be technically? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.895053475935828
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/03/2020-01:23:48",
                    "content": "I guess the first thing that comes to mind which might be a bit simpler (for the peg breaking up senario) is to have a giant surplus buffer and just inject Dai liquidity when needed, make some %s when the peg is high. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.683333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/banteg",
                    "index": "#3",
                    "likes": "2",
                    "time": "29/03/2020-01:30:19",
                    "content": "I think this proposal delves into rube goldberg territory and sounds too involved in terms of governance. If you think in line of a system CDP, we already have Vow. The system maintains a surplus/debt buffer for exactly the purposes you describe. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/03/2020-17:26:50",
                    "content": "General question.   What is the goal of the above?   Is it to provide DAI liquidity against a reserve of assets?   Wouldn’t then this reserve come under the same liquidation issues that vaults in general would.  Granted one can always backstop with MKR but when it comes to liquidity for market access  PEG management vs. liquidity for auctions those are two entirely different beasts. One other thought here - the idea of auctioning off MKR during a market downturn to provide liquidity to buy other asset as we observed won’t work very well.   Using another DAI deposit facility with slightly different deposit terms and operational mechanics CAN. Generally the whole how does Maker mint DAI to ease liquidity issues IS still a generally unsolved issue as is seen by the fact that USDC vault minting 5M+ DAI (was as high as 7M) really didn’t do much to the PEG.    Some will say the USDC SF is too high  - we need more easing in the SF there and more DAI to be minted.  Yet the higher this goes the higher the risk and toll on the ecosystem from a USDC blacklisting event. The other point here is that Maker, with a clear goal to be a decentralized protocol, operates better if it simply incentivizes other actors to do this kind of management.   During a black-swan event literally using any of the collateral types except something like USDC creates risk hazards for the protocol and in particular DAI holders if the system is ES’d.  USDC itself has a unique risk a number of people in the community have pointed out creates additional risks that in effect devaule DAI (to them) in a ES. Over time with the MIPs I have suggested and will be suggesting hopefully a coherent strategy will emerge regarding the vision I have for securing the system and building confidence starting generally with one of the bigger problems in this ecosystem - DAI liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.720572916666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#5",
                    "likes": "0",
                    "time": "29/03/2020-22:53:05",
                    "content": "Building a healthy DAI surplus is a simpler solution, but I’m not sure if that’s possible in current market conditions without causing further upward pressure on the peg. If Maker had a pool of collateral assets on hand in a downturn, it will not be as urgent to run debt auctions to protect DAI holders, so there wouldn’t be as much strain on DAI liquidity. I’m hoping this would allow vault holders to deleverage their positions and support market operations. From a macroeconomic point of view, it may be impossible to maintain the peg in down markets if there is too much baseline demand for DAI reserves by the system. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.904320987654321
                }
            ]
        }
    ]
}