{
    "poll_list": [
        {
            "title": "Debt Ceiling Adjustments - April 27, 2020",
            "index": "2153",
            "option": "Yes",
            "supporting_mkr": "22,565",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/should-we-increase-the-eth-a-debt-ceiling-by-10-million-in-the-executive-vote-on-24-04-20/2153",
            "title": "Should we increase the ETH-A debt ceiling by $10 million in the executive vote on 24/04/20? ",
            "index": 2153,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "debt-ceiling"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "2",
                    "time": "23/04/2020-17:31:31",
                    "content": "As title. The global debt ceiling should also increase proportionally if this is voted in. Pros:  We are within 2.5 million of the debt ceiling. We are making changes that specifically incentivise the creation of more DAI  (though admittedly not from ETH) We want the price of DAI to drop. The ETH price has been moving upward which tends to drive demand for DAI minted with ETH. The ETH-A SF is set to 0% which is a large incentive to mint DAI from ETH. We are shutting down SCD soon, which may result in more demand for leverage using ETH on MCD.  Cons:  Risk in the case of large ETH crash due to the OSM attack vector.      Yes No     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/action-required-state-of-the-peg/2025/71"
                    ],
                    "GPT-summary": "The author is proposing to increase the ETH-A debt ceiling by $10 million in the executive vote on 24/04/20. The post lists the pros and cons of the proposal. The author is explaining the proposal and a 3rd party is giving constructive criticism of the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Token economics",
                        "Smart contract updates"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.820011337868481
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#2",
                    "likes": "8",
                    "time": "23/04/2020-17:36:57",
                    "content": "As discussed in today’s governance call, the increase in debt ceiling also accommodates the draining of the migration contract. So there is a higher-than-usual likelihood that the ETH debt ceiling gets hit very quickly, potentially as early as after tomorrow’s executive vote. If you are in favor of a debt ceiling increase, what is a desired amount? 10 million has been the norm for prior increases to the debt ceiling in cases like this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#3",
                    "likes": "1",
                    "time": "23/04/2020-18:17:47",
                    "content": "10m sounds good to me, fwiw ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/04/2020-18:35:13",
                    "content": "Do we have any reason to strongly limit growth in dai from eth? Perhaps we should raise it by 20-25 million even to give ourselves some breathing room. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "2",
                    "time": "23/04/2020-18:42:07",
                    "content": "There is a reason not to leave the gap between the ceiling and the current amount too high. If the value of ETH drops by more than 33% in an hour then there is an incentive to mint as much DAI as possible and accept liquidation. This is quite bad for the protocol. The debt ceiling limits the potential severity of this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.114285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#6",
                    "likes": "2",
                    "time": "23/04/2020-19:27:37",
                    "content": "Looks like tomorrow’s executive is gonna be packed with tons of changes!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#7",
                    "likes": "0",
                    "time": "23/04/2020-20:06:46",
                    "content": "MKR holders should choose the amount in the poll. It’s not OK to just throw the value into the executive vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "5",
                    "time": "23/04/2020-20:41:01",
                    "content": "I agree, it would be better to be able to vote on the exact amount with MKR (ideally as a repeatable ‘this is our debt ceiling policy from now on’ rather than as a one-off, and using ranked voting). But realistically, the executive is tomorrow. Is it technically possible to put a on-chain poll in tonight and have it finish tomorrow morning? Yes. Is it warranted? In this case, I don’t think it is. I don’t think it’s warranted in this case because this is a very one-sided issue. I’m willing to go out on a limb and say that there is no valid argument for opposing a 10M raise as against no raise at all. The one con I could think of (the OSM attack vector  mentioned above) is always a risk, and increasing the ceiling by 10M is a relatively small increase in risk that is entirely justified. To be completely frank, I would have been happy if Cyrus or the Smart Contracts team just announced they were including it in the executive. One can argue that rights or freedoms are being trampled on by doing governance in this way, but the thing to ultimately remember is that MKR Holders have the final say. Nothing we say or do here can change that. If MKR Holders HATED the idea of a 10M debt ceiling rise, then they could elect not to vote for the latest executive. I am literally the first person in line to oppose bundling, and I’ll happy spend hours trying to convince anyone who thinks it is a good idea that there are better solutions, but in this case it doesn’t matter, as this change is utterly non-controversial. In conclusion I expected this to be a complete non-issue, the current result of the poll 21 for, and 1 against essentially shows that it is a complete non-issue. To be completely honest, I’m annoyed we spent so much time talking about it in the governance call, and I’m annoyed I had to make this poll. We are literally doing everything we can to increase the amount of DAI in circulation, there is no possible world in which we do a bunch of stuff to incentivise DAI minting and then decide not to increase the debt ceiling on ETH. As to increasing it by more than 10M, well, sure we could have done that, but given the late hour, and the fact that everyone would rather see 10M raise than nothing at all, I think this is fine. Increasing it too heavily does meaningfully increase the OSM attack risk, so it makes sense to aim to keep this ~10-20mil over the current amount. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.967189314750291
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#9",
                    "likes": "1",
                    "time": "23/04/2020-20:45:15",
                    "content": "I agree in principle. But in practice, we need to rethink voting system/portal. We cannot really scale much at this point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#10",
                    "likes": "1",
                    "time": "23/04/2020-20:48:25",
                    "content": "Pretty much agree.  We really need to rethink voting and loath massive bundling going on. I think the 10M bump from 90-100M on ETH-A is least of issues in next executive.  But everyone will be scratching head if next executive doesn’t pass. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#11",
                    "likes": "0",
                    "time": "23/04/2020-20:49:23",
                    "content": "OK, but please let’s do the poll next week for the next ETH DC. BTW, I missed the “Supplimental USDC Stability Fee Adjustment” poll which stated: “This Governance Poll (FAQ) will be active for three days beginning on Wednesday, April 22 at 9 PM UTC.” Well, It’s Apr 23 and the poll is not active anymore. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "5",
                    "time": "23/04/2020-20:53:12",
                    "content": "As discussed in the meeting earlier, we really need to decide a debt ceiling policy for ETH-A rather than having to deal with making the same decision over and over. If you or someone else would like to start a thread about possible debt ceiling policies, that would be fantastic. Regarding the polls, I imagine it’s just a typo, you’d have to talk to the people that put those votes into the portal (I imagine this was either @rich.brown or @cyrus) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#13",
                    "likes": "1",
                    "time": "24/04/2020-05:38:20",
                    "content": "5M would be more fitting IMHO given how last-minute this conversation is, but 10M is also not too bad. If this goes into the exec, the most important this is to communicate it clearly. Make sure it stands out in the vote description and the blog post that this is a last-minute addition that was not polled and added later, and albeit not ideal, the market situation kinda demanded this step. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#14",
                    "likes": "2",
                    "time": "26/04/2020-09:20:13",
                    "content": "Can we vote about the next ETH DC next week so that it can go into executive vote on Friday? Nobody likes last minute decisions. I think the reasonable values are:  decrease it to 90M (that seems a bit dangerous?) leave it as it is (100M) 110M 120M 130M 140M  @rich.brown @cyrus ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#15",
                    "likes": "0",
                    "time": "26/04/2020-17:18:39",
                    "content": "Anyone can create a signalling thread about this. You don’t need to ping Rich or Cyrus. As said before, it would be great to have someone start polling about a repeatable debt ceiling policy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#16",
                    "likes": "0",
                    "time": "26/04/2020-18:08:13",
                    "content": "Have been quite off recently, amazing all the work you guys are doing, ref DC and knowing the importance of increase of dai supply while reducing any potential attacks from having a greater DC than needed, couldn’t we vote on having a DC 10mill>current supply at all times and if needed vote on changing it? It would reduce continuos voting on the matter and focus on other matters like black thursday (analysis, compensation to vault owners) and onboarding new collaterals (a ton of collaterals were proposed that’s amazing!!). SF and DSR I don’t mention since it’s cero so my focus is elsewhere. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.344426406926407
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#17",
                    "likes": "0",
                    "time": "26/04/2020-18:11:32",
                    "content": "Didn’t read this, totally agree ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#18",
                    "likes": "1",
                    "time": "26/04/2020-19:00:38",
                    "content": "An automated DC policy would need to be designed with care to avoid a feedback loop that would contribute to OSM attack vector:  Price of ETH drops > 33% in 1 hr Attacker mints DAI until current supply is within 10MM DAI of DC DC automatically increases to ensure there is at least 10MM of headroom Attacker mints more DAI  To avoid this, the DC calculation could reference the DAI supply from 24-72 hrs in the past. If there was a black swan event, this should leave plenty of time for MKR holders to make adjustments to the DC policy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.783333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#19",
                    "likes": "0",
                    "time": "26/04/2020-19:24:19",
                    "content": "Why do we need a signalling thread if we already pretty much agree on the range? I agree that the DC policy is better but it will probably take some time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#20",
                    "likes": "0",
                    "time": "26/04/2020-19:34:38",
                    "content": "The automated DC policy makes sense. Manually adjusting the DC every week or two does not make sense to me because we are not removing any risk over having it automated in the simplest possible way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#21",
                    "likes": "0",
                    "time": "26/04/2020-19:59:55",
                    "content": "This is a good observation, I agree ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#22",
                    "likes": "2",
                    "time": "26/04/2020-20:04:30",
                    "content": "To be clear, I’m not suggesting the policy be fully automated at this point, more that we signal an intention that the risk or smart contracts teams can use as a mandate to include debt ceiling adjustments in weekly executives when certain conditions are met. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#23",
                    "likes": "2",
                    "time": "26/04/2020-20:54:27",
                    "content": "This sounds good, I agree that this would be a reasonable step we can take now to improve efficiency. My initial thoughts on the criteria for the risk or smart contract domain teams to add a DC increase or decrease directly to an executive vote:     Criteria DC Increase DC Decrease     DAI Price Trading above P price for preceding T time Trading below P price for preceding T time   Current Supply vs.  Current DC DAI supply is less than X million DAI or X percent below the DC DAI supply is more than X million DAI or X percent below the DC   Change in DAI Supply DAI supply has increased by at least A amount over the preceding T time DAI supply has decreased by at least A amount over the preceding T time   Proposed DC New proposed DC is less than Y preauthorized limit amount New proposed DC is greater than current DAI supply    A few other opinions:  We should limit this to adjustments for DAI from ETH and the global debt ceiling before including BAT, USDC, or new collateral types (as DC adjustments for these collateral types are potentially more controversial) This only applies to normal course of operations, emergency adjustments (definition needed) need not adhere to these guidelines  Does this framework seem reasonable? Any other criteria that should be added or removed from the list above? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.386214360352292
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#24",
                    "likes": "1",
                    "time": "26/04/2020-22:38:29",
                    "content": "I think we should definitely automate the process. For example, raise/lower the eth dai debt ceiling every 48 hours so it is 10% above the current dai supply rounded to the nearest 5 or 10 milion. This way the dai supply could grow more continuously. I agree that this should only be implemented for eth in the foreseeable future. In the meantime, since automation will take some time, we should vote along the lines of some fixed policy like this, with regular votes/polling as we do with the stability fees. As mkr policy votes are starting to grow to a critical level of complexity though, with additional collateral in the works as well, I think we need to start automating away processes that we have a good consensus on, and saving government votes for novel circumstances. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.590909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#25",
                    "likes": "0",
                    "time": "27/04/2020-11:54:52",
                    "content": "This looks like a great start, maybe it would be better to post it in a fresh thread though, and focus the discussion there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#26",
                    "likes": "1",
                    "time": "27/04/2020-16:43:12",
                    "content": "I see that only one person here decides what the DC should be. Why can’t we have a multiple choice poll instead of Yes/No? @rich.brown @cyrus ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#27",
                    "likes": "0",
                    "time": "05/10/2020-15:45:25",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2294"
}