{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/bis-maker-and-rigging-for-sailing-closer-to-the-wind/12228",
            "title": "BIS, Maker and rigging for sailing closer to the wind ",
            "index": 12228,
            "category": [
                "Updates"
            ],
            "tags": [
                "strategy",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#1",
                    "likes": "17",
                    "time": "15/12/2021-20:28:35",
                    "content": " BIS: Setting wind direction?  The Bank of International Settlements (BIS) is the central bankers’ bank (owned by 63 central banks). So when it releases research and statements, it makes sense to listen. It tells you where the winds of banking and related regulation are blowing. On the 6th of December 2021, the BIS released its Quarterly Review    bis.org    BIS Quarterly Review, December 2021 BIS Quarterly Review for December 2021 - Widening the regulatory circle for non-bank financial firms      In this Quarterly Review, DeFi and in fact specifically Maker, features. If you read this section, it looks like MakerDAO should be rigging for sailing close to the wind. The BIS review provides some good starting points for how to rig for upwind sailing. Many of which the community is already contemplating and developing practical proposals for how to handle. I will here try and set out the BIS concerns and how Maker might be able to address them. As mentioned many of the positions are not new, but what I hope to argue for here is an acceleration of these efforts to actually have us rigged and ready as these winds might start increasing in force. Unsurprisingly you will find it dovetails with my previous post on RWA strategy  BIS Concerns The general overarching concern of BIS is the size and scope of the non-bank financial intermediaries (NBFI) system, of which DeFi/CeFi is considered a card carrying member, and how the NBFI system can respond to the “terrible twins” of liquidity and solvency disasters. The NBFI system is today estimated to carry close to 50% of the financial assets in the global financial system. BIS research found many NBFI participants to have material liquidity mismatches (i.e. on-demand investors funding illiquid investments) and substantial leverage (i.e. actual solvency low). But even worse, the NBFI system is generally found to be “dark” (i.e. limited reporting, disclosure etc) so there is limited understanding of neither the size of these issues, nor the risk management engaged in by the NBFI system to mitigate these issues. And of course the NBFI system is broadly speaking unregulated, and so it is hard to force any kind of oversight and discipline onto the system. This largely means we do not know, in relevant detail, if the NBFI sector could cause a contagion across the full financial system, what could be the drivers of said contagion or how likely such a contagion is. Nor do we know how policy decisions at central bank level will carry through the NBFI system. DeFi systems, and particularly stable-coins, are then by the BIS described to give cause for further concerns;   KYC/AML concerns. I.e. preventing bad actors from making use of the crypto-currency system.   Extreme “terrible twin’s” concerns: very limited shock-absorbers, highly volatile assets, extreme illiquidity mismatches, highly interconnected systems, run-risks. I.e. worry that even smaller extreme events might tip the scales and cause large-scale system failure within the crypto-currency world.   Spill-over of crypto contagion. To date the crypto markets have been rather decoupled from the traditional financial markets - and contagions did not necessarily travel between them. As particularly stablecoins are connecting into the real-world, can the above crypto-currency events spill out into the real world and create a contagion in certain markets? The stablecoin short-term credit market backing is highlighted as a specific key concern - as outlined here by Fitch: Stablecoins1 Stablecoin2   Centralization, collusion and manipulation. BIS points to evidence in the crypto markets of limited real decentralization: governance tokens distribution and large financial flows appear to be controlled by a limited set of operators, who can collude and manipulate the markets.    BIS Policy responses recommendation BIS provides a relatively straight-forward set of recommendations: First line of policy response is an increase in reporting, oversight and disclosures to ensure the central banks, the regulators and the overall financial systems can understand the state of affairs in the NBFI market (including DeFi market). Second line would then be to give the oversight “teeth” in respect of requirements, ratios, etc. The purpose of this response is to ensure, basically, that pathways of potential contagion are to be better understood and the NBFI sector ‘upgrades’ its risk management and buffer size/systems to be able to survive countercyclical economy movements leading to liquidity and solvency pressures. In short, ensure the NBFI attains a reasonable level of financial stability within the overall global financial system. For DeFi, there is a specific recommendation to consider identifying the key holders of the governance tokens/large flows and use this as a pivotal point of control to enforce reporting, disclosure, oversight and ultimate regulatory requirements and compliance. Also for DeFi, BIS suggests regulators to apply a ‘same risk, same rule’ principle for regulation of DeFi protocols facing comparable risks to established TradFi institutions. So now we somewhat know what winds are blowing. Certainly the local response from the various central banks and financial regulators are going to be different, but they are pretty much all going to press in this direction. It would be the best possible assumption to build a plan upon. I encourage the community to read, at least, the BIS section on DeFi and make their own conclusions.  Rigging MakerDAO for sailing close to the wind  800×533 79.9 KB  The logic I will apply here is this:   If Maker has taken these concerns seriously and to heart in actual actions, then the pressure and need for urgent regulatory responses decreases.   Should a regulatory response appear, it will be well aligned with an action plan based upon above concerns.   Such an early, self-imposed, alignment might easily, in fact, be a competitive advantage - even in the short-term. It should increase trust in the staying power of the Maker Protocol.   As mentioned, I believe the Maker Community is already discussing, and operationalizing, around many of the concerns mentioned by the BIS. None of them can truly come as surprises, I’d venture. So here’s my rigging list:  1/ Lights On! The anchor-point for any “BIS concern alignment” is increased transparency, disclosures and reporting. It is exceptionally important. I know everything the Maker protocol does is already transparent, but there is quite a large job left to turn all this raw data into meaningful reporting and insights that can be understood by outsiders and somewhat adhere to more traditional reporting, risk management and disclosure standards. I certainly support a Strategic Finance Core Unit, as already proposed, to take upon themselves to start developing such reporting and analysis programs ASAP. It would be my guess that when undertaking this sort of task, the core unit would also be a guiding light for finding areas in which in fact even further transparency should be pursued. And I think they might just find a few. We should show the TradFi world that Maker has nothing to hide.  2/ Integrated Risk Management I hope my last RWA post made my views on this clear in a fairly detailed manner, so I won’t repeat it. I do believe in an first principle-based, integrated and deep risk management approach linked from balance sheet, cash-flows, asset specific risks and all the way back to systemic risks and risk buffer budgets. I believe an acceleration of this process would not be a bad idea - particularly as RWA is further introduced into the asset and liability mix. We need to convince the world that Maker, indeed, has the risk management toolset and appropriate mechanisms - and ultimately buffers - to weather all storms. Showing that the terrible twins can’t kill us.  3/ Connecting to TradFi: respectfully, carefully and gainfully I think actually most central banks and regulators are for innovation - and are quite excited about the potential in many of the financial elementals developing in the crypto world - and do want to give the industry a lot of leeway to see some of these innovations come to general economic productive fruition - even through a few hairraising bumps in the road. But I am also willing to bet you a silver dollar that the day Maker’s connectivity with TradFi is considered to be potentially destabilizing or market distorting to the TradFi world, the regulators’ hammer will come down. Now we did actually think about this quite a bit when we designed Monetalis. We specifically set out to build a biz model, and select a market, in which we knew we could build a large stack of positive arguments for adding Maker capital to it. So large, in fact, that no regulator, market participants or other market stakeholders could reasonably oppose the entry into the market of Maker Capital on even large scale. Let me explain the principles we got from that exercise: a) Maker Capital aligned with local Government Policy direction for added capital to the economy All Governments want more capital allocated towards greening the economy and combating climate change. Focusing capital towards this theme brings a lot of starting goodwill in all the right places. I suppose one could select other themes, probably within the ESG spectrum, that would equally align with government policy, but this was the alignment we chose as it fit with our personal views as well as with of course the Maker community. b) No distortion of market pricing or displacing of market participants from Maker Capital Deployment We generally want the key market participants in the selected target market to not see us as distorting the market’s dynamics, credit pricing or displacing any of its long-term participants. Such views always get to the ears of the regulators and never lead to anything positive. This is why we selected a market (UK SME financing) that is chronically underfunded (i.e. no realistic displacement of existing players possible and no need to undercut pricing for market participation). Also we wanted a market in which credit pricing discipline was intact - i.e the general current chase for yield had not taken hold in risk pricing - because our entry could otherwise be seen as exacerbating an already irresponsible downward risk price spiral. Again, the UK SME market stands well in this regard. Lastly, an underfunded market, also ensures that demand is more flexible and positive about accepting a new source of capital This, in sum, creates an environment, where the current market participants will find very limited reason for complaints about any large-scale Maker Capital deployment. c) Self-evident real economy productive consequences of Maker Capital We want to be able to point to real positive economic consequences of our capital deployment to aid our case that we are a positive force in the economy. Fx: we won’t participate in payday loans or heavy interest, high risk credit card, but happily fund a changing bus fleet moving from diesel to electrical - or new the transitioning of office buildings into net-zero etc etc. d) Deploy in market environments with a right-sized regulatory scheme No matter which way we set ourselves up legally, at the end of the chain sits a DAO with a crypto collateralization engine. The stricter a TradFi market’s (or instruments) licensing, disclosures, KYC/AML, rating and regulatory framework is, the harder it will be to deploy Maker Capital without substantive potential legal and regulatory risks - and with potential very broad adverse reactions and consequences from regulators. Until such time that the various regulatory situations can accommodate DAO’s positively, generally the more limited the regulatory requirements are for participants in the credit market, the better. Only this way can Maker stay firmly away from entering grey areas that could cause turning both market participants as well as regulators against Maker. As you probably have already guessed, the UK SME lending market is only lightly regulated and easy to fit into with even the plainest of company structures. e) Build loosely coupled TradFi and DeFi elements I think most Maker favoured off-chain legal structures today recognizes this pattern. Basically you need a TradFi structure that gives comfort to the TradFi market participants and regulators - and be designed for permanence and stability - and then a separate DeFi integration component with flexibility in it to change as potential regulations change. Again done to keep the peace with TradFi participants. f) Contained Systemic risk coupling This refers to any contagion spill-overs. So we have to ask ourselves the question: what happens if we need to exit our position very fast for liquidity? And ensure that such action won’t send any shockwaves through the TradFi system. This really is a case-by-case analysis. In the case of Monetalis, it would mean having a fire-sale of a set of diversified UK SME lending portfolios. Firstly it would have zero effect on the end-borrower or lenders Monetalis has worked with, secondly it would have no particular overarching price effect on the credit market - it would only mean that a few players might get some very nice deals for a set of portfolios - there would be no market shocks or movements. Important here to note that Monetalis works in the private credit market - not the listed, liquid credit market. This means any sentiment-based pricing or daily liquidity squeeze pricing movements that might be accompanying a large disposal in a listed, liquid market at scale, and potentially cause havock would not appear as an effect of a quick disposal in the private market. In short, we feel comfortable that even large-scale Maker Capital deployment into our market will not cause a crypto contagion to spill-over to TradFi. Now we need to reasonably also look at contagion the other way round: can a TradFi contagion spill-over from our position and into Maker? Again I can only truly speak to the Monetalis choices. Our first choice was to ensure our model was not connected to any complex instruments or public markets with daily liquidity movements or sentiment pricing - as the interconnectedness in today’s TradFi markets are such that you sincerely have no idea how or from where a domino effect could appear - and how fast it could move prices and liquidity downwards - i.e. we focused on a private market with reasonably simple instruments and controls. Our second choice was then to ultimately connect to a diversified basket of real assets (i.e. all lending is secured against an asset such as real estate, vehicles, machinery etc.) - i.e. the principal contagion we are exposed to is very substantive (must wipe-out junior, reserves and other guarantees) and prolonged drop (as this is a private market it is less volatile and only long-term responsive) in real asset values leading to company failures and asset liquidations - and potentially lead to an under-collateralization of our vault. We cannot, strictly speaking, take this risk away, but by diversifying in terms of industry exposure, real asset backing, and stacking a substantive amount of capital and guarantees in front of Maker capital, you can get quite far - particularly when focused on cross-cyclical stable businesses (i.e. financing electrical buses used by the cities for public bus routes). Importantly the potential contagion we are talking about here is one of solvency (value) - not liquidity - and any such contagion would come slowly (i.e. the value of the portfolio won’t drop 50% over a week) in contrast to liquidity contagions. This means, all in all, in our view, we sit with a generally comfortable systemic risk exposure from the TradFi world - very unlikely to travel with any effect into the crypto/Maker world. Being deliberate about this analysis for all credit partnerships/operations Maker starts is key to staying on the right side of the winds blowing from BIS - and actually also, in my view, good risk management practice for Maker. g) Prefer a Coopetition Market Generally one would prefer a TradFi market where the players are, of course, ultimately competing, but have a fairly large degree of cooperation on growing, advancing and disciplining the market. It is a friendlier and more stable environment to work with and one that will lead to less challenges coming from other market players and/or regulators. There is a tradition for syndication and general cooperation in our chosen market. I hope you can see that playing by these rules will ensure Makers’ profile as a value adding TradFi participant and generally a “force for good” in the economy.  4/ KYC/AML/Compliance Certainly, as Maker projects its financials into the TradFi world, of course the actions in the TradFi world must meet whatever KYC/AML/Compliance requirements exist. In the crypto world I believe the general principle is that KYC/AML and other compliance checks happen at entry/exit points between the DeFi and TradFi worlds. I have no good ideas for how Maker can sensibly push these principles further. I leave this for the community to consider.  5/ Centralization and Manipulation I believe there is a lot of work ongoing in respect of the MKR token, delegate voting, Sagittarius engine thinking, “Whale” actions and monitoring, etc. All I can suggest here is that these BIS concerns are considered as the above work evolves. – So I recognize I haven’t helped much on 4 and 5, but I do think just getting 1, 2 and 3 right will allow Maker to sail quite close to the winds blowing from regulators and central banks and ensure Maker doesn’t end up “in irons” (the nautical term!). I hope that brings some food for thought to the community. ",
                    "links": [
                        "https://www.bis.org/publ/qtrpdf/r_qt2112.htm",
                        "https://forum.makerdao.com/t/real-world-sandbox-final-deliverable-for-consultation-round/11915/7",
                        "https://www.fitchratings.com/research/fund-asset-managers/stablecoins-could-pose-new-short-term-credit-market-risks-01-07-2021",
                        "https://www.fitchratings.com/research/fund-asset-managers/stablecoin-regulation-growth-may-affect-securities-markets-18-10-2021",
                        "https://forum.makerdao.com/t/real-world-sandbox-final-deliverable-for-consultation-round/11915/7",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697/12",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-9-16-2021/12240"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.413104525006121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#2",
                    "likes": "5",
                    "time": "16/12/2021-22:20:57",
                    "content": "thanks for posting. we live in interesting times. I continue to think that Maker should have a Public Policy CU that proactively engages on key policy issues in important geographies such as the EU, US, UK…  We are somewhat behind the curve on this.  For example, a16z has already assembled an impressive Policy group including one gent who was President Biden’s cheif of staff when Biden was a Senator.  And centralized crypto is already aggressively playing the policy game and isnt well aligned with DeFi. Regarding stable coin regulations its more a question of when than if. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.880165289256198
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#3",
                    "likes": "4",
                    "time": "19/12/2021-09:43:31",
                    "content": "@Eumenes I certainly agree. Let me add this: There is an interview with Benoit Caeure today in the FT. He was the chief of BIS Innovation Hub - i.e. the person responsible for reviewing DeFi. And as such certainly knows what is in the minds of the global regulators on this. (he is moving to a senior regulatory position in France now) He mentions that this year was a wake-up call for the regulators on DeFi with a lot of intensified work by regulators done these past months - in fact he expects a global regulatory framework for crypto will be released globally over 2022 - particularly focused on stablecoins. Here’s a few key quotes from the FT interview:  …Decentralised finance, or DeFi as it is known.“opens new avenues…for interconnectedness with traditional finacne which creates potential new forms of systemic risk” that regulators can no longer ignore, Caeure said, pointing out that DeFi connected with both stablecoins, widely used as a settlement instrument on DeFi platforms, and traditional finance. “These [new] services will be competing with traditional finance, and money will flow in and out from one universe to another. This creates a compelling reason to start a discussion on global principles for crypto regulation.”…   …“The risk in 2022 is that large jurisdictions [like] Europe, the UK, the US, China, keep moving on but along different tracks and produce a system which is globally inconsistent”…“That’s a risk that should be avoided and there’s still time to avoid it”, he added, pointing out that different approaches would create the opportunity for “regulatory arbitrage”…  The Financial Stability Board under BIS is mentioned as the most likely forum for agreeing and implementing this global framework over 2022. He also mentions that turning this framework into consistent global regulations might take 2 to 3 years. He also clear mentions that he expects the frameworked developed over next year will clearly determine whether stablecoins are to be considered electronic money, a money-market fund or a security. And provide clarity on how services can interact with stablecoins and be regulated based upon the services they provide. So to your point - key decisions are being made at a rapid pace on regulation on DeFi - and particularly stablecoins. Key pieces are soldifying. We have, in my simple view, two basic things we can, and should do, now:   Engage in the global conversation on this - you suggest - this make very very good sense to get very fast. Maker stands out as a unique stablecoin model and should make sure the case for this is heard and not get caught in a more general stablecoin or DAO regulatory frame that may not be appropriate for our situation.   Show, in action, that Maker is a force for good in connecting DeFi and TradFi. Maker needs, very fast, large scale deployments in TradFi (next 6 months, in fact, in my view, as these global frameworks are being put up) that show Maker from its absolute best side: i.e. ensuring things such as the deployments are supporting Climate Change actions, that TradFi markets are entered into appropriately, that deployments are acting as good global citizen, that they are not distorting markets, showing the protocol is operating under a full scale mature risk managment system and reporting with clarity on all levels of risk - from simple credit risk to systemic impacts, etc etc. Showing that we are entirely capable of self-regulation and do not need deep and dramatic containment.   I think efforts are moving down these paths, but, as I suggested in the first post, ACCELERATION is of utmost importance on these efforts. We are moving too slowly in my view. The TradFi world, regulators etc will roll over us and determine our future - very likely over 2022 - if we don’t engage and get much faster moving on actual sizable TradFi deployments. Showing, in action, our intentions of taking up a positive and mature role in the global financial system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.627684433621933
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "2",
                    "time": "19/12/2021-19:30:33",
                    "content": "Thanks for posting the interview. Again fully agreed. We need someone to run point on regulatory/policy issues ASAP… I wonder if it is a fulltime role at this point?  Much of the early work will be sketching out the current regulatory movementd and networking with key players in DeFi, CentralFi, Tradfi, VCs, politicians, potential lobbyists… I think a16z could certainly help Maker get up to speed quickly given their policy heavy hitters. Longer term Maker needs serious outreach to key players.  Elizabeth Warren should be a natural ally given Maker’s Green and ESG focus.  I think the financial inclusion and Green issues will really appeal to progressives ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.129464285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#6",
                    "likes": "0",
                    "time": "21/12/2021-08:13:05",
                    "content": "HI @PaperImperium , This is excellent! Based upon your ‘front-seat’ conversations with these important ‘policy impacting persons’, what do you think Maker should do? Or could do better? etc? Do you think a Policy CU would be valuable or are there better ways for the Maker community add value to these discussions etc.? I am certain the community would very much welcome your insights on all this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.845238095238097
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#8",
                    "likes": "0",
                    "time": "22/12/2021-11:56:14",
                    "content": "    Eumenes:  Again fully agreed. We need someone to run point on regulatory/policy issues ASAP…   I believe this is an area where we probably do not have to re-invent the wheel. In traditional commercial banking, there would a role in Risk & Regulatory Affairs, most commonly sitting under Operational Risk & Compliance from my experience. The role and the skillsets required for such a “hat” is very well defined in commercial banking. A CU managing those affairs would certainly have a significant role to play in the DAO, particularly if operating across jurisdictions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.577976190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/03/2022-11:57:01",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}