{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-190-thursday-may-12-at-17-00-utc/15106",
            "title": "Governance and Risk #190 - Thursday, May 12 at 17:00 UTC ",
            "index": 15106,
            "category": [
                "Discontinued Categories",
                "Governance and Risk Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "1",
                    "time": "11/05/2022-16:03:22",
                    "content": " 2225×512 88.6 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only and should not be relied upon as legal, business, investment, financial, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only and do not constitute any recommendation for any action or an offer to provide investment, financial, or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478; please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-05-12T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Poll + Executive Status  @MIP-Editors - MIPs Update  @Artem_Gordon - Forum at a Glance   Initiative Updates  Unified Auctions UI and Auction Keeper demo presentation by Sidestream Auction Services  Recorded video available here.  Selected Discussions   DAI Analysis & Recent Market Events DAI Supply ALM Analysis Risk Analysis Preventative Methods   Other Discussions and General Q&A  General Q&A Ask us stuff  Anonymous question box  ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1sQ9Cef9Zn24HnMAeYveJ0vbeBdfsFgOV0dnMDwjtdTk/edit?usp=sharing",
                        "https://www.veed.io/view/9aac356e-4f0c-406e-8148-83758b3b05f1",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.383333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "0",
                    "time": "11/05/2022-16:14:02",
                    "content": " Episode 190: May 12, 2022 | Semi-transcription Summary  Agenda   00:03: Introduction  02:11: Votes and Polls  03:27: MIPs Update  08:19: Forum at a Glance  18:32: Initiatives Update: Unified Auctions & Auction Keeper Demo  38:54: Discussion: Asset, Liabilities, and Liquidity Analysis  01:11:08: Open Discussion  01:31:03: Conclusion   Video Link  Introduction  Agenda and Preamble  Payton Rose 00:03  Welcome to the 190 Governance and Risk call here at MakerDAO. My name is Payton, I go by Prose11 online, and I am one of the Governance facilitators. We are here at our weekly call, and we discuss things relevant to what’s going on in the protocol: risks we are facing, current votes, and initiatives. We will go over a couple of the ground rules. As you might have noticed, this call is being recorded. We encourage open participation; please ask questions, and give comments. A couple of facilitation tools would help me if you are attending live. Number one is the raise hand feature on Zoom. If you have something you would like to add to the conversation: raise your hand, and I can work with you in the next moment. If you are unable or unwilling to hop on the mic, you can utilize the chat. Regarding the agenda, as usual, we will start with our Governance round-up going over the votes and updates on the Maker improvement proposals and what has been happening in our forum. Today, we will talk about the demand issue for Dai (main topic), the current state of the market, and how that affects it.   General Updates  Votes  Payton Rose 02:11 Polls:  2 Ongoing Greenlight Polls (Voting ends May 16th)  ATDC (ATD Combustors) IPCL (India Power Green Bonds)   5 Ongoing Ratification Polls - To be covered in MIPs  Executive:  Recognized Delegate Payments, Lowering WBTC Stability Fees, and Onboarding wstETH-B, 64,700 MKR Supporting Next Week’s Expected Content  Foundational L2 Work Core Unit MKR Transfer     MIPs  Gala 03:27  1479×834 34.9 KB   This is Gala from GovAlpha; I am presenting MIPS for this week. On Monday, we had five proposals that entered the main governance cycle. We can take a look at the votes so far. Yes, it is the leading option at 100% for all proposals.   2722×1482 126 KB   2584×1496 183 KB   2214×1208 179 KB   We have one Core Unit on-boarding for lending oversight Core Unit. Love intends to support the DAO in its evolution to become the central pillar of DeFi by facilitating the sustainable onboarding of 10s or hundreds of billions of more complex use cases. One facilitator on the on-boarding proposal for a second note for the minify security Core Unit for facilitator on-boarding and off-boarding. For the data insights CU, there is a voluntary facilitator off-boarding from Thomas, and he hopes to be succeeded by Taddeo, for whom we have a facilitator or on-boarding proposal.   2556×1128 119 KB   We have two amendments going on. One that has been going on for a while is the Core Unit Offboarding Process Amendment: we are still working on that, and hopefully, we will be posting on the forum soon the updated version, and there is one amendment to MIP16. These amendments are just the governance of the weekly governance cycle, so the governance Cadence from executive proposals posted on Friday to this posted on Wednesday.   2516×1380 154 KB   These budgets use the new yet-to-be ratified Core Unit budget process.   2358×1364 177 KB   Finally, Maker Shire Hathaway is a special purpose fund that intends to experiment with various yield generation strategies. The ratification polls that are up will post in less than two weeks on May 23. Please vote if you have not done so yet. For the governance cycle, remember that the formal submission window opens on June 6.   Forum at a Glance  Artem Gordon 08:19 Post: Forum at a Glance: May 5th - 11th, 2022 Video: Forum at a Glance  Initiatives Update  Unified Auctions  Lucas 18:32  I am happy to give a brief demo on the current state of the Unified auctions Dai. It was not planned to have these recent downturns of the markets for us to give an update. If you want to frame it as a good or sad coincidence, I would say it. Another quick disclaimer, this is a pre-recorded walkthrough. Please hold your questions for the end. What you can see here is our landing page. During our work on the auctions, we figured that there are many tools and services related to the auctions, and all provide relevant information. We started to collect and list them here on this page so that this page might become an entry point to the broad realm of options in the future. The list is filtered based on the auction type you are selecting here at the top; I have chosen that one since we focused our work on the collateral auctions. Without further due, I want to jump directly into the collateral auctions portal that we built. We are building with a focus on accessibility in terms of the UI itself and our codebase. One of the design decisions that we took back in the day was to have this narration base flow that provides relevant context and allows the user to read basically from top to bottom, to understand what is going on and what this whole thing is about. The experienced user can always switch to the expert mode via the toggle at the top, hiding all of this extra context information. I will stick to the explanation base mode. For now, a core piece of this page is the table with active options that allow us to participate or interact with one particular option. Don’t be confused by all of these options down here that need to restart. This is because I am currently on Gurley for this demo purpose. One of the principles in our building process is never to leave the user in the dark. A small example is this small indicator here at the top of the table informing when the table was updated last since we research auction information every 30 seconds. Now let’s look at one particular auction: it is provided by this auction page. Here at the top, you have a table with all relevant auction information: when the auction ends, the auction amount, the current auction price, also this tiny spinner here that gives them information on when the next price drop is going to happen and what the next price struggle will be. Then you have a couple of more information on this particular option. I do not want to go into detail about each row right now. The important part here is that the user can now decide how to interact with this option. We provide both ways, either bringing our funds to the table and bidding on the collateral with our own Dai or via instant settling without any capital requirements, using the flash loan-based option participation.  22:44  This is the flow that we introduced first. Nevertheless, I want to quickly update the improvements and adjustments we made to this one. We optimized this final transaction page to provide as much information as possible to the user and also for the user to make an informed decision about the auction participation. Again, we want to prevent leaving the user in the dark about what is happening. Let’s quickly look at some of the information displayed at the top table. Again, you can see this price spinner that we have seen on the previous page already; then, we just played the price on UniSwap. Since we are finally aiming to exploit an arbitrage opportunity once the auction price falls below market price. Now don’t be confused about this very low eath price: this is because I am using test origin on girly for demo purposes. We also display that it will likely not be profitable at all for the estimated profitability time. Usually, we would show a timer that indicates when the auction is turning profitable, meaning when the auction price will fall below the market price. We calculate that based on the step and cap parameter from the Abacus contract for this collateral type. There are the important indicators of transaction cross profit and net profit, meaning the profit after transaction fees. Here we display the combined transaction fees. This means that we consider whether the required authorization steps for the wallet have been made already. If not, they are included together with the fees for the actual execution at the end of the course. Speaking of the general steps that the user needs to make to execute the final auction transaction, we recently introduced this panel-based approach that you can see here. This approach wants to guide the user throughout the flow and give hints on what step needs to be executed next and what is currently preventing auction participation. As a simple example, if I now disconnect a wallet here, you can see that this panel is expanded, hinting to the user that no wallet is connected currently. If I reconnect my wallet, everything looks good. Same for the two authorization transactions that are needed. They have been executed for this wallet in the past, so they are checked. If one of the steps is missed, this panel would be extended with another alert notification to the user that he needs to authorize. First, to finally execute the automation section. We are currently showing the only alert that the transaction gross profit is negative. This is also why we prevent auction execution. The next execution with a negative transaction cross profit would result in a reverted error. Now let’s turn to the previous page and look at the other flow to participate in auctions. Bidding on an auction with old Dai funds was the feature that we lacked to have feature parity with the old liquidation portal. Now that we have introduced this feature, the old liquidation portal is deprecated, and it has already redirected to the unified options UI that we can see here. This bidding with its own Dai flow follows a similar design pattern to the flash loan-based auction participation flow. However, of course, we have different interaction possibilities for the user. Again, at the top, we have general information on the auction. And then, the most important interaction piece is handled via this input field here, where the user can specify the amount in Dai he wants to bid on the collateral. The maximum amount to bid is set via the temporal match parameter, which is the debt that needs to be recovered by this auction. The user can always set it by clicking this link. It is also the bid amount prefilled by default, but then in this user, I can specify an amount I want to bid. I will get an indication of the amount to receive of the collateral. We also cover different edge cases via this input field. There is a minimum leftover based on the trust parameter, meaning that the user cannot specify a bid amount that is slightly under the maximum bid because then the auction would result in a leftover that is lower than the minimum leftover. It would be an option that is no longer attractive; we can try that out, specifying the input amount here to 52k. We also display in this tooltip here that this value can only be less than the maximum bid minus the minimum leftover, which is the 47.5k indicated here or the maximum bid. I will go with the maximum bid, for now, to look at the other elements of this flow. Again, we have our panel-based approach that guides the user throughout the flow, and it also checks whether all of the pre-requirements to add finally bid on the auction are successfully fulfilled.  28:54  This is the case for the wallet at hand. It also covers the two authorization steps we know from the flesh loan-based auction participation. An additional prerequisite here is a sufficient Dai amount deposited, which is covered via a panel. You can see the figures Dai amount in the wallet attend the amount of Dai that is already deposited to the VAT. In this case, it is enough to cover the specified bit. Otherwise, the user would be notified by a red message saying that more Dai needs to be deposited first to place the bid. With the whole interaction with the vat, depositing and withdrawing Dai to and from the VAT is facilitated via the pop-up that you can see here. Same approach down here with the panel-based design, a user can specify the amount that needs to be deposited. Suppose this amount exceeds the amount of Dai available in the wallet. In that case, depositing is disabled, and the user is notified why that is, in this case, there is no sufficient amount of Dai present in the connected wallet to do this transaction. Same for the withdrawal. The last part of the whole flow is: once the user has placed a successful bid and obtains the collateral via this auction, the user can withdraw this collateral from the bat to the wallet via the button. In the case attend, I have participated with this wallet in previous options. For example, I would now be able to withdraw 1.05 Eth from the vat to the wallet at hand. As a last remark, a user can always manage Dai in the vat by the pop-up he has chosen; it’s also accessible via the header. There is no reliance on an active auction. This can be done at any time by the user. The same holds for the withdrawal of collaterals. From the right to the wallet, it’s facilitated via the pop-up that you can see here, where the user can withdraw collateral. Still, the user can also pre-authorize certain collateral types via this pop-up. For example, to use low gas prices, when there is no active auction, you might wonder why we display here certain collateral types that are already onboarded. This is true, but we are not hard coding the collateral types but fetching them automatically from the chain block contract. This is for an overview of the current state of the Unified auctions UI. Feel free to give feedback. It is always welcome. I hope you’re still sticking with me because, as the last agenda point, I quickly want to jump into our repository and give you a sneak peek at the keeper implementation that we have done. Our keeper implementation can be found within our open source repository unified origins UI. The main idea from the beginning was to have this modular approach with a folder that contains the core logic and can serve both the UI that I just demonstrated and the keeper implementation, which can be found in the bot folder. I will not spin up the keeper now as part of this demo. Instead, I will refer to the readme of this folder, where the information on how to set up the bot and what environment variables can be set to configure the bot can be found. To quickly walkthrough: we are currently only supporting a project ID but actively working on the support for custom RPC URLs. Then one needs to specify the Ethereum network the bot will run on. One can whitelist certain collateral types. An operator can also specify the max priority fee that is passed the refreshing interval for the bots to fetch the auctions. Then, besides a private key, an operator also has to specify the minimum net profit of an auction before the keeper will bid on it. Thanks for listening. Now is the end of this demo. I hope you enjoyed it a little bit. Feedback is welcome as always.  34:08  Prose11: I see a question in the chat: Are we tracking UI usage now in the market? Asking if we can tell when users are using the UI to participate?  Lucas: Yes. We did fetch all of the events, for example, that happened this week to give some numbers on that. There were 200-250 auctions taken. As a proxy, we investigated which of these events used the colleague contracts. The number was 47, which is the proxy you can work with. Since the UI uses this call the contract, our keeper uses it, and also the auction demo keeper, this is an approximation of the actual usage: it’s not limited, as I said, to the UI itself, but it could also be that the keeper was used or the auction demo keeper. That is the closest number that we have right now.   In this folder that you could see during the demo, there are also Twitter bots that we have placed. We are tweeting about every auction that is started, and of course, we real-world grow.   Discussion  Asset and Liability Management  Sebastien Derivaux 39:25  High Level Perspective960×540 20.9 KB   This is an update of a post I made on the Forum about the evolution of stablecoin liquidity in MakerDAO to see what’s going on since the 15th of February when we were almost up to 10$B DAI.  Why is it good to have liquidity? Because that’s one way to make sure that 1DAI equals 1 dollar. That is the best tool we have to defend the DAI, so we don’t get it below 1 dollar. Obviously, it’s the same when DAI goes up above 1 dollar, but that’s not an issue because there are always people that can deposit USDC in the PSM. There are other tools, but this one is the best to defend the DAI. We started in a situation where we had 6B of stablecoin liquidity in mid-February, and that was a lot. That is not specifically good because it means that all those USDC, GUSD, and USDP are not doing anything and not generating revenues, which doesn’t allow us to increase the DSR or burn some MKR. It wasn’t a perfect situation, but it was very safe. Since then, some people have repaid loans; and when you are repaying a loan by sourcing new DAI, you are increasing the PSM because, if you repay the loan, the DAI’s demand usually stays the same. Repaying your loan means that someone else has to deposit one USDC in the PSM. That resulted in a 1B positive effect on the liquidity, but that wasn’t much compared to all the other red effects, being Dex LP the biggest. Then, we have bridges and DAIs that were used on L2 or side-chains. Landing protocols are also decreasing the usage of DAI for many reasons, but maybe because we are in a bear market, there is less demand to borrow. Today, we are at just below 3B of liquidity, which is a lot since we have only 6B DAI issued. This is a very good number, and there is no stress on this side.   Main Borrowers Evolution960×540 36 KB    Here, you can also see the evolution of the VIP borrowers that we track because we know their addresses. Many Nexo and Celsius and 7-Farmer have reduced their loans and borrowings from MakerDAO, being Gnosis the only one that has increased. While 7-Farmer is using DAI and keeping those to do some yield-farming activities, Nexo and Celsius are lending US dollars to their clients, so when they repay their loans, they are sourcing DAI into the market and increasing the PSM.   Dexes - Curve Specific Situation960×540 29.2 KB    This third slide shows the amount of each asset owned by the Curve 3pool. On June 1st of this year, there was almost 6B of assets in the curve pool. This big liquidity is due to the incentives of Frax and Terra. Going forward, you can see it was decreasing but still keeping a good healthy proportion of each stablecoin, and even in February, there was less USDT than others. Starting this week, this imbalance of USDT was counterbalanced. This morning, USDT was traded up to 95 cents, so the pool was depleted.  As a side effect, we had almost 2 billion DAI at the beginning of the year in 3pool, but they are no longer there; they were swapped for something else. That means a demand of 2B DAI was removed, so the PSM is decreased by almost 2B.     Other Chains/Bridges960×540 34.6 KB    This one focuses on other chains and bridges. We have here:  Avalanche, where we lost 76% since the 15th of February.  Two main reasons: the impact of Stargate and a change in the incentive structure of Aave’s AVAX.    Fantom, where there is a 58% loss due to Solidly.  Polygon, not too much DAI-related and more stable, but with a -48%. All this explains much of the loss in those subjects. Bottom line: those DAI were migrated to those chains to get liquidity farming, and when the liquidity farming started, those DAI just disappeared because there was no reason to get those DAI back.   Lending Platform Usage960×540 27.6 KB    Here we have the lending platform usage. I don’t follow much Cream, so I don’t know why there is no DAI anymore. With Compound, there has been a decrease in market share since the beginning of the year. One reason might be that Aave has become more relevant and profitable.   What should we do?960×540 60.4 KB    This is a summary slide about where we are now and what things we should do. Looking at the chart at the bottom left, you can see where DAI is located, the exposure, and the usage of DAI on-chain on Ethereum. You can also see the landing protocols (Dex, bridge). Looking at the purple side of the bars, you can see externally owned accounts: those are growing (or at least not shrinking). And this effect has been going on for an extended period. It is unclear why DAI is used at those addresses, but they are not using them too much. Those people are not speculating on anything, which creates some “organic bedrock” of 3,4B DAI sitting on EOAs. This situation may change in the future, but even when we experienced a crush recently and in January, this proportion has not changed significantly. If we look at the usage of the capital given by those DAI as a non-stablecoin exposure, we have 3B below this already mentioned bedrock of “organic” DAI. That represents a 400 million buffer to continue deploying DAI, which means that, in the worst scenario —all lending stops, all the DEXs are draining, all the bridges emptied— we still have a 400 million buffer to continue deploying DAI with a different project. We should also clean the 235M DAI stuck in USDC-A, USDP-A, and GUSD-A. Those vaults were made before the PSM and are no longer used because every client is now underwater. We have to move those from the vaults to the PSM. Either way, they are counted as stablecoin liquidity in the slide. We need to think about what we should do if the situation worsens. We could consider stablecoin liquidity going into “crisis mode” if we go under the 1,5B DAI in the PSM.   The first step, in this case, could be to increase the target rate for Aave D3M (100-300M DAI savings) to remove the DAI exposure on Aave. But all this is half effective since not all DAI that we put on Aave are borrowed, and those that are not borrowed; if we take them back, this will not move the price.  Second step, we can increase the SF on DAI/USDC LP, but as our stability fees are very low, it’s not strategic. We have 450M under the vault, but even if we remove all this exposure, the impact on the PSM will be half of that. In those vaults, we have USDC/DAI as collateral, which has very high leverage, and that means that if we unwind everything, it will remove half on the asset side and another half on the DAI side. If we do this, the net effect on the PSM will be an increase of 200M.  Third step:  increase the DSR to be at the same rate. That way, if you give a good rate on DAI, people might be incentivized, but this is something that cannot be done in the short term. The yield should be quite interesting. And all this is costly.  Fourth step: increase all vault’s SF. This will affect competitiveness and customers relationship.     Nadia Álvarez 55:25  When or what should happen to know that we need to act fast in a situation where liquidity is dropping on DAI?   Sebastien Derivaux 55:39  It’s very difficult to say. It’s better to have solutions already in place. We can’t waste one month of discussion before acting if things get complicated. We need to be able to move fast. We put a placeholder of 1.5B in PSM. That’s when we need to start to rush.   Rune Christensen 56:24  Assuming we use a theoretical structure similar to Monetalis, how many stablecoins do we need to hold on-chain that we simply could not put into bonds? How high do you think we could set a baseline DAI savings rate?   Sebastien Derivaux 57:49  We’ve been working on that. If everything is frictionless, the main issue is that we should keep the less possible in PSM. The problem is more about implementation, as there are costs involved in brokerage, and so far, it is not clear what those costs could be in the end, but there will be some friction. We would have to keep a good buffer in the PSM. We don’t have definitive numbers. It will depend mainly on our fees when we want to go out of the shortened bonds.   LongForWisdom 59:17  I think we have the mechanisms to resolve long-term issues, but the problem with the PSM is that we need some short-term media mechanisms. It may be wise to set up something that increases the DSR along some curve as the PSM liquidity drains from our maximum desired percentage to 0%. You should get a clear signal: your PSM will drop, and the DSR will increase. My point is: that maybe our solution should be to start using our long-term fix earlier in this situation.   Sebastien Derivaux 01:00:40  Are you saying that we should have a smart contract that is permissionless that checks if the PSM is below a certain threshold to increase the DSR automatically? I think that we should get there at some point because Governance is a bit too slow. There must be a more effective way to solve this problem. The DSR was tried in 2020, but now it’s quite different. The market is quite different too, so who knows what would happen if we increase DSR by 2%? If you order some kind of assets that can be used as a repo on Aave, you can also source some equities there. If there is a need for liquidity, you can use ETH, put them on Aave, and borrow DAI or USDC to meet the demand. There are plenty of things we can do. We need to implement them and move slowly and carefully.   Rune Christensen 01:02:08  If we do this, the DSR comes from the surplus buffer, so the surplus buffer has to be replenished by SFs.  Can we imagine some bonded curve as the PSM empty for the DSR, and then the Risk group or Governance sets SFs to pay for the DSR increase? Is that the idea?   LongForWisdom 01:02:33  Yes. Use the DSR to deal with the issue in the short term, and then you can either choose to increase the SF or not, depending on how the general income revenue situation looks.   Sebastien Derivaux 01:02:52  We might need to increase the DSR above our actual revenues, so we are making a loss. But that’s just a temporary solution until we fix the problem by rising SF or something else.   Primoz Kordez 01:03:33  In the last slide, you didn’t mention that we still have several stablecoin vaults that can be liquidated into their respective PSMs, which will help shore up a little bit of the PSMs. It’s a temporary solution if we get close to empty, but it’s a trigger we can pull. We hold about 4B of stablecoins: 3B in PSMs, half a billion in G units, the abandoned stablecoin vaults, and then there’s this USDT issue that is getting resolved, so the BSM increased by 100M in the last hour. This will increase the DAI holdings curve, and the PSM will increase.   Sebastien Derivaux 01:04:55  Yes, but the curve is sometimes very slow to go into balance as the amplification factor is insane and difficult to predict.   Kirk 01:05:36  Many other stablecoins deal with low peg issues with incentivization on curve pools, and that’s another tool in the toolbox. I worry about the DSR and SF raises; those are slow mechanisms. There may be a structural reason we can’t raise them high enough to achieve the effects we want, or they may come with harmful demand destruction side effects.   Sebastien Derivaux 01:06:22  One of the key points of this slide is the purple part of DAI on the bottom left, which is what I call organic DAI. If you can make people hold DAI and use it for their daily payments and stays in circulation, that’s the best tool we have because that’s sticky, but liquidity farming solutions are not.   Rune Christensen 01:07:06  The purple on your graphs tells us many EOAs are using DAI as a flight to safety during market turbulences?   Sebastien Derivaux 01:07:16  Yes, but the increase of last week is not that big. I don’t know exactly what they are using it for. This would be a good subject to know.   Rune Christensen 01:07:42  A comment about the idea that we can count on that purple EOA demand as being reasonably static: I think that’s probably not true when we start to see the depths of the bear market. I guess most of the people in purple are going to dump it for volatile assets they think they can make gains on, which will put much downward pressure on the peg. That’s another event to look out for.   Nadia Álvarez 01:08:46  USDC and USDT are sticky because they have liquidity, and it’s very easy and cheap to convert them to fiat. Let’s remember that we need to work on increasing the liquidity to get that stickiness. The next step to achieve is the multi-change strategy. Once we start working with L2 and side-chains, we can work closer to other ecosystems and increase integrations with other projects.   Open Discussion  960×540 55.1 KB   Nadia Álvarez 01:13:12  I have been receiving many comments from partners and people everywhere, who are happy for us and amazed at how the market is crashing, but Maker is yielding.   Rune Christensen 01:14:48  I’ve been doing these meetings to overhaul the Governance for the long term. Given the recent events, in particular, I think now is the time actually to begin implementation. Tuesday at 5 p.m. I’m doing the first of these calls. They are called Voter Committees, where many MKR holders get together and discuss what’s there in their interest to vote for. Today, voting decisions mainly occur in close meetings between Delegates and CUs, between CUs and VCs, or sometimes between collateral applicants and VCs or Delegates. All the decision-making process is happening in essentially closed meetings, causing things to backslide. We must create way more clarity about this decision-making process, align votes, measure voting power, and even consider opposing voting power. My impression is that MKR holders that aren’t being paid in any way feel sort of frustrated and disenfranchised right now to a large extent. CUs members are getting paid, and everyone is involved and incentivized, but MKR holders are volunteers and have a minimal stake. Right now, it’s tough to know the pure opinion of MKR holders. I want to create a “safe space” for MKR holders where we can simply discuss what is in their interest.   Kianga 01:18:21  I’d love more color on the closed meetings, and I’ve heard this impression from other parts of the community. There’s this perception of the real decisions happening behind closed doors, and more transparency it’s necessary; let everyone know. In the Strategic Initiative kick-off, we talked about how difficult it is for Delegates to know the views of MKR holders and vice-versa. I want to say that I vote with my conscience, and I’m not caucusing anyone to give me input on what I should vote for. I hope that any MKR holder can get to know my views, and I look forward to being as transparent about that as possible. My view on being a Delegate is to offer service to the DAO and its wider stakeholders.   Rune Christensen 01:20:49  There’s much stuff happening all over the CUs. A kind of entity has almost formed. The structure has emerged: a bureaucracy formed by amalgamating the CUs, the Delegates, and even certain collateral counterparties. This is built mainly upon relationships between people. As a natural evolution, you have these meetings where things are decided. The reality is that everyone’s been doing this to get anything done. The decentralized process of Maker is so incredibly complex and has this issue of complexity spiraling. I don’t think that there’s a trust issue. It’s a natural process that could not have been avoided at all. I get exposed to a lot of the behind-the-scenes stuff that’s happening, and I can say that there’s much bad stuff: politics and conflict and inefficiency and that kind of stuff that naturally occurs in any organization explodes in a DAO. We should look forward to this and not blame or worry about what organically emerged. Ultimately, it has to be some kind of major initiative to build things properly from the ground. It can’t be retroactively expected that the CUs should have figured out how to deal with this. I’m worried that the reaction to this could be something like, “okay, let’s find out some scandal or something”: we need to think about what we can constructively do from here.   Nadia Álvarez 01:24:20  Of course, we have meetings with other CUs where the community or Delegates don’t participate. Still, it’s just because sometimes we have to discuss sensitive information with other CUs before proposing something to MakerDAO. It’s difficult to have these conversations with sensitive information transparently because sometimes, we are forced to sign an NDA to have these conversations with counterparties. If we want to do something, we need to work in private, and then —when we have the deal almost closed— we go and present it to the community because we have to wait until Government decides if that’s what they want to do or not. e, as CUs, respect Maker Governance, and we know that Maker holders decide what we should do or not, but you have to understand that sometimes we can’t discuss everything.   Rune Christensen 01:27:03  I just saw this comment from Sam earlier asking about the Voter Committee. You can think of it as a meta-structure that is not a part of Maker’s formal government structure because, essentially, it’s a private call with MKR holders showing up. The purpose of the call is to align on voting behavior and whom to delegate to. The whole point is that the decision-making process has to become transparent. You need to understand the decisions made, why they were made, and how to verify them. Many of these issues we need to tackle are about scalability and sustainability, not about someone with some major conflict of interest. These calls need to have MKR holders talking and deciding if we want some external input from someone in the workforce; who and what we want to hear. Ultimately, we recognize a principal-agent relationship between MKR holders and the various professional actors in the ecosystem. I also have this whole large-scale proposal that I’m developing and trying to propose that would have a bunch of next steps that go further to try to go down this path of trying to fix Governance and then make it work for the long run.   Conclusion  Payton Rose 01:31:03  We can have open G&R calls, and MKR holders can hop on, but, realistically, it’ll be a few of them vs. many protocol people who spend all of our time working on this. It’s quite an intimidating environment. Likewise, it’s very easy for CUs to coordinate with one another and have these meetings to talk about strategy and vision and all these other things. In contrast, the same open framework doesn’t exist for MKR holders. From a government standpoint, I see this is trying to address that fundamental problem of organization.  Suggestion Box  Common Abbreviated Terms CR: Collateralization Ratio DC: Debt Ceiling EOA: Externally Owned Account ES: Emergency Shutdown SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal OSM: Oracle Security Module LR: Liquidation Ratio PSM: Peg Stability Module RWA: Real-World Asset RWF: Real-World Finance SC: Smart Contracts Liq: Liquidations CU: Core Unit  Credits  Larry produced this summary. Andrea produced this summary. Iván produced this summary. Everyone who spoke and presented on the call.​  ",
                    "links": [
                        "https://youtu.be/jK2VtNUHuGE?t=131",
                        "https://youtu.be/jK2VtNUHuGE?t=207",
                        "https://youtu.be/jK2VtNUHuGE?t=499",
                        "https://youtu.be/jK2VtNUHuGE?t=1112",
                        "https://youtu.be/jK2VtNUHuGE?t=2333",
                        "https://youtu.be/jK2VtNUHuGE?t=4268",
                        "https://youtu.be/jK2VtNUHuGE?t=5463",
                        "https://youtu.be/jK2VtNUHuGE",
                        "https://youtu.be/jK2VtNUHuGE?t=3",
                        "https://youtu.be/jK2VtNUHuGE?t=131",
                        "https://youtu.be/jK2VtNUHuGE?t=207",
                        "https://youtu.be/jK2VtNUHuGE?t=499",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-5-11-2022/15154",
                        "https://youtu.be/jK2VtNUHuGE?t=496",
                        "https://youtu.be/jK2VtNUHuGE?t=1112",
                        "https://youtu.be/jK2VtNUHuGE?t=1364",
                        "https://youtu.be/jK2VtNUHuGE?t=1734",
                        "https://youtu.be/jK2VtNUHuGE?t=2048",
                        "https://youtu.be/jK2VtNUHuGE?t=2365",
                        "https://youtu.be/jK2VtNUHuGE?t=2607",
                        "https://youtu.be/jK2VtNUHuGE?t=2693",
                        "https://youtu.be/jK2VtNUHuGE?t=2784",
                        "https://youtu.be/jK2VtNUHuGE?t=2895",
                        "https://youtu.be/jK2VtNUHuGE?t=2959",
                        "https://youtu.be/jK2VtNUHuGE?t=3328",
                        "https://youtu.be/jK2VtNUHuGE?t=3339",
                        "https://youtu.be/jK2VtNUHuGE?t=3384",
                        "https://youtu.be/jK2VtNUHuGE?t=3469",
                        "https://youtu.be/jK2VtNUHuGE?t=3557",
                        "https://youtu.be/jK2VtNUHuGE?t=3640",
                        "https://youtu.be/jK2VtNUHuGE?t=3728",
                        "https://youtu.be/jK2VtNUHuGE?t=3753",
                        "https://youtu.be/jK2VtNUHuGE?t=3772",
                        "https://youtu.be/jK2VtNUHuGE?t=3813",
                        "https://youtu.be/jK2VtNUHuGE?t=3895",
                        "https://youtu.be/jK2VtNUHuGE?t=3936",
                        "https://youtu.be/jK2VtNUHuGE?t=3982",
                        "https://youtu.be/jK2VtNUHuGE?t=4026",
                        "https://youtu.be/jK2VtNUHuGE?t=4036",
                        "https://youtu.be/jK2VtNUHuGE?t=4062",
                        "https://youtu.be/jK2VtNUHuGE?t=4126",
                        "https://youtu.be/jK2VtNUHuGE?t=4392",
                        "https://youtu.be/jK2VtNUHuGE?t=4488",
                        "https://youtu.be/jK2VtNUHuGE?t=4701",
                        "https://youtu.be/jK2VtNUHuGE?t=4849",
                        "https://youtu.be/jK2VtNUHuGE?t=5060",
                        "https://youtu.be/jK2VtNUHuGE?t=5223",
                        "https://youtu.be/jK2VtNUHuGE?t=5463",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-may-2022/15742"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.565376492194675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/08/2022-22:19:43",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-189-thursday-may-05-17-00-utc/14965",
            "title": "Governance and Risk #189 - Thursday, May 05 17:00 UTC ",
            "index": 14965,
            "category": [
                "Discontinued Categories",
                "Governance and Risk Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "3",
                    "time": "04/05/2022-17:17:09",
                    "content": " 189 f1920×442 24.5 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, financial or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only, and do not constitute any recommendation for any action or an offer to provide investment, financial or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478, please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-05-05T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Poll + Executive Status  @MIP-Editors - MIPs Update  @Artem_Gordon - Forum at a Glance   Initiative Updates April Financials - @Aes, SF-001 Facilitator Governance Cadence Change - @Derek, PE-001 Facilitator  Selected Discussions   Governance Improvements Governance Cadence Change - Executives going up Wednesdays rather than Fridays MakerDAO’s requisition process, should we introduce the use of Request for Proposals (RFPs) Prioritization Voting Framework - @prose11 How to improve on follow-through (SPFs, liquidity provision, clean money, etc) Do greenlight polls still make sense?   Other Discussions and General Q&A  General Q&A Ask us stuff  Anonymous question box  ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1xQ4Xigr3LgoXkgIeoRXmFveLgX1UnO-a1_On2xfuOdo/edit?usp=sharing",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
                        "https://forum.makerdao.com/t/relay-semanal-3-9-de-mayo-de-2022/15157",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-may-2022/15742",
                        "https://forum.makerdao.com/t/govalpha-q2-2022-quarterly-report/18242"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.398809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "1",
                    "time": "04/05/2022-19:37:30",
                    "content": " Episode #189: May 5th, 2022 | Semi-transcription  Agenda   00:00: Introduction  02:03: Votes and Polls  05:06: MIPs Update  08:00: Forum at a Glance  15:46: Initiatives Update: April Financials  36:06: Discussion: Governance Cadence Change  44:30: Discussion: Request for Proposals  55:04: Discussion: Prioritization Voting Framework  1:13:55: Discussion: How to Improve on Follow-Through?  1:24:06: Conclusion   Video   Introduction  Agenda and Preamble  Payton Rose 00:00  Hello, everyone, and welcome. This is the 189th Governance & Risk Call. My name is Payton; I go by Prose11 online. I am one of the Governance Facilitators here at MakerDAO. This is our weekly governance call, where we talk about what is happening in and around Maker and potential risk factors to the protocol.  For those of you joining us live, I remind you that we are recording this meeting. Try not to speak over one another. If you want to enter the conversation, Zoom provides helpful tools such as the raise hand feature, which allows me to create a speaking queue and decide whom to call next. If you cannot use your microphone, you can always leave a comment in our chat, and I will be happy to read it when we get over to it.   We have an agenda to build off of today: we will start with our Governance Roundup–containing the Votes, MIPs Update, and Forum at a Glance–; next, Initiative Updates–this will be April Financials and Governance Cadence Change–; and finally, the main discussion of the day: Governance Improvements. After all that, if there is still time, we will get to the Open Discussion.   General Updates  Votes  Payton Rose Polls:  2 Weekly Polls - PASSED  Investigate Implementation of a TrueFiD3M PPG - Open Market Committee Proposal   2 Concluded Greenlight Polls  sETH2 - 100% Approval Stakewise Staked ETH HVBANK - 0% Opposition  Huntingdon Valley Bank Loan Syndication Collateral   2 Ongoing Greenlight Polls (Voting Ends May 16th)  ATDC (ATD Combustors) IPCI (India Power Green Bonds)    Executive:  Last Week - Core Unit Budget  Distributions - Passed and Executed  PE-001, COM-001, EVENTS-001, SH-001, DIN-001   Tomorrow - Recgonized Delegate Payments  MOMC Proposal, wstETH-B Onboarding     MIPs  Pablo 05:06 Weekly MIPs Update #86  Calendar1480×834 34.9 KB   MIPs960×540 15.3 KB   May’s Formal Submissions:    MIP65: Project Clydesdale: Monetalis Arrangement I: Liquid Bond Strategy & Execution  MIP65 will onboard and activate an RWA vault to acquire USDC via PSM and invest them in high-quality liquid bond strategies held by a trust arranged and maintained by Monetalis.  Vote Breakdown - MIP65      MIP68: Monetalis Lusitano: UK Green Economy SME Wholesale Lending  MIP68 is a self-contained collateral onboarding MIP that will onboard and activate an RWA vault backed by the assets of a trust arranged by Monetalis.  Vote Breakdown - MIP68      MIP69: L2 to L1 Fast Withdrawals  MIP69 formalizes technical work completed to deliver Fast Withdrawals on Layer2.  Vote Breakdown - MIP69      MIP4c2-SP19: MIP40 Budget Process Amendment  MIP4c2-SP19 revises MIP40 as well as related subcomponents MIP40c1, MIP40c2, MIP40c3 and MIP40c4.  Vote Breakdown - MIP4c2-SP19      MIP40c3-SP67: Modify Core Unit Budget - Strategic Happiness, SH-001  MIP40c3-SP67 updates the budget for the Strategic Happiness Core Unit, SH-001.  Vote Breakdown - MIP40c3-SP67       The Ratification Polls for these proposals will go up on Monday 9 and run for two weeks until Monday 23.   Proposals in RFC:    MIP72: Delegated Collateral Attachment - RWA Arranger Application - 6s Capital  MIP72 authorizes 6s Capital as a Real World Asset Arranger for MakerDAO to cause commerce by assembling commercial senior-secured transactions based on the authorization #001 outlined herein.    MIP4c2-SP15: Core Unit Offboarding Process Amendments  Recent events have shown the process for involuntarily offboarding facilitators and core units could be improved. These changes attempt to make the process more transparent, orderly, and conducive to an offboarding proposal’s substantive discussion prior to a vote.    MIP4c2-SP20: MIP16 Amendments  MIP4c2-SP20 amends MIP16 to reflect the changes to the weekly Executive Vote cadence proposed by the Protocol Engineering Core Unit here.    MIP41c4-SP34: Immunefi Security Core Unit Facilitator Onboarding, IS-001  MIP41c4-SP34 onboards @psychonaut (Jpritikin Industries, Inc) as a co-Facilitator for Core Unit IS-001: Immunefi Security.    MIP41c4-SP35: Facilitator Onboarding, DIN-001  MIP41c4-SP35 onboards @tadeo as the Facilitator for the Data Insights Core Unit.    MIP41c5-SP6: Facilitator Offboarding, DIN-001  MIP41c5-SP6 offboards @tmierzwa as the Facilitator of the Data Insights Core Unit. MIP41c4-SP35 accompanies it to onboard @tadeo as the new Facilitator. Together, these two MIPs complete the voluntary transfer of the responsibilities of the Data Insights Core Unit Facilitator from @tmierzwa to @tadeo.  Note that this is a voluntary offboarding and will not be voted on.      MIP55c3-SP4: Adding a Special Purpose Fund - Makershire Hathaway  The Makershire Hathaway Special Purpose Fund will be a 10M pool managed by Strategic Finance CU under the supervision of Risk CU and prospective Lending Oversight CU to experiment with various yield generation strategies and support DAI liquidity/utility.     If you plan to have your proposal enter the upcoming June’s Governance Cycle, please have it posted in the Forum no later than Wednesday 11!   Forum at a Glance  Artem Gordon 8:00 Post: Forum at a Glance: April 28th - May 2nd Video: Forum at a Glance   News & Announcements:  First Annual Gala Charity Dinner Fund retrieval exclusion from executive Asset Change Request Process Governance Cadence Improvement    Discussions:  Governance Reflections: Optimism and Maker MakerDAO - intangibles for a better DAO Macro - Rising bond yields and DAI    Signal Requests:  Change lid Parameter on the Rate Limiter Deploy the balance sheet in ETH Restart The Burn  [V2]     Initiatives Update  April Financials  Aes 15:46  Monthly Reporting - April Financials1040×720 210 KB   Hello, everyone. This is Aes from the forums, the Strategic Finance Core Unit facilitator.   April Financials - Legal Disclaimer1040×720 150 KB   A brief Legal Disclaimer before we begin:  This report is for informational purposes only. It does not constitute financial investment, legal, regulatory, or tax advice.     April Financials - Overview1040×720 140 KB   The protocol earned 7.7 million in revenue last month, a 29% increase from the prior month and a 39% decrease from the prior year. As you might remember, last April was an extremely bullish period, with ETH-A rates at 5.5% for the entire month.  As you might remember, last April was an extremely bullish period, with ETH-A rates at 5.5% for the entire month. DAI supply from risk-weighted assets ended the month about 500 million lower than last year. We ended the month at 3.3 million in risk-weighted assets versus 3.8 million last year. On-chain workforce expenses decreased 28% from last month, and Oracle gas expenses increased by 26%.     April Financials - MoM &amp; QoQ1040×720 113 KB   As you can see in the waterfall chart for the MoM walk, we had a recurring net protocol income increase by 0.7 million from March, driven entirely by 0.9 million and fewer workforce expenses.  We had lower lending yields, offset mainly by an increase in assets.   On a QoQ basis, we saw a significant lending yield and asset compression.  Average risk-weighted assets used in the diet decreased from 5.4 billion down to 3.6 billion, and the average loan yield decreased 78 basis points from 2.69% to 1.91%.     April Financials - Lending Business1040×720 127 KB   For lending income, we had 5.8 million in revenue. A 100K decrease from the prior month; that is about 2%. ETH dependency increased, driven by WBTC loan reductions. The MLMC recommended cutting WBTC-A rates from 3.25% to 2.25% and WBTC-B rates from 4.5% to 4.4%, which would, hopefully reverse these trends and start to diversify our portfolio further.  18:39  April Financials - Balance Sheet Assets1040×720 83 KB    SebVentures: As you can see, our assets are decreasing mainly due to the PSM unwinding, which, at the same time, is due to lower demand for DAI in the market. Two main factors drive this:  Firstly, the diamond curve decreased, with an outflow that is not as steep as we might see with the 4pool. Still, we will be attentive to its evolution. Secondly, plenty of DAI went to Avalanche and is returning to mainnet to be swapped to something else.  Nevertheless, our crypto loan book is still slightly increasing. That, at least, provides us with relative safety. Currently, we are at 57% of stablecoin, still safe on the liquid difference.       April Financials - Key Risk Metrics1040×720 128 KB   Risk is improving. There are fewer assets on the balance sheet.  The leverage ratio, equity divided by assets, is meliorating. Although, that is not for a good reason: you want to grow, not shrink. A similar phenomenon affects the capitalization ratio, which only uses the yield-bearing assets.  We are safe. This is lower than we should expect to be even safer. Nevertheless, the outlook seems stable, and it is still not very different from last year.      20:18  April Financials - ETH Market Share1040×720 146 KB   Color Reference: Green = MakerDAO / Red = Compound / Purple = AAVE / Lime = Liquity    adcv: For the ETH Market Share, the YoY trend is one of a slightly contracting ETH lending market.  Still, this narrative is punctuated with a positive MoM development, brought by an unexpected increase in bulk capacities on AAVE and Maker.  For the most part, Maker tracked the market’s growth in that regard. However, the central notion we wanted to call out was the general tendency for ETH to migrate out of the lending market and AAVE aggressively taking share at Maker’s Compound expense. The impact of broader adoption of stETH alternatives with ETH as collateral is yet to be seen.       April Financials - WVTC Market Share1040×720 127 KB   Color Reference: Green = MakerDAO / Red = Compound / Purple = AAVE   There was an unfortunate move from Nexo, where Maker went down to #3 from #1.  The overall WBTC market looks positive, with the supply of WBTC increasing steadily on a YoY basis. AAVE takes the crown for the amount of BTC they have been able to capture and their positive trend on the MoM basis.     April Financials - Sablecoins on Arbitrum1040×720 71.1 KB   We wanted to finish the discussion with two charts on L2’s Arbitrum and Optimism.  Last time, we talked about this in the context of the Stargate launch.  Team members of both Protocol Engineering and Growth have engaged with Stargate and might be able to speak about how that process is evolving.   I would point out that from January to April, Frax has emerged as a strong contender for 3rd place.  This is still a market where, unfortunately, USDC and USDT dominate the stablecoin landscape. Despite this, there is a lot of talk on the forums about the North Star being organic DAI demand. This chart should serve as an explanation for why organic DAI demand is crucial for growing the business. It would be a shame to see Frax flip us on origin.       April Financials - Sablecoins on Optimism1040×720 71.4 KB   The narrative started on a positive note for DAI, but it rapidly evolved into USDC acquiring the lion’s share of Optimism volume in a few months. In addition to that, liquidity is now a new contender. Most likely due to its increased adoption of protocols, such as Synthetix.  We want to emphasize the importance of being able to supply new protocols with large amounts of organic DAI demand upfront. Thus, allowing DAI to have a utility beyond being a receipt for a loan. It is vital for collateralized crypto.  L2s are tracking the overall crypto market but are clearly where the retail market will be in the future. It is something on which we need to keep our energy and attention: getting organic DAI demand back up.     This is the last of the slides we selected; we chose the best bad news for this call. There is more bad news in other slides, but we can talk about that if people have any specific questions.  24:41   Nadia: I do not think this is bad news. We already knew this. Maker is not on L2 or any other chain yet, but mainnet. It is still difficult for anyone to use DAI without having Maker Vaults.  How does USDC manage this stage? Since all markets have USDC, it is simple for projects like Optimism to integrate with them because of their liquidity. These integrations feedback into increasing USDC’s liquidity as well. Rewards and incentives on side-chains and other networks stimulate stablecoins usage, but most of those are for USDC.  Frax is offering a large amount of money and rewards. The same goes for UST. If we do not take action, this outlook will remain the same.     As soon as we start opening Maker Vaults on Optimism, increasing our liquidity will become much simpler.  We could have D3M and Uniswap. This would solve, at least in the beginning, the liquidity issue we are facing. Managing to give loans through Maple and TrueFi would also increase DAI liquidity.  Otherwise, why would anyone choose to use DAI instead of any other stablecoin, accounting for its currently low liquidity and lack of rewards or incentives stimulating its usage?   Yes, DAI is decentralized. That is not a feature yet. It will be in the future, but it is not at the moment. Now, people go after the yield and rewards.    Payton Rose: Thank you, Nadia. Is there anything else we wanted to highlight from Strategic Finance? They alluded to some other information, and I am curious, but I will be happy to leave it there if everyone is happy.  adcv: No. I was kidding when I mentioned other information. Zoom out for a second and look at the state of the protocol. It is among the few most profitable in the crypto space, among many protocols that offer similar services, or are in adjacent businesses, currently operating at enormous losses and funding their growth through deficit liquidity, mining incentives, and shared illusion.  We are in an acceptable situation, but this should stress the importance of expanding to where the demand is and continuing to build on that momentum.    28:22   David Utrobin: Adrian, do you see the incentives from other projects which are loss-leading slowing down? If so, do you see them slowing down over the next year, over the next five years? I am curious to know how long can loss-leading be sustainable by, maybe not our direct competitors, but other protocols.  adcv: Great question. We can further look into it in more detail. I do not have any hard data at the moment.  Obviously, AAVE has a program that feeds stkAAVE to holders. We benefit a little from it.  It is hard to tell, apart from saying that it is not sustainable in the short run. The strategy is to buy as cheap demand as possible with the hope it will stick. Even so, this is a very competitive business, and yields rule the game. I do not know to what extent these protocols will be able to hold on to their customers once this figure turns off.      David Utrobin: Thank you for your view, Adrian. It is something I noticed. Demand is not sticky at all in this industry. It is all numbers.  Nadia: It is not sustainable, but we can still follow the better example with incentives and understand why they are not sustainable. We know which models are not: Anchor, Terra, UST.  What happens when they run out of money? They raise funds. Various VCs support them by investing millions and millions so that these models can use the money for incentives and rewards. I do not know precisely when they will stop doing this. It is a bet, an interesting one. They are paying for usage, hoping that, at some point, without those incentives, these protocols will remain functional. Will it occur? We will have to wait and see. For now, I believe these VCs are only making bets to see what happens.    Aes: Circling back to David’s question, we researched this topic at the end of last year. At that time, Compound spent almost 400 million in liquidity mining incentives. AAVE spent around 150 million last year. At that scale, neither of those protocols is anywhere close to profitability.  Some protocols like not include dilution as a cost, but that could not be further from the truth. Dilution is a cost. We reflect non-DAI compensation–AKA MKR compensation–as a real expense.    Payton Rose: Thank you, Mark. Any other questions about the April Financials before we move on?  31:40   ElPro: Yes. I want to go back to Nadia. Getting off the decentralized finance world, what are some of the obstacles you folks face regarding centralized partnerships? Is it the same thing where there is no liquidity, no incentives? What stops DAI from being listed in circles and pushed to create this POS, these machines that accept USDC at the local shop? Can you give us an idea about that, if possible?  Nadia: Yes. Mariano and I talked a lot about this. We have to be aware that DAI is wonderful, but it is not the best stablecoin. I live in Argentina. I understand the importance of decentralization. Although, this notion does not flow worldwide.  Liquidity is what matters. People pay attention to that and how easy it is to convert a stablecoin into FIAT. If you think about this, you will think about USDT and USDC.  We are talking with a company that sells cryptocurrency to banks for them to offer stablecoins to their clients. A benefit for them is that, at some point, they can choose to buy stablecoins with a discount. That does not happen with DAI. On the contrary, because of its liquidity, if they wish to buy a large amount of DAI, they will not be eligible for a discount. It will be more expensive. We have that big issue: liquidity. In terms of payments, the crypto market is one thing, and the traditional financial system is another. Payments require liquidity. If we want to be included in a POS and for companies to use DAI, we have to increase DAI liquidity.   You also need to pay attention to what users are looking for.  They are turning to USDC because it is easy to use and UST because of the yield. Everybody knows that they can get an 18%, 19%, 20%–I do not know–and then convert that UST to USDC and swap them for Dollars. That is what people are looking for: liquidity or rewards.      Payton Rose: I see PaperImperium asking in the chat if we are partnered with any cards for people to spend like a Visa card?  Nadia: Yes, we have integrated with various partners, but it is mostly crypto cards. It would be different to integrate with, say, PayPal. That is another story.   Discussion  Governance Cadence Change  Thomas Flitter 36:31  Governance Improvements960×540 21.9 KB   Hello, everyone. My name is Thomas Flitter, Engagement Lead for the GovComms Core Unit. Today, I am here to discuss four pertinent topics. We will get started with Cadence Change.    Governance Improvements - Cadence Change960×540 22.4 KB   This is an interesting new improvement proposal that we want to examine. We also want to bring Derek from Protocol Engineering in. I believe he just posted on the forum about this, and I wanted him to have the opportunity to explain it further.   Governance Improvements - Cadence Change I960×540 26.4 KB    Derek: Thank you, Thomas. Hello, everyone. I am Derek from PE. You may or may not have seen the forum post that we recently put up. As Artem and Payton mentioned earlier, this changes the cadence of Executives, moving them from Fridays to Wednesdays.  This is a good move for the Engineering team because it gives us a little more time between when polling starts, ends, and the Executive post. Now not on a Friday, but a Wednesday.  As part of this change, we will continue having the spell cadence weekly and assess that as we go. Likewise, if there is an emergency, we will step in to make the process as quick as possible when required.     I want to walk us through the current–or former–process to give us some background as to why we face some of the challenges that led to designing the new process. Then we will talk about it to break it down in more detail.   Cadence Change - Old Process960×540 50.9 KB   You can see that the space between Thursday to Friday is cramped. We are trying to get many things done: getting CES bits into the spell, we are looking at payments from delegates, core units, and rate changes. All of that is done in 24 hours. It is risky. And we are doing this on Fridays, which is a bad practice.   Cadence Change - Old Process Pitfalls960×540 43 KB   The current process does not allow us enough time to do the Goerli spell first. We do the Goerli spell and the mainnet spell simultaneously, which is not optimal.  We should split those two out, making sure that we have the first deployment, review it, and then move into the mainnet.  That is where the new process will give us a lot more focus and opportunity to make sure everything is correct. There are also last-minute changes to the spell copy sometimes. We have delegate payments, addresses, and multi-sigs, that need to get added at the last moment. Getting it done can be a challenge with the current process. Again, this talks to 24 hours not being enough.     Industry-wide, it is not desirable releasing on a Friday. It is well known among other engineering organizations that doing so is a wrong move.  It is also unfair to our European and Middle-Eastern time zones, which are getting into the weekend by then.   Lastly, we have to make sure there is enough time for reviewing and accepting PRs from other engineering teams, in this case, CES, involved in collateral onboarding. They also require time to sync with Oracles and with us to do these reviews and get the PRs into the final deployment.  40:47  Cadence Change - New Process960×540 60.2 KB   What changes for the new process is that GovAlpha will be able to hand the spell copy over to Protocol Engineering on Friday.  In parallel with that, CES and PE will be working on the Goerli spell during the week so that by the end of the week, we got the Goerli spell review ready to be managed and deployed the next Monday. Then, we write the mainnet spell, deploy it, and it is visible on the portal on Wednesday.  We debated whether we should put it on the portal Tuesday night or Wednesday morning. We settled with the latter because it gives us enough time to mention the executive on Thursdays in the G&R call, and it gives us a good flow to sync with TechOps, Oracles, and other units that need to review it. I think this flow works well, and we will test it starting this week. You will recall Artem and Payton mentioning that we will not have an executive this week but until Wednesday next week. That will be for delegate payments, BTC-B, and the stability fee reduction.       Cadence Change - New Process Details960×540 48.9 KB   This slide talks about, more or less, what I have mentioned before. I will not go through all this. You get the main point.   Cadence Change - Key Takeaway960×540 19.1 KB   We are still working through the week-to-week cadence. If there is any overlap or pressure, we will communicate it and will be happy to have that discussion with the community.  This has been in discussion for a while. It takes some effort to get all the stakeholders aligned and make sure that we are all on the same page regarding the handover from polls to the copy, to the executive, to the test on mainnet, and so forth. Hopefully, that sums it up and fits with everyone. One consideration that is worth bringing up is office hours. We have discussed this and considered it when designing the new process. If there is a delay, we could run into the weekend. Similar to what could happen now, which may delay the lifting of the hat. There could be some minor timing issues, but otherwise, it should be as we have stated before.   If you have any questions, I will be happy to answer. Hand it back to you, Thomas.  Thomas Flitter: Thank you, Derek. Let us see if anybody has additional comments or feedback. In the meantime, do not forget to visit the forum post that Derek has just put out. We will be looking forward to the next developments on that.   Request for Proposals  Thomas Flitter 44:30  Request for Proposals960×540 19.8 KB   The next topic we want to discuss is Request for Proposals, emphasizing whether we should have RFPs? The floor is open for everyone to voice their thoughts and provide feedback on this matter. David has another comment to add to this as well.  David Utrobin: One benefit of RFPs is that whoever writes them specifies the exact requirements for the level of service we aim for.  Let us take, for example, a Content Production or Marketing team. Presently there are no specific parameters for the services we want in such a team.  Anybody coming from the external world and proposing their team will suggest their vision of what they think we need. The RFP will enable the DAO to communicate what it needs upfront as a tool. It also creates a clear call to action to the public, opening a window with a delimitated frame for these types of proposals. RFPs could be an excellent tool to increase the number of incoming proposals, not only to specify the requirements of anything that Maker could be hunting for–whether it is a particular core unit, purpose, fund, etcetera–. Hence, I think it would be beneficial to start using this tool.      47:00   Thomas Flitter: LongForWisdom said in the chat that we somewhat saw them implemented in MIP13, although no one utilizes it for that purpose. Would you like to comment further about that?  LongForWisdom: MIP13 defines a sub-process where someone writes a declaration of intent and then submits it to vote.  For example, MakerDAO wishes to hire a Marketing Core Unit in this case. The content of that declaration of intent would go through the conditions in which the DAO wants this to happen: “we expect them to have this, do this, etcetera.” This is a general process for anything we want to do or want to happen, but we cannot implement it immediately by simply putting it in a MIP.  RFPs are a sub-category of an intention we want to express that we cannot materialize merely by voting for it.      David Utrobin: The main difference is that RFPs create a call to action, whereas, historically, applicants use declarations of intent to test the water for their proposals before actually proposing.  In these cases, you usually see people explaining what they are going to do, not the DAO explaining what it wants and needs.    LongForWisdom: Exactly. Although, there is no reason for them not to be used as RFPs. Declarations of intent were initially designed for that purpose, not only for applicants to get a feeling before proposing.  Thomas Flitter: I am curious to know everyone’s thoughts about this. If an RFP goes into the process, who would follow through? Who would handle it? Individual CUs? How would that look?  David Utrobin: It could fall under the category of what Delegates can author. They have a valuable point of view of the organization and what it might need.  Growth could create RFPs for our brand; we could do RFPs for anything related to GovComms. Overall, this is an excellent tool for Delegates to push forward initiatives and needs.    Thomas Flitter: Are there any Delegates online who would like to speak on this or share thoughts?  50:42   Person 1: As a relatively new member, I think the proposals are daunting. The level of effort that goes into them is towering. We have Discord, but I would appreciate a less formal format.  Thomas Flitter: Both Tim and Tim are raising their hands. ultraschuppi, I will go with you first.  ultraschuppi: Formalizing a way of doing things is encouraging. It is a good idea to have imagination or applications for work.  It is not like this was impossible before, but investing time in systematizing a method is an easy funnel for people to pitch ideas and, in general, a good move.    Thomas Flitter: Tim Black, you had your hand raised?  Tim Black: Yes. I want to go back to Long’s point and the governance processes we already have with the SPF application for funds.  If we zoom out and try to specify what problems are solved by an RFP, we see two: outlining work that we want to get done and setting a structure we do not have the bandwidth for. The RFP we are requesting in this open call is an opportunity to prioritize work people apply to in the DAO.  Compound Grants are an example of this. There is plenty of history in open source work that has RPFs.   There is a happy medium where we can use the tools we have in the MIPs and the MIPs themselves while constructing a framework that could be native to the forum or live somewhere else.  That way, we do not have to have it be as formal, and we can brainstorm ideas that eventually result in MIPs.      Nadia Alvarez: About what Tim just said, we are sponsoring HackMoney, and we needed ideas for the wishlist of what we want the builders to do.  In the past, when sponsoring these hackathons, everyone was integrating DAI as any other stablecoin. That is not something we desired. We decided to create a wishlist–we shared a form with other CUs, and I will share it here – a grants page like Tim suggested, with all the things Maker wants to have in the future.  If you have an idea and want to include it in this wishlist, we will publish it and ask hackers during hackathons and Twitter to start building on that. Please, send us your ideas.      Thomas Flitter: Thank you, Nadia. The chat is getting going! Thank you all for your comments. We will now move on to our next topic: Prioritization Voting Framework. I am going to hand this off to Payton.   Prioritization Voting Framework  Payton Rose 55:04  Prioritization Voting Framework960×540 21.8 KB   This is on GovAlpha’s roadmap for this quarter. Our team has been working on something in the past, and we wanted to announce it today. There is an upcoming forum post with further details as well.   Prioritization Voting Framework - Motivation960×540 62.6 KB   This is because it is much easier to pass things than to implement them.  I made a list compiling all the collateral types and general features that governance had pulled on and approved, and it was nearly a hundred items that have been voted on, but we have not fully implemented yet.   The problem is obvious: the governance mechanism has to pass things they want right now. CUs have a long list of approved features. They say: “our mandate points over to this, and we will keep working on these things and, as more come in, we will try to shuffle them to our priority.”  On their end, CUs have many ways of conveying their priorities. They can add updates, hop on calls like this, host ad-hoc calls, and do the things that also express those priorities. Delegates, MKR holders, and voters do not have a way to express what they would like to see prioritized for the DAO.  As of now, people say things like: “I think we should be doing this,” and the more people pile on that, the greater the appearance of prioritization is. That is detached from MKR voting.   We need a continuous method to see what MKR holders, voters, and Delegates believe the DAO should be putting their effort behind.   A side note before we go on: CUs’ internal mandates propose the things that they will work on. Although, we also spend plenty of time collaborating and working on projects with other CUs. That is something that can be optimized by having a prioritization framework.  If MKR holders want something to happen and we are going to spend time coordinating and working with other CUs that are their independent bodies, it makes sense to at least have a list that states that MKR holders want that to happen.     Prioritization Voting Framework - Implementation I960×540 37.1 KB   Our vision is to have a month-long IRV format and a ranked-choice voting structure.  It will consist of a main prioritization poll and polls with sub-categories if needed. Delegates, MKR holders, and voters can submit their rank choice and order for things they think should be prioritized. It will be hosted on the Voting Portal. We got in contact with Data Insights to be able to provide visualizations to assess how the voting goes.  Ranked-choice will come out with a single victor, but we want to see people’s ranked choices and compare those decisions between rankings.      59:45  Prioritization Voting Framework - Implementation II960×540 54.4 KB   We will have a weekly update from GovAlpha to summarize the information and remind delegates and MKR holders how the vote is going. This is continuous, over a month process.  As new voters come in and people change their votes, the overall priority will also change.   As far as main polls and sub-categories go, there will be items that require a list of priorities within themselves.  For instance, in the first go-round, we will have a Protocol Engineering technical design as a sub-category and collateral as another one. Including all the individual collaterals or modules in that entire ranking is senseless.  Having MKR voters and Delegates express that adding collateral should be towards the top, or the third most important thing, and then what collaterals they would like to see from that, provides plenty of information for the CU.     The final component will be a monthly relegation process taking the bottom three options in prioritization and having new ones come in their place.  This is to keep the list living and going with new topics from different stakeholders.  We would have one distilled from the CUs, one from the Recognized Delegates, and another from the general community.     This will not be a binding poll. It will be continuous. We want to get the dialogue going to assess what is key to MKR holders and have CUs respond in consequence or effectively inform them why they will not be able, for some time or until a change in scenery occurs, to take action in the desired direction.  This should increase communication, allowing MKR holders a channel to say what they think is crucial regarding coordination between CUs. Finally, for the CUs themselves, this should become a tool to see what people with voting power think is vital, rather than simply having people commenting, whether in Discord or the forums.   I have seen a few chats come through. LongForWisdom can hop on the microphone to answer, or I will also be happy to do it.  LongForWisdom: I think we are asking if the process would change every week. Interesting question.  We see these as communications from Governance to CUs. Governance might change their mind about what their priorities are every week–I suspect they will not, but they might–. That is separate from CUs. They have working priorities.  The idea is that CUs will still set their working priorities, now with more information–quantifiable information from Governance that they can feed into their prioritization process–with which to do so.   I do not expect CUs to change their priorities every week; even if Governance does, that is not feasible. But they can look at that and decide what to do next while working on existing projects.    Payton Rose: Priorities may shift, and even if they do in a small amount, that could still be a strong signal. Then again, if suddenly a major world event happens and all the MKR starts going to a single option, that might be a clear signal for the CUs to take a step back and reassess their roadmap.  David Utrobin: Another advantage is that this would create a transparent communication about the disparity of expectations.  If CUs think we should prioritize something differently than people voting on a poll. This creates a strong signal that there should be further discussion.  For example, if L2 multi-chain is more important than adding collateral on L1, that would be something to reconcile. This is a great way to sync MKR voters and Delegates with the workforce executing these desires.      1:05:15   Thomas Flitter: Thank you, David. We have got a couple of other comments in the chat. One was about prioritization at a macro level, saying that it could become disruptive if this gets into the lower levels. Was that you, Robert?  monkey.irish: Yes, that was me. It is helpful that we are working on prioritization to set direction. But it could be challenging if we get into too much detail, and it turns into a micro-management function. We should keep that in mind.  We develop backlogs and have plans, cadences, sprints, flows, etcetera. It is not as if we do not want to consider something new. If something gets posted, there probably has been some work done on that. Sure, it is an opportunity to explain that, but we have to focus on things that are helpful for CUs in a broad manner. For instance, understanding general categories of collateral that the community thinks is important in our case. Clear examples are all the ETH and SUB-ETH variants we are going after. To know that that is still a continued high priority for the community makes much sense. Another example: RWAs.  This is just a comment to aim to keep it at a macro level to give us better direction, so we can come together when we do our work as CUs and know that we are tracking together.      Thomas Flitter: Thank you, Robert. Any additional comments before we move on to the next topic?  Derek: I will add that I am all for getting a better view from people and having this continuously available.  As you and Payton were talking, one thing that came to mind was what DUX has done. They have a board that allows people to up-vote or down-vote ideas.  It enables you to have a quick look, see what people are interested in, and decide on a pace to take from there. Or maybe detect that something currently requested is a resource involved in another process, and we cannot work on it. Having the conversation around that is OK. The Facilitators would be the main leads for that; it would not be a distraction to the team. I would like to see what kind of tooling you are thinking of.     I see Wouter has his hand up. I will hand it over to him.  Wouter: I do not think this would be the same tool you are talking about, Derek.  A feature request board works on a lower level. The discussion about whether this is high level, low, or micro-management is relevant. You need to get it right to get the right signal at the right level. That is why I would prefer to call this sentiment polling. If there are only twelve topics on the list, and that is for the entirety of MakerDAO, it is unlikely that there is going to be a feature on there saying “we want tags on the Governance Portal,” right?    1:09:15   LongForWisdom: Maybe I can clarify this. We consider we cannot have polls with 20, 30, or 50 options. It is not tenable for Delegates or anyone to vote on them.  We feel 12 is the upper limit. We hope to express the maximum possible signal from polls with only 12 options by organizing them around a system of multiple polls with limited options. Combined, they would provide a much more functional signal without having a giant poll with 100 items that represent everything MakerDAO could be doing at any time.  We might, for example, have a poll that is a smart contract resource. It could have something like Kiln within, collateral support as a general item, and PE could do other things. The idea would be that if, for instance, collateral support is the top-level item, you would also have a poll happening in parallel about which on-chain collaterals you want to prioritize.     You asked about the macro or micro level, which is a good question. I am not 100% sure what makes the most sense with this. My gut feeling is that we would want it on a deliverable level.  In the future, I would like to see DAO direction parameters in polls like these. We could have an item that is green money, for example. Or any other high-level objectives we could take.  But that is a poor place to start trialing a new thing. That is why we decided to begin with concrete things.      Wouter: The point is that you cannot make it too specific. Otherwise, you run back into strategy questions. Some combinations of priorities do not make sense if the theme is not the same.  If your options go: “I will build the car’s engine or fix the bike’s brakes,” one is about building a car and the other a bike, you first need to agree on which one to start and keep going from there. It indeed has to be high-level, as a sentiment poll that shows the general feelings of MKR holders and which direction these are trending on.  Thinking about topics such as how MKR Tokenomics reform is becoming prominent, if we need to push RWAs now, or if we need to go in another direction. On that level, it is probably handy. Once it gets too detailed, you start running into all types of problems, and this would prove not to be the right tool to sort those out.      Thomas Flitter: Thank you. Great conversation. This topic will have a greater discussion and has more to come. We still have some time left to explore our last discussion today: How to improve on follow-through?    How to Improve on Follow-Through?  Thomas Flitter 1:13:55  How to improve on follow-through?960×540 22.2 KB   We go through ideas generated on the forum and other several channels, and sometimes, they fall to the wayside or do not get pushed through. I wanted to ask the question: how do we know if an idea will move forward or not?  This is something for us to think about: is the follow-through a bandwidth issue? Is it a resource issue? Is it a responsibility issue to take the ball and run with it? What are the things we can improve on as we embrace an idea and try to take it to the next level?   I want to open the conversation and comments for the entire group today and listen to your thoughts on this.  David Utrobin: There is a way to divide this. A part of it is that there are things that the entire DAO agrees need to happen. Those things go on our list of wants.  That in itself is a resource issue. These things could take more or less than six months or even a year to build.   Then, there are things that we want, but there is disagreement around them. For example, the Burn, prioritizing Tokenomics, or DAI liquidity.  Proposals with many disagreements and controversies around them tend to stagnate and dilute over time. I am curious about how to deal with working through these things that we want but might be surrounded by disagreement.    Thomas Flitter: Thank you, David. We have a couple of comments. Derek asked about aligning strategy. Did you want to add to that, Derek? That was a good question.  Derek: All these things you, David, and Wouter earlier mentioned: Tokenomics, Burn; it looks like there is plenty of discussion happening in the forum, and it seems like you were getting at how we are not sure in which direction to go in because of the diversity of some of these questions and discussions out there.  There was a comment yesterday in the DssKiln forum post discussion where someone suggested we should have a focus group targeting some of this.  That is a good idea. SES is starting to get ramped up in asking questions and taking the whole strategy query forward. Maybe that is the solution. How can we be quick about doing that? It is all part of that.     ACREInvest, I see you have got your hand up. I will hand it over to you.  1:17:54   ACREInvest: Hello, everyone. I was looking for a forum post. I think it was about intangibles. I wanted to talk about the human side.  We are all humans here, and we have a good deal of discussion about business. We are so strictly business. I want to ask: is there anything else we can do as a community to understand how we feel? Do the challenges we talk through have personal dynamics? Is there anything we can do to improve our connections to one another on a human level, to see each other? We often cannot get together, but I am in DAO communities that are tackling this–I put some comments about this in that thread–and I think MakerDAO could benefit from that conversation happening in concert with some of our strategic work. There are times when it gets tough. We are all under pressure, yet everyone here works super hard, smart, and driven; it is impressive.  If there is anything that is a potential threat to our success, it is that. We need to pay attention to how we are doing as human beings and our capacity to continue to coordinate and work together because it has to be more than the money. It has to be more the number go up.   We need to think about the interpersonal dynamics of doing this work and how everyone is doing it.   I just wanted to say that. I am the softy of the group!  Thomas Flitter: No. That is an excellent point! Sometimes we get lost in the opposite and stop focusing on the interpersonal. Thank you for bringing that. That was a great comment. David has his hand up. I hand it over to you, David.  David Utrobin: Again, there are two levels to this. One of them is within the CU itself. We do at GovComms during each of our standups to have an open-ended question: how is morale? How are you doing?  As the Facilitator, I make sure that my team schedules time off and does not work 60 or 70-hour weeks if they do not have to. They get the support they need.  It is the Facilitator’s role to steward the team’s morale.     Then, there is this other part which is cross-CU: bonding.  How do we get more cross-CU bonding going? This is an interesting challenge.  It helps to see people in person. Even these calls help.      Thomas Flitter: Thank you, David. Appreciate that. We have another hand raised over here. Chris?  1:21:35   Chris: There are different answers to this, like David mentioned. From my experience in life, the cheat code to this is not a pretty one: you have to go through hell together.  It does not matter the group you are with–and maybe this answer is part of the larger question about follow-through and people forming subcommittees to get things done–: in my experience, we form strong bonds through extreme adversity.  The more we experience that together and tackle difficult problems as and across CUs, the stronger those bonds are going to get. It is not pretty, but the result is spectacular.      Thomas Flitter: Thank you for that comment. Another hand raised?  Person 1: Yes. I wanted to applaud Kianga for saying that. It is a crucial aspect that usually gets pushed to the side because it is not clean and measurable. I think it is vital, and I would love to see an ongoing discussion on that.  Thomas Flitter: Thank you. We are getting close to the end of our time today. A riveting topic to keep exploring: the human element, the relationship-building we have, not only for our business needs but also for the interpersonal aspect. That was a great discussion. Payton, I will hand it back to you. Thank you.  Payton Rose: I appreciate you facilitating the discussion segment, Thomas. Nice to have you on the microphone and the camera for the call.  1:24:06   Payton Rose: We do not have much time for open discussion. Thank you all for sharing. A lot happened today. Please check the forums. We will keep it going there as well as in the chat.  We will be around the same time, same place, next week. Thank you so much for attending.    Suggestion Box  Common Abbreviated Terms CR: Collateralization Ratio DC: Debt Ceiling ES: Emergency Shutdown SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal OSM: Oracle Security Module LR: Liquidation Ratio RWA: Real-World Asset RWF: Real-World Finance SC: Smart Contracts Liq: Liquidations CU: Core Unit  Credits  Constanza produced this summary. Larry Wu produced this summary. Everyone who spoke and presented on the call.​  ",
                    "links": [
                        "https://youtu.be/ZJSmzCTSbsA?t=123",
                        "https://youtu.be/ZJSmzCTSbsA?t=306",
                        "https://youtu.be/ZJSmzCTSbsA?t=480",
                        "https://youtu.be/ZJSmzCTSbsA?t=946",
                        "https://youtu.be/ZJSmzCTSbsA?t=2166",
                        "https://youtu.be/ZJSmzCTSbsA?t=2670",
                        "https://youtu.be/ZJSmzCTSbsA?t=3304",
                        "https://youtu.be/ZJSmzCTSbsA?t=4435",
                        "https://youtu.be/ZJSmzCTSbsA?t=5046",
                        "https://youtu.be/ZJSmzCTSbsA",
                        "https://youtu.be/ZJSmzCTSbsA?t=1",
                        "https://youtu.be/ZJSmzCTSbsA?t=306",
                        "https://forum.makerdao.com/t/weekly-mips-update-86-may-9-2022/15058",
                        "https://youtu.be/ZJSmzCTSbsA?t=320",
                        "https://forum.makerdao.com/t/mip65-clydesdale-monetalis-liquid-bond-strategy-execution/13148",
                        "https://vote.makerdao.com/polling/QmXHM6us#vote-breakdown",
                        "https://forum.makerdao.com/t/mip68-monetalis-lusitano-uk-green-economy-sme-wholesale-lending/13789",
                        "https://vote.makerdao.com/polling/QmS7UyQT#vote-breakdown",
                        "https://forum.makerdao.com/t/mip69-l2-to-l1-fast-withdrawals/14041",
                        "https://vote.makerdao.com/polling/QmWZvSpa#vote-breakdown",
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250",
                        "https://vote.makerdao.com/polling/QmXVjbWG#vote-breakdown",
                        "https://forum.makerdao.com/t/mip40c3-sp67-modify-core-unit-budget-strategic-happiness-sh-001/13805",
                        "https://vote.makerdao.com/polling/QmQkxx16#vote-breakdown",
                        "https://youtu.be/ZJSmzCTSbsA?t=374",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/12920",
                        "https://forum.makerdao.com/t/mip4c2-sp20-mip16-amendments/14980",
                        "https://mips.makerdao.com/mips/details/MIP16",
                        "https://forum.makerdao.com/t/governance-cadence-improvement/14972",
                        "https://forum.makerdao.com/t/mip41c4-sp34-immunefi-security-core-unit-facilitator-onboarding-is-001/14610",
                        "https://forum.makerdao.com/t/mip41c4-sp35-facilitator-onboarding-din-001/14948",
                        "https://forum.makerdao.com/t/mip41c5-sp6-facilitator-offboarding-din-001/14946",
                        "https://forum.makerdao.com/t/mip55c3-sp4-adding-a-special-purpose-fund-makershire-hathaway/14643",
                        "https://youtu.be/ZJSmzCTSbsA?t=480",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-28-may-4-2022/14981",
                        "https://youtu.be/ZJSmzCTSbsA?t=481",
                        "https://youtu.be/ZJSmzCTSbsA?t=500",
                        "https://forum.makerdao.com/t/first-annual-gala-charity-dinner/14848",
                        "https://forum.makerdao.com/t/fund-retrieval-exclusion-from-executive/14959",
                        "https://forum.makerdao.com/t/asset-change-request-process/14956",
                        "https://forum.makerdao.com/t/governance-cadence-improvement/14972",
                        "https://youtu.be/ZJSmzCTSbsA?t=619",
                        "https://forum.makerdao.com/t/governance-reflections-optimism-and-maker/14957",
                        "https://forum.makerdao.com/t/makerdao-intangibles-for-a-better-dao/14860",
                        "https://forum.makerdao.com/t/macro-rising-bond-yields-and-dai/14944",
                        "https://youtu.be/ZJSmzCTSbsA?t=703",
                        "https://forum.makerdao.com/t/signal-request-change-lid-parameter-on-the-rate-limiter/14688",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn-v2/14918",
                        "https://youtu.be/ZJSmzCTSbsA?t=946",
                        "https://youtu.be/ZJSmzCTSbsA?t=1119",
                        "https://youtu.be/ZJSmzCTSbsA?t=1218",
                        "https://forum.makerdao.com/t/a-north-star-dai-as-the-destination/14838",
                        "https://youtu.be/ZJSmzCTSbsA?t=1481",
                        "https://youtu.be/ZJSmzCTSbsA?t=1702",
                        "https://youtu.be/ZJSmzCTSbsA?t=1900",
                        "https://youtu.be/ZJSmzCTSbsA?t=2191",
                        "https://forum.makerdao.com/t/governance-cadence-improvement/14972",
                        "https://youtu.be/ZJSmzCTSbsA?t=2447",
                        "https://youtu.be/ZJSmzCTSbsA?t=2670",
                        "https://youtu.be/ZJSmzCTSbsA?t=2820",
                        "https://forum.makerdao.com/t/mip13-declarations-of-intent/2461",
                        "https://youtu.be/ZJSmzCTSbsA?t=3042",
                        "https://hackathon.money/",
                        "https://makergrowth.notion.site/Hack-Money-Projects-d6705b07f2ec439a98aca39ce0a0311b",
                        "https://youtu.be/ZJSmzCTSbsA?t=3304",
                        "https://youtu.be/ZJSmzCTSbsA?t=3585",
                        "https://youtu.be/ZJSmzCTSbsA?t=3915",
                        "https://youtu.be/ZJSmzCTSbsA?t=4155",
                        "https://youtu.be/ZJSmzCTSbsA?t=4435",
                        "https://forum.makerdao.com/t/dsskiln-a-permissionless-token-purchasing-tool/14943",
                        "https://youtu.be/ZJSmzCTSbsA?t=4674",
                        "https://forum.makerdao.com/t/makerdao-intangibles-for-a-better-dao/14860",
                        "https://youtu.be/ZJSmzCTSbsA?t=4895",
                        "https://youtu.be/ZJSmzCTSbsA?t=5046",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.620555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/08/2022-20:45:10",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-191-thursday-may-19-at-17-00-utc/15252",
            "title": "Governance and Risk #191 - Thursday, May 19 at 17:00 UTC ",
            "index": 15252,
            "category": [
                "Discontinued Categories",
                "Governance and Risk Meetings"
            ],
            "tags": [
                "public-call",
                "d3m",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "0",
                    "time": "18/05/2022-13:12:26",
                    "content": " 191 f1920×442 27.7 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only and should not be relied upon as legal, business, investment, financial, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only and do not constitute any recommendation for any action or an offer to provide investment, financial, or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478; please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-05-12T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Poll + Executive Status  @MIP-Editors - MIPs Update  @Artem_Gordon - Forum at a Glance   Initiative Updates  None this week.   Selected Discussions   Revisiting D3M Risk & Meta What problem are we solving? What use cases do D3Ms apply to? What are the risks? How does the Surplus Buffer limit us? How should MKR voters think about this? What are different example scenarios?   Other Discussions and General Q&A  General Q&A Ask us stuff  Anonymous question box  ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1BvCgs0NNpsGA2B5TtmcdkyAfr5aRcB7WVLOPy90jWFU/edit#slide=id.g127c42ff1aa_0_0",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/weekly-relay-may-17-23-2022/15346",
                        "https://forum.makerdao.com/t/relay-semanal-17-23-de-mayo-del-2022/15392"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.267857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "0",
                    "time": "18/05/2022-14:58:01",
                    "content": " Episode #191: May 19th, 2022 | Semi-transcription  Agenda   00:00: Introduction  03:01: Votes and Polls  05:21: MIPs Update  10:07: Forum at a Glance  16:50: Discussion: Revisiting D3M: Risk & Meta  01:06:23: Open Discussion  1:12:15: Conclusion   Video Link  Introduction  Agenda and Preamble  Payton Rose 00:00  Hi, everyone. Welcome to episode #191 of the Governance & Risk Core Unit. My name is Payton, and I go by Prose11 online. I am one of the governance facilitators at MakerDAO. I am joined by a bunch of awesome people who both work for and are generally interested in the Maker protocol. This is our weekly call where we discuss the governance and risk states of the protocol. This meeting is being recorded. Let us try not to speak over one another. There are some great tools on Zoom you can use. If there is something you would like to add, to speak next to the conversation, you can consider raising your hand. That should be under the reactions section of your zoom dashboard at the bottom. Feel free to drop something in the chat. I am more than happy to read out loud for you. This is an open meeting. We encourage your questions, your comments, and your feedback. Please do not be shy and consider getting involved in our conversations. Before we move on to things, we are trying out a new meeting time next week for the last meeting of the month. The meetings will be a bit later. Next week, this call will be at 2100 UTC, rather than its regular time at 1700 UTC. More on that later in the forum. Our Agenda Today:  We will start with our governance roundup that includes the votes, what is going on with our Maker improvement proposals, and the latest from the forum. There are no initiative updates today. We have a cool discussion topic centering around D3Ms, their risks, and what they mean for the protocol. For those that are unfamiliar, D3M stands for Dai Direct Deposit Module. That is our way of injecting Dai to different lending protocols or similar protocols or other teams using something where we can have Dai and inject it directly for lending.     General Updates  Votes  Payton Rose 3:01 Polls:  2 Concluded Weekly Polls - PASSED  Raise the ESM Minimum Threshold Adjust the lid Parameter on the Rate Limited Flapper   2 Concluded Greenlight Polls  ATDC (ATD Combustors)  Passed - 47,231 MKR to MKR 40,663   IPCL (India Power Green Bonds)  Failed - 49,104 to 38,970 MKR     1 Active Greenlight (Voting ends May 30th)  FEI (FeiUSD)   5 Ongoing Ratification Polls - To be covered in MIPs segment  Executive:  Yesterday’s Executive: Foundational L2 Work, Authorize New Flash Mint Module, MKR Vesting - PASSED, Pending Execution  Next Wednesday’s Executive  Raise ESM Threshold - 150,000 MKR Adjust “lid” Parameter - 30,000 DAI MKR Transfer - DUX, SAS     MIPs  Pablo 05:21  1124×755 27.2 KB   MIPs1920×1083 142 KB   Ratification Polls1920×1080 85.1 KB   Ratification Polls1920×1080 154 KB   Proposals in RFC1920×1080 66 KB   Top-Level MIPs1920×1083 177 KB   Core Unit Onboardings1920×1082 103 KB   Facilitator On/Offboardings1918×1083 118 KB   Amendments1920×1078 86.5 KB   Core Unit Budgets1920×1082 81.6 KB   SPFs1920×1081 93.7 KB   Others1920×1084 86.7 KB   Important Dates1920×1079 88.9 KB   Thank you1920×1080 43.4 KB   Forum at a Glance  Artem Gordon 10:07 Post: Forum at a Glance: May 12th - 18th, 2022 Video: Forum at a Glance   Announcements:  MakerDAO.com performance overview Governance House Delegate Platform/[email protected] Delegate Platform/London Business School Delegate Platform    Discussions:  MakerDeFi DAO Governance Report: A review of major DeFi DAO governance systems in the Ethereum ecosystem The MKR holder Confessional    Active Signal Requests:  Request Return of MKR Tokens Inadvertantly Sent to Governance Address [Signal Request]Offboard UNI, UNIV2DAIETH, UNIV2WBTCETH, UNIV2UNIETH, and UNIV2WBTCDAI [Signal Request]Increase the ESM Minimum Threshold [Signal Request]Deploy the balance sheet in ETH [Signal Request]Launch Maker Teleport with 1 basis point fee [Signal Request]Maker Accessing Mortgage Loans Through Bacon Protocol [Signal Request]Antalpha Institutional Vault     Discussion  Revisiting D3M Risk & Meta  Thomas Flitter 16:50  Revisiting D3M1920×1073 88.8 KB   1920×1080 164 KB   I am Thomas Flitter, engagement lead for the GovComms CU. Today, we have a great topic, revisiting D3M. The Direct Deposit Module interfaces with third-party lending protocols to enforce a maximum variable borrow rate for selected assets. Maker governance can pick a target variable borrow rate, and the module will automatically deposit or remove liquidity to ensure that the target rate is hit. We have got many questions that we are putting out there for Risk and PE to talk about. I want to hand that off to them to go through these and have a great open discussion with the folks on the call. First question, what is D3M? The second question is, what use cases apply?  Primoz Kordez: The D3M is cool because it is easy to scale by supply. If you imagine now that you want to scale DAI supply through vaults, you first need to identify collateral. The collateral needs to be liquid. You need to identify if there is any demand behind borrowing. There are oracle costs. It would be best if you determined the interest rate. It is not a simple task, to be honest. We failed at many points. But with D3M, that is straightforward. You select the lending market or whatever market has pulled Dai, and you set some parameters. In Aave’s D3M or Compound, you select the target rate. It is straightforward and faster. To some degree, it is also more controllable. And that is the second advantage; you can control the supply, which becomes important when you need to contract it. If PSM unwinds and we need to contract the supply to defend the peg, the D3Ms are probably the best tool to do that fast. You pull Dai out. That is useful. Also, when you do D3Ms with landing markets, you start offering something that Maker does not offer, which is cross-collateralization. We get benefits from that. Some people are not sticking to Maker because they cannot pull collateral and do cross-collateralization. They are regular users of Aave and Compound, therefore. You can have benefits through D3M to that. There is also the competitive angle that you can somehow control. Because you can control the rates to some degree, currently, of Dai Aave, you can even address this. Christopher Mooney: From the technical perspective, I will add maybe an analogy, which is that the vaults that we have in the system, which are like pseudo vaults under the hood. But effectively, the D3M is its sort of Vault engine. The vault engine is our way of generating DAI. You have got to entice vault users to put stuff in, and we have carefully scoped the risks around our existing Vault engine and its direct to consumer. That is the existing mechanism for generating Dai. We have shimmed in a PSM that it is another generation mechanism. And under the hood, it uses the same vault mechanism. This is yet another vault mechanism. I hope that gives you a good mental place to hang on to this to understand what the D3M is. If we had removed all of our permissionless direct-to-consumer vaults, you could almost imagine that the D3M would still generate Dai supply the same way the PSM would still function to generate Dai supply. I do not know if that helps give any additional concepts or gives everybody a good mental model. What are its use cases? I nailed a bunch. Right now, it is primarily a Dai generation tool to satiate insane amounts of Dai demand. Maker was looking for ways to try and add a lot more Dai onto the market. The PSM helped us with that over-peg pressure to generate Dai, but it did it at the expense of ingesting a bunch of centralized stablecoins. The D3M was an answer to generating Dai supply when there was a ton of Dai demand outside the normal vaults engine. I am being very pedantic about precisely what the D3M is and the problems that it is solving. Brian McMichael: What is a D3M? I would think of it more like a push model for Dai than a pull model. We currently have our traditional vaults. We require someone to come to us and affirmatively generate Dai. The D3M is where we reach out to other protocols and generate Dai to satisfy demand. There is demand, and the most obvious use case is Aave. We know there is demand there because there is a high-interest rate. What we do with the existing D3M is we will set a target interest rate, which has been lower than the actual interest rate since we have been using it. When the D3M sees that the interest at Aave is higher than our target, it can generate Dai to drive down that rate at Aave, which throws Dai supply on the market and earns us a little bit of yield. This is risky at an SC and community level because we expose ourselves to these external protocols, SC issues, and multisig issues. For example, Aave is exposed to Chainlink, but we now have external Oracle risk. We do not know all the time what the composition or ability to control these protocols of multisigs is. It is a bit riskier. Additionally, the PE team building these things does not have expertise in these external protocols. So there will be some gotchas in the way we implement these. We are trying to mitigate those by having external protocol developers from these other protocols look at this. But for example, we did not even notice the Chainlink exposure in Aave until recently. The Surplus Buffer theoretically can limit us. For example, if one of these tokens, like UST, is involved in a protocol and takes down that protocol, the Surplus Buffer should limit our losses to that amount. To answer how Maker voters should think about this? It would help if you thought that it was a highly effective tool, but it is a bit riskier from a technical and social perspective. And I have mentioned some of the risk scenarios. If there are any questions or additions from the team, that would be helpful.    26:43  David Utrobin: How did Aave D3M behave when UST blew up?  Niklas Kunkel: They do not allow using UST as collateral. They only let people borrow UST.    27:12  Robert: I appreciate the discussion on the features of the D3M. I am struggling with being the recipient of collateral applications, where what tends to happen is that we want to onboard X as a D3M. Unfortunately, that does not mean a lot. I need to go back and understand the business case for this particular application as an example. I have heard one example as it relates to rate stabilization. Great. That sounds like it is one very specific use. This is generating Dai. I get that. But when I look at Aave or Compound, that is one utilization of the D3M or the one currently being developed. On the other side, we have other projects proposed, for example, with TruFi or Maple Finance, which are slightly different. The objective of utilizing the technology is that it provides some similar benefits, but the use is different or not. It would be great if we could talk, from that level versus the features, about what this does for the protocol. If you are telling me that it generates Dai, that is great. But I do not hear that. I am hearing rate stabilization or potentially working with things that are hybrid RWA.  28:59  Brian McMichael: Under the hood, the way the Aave D3M works is we are collateralizing the Dai that we generate with a Dai. Instead of being over-collateralized, like your traditional vaults, these are fully collateralized by the equivalent amount of a Dai under the hood. It is going to be a bit different from some other protocols. Ideally, we will have a token to put into the system and retain this full collateralization. But that might not always be the case. We might have to do receipts or something like that to make some of these situations work.  29:44  Christopher Mooney: I will add to Robert’s point because I have an excellent idea of where he is coming from. The collateral engineering services group has taken over this sort of collateral prioritization spreadsheets with normal collateral engineering. In those sheets, there is a number of these scored weighted attributes and risks of each collateral that we would add. We need to enumerate all particular benefits that a D3M could give us, whether Dai supply or rate stabilization. Maybe it gives us access to collateral that we cannot on board because it does not have a high enough DC, or it would be too expensive for oracles to add it. If we enumerate D3M positives in its collateral onboarding sheet, we could enumerate all of the risks of those D3Ms to get an idea of their rankings. Ultimately, to help review and steer governance towards whether or not we would want a D3M. I do not know if that is sort of the answer you were looking for, Robert, but I feel like that is something that CES can sink their teeth into.  Robert: Yes, because whatever way the collateral application might come through, it specifies things on a level that we do not even understand the business opportunity. What are we trying to accomplish? Or what is the actual collateral in question? The utilization of D3M might be applicable in some of those cases, and it might not be. What I am suggesting is that for applicants that are coming into the system to help us educate them. One of the key tools would be to work with PE to get a summary of the D3M; here are the use cases, some potential areas where you will utilize this, where you would not, and some risks. We are still in the development of the D3M or at least the refactor of the D3M. That would be helpful. Primoz Kordez: One other proposal that I have coming from the risk angle is that D3Ms have a different risk profile than vaults. We have a financial risk with vaults, or you might call it collateralization risk, but then you have a ton of integration risk. You rely on external protocol, on all that Brian mentioned: Oracle risk, SC risk, and even their risk management. This part is hard to quantify. It is hard to calculate the risk premium of depositing Dai to Aave. We can do that for ETH a vault, but it is hard for Aave because we need to evaluate the risk premium of Chainlink failure at Aave for the Dai market. That is hard. We have all these unquantifiable failure risks that are also very devastating. Regarding the surplus buffer debate, how high should the exposure be versus the surplus buffer? Normally it should not be higher than the surplus buffer because you still have this low probability high severity event of losing everything if there is an exploit. At Aave right now, before the V3 is official, the Ethereum market is in V3. One token can rug pull the entire market, Dai markets, if they want. What I would propose to do is to have as many D3Ms as possible with some limited capacity. Because it is very unlikely that all of the protocols that D3Ms would be integrated into would fail at once. It could be correlated events. It could be something with stkETH and everything fails, or Chainlink. You could have this happening. But even with Chainlink, if you go to Compound, they have some fallback mechanisms. Oracle is probably safer than Compound. You get some isolated risks. That is why I prefer more D3Ms with some limited exposure. It would probably be more hatched with this than one large exposure to the protocol. Even if it sounds the safest, it is not necessarily the case because you have these huge tail risks. Brian McMichael: We probably also need people monitoring every external protocol that we integrate to keep track of their governance to see that something will not come down the line that will rug us. There are a lot of considerations around. Primoz Kordez: Yes, I agree with this. We have an internal dashboard for Aave right now. We are looking at every single market and what is happening. I tweeted last week about stkETH because I was afraid many Dai were being borrowed from stkETH. It appears that is much more than it was in the past, but we are still okay from that perspective. You need to know every single decision they make. One other bad part of this module is that even if you monitor well and know you should react, you cannot react fast. If you want to wind down the whole thing, it takes time. It would help if you had Maker votes for it. It is all public, gets discussed, and you might be lost out of the market. That is another reason for not being too exposed to a particular market share of the pool and the DC.    36:16  Christopher Mooney: It occurred to me that whatever we integrate with a D3M, you also need an incentive alignment between their token holders and MKR token holders. There is a huge incentive for another protocol to want us to be injecting Dai into their market if it means that MKR holders are footing the bill for any losses in their implementation. They need to feel the same pain and suffering from a loss, or their token holders do that MKR holders would. Only then are we separate but working in the same direction as far as risks go. I am wondering if it would be instructive to get into specific risks. We have been beating around the bush with some of the Aave risks that have come up in the last week. Does everybody feel like maybe we are at a point where we can talk about that? Or do we still want to talk about things in the abstract?  37:28  Someone: There was a question about the ES support we have in the chat. Currently, there are two kinds of things. We try to code specific scenarios that would allow permissionless shutdown. For example, if Aave or Compound changes some parameters, like the rate model contract or stuff like that, we support immediately unwinding Maker’s position. That is one thing. And the other thing is having support for a shutdown without the governance delay that Maker usually has.  Christopher Mooney: There is a bit of a diagram that can give you an idea of the model. In the new version, there is a hub that manages all of the D3Ms. Each D3M has its plan and pool. On the plan and the pool, there is a function that we can call from the hub that gives us the ability to reach into these other protocols and look if certain conditions have been hit to prevent them from winding up or unwinding. It may make sense for us to have a call that does an emergency unwind. It is like an instant access module that minimally either circuit breaks its function or could unwind it. That is one risk mitigation tool that we may have across these D3Ms. However, it requires us to identify the technical need in these other protocols, which is phenomenal work. PE, CES, or Oracle needs to be digging deep into these entirely different protocols and then understand all of their technical risks. It is a big ask. Niklas Kunkel: That is one of the reasons why I am not very bullish on this thesis that Primoz gave earlier when he was saying we should have a bunch of D3Ms, and that way, if one of them blows up, at least we have been making enough returns from the other ones, and you get a good sampling. But yes, the overhead for monitoring many D3Ms is so high. And if it is not something where you are diligent and put resources behind it, you are almost guaranteed to miss something. I am more of a fan of a very small number of D3Ms that are just a concentrated bet on a specific partner with a specific market stature. Having a D3M there serves us strategically, rather than every DeFi protocol coming at us and saying, “yes, we would like some Dai liquidity, thank you very much.” Christopher Mooney: Maybe if they wrote their own D3M module in a sandboxed way, there might be a middle ground there. To get any traction out of Dai supply or solve those critical business problems Robert talked about. It will require an enormous amount of effort and ongoing monitoring; for us to have a D3M that is sizeable enough and justifies all that expense. Even then, there are risks that we cannot mitigate that we have to accept in that model. That is unnerving to think about, especially last week when the markets were really tearing down because of Terra Luna, and then USDT looked like it was de-pegging. Suddenly, multiple assumptions you make across the ecosystem start to fall apart. All I can think is, will Aave be okay here? It gets very difficult when we have risk factors that we need to mitigate slash accept. Niklas Kunkel: A lot of these things will fail in unison. Say there is some Chainlink hack, or they go rogue and malicious. All of DeFi starts falling apart because they all use Chainlink oracle. If you have a D3M to many protocols, you will hit all of them. It is not like you have one blow-up, and you are okay. Depending on how these things grow, we can say, “Maker, we have our oracles. We are not susceptible to Chainlink yet”, but you are through the D3M. So what is the inflection point where we think it is not worth the resources we are sinking into making this D3M for a little bit of Dai? We are not making enough money. We might think that the risk-reward is good for a medium amount of Dai, and we are making a good chunk of money. But we are also not over-exposed if it blows up. Versus, we are making a ton of money off this, but now we are adding this existential risk. There is this inflection point. I am not necessarily sure where it is, but it does exist, and we have to be conscientious. Christopher Mooney: With Aave in this case, first, let us think about the vault engine. In our typical vault engine, we put enormous effort into ensuring that we have very safe oracles for the vault engine and a significant expense for publishing those prices. We have put a lot of work and thinking and a lot of risk modeling into that. We could have easily switched over to using Chainlink oracles years ago. However, during a bear market, we decided that this is the safer, more prudent approach to control our oracles when we were trying to be safe and secure. When we accept a D3M with its own Dai generation mechanics, like in Aave, it has Chainlink oracles. Over the last couple of weeks, two major oracle risks have presented themselves from the Aave perspective. Chris Belick published the first one. The Chainlink oracles themselves have a contract with their aggregator, protected by a three of 20 multisig. For three of 20 multisig, you can propose a new aggregator and then promote the aggregator and then do a price update. There is no timelock in that process. In theory, you could do that entire update in one transaction and instantly change the prices across these different DeFi protocols. That means that three people out of a group of 20 people across the world can turn DeFi to ash over one transaction. Prior to the D3M and Aave, we would be the king of the ash pile. But with our current DC exposure, we are now part of the ash pile. At least MKR holders have to back hundreds of millions of Dai in this case. That is the first risk. I went out to their community, and I am trying to get one of the devs to talk to me about possibly adding a timelock or a way to signal that this is happening so that we can mitigate it in our new modules. We can see that this aggregator or something has been changed and that the entire price aggregator is about to flip over, and we can say, stop these modules or unwind them immediately. I have not spoken to anybody there yet. The second one emerged from the Terra Luna problem, which I forget on which chain it was. Effectively, Chainlink, at some point, paused the oracle feed for Luna. It was probably a reasonable response for something hyperinflating like Luna was. Or maybe a technical reason you have to do it is that you do not have enough precision to cover the hyperinflation in your pricing. They paused it, but many protocol integrators continue to use that paused price. They did not detect that it was paused. They used the price. This allowed people to mint a ton of unbacked assets against Luna. In some cases, it allowed them to drain the protocol. When we dug into Aave to see if they were exposed to the same risk, it did appear that Aave has this fallback; their fallback is in the case where the price is zero. Then they can do a fallback. Other than that, they are exposed to the same risk. The only mitigation factor to have is a smaller multisig that could take action to freeze lending against it. That is a different risk. We do not know how fast they could act or whether they have ever acted in the past, whether they are paying attention if those people are pageable. These are two major oracle risks that now the D3M exposes us to when we put so much effort in. We need to be careful about what we set the DC too. Those are concrete examples, but there are many other examples like the protocols we integrate; their contracts may be upgradeable and change. A lot of this may not even be malicious. They may do weird migrations that break our stuff. There is an enormous technical complexity, at least when dealing with D3Ms and thinking about the risks. I will pause there. It was a blizzard on avalanche. Kirk: There were two, probably Compound forks. Both were using Chainlink, and both got blown up when the Luna price froze. Robert: We have three to four D3Mish. Aave, Compound, TruFi, and Maple Finance are moving through the system. And others get proposed here and there too. Please keep in mind that this is something that if the community feels as if we do not want to go toward, we must hear in the signal requests and the on-chain polls that this is something that you do not want because there is a systemic risk here. We are trying to identify that for the community.    51:40  Thomas Flitter: A question out there on the chat. Is there any exploration of insurance mechanisms?  Primoz Kordez: Protocols ensure things such as Nexus Mutual, but I do not have a high degree of certainty for ensuring something like that. If there is a blow-up at DAO, I do not think there is a protocol that can ensure you. Nexus Mutual was ensuring USD. I am not sure what happened then. I do not have a high degree of certainty of insuring against something like this. Kirk: But is it also making the technical complexity even higher? Now you have a third protocol that you also need to integrate with and understand: a DAO and a payout mechanism. It would only make the complexity even higher. Christopher Mooney: Minimally, these protocols have some backing pool or insurance mechanism. That is going to the comment I was saying earlier: MKR holders should not be more risk exposed than Aave or the Aave holders that back Aave. dYdX had a backing pool at some point. There is some risk exposure that each of these protocols can eat. We should never really expose ourselves to these protocols more than they have exposed themselves to their protocols. Those other ones like Nexus Mutual, all those things, I think those polls are far too small to make a difference. Primoz Kordez: I was rather thinking in the direction of having a vault-like mechanism where they stake some collateral, and in return, they get some profit share. Then the collateral significantly reduces the risk that Maker carries. I do not know to what extent that could even be made permissionless.    54:36  Payton Rose: We have said that for standard vaults, due to the amount of work and the risk and many other factors, we need to generate somewhere in the neighborhood of 30 million Dai from them to consider standard collateral. I am curious if we have done any calculations with the D3Ms. It sounds like they require more technical labor and have higher risks, which would suggest that the threshold might be higher for D3Ms to come on board as collateral. I am wondering if we thought about that. Is someone willing to throw out a number? I find it unlikely, but I will ask.  Christopher Mooney: Minimally, the number is the amount of technical effort, and time it takes us to implement one. I would argue that it needs ongoing maintenance. Your number should probably be like a full-time person on the risk team looking at stuff. I am worried that that is a full-time person on the risk team and a full-time SC engineer. And maybe even per protocol. At least on the bright side, you do not have to update oracle prices. You are not subject to gas markets, but you will be subject to labor markets. Then those humans are also fallible. They may not function as well as you want them to. Primoz Kordez: One good thing about the D3M is that we have a much better indication of how much Dai will make because Maker is, as was said earlier, more like a push model. When we do a D3M, we should know that there will be a market for deploying X amount of Dai. The rates can drop, and I am still worried about what happens, like yield farming on the Compound and Aave. Saying that there is this market opportunity, we can at least deploy the Dai where sometimes we have onboarded equilateral type, and we have only relied on organic demand. Then we have seen very little demand. The good thing is that we can probably better estimate the investment opportunity, how much Dai can degenerate from this, and the size of income we can expect. On the flip side, the offering cost is much higher. At least currently, there is a refactor going on that should hopefully make it easier and simpler. However, every time you create a new integration with an external protocol that we are not experts in, it will probably need to be audited to ensure that we deploy the right amount of funds and those external protocols. The upfront cost is probably higher. We would probably want a higher return than that 30 million. It is much work Payton Rose: Thank you for branching that. Wouter, in the chat, is mentioning the idea of self-insurance via staked collateral, which is an interesting counter idea. Maybe we do not need to require as big of a generation if we can undercut the risks by requiring others to stake something to activate the D3M. That is cool. Matt: We can extract some wisdom from how this exists in the real world. I will not say Maker is a bank or central bank. Just humor the notion that you have a central bank that provides credit to a bank or an investment bank that then deploys it into the real world to get credit, to go tap into that. In the similar way that Chris was outlining, when you integrate a D3M into a digital aspect, you have the downstream integration risks of who knows what will happen and how you track that in the world. It is similar to deploying capital into a credit market of an originated loan and whether or not that issuer, tenant, or counterparty, what their risk will look like, and how that world view changes. There is an entire derivatives market for credit default swaps on a macro level. That is that you are not allowed to call it insurance. It is a default swap. It is insurance to protect exactly for that. In many ways, we are synthetically replicating the existing credit bank infrastructure. It is worth taking some wisdom from it and acknowledging that what we are doing is nothing that has not been done before. We need to be very cautious in doing it because it is costly to deploy. And it does bear downstream risks.    1:01:09  Payton Rose: What does the ideal D3M collateral look like? I saw Nikolai on the chat mentioning something that is permissionless or immutable.  Christopher Mooney: An integration would be a protocol or an entirely permissionless pool. So that we can thoroughly tackle its scope and understand all the risks around it, that domain of risk is finite. We think a bit about markets and how things might change, and we think a bit about SC risk. But then we are done. In theory, if you had a D3M around some pool generating yield, or something like that, you needed to inject Dai into, the risks may be reasonably well-scoped. It is more of the complicated markets where you get into the explosive exponential risk. I do not know if anyone else wants to answer that. I think D3M works well for something technically scoped to do its own thing. It may be a technical solution to this concept of an arranger for real-world assets. There may be an angle there that it makes sense for. Brian McMichael: To answer Payton’s question, I would say that, like Uniswap, pools would probably be an ideal protocol specimen because they are effectively immutable. There are some changes in V3 that allow token holders to change fee parameters and things like that. But it is a lot easier to reason about what can go wrong in these places. After deploying our end, we do not have to worry about the logic changing from under us. Christopher Mooney: I have a closing thought on it. Given the explicit risks of the Aave D3M and the current DC, I feel that Primoz and the risk group will probably recommend a lowering of the DC. I do not want to be the single person to say that we should scope it down to the surplus buffer. I understand the risks that we know now and the additional unknown risks. I would say we should not expose ourselves beyond the surplus buffer at this moment. Primoz Kordez: We have great meetings next week, which I wanted to bring up. It is also the fact that the community agreed not to be exposed more than 30% to the supply side of the pool, and the pool shrank quite a lot because recursive farming dropped. The pool size is 500 million, and our DB is 300 million. The exposure is lower, but this was already a factor why we would want to propose lower DC for the growing financial risk with Aave. There is the situation with stkETH that users cannot unwind. There is not enough liquidity. I am not panicking as it is manageable. But overall, the risk at Aave is a bit higher than it was months ago. We are proposing to decrease the DC. That is the reason why I said we should continue with multiple D3M. We will not cover five or more of them in the near time, but we should be more aggressive on Compound and try to diversify these 100, 200, and 300 million investments into a few safe ones as soon as possible. Payton Rose: Awesome. I appreciate those closing thoughts. We look forward to seeing what the committee recommends.     Open Discussion  Payton Rose 01:06:23  We have had much good discussion today. It has been many calls for some of us here. A lot of the comments have stayed pretty on the topic regarding D3M. But given that we have about 15 minutes more, I wanted to open the floor to open discussion. We saw some comments about self-insurance funds and other tangentially related things, but they might be good stand-alone topics. If you have a topic or anything you want to discuss today, please either raise your hand or drop it in in the chat. For some context, if we recalled last week, Rune was asking people to participate and then know, like, hey, what is the composition of this call? We will have many CU members and recognized delegates. Like there are many stakeholder groups, but if you would like to participate, you can select all that apply, which will give us some interesting information here on the composition of our weekly meetings. We should probably do this a few calls to see if what we get is representative or not. It seemed it was quick to throw up there. That is pretty much everyone, like 38 of 42. I will do a small screencap so we do not lose it. Unsurprisingly, about three-fourths of our Core Unit members. Next top option, about 40% saying they hold some MKR. I like the idea of running that poll to conclude things. Oddly enough, next week, we will have our specials starting time. It will be interesting to see if those numbers vary significantly from our regular starting time. That was a neat question. We will make sure Rune gets to see that since he was wondering the other week.   Conclusion  Payton Rose 1:12:15  Thank you again to everyone for coming out in person and if you are watching the recording. We value your input and the discussions we have every week. We will do another reminder. We will post on the forums and in the chat. Next week, we are trying out our especially later meeting time. The G&R call will be starting at 2100 UTC, rather than 1700. We hope that most of you can still join us at that time. We are trying to be a little more friendly to our time zones around the globe. We will be trying some stuff out in the next couple of months to see if we can get better representation depending on our time zones. Thank you, everyone. We will cut off the recording there. I appreciate. We will see you next week at our new time.  Suggestion Box  Common Abbreviated Terms CR: Collateralization Ratio DC: Debt Ceiling ES: Emergency Shutdown SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal OSM: Oracle Security Module LR: Liquidation Ratio RWA: Real-World Asset RWF: Real-World Finance SC: Smart Contracts Liq: Liquidations CU: Core Unit  Credits  Kunfu-po produced this summary. Larry Wu produced this summary. Everyone who spoke and presented on the call.​  ",
                    "links": [
                        "https://youtu.be/sSKWsFlNBz4?t=181",
                        "https://youtu.be/sSKWsFlNBz4?t=321",
                        "https://youtu.be/sSKWsFlNBz4?t=607",
                        "https://youtu.be/sSKWsFlNBz4?t=1010",
                        "https://youtu.be/sSKWsFlNBz4?t=3983",
                        "https://youtu.be/sSKWsFlNBz4?t=4335",
                        "https://youtu.be/sSKWsFlNBz4",
                        "https://youtu.be/sSKWsFlNBz4",
                        "https://youtu.be/sSKWsFlNBz4?t=181",
                        "https://youtu.be/sSKWsFlNBz4?t=321",
                        "https://youtu.be/sSKWsFlNBz4?t=607",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-12-18-2022/15280",
                        "https://youtu.be/sSKWsFlNBz4?t=598",
                        "https://youtu.be/sSKWsFlNBz4?t=607",
                        "https://youtu.be/sSKWsFlNBz4?t=660",
                        "https://youtu.be/sSKWsFlNBz4?t=698",
                        "https://youtu.be/sSKWsFlNBz4?t=738",
                        "https://youtu.be/sSKWsFlNBz4?t=766",
                        "https://youtu.be/sSKWsFlNBz4?t=792",
                        "https://youtu.be/sSKWsFlNBz4?t=842",
                        "https://youtu.be/sSKWsFlNBz4?t=892",
                        "https://youtu.be/sSKWsFlNBz4?t=917",
                        "https://youtu.be/sSKWsFlNBz4?t=930",
                        "https://youtu.be/sSKWsFlNBz4?t=949",
                        "https://youtu.be/sSKWsFlNBz4?t=1010",
                        "https://youtu.be/sSKWsFlNBz4?t=1603",
                        "https://youtu.be/sSKWsFlNBz4?t=1632",
                        "https://youtu.be/sSKWsFlNBz4?t=1739",
                        "https://youtu.be/sSKWsFlNBz4?t=1784",
                        "https://youtu.be/sSKWsFlNBz4?t=2176",
                        "https://youtu.be/sSKWsFlNBz4?t=2248",
                        "https://youtu.be/sSKWsFlNBz4?t=3100",
                        "https://youtu.be/sSKWsFlNBz4?t=3276",
                        "https://youtu.be/sSKWsFlNBz4?t=3669",
                        "https://youtu.be/sSKWsFlNBz4?t=3983",
                        "https://youtu.be/sSKWsFlNBz4?t=4335",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-may-2022/15742"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.627951243263047
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "18/08/2022-22:10:35",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1037"
}