{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/making-dai-a-default-stable-coin-on-incognito-pdex/5090",
            "title": "Making DAI a default stable coin on Incognito pDEX ",
            "index": 5090,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "dai",
                "integrations"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/boogaav",
                    "index": "#1",
                    "likes": "14",
                    "time": "11/11/2020-04:53:12",
                    "content": "Hey guys  I am happy to share that Incognito’s community decided to make DAI a default currency on the Incognito DEX. During the last 12 months we were balancing between (USDT, USDC, DAI) it was a must-have for the DEX to raise up, but for now when we have $13M in liquidity pools and $25M+ in trading volume we feel that we are strong enough to start the transition. Before we start a campaign about this, I wanted to collect feedback from you guys, to understand of what is okay, and what should be improved. Here is some more info about who we are and what we do:  About pDEX  →  Liquidity and trading data →  About trust-less setup →   Our goal is to maintain at least $5M in DAI liquidity pool and reduce slippage for DAI <> BTC & DAI <> XMR swaps. Find more about the new rates below.   Incognito – 9 Jul 20    Provide Provide liquidity to the first privacy-protecting DEX, and earn rewards for helping people trade with freedom. Accessible from the Incognito app.        Invest in privacy. Earn anonymously. Your contribution is directly channelled towards supplying...  Reading time: 20 mins 🕑 Likes: 896 ❤       Looking forward to your feedback  ",
                    "links": [
                        "https://incognito.org/",
                        "https://incscan.io/pdex",
                        "https://ethresear.ch/t/incognito-mode-for-ethereum/6232",
                        "https://we.incognito.org/t/provide/4247",
                        "https://we.incognito.org/t/provide/4247",
                        "https://forum.makerdao.com/t/week-24-dai-distributions-sourcecred-funding-mip13c3-sp6/5223",
                        "https://forum.makerdao.com/t/incognito-brings-anonymous-dai-transactions-with-close-to-zero-fee-intro/6116",
                        "https://forum.makerdao.com/t/what-is-sourcecred-and-how-do-i-opt-in/3913/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.372790404040404
                },
                {
                    "author_link": "https://forum.makerdao.com/u/boogaav",
                    "index": "#2",
                    "likes": "8",
                    "time": "13/12/2020-07:04:50",
                    "content": "Hey guys! A quick monthly update. Liquidity pool with DAI touching $1M   It’s awesome progress, still a bit behind USDT/C, but if we keep the current rythm we should catch those pairs in upcoming months    image1164×758 108 KB  To boost more liquidity to the DAI pool, stable coins APY was adjusted:  DAI - 13% APY USDC - 8% APY  More about pools, rates, and how it works find here —> Keep pushing DAI liquidity  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.738095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hyman",
                    "index": "#3",
                    "likes": "2",
                    "time": "14/12/2020-06:56:39",
                    "content": "Thanks Andrey, glad to have Dai as a default coin. I’ll check out your dex. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/boogaav",
                    "index": "#4",
                    "likes": "0",
                    "time": "14/12/2020-13:52:26",
                    "content": "Hey @hyman what do you think is the best way to approach DAI holders for providing more liquidity?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hyman",
                    "index": "#5",
                    "likes": "0",
                    "time": "14/12/2020-18:08:27",
                    "content": "I don’t think it’s specific for DAI, but yield, safety, and simplicity. Yield wise, I saw 13% for DAI which is certainly competitive. High yield mining incentives have historically been good at attracting liquidity. Safety and simplicity are larger road blocks for me. Not to say there is anything dangerous looking about your project, but being in the privacy space I assume you and your customers would agree: suspicious until proven otherwise. Off the bat, not being able to use metamask makes you more complicated than pretty much all other DeFi apps. Add on to this the incognito bridge and other chains, there’s a lot going on. Two questions for you:  why would someone use this over tornado.cash for private transactions? are private swaps needed? what’s wrong with privately funding an account with ETH->swapping to DAI on uniswap?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3616541353383464
                },
                {
                    "author_link": "https://forum.makerdao.com/u/boogaav",
                    "index": "#6",
                    "likes": "2",
                    "time": "15/12/2020-05:41:57",
                    "content": "Hi, @hyman thank you for the advice. We try do not make to much noise around high APY that burn out within a month. With 13% and our target of 5M in the liquidity pool, we could make it sustainable for the long run.     hyman:  but being in the privacy space I assume you and your customers would agree: suspicious until proven otherwise.   Yep, you are right 100%, we try to do all activity publicly.     hyman:  Off the bat, not being able to use metamask makes you more complicated than pretty much all other DeFi apps.   Thats useful feedback, we are going to launch a tool in January that wraps Metamask and allows you to use Incognito mode for Metamask itself and other Ethereum based Dapps. I Will keep you posted about the progress.     hyman:   why would someone use this over tornado.cash for private transactions?    Let me try to answer with an example. I assume you browse hundreds of websites daily. If there a particular website you don’t want to keep track of in-browser history you can manually remove such record (as use tornado to anonymize a particular transaction) or you can turn incognito mode on your browser and surf around without leaving a trace (as use Incognito mode for your crypto) Here is a very quick comparison just to show the main difference      Incognito Tornado     Implementation off-chain on-chain   Shielding fee one time each time   Anonymity set Ring CT, Confidential Assets mixing TXs   Waiting period ≈ 5-10m (upon TX confirmation) Might take days (depends on volume)   Amount limitations No limitation (from $0.1 to $100M+) 100, 1000 DAI     I don’t want to say that Incognito is better or worse than Tornado we just build different features       hyman:   are private swaps needed? what’s wrong with privately funding an account with ETH->swapping to DAI on uniswap?    It’s a good question. If we compare raw data on Incognito  image1196×334 31 KB  Uniswap  image1414×364 53.3 KB       Uniswap Incognito Difference     Liquidity $1.6B $17M 94 times   Volume $200M $200k 1000 times    Obviously, the differences in liquidity pools and trading volume are not comparable   btw, we just launched Incognito mode for Uniswap —>  On another side If you compare trading volume Incognito with Bisq - the most known privacy DEX, you will see     Average daily volume Bisq Incognito     Jan 2020 $150k+ $5k+   Jun 2020 $200k+ $50k+   Dec 2020 $180k+ $200k +    Our bet DeFi industry growth rate is more than 10x in 2020. We believe that if DeFi and crypto does continue eat the world there will be a real shift in thinking towards privacy. It will be more convenient to use a privacy wallet than to generate a new ETH address or use a mixer each time you would like to make a transaction. More on our bet —> ",
                    "links": [
                        "https://gov.uniswap.org/t/incognito-mode-for-uniswap/9220",
                        "https://incscan.io/pdex",
                        "https://coinmarketcap.com/exchanges/bisq/",
                        "https://we.incognito.org/t/the-first-annual-letter/7093"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.646573246573246
                },
                {
                    "author_link": "https://forum.makerdao.com/u/boogaav",
                    "index": "#7",
                    "likes": "6",
                    "time": "19/01/2021-05:16:18",
                    "content": "Hey guys, a very quick update. So far we maintained $3M in liquidity for DAI. And just $53,104 DAI to go to become the biggest stable pair on the Incognito pDEX     image1996×900 81.6 KB  Meanwhile, DAI APY for providing liquidity remains 13% ",
                    "links": [
                        "https://we.incognito.org/t/provide/4247"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/boogaav",
                    "index": "#8",
                    "likes": "2",
                    "time": "26/01/2021-12:49:00",
                    "content": "Hey guys! We did it! DAI is the major stable coin on the Incognito pDEX!  PRV holdrs call (Jan 2021).0011024×768 77.6 KB  Thank you everyone for the contribution  and keep maintaining! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.48828125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/boogaav",
                    "index": "#9",
                    "likes": "6",
                    "time": "24/02/2021-10:20:15",
                    "content": "    boogaav:  Our goal is to maintain at least $5M in DAI liquidity pool and reduce slippage for DAI <> BTC & DAI <> XMR swaps.   Hey guys! The first goal is reached   By Liquidity  image2106×1212 183 KB  By trading volume almost there:  image2042×646 73.8 KB  Thank you, everyone, for your contribution! We have some more ideas on how DAI can be utilized on the Incognito layer, so will keep you posted! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                }
            ]
        }
    ]
}