{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/bug-in-2020-08-07-executive-spell-contract/3603",
            "title": "Bug in 2020/08/07 Executive Spell Contract ",
            "index": 3603,
            "category": [
                "Updates"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "11",
                    "time": "09/08/2020-01:31:23",
                    "content": "Unfortunately, a minor bug in the 2020/08/07 spell contract resulted in the WBTC-A debt ceiling being reduced to approxmiately zero DAI instead of being increased to 80 million DAI which was the original intent. @Mariano_Conti’s description of the issue can be found here.  No funds are at risk, this bug just prevents further WBTC minting (which was already not possible due to the protocol already having hit the previous ceiling of 40M.) This thread should be used for community discussion, and I will ask the Smart Contracts Domain team to post more details here when they are able to do so. Another executive spell will be deployed shortly which will allow MKR Holders to restore the WBTC-A debt ceiling. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-105-thursday-august-13-4-00-pm-utc/3570/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-7/3630"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.623809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#3",
                    "likes": "6",
                    "time": "09/08/2020-01:48:12",
                    "content": "This is a really good, harmless lesson. MakerDAO would benefit from having an independent team validate that an executive spell performs it’s intended function. This need will only become greater as the Maker Foundation dissolves and executive spell creators could be malicious. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "4",
                    "time": "09/08/2020-01:50:57",
                    "content": "I completely agree. I wrote a bit about this idea a fair while ago now (though I imagined something more general than just for executive spells). I don’t want to derail the thread too heavily but the topic is here if anyone wants to read up. Validation Teams: A proposal for a new variety of team ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.061688311688311
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mariano_Conti",
                    "index": "#5",
                    "likes": "17",
                    "time": "09/08/2020-01:59:28",
                    "content": "Hey everyone. We’ll do a longer post-mortem on Monday, but what happened is: The Maker Protocol operates with 3 different units:   wad for gem balances (18 decimals, what ERC20s use)  ray for units like stability fees (27 decimals)  rad for very precise numbers (45 units, or 18+27)  Numbers that accumulate stability fees tend to be RAD since we want the highest precision available. Debt ceilings (line) are in rad because the underlying dai debt is in rad as well. In today’s spell, the WBTC-A debt ceiling was changed to: 80 * MILLION * WAD instead of 80 * MILLION * RAD We have several tests, but in this case, the test had it’s unit modified as well. We will be revising and adding more tests so this does not happen again! A new executive will be deployed that correctly fixes the WBTC-A debt ceiling. WBTC was already at 100% utilization, so this doesn’t change things much. But it is a wake up call for us to be even more diligent when writing, testing and deploying executive spells. Any questions, please let me know! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.566477272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#6",
                    "likes": "2",
                    "time": "09/08/2020-02:12:18",
                    "content": "Frequent manual adjustment of DC and SF is destined to increase the risk of human error. Early realization of intelligent adjustment is the only way to reduce the risk of human error. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teeceem5",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/08/2020-18:07:34",
                    "content": "Right now, vote.makerdao.com says execution of this proposal will happen on Aug 10, 2020, 24:52 UTC 24:52. I believe that’s a bug. What’s the correct execution time? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#8",
                    "likes": "0",
                    "time": "09/08/2020-18:54:07",
                    "content": "This is not related to this specific spell. I will assume this is correct: “Passed on Aug 9, 2020, 12:52 UTC” According to https://catflip.co/ delay parameter is currently set to 12h => Aug 10, 00:52 UTC As per (official rocket) chat, frontend people are already aware of the defect. I can’t find it chat link atm (user SamM pointed it out), but it’s chrome(chromium?) bug. Firefox would display the time correctly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#9",
                    "likes": "0",
                    "time": "09/08/2020-19:19:47",
                    "content": "If the exact same code was run on a testnet there would be an opportunity to see exactly what it does (assuming it does something immediate).  I thought this was something that MakerDao was already doing for executive spells. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#10",
                    "likes": "0",
                    "time": "09/08/2020-19:25:25",
                    "content": "Why does Daistats show the increase to 608 million max if the system reduced the max for WBTC to 0?  Just pulling data from someplace else or manual entry? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mariano_Conti",
                    "index": "#11",
                    "likes": "3",
                    "time": "09/08/2020-19:46:23",
                    "content": "Global debt ceiling is another risk param, that is usually the sum of all individual debt ceilings (but doesn’t necessarily have to be). In this case, the bug was only for the individual WBTC-A debt ceiling which was set to ~0, but the global debt ceiling was correctly increased by 80,000,000 to 608m. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.821428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/galabasquer",
                    "index": "#12",
                    "likes": "1",
                    "time": "10/08/2020-11:54:10",
                    "content": "The Maker Foundation Smart Contracts team does it, but unfortunately we’ve transferred the error to the tests as well. We will have to work on this process to try to avoid this happening again. However your statement actually makes sense, Is someone in the MakerDAO checking the spells? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.523809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#13",
                    "likes": "0",
                    "time": "10/08/2020-12:38:45",
                    "content": "But did the spell execute on a testnet? It’s just that nobody noticed debt ceiling being near 0? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/galabasquer",
                    "index": "#14",
                    "likes": "9",
                    "time": "10/08/2020-12:52:24",
                    "content": "We use a tool from dapptools called hevm with which we can fork the mainnet status and apply the spell before even deploying it (and also after). The problem was that we transferred the error to the expected result in the function that evaluates the status after the spell is applied. This shows that we definitely need to do some improvements to our tests like adding ranges to the expected results to avoid units mistakes happen again. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#15",
                    "likes": "2",
                    "time": "11/08/2020-17:29:55",
                    "content": "While this error was relatively innocent, if we had a unit error on something like the duty parameter, the result would be disastrous. I second increasing the sanity checks on the spells going forward as well as having an independent audit team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#17",
                    "likes": "0",
                    "time": "05/10/2020-15:59:46",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/postmortem-bug-in-2020-08-07-executive-spell-contract/3709",
            "title": "Postmortem: Bug in 2020/08/07 Executive Spell Contract ",
            "index": 3709,
            "category": [
                "Miscellaneous",
                "Developers"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#1",
                    "likes": "6",
                    "time": "18/08/2020-00:24:45",
                    "content": " What Happened? On the evening of August 8th, 2020, a community member indicated that the week’s executive spell, which had been successfully cast approximately 11 minutes earlier, appeared to set the WBTC debt ceiling from 40 million Dai to zero. This was quickly identified to be a discrepancy in the precision of the value set by the weekly executive smart contract. This was confirmed in the code and the Smart Contracts Domain Team was notified and responded shortly thereafter by preparing and reviewing a new executive spell that corrected the error. Due to the quick action of MKR holders, the new spell was voted on and passed the MKR threshold a little less than 12 hours later. No user funds were at risk as a result of this bug.   How did it happen? The Smart Contracts Domain Team develops its executive spells in response to governance actions, and typically prepares the weekly executive on Thursday afternoon after the weekly governance call, which is to be deployed the following morning. Team members take turns creating the spell in order to keep everyone up to speed with the process. The developer who takes the current week’s spell typically uses the previous week’s spell as a template. Since the spell structure evolves week-to-week, the template spell may look different than the last iteration the developer worked on, potentially adding some cognitive overhead in learning the most recent format. In this case, the developers working on the executive adapted the previous week’s spell for the variables that were expected to change for the week, including the WBTC-A debt ceiling, the global debt ceiling, and the ETH-A liquidation lot size. At the time of development, the weekly values that would be changing had not been confirmed by governance, so placeholder values were used and the pull request was marked with a note to review the numbers when they were confirmed the next morning. The placeholder values were not validated for precision at this time, and the WBTC-A debt ceiling was set as a WAD (18 decimal digits of precision) instead of a RAD (45 decimal digits of precision), which the Vat expects for this variable. This is an easy thing to miss because the Vat expects different variables to be in WAD (18), RAY (27), or RAD (45), and the only way to confirm which precision a given variable is in is to consult the vat code.  The numbers from governance were confirmed the following morning, but the team realized that we needed to mention the overflow issue that was being addressed in the spell and a forum post was prepared and the test repository was made public to the community. By the time the forum topic was posted, it was already time to deploy the spell. Several members of the Smart Contracts Domain Team reviewed the spell and approved the code, missing the precision error, and the contract was deployed as usual.  How did we fix it? The problem was discovered very quickly after the spell was cast and a new spell containing only the correct variable was created, reviewed, and deployed by the team.  How do we prevent it? This issue highlights that the Smart Contracts Domain Team must continue to improve its testing and automation, and remain diligent with audits. Additional tests have been added to the weekly executive test suite that check that all system variables fall within expected tolerances. We are also relying on some additional tooling for visualizing the on-chain effects of spells, and although these tools are currently in development and internal to the Foundation, we expect to make them public in the future. Steps will additionally be taken to prepare a canonical template for spellcrafting and testing, rather than re-using previous spells. In the longer term, the team hopes to automate or script the spell generation in a way that can be handed to the community to permit the safe creation of MCD executive spells. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.381941164895711
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#2",
                    "likes": "3",
                    "time": "18/08/2020-01:41:32",
                    "content": "Glad to hear work is being done to prevent this in the future. We are very lucky this occurred in a mostly harmless way. If this precision error was made on a collateral duty, it could have been devastating to the protocol. I trust the smart contract team will not take this lightly. This is also a good lesson to the community that third parties should be verifying executives have sane values. If you are a large MKR holder, this is in your best interest. The more eyes the better. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.523809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#3",
                    "likes": "2",
                    "time": "18/08/2020-05:32:07",
                    "content": "    brianmcmichael:  Several members of the Smart Contracts Domain Team reviewed the spell and approved the code, missing the precision error, and the contract was deployed as usual.   “Several members” is not quantifiable  By “reviewed the spell” it probably means they’ve read the spell, not actually written their own “pseudocode” and compared it. It’s very hard for most humans to review code, especially “boring code” as spells are. It’s a mental struggle against your brain constantly telling you to finish the review and “free itself”.  I am not sure if “non-developer” part of the community understands that “remain diligent with audits” is not so trivial as it might sound. Unfortunately, the better the tooling/automation, the more trust is put in such systems -> less likely human audit catches potential error. Interesting problem. Ideally, 2 (or more) independent dev teams would have completely independent tooling/processes and would not communicate with each other. Then their submitted spells would be compared. And i am not saying this is feasible, i guess i am just paranoid atm  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.204187925170069
                }
            ]
        }
    ],
    "group_index": "2578"
}