{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-makerdao-fund-two-clean-room-implementations-of-oracle-client-specification/5696",
            "title": "[INFORMAL POLL] MakerDAO fund two clean room implementations of Oracle Client specification ",
            "index": 5696,
            "category": [
                "Governance"
            ],
            "tags": [
                "oracles",
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#1",
                    "likes": "2",
                    "time": "16/12/2020-06:54:35",
                    "content": "Proposal: MakerDAO should pay to have three different technology stacks underpinning three different Maker Oracle Clients by paying for the development of two more. Motivation: Maker Oracle Client implements an off-chain protocol for use by oracle providers chosen by MakerDAO. It is a temporary scaling solution until Ethereum is fast and cheap enough to use exclusively.  Until then, multiple oracle client implementations provide for MakerDAO the kind of robustness assurances that Ethereum gains from multiple, independent Ethereum client implementations comprising the network. The scale of the Dai Credit System increasingly justifies the security afforded by client diversity.  Additionally, MakerDAO cannot expect the current client implementation to be maintained indefinitely by the entity which engineered and maintains it, the Maker Foundation, which is dissolving. Pros: MakerDAO gains diverse capabilities to execute oracle function Reduce MakerDAO reliance on off-chain software implementation Reduce chance a software bug can cause oracle network failure MakerDAO engaging additional Engineers MakerDAO prepares for Maker Foundation dissolution Cons: Oracle Feed Providers must select which client to use Increased opportunity for Maker Oracle Client bugs Engineering and maintenance cost Cost: Unknown but presumably the financial impact to MakerDAO of funding the engineering time needed to implement the oracle specification using two new, different technology stacks is low compared to MakerDAO’s current and future scale. Summary: For the same reason that multiple Ethereum Beacon Chain clients were funded to create a robust network, so should MakerDAO ensure that as it scales past a billion Dai outstanding, no software bug can disrupt Maker Oracle functioning. Shorter Summary: Three high quality clients protect against an oracle client software black swan affecting one.     Agree Disagree Abstain     0 voters     Poll closes 2021-01-06T00:00:00.000Z ",
                    "links": [],
                    "GPT-summary": "The author proposes that MakerDAO should fund the development of two more technology stacks to underpin three different Maker Oracle Clients. This will provide robustness assurances and reduce reliance on off-chain software implementation. The post lists pros and cons of the proposal and ends with an informal poll. The proposal is explained in detail, and the post also invites questions and constructive criticism.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.299945887445887
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#2",
                    "likes": "2",
                    "time": "16/12/2020-07:07:05",
                    "content": "For clarity, I think this proposal is interesting and important but I wouldn’t have written it up and solicited community agreement or disagreement without SourceCred.  A few Dai can bridge the gap between a thought and a post. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#3",
                    "likes": "10",
                    "time": "16/12/2020-07:55:24",
                    "content": "Creating a second client implementation in Golang (ghost) is already on the roadmap for my team in 2021 and something we’ve been steadily working towards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving information about proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#4",
                    "likes": "0",
                    "time": "17/12/2020-06:52:42",
                    "content": "Very cool.  That may give you some insight on this: What’s a general range of engineering time needed to develop one new, independent client implementation by a new team? In other words, very roughly how much of the surplus buffer might MakerDAO need to use to fund one client as described in this proposal? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.451704545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#5",
                    "likes": "0",
                    "time": "17/12/2020-17:33:53",
                    "content": "Has anyone looked into NEST protocol? It seems like a legit on-chain verified price oracle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "18/03/2021-23:33:54",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}