{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/reporting-and-transparency/7233",
            "title": "Reporting and transparency ",
            "index": 7233,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "10",
                    "time": "29/03/2021-08:20:28",
                    "content": "If the Maker community is going to function properly as an distributed organisation we need to have some form of internal transparency and reporting with regards to the activity of Core Units. As long as the Foundation was in charge the information flow ended up there, but with the transition to the Community things will have to be done differently. Core Units that have both their mandate and their budget approved by the Community will also have to report status and have some form of transparency of activities. Otherwise the community has no way of checking if the Core Unit is doing anything useful, if they are successful in achieving goals or if they have problems they need help to overcome. Let me be specific The last couple of weeks has seen some proposed Core Units with some apparent overlap between mandates. A post was made pointing this out. Do note my slightly unfair tactic - in the chart I am comparing already existing groups like GRO and MARCOMMS with proposed Core Units. This touches off some defensive response providing information. The method is continued in replies to the post about the Marcomms Core Unit. @Sebventures then really uses the hammer. The people in GRO are now so provoked they will simply have to respond and @MarianoDP’s excellent reply provides more insight into the as-is situation at GRO than I have ever heard in all my involvement with Maker starting in 2016. The community now knows several things that were not known until last week  GRO has identified the need for a fiat on/off ramp as extremely important but solving this has yet to begin. MARCOMMS will not consider the use of emotional arguments in their marketing, prefering education. Marketing of MKR is not on the mandate for any group, marketing of DAI is shared by at least four existing and proposed groups. This type of information is highly valueable for the discussion around MKR minting.  All of the above is excellent and relevant information, the only problem is that it was extracted through emotional provocation. This is highly suboptimal, creating lots of stress, but plainly necessary when the groups in question will not provide the community with a real-talk version of their activites. How about we evolve? We need some system for reporting and a certain level of transparency from Core Units to the Community. The Smart Contract team has a chart for Liq2.0 implementation displayed at meetings. @mrabino1 has a state of business thread updated every month at least. These are examples that can be built upon. Possibly signal requests could be used for this? Or the Core Unit could be totally open to questions from GOV001 which then could choose what to tell the community? I hope other community members pick up on this - we need something here. Feedback appreciated and as always please point out my mistakes. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-strategic-marcomms-core-unit/7189/4",
                        "https://forum.makerdao.com/t/business-strategy-and-evaluation-framework-for-business-like-core-units/7218",
                        "https://forum.makerdao.com/t/business-strategy-and-evaluation-framework-for-business-like-core-units/7218/10",
                        "https://forum.makerdao.com/t/6s-capital-state-of-the-business/4420",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-april-4th-2021/7419"
                    ],
                    "GPT-summary": "The author proposes the need for internal transparency and reporting of Core Units in the Maker community. The author highlights the importance of having a system for reporting and a certain level of transparency from Core Units to the Community. The post also includes constructive criticism of the current situation and extends an invitation for feedback and suggestions.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.610510204081632
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "6",
                    "time": "29/03/2021-09:33:29",
                    "content": "Reporting is indeed important. In the startup world, there is a clear correlation between reporting and performance (but correlation is not causation). The RWF Core Unit publish a monthly reporting since January. The idea was to provide the community real facts on what was done. It’s far from perfect. The format might evolve and I’m not sure it would be better to follow a template. OS also has one weekly reporting format. Another point of reporting and transparency is participating in the discussions. This seems an easy way for future Core Unit Facilitators to bring value to the table. Having those discussions is not easy. It would be easier not to care. But I really think MakerDAO can easily be a $100B market cap so … ",
                    "links": [
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-22-24-2021/7192"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "2",
                    "time": "29/03/2021-11:13:12",
                    "content": "Personally I am okay with reporting and transparency–even if it’s old news. I learned over the weekend that the BD Core Unit cannot disclose pending deals–which makes sense. But yes, I agree that the community would like to hear and see more of what is unfolding underneath. I hope we will get more details. I believe we will. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "4",
                    "time": "29/03/2021-11:14:33",
                    "content": "    Planet_X:  Or the Core Unit could be totally open to questions from GOV001 which then could choose what to tell the community?   I don’t want GOV-001 to be the gatekeeper of information in the general case, (if there is some specifc info-hazard or something, sure). I think that it’s up to the facilitators of each core unit to ensure that they communicate effectively with governance (or employ someone to do so on their behalf.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#5",
                    "likes": "2",
                    "time": "29/03/2021-11:23:43",
                    "content": "    Planet_X:  @MarianoDP’s excellent reply  provides more insight into the as-is situation at GRO than I have ever heard in all my involvement with Maker starting in 2016.   I agree this is just ridiculous, especially because He didn’t break any NDA communicating the very few informations he gave us. (thanks @MarianoDP!) My impression is simply that, while the Foundation was running things, there was no incentive at all for people to communicate their work to the community/governance. And this is understandable. Now, since these CU will have to be voted, things will probably change, as we are starting to see. My suggestion, is that we (governance) might offer good salaries but also short-duration ‘contracts’ (3/4 months) as opposed to 3-4 years, in such a way that, if we are not happy with the results/transparency, we are free to liquidate a given Core Unit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.714102564102564
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#6",
                    "likes": "4",
                    "time": "31/03/2021-14:47:49",
                    "content": "    Planet_X:  GRO has identified the need for a fiat on/off ramp as extremely important but solving this has yet to begin.   Hi Planet X, Is not just “FIAT on ramps”, if we want to mimic USDC levels of adoption I said that we probably need to implement the whole structure of API payments, wallet management, KYC/AML process, on/off ramps and more, while also we exchange every DAI for 1 USD, no matter what. Since that is kinda utopic at the moment, we should be working side by side with potential clients to find the right product for them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.385714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#7",
                    "likes": "1",
                    "time": "31/03/2021-15:01:25",
                    "content": "    MarianoDP:  Since that is kinda utopic at the moment, we should be working side by side with potential clients to find the right product for them.   yeah I am not sure competing with USDC is the right way to go. Example: @SebVentures mentioned that large amounts (billions) of tether USDT are being used in Asia, as we speak, to do cross-border payments (for obvious reasons). That is a market where DAI can shine if we improve on our fundamentals: decentralisation. Let’s leave     MarianoDP:  wallet management, KYC/AML process, on/off ramps and more   to USDC. Money will flow to DAI anyway if we improve our fundamentals, where USDC and USDT cannot compete. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.739795918367347
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#8",
                    "likes": "3",
                    "time": "31/03/2021-15:39:18",
                    "content": "Honest question, How you know that those billions look for decentralization? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "1",
                    "time": "31/03/2021-15:57:55",
                    "content": "    iammeeoh:  Let’s leave     MarianoDP:  wallet management, KYC/AML process, on/off ramps and more   to USDC. Money will flow to DAI anyway if we improve our fundamentals, where USDC and USDT cannot compete.   Sir, unfortunately KYC/AML is inevitable– let’s just accept that–this way we won’t be surprised when it is required. What can you do. Governments don’t like it when we get a free ride. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#10",
                    "likes": "0",
                    "time": "31/03/2021-16:10:02",
                    "content": "    flipflopflapdelegate:  Sir, unfortunately KYC/AML is inevitable   KYC of what? DAI ownership? MKR ownership? Vault ownership? These are 3 different things. I believe DAI ownership will never need KYC. In any case, BTC is worth >100 billions and it’s decentralised and requires no KYC. If we fail at decentralisation (=no KYC for DAI holders), somebody else will succeed.     MarianoDP:  Honest question, How you know that those billions look for decentralization?   @SebVentures mentioned that a lot of these asian transactions are used to circumvent sanctions/embargos/etc. Just take all the money flow form/to Iran, the ridiculous situation of Dubai as a money laundering entity and gold world-hub (mostly coming from Africa in illegal ways), etc. We should not target these markets in any way. But just realise that the demand for decentralised and country-independent money is real. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.893939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#11",
                    "likes": "5",
                    "time": "31/03/2021-16:12:19",
                    "content": "    flipflopflapdelegate:  Sir, unfortunately KYC/AML is inevitable– let’s just accept that–this way we won’t be surprised when it is required. What can you do. Governments don’t like it when we get a free ride.   That’s a no go for me dog. The day that happens I sell my MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "0",
                    "time": "31/03/2021-16:17:43",
                    "content": "    iammeeoh:  KYC of what? DAI ownership? MKR ownership? Vault ownership? These are 3 different things.   Not sure Sir, we have to wait for guidance–which could take a few more years–so, we still have a lot time to roll the dice, and innovate.     Aaron_Bartsch:  That’s a no go for me dog. The day that happens I sell my MKR.    But, why–one day you might become the Federal Reserve Board Governor for Maker Canada? You can shake hands w/Trudeau on behalf of the DAO ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "0",
                    "time": "31/03/2021-16:19:11",
                    "content": "I wasn’t thinking about business under an embargo. Just regular businesses, not sure why they aren’t using USDC. Maybe we don’t know enough about that to start with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#14",
                    "likes": "0",
                    "time": "31/03/2021-16:19:12",
                    "content": "    flipflopflapdelegate:   But, why   Because, if we fail at decentralisation, others will succeed. And the value of MKR might drop, accordingly (or not, who knows). E.g., if the KYC problem is deeply associated with the 1:1 peg with USD, we might switch to a peg with gold. And if we do not, others will. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#15",
                    "likes": "2",
                    "time": "31/03/2021-16:20:42",
                    "content": "That’s just replacing the system with a similar system isn’t it? Aren’t we here to espouse the values that decentralization can bring to the world, not just take that power away and give it to ourselves? The road to hell is paved with good intentions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#16",
                    "likes": "2",
                    "time": "31/03/2021-16:29:29",
                    "content": "I mean, in any case the ones above are just personal opinions. But I think decentralisation is definitely one of the topics where there should be a very clear, well-discussed and transparent community discussion. If the roadmap for the next 2-3 years is: KYC, talking with the US government, banks, lobbying, etc. That’s completely fine. But it should be discussed clearly, transparently, and be voted on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.208854166666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#17",
                    "likes": "5",
                    "time": "01/04/2021-04:13:59",
                    "content": "If by decentralization you mean censorship resistance - yes, this is a core principle of Dai and I very much doubt it will ever be jeopardized (honestly we may as well hang up our hats and call it a day if it is). With that being said, very few people care about decentralization philosophically, and those who do generally only care until it costs them money. People care about the tangible benefits of a decentralized system. This is why we’ve historically targeted integrations and use cases where Dai is used as a savings mechanism (store of value) - higher savings rates are Dai’s tangible benefit of being outside the existing financial system. To illustrate this further… There’s four functions of money: (1) Medium of exchange (2) Store of value (3) Unit of account (4) Standard of deferred payment (i.e. used to denominate debts) I’ll throw out (4) for the moment because that is implicit to Dai’s generation process. Item (3) can be mapped to what I’d call the “blockchain vertical,” i.e. when dapps use Dai as a native currency. Augur and Erasure are good examples of applications where Dai is the exclusive unit of account. We’ve historically been very successful in this vertical, Dai is far more adopted across dapps than USDC or USDT. But items (1) and (2) are where the real volume is, and where you can penetrate markets that are outside of out existing ecosystem. Now when we look at (1), this is effectively payments and cross-border transfers. This requires deep liquidity, little to no slippage, and very easy on/off-ramps. USDC and USDT will beat us at this game every day because they have access to the banking system. Maker has to generate its liabilities on-chain, USDC and USDT can tokenize others liabilities without limit. But that leaves them in a precarious position, because when you tokenize someone else’s liabilities you can only offer a fraction of the interest that they’re willing to pay you (in this case it will map pretty closely to LIBOR). Dai, on the other hand, sets its savings rate based on the net stability fees earned from its pool of collateral and loans. It doesn’t have to rely on the legacy banking system for its rates. This is a huge advantage especially at a relatively small scale. Dai can win the market, but we need to be intelligent about how we position ourselves. It’s been my belief for the past several years that Dai as a store of value is the path forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.673333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#18",
                    "likes": "4",
                    "time": "01/04/2021-05:09:46",
                    "content": "Reporting and transparency are vital to the success of MakerDAO, and I doubt if anyone would disagree with that. What made me want to launch my unit is the belief in a better way to run an organization that is decentralized with information openly shared to the extent possible. I am confident that it is also a belief shared by the community, and it is the same belief that prompted someone like me from the foundation to launch their unit. The community wants clear answers on different topics, which is understandable. There is also a lack of trust and information sharing, which I believe can improve as we have more of these conversations going forward. As for my unit, we plan to provide a monthly report so the team can effectively share the information with the community like we have stated in our proposal. I want to point out that we all share a common goal of wanting MakerDAO to achieve its full potential, and we are all keen to contribute in the way we can best do so. Based on this common ground, let me share my thoughts as someone who has proposed a unit. I can’t agree more with you about finding the process stressful. For example, I honestly find your suggestions on marketing campaigns engaging, and my response wasn’t meant to be defensive, but somehow it was taken that way by others. Another example, I don’t think I have said the use of emotional arguments is something we wouldn’t consider. However, that is being listed in this post as a fact. When comments are taken out of context, or someone starts using the language of doubt and distrust, it would generally be difficult to continue a conversation productively. (I am not pointing fingers here. I only want to get my points across.) Let me share how I view the process so far, hoping that the community can see the information isn’t meant to be hidden somewhere or not shared. Starting a unit and making proposals to the Maker governance community is unlike a centralized entity where decisions can easily be made and executed. There are still many moving parts that need to be considered. In the case of Strategic Marcomms, strategies and deliverables need to be discussed thoroughly. Bringing in each team member’s expertise and engaging in the process is my way of building a solid team and how I see we can achieve our goals effectively. That conversation is taking place simultaneously as we assemble the team, working on business strategy and evaluating budget. Trying to do all these, including securing the best talents at one’s best ability simultaneously without knowing the outcome, can also be challenging. After the set of proposals are submitted, including our strategy and plan, we are ready to hear the community’s suggestions. Since we highly value the community’s comments and feedback, we plan to take that and reassess the strategy we have put together after this Request-for-Comments period. Therefore, rather than having something set in stone like having affirmative answers on whether we will or will not run XYZ kind of campaign, we instead have the overall direction and regional strategy and approach set. That way, we can address some of the community’s concerns and suggestions to achieve our mandate and serve the community. We can also be agile and adjust to the market environment when needed. On information sharing, how about having a list of questions and another list of suggestions so the units can address them? So far, the two have been mixed in discussions where intention and purpose sometimes get lost in long threads, creating misunderstanding. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp9-strategic-marcomms-core-unit/7189"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.282170542635659
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#19",
                    "likes": "0",
                    "time": "01/07/2021-11:09:55",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}