{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-01-14/12657",
            "title": "GovAlpha Weekly Update - 2022-01-14 ",
            "index": 12657,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "7",
                    "time": "14/01/2022-20:26:45",
                    "content": " GovAlpha Weekly Update  Highlights  We finally launched the Maker Operational Manual (announcement post here)! Huge thank you to everyone involved, but especially to @Gala for handling the launch and signing up for ongoing management.  @LongForWisdom, @prose11 have been spending time planning for the next year of work at GovAlpha. At this stage, primarily identifying priorities and reaching out to other Core Units to organize collaboration and shared work. This week we spoke to @0xdeniz from DUX.   Quarterly Focuses As we enter Q1 2022, we have two new quarterly focuses - Participation and Exploration. Not too much to report for these yet, but we have some plans which we’ll start talking about and actioning over the coming weeks.  Other Stuff   @hernandoagf and @TheExistence have been speaking to @s_ben about the sourcecred payout process and how we can bring all the maintenance work in-house (so to speak.)  @Blimpa has been working on a guide for using the MIPs Portal effectively.  @Prose11 got stuck with a lot of document reviews and meetings.  @mkrorbrkr is know known as @Patrick_J.  @LongForWisdom and @Patrick_J working on some new docs for the manual for Flash Mint and D3M Modules.  @Gala launching the Maker Operational Manual, and organizing domain redirection, updating templates with new links, etc.  @LongForWisdom working on the GovAlpha quarterly review and on the Intangible Asset Assignment MIP.  @Sebix working on MIP55 amendments and translating some content for the Operational Manual.   Weekly Assignments  Executive Process - @Patrick_J, @LongForWisdom  Polls Process - @LongForWisdom  Governance and Risk Meeting Chair - @prose11 (as a sidenote, Payton is going to be doing this more often in the future) GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @Patrick_J  MIPs update - @Blimpa, @Gala and @Sebix  Collateral Status Sheet - @Patrick_J  Office Hours - @prose11, @LongForWisdom   ",
                    "links": [
                        "https://forum.makerdao.com/t/announcing-maker-operational-manual/12553",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.806818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "14/04/2022-20:26:47",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-08-26/10034",
            "title": "GovAlpha Weekly Update - 2021-08-26 ",
            "index": 10034,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "2",
                    "time": "26/08/2021-16:25:43",
                    "content": " Highlights   @prose11 synced up with DUX to go over how GovAlpha uses the Voter Portal and what tools and additions could help GovAlpha  @Sebix has been working on forum organization, taking on the mammoth task of classifying the many tags and finding new Discourse Plug-ins to make finding information easier. Delegation showing up strong this week, with 2 Executives passed and over 55k MKR delegated to our Recognized Delegates   We won’t interrupt his R&R w/ a tag, but LongForWisdom is on vacation this week, so please direct any Governance questions and concerns to me (at least until Monday  )   Votes  There was a minor delay in getting this week’s executive posted but it was still able to pass within a few days. Mandated Actors discussed not having an Executive proposal for this week again, a more detailed post will be put up after today’s Governance and Risk Call.   Calls   @Gala has been producing call summaries for many Governance related videos, like the Meet Your Delegate series, take a look at the forum threads to see the great work!  @prose11 hosted the latest Meet Your Delegate Call - #4 featuring @MakerMan. Those wishing to delegate to any of the people featured on these calls can do so from the Delegates Tab of the Voting Portal.   SourceCred  Governance Boost has been further delayed  we’re giving our model of incentivizing Signal Requests and MIPs one more go, but will be exploring other options for further incentivizing Governance posts in the forum if we’re unable to find a satisfactory algorithm tweak. On the brighter side, work on the Onchain Technical Design is moving along on schedule, following a meeting to review some code with @NikKunkel and the SourceCred (Kevin and @s_ben <3)   MIPS   @blimpa has been hard at work, updating repos, fixing typos and formatting to keep our MIPs looking clean. Additionly, Pablo has met with DSpot for the latest push to the MIPs Repo fixing some minor bugs and improving menu selection.   Continuing Maker Operational Manual (MOM) Work  Not much to update from last week, but worth noting the PRs and contined drafting/editing/and PM work dont by @Gala , @Patrick_J , and @AstronautThis ! Really appreciate these awesome contributions     Weekly Assignments  Executive Process - @prose11  Polls Process - @Elihu + @Sebix  GovAlpha Weekly Update - @prose11  MIPs Update - @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/executive-delay-2021-08-21/9970",
                        "https://forum.makerdao.com/tag/meet-your-delegate",
                        "https://youtu.be/Cm0Qy8PTEf0",
                        "https://vote.makerdao.com/delegates?network=mainnet",
                        "https://forum.makerdao.com/t/sourcecred-onchain-technical-design/9324",
                        "https://mips.makerdao.com/mips/list",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-156-thursday-august-26-17-00-utc/9986/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-156-thursday-august-26-17-00-utc/9986/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-60/10082",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/50",
                        "https://forum.makerdao.com/t/maker-relay-ep-60-en-espanol/10375"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.112047898338221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "1",
                    "time": "26/08/2021-19:56:14",
                    "content": "Delegate feature request: Can you add the number of MKR owned by the delegate? Currently, the UI only shows the amount delegated which can be different from the total voting weight. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#3",
                    "likes": "1",
                    "time": "26/08/2021-20:10:10",
                    "content": "I don’t know how meaningful that would be – the delegate may have delegated to themselves (from another address), or may just keep their own voting separate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "0",
                    "time": "26/08/2021-20:15:02",
                    "content": "Hm yeah, does the delegate UI encourage delegates to delegate to themselves? That seems like a good idea that may not be obvious. It wasn’t obvious to me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "1",
                    "time": "26/08/2021-22:40:06",
                    "content": "    prose11:  over 55k MKR delegated to our Recognized Delegates   I want to highlight this achievement. In a decentralized way, MKR holders have nominated @PaperImperium and @Planet_X to act as co-CEOs of MakerDAO. Contrary to most other elections, there is no term and no need for a term limit. MKR holders can withdraw or reassign their support at any time. I feel like this is really a novel leadership model, and I’m proud to be a part of it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.96875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "0",
                    "time": "29/08/2021-13:43:30",
                    "content": "    prose11:   On the brighter side, work on the Onchain Technical Design is moving along on schedule, following a meeting to review some code with @NikKunkel and the SourceCred (Kevin and @s_ben <3)    How cool, it would be brutal to see that change and be able to save Maker some ETH. In fact we miss the weekly updates from @s_ben  it was interesting to see how week by week that Podium ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.053571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#7",
                    "likes": "0",
                    "time": "01/09/2021-04:56:19",
                    "content": "Here you go!     SourceCred distribution for week ending August 29th, 2021 Governance       The weekly SourceCred payouts are here! A hosted instance of SourceCred running on the Maker forum can be found here.  For details on opting in, see Opting in to Sourcecred/Wth is SourceCred?.  Announcements   WARNING:  Cred scores and payouts may see volatility in the coming weeks and months as we tweak the algorithm and payout parameters. We still have a lot of work to do before the system is optimized enough to “ossify”, producing predictable payouts.  Payouts  This week $5,…     Glad you appreciate the weekly posts. I’ve been pretty slammed lately between internal SourceCred stuff and other SourceCred-related work for Maker, so have been doing bi-weekly for a couple months. In part because the engagement on those posts has trailed off a bit, but if there’s demand, down to continue weekly. ",
                    "links": [
                        "https://makerdao.sourcecred.io/#/explorer",
                        "https://forum.makerdao.com/t/opting-in-to-sourcecred-wth-is-sourcecred/3913/1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.980902777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "30/11/2021-04:56:40",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-08-12/9825",
            "title": "GovAlpha Weekly Update - 2021-08-12 ",
            "index": 9825,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "3",
                    "time": "12/08/2021-16:53:29",
                    "content": " Highlights  We’ve now had our third Meet Your Delegate call, and for the time being we’ve run out of prospective recognised delegates. Next steps are to sort out participation and communication tracking for Recognised Delegates, and continue to push for integrations of the delegate contracts with custody providers such that larger MKR Holders can vote securely. Our combined Q4 2021 and Q1 2022 Budget is now up on the forum, covers the next 6 months. In general we’re moving towards longer budgets, aiming for 12 months, with the goal that Governance only needs to deal with this once a year.  @Gala is helping us organise and make concrete progress on launching the Maker Operational Manual, a set of documentation written for the individuals, groups and delegates that make up Maker Governance. Pablo is now a full MIP Editor! Congratulations @blimpa!   External Governance Stuff Delegation Proceeding well, see highlights above. MIPs Portal Work continues on bug-fixing and additional features. Snapshot Proceeding nicely. @LongForWisdom looked over the admin and settings stuff since last week and looked over the functionality. Looks very useful. Particularly it implements approval voting, which is really useful. Tags and Forum Continued work on this from Sebix. Maker Operational Manual See above, but this is now proceeding much more effectively thanks to Gala. Also using these tasks as stuff to onboard @Gala, @AstronautThis and @Patrick_J. SourceCred Remains stalled. Nothing too much to report here. Video Production In the process of putting together frameworks for educational videos to help people understand the Maker Governance framework and some of the key parts of the DAO. These will be handed off to @Content-Production for production once done.  Random other stuff Handing off some responsibilities to GovComms Things like ‘forum at a glance’ are being handed over where possible. Also giving them more responsibility on communicating the mandated actors discussions and work items going forward. Working on DAI Supply @LongForWisdom spending some time figuring out possibilities for DAI minting and trying to understand the costs they impose on MakerDAO. GovAlpha Trying to figure out how to make GovAlpha more effective with communication between facilitators and effectively dealing with contributors that come from timezones across the planet. Weekly Assignments  Executive Process - @prose11  Polls Process - @LongForWisdom, @Sebix  GovAlpha Weekly Update - @LongForWisdom  MIPs Update -  @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-58-en-espanol/9949",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-154-thursday-august-12-17-00-utc/9793/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-58/9892",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-154-thursday-august-12-17-00-utc/9793/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.888090277777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/11/2021-16:53:38",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-05-20/15292",
            "title": "GovAlpha Weekly Update 2022-05-20 ",
            "index": 15292,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "5",
                    "time": "20/05/2022-19:55:52",
                    "content": " GovAlpha’s Current Priorities   Prioritization framework - @prose11 taking the lead on this. Nearing it’s final form. Was introduced at the G&R 2 weeks ago - Youtube timestamp.   Q1 Report and Budget return - @prose11 and @Gala have collaborated on this. For sign-off from @LongForWisdom and @Patrick_J next week prior to publication.   Off Chain Incentives - @LongForWisdom and @TheExistence working on this with technical support from @hernandoagf. Expect published plans, with accompanying docs added to the Operational Manual in the near future, with planned modifications to sourcecred distribution as well as some other exciting changes aimed at improving Governance engagement.   On-Chain Incentives - @LongForWisdom and @Patrick_J had initial meeting about this today, consensus reached on a very rough draft of ideas, will start reaching out to various CU personnel and possibly some delegates in the next week for opinions. Anyone interested in this, feel free to get in touch.   Recognized Delegate MIP set - @Patrick_J still working on this.    DAO Facing Work This Week   Post-mortem for 2022-04-14 - @LongForWisdom taking point, remains on hold due to other protocols that are affected. Will be published once we get the go-ahead.   CU Offboarding Amendment - @Gala and @blimpa continue to work on this with @twblack88. New proposal thread here.   Discourse and Operational Manual Improvements - with Github announcing support for mathematical expressions, @hernandoagf is co-ordinating getting this added to the forum and to the Operational Manual (with support from Tech-Ops).   Facilitator Onboarding - @Patrick_J posted his Facilitator Onboarding subproposal, check it out here.    Other Ongoing Work   @hernandoagf is working on a checklist for the weekly executive spell verification process   @LongForWisdom is working on a poll metadata overhaul with DUX with the aim of improving functionality of the voting portal, including a much-requested search feature among other improvements.    Routine Tasks   Weekly polls - @Patrick_J leading, @TheExistence reviewing and @Gala and @Sebix writing.   G&R hosting - @prose11   Weekly Executive - @blimpa and @prose11 doing this   Delegate Tracking - @TheExistence   MIPs - @Gala and @blimpa and @Sebix   Governance Tracker - @Patrick_J   Sourcecred maintenance - @hernandoagf and @TheExistence   ",
                    "links": [
                        "https://youtu.be/ZJSmzCTSbsA?t=3306",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://forum.makerdao.com/t/new-mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://twitter.com/github/status/1527345223898042368?t=A-OFvRHl9fV_E1aYARj6kQ&s=19",
                        "https://forum.makerdao.com/t/mip41c4-sp37-governance-facilitator-onboarding-gov-001/15284",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.098037190082644
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "18/08/2022-19:56:18",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-11-26/11847",
            "title": "GovAlpha Weekly Update - 2021-11-26 ",
            "index": 11847,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "3",
                    "time": "26/11/2021-18:51:04",
                    "content": " GovAlpha Weekly Update  Quarterly Focuses  Delegation   @JustinCase completes his ‘Meet Your Delegate’ meeting and joins us as a Recognized Delegate! This brings the number of Recognized Delegates to 8. This is definitely an improvement but I’m hopeful that we can push the total into double digits over the next few months.  @Patrick_J has really stepped up the last few weeks to take charge of managing GovAlpha’s responsibilities in relation to delegates. He’s been keeping track of metrics, and is going to be taking the lead on the first set of delegate compensation for November.  @LongForWisdom spent some time with @tiago of DUX Core Unit discussing and brainstorming ideas for the delegates UI on vote.makerdao.com. The current UI is already fantastic, and it’s largely thanks to Tiago’s efforts on the UI/UX. Thanks for putting up with me, guys!   Robustness  Over the last couple of weeks we’ve been focusing more heavily on sharing knowledge around the executive process, further reducing bus-risk for the CU.  @blimpa has spent some time helping identify and squash bugs in the MIPs portal alongside his usual responsibilities helping MIP authors tidy up their proposals.  @Patrick_J been ensuring that there are no errors or issues with delegate tracking and compensation.  @TheExistence has been learning how to handle the Maker SourceCred payouts.   Other Stuff   @LongForWisdom continues to work on getting the Maker Operational Manual ready for publication. Planning fallacy has been hitting me hard on this one. I’m still moderately confident I can get it up in November, though may slip til early December. @AstronautThis and @Patrick_J have been helping too.  @prose11 spent some time working with the incubating talent core unit to share some of GovAlpha’s personnel requirements.  @Sebix has been working on a website documenting what GovAlpha does in practice. We’ve written about this before in a few places, but we’re hoping to get it all compiled so that we can use it for transparency and onboarding.  @ceresbzns and @TheExistence are continuing to research governance in other DAOs and crypto-protocols.   Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @LongForWIsdom, @Patrick_J, @AstronautThis, @Sebix  Governance and Risk Meeting Chair - @LongForWisdom  GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @Patrick_J  MIPs Update - @blimpa  Collateral Status Sheet - @Patrick_J   ",
                    "links": [
                        "https://forum.makerdao.com/t/under-construction/12274/6",
                        "https://forum.makerdao.com/t/maker-relay-ep-73-en-espanol/11900",
                        "https://forum.makerdao.com/t/maker-relay-ep-73/11882"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.225574712643678
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/02/2022-18:51:38",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-07-22/9485",
            "title": "GovAlpha Weekly Update - 2021-07-22 ",
            "index": 9485,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "7",
                    "time": "22/07/2021-16:19:17",
                    "content": " Highlights  Vote Delegation has been announced, along with the Recognised Delegate Requirements, and the Recognised Delegate Code of Conduct. Huge props to @LongForWisdom for managing the delegation process and all the documentation work. Budget drafting has begun with the intent to file a 6-month budget by the August 11th cut-off for the September Governance Cycle. Last weekend a replacement executive spell was put up through collaboration with GovAlpha and Protocol Engineering. You can read the Governance Report detailing what happened and lessons learned for similar situations in the future.   External Governance Stuff MIPs Portal @blimpa has been working closely with DSpot to upgrade the MIPs Portal. Keep an eye out for the latest version launching today, featuring subproposal groupings and new menu options.  Delegation In addition to the documentation work, @LongForWisdom has been crushing, the first Meet Your Delegate call has been scheduled for July 28th @ 18:00 UTC. Come participate and see what @flipflopflapdelegate, @PaperImperium, and @twblack88 have to offer as delegates. VC Communications A separate task has been added to the GovAlpha weekly assignments list for communication on voting events with VCs. While this has been done by @LongForWisdom solely in the past, the split effort among facilitators has brought increased participation to this month’s Ratification Polls. SourceCred @prose11 continues his efforts to bring a Governance Boost to the SourceCred algorithm. A revised batch of parameters has been sent over to the SourceCred team for data verification. Additionally, GovAlpha is coordinating a meeting to touch base on future payment administration and the Onchain Technical Design detailed last week.  Internal Governance Stuff  Onboarding tasks continue for @Sebix, @AstronautThis, and @Patrick_J. @Gala has started doing some initial Forum and MIPs tasks. It’s budget time again. @LongForWisdom and @prose11 have started their list, will be checking it twice, and consulting with the rest of the Core Unit before publishing the subproposal.  Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @prose11 , @Sebix  Forum at a Glance -  @Sebix  GovAlpha Weekly Update - @prose11  MIPs Update - @Davidutro and @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/recognised-delegate-requirements/9421",
                        "https://forum.makerdao.com/t/recognised-delegate-code-of-conduct/9384",
                        "https://forum.makerdao.com/t/july-17th-2021-replacement-executive/9413",
                        "https://mips.makerdao.com/",
                        "https://forum.makerdao.com/t/meet-your-delegate-1-wednesday-july-28-6-00-pm-utc/9424",
                        "https://vote.makerdao.com/polling?network=mainnet",
                        "https://forum.makerdao.com/t/sourcecred-onchain-technical-design/9324",
                        "https://forum.makerdao.com/t/maker-relay-ep-55/9531",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/44",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-151-thursday-july-22-17-00-utc/9423/4",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-151-thursday-july-22-17-00-utc/9423/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-55-en-espanol/9715"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.304812834224599
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/07/2021-23:59:52",
                    "content": "    prose11:  Additionally, GovAlpha is coordinating a meeting to touch base on future payment administration and the Onchain Technical Design detailed last week   I can’t wait to see it in operation and know that it will be great from the start!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#3",
                    "likes": "2",
                    "time": "25/07/2021-13:54:11",
                    "content": "Huge props to everyone who was responsible for bringing vote delegation to MakerDAO. This should ameliorate the voter apathy problem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "0",
                    "time": "25/07/2021-20:46:08",
                    "content": "Quoting Uncle Ben “With great power comes great responsibility”. That delegates be aligned to the voters they represent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "23/10/2021-20:46:14",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-03-04/13655",
            "title": "GovAlpha Weekly Update - 2022-03-04 ",
            "index": 13655,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "8",
                    "time": "04/03/2022-20:34:49",
                    "content": " GovAlpha Weekly Update  Highlight  You might have noticed our Fast-Tracking RWA Signal got quite a lot of attention this week  Shout out to @LongForWisdom for drafting and to @williamr & @luca_pro for handling GovAlpha’s communication misstep professionally. We had several examples of contributor growth this week with @blimpa drafting today’s executive and @Gala handling the admin work for our internal February compensation distribution.   Quarterly Focuses  Participation   @TheExistence and @LongForWisdom continue work on off-chain incentives.  @prose11 and @LongForWisdom met with @0xdeniz and @Andrew_Hall to sort out on-chain incentives.  @Patrick_J working sorted out Recognized Delegate Compensation and finished out the final steps for our new Recognized Delegates, after @LongForWisdom hosted the most recent Meet Your Delegate call on Wednesday.   Exploration   @prose11 is drafting a post-mortem on the Content Production Offboarding (and what recommendations GovAlpha can make for community governance to improve the issues uncovered). Stay tuned for that early next week.  @hernandoagf has been developing tools to make our ownership of SourceCred payouts much smoother.  @TheExistence is preparing his first of a twice-monthly post on SourceCred happenings (inspired by the previous updates from @s_ben).   Other Stuff   @AstronautThis continuing to investigate how to determine a good value for the ESM Threshold. GovAlpha Leadership discussed and amended our MKR Compensation Proposal.  @blimpa showed us he can still crush Meet Your Delegate graphics.  @Gala presented on the G&R Call for the first time!   Weekly Tasks  Executive Process - @blimpa + @LongForWisdom  Polls Process - @prose11 , @TheExistence, @Gala  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @prose11  Delegate Metric Tracking - @Patrick_J  MIPs update - @Gala, @blimpa  Office Hours - @LongForWisdom + @prose11   ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp60-modify-govalpha-core-unit-mkr-budget/13145",
                        "https://forum.makerdao.com/t/meet-your-delegate-10-doo-wan-nam-and-flipside-crypto/13248"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.669065656565656
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/06/2022-20:35:20",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-02-04/13050",
            "title": "GovAlpha Weekly Update - 2022-02-04 ",
            "index": 13050,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "9",
                    "time": "04/02/2022-22:18:16",
                    "content": " GovAlpha Weekly Update  Highlights  Lots of work is being done on our next Core Unit DAI Budget. A bit of alpha:  Will be a 12-month budget   New expense categories to conform and help @Aes with the DAO-wide accounting Budgeting for a third facilitator     Drafting an MKR Core Unit budget, with a new formula we think might be useful for other CUs     Quarterly Focuses  Participation  First pages of the Maker Operational Manuel in Spanish have been pushed! Should aid in making Governance more accessible.  Meet Your Delegate #9 - Hasu, scheduled for next Wednesday   Exploration   @hernandoagf has been crushing things, exploring alternative incentivization mechanisms  @TheExistence is out on vacation, but @prose11 gave a final review to his SourceCred research this week so keep your eyes peeled   Long and Prose have been put in touch with a voting systems expert to explore the best methods for prioritization voting (thanks for the connection, @Andrew_Hall  )   Other Stuff   @Gala shadowed our invoicing process this week and has been stepping up to streamline our financial practices.  @Patrick_J and @blimpa stepped up to write and review today’s Executive, Prose was quite satisfied    @Patrick_J also published the Delegate Round-up January 2022    Weekly Tasks  Executive Process - @Patrick_J & @blimpa doing the hard work, @prose11 signing off Polls Process - @prose11  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @prose11  Delegate Metric Tracking - @Patrick_J  MIPs update - @Blimpa, @Gala and @Sebix  Office Hours - @LongForWisdom & @prose11    Did you reach the bottom of the post, anon  ? Please consider leaving some feedback below on how we can make these updates more useful and informative  ",
                    "links": [
                        "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-february-2022/13726"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.910468319559229
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/05/2022-22:18:35",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-07-01/9080",
            "title": "GovAlpha Weekly Update - 2021-07-01 ",
            "index": 9080,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "9",
                    "time": "01/07/2021-16:48:25",
                    "content": " Highlights  Adjusting Executive and Polling processes to make them more decentralized. Big thanks to dUX, @Derek  from Protocol Engineering and @dumitru from tech-ops. Initial Delegation templates + work put together. Prospective delegates now working on position statements. Will be starting ‘meet your delegate’ type meetings next week or the week after. New version of MIPs Portal pushed to production soon, Pablo and dSpot are responsible, thanks both for the good work. Updates should bring more polish + layout upgrades, bug-fixes, and improved server infrastructure.    External Governance Stuff  Process Updates  Adjusting Executive process to be more decentralized and improving the efficiency of the polling process. Big thanks to dUX, @Derek from Protocol Engineering and @dumitru from tech-ops.   Delegates  Delegation launch timeline is becoming more firm. More details soon.  @LongForWisdom - Initial Delegation templates + work put together. Prospective delegates now working on position statements. Will be starting ‘meet your delegate’ type meetings next week or the week after.   MIPs Portal  New version of MIPs Portal pushed to production soon, Pablo and dSpot are responsible, thanks both for the good work. Updates should bring more polish, bug-fixes, and improved server infrastructure. Pablo working on better MIP Proposal Documentation.   Forum   @Elihu has been finalizing some minor category updates and forum changes that should go live early next week.   Other External Stuff   @Aes posted Alternative MKR Compensation Guidelines (team effort with @LongForWisdom)!   Internal GovAlpha Stuff   @prose11 taking most of the week off.   Onboarding   @LongForWisdom continuing to run onboarding meetings for prospective contributors.  @AstronautThis starting work on some better signal process documentation in collaboration with @ultraschuppi   @Sebix working on polls + critical review of existing MIPs.  @Patrick_J working on some module documentation for the flash-mint module (which hopefully won’t be wasted, because it’s sure to pass eventually, right?!)   Transparency  Upcoming Quarterly Review for GovAlpha’s first quarter of operation nearly done - hopefully posted next week.   Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @LongForWisdom, @ultraschuppi  Forum at a Glance - @Elihu  GovAlpha Weekly Update - @LongForWisdom  MIPs Update - @Davidutro and @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-148-thursday-july-1-17-00-utc/9036/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-52-en-espanol/9209",
                        "https://forum.makerdao.com/t/maker-relay-ep-52/9191",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/39",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-148-thursday-july-1-17-00-utc/9036/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.96569264069264
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/07/2021-22:54:39",
                    "content": "Thank you for the update      LongForWisdom:  Adjusting Executive and Polling processes to make them more decentralized.   Would love to know more about that! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.708333333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "3",
                    "time": "02/07/2021-10:38:50",
                    "content": "    swakya:  Would love to know more about that!   Sure. So to be honest I was maybe less precise than I should have been here (which comes from writing this like 20mins before the G&R call.) I’ll explain what’s been done. I’ve also updated the initial post. Executive Process So the main change here is that the frontend now takes it’s content directly from github. Previously, Maker Foundation members had to ‘whitelist’ any executive that went up on the voting portal. Now it reads from github. What this means is that the Governance Facilitators can control what shows up on the portal directly, now, rather than relying on people working for the Maker Foundation to rubber stamp each executive. Polls Process So this is where that precision issue comes in, because while the polls process has been improved, it’s not really any more decentralized at this point. The improvements here are related to how the Governance Facilitators submit polls on-chain. Previously there was an input form to fill in on the voting portal where you would enter poll options, start and end time, etc. Now we have a system where all that is read + validated directly from github when we provide a URL. This seems fairly unexciting, but it’s going to make submitting polls like 5x faster, and that’s a weekly task that I normally need to do on Sunday night. So needless to say, I’m excited about it.  On another note, Payton has been whitelisted to put up polls on the frontend now as well. So one could argue that that has made the process slightly more decentralized.  Also of note is that these improvements are thanks to the dUX (incubating) core unit - I’m only really reporting it here because it’s related to governance and they don’t have a weekly update slot in the meeting at this point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.923333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "30/09/2021-10:39:35",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-06-10/15738",
            "title": "GovAlpha Weekly Update - 2022-06-10 ",
            "index": 15738,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "3",
                    "time": "10/06/2022-21:09:51",
                    "content": "The first week for GovAlpha without @LongForWisdom as a facilitator turned out to be a fairly eventful one.  Highlights  We discovered a MIP63c4 subproposal that we had inadvertently marked as archived and it consequently did not go on-chain last month when eligible. It will now go on-chain next week. Read the post-mortem here. We launched our new Prioritization polls - announced here. These can be found on the voting portal here and here. After launch, we were notified that voters selecting multiple options in the IRV poll had their selections reversed. This was caused by a bug that was introduced in a recent update to the voting portal and has now been fixed. Read the post-mortem from DUX here. We distributed May’s sourcecred on Friday - this was the last distribution using the “old” system. Moving forward we will use the new sourcecred implementation described here.   Other Work   @prose11 hosted a Meet Your Delegate Call with Chris Blec, check it out on Youtube here.  @Patrick_J hosted a Meet Your Delegate Call with mhonkasala & teemulau and ChicagoDAO delegates, check it out on Youtube here.  @Gala and @blimpa teamed up with @adcv from Strategic Finance to host a Know Your MIP about the recent budget MIP changes, Youtube upload is pending.  @Gala has been fine-tuning the Maker Operational Manual, and assisting with the team invoices for May  @hernandoagf has made some improvements to the sourcecred bot and is starting to look at ways to (at least partially) automate the delegate tracking process as we welcome more and more delegates to MakerDAO.  @TheExistence has been assisting with setting up the new sourcecred and off-chain incentive workstreams.  @LongForWisdom is taking a well-earned break, we look forward to welcoming him back in due course.   Weekly Assignments Lots of MIP ratification polls coming up on Monday, so a lot to do on the polls front.  Weekly polls - @blimpa leading with support from @AstronautThis, @Sebix @Gala  G&R hosting - @prose11  Weekly executive - no executive planned next week - announcement here  Delegate tracking - @Sebix  MIPs - @Gala @blimpa @Sebix  Governance tracker - @Patrick_J   ",
                    "links": [
                        "https://forum.makerdao.com/t/prioritization-framework-sentiment-polling/15554/",
                        "https://vote.makerdao.com/polling/QmYqBhDx",
                        "https://vote.makerdao.com/polling/QmdZezCr",
                        "https://forum.makerdao.com/t/jun8-22-post-mortem-for-irv-poll-issues/15671",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://www.youtube.com/watch?v=Hau_vkp6F9c",
                        "https://www.youtube.com/watch?v=KYiC2hVHwII",
                        "https://manual.makerdao.com/",
                        "https://forum.makerdao.com/t/no-planned-executive-2022-06-15/15701",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5852272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/09/2022-21:09:52",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-09-23/10481",
            "title": "GovAlpha Weekly Update - 2021-09-23 ",
            "index": 10481,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "7",
                    "time": "23/09/2021-15:52:09",
                    "content": " Highlights   @Sebix making strides dealing with tags on the forum. Current stage is just clearing out / combining less-used tags to aid discoverability.  @LongForWisdom working with delegates to resolve the question of delegate compensation.  @prose11 working on SourceCred on-chain technical design, figuring out auditors, etc.   Also of Note  Discord Migration   @LongForWisdom primarily creating the channel and role layout for the proposed discord server. Still considering feedback and requests for channels here.   Education   @blimpa working on scripts for a number of educational videos to be created by @Content-Production.  @blimpa published a primer for MIP authors which can be found on the MIPs Portal here. Any feedback gratefully recieved.  @Gala continuing her work organizing the Maker Operational Manual project. Multiple people now working on documentation. Hoping to be able to publish this in October.   Emergency Preparedness   @blimpa and @sebix helping @gov-comms-core-unit create content for the Emergency Playbook.   Onboarding   @Patrick_J and @TheExistence having their first turns at producing weekly polls.  @prose11 and @LongForWisdom working with @Gala on documentation and Maker Operational Manual management.  @TheExistence getting up to speed on SourceCred + Github.   Process Improvements   @Patrick_J looking at optimizing the Delegates Tracking sheet.   Other Notes   @prose11 is afk next week so @LongForWisdom is the point of contact.   Weekly Assignments  Executive Process - @prose11  Polls Process - @prose11, @sebix, @TheExistence, @Patrick_J  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @TheExistence, @Sebix  MIPs Update - @blimpa  Collateral Status Sheet - @Sebix   ",
                    "links": [
                        "https://mips.makerdao.com/mips/md-viewer?mdUrl=https:%2F%2Fraw.githubusercontent.com%2Fmakerdao%2Fmips%2Fmaster%2Fmeta%2Fprimer_for_authors%2Fprimer_for_authors.md",
                        "https://forum.makerdao.com/t/maker-relay-ep-64-en-espanol/10548",
                        "https://forum.makerdao.com/t/maker-relay-ep-64/10540"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/12/2021-15:52:32",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-10-14/11005",
            "title": "GovAlpha Weekly Update - 2021-10-14 ",
            "index": 11005,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "2",
                    "time": "14/10/2021-16:38:53",
                    "content": " GovAlpha Stuff  We’re under budget by a fair chunk. Going to be figuring out exactly how much, and how we send this back to the protocol, hopefully over the next few days.  @prose11 and I owe you a Quarterly Report, but they’re long and we’ve been busy. We’ll try to get it out before the end of October. Going to be posting these updates on Friday going forwards as part of pushing towards standardizing CU communications.   Quarterly Focuses  New quarter brings new focuses. For Q4 it is delegation and robustness.  Delegation - LFW currently working on delegate compensation. Signal is in progress, aiming to have delegates compensated starting November.  Delegation - Still waiting on custody providers to integrate with delegation contracts to allow larger MKR Holders to delegate. Anchorage is making good process.  Robustness - @blimpa is working on hardening the MIPs process to prevent last minute issues with MIPs going into formal submission.  Robustness - @LongForWisdom made post about standardizing the format of CU Budget Implementations so that it is more clear for governance and GovAlpha.   Other Initiatives   Discord Migration is on track. Should be opening up access to the server on Monday 18th October.  @Patrick_J working on implementing some common voting algorithms as part of a spreadsheet. This will help us compare and contrast various options with respect to prioritization.  Maker Operational Manual work continues. Aiming to get something like this month.  @TheExistence working on auditing governance processes being used in other protocols, and looking to see if there is anything we can learn.  @LongForWisdom working on governance processes with respect to Rune’s recent forum post.  @blimpa working on video scripts for educational governance videos.   Weekly Assignments  Executive Process - @prose11  Polls Process - @AstronautThis, @Patrick_J, @LongForWisdom  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @Sebix, @LongForWisdom  MIPs Update - @blimpa  Collateral Status Sheet - @Gala, @Sebix   ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4940711462450595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "14/10/2021-22:50:05",
                    "content": "    LongForWisdom:  Anchorage is making good process.   Can you please—or, are you able to provide more colour beyond this? Last time when I spoke to one of their customers they said it was an easy integration that any IT team should be able to execute within a few days. Also, it’s “under budget” two words  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.738095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/10/2021-10:52:17",
                    "content": "    flipflopflapdelegate:  Can you please—or, are you able to provide more colour beyond this?   Not really, I don’t like to speak in specifics about external parties. I’ve heard positive news recently, but I’m not willing to give specifics at this stage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71590909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/01/2022-10:52:42",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-02-11/13196",
            "title": "GovAlpha Weekly Update - 2022-02-11 ",
            "index": 13196,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "4",
                    "time": "11/02/2022-21:23:40",
                    "content": " GovAlpha Weekly Update   Highlights  Not one but TWO budget proposals went live this week, check our DAI Budget and MKR Compensation proposals. Key contributions to making the Maker Operational Manual available in Spanish.   Quarterly Focuses  Participation  Organizing meet ups with Delegates and VCs for ETHDenver. Chatting with @twblack88 about governance/ future of delegation.   Exploration   @AstronautThis exploring the ESM Threshold level (recently upped to 100,000 MKR). Researching alternative community compensation/incentivization structures (like Coordinape) for a coming discussion on the Protocol’s use of SourceCred. Meeting with SES to talk Maker Dashboards. Meeting with Strategic Finance to demo new budget reporting.   Other Stuff   @blimpa continues MIP onboarding for @Sebix and @Gala who spent time reviewing MIPs for Formal Submission.  @Patrick_J keeping our Governance Tracker in good shape. Introduced @hernandoagf to Data Insights to help with some governance queries.  @LongForWisdom drafting some awesome governance flow charts.   Weekly Tasks  Executive Process - N/A (taking a brief break on planned executives) Polls Process - @prose11, @blimpa , @Sebix , @AstronautThis, @Gala  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @prose11  Delegate Metric Tracking - @Patrick_J  MIPs update - @Blimpa, @Gala and @Sebix  Office Hours - @LongForWisdom   ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp60-modify-govalpha-core-unit-mkr-budget/13145",
                        "https://forum.makerdao.com/t/announcing-maker-operational-manual/12553",
                        "https://forum.makerdao.com/t/manual-operacional-de-maker-en-espanol/13173",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit?usp=sharing",
                        "https://forum.makerdao.com/t/planned-executive-proposal-update/13149",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-february-2022/13726"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.894886363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/05/2022-21:24:06",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-06-10/8680",
            "title": "GovAlpha Weekly Update - 2021-06-10 ",
            "index": 8680,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "7",
                    "time": "10/06/2021-15:36:28",
                    "content": " 3 Point Update  First distributions made from the GovAlpha Multi-sig  LongForWisdom is on holiday, @prose11 has been taking care of Governance things and attending meetings in his place. GovAlpha onboarding plans going well, met with Talent Unit from the SES Incubation program (forum post soon.)   External Governance Stuff  Delegates  UX Design for Delegation more or less confirmed, will be dUX Incubation Unit’s first priority. If you’re interested in being a delegate, please get in touch.   SourceCred  Payton working with Seth to figure out how to boost Cred for specific categories and tags. Progress slow, more complex than it sounds.  @flipflopflapdelegate posted in #speculation about upping the payouts for SourceCred, we’re happy to say this increase is already planned for in our Quarterly Budget, going up for vote on Monday   Public Calls   @blimpa has been making some awesome graphics for public calls, notably for the LexMaker Call   @prose11 hosted Episode 1 of What the World is doing with DAI with CurioInvest    Other External Stuff   @prose11 - Helping coordinate various community working groups, networking in Kernel Block III.  @blimpa working on new views for the MIPs Portal with DSpot   Internal GovAlpha Stuff  Onboarding  Met with Talent Incubator Unit about GovAlpha’s needs. Connected with @Gala about taking on more assignments for GovAlpha ‘Help Wanted’ post is written, pending feedback before posting.   Polls + Templates   @blimpa and @prose11 added templates to the MakerDAO Community Repo for Ratification polls in the new Monthly Governance Cycle, as defined by MIP51.   MIPs   @MIP-Editors coordinated Formal Submission with various MIP authors  @blimpa updated the MIP Editor Tracking sheet with feedback from @Davidutro and @charlesstlouis    Weekly Assignments  Executive Process - @prose11  Polls Process - @blimpa and @Elihu  Forum at a Glance - @blimpa  GovAlpha Weekly Update - @prose11  MIPs Update - @Davidutro and @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/lfw-holiday-07-06-21-to-14-06-21/8577",
                        "https://forum.makerdao.com/t/mip40c3-sp11-govalpha-core-unit-budget-gov-001/8002",
                        "https://forum.makerdao.com/t/lexmaker-1-i-dai-foundation-maker-ip/8528",
                        "https://forum.makerdao.com/t/speaker-tokenizing-collectible-vehicles-with-curioinvest/8541",
                        "https://mips.makerdao.com/",
                        "https://github.com/makerdao/community/tree/master/governance/polls/templates/MIPs",
                        "https://mips.makerdao.com/mips/details/MIP51",
                        "https://forum.makerdao.com/t/maker-relay-ep-49-en-espanol/8795",
                        "https://forum.makerdao.com/t/maker-relay-ep-49/8763",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-145-thursday-june-10-17-00-utc/8590/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.902304292929293
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/06/2021-17:46:17",
                    "content": "Love to hear that SourceCred is going up for a vote. Hope it passes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/09/2021-17:46:23",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-07-29/9585",
            "title": "GovAlpha Weekly Update - 2021-07-29 ",
            "index": 9585,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "4",
                    "time": "29/07/2021-16:52:22",
                    "content": " Highlights  Vote Delegation is set to soft-launch on August 2nd. The Recognised Delegates have begun publishing their delegate platforms. We had the first meet your delegate meeting this week, and have another next week. Good turnout and interesting questions and both delegates were very professional. Thanks to @PaperImperium and @flipflopflapdelegate. Next week we have @twblack88 and @Planet_X (same time.)  @Sebix has started to take a look at the tags on the Maker forum, with the goal of figuring out how to make them more useful, better organized and less sprawling.   External Governance Stuff Delegation Proceeding well, see highlights above. MIPs Portal Work continues on bug-fixing and additional features. Nothing super new to call out here, just lots of fantastic incremental progress. Forum Tags @Sebix working on figuring out an improved framework for tags. We’ve set some general goals, and he’s going to be suggesting changes to meet those goals. Snapshot In the process of setting up snapshot for Maker, with the assistance of DUX and @tmierzwa. ENS domain secured for testing. SourceCred Still making slow progress on Governance Boost - don’t want to break anything while attempting to improve it. Discussed on-chain technical design again this week. SourceCred have been going through some growing pains, but still confident they can deliver this.  Internal Governance Stuff  Onboarding tasks continue for @Sebix, @AstronautThis, and @Patrick_J. @Gala has started doing some initial Forum and MIPs tasks. Budget drafting is in progress with the intent to publish a 6-month budget by the August 11th cut-off for the September Governance Cycle.  Weekly Assignments  Executive Process - @prose11  Polls Process - @prose11 , @Sebix, @ultraschuppi  Forum at a Glance -  @Elihu  GovAlpha Weekly Update - @LongForWisdom  MIPs Update - @Davidutro and @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-56-en-espanol/9812",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-152-thursday-july-29-17-00-utc/9553/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-56/9649",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/45",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-152-thursday-july-29-17-00-utc/9553/5"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.840214646464647
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/10/2021-16:52:43",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-08-19/9942",
            "title": "GovAlpha Weekly Update - 2021-08-19 ",
            "index": 9942,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "8",
                    "time": "19/08/2021-16:46:16",
                    "content": " Highlights Delegation  We’ve begun tracking delegates participation and communication metrics - currently these are both manually checked by GovAlpha, in the future participation will be automatic, but comms will probably remain manual. Thanks to @Sebix for helping with this. Still working on getting custody platform integration moving so we can expand the MKR available to delegate. Putting pressure on platforms via speaking to VC’s, DUX offering integration help, the delegates themselves on twitter and potentially now the @Growth-Core-Unit.   Maker Operational Manual  Making concrete progress on the Maker Operational Manual under @gala’s management.  @Patrick_J and @AstronautThis producing parameter documentation for the RWA vault parameters and finally covering the Flap and Flop parameters. @LongForWisdom reviewing.  @prose11 documenting the governance vote hash-checking process. Someone on PE (I think @Derek?) working on updating the executive audit documentation to cover the DssExecLib stuff.   Onboarding   @Sebix now spending the majority of his working-time with us and looking to take on more projects in the coming weeks. Looking to expand into MIPs and forum organisation stuff.  @Gala working well on the Maker Operational Manual, may try to expand responsibilities here as her availability allows.  @AstronautThis and @Patrick_J spending additional time on documentation. Moving around our weekly meeting to accommodate more time zones so these guys can sync more effectively with the team. A couple of leads on additional recruits, too early to say anything either way.    Other Governance stuff MIPs Portal Work continues on bug-fixing and additional features. Progress is steady. Snapshot Proceeding nicely, currently DUX planning to work on creating voting strategies (required to have snapshot pick up votes from MKR in the Chief, being delegated, in VoteProxy’s etc. Video Production Process continues, we now have a set deadline from Content Production, so sketching out what goes in these videos over the next month.  Other Non-Governance Stuff MKR Compensation @prose11 working on this over the next few weeks. Working on DAI Supply @LongForWisdom spending some time figuring out possibilities for DAI minting and trying to understand the costs they impose on MakerDAO. Absences @LongForWisdom away for next week (23rd - 30th) Weekly Assignments  Executive Process - @prose11  Polls Process - @LongForWisdom (maybe others, not sure yet) GovAlpha Weekly Update - @LongForWisdom  MIPs Update -  @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-155-thursday-august-19-17-00-utc/9840/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-59/9995",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/49",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-155-thursday-august-19-17-00-utc/9840/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.575396825396826
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/08/2021-20:57:15",
                    "content": "    LongForWisdom:  MKR Compensation @prose11 working on this over the next few weeks. Working on DAI Supply @LongForWisdom spending some time figuring out possibilities for DAI minting and trying to understand the costs they impose on MakerDAO.   Eager to hear what comes out of these two. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/11/2021-20:57:43",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-03-25/14227",
            "title": "GovAlpha Weekly Update - 2022-03-25 ",
            "index": 14227,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "7",
                    "time": "25/03/2022-18:58:14",
                    "content": " Highlights   @hernandoagf continues to leverage his “shadowy super coder” skills, releasing an updated version of the Governance Dashboard and spun up a notebook for examining past sourcecred data by week.  @tylermeanswell continues onboarding, drafting an updated Governance FAQ (here’s the old version, with decaying accuracy. Shout out to @juan for the motivation.   Quarterly Goals  Participation   @LongForWisdom drafted a new Separation of Powers post for the Maker Operational Manual  @Patrick_J has been working on delegate interactions, announcing the next expected Delegate Compensation date of April 8th.   Exploration   @blimpa + @Gala  have been collaborating with @twblack88 and co on the revised Core Unit offboarding process.  @TheExistence has stepped up to draft SourceCred Updates and is preparing a plan for updating our off-chain incentivization starting next month.  @prose11 met with @collateral-core-unit to go over the current onboarding process for D3Ms and other non-token addresses.   Other   @blimpa rolled out a new format for the Weekly MIPs Update #79 :piñata:  To much internal celebration we are one day closer to having @Patrick_J full-time, finishing his last in person day at the old day job today     Weekly Tasks  Executive Process - @prose11 + @blimpa  Polls Process - @LongForWisdom + @Sebix + @Gala + @TheExistence  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @prose11  Delegate Metric Tracking - @Patrick_J + @tylermeanswell  MIPs update - @blimpa  Office Hours - @prose11   ",
                    "links": [
                        "https://observablehq.com/@hernandoagf/makerdao-sourcecred-stats",
                        "https://makerdao.world/en/learn/governance/governance-faq",
                        "https://manual.makerdao.com/governance/what-is-delegation/separation-of-powers",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-2/14201",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.06868686868687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/06/2022-18:58:38",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-04-15/14650",
            "title": "GovAlpha Weekly Update - 2022-04-15 ",
            "index": 14650,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "10",
                    "time": "15/04/2022-19:14:07",
                    "content": "Going to try out a new (borrowed from other CU’s) format this week. Let us know if this is better / worse!  GovAlpha’s Current Priorities   Prioritization Voting Primitive - Writing specification for DUX, and generally introducing this to the community.  Off-Chain Incentives - Discussed this on the forum a bit last quarter. Need to determine and commit to a path forward from the (many) discussed options.  Quarterly Report for Q1 2022 + Budget Return - Need to do this for transparency / reporting reasons.  Voting Portal Support - Supporting DUX on mutually agreed-upon changes to poll and delegate metadata.   DAO-Facing Work This Week   Emergency Response - Still can’t talk about this yet, huge thank you to @blimpa and @Patrick_J for support during response.  Off-Chain Incentives - @LongForWisdom focusing on this earlier in the week, reviewing where we are and determining outstanding blockers. Catching up with the work done by @TheExistence and @hernandoagf   Voting Portal Support - @LongForWisdom meeting with @0xDeniz to confirm direction, required artefacts and timeline.  Weekly Polls - @tylermeanswell working on polls, with @Patrick_J reviewing and helping to onboard.  Weekly Executive - @LongForWisdom on copy, @Patrick_J on review and final submission.  Delegate Onboarding - @Patrick_J onboarding and running Meet Your Delegate for Penn Blockchain (welcome @Juanbug and co!)  MIPs Portal - @blimpa catching bugs, testing lesser-used functionality, thinking about how and what to improve.  CatFlipLike Status UI - @LongForWisdom providing another round of feedback, communicating with both dSpot and Data Insights Core Unit to resolve questions around development.  Governance Dashboard - @hernandoagf continuing to work on a Governance dashboard that presents governance statistics and information contained in the Governance Tracker Spreadsheet in a more consumable way.  Forum Explorer - @hernandoagf working on adding user-groups as a filter-option for the Forum Explorer. Also investigating UX improvements and space-saving strategies.   GovAlpha Internal Work This Week   Accounting and Budgeting - @LongForWisdom making sure budget and spending sheets are up to date and clear.  ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.14556277056277
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "14/07/2022-19:14:46",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-09-02/10130",
            "title": "GovAlpha Weekly Update - 2021-09-02 ",
            "index": 10130,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "3",
                    "time": "02/09/2021-16:35:23",
                    "content": " Highlights  Onboarding has been going particularly well this past week, in part thanks to an internal switch to host two weekly syncs for our members at different times to accommodate our global team composition. @TheExistence also started doing some work for us, so say hello if you see him on the forums or Rocket Chat   The Maker Operational Manual is coming along nicely, shoutouts to @Gala @AstronautThis and @Patrick_J for your recent contributions.  @LongForWisdom is exploring how Core Units can better understand Project Priority from voters/the community at large.   Tags and the Forum  Not too much to update on, but wanted to shout out @Sebix for continuing the Tags grind. Classifying tags to create parent/child groups and eliminate seldom-used options is no short work. We have asked Tech-Ops about implementing a new Forum plug-in based on @Sebix’s research and suggestions.   MIP World   @blimpa continues the excellent work coordinating with DSpot on the MIPs Portal and he realllllly wants you to utilize the feedback feature (bottom right of the site) Additionally, another round of formal submissions is upon us! If you have recently written a MIP keep an eye on your DMs as @blimpa will be contacting you to confirm the submission status.   Video Content Collaboration   @GovAlpha-Core-Unit is collaborating with @Content-Production to get some videos about Governance processes, concepts, and Core MIPs produced for the YouTube Chanel.  @blimpa and @Gala have been taking the lead on script outlines so far.   DssVest Communication and Documentation  A lot of time and effort has been put into coordination efforts for launching DssVest on tomorrow’s executive. Upsides and Downsides were discussed amount the Mandated actors for various implementations of MKR vesting for Core Units that have had plans approved.  @prose11 met with @brianmcmichael for a walkthrough of the code. Prose will be writing documentation for the community as well as the current and future Core Units that might wish to utilize DssVest for DAI or MKR distributions.   Snapshot/Staffing Update   @Elihu will be taking some time off this month and has passed the Snapshot Project over to @prose11. We’ve hit a few hurdles but thanks to the help of DUX and TokenFlow we’re back to brainstorming solutions.   Weekly Assignments  Executive Process - @prose11  Polls Process - @LongForWisdom , @Sebix , @AstronautThis  Governance and Risk Meeting Chair - @LongForWisdom  GovAlpha Weekly Update - @prose11  Delegate Metric Tracking - @LongForWisdom + @prose11  MIPs Update - @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-157-thursday-september-2-17-00-utc/10105/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-61-en-espanol/10376",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-157-thursday-september-2-17-00-utc/10105/3",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/51",
                        "https://forum.makerdao.com/t/maker-relay-ep-61/10214"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.62060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/12/2021-16:35:26",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-05-27/15414",
            "title": "GovAlpha Weekly Update 2022-05-27 ",
            "index": 15414,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "5",
                    "time": "27/05/2022-17:46:47",
                    "content": " GovAlpha’s Current Priorities   Prioritization framework - @prose11 taking the lead on this. Was introduced at the G&R 2 weeks ago - Youtube timestamp.   Q1 Report and Budget return - @prose11 and @Gala collaborating on this.   Voting Portal Support - Supporting DUX on mutually agreed-upon changes to poll and delegate metadata. Assigned @LongForWisdom.   On-Chain Incentives - @LongForWisdom and @Patrick_J - Attempting to analyse different options for on-chain incentives, and deliver recommendations for the DAO.   Recognized Delegate MIP set - Assigned to @Patrick_J - Defining Recognized Delegates in MIP form, and cleaning up existing delegate MIP.    DAO Facing Work This Week   Off Chain Incentives - @LongForWisdom and @TheExistence working on this with technical support from @hernandoagf. Delivered this week. Multiple posts under this tag. Changes begin from June.   MIP RFC Cleanup - @blimpa cleaning up the category and removing older MIPs that have been abandoned.   MIPs Portal - New MIPs Portal Deployment with functional and aesthetic improvements from dSpot, coordinated by @blimpa.   Delegate Onboarding - @Patrick_J working hard to onboard new delegates. Thanks to all that attended the Meet Your Delegate call this week.    Other Ongoing Work   @prose11 continuing work on the Prioritization Framework, expect a forum post next week.   @LongForWisdom supporting DUX in their changes to poll and delegate metadata.   @Patrick_J working on writing up some of the on-chain incentive options after discussing with LFW.   @hernandoagf is working on a checklist for the weekly executive spell verification process.   @Gala brainstorming how to increase number of delegates, and getting more MKR to delegate.    Routine Tasks   Weekly polls - @prose11 leading, @TheExistence reviewing. @Gala, @Sebix and @LongForWisdom writing.   G&R hosting - @prose11   Weekly Executive - @Patrick_J, @blimpa and @prose11.   Delegate Tracking - @Patrick_J   MIPs - @Gala and @blimpa and @Sebix   Governance Tracker - @Patrick_J   SourceCred Maintenance - @hernandoagf and @TheExistence   ",
                    "links": [
                        "https://youtu.be/ZJSmzCTSbsA?t=3306",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://forum.makerdao.com/tag/offch-govinc-set",
                        "https://forum.makerdao.com/t/meet-your-delegate-12-london-business-school-lbs-and-blockchain-columbia/15218",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.436688311688311
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "25/08/2022-17:47:07",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-05-27/8387",
            "title": "GovAlpha Weekly Update - 2021-05-27 ",
            "index": 8387,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "11",
                    "time": "27/05/2021-16:40:57",
                    "content": "So going forward we’re planning to take the lead from some of the other Core Units and produce a forum version of our CU update.  Reactionary Stuff   @LongForWisdom - Dealing with executive issues on Monday.  @LongForWisdom - Speaking to VC’s to increase vote participation.   External Governance Stuff  Delegates  Working with Foundation Frontend Team to confirm UX Design for Delegation Considering contents of a Code-of-Conduct for Recognised Delegates (thanks to @mrabino1 for his contribution.) Speaking to some VC’s about delegation utility and use-cases.   MIPs Portal  Work slowed down a little in the tail end of May, should ramp up again in June. At a point where most of the functionality is there, just needs some tidying up and work on our side to get the content working well.   Maker Operational Manual (Governance Documentation)  Currently considering layout and breakdown of this page. Still non-public, and needs some more work before we’ll unveil.   SourceCred  Payton working with Seth to figure out how to boost Cred for specific categories and tags. Progress slow, more complex than it sounds. Confirming details of a technical proposal to move some of the SourceCred infrastructure on-chain.   Forum  LFW sorting out categories a bit, adding descriptions, bring groups up-to-date. Added SES group, along with icons and such. Congratulations to SES!   Other External Stuff   @prose11 - Helping coordinate various community working groups.  @LongForWisdom - Mandated Actor discussions.  @LongForWisdom - Rates Working Group discussions over USDC collateral increase.  @LongForWisdom - MKR Compensation discussions.   Internal GovAlpha Stuff  Onboarding  Figuring out how best to onboard people. Ongoing, has been difficult in the past. Hopefully will be able to put up some ‘Help Wanted’ post next week.   Weekly Assignments  Executive Process - @LongForWisdom  Polls Process- @prose11  Forum at a Glance - @prose11  GovAlpha Weekly Update - @LongForWisdom  MIPs Update - @Davidutro and @blimpa    Multi-sig  Setting up GovAlpha multi-sig. See here: GovAlpha Administered Multi-sig  More transparency coming soon. Will soon move operating funds from Interim Multi-Sig to GovAlpha Multi-Sig.  ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-47-en-espanol/8547",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-47/8491",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/33",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3660300925925934
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "25/08/2021-16:41:19",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-12-03/11998",
            "title": "GovAlpha Weekly Update - 2021-12-03 ",
            "index": 11998,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "4",
                    "time": "03/12/2021-22:15:39",
                    "content": " GovAlpha Weekly Update  Quarterly Focuses  Delegation  The first lot of delegate compensation will be distributed in the executive this week. Going through the process for this has already highlighted a number of weaknesses and issues which we’re looking forward to fixing. See a breakdown and some links here. @Patrick_J did a great job here getting this sorted. We have a ninth soon-to-be recognized delegate joining us. Welcome to @ACREinvest, you can find their delegate profile here. Having more people consider this role is extremely encouraging and speaks well for the future and quality of delegates at Maker. We spent a little time speaking about where we’re at with respect to delegation in the recent governance and risk call.   Robustness   @blimpa been continuing to help get bugs fixed on the MIPs Portal, along with his usual activities spent helping authors make their MIPs as clear and effective as possible.   Other Stuff   @ceresbzns and @TheExistence have shared some of the results of their research work on governance in other DAO’s internally. There is still a good bit of polish work before this becomes fit for public consumption, but it looks quite positive so far. Work on the Maker Operational Manual proceeds, we’ve now got domain’s and such setup so we’re more or less ready to officially launch once we’ve done a final pass over the content. I was hoping to get to the official launch today, but got side-tracked. If anyone wants a preview in its current state, you can find it here.  @LongForWisdom is away for the next few weeks, I’ll be back in January! @prose11 will be around, but I’ll be checking in periodically to cover anything very urgent.   Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @Prose11, @Patrick_J, @TheExistence  Governance and Risk Meeting Chair - @Prose11  GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @Patrick_J  MIPs Update - @blimpa  Collateral Status Sheet - @Sebix   ",
                    "links": [
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943",
                        "https://manual.makerdao.com/",
                        "https://forum.makerdao.com/t/under-construction/12274/6",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6320744206773625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "03/03/2022-22:16:10",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-11-12/11608",
            "title": "GovAlpha Weekly Update - 2021-11-12 ",
            "index": 11608,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "14",
                    "time": "12/11/2021-17:01:18",
                    "content": " GovAlpha Weekly Update Hello folks! Wanted to start off with an acknowledgment that I’ve been dropping the ball on the Weekly Updates lately. Wanted to thank @LongForWisdom for staying diligent and his patience with me. They’ll be a bit more at the bottom of this post, but wanted to apologize to the community for the recent lack of communication.  Highlights   @LongForWisdom is rounding up the work on the Maker Operational Manual. Keep an eye out for our soft launch forum post  !  Special thanks to @Gala for getting this project off the ground.  @blimpa is putting together a MIP Editor Handbook that focuses on Onboarding. This will greatly aide in getting more MIP editors onboarded to GovAlpha. We’ve been onboarding @ceresbzns as a GovAlpha contributor. Ceres comes from 1Hive, bringing a wealth of DAO experience and some technical knowledge in SourceCred instances. Say hello next time you see them     Quarterly Focuses  Delegation  Big news this week! Custody platforms have finally added compatibility for MKR Delegation. We expect to see some serious MKR being delegated over the next couple weeks. Delegate Compensation Trail update below, still on track for our first distribution at the end of the month.   Robustness  The Maker Operational Manual coming online is a big step in our goals for more robustness. We’re preparing to onboard more MIP Editors which will offer greater decentralization and redundancy. You might have noticed a new #SourceCred channel in Discord, we have always had a chat with SourceCred, but decided our coordinations could be beneficial to the community and opened up Read access (and emoji reactions  ) to the channel. Currently running a preliminary poll on about instance there.   Internal Developments  This week @Patrick_J took a stab at the Executive Copy and did a great job. Having more members able to accurately draft Executive Copy is a great development for the CU. We look forward to seeing his name on future commits. Thanks to a great call/report from @gov-comms-core-unit , @blimpa has been tidying up the MIPs repo.  We have a few action items to unify our communications with the DAO that we will be focusing on this coming week.  @Sebix’s PC died  but we were still able to get some effective work and coordination done. Stay tuned as @Sebix and @prose11 collaborate on a GovAlpha webpage!   Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @prose11 , @Sebix , @Patrick_J  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @prose11  Delegate Metric Tracking - @TheExistence, @prose11  MIPs Update - @blimpa  Collateral Status Sheet - @Sebix    External Stuff  With the recent poll raising the compensation during the Recognized Delegate Compensation Trail passing, GovAlpha is collaborating with @data-insights-cu to record average MKR voting weight. Distributions will be made to Recognized Delegates at the end of the month.  @prose11 met with @Aes to talk about formalizing budget returns. Once this week’s executive is executed our excess budget will be fully returned to the protocol.   Thanks for checking out our weekly update! I’ll be more diligent in ensuring these keep getting posted every week. As mentioned at the top of the post I’ve been struggling personally and organizationally. But this week has been good on both fronts, with me creating a new personal task tracker to ensure obligations like this post don’t fall by the waist side. On the personal side, I’ve been dealing with mental health struggles exacerbated by some familial circumstances.  Wanted to drop a link to some Mental Health Resources for both people facing mental health problems of their own and those around them. I was quite fortunate in that my new insurance made seeking therapy fairly easy. This won’t be the case for everyone, but wanted to plug the importance of reaching out to someone when you’re struggling. I added this to our update because I don’t think mental health is talked about enough in this space and I hope me being willing to talk about my struggle publicly might open others up to seek the help they need. We have a wonderful community here at Maker and our strong network of personal connections means no one should have to suffer in silence. ",
                    "links": [
                        "https://www.mentalhealth.gov/talk/people-mental-health-problems",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/under-construction/12274/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.139547258297259
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "3",
                    "time": "13/11/2021-23:50:39",
                    "content": "    prose11:  Thanks for checking out our weekly update! I’ll be more diligent in ensuring these keep getting posted every week. As mentioned at the top of the post I’ve been struggling personally and organizationally. But this week has been good on both fronts, with me creating a new personal task tracker to ensure obligations like this post don’t fall by the waist side. On the personal side, I’ve been dealing with mental health struggles exacerbated by some familial circumstances. Wanted to drop a link to some Mental Health Resources for both people facing mental health problems of their own and those around them. I was quite fortunate in that my new insurance made seeking therapy fairly easy. This won’t be the case for everyone, but wanted to plug the importance of reaching out to someone when you’re struggling. I added this to our update because I don’t think mental health is talked about enough in this space and I hope me being willing to talk about my struggle publicly might open others up to seek the help they need. We have a wonderful community here at Maker and our strong network of personal connections means no one should have to suffer in silence.   Really glad you mention this.   I have been side swipped by my wife with physical issues.   Already in and out of the hospital twice in past 2 weeks not to mention doctor visits, blood tests etc…  So it isn’t just mental health but personal and familial physical.   I basically have to do everything including taking care of my wife while we try to kick the healthcare system into actually working to figure out what right now is putting my wife in bed most of the day without energy to do anything (she is out of breath easily, and ends up with muscles that basically act like they have been worked out - that sore pain you get when lactic acid builds up).   Tests show seriously low iron, and D3 yet we have been waiting now two weeks to get her in for iron infusions…   This hospital can’t do this because of order Y, and insurance and the infusion center taking their own sweet time - reviewing her case.   All the while taking care of a 2 and 6 yr old, full time job, and Maker on top and my wife slowly being taken down by what we think is some form of anemia (blood cell counts already below normal range and still falling - but not bad enough for a blood transfusion - yet). On the bright side I think most of my growth thesis is almost ready to post and even though I have a few components they appear to number around 5.   I am just trying to clean them up before posting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.971955266955266
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "2",
                    "time": "16/11/2021-01:37:49",
                    "content": "    prose11:  On the personal side, I’ve been dealing with mental health struggles exacerbated by some familial circumstances.   I just want to point out that mental health is a relative thing and can always be improved. So even if you don’t have an acute need for mental health services, seeing a therapist every week isn’t a bad idea. I don’t consider myself mentally ill (it’s all relative though!), and I see a therapist regularly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.55
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "14/02/2022-01:38:40",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-09-30/10608",
            "title": "GovAlpha Weekly Update - 2021-09-30 ",
            "index": 10608,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "5",
                    "time": "30/09/2021-21:35:25",
                    "content": " Highlights   @dumitru has begun setting up the official MakerDAO Discord channel. Still a few things to sort out, but everything is on track to have it in a place where it can replace rocketchat before the shutdown date.  @psychonaut has been working on a delegate compensation MIP, @LongForWisdom reviewing and offering suggestions.   Also of Note  Core Unit Onboarding   @LongForWisdom getting our new CU’s set up and running on the forum, rocketchat, getting them added to necessary meetings and documents.  @LongForWisdom actually wrote down the process this time, so in the future he can make @prose11 do it (it’s not laziness, it’s redundancy!)   Tags   @Sebix continuing his work on clearing and consolidating tags on this forum with the goal of making navigation and browsing easier.   Education   @blimpa continuing to work on scripts for a number of educational videos to be created by @Content-Production.  @Gala continuing her work organizing the Maker Operational Manual project - this week mostly setting up the gitbook structure for the docs and making some final decisions on content.   Process Improvements   @Patrick_J finalizing optimizations for the Delegates Tracking sheet, aiming to swap in the new sheet next week.  @blimpa and @LongForWisdom working on tightening up the MIP quality assurance process. More soon!   Other Notes   @prose11 is away this week, but back next week!  @LongForWisdom started working on the latest GovAlpha quarterly report - pretty busy though, so don’t expect it for another few weeks.   Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @AstronautThis , @sebix, @LongForWisdom  Governance and Risk Meeting Chair - @LongForWisdom  GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @TheExistence, @Sebix  MIPs Update - @blimpa  Collateral Status Sheet - @Gala   ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-65/10697"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.478203083466241
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/12/2021-21:35:33",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-07-08/9255",
            "title": "GovAlpha Weekly Update - 2021-07-08 ",
            "index": 9255,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "6",
                    "time": "08/07/2021-16:34:11",
                    "content": " Highlights  Onboarding is moving along at a refreshing pace. We have new Core Unit contributors and  @prose11 (it me) is taking on more facilitator duties previously owned by @LongForWisdom. New version of the MIPs Portal is live, check it out! Thanks to DSpot and @blimpa for all work that made this update possible. Our Quarterly Review for our first 3 months as the GovAlpha Core Unit has been published, take a look to see all our successes and failures and why we only spent a fraction of our Quarterly Budget.   External Governance Stuff Delegation  Meeting organized with potential delegate group again next week. Working on getting delegate statements to go on the forum so MKR holders can more easily decide where they’d like to delegate their votes.  Voting Front End  New process for Executive Votes and Polls in in place, with @prose11 able to add polls to the front end from his permissioned address. Thanks to dUX for all the work, designs are underway for voting delegation on the front end too.  Forum  You might have noticed the new forum banner with some helpful tips and reminders. Working on framework to make tags more efficient/helpful to readers.  MIPs Quality + Process  Created new system for assigning new MIPs to the MIPs Editors and a checklist to help authors throughout the submission period.  @blimpa has fixed a number of images within the MIPs to display properly on the portal.   Internal Governance Stuff   @prose11 has completed his almost cross country move. Now in UTC -6, so you might see some shift in times around the forum/chat. Payments went out from the GovAlpha Multi-Sig. Work continues on developing a Snapshot integration to allow for weighted polls. Documentation on MIPs submitting and SourceCred Onchain Technical Proposal in the works.  Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @prose11, @Sebix, @ultraschuppi  Forum at a Glance - @blimpa, @Sebix  GovAlpha Weekly Update - @prose11  MIPs Update - @Davidutro and @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://gnosis-safe.io/app/#/safes/0x01D26f8c5cC009868A4BF66E268c17B057fF7A73",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-149-thursday-july-8-17-00-utc/9227/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/40",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-149-thursday-july-8-17-00-utc/9227/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.786661255411255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "2",
                    "time": "10/07/2021-14:19:05",
                    "content": "Wow @Sebix felicades bro!!! eres un crack ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9765625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#4",
                    "likes": "3",
                    "time": "10/07/2021-18:26:31",
                    "content": "Hehe, gracias @saludiego_201 . ¡Estoy intentando ayudar todo lo que puedo!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#5",
                    "likes": "1",
                    "time": "11/07/2021-00:26:10",
                    "content": "Que buena noticia Sebix todos los exitos para ti  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/10/2021-00:27:01",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-02-18/13305",
            "title": "GovAlpha Weekly Update - 2022-02-18 ",
            "index": 13305,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "3",
                    "time": "18/02/2022-19:13:05",
                    "content": " GovAlpha Weekly Update  Highlight GovAlpha began releasing the off-chain governance incentive reports, analysis and next-steps in response to the renewed community interest in SourceCred. Thanks to @TheExistence and @hernandoagf!  Quarterly Focuses  Participation   @LongForWisdom leaving participation-related comments on @GFXlabs Governance Mining Trial signal.  @prose11 networking at ETHDenver and taking part in discussions involving both delegates and large MKR Holders.  @hernandoagf working on building a governance metrics dashboard.   Exploration   @LongForWisdom has produced and added flowcharts to the governance section of the Maker Operational Manual. PR here, should be live very soon. I’ll post one of these as a tease as a reply to this thread. This meets one of our stated objectives for this quarter.  @hernandoagf working on customizing discourse forum plugins for use here in Maker’s forum.   Other Stuff  Bit of a slow week for much of GovAlpha, onboarding work continued with respect to MIPs (@blimpa, @Gala and @Sebix) and polls processes (@Patrick_J and @TheExistence). Minor work on the Maker Operational Manual. LFW and @Gala reviewing and merging some outstanding PRs.  @LongForWisdom discussing with @colby about how best to work together with the goal of producing high quality governance-related educational and reference content for both the Maker Academy project, and the Maker Operational Manual.  @prose11 networking and generally discussing and learning from others at ETHDenver. Particularly on the subjects of real world assets and layer 2 implementation.   Weekly Tasks  Executive Process - N/A (taking a brief break on planned executives) Polls Process - @Patrick_J, @TheExistence, @Gala, @Sebix  Governance and Risk Meeting Chair - N/A (no official call this week due to ETHDenver) GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @Patrick_J  MIPs update - @Gala  Office Hours - @LongForWisdom   ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-implement-governance-mining-trial/13271",
                        "https://github.com/makerdao/governance-manual/pull/72",
                        "https://forum.makerdao.com/t/planned-executive-proposal-update/13149",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-february-2022/13726"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.802151769798829
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "6",
                    "time": "18/02/2022-19:14:00",
                    "content": " image1485×2132 190 KB  As promised, an example of the governance-related flowcharts being added to the Maker Operational Manual. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "19/05/2022-19:14:44",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-06-17/8829",
            "title": "GovAlpha Weekly Update - 2021-06-17 ",
            "index": 8829,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "7",
                    "time": "17/06/2021-16:17:36",
                    "content": " Highlights   Onboarding Post is now public! If you’re interested in helping out at GovAlpha, please get in touch with @LongForWisdom or @prose11. Upcoming Quarterly Review for GovAlpha’s first quarter of operation. This will be posted close to the end of June.    External Governance Stuff  Delegates  No significant updates.   SourceCred  Further work on ‘governance boost’ area. Despite difficulties, @prose11 feels that we are quite close now. Hoping to publish something next week.   MIPs Portal  No significant updates.   Other External Stuff   @LongForWisdom and @prose11 - Attempting to moderate + mediate RWA discussions.  @prose11 - RWA committee work.   Internal GovAlpha Stuff   @LongForWisdom catching up on stuff that happened last week in my absence.   Onboarding   Onboarding Post is now public! If you’re interested in helping out at GovAlpha, please get in touch with @LongForWisdom or @prose11.  @prose11 further conversation with @Gala about working with GovAlpha.  @prose11 in contact with other GovAlpha applicants.   Transparency   @LongForWisdom - created maintainable public version of GovAlpha expenditure and accounts. Will be shared very shortly.  @prose11 + @LongForWisdom - Initial thoughts on GovAlpha’s first Quarterly Review document.   Polls + Templates  Further work on monthly ratification templates by @LongForWisdom, minor changes to other poll templates.   MIPs   @blimpa - Working on MIP proposal documentation.   Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @prose11  Forum at a Glance - @prose11  GovAlpha Weekly Update - @LongForWisdom  MIPs Update - @Davidutro and @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/help-wanted-govalpha/8811",
                        "https://forum.makerdao.com/t/maker-relay-ep-50-en-espanol/8966",
                        "https://forum.makerdao.com/t/maker-relay-episode-50/8897",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-146-thursday-june-17-17-00-utc/8785/2",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/37",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-146-thursday-june-17-17-00-utc/8785/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1514423076923075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "17/06/2021-16:21:51",
                    "content": "To be honest, this wasn’t a terribly productive week for GovAlpha, unfortunately we got sucked into a bit of moderation and mediation work around RWA which ended up being quite time consuming. In combination with some of my time being spent catching up after my absence and our recurring responsibilities, this didn’t leave time for much meaningful progress. We’re hoping to be able to spend more time on our various projects next week. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.494318181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/09/2021-16:22:02",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-01-28/12923",
            "title": "GovAlpha Weekly Update - 2022-01-28 ",
            "index": 12923,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "7",
                    "time": "28/01/2022-20:09:15",
                    "content": " GovAlpha Weekly Update  Highlights  Nothing terribly worthy of highlight this week. It was more or less reacting to FLAP stuff from the tail end of last week and otherwise keeping on trucking.   Quarterly Focuses   Participation - @LongForWisdom made a halfhearted effort to get some of the larger MKR holders delegating. Will spend more time on this in the coming weeks.  Participation - @Patrick_J beginning to think about documentation for the Recognized Delegates aiming to help them campaign for more MKR.   Other Stuff   @LongForWisdom working on executives, working on GovAlpha Quarterly Review for 2021-Q4 (very nearly done.) Also spent some time running through the onboarding checklists for our new Core Units.  @blimpa has been continuing to work with @Sebix and @Gala to onboard them to work with MIPs.  @Patrick_J helped with executives (plural) and has been working on the delegate compensation MIP. Also helping to hand-over the Collateral Status Sheet to CES.  @AstronautThis has been working on D3M documentation for the Maker Operational Manual.  @Gala working on setting and tracking post-launch goals for the Maker Operational Manual.  @prose11 helping to onboard @Gala to GovAlpha’s budget and accounting setup.  @prose11 taking a week off (the above notwithstanding.)   Weekly Assignments  Executive Process - @LongForWisdom, @Patrick_J  Polls Process - @LongForWisdom  Governance and Risk Meeting Chair - @Davidutro ( thanks for standing in! ) GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @Patrick_J  MIPs update - @Blimpa, @Gala and @Sebix  Office Hours - @LongForWisdom    We missed our update last week, apologies to all! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6992965367965365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/04/2022-20:09:55",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-04-22/14761",
            "title": "GovAlpha Weekly Update - 2022-04-22 ",
            "index": 14761,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "6",
                    "time": "22/04/2022-17:35:24",
                    "content": " GovAlpha’s Current Priorities   Postmortem for 2022-04-14 - GovAlpha writing up a DAO-scope postmortem / response summary for this incident in collaboration with Protocol Engineering Core Unit.   Prioritization Voting Primitive - Writing specification for DUX, and generally introducing this to the community.   Quarterly Report for Q1 2022 + Budget Return - Need to do this for transparency / reporting reasons. Getting super late now    Voting Portal Support - Supporting DUX on mutually agreed-upon changes to poll and delegate metadata.   Off-Chain Incentives - Discussed this on the forum a bit last quarter. Need to determine and commit to a path forward from the (many) discussed options.    DAO-Facing Work This Week   Emergency Response for 2022-04-14 - Mostly concluded, but still dealing with the tail-end.   Postmortem for 2022-04-14 - Collaborating with others involved to ensure timeline is accurate.   Off-Chain Incentives - @TheExistence and @hernandoagf still working on what this will look like operationally. @LongForWisdom de-prioritized this for the past week due to other work items.   Voting Portal Support - @LongForWisdom producing several of the artefacts needed by DUX to make progress on poll and delegate metadata.   Governance Dashboard - @hernandoagf preparing for first release of this dashboard.   Forum Explorer - @hernandoagf pushed update to forum explorer that provides some additional functionality, and a more compact layout.   MIP9 Updates - @Patrick_J, @tylermeanswell and possibly others working on some minor fixes for MIP9 (greenlight polls.)   Conferencing - @prose11 doing awesome conference things at ETHAmsterdam. And hosting the Twitter spaces with Nexo.   Bonus: check out @0xdeniz’s presentation on the workshop he lead with @tiago during The DAOist’s Global Governance Gathering:       Routine Stuff   Weekly Polls - @gala and @Sebix working on polls, with @Patrick_J reviewing.   Weekly Executive - @LongForWisdom on copy and final submission, @Patrick_J on review.   Delegate Tracking - @tylermeanswell with @Patrick_J on support.   Operational Manual Maintenance - @gala   SourceCred Maintenance - @TheExistence   ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://forum.makerdao.com/explorer",
                        "https://mips.makerdao.com/mips/details/MIP9",
                        "https://twitter.com/MakerGrowth/status/1517182278555811842",
                        "https://www.youtube.com/watch?v=yt8OstQZYPI",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.733333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "22/04/2022-18:42:33",
                    "content": "I’m OOO next week. @prose11 will be available. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "21/07/2022-18:45:11",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-08-05/9713",
            "title": "GovAlpha Weekly Update - 2021-08-05 ",
            "index": 9713,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "4",
                    "time": "05/08/2021-16:46:52",
                    "content": " Highlights  Would you believe… Delegation? In addition to our Soft Launch of Voter Delegation on Monday (you can view delegates in the voting portal, we hosted the second Meet Your Delegate call yesterday. Stay tuned for @monet-supply and more next week, same time, same place. First draft of our combined Q4 2021 and Q1 2022 Budget is complete, will be in RFC next week before the September submission deadline.  @Sebix has continued his project for tags on the Maker forum, with the goal of figuring out how to make them more useful, better organized and less sprawling.   External Governance Stuff Delegation Proceeding well, see highlights above. MIPs Portal Work continues on bug-fixing and additional features. Nothing super new to call out here, just lots of fantastic incremental progress. Shout-out to @blimpa for some great Project Management. Snapshot In the process of setting up snapshot for Maker, with the assistance of DUX and @tmierzwa. ENS testing has started, the team is now confident in our ability to deploy Snapshot proposals once we have all the contracts fro voters sorted out. Delegates Call Notes @Gala has started taking on many tasks with GovAlpha, more on that in future updates. For now we’ll say thank you for the great job completing the call notes for the first Meet Your Delegate call. Notes for the second call coming soon!  Internal Governance Stuff  Onboarding tasks continue for @Sebix, @AstronautThis, and @Patrick_J. @Gala has started doing some initial Forum and MIPs tasks. Budget drafting is in progress with the intent to publish a 6-month budget by the August 11th cut-off for the September Governance Cycle.  Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @prose11 , @Sebix  GovAlpha Weekly Update - @prose11  MIPs Update -  @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/meet-your-delegate-2-wednesday-august-4-6-00-pm-utc/9575",
                        "https://forum.makerdao.com/tags",
                        "https://forum.makerdao.com/t/meet-your-delegate-1-wednesday-july-28-6-00-pm-utc/9424/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/47"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125541125541125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "03/11/2021-16:47:29",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-04-01/14385",
            "title": "GovAlpha Weekly Update - 2022-04-01 ",
            "index": 14385,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "7",
                    "time": "01/04/2022-20:30:14",
                    "content": " Highlights  Launching the Forum Explorer, a new way to navigate the MakerDAO forum. Huge shout out to @hernandoagf for working on this. Launching Impact Estimations, a tool to help community members and delegates prioritize limited time spent on MakerDAO.   Quarterly Goals  Participation   @Patrick_J working on more documentation aimed to help make delegate onboarding smoother and easier.  @LongForWisdom and @prose11 coordinating with @0xDeniz of DUX around Q2 activities.   Exploration   @blimpa helping test and give feedback on new functionality for the MIPs Portal.  @hernandoagf working on SourceCred in an attempt to squeeze out more useful data and metrics.  @hernandoagf and @LongForWisdom tweaking forum themes, and adding Job Opportunities link. Impact estimations and Forum Explorer as noted above.   Other   @Patrick_J helping to onboard @tylermeanswell on delegate metrics.  @Patrick_J presenting on the G&R call for the first time.  @gala working on general MIP maintenance and amendments.  @LongForWisdom and @prose11 fielding questions around collateral onboarding processes in both public and private settings.  @LongForWisdom re-tagging all 750 historic governance polls…   Weekly Tasks  Executive Process - @Patrick_J + @blimpa + @LongForWisdom  Polls Process - @LongForWisdom + @Patrick_J  Governance and Risk Meeting Chair - @LongForWisdom  GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @Patrick_J + @tylermeanswell  MIPs update - @gala  Office Hours - @prose11 + @LongForWisdom   ",
                    "links": [
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.658766233766234
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/06/2022-20:30:46",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-01-07/12523",
            "title": "GovAlpha Weekly Update - 2022-01-07 ",
            "index": 12523,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "5",
                    "time": "07/01/2022-16:55:08",
                    "content": " GovAlpha Weekly Update The GovAlpha Core Unit has started back up again this week after the winter break.  Quarterly Focuses As we enter Q1 2022, we have two new quarterly focuses - Participation and Exploration.  Participation Continuing from Q4 2021, we retain a focus on improving Governance participation. Internally, there are ongoing discussions about how to improve this, and we continue to seek new Recognized Delegates to join MakerDAO.   @mkrorbrkr posted the latest editions of the Delegate Round-up and the Delegate Compensation Breakdown for December 2021    Exploration   @ceresbzns and @TheExistence continue their research project into DAO Governance; @prose11 has been reviewing some of the work done thus far. Hopefully, we will be in a position to share this work with the DAO soon.   Other Stuff   @Gala is coordinating the finishing touches to the Maker Operational Manual - expect a post with further information in the coming days and working on the Governance Polls for the first time! The Facilitators have started onboarding Gala in GovAlpha budget organization.  @prose11 has been focusing on contributor onboarding and outreach and working with the Content Production CU on some documentation.  @hernandoagf has been working on the Sourcecred bot.  @LongForWisdom is back from a well-earned holiday and is writing a Q4 2021 GovAlpha review, working on D3M documentation and internal CU organization.  @mkrorbrkr wrote the CU Weekly Update for the first time this week. There are a lot of Governance Polls scheduled for next week, so there has been an all-hands-on-deck team effort to get everything ready for this.   Weekly Assignments  Polls process - @prose11, @Sebix, @TheExistence, @Gala, @mkrorbrkr, @AstronautThis  Governance and Risk Meeting Chair - @LongForWisdom  GovAlpha Weekly Update - @mkrorbrkr  Delegate Metric Tracking - @Sebix  MIPs update - @blimpa  Collateral Status Sheet - @mkrorbrkr  Office Hours - @prose11   ",
                    "links": [
                        "https://forum.makerdao.com/t/delegate-compensation-breakdown-december-2021/12462",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-december-2021/12692"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.539366883116883
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/04/2022-16:55:45",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-09-09/10244",
            "title": "GovAlpha Weekly Update - 2021-09-09 ",
            "index": 10244,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "5",
                    "time": "09/09/2021-16:46:34",
                    "content": " Highlights   @LongForWisdom working on both intangible asset allocation + prioritization MIPs. Forum post to come soon on prioritisation.  @prose11 working on documentation for DssVest.  @Patrick_J @AstronautThis @Gala working on parameter documentation.  @LongForWisdom @prose11 and @Davidutro been working on improving the format of the governance and risk call. We’ll see how that goes in ~15mins!   MIPs   @blimpa been working through Formal Submissions, ensuring everything is as it should be.  @Patrick_J + @TheExistence helping out with updating MIP preambles.   Video Content Collaboration   @GovAlpha-Core-Unit is collaborating with @Content-Production to get some videos about Governance processes, concepts, and Core MIPs produced for the YouTube Chanel.  @blimpa and @Gala have been taking the lead on script outlines so far - @prose11 doing review and sign-off.   Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @prose11, @Sebix , @AstronautThis, @TheExistence  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @prose11 + @TheExistence  MIPs Update - @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-62/10311"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/12/2021-16:47:25",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-05-13/15172",
            "title": "GovAlpha Weekly Update - 2022-05-13 ",
            "index": 15172,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "4",
                    "time": "13/05/2022-16:34:50",
                    "content": " GovAlpha’s Current Priorities   Prioritization framework - @prose11 taking the lead on this. Nearly ready for publication. Was introduced at the G&R last week - Youtube timestamp.   Q1 Report and Budget return - @prose11 and @Gala are collaborating and nearly finished with this.   Off Chain Incentives - @LongForWisdom and @TheExistence working on this with technical support from @hernandoagf   On-Chain Incentives - Some discussion within the CU about different options, parallel discussions within the community also noted. @LongForWisdom and @Patrick_J likely to work on this going forwards.   Recognized Delegate MIP set - @Patrick_J working on this.    DAO Facing Work This Week   Post-mortem for 2022-04-14 - remains on hold due to other protocols that are affected. Will be published once we get the go-ahead.   New Executive Cadence - first executive vote with the new cadence published this week. Initial feedback from PE and GovAlpha that this went well.   DAO Governance Research - @TheExistence and @ceresbzns published their work looking at DAO governance systems on Ethereum.   CU Offboarding Amendment - @Gala and @blimpa continue to work on this.    Routine Tasks   Weekly polls - @prose11 leading, @TheExistence writing and @Patrick_J reviewing.   Weekly Executive - @blimpa writing and @LongForWisdom reviewing   Delegate Tracking - @TheExistence   MIPs - @Gala and @blimpa   Governance Tracker - @Patrick_J   Sourcecred maintenance - @hernandoagf and @TheExistence   ",
                    "links": [
                        "https://youtu.be/ZJSmzCTSbsA?t=3306",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59#minor-experimenting-with-off-chain-incentives",
                        "https://forum.makerdao.com/t/maker-defi-dao-governance-report-a-review-of-major-defi-dao-governance-systems-in-the-ethereum-ecosystem/15156",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.204545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "11/08/2022-16:35:16",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-06-03/15600",
            "title": "GovAlpha Weekly Update - 2022-06-03 ",
            "index": 15600,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "3",
                    "time": "03/06/2022-22:11:50",
                    "content": "Was quite an eventful week at GovAlpha, and a lot of items seem to have caught quite a bit of attention on the forum. Still wanted to give a brief update and add in a few extra details   Highlights  Would be a hard lead to burry so the top item is this update - MIP41c5-SP7: Facilitator Offboarding (Voluntary) - LongForWisdom (GOV-001).  @prose11 finally posted the Prioritization Framework - Sentiment Polling update and the overdue GovAlpha (GOV-001) Quarterly Review - Q1 2022.  @Patrick_J has joined the GovAlpha Multisig, replacing @LongForWisdom.   Other Work   @prose11 @Gala @blimpa @Patrick_J met to review upcoming MIPs for submission completeness. This will be a reoccurring monthly internal call (though held sooner in the MIP calendar month) in hopes of addressing potential issues before they are voted on (see Amended MIP40: Important Information for Core Units ).  @hernandoagf  has been picking up some more technical tasks, and in the meantime posted his draft for an Executive Code Review Checklist to aide 3rd party review of executive spells.  @Sebix has been taking on a lot of admin work outside of GovAlpha on the Ambassador’s project, but is starting to have more time to devote to developing a GovAlpha webpage.  @TheExistence has been preparing a lot of SourceCred admin work for our upcoming Off-Chain Incentives changes.  @AstronautThis is patiently waiting for a review on the ESM Threshold setting analysis (shout out to Data Insights for the help), post coming soon  .   Weekly Assignments  Weekly polls - @prose11 leading, @Gala reviewing, @Sebix writing. G&R hosting - @prose11  Weekly Executive - @Patrick_J, @blimpa and @prose11. Delegate Tracking - @Patrick_J  MIPs - @Gala and @blimpa and @Sebix  Governance Tracker - @Patrick_J   ",
                    "links": [
                        "https://forum.makerdao.com/t/prioritization-framework-sentiment-polling/15554",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589",
                        "https://forum.makerdao.com/t/updated-govalpha-administered-multisig/15601",
                        "https://forum.makerdao.com/t/amended-mip40-important-information-for-core-units/15450",
                        "https://docs.google.com/spreadsheets/d/1OeqoeeKxGYekEbbYjuGkBvRrNJWmFeytrYZf0Qzswj4/edit#gid=0",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.401041666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/09/2022-22:12:32",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-11-19/11740",
            "title": "GovAlpha Weekly Update - 2021-11-19 ",
            "index": 11740,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "2",
                    "time": "19/11/2021-17:48:08",
                    "content": " GovAlpha Weekly Update  Quarterly Focuses  Delegation  We are soon to be welcoming two new (kind of) recognized delegates to MakerDAO: @GFXLabs (profile) and @JustinCase (profile). I’d like to extend a warm welcome to JustinCase particularly as the first example of someone new to the MakerDAO community putting themselves forward as a Recognized Delegate. We are also coming up on our first distribution of Recognized Delegate compensation. @Patrick_J will be taking the lead on coordinating this. We believe we’ve already identified some pain-points with the current structure of the trial compensation and will be following up on those most likely in the new year.   Robustness   @blimpa has been continuing to work on an onboarding manual for potential MIP Editors.  @prose11 has been handling contributor onboarding and 1-on-1’s this week. We are continuing to share knowledge within the Core Unit, most recently in the form of writing the executive-copy. @blimpa and @Patrick_J have both taken turns on that in the past few weeks.   Other Stuff  The Maker Operational Manual work is still on-going. New target it to get it launched on manual.makerdao.com by the end of November. We were able to integrate the awesome budget flow diagrams created by @liberuum from SES, big thanks to them for putting that together.  @ceresbzns and @TheExistence have continued to work on a ‘governance-in-other-DAOs’ research report.  @Patrick_J has been taking a more active role in managing signals and delegation in the forum the past week.  @LongForWisdom posted the ‘governance over the holiday’ post for 2021/2022.  @prose11 has been working on drafting GovAlpha’s MKR Compensation budget.   Weekly Assignments  Executive Process - @prose11  Polls Process - @LongForWIsdom, @Patrick_J, @AstronautThis  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @prose11 + @Sebix  MIPs Update - @blimpa  Collateral Status Sheet - @Patrick_J   ",
                    "links": [
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "http://manual.makerdao.com",
                        "https://forum.makerdao.com/t/governance-over-the-holiday-break-2021-2022/11694",
                        "https://forum.makerdao.com/t/maker-relay-ep-72/11773",
                        "https://forum.makerdao.com/t/under-construction/12274/6",
                        "https://forum.makerdao.com/t/maker-relay-ep-72-en-espanol/11799"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.009960718294051
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/02/2022-17:48:23",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-06-24/8944",
            "title": "GovAlpha Weekly Update - 2021-06-24 ",
            "index": 8944,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "3",
                    "time": "24/06/2021-16:43:03",
                    "content": " Highlights  Upcoming Quarterly Review for GovAlpha’s first quarter of operation, still in progress. This will be posted close to the end of June.  @LongForWisdom + @prose11 had initial meetings with several GovAlpha applicants. Meetings have tended to go well and we’re getting new people working on some starter tasks. Delegation launch timeline is becoming more firm. More details soon.    External Governance Stuff  Delegates  Delegation launch timeline is becoming more firm. More details soon.  @LongForWisdom working with dUX to solidify MVP and v1 features for delegation in the voting portal.   SourceCred  No significant updates.   MIPs Portal  Communicating some initial plans with the @Content-Production unit on MIPs and other governance explainer videos. Working with dSpot to communicate feedback on the MIPs Portal.   Other External Stuff   @LongForWisdom continuing work on MKR Compensation proposal with @Aes. Approaching completion of first draft.  @prose11 working on code of conduct for RWA parameter proposal group.   Internal GovAlpha Stuff   @LongForWisdom continuing to catch up on stuff that happened last week in my absence.   Onboarding   @LongForWisdom + @prose11 had initial meetings with several GovAlpha applicants. Meetings have tended to go well and we’re getting new people working on some starter tasks.   Transparency  Upcoming Quarterly Review for GovAlpha’s first quarter of operation, still in progress. This will be posted close to the end of June.   Polls + Templates   @blimpa - Creating PSM Onboarding Template.   Weekly Assignments  Executive Process - @prose11  Polls Process - @LongForWisdom, @blimpa, @Sebix  Forum at a Glance - @prose11  GovAlpha Weekly Update - @LongForWisdom  MIPs Update - @Davidutro and @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-147-thursday-june-24-17-00-utc/8904/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-51/9011",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/38",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-147-thursday-june-24-17-00-utc/8904/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.569023569023569
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/09/2021-16:43:59",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-10-29/11296",
            "title": "GovAlpha Weekly Update - 2021-10-29 ",
            "index": 11296,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "5",
                    "time": "29/10/2021-19:33:41",
                    "content": " GovAlpha Stuff  Still underbudget. We’ll we sending DAI back to the DAO either today or early next week. @Prose11 has put together a post commenting on the issue which will be up on the same timescale. Quarterly Review post for Q3 - first draft is done. Hoping to review it early next week and get it posted for everyone.   Quarterly Focuses (delegation and robustness)   Delegation - Initial delegate compensation poll has passed which means that we can start rewarding delegates tangibly for spending time governing the Maker Protocol.  Delegation - Anchorage is extremely close to offering Maker Delegation functionality to their customers.  Delegation - Looking forward to @ultraschuppi coming onboard as a recognised delegate.  Robustness - Working on figuring out discord permissions and roles to be less of a pain for core unit folks when they try to manage private channels.  Robustness - @blimpa has been working out some bugs in the MIPs portal with dSpot.   Other Initiatives Maker Operational Manual  Work continues to continue. I know we’ve been talking about this for months, and I’m worried it’s going to be singularly unimpressive when we share it (who likes documentation, anyway?) We are in the home stretch now. We’ll have it live on a placeholder URL next week. Huge thanks to @gala, @Patrick_J, @AstronautThis, @prose11, @Derek and everyone else that has contributed so far.  Discord Migration  Having some minor issues figuring out the best way to structure permissions such that everything is functional, but also as private as possible for private channels. On the other hand, opening up some of the working channels to public visibility seems to have been positive.   Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @prose11, @sebix, @Patrick_J  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @Sebix, @prose11  MIPs Update - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.44851290684624
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/01/2022-19:34:14",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2022-02-25/13460",
            "title": "GovAlpha Weekly Update - 2022-02-25 ",
            "index": 13460,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "4",
                    "time": "25/02/2022-19:54:24",
                    "content": " GovAlpha Weekly Update  Highlight Nothing really worth highlighting this week. More or less business as usual and incremental progress on a number of initiatives.  Quarterly Focuses  Participation   @TheExistence and @LongForWisdom working on the off-chain governance incentives options and recommendations post.  @hernandoagf continuing his work on a governance dashboard.  @Patrick_J working on onboarding some of our new Recognized Delegate applicants.   Exploration  No progress to report this week.   Other Stuff   @Gala getting a handle on invoicing, payment and accounting processes within GovAlpha.  @hernandoagf and @AstronautThis working on parameter documentation for the Maker Operational Manual.  @AstronautThis continuing to investigate how to determine a good value for the ESM Threshold.  @prose11 catching up on everything after EthDenver.   Weekly Tasks  Executive Process - @Patrick_J + @LongForWisdom  Polls Process - @prose11 , @TheExistence, @Gala  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @LongForWisdom  Delegate Metric Tracking - @Patrick_J  MIPs update - @Gala, @blimpa  Office Hours - @LongForWisdom   ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.059185606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "25/02/2022-21:41:40",
                    "content": "Can you please provide more color with regards to @prose11 meeting with SourceCred and what their outlook is in continuing to improve their analytical services and what were some of the suggestions made/discussed? Or, does your team believe this post describes all the findings made/possible in improving SourceCred: Off-Chain Governance List of Options and Recommendations Thanks in advanced! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "4",
                    "time": "28/02/2022-16:38:05",
                    "content": "Hey Frank  The SourceCred Report and the Recommendations are the long version of a lot of what I discussed. Essentially I wanted to let @s_ben know that we value all the work he and others have done for us while also making SourceCred aware that we are planning to experiment with our set up, leaving it up to the community if and how we continue with SourceCred. The SourceCred folks are constantly adding new features and analysis to the SourceCred algorithm, but deciding what makes sense to implement for Maker has been a bit of a challenge. One of the things we agreed on was it didn’t make a lot of sense to keep SourceCred/Seth on retainer for customization going forward in April. SourceCred is still open to helping us out (especially if we continue our tithe to the organization), but ultimately neither side (GovAlpha or SourceCred) really has the time to make the previous retainer arrangement worthwhile. Depending on how these discussions go it is possible that we’ll want to contract with SourceCred for a particular design in the future (one of the things we’ve tossed around for example is crafting a seperate delegate instance to utilize the cred scores for delegate activity). But it all depends what the community wants to do with our forum incentivization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.412121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/05/2022-16:38:18",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-07-15/9364",
            "title": "GovAlpha Weekly Update - 2021-07-15 ",
            "index": 9364,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "10",
                    "time": "15/07/2021-16:46:20",
                    "content": " Highlights  Work on delegation continues. Now have a launch date of 2021-08-02. Announce post will come soon, probably on Monday. Meet your delegates meetings will be scheduled in the next few weeks. More forum stuff and docs will be made public soon. Several SourceCred things either here or coming. Technical design here: SourceCred Onchain Technical Design, and more details on Governance Boost work coming very soon. Working with Derek on Coordination sheet for Mandated Actors + Governance to help make transparent what everyone is working on, and the state that it’s in.   External Governance Stuff @prose11 working on a number of forum posts aimed to boost transparency of what’s going on in GovAlpha. First one here: Weekly Cadence for the GovAlpha Core Unit @blimpa continuing to work on the MIPs, fixing issues, making improvements, and creating documentation. Delegation   @LongForWisdom working on several documents that will serve as a guide to delegates and MKR Holders.  @LongForWisdom working on announce and launch posts for delegation within Maker. Meeting with prospective delegates later today, sorting out what they need to do and when for launch. Generally answering questions and debating any issues that crop up.  SourceCred   @prose11 working on SourceCred boost forum post and implementation.  Documentation   @Patrick_J producing more parameter documentation to do in the Maker Operational Manual (that still hasn’t launched.)  @AstronautThis revamping our signal process documentation with the help of @ultraschuppi.  Vote Participation   @LongForWisdom attempting to chase down executive vote-weight.  Snapshot   @prose11 working with several other CU’s and individuals with the goal of getting snapshot up and running for Maker.   Other External Stuff Mandated Actors Coordination   @LongForWisdom and @Derek working on coordination sheet for mandated actors. Hoping to make public very soon. Should help both mandated actors keep track of multi-CU projects, and also help governance keep track of various initiatives.   Internal Governance Stuff  Onboarding tasks continue for @Sebix, @AstronautThis and @Patrick_J.  Weekly Assignments  Executive Process - @prose11  Polls Process - @LongForWisdom, @Sebix  Forum at a Glance - @prose11, @Sebix  GovAlpha Weekly Update - @LongForWisdom  MIPs Update - @Davidutro and @blimpa  Collateral Status Sheet - @blimpa   ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-cadence-for-the-govalpha-core-unit/9300",
                        "https://forum.makerdao.com/t/maker-relay-ep-54-en-espanol/9476",
                        "https://forum.makerdao.com/t/maker-relay-ep-54/9437",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-150-thursday-july-15-17-00-utc/9331/3",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/42",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-150-thursday-july-15-17-00-utc/9331/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.332175925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/07/2021-21:26:07",
                    "content": "    LongForWisdom:  Snapshot   @prose11 working with several other CU’s and individuals with the goal of getting snapshot up and running for Maker.    Snapshot is looking to replace manual Signal Requests? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "2",
                    "time": "16/07/2021-10:21:32",
                    "content": "We’re not looking to replace anything initially, but we’re interested in having it available and doing some trial stuff with it. It feels like a good tool to have in addition to our existing tools. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "14/10/2021-10:22:26",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-06-04/8526",
            "title": "GovAlpha Weekly Update - 2021-06-04 ",
            "index": 8526,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "3",
                    "time": "03/06/2021-16:45:16",
                    "content": " 3 Point Update  UX Design for Delegation is complete. GovAlpha Multi-sig fully setup and separated from interim budget multi-sig. GovAlpha onboarding plans proceeding quickly (forum post soon.)   External Governance Stuff  Delegates  UX Design for Delegation more or less confirmed, will be chasing up next steps this evening. A couple of new prospective delegates joined delegates group. If you’re interested, please get in touch.   MIPs Portal  Work ramping up again going forward, big list of pending feedback for dSpot to work on.  @blimpa has been working hard on making this more awesome, working both with dSpot on the UX side, and with @Davidutro and @charlesstlouis on the MIPs Content side.   Maker Operational Manual (Governance Documentation)  Posted forum thread to solicit input on structure and contents. Still non-public, and needs some more work before we’ll unveil.   SourceCred  Payton working with Seth to figure out how to boost Cred for specific categories and tags. Progress slow, more complex than it sounds. SourceCred lying low in June, back in July. Confirmed details of coming technical work to move SourceCred infrastructure on-chain.   Forum  Not too much progress here - lots of stuff half-done, but relatively low priority so has gone on the backburner this week.   Other External Stuff   @prose11 - Helping coordinate various community working groups.  @LongForWisdom - MKR Compensation discussions + Work  @LongForWisdom + @prose11 - Moderation and dispute resolution regarding RWA governance processes.   Internal GovAlpha Stuff  Onboarding  Figuring out how best to onboard people. Ongoing, has been difficult in the past. ‘Help Wanted’ post is written, pending feedback before posting.   Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @prose11 and @blimpa  Forum at a Glance - @Elihu  GovAlpha Weekly Update - @LongForWisdom  MIPs Update - @Davidutro and @blimpa  Collateral Status Sheet - @blimpa    Multi-sig  GovAlpha multi-sig is setup and funds moved to that  wallet instead of the Interim Budget Multi-sig. See here: GovAlpha Administered Multi-sig   @LongForWisdom and @prose11 spent some time setting up and testing mechanism to do batch payment for contributors. More transparency on accounting and spending coming soon. Just need to figure out the appropriate level of privacy for contributors.  ",
                    "links": [
                        "https://forum.makerdao.com/t/govalpha-administered-multi-sig/8304",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-144-thursday-june-3-17-00-utc/8459/2",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/34",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-144-thursday-june-3-17-00-utc/8459/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-48/8609",
                        "https://forum.makerdao.com/t/maker-relay-ep-48-en-espanol/8636"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.703877005347594
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/09/2021-16:46:02",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-09-16/10349",
            "title": "GovAlpha Weekly Update - 2021-09-16 ",
            "index": 10349,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "5",
                    "time": "16/09/2021-16:33:38",
                    "content": " Highlights   @blimpa pushed a Primer for MIP Authors to the MIPs Portal! Check it out if you’re considering writing a MIP    @LongForWisdom went full machine mode and published thoughts on Prioritization in the DAO, MIP60: Intangible Asset Assignment, and Interim Intangible Asset Assignment docs.  @Gala has been grinding away on outlines for Video Content in collaboration with @Content-Production    MIPs   @blimpa has been updating MIPs and keeping the Portal in order.  @blimpa and @prose11 will be updating out of date preambles on the forum that’s to the work of @Patrick_J and @TheExistence    Chat Migration   @LongForWisdom has teamed up with @seth, @Davidutro, and TechOps to explore the migration from Rocket Chat. We will be discussing the viability of moving to Discord in today’s Governance and Risk Call.   SourceCred   @prose11 has been coordinating with the SourceCred team and is looking for a simple audit on the first deliverable of the OnChain Technical Design, a Merkle claim contract that will allow contributors to grab their SourceCred DAI at their convenience. Please message me if you think you could be of assistance!   Onboarding  More contributors taking on more tasks  thanks for all the learning and training calls on the Collateral Onboarding Sheet and Delegate Metric Tracking sheets @Sebix , @Gala , @TheExistence and @Patrick_J.  @AstronautThis learned how to review polls.   Parameter Display Site  DSpot continues to develop a “cat-flip-like” website with the guidance of @LongForWisdom    Weekly Assignments  Executive Process - @LongForWisdom  Polls Process - @prose11, @Patrick_J, @TheExistence  Governance and Risk Meeting Chair - @LongForWisdom  GovAlpha Weekly Update - @prose11  Delegate Metric Tracking - @TheExistence, @Sebix, @Patrick_J (group effort this week <3) MIPs Update - @blimpa  Collateral Status Sheet - @blimpa, @Sebix, @Gala, @Patrick_J (group effort this week <3)  ",
                    "links": [
                        "https://forum.makerdao.com/t/prioritization-in-makerdao/10261",
                        "https://forum.makerdao.com/t/mip60-intangible-asset-assignment/10319",
                        "https://forum.makerdao.com/t/interim-intangible-asset-assignment/10320",
                        "https://forum.makerdao.com/t/maker-relay-ep-63/10400",
                        "https://forum.makerdao.com/t/maker-relay-ep-63-en-espanol/10443"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.111111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/12/2021-16:34:18",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-weekly-update-2021-10-07/10839",
            "title": "GovAlpha Weekly Update - 2021-10-07 ",
            "index": 10839,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "4",
                    "time": "07/10/2021-16:52:28",
                    "content": " Highlights   @prose11 is back from his week off    @Sebix eliminated over 300 seldom used tags on the forum.  @Patrick_J has drafted an updated Delegate Metric Tracking sheet to better capture Delegate Communication.   Other Projects  Maker Operational Manual   @gala has been hard at work, creating a repo to use for a GitBooks iteration Coming Soon     SourceCred   @TheExistence met with @s_ben to get better aquatinted with Maker’s SourceCred instance. Looking into displaying Cred scores on the forum. On-Chain Distribution work is on pause (still looking for an audit).   MIPs   @blimpa has been hard at work getting new fixes and features added to the MIPs Portal. Pablo has also been in contact with several Core Unit Facilitators concerning @LongForWisdom’s Core Unit Budget Implementation Standardization post. This week was formal submission for October, always a busy time of month in MIPs Land.   RocketChat Migration   @LongForWisdom continues to take the lead for GovAlpha, collaborating with @Davidutro , @seth , and @dumitru to deliver a new chat platform (Discord Server) to the community by the end of the month.   Weekly Assignments  Executive Process - @prose11  Polls Process - @AstronautThis , @sebix, @LongForWisdom, @Patrick_J, @prose11  Governance and Risk Meeting Chair - @prose11  GovAlpha Weekly Update - @prose11  Delegate Metric Tracking - @TheExistence, @Sebix, @LongForWisdom , @Patrick_J  MIPs Update - @blimpa  Collateral Status Sheet - @Gala, @Sebix   ",
                    "links": [
                        "https://forum.makerdao.com/t/core-unit-budget-implementation-standardization/10758",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3321969696969695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/10/2021-03:36:58",
                    "content": "    prose11:  RocketChat Migration   Any updates on the parameters folks will need to follow in order to join the future Maker Discord channel? Will it involve a basic Captcha, or has the team discover distinctive ways to keep spammers out? I truly believe NFT guarded Discord Channels will be a thing to combat such. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/10/2021-11:59:35",
                    "content": "    prose11:   Looking into displaying Cred scores on the forum.    That would be cool, it would be like seeing who is more efficient at collaborating. Do you think it helps the efficiency of the content posted on the forum? Do you think it is positive?     prose11:   On-Chain Distribution work is on pause (still looking for an audit).    I have been wondering about this for several days. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.346590909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/10/2021-23:34:17",
                    "content": "    Saludiego_201:  That would be cool, it would be like seeing who is more efficient at collaborating. Do you think it helps the efficiency of the content posted on the forum? Do you think it is positive?   Hi! It is definitely something that we should explore and that can turn out to be something positive. It could be implemented through a badge that is updated monthly. Like any indicator, what it would do is provide us with more information. In this case it would allow us to see clearly who is who and to have more information when we interact, which could favor the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5383522727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "06/01/2022-23:34:50",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "10"
}