{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-should-the-dao-hire-a-recruiter/5944",
            "title": "[Informal Poll] Should the DAO hire a recruiter? ",
            "index": 5944,
            "category": [
                "Governance"
            ],
            "tags": [
                "signaling",
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#1",
                    "likes": "1",
                    "time": "06/01/2021-19:15:32",
                    "content": "As we transition to a fully autonomous DAO, we’re going to need to find and retain talent in many areas. We need a strong smart contracts team, a communications team, people who create Dai integration partnerships, and so on. One source of talent is this community. People find their way to us, get excited about the project, and decide they want to be more involved. We have found and will keep finding great people that way. But we are probably missing out on a pool of skilled people who do not have their finger on the pulse of crypto. People who would do great work here, but need to be found by the DAO rather than having them finding us. Finding talented people and convincing them to work somewhere is itself a skill. It’s what recruiters do. Having a recruiter could unlock a large pool of paid DAO participants. As I understand it, recruiters often specialize in fields, so we may need multiple recruiters in the future. But as a first step, do you think we should add a Recruitment Domain and find someone to fill that role? There is no timeline associated with a positive result, I mostly want to introduce the idea and get us thinking about how to structure recruitment for the DAO in the future.    Should the DAO hire a recruiter?  Yes No Abstain     0 voters     ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing that the DAO should hire a recruiter to find and retain talent for various areas. The author explains the benefits of having a recruiter and asks for feedback on whether the DAO should add a Recruitment Domain and find someone to fill that role. The post does not contain any advertising or collaboration requests.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.491044372294372
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "5",
                    "time": "06/01/2021-19:30:11",
                    "content": "So I don’t think a signal request is the best format for proposing this (apologies @swakya , I should have made this clear when you spoke to me earlier.) . A Declaration of Intent would be better (see here for some discussion on why: MakerDAO Standard Governance Processes). At this stage, I think this makes a better informal poll than a signal request, so I’m going to make the changes and push it in that direction. If the informal poll goes well, then it would imply that spending the time on the Declaration of Intent would be worthwhile. On the subject itself, having a dedicated recruiter sounds like it could be beneficial. Maybe this comes under the Operational Support domain rather than as a separate domain though? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#3",
                    "likes": "1",
                    "time": "06/01/2021-19:52:08",
                    "content": "Sounds good, thanks for moving it to the right place  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.976190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#4",
                    "likes": "4",
                    "time": "06/01/2021-19:54:34",
                    "content": "    swakya:  But as a first step, do you think we should add a Recruitment Domain and find someone to fill that role?   I figured Operational Support could house a recruiter position if it wanted to. Seems to be well-positioned to do that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#5",
                    "likes": "2",
                    "time": "14/01/2021-18:19:04",
                    "content": "just got reminded about this poll during todays governance meeting  I wonder if we are in a similar situation as any attractive opensource project - just using the inflow of people coming to the ecosystem and grow organically? at least for now, it would be better to grow not too fast and just stick to people who are really hooked on the product (and therefor start engaging with it) instead of (aggressively) hangout out job descriptions on linkedin. maybe this is not really a “no” but a “let’s stay grounded”… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#6",
                    "likes": "0",
                    "time": "14/01/2021-18:28:47",
                    "content": "I voted yes, but I wonder if staffing a standing recruiter head makes the most sense. There are tons of firms out there that offer “recruiting as a service” where you basically reach out to them as you have job openings and they deal with finding qualified candidates for the interview pipeline. For this they basically just charge commission for each hire you end up making. Seems like we would be better served with a setup like that. The way i would think you want this to work is you would have some standing relationship with one of these recruiting agencies, and some standing recruitment budget to cover hiring commissions. Then as different Domain teams have budget / need for additional heads they would be able to, relatively easily, secure the funds to cover commissions on that hire. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#7",
                    "likes": "3",
                    "time": "15/01/2021-08:22:29",
                    "content": "    Andy_McCall:  There are tons of firms out there that offer “recruiting as a service” where you basically reach out to them as you have job openings and they deal with finding qualified candidates for the interview pipeline. For this they basically just charge commission for each hire you end up making. Seems like we would be better served with a setup like that.   I have worked with those agencies for some years and I have not been too happy with them. As they usually got payed on commission for each signed contract, they are usually more interested on signing contracts than finding a long-term fitting candidate. It is not the same as someone from withing the company/group caring about finding a suitable candidate - it is more like they are trying to sell a candidate to you. probably also a matter of incentives (“you get 25% on hiring, 75% after six months if the candidate is still with us”) you run into the same risk (though not that extereme) if you come up with a “referal bonus” for your staff - nevertheless I made a couple of really good hires by personal referral of my staff. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/02/2021-18:22:30",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}