{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip102c2-sp4-mip-amendment-subproposals/20035",
            "title": "MIP102c2-SP4: MIP Amendment Subproposals ",
            "index": 20035,
            "category": [
                "Maker Improvement Proposals",
                "RFC"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#1",
                    "likes": "0",
                    "time": "02/03/2023-16:24:07",
                    "content": " MIP102c2-SP4: MIP Amendment Subproposals  Preamble MIP102c2-SP#: 4 MIP(s) to be amended: Author(s): @GFXlabs Contributors: Tags: subproposal Status: RFC Date Proposed: Date Ratified: N/A Forum URL: https://forum.makerdao.com/t/mip102c2-spxxx-mip-amendment-subproposals/20035 Ratification Poll URL:    Specification  Motivation This subproposal will amend TBD  Amended MIPs and Components TBD  Amendment Pull Request TBD ",
                    "links": [],
                    "GPT-summary": "The post is a proposal for amending MIPs, with the author explaining the purpose of the subproposal. It also includes information on the contributors, tags, status, and relevant links for the proposal. The post does not contain any feedback, criticism, or collaboration requests.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/03/2023-16:24:10",
                    "content": "This post has been reserved for GovAlpha’s proposal summary on proposal MIP102c2-SPXXX: MIP Amendment Subproposals ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip102c2-sp2-mip-amendment-subproposals/20016",
            "title": "MIP102c2-SP2: MIP Amendment Subproposals ",
            "index": 20016,
            "category": [
                "Maker Improvement Proposals",
                "RFC"
            ],
            "tags": [
                "mips-amen",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "0",
                    "time": "01/03/2023-17:35:09",
                    "content": " MIP102c2-SP2: MIP Amendment Subproposals  Preamble MIP102c2-SP#: 2 MIP(s) to be amended: Author(s): Rune Contributors: Tags: subproposal Status: RFC Date Proposed: Date Ratified: N/A Forum URL: https://forum.makerdao.com/t/mip102c2-sp2-mip-amendment-subproposals/20016 Ratification Poll URL:    Specification  Motivation This subproposal amends the Maker Constitution and the Scope Frameworks to include the first iteration of changes that are more long term focused, determined during March.  Amended MIPs and Components  MIP101 MIP103 MIP104 MIP105 MIP106 MIP107 MIP108 MIP109 MIP110 MIP111 MIP112 MIP113 MIP114   Amendment Pull Request ",
                    "links": [],
                    "GPT-summary": "The post is a proposal for amending the Maker Constitution and the Scope Frameworks. The proposal includes changes that are more long-term focused and amends several MIPs. The post provides links to the forum and ratification poll URLs for further discussion and voting.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/03/2023-11:58:16",
                    "content": "This post has been reserved for GovAlpha’s proposal summary on proposal MIP102c2-SP2: MIP Amendment Subproposals ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip102c2-sp5-mip-amendment-subproposals/20034",
            "title": "MIP102c2-SP5: MIP Amendment Subproposals ",
            "index": 20034,
            "category": [
                "Maker Improvement Proposals",
                "RFC"
            ],
            "tags": [
                "mips-amen"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#1",
                    "likes": "0",
                    "time": "02/03/2023-16:22:07",
                    "content": " MIP102c2-SP5: MIP Amendment Subproposals  Preamble MIP102c2-SP#: 5 MIP(s) to be amended: Author(s): @GFXlabs Contributors: Tags: subproposal Status: RFC Date Proposed: Date Ratified: N/A Forum URL: https://forum.makerdao.com/t/mip102c2-sp3-mip-amendment-subproposals/20034/1 Ratification Poll URL:    Specification  Motivation This subproposal amends the Maker Constitution and the Scope Frameworks.  Amended MIPs and Components TBD  Amendment Pull Request TBD ",
                    "links": [],
                    "GPT-summary": "The post is a proposal for amending the Maker Constitution and the Scope Frameworks. The author is explaining the proposal and providing details about the MIPs to be amended. The post does not contain any feedback or advertising, and there are no questions or collaborations mentioned.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/03/2023-16:22:12",
                    "content": "This post has been reserved for GovAlpha’s proposal summary on proposal MIP102c2-SPXX: MIP Amendment Subproposals ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip102c2-sp1-mip-amendment-subproposals/19703",
            "title": "MIP102c2-SP1: MIP Amendment Subproposals ",
            "index": 19703,
            "category": [
                "Maker Improvement Proposals",
                "Formal Submission"
            ],
            "tags": [
                "mips",
                "mips-amen",
                "impact-:-high",
                "endgame",
                "constitution-mip-set"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "1",
                    "time": "06/02/2023-21:36:15",
                    "content": " MIP102c2-SP1: MIP Amendment Subproposals  Preamble MIP102c2-SP#: 1 MIP(s) to be amended: MIP0, MIP16, MIP24, MIP39, MIP40, MIP41, MIP51, MIP55 Author(s): Rune Contributors: Tags: subproposal Status: Formal Submission Date Proposed: 2023-02-6 Date Ratified: N/A Forum URL: https://forum.makerdao.com/t/mip102c2-sp1-mip-amendment-subproposals/19703 Ratification Poll URL:    Specification  Motivation This subproposal amends all the critical MIPs needed to support the Pregame Maker Constitution and Scope Frameworks.  Amended MIPs and Components  MIP0 MIP16 MIP24 MIP38 MIP39 MIP40 MIP41 MIP51 MIP55   Amendment Pull Request https://github.com/makerdao/mips/pull/847 ",
                    "links": [
                        "https://forum.makerdao.com/t/mip101-the-maker-constitution/19621/31",
                        "https://forum.makerdao.com/t/weekly-mips-update-125/19812",
                        "https://forum.makerdao.com/t/weekly-mips-update-127/20001",
                        "https://forum.makerdao.com/t/governance-and-risk-call-228-thursday-march-2-2023-17-00-utc/20031",
                        "https://forum.makerdao.com/t/weekly-mips-update-130/20226",
                        "https://forum.makerdao.com/t/weekly-mips-update-128/20070",
                        "https://forum.makerdao.com/t/weekly-mips-update-129/20172",
                        "https://forum.makerdao.com/t/weekly-mips-update-124/19706",
                        "https://forum.makerdao.com/t/weekly-mips-update-126/19881"
                    ],
                    "GPT-summary": "The post is a formal submission of a subproposal to amend several critical MIPs needed to support the Pregame Maker Constitution and Scope Frameworks. The author explains the motivation behind the subproposal and lists the MIPs that will be amended. Additionally, the author provides a link to the amendment pull request. A 3rd party could provide constructive criticism or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "1",
                    "time": "06/02/2023-22:33:19",
                    "content": "This is a summary of the potential impact of this proposal, from GovAlpha’s perspective:  This subproposal is the first instantiation of the MIP102c2 process component. MIP102 will, if it passes, supersede MIP4, the MIP whose amending process we’ve been using up till now. The Amendment PR can be seen here. It will amend MIP0, the foundational MIP, thusly:  It removes most of its components and changes it into a minimal MIP to serve in the transition from the MIP Framework to the Constitution-centered Scope Frameworks. It prohibits that new MIPs be submitted. Already accepted MIPs (excepting those that will be listed below) are to be marked as obsolete and deprecated. However, MIPs and subproposals that are ongoing or diversely active (such as those that launch smart contracts, set up legal entities, etc) are generally to keep running. Exceptions are the Endgame MIPs, which includes:  MIP0 MIP16: The Weekly Cycle MIP24: Urgent Processes The CU Framework MIPs MIP51: The Monthly Cycle MIP MIP55: SPF and MIPs 101 through MIP114     It will amend MIP16:  Restricts the possibility to put forth weekly-cycle proposals to Facilitators listed in the Arbitration Scope Framework Determines that the only way to make arbitrary changes to governance is through the amendment of Scope Frameworks Other role changes (Governance Security Advisory Council instead of PE)   It will amend MIP24:  Replaces Governance Facilitators by Arbitration Facilitators   It will amend CU Framework MIPs (MIP38, MIP39, MIP40, and MIP41:  Added a new component that defines special rules for the Endgame transition:  No new Core Units nor budgets can be proposed or approved Recurrent budgets are to be discontinued (except for SF-001’s, which is allowed to recur once) Core Unit responsibilities and roles are overridden by the Constitution and by Scope Frameworks. However, if no direction is given, they can fall back onto their mandate. Once all budgets have run out, CU Framework MIPs will be marked as obsolete.     It will amend MIP51:  It modifies the Monthly Governance Cycle to proceed more efficiently, with less risk, and more participation. It reduces the number of votes that take place for each monthly cycle, it ensures that only one Executive Vote is required per week under normal circumstances. It aims to make the governance cycle less complex and easier to understand.   It will amend MIP55:  It establishes that no more SPFs can be created, but existing SPFs continue until they run out. Once no more SPFs are active from this MIP, it must be moved to obsolete status.    Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2023-03-08 ",
                    "links": [
                        "https://github.com/makerdao/mips/pull/847",
                        "https://mips.makerdao.com/mips/details/MIP0",
                        "https://mips.makerdao.com/mips/details/MIP16",
                        "https://mips.makerdao.com/mips/details/MIP24",
                        "https://mips.makerdao.com/mips/details/MIP38",
                        "https://mips.makerdao.com/mips/details/MIP39",
                        "https://mips.makerdao.com/mips/details/MIP40",
                        "https://mips.makerdao.com/mips/details/MIP41",
                        "https://mips.makerdao.com/mips/details/MIP51",
                        "https://mips.makerdao.com/mips/details/MIP24"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.258221617092584
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/02/2023-03:47:13",
                    "content": "Is it possible to get a summary of what these amendments will be? It would be valuable to be able to make comments during the “request for comment” period. It would also help to ensure any major changes are not buried in the forum or in a pull request link that most people will not click on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.328125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#4",
                    "likes": "1",
                    "time": "28/02/2023-16:58:54",
                    "content": "MIP 0 edited text below @MIP-Editors please help create PR   MIP0: The Maker Improvement Proposal Framework  Preamble MIP#: 0 Title: The Maker Improvement Proposal Framework Author(s): Charles St.Louis (@CPSTL), Rune Christensen (@Rune23) Contributors: @LongForWisdom, @blimpa, @Elihu Type: Process Status: Accepted Date Proposed: 2020-04-06 Date Ratified: 2020-05-02 Last Amended: 2023-02-26 Dependencies: n/a Replaces: n/a Ratification Poll URL: Forum URL: https://forum.makerdao.com/t/mip0-the-maker-improvement-proposal-framework/1902 Extra: This MIP has been amended. See [MIP4c2-SP10](https://mips.makerdao.com/mips/details/MIP4c2SP10), [MIP4c2-SP13](https://mips.makerdao.com/mips/details/MIP4c2SP13) [MIP4c2-SP14](https://mips.makerdao.com/mips/details/MIP4c2SP14). The original version can be found [here](https://github.com/makerdao/mips/blob/2f474bd463b2a239ed9a26dcf6509c3471e8a55b/MIP0/mip0.md).   References General-MIP-Template.md Technical-MIP-Template.md  Sentence Summary MIP0 defines the Maker Improvement Proposals (MIPs) Framework for all subsequent MIPs to utilize.  Paragraph Summary MIP0 defines the Maker Improvement Proposals (MIPs) Framework for all subsequent MIPs to utilize. This MIP is the foundational MIP that provides the necessary templates, processes, and guidelines for working within the framework and defines the key roles required for the operation of the MIPs Process.  Component Summary MIP0c1: Definitions of the Maker Improvement Proposal Framework Defines core concepts of the MIP Framework. MIP0c2: Endgame Configuration Specifies which MIPs are active MIP0c3: The MIP Lifecycle Defines the formal stages in the lifecycle of MIPs from conception to approval, rejection, or deferral. MIP0c4: MIP Components and MIP Component Types Defines MIP Components and their types.  Motivation For MakerDAO to evolve into a fully decentralized and self-sustainable organization, a formalized process of decision-making is required. The MIP Framework serves to empower each off-chain and on-chain Governance participant by giving them a standardized way of interacting with the wider DAO. In Endgame, the MIP framework is eventually going to be fully replaced with the Maker Constitution and the Scope Frameworks, and this MIP regulates the transition period before they are fully replaced.  Specification / Proposal Details  MIP0c1: Definitions of the Maker Improvement Proposal Framework   Maker Improvement Proposals (MIPs): - MIPs are standardized documents subject to voting that, once given the accepted status through the process described in MIP0, regulate and define the behavior of Maker Governance and the Maker Protocol. MIPs can be amended and removed. All MIPs except for Endgame MIPs are automatically considered obsolete, and do not have any effect on Maker Governance processes, Governance Polls, or Executive Votes.  Endgame MIPs: Endgame MIPs are MIPs that are specifically designated in MIP0c2 to remain active after the Maker Constitution has come into effect.  Governance Process Support Ecosystem Actors: Individuals or companies that have been publicly designated by an Ecosystem Facilitator to be tasked with Governance Process Support, including MIP process support.  Subproposals (SPs): Subproposals are instances of Process MIP Components. See MIP0c4.  Minimum Feedback Period: The minimum amount of time within which the community can give feedback in response to a proposed MIP before it can advance to Formal Submission. See MIP0c3.  Minimum Frozen Period: The minimum amount of time during which a MIP must remain unchanged before it can advance to Formal Submission. See MIP0c3.   MIP0c2: Endgame MIPs New MIPs cannot be submitted. All MIPs except the Endgame MIPs and their Subproposals lose their accepted status, and must be assigned as obsolete. They are automatically considered obsolete by Maker Governance, regardless of which status they have been assigned. All MIPs except the Endgame MIPs and their Subproposals have no effect, and do not impact Maker Governance, Core Units, or the Maker Protocol in any way, and cannot trigger Governance Polls or Executive Votes. This does not affect consequences of those MIPs that has already occured, such as smart contracts, legal entities, payments that have already been made, etc. The Endgame MIPs are: MIP0 MIP16 MIP24 MIP38 MIP39 MIP40 MIP41 MIP51 MIP55 MIP62 MIP101 MIP102 MIP103 MIP104 MIP105 MIP106 MIP107 MIP108 MIP109 MIP110 MIP111 MIP112 MIP113 MIP114  MIP0c3: The MIP Lifecycle  MIP Lifecycle Breakdown   Conception: A MIP Author posts a MIP proposal in the Maker forum under the Maker Improvement Proposals category. From this point on, Governance Process Support Ecosystem Actors will be available to assist the MIP Author.   Approved by Governance Process Support Ecosystem Actor(s): A Governance Process Support Ecosystem Actor verifies that the posted MIP proposal:  Follows the appropriate format of the MIP Template for its type. See MIP0c4. Is a valid Subproposal based on a Process Component of an Endgame MIP Has been submitted to the MIPs GitHub repository with a Pull Request by either the MIP Author or a Governance Process Support Ecosystem Actor.  If the verification is successful, the Governance Process Support Ecosystem Actor:  Approves the MIP and assigns it a formal MIP number. Merges in the PR.    Request for Comments (RFC): A period of reviewing by the community and attendant redrafting begins. The minimum duration of this period is determined by two variables contained within the Process Component:  Feedback Period Frozen Period  These periods can overlap. See MIP0c1 for their definitions.   Fulfilled Feedback Period Requirements: After the MIP has fulfilled the RFC phase, it is ready for Formal Submission.   Formal Submission (FS): At this point, the MIP Author submits their MIP to the Governance Cycle by moving it to the Formal Submission forum category within the formal submission window of a Governance Cycle.   Approved by the Governance Process Support Ecosystem Actor(s): The Governance Process Support Ecosystem Actors evaluate the MIP. If they do not approve it, the MIP may be reconsidered to enter the Governance Cycle at a later date.   Monthly Governance Cycle: At this point, the proposal enters the Monthly Governance Cycle.   Accepted/Rejected: The MIP is voted on. If it passes, it is officially accepted and is given the Accepted status. If not, the MIP is rejected.    Other MIP Statuses   Obsolete: Assigned when:  A MIP has been superseded or deprecated. A MIP has been deferred for over six months. A MIP Author has abandoned the proposal and no person has communicated willingness to take over the responsibility of a MIP Author. A MIP is not an Endgame MIP as defined in MIP0c2     MIP Status Change Process If a MIP Author requests a status change for a MIP, a Governance Process Support Ecosystem Actor will review it. If the status change is warranted, the Governance Process Support Ecosystem Actor will change the status. Otherwise, the Governance Process Support Ecosystem Actor will revert and highlight issues for the MIP Author to fix before requesting another status change.   MIP0c4: MIP Components and MIP Component Types  MIP Components In order to satisfy the Core Principles of clarity and completeness, a MIP may need to have multiple components that each define distinct units of logic. A MIP Component can be of one of two types: General or Process. The type of General MIP Components is usually left undeclared: It is the assumed type of components that are not of Process type. MIP components can specify that they supersede other components in the same MIP. If a component specifies that it supersedes other components in the MIP, then the superseded components must be interpreted differently, to account for the parts that have been superseded and no longer have an effect.  Process MIP Component MIP Components of the Process type shape a specific process flow for the Maker community to adopt and standardize with respect to how governance operates. This MIP component type helps streamline particular processes in a transparent, open, and traceable manner. In this MIP, MIP0c5 is a Process Component. Process MIP Components require no special template.  Subproposals Subproposals are special MIPs defined Process MIP Components. Subproposals go through the same process MIPs do, as described in MIP0c3. For their derived subproposals, Process Component MIPs define:  Which template they must use. If none is specified, no special template is needed. Their Feedback Period and their Frozen Period.   Naming conventions MIP Components follow the naming convention MIPXcY, where X is the parent MIP and Y is the component number. Subproposals follow the naming convention MIPXcY-SPZ, where X is the parent MIP, Y is the component number, and Z is the subproposal number. ",
                    "links": [
                        "https://github.com/makerdao/mips",
                        "https://forum.makerdao.com/c/mips/fs/16",
                        "https://github.com/makerdao/mips/blob/master/MIP51/mip51.md#mip51c1-governance-cycle-breakdown",
                        "https://github.com/makerdao/mips/blob/master/MIP51/mip51.md"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.359734563681933
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#5",
                    "likes": "1",
                    "time": "28/02/2023-16:59:41",
                    "content": "MIP 16 edit below, @MIP-Editors please help create PR   MIP16: The Weekly Governance Cycle  Preamble MIP#: 16 Title: The Weekly Governance Cycle Author(s): Rune Christensen (@Rune23), Charles St.Louis (@CPSTL) Contributors: Tags: process, governance Type: Process Status: Accepted Date Proposed: 2020-07-01 Date Ratified: 2020-07-28 Dependencies: Replaces: n/a Ratification Poll URL: https://vote.makerdao.com/executive/template-executive-vote-approve-monthly-governance-cycle-bundle-increase-the-eth-a-debt-ceiling?network=mainnet#proposal-detail Forum URL: https://forum.makerdao.com/t/mip17-weekly-actual-debt-ceiling-and-actual-risk-premium-adjustments/3021 Extra: This MIP has been amended. See [MIP4c2-SP12](https://mips.makerdao.com/mips/details/MIP4c2SP12) and [MIP4c2-SP20](https://mips.makerdao.com/mips/details/MIP4c2SP20). The original version can be found [here](https://github.com/makerdao/mips/blob/a42a0d21dc9929d222d31ac16300637cd403085f/MIP16/mip16.md).   References n/a  Sentence Summary MIP16 defines and formalizes the Weekly Governance Cycle to provide a more predictable weekly framework for Maker governance decisions.  Paragraph Summary This proposal formalizes a Weekly Governance Cycle for the Maker Governance system. In short, the Weekly Governance Cycle provides a predictable framework for Maker Governance decisions to be made on a per-week basis. It complements the Monthly Governance Cycle (MIP51) by enabling recurring weekly decisions to be made that require quicker action.  Component Summary MIP16c1: Weekly Governance Cycle Definitions Defines key terms related to the Weekly Governance cycle. MIP16c2: Weekly Governance Cycle Breakdown Breaks the Weekly Governance Cycle down into the actions that take place over the course of the week. MIP16c3: Limiting Governance to MIP-defined processes Defines the requirement of only allowing MIP-defined processes to be used for Maker Governance.  Motivation The goal of the standardized Weekly Governance Cycle is to formalize the current-day weekly operations that Maker governance uses to maintain the Maker Protocol. The Weekly Governance Cycle is used explicitly for recurring operational decisions that require quicker action than the Monthly Governance Cycle (defined in MIP51). For example, the Weekly Cycle will be used to modify rates and debt ceilings for the collateral types in the Maker collateral portfolio. It is important to note that due to the frequency of such changes, the Weekly Cycle is not suitable for long term or substantial decisions but is ideal for specific time-sensitive decisions that do not require an Emergency vote. Lastly, the Weekly Cycle provides MKR holders and community members more advanced notification of governance activities.  Specification / Proposal Details  MIP16c1: Weekly Governance Cycle Definitions  A Weekly Poll is a non-binding MKR poll that determines the weekly Executive Vote contents. In this context, a non-binding weekly poll refers to the fact that a weekly poll cannot change the system parameters independently; it merely dictates what will be included at the end of week in the Executive Vote. A Non-Standard Weekly Poll is a non-binding weekly poll that has arbitrary time-sensitive decisions that MKR holders have to make in a relatively short period of time. These polls are needed to be expedited through the Maker governance process via a separate vote. The use of non-standard weekly polls is dedicated to Facilitators, given that they have already established a high level of trust with the community. Furthermore, the use of non-standard weekly governance polls will be limited to situations where the weekly governance cycle is determined to operate too slowly to be usable. Facilitators listed in the Arbitration Scope Framework have been authorized by Maker Governance to make proposal using the weekly cycle to enable them to fulfill their responsibilies. To protect the integrity of existing MIPs, Signal Requests are only permitted when they are specifically triggered and required by an existing MIP. This component explicitly forbids the possibility of community-triggered Signal Requests about arbitrary issues. It is also explicitly specified that the only way to make arbitrary changes to Maker Governance is through the amendment of Scope Frameworks.    MIP16c2: Weekly Governance Cycle Breakdown Monday, week 1  Every Monday, the weekly cycle begins and includes standard recurring decisions proposed in the form of a weekly poll. The poll will run for three days.  Friday, week 1  The Arbitration Facilitators will confirm the Executive Vote contents and deliver the spell copy to the Governance Security Advisory Council. The Governance Security Advisory Council will prepare and review a spell on the Goerli testnet.  Monday, week 2  The Governance Security Advisory Council will deploy the Goerli spell and begin writing the mainnet spell.  Tuesday, week 2  The Governance Security Advisory Council will deploy the mainnet spell.  Wednesday, week 2  The Arbitration Facilitator will add the Executive Vote to the voting portal and communicate this to the MakerDAO Community. The Weekly Executive Vote has an expiration of thirty days.   Overview of the Weekly Governance Cycle  Important Notes:  As the Weekly Governance Cycle runs from Monday until the following Wednesday, there will in effect be two concurrent Weekly Governance Cycles from Monday to Wednesday each week. If there are no substantive changes due to be made to the Maker Protocol, the Arbitration Facilitators, in conjunction with the Protocol Engineering Core Unit, may opt not to publish an Executive Vote. This decision should be announced and justified on the Maker Forum. If a non-standard weekly poll (“signal request”) has been proposed, it will also be put in the weekly poll. To create a non-standard weekly poll requires an urgent and apparent reason from a timing perspective to justify it. It is important to note that a non-standard weekly poll cannot be used for long-term decisions and requires consensus from the Arbitration Facilitators before it can be accepted and published.    MIP16c3: Limiting Governance to MIP-defined processes With the acceptance of this MIP, non-emergency governance of the Maker Protocol must now happen under processes defined by Accepted MIPs. MIPs defining governance processes include MIP51 and MIP16, which define monthly and weekly Governance Cycles, respectively. In addition, the use of the weekly cycle as defined in this MIP should only occur where there is a specific need to use the weekly cycle as opposed to the monthly cycle. Consensus among the Arbitration Facilitators is required in order to make use of the weekly cycle as opposed to the monthly cycle. Emergency governance actions are explicitly allowed outside of MIP-defined governance processes due to the time-sensitive nature of emergency responses and the permissionless nature of on-chain proposals and voting.  ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP51/mip51.md",
                        "https://github.com/makerdao/mips/blob/master/MIP51/mip51.md",
                        "https://github.com/makerdao/mips/blob/master/MIP16/mip16.md"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.256592712842712
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#6",
                    "likes": "0",
                    "time": "28/02/2023-17:05:36",
                    "content": "MIP24 edited below, @MIP-Editors please add PR   MIP24: Emergency Voting System  Preamble MIP#: 24 Title: Emergency Response Author(s): @Davidutro, @jtathmann  Contributors: Tags: general, governance, emergency Type: General Status: Accepted Date Proposed: 2020-09-07 Date Ratified: 2020-11-24 Dependencies: Replaces: MIP5 Ratification Poll URL: https://vote.makerdao.com/executive/template-executive-vote-approve-november-2020-governance-cycle-bundle-november-23-2020?network=mainnet#proposal-detail Forum URL: https://forum.makerdao.com/t/mip24-emergency-voting-system-replaces-mip-5/4009 Extra: This MIP has been amended. See [MIP4c2-SP11](https://mips.makerdao.com/mips/details/MIP4c2SP11). The original version can be found [here](https://github.com/makerdao/mips/blob/d83fec9ddc9623a6f58ad5131e819ff46bd31695/MIP24/mip24.md).   References MIP5: Emergency Voting System Forum Thread: Emergency / Urgent Governance Process Forum Thread: Covid Crash: Emergency Governance Summary  Sentence Summary MIP24 defines emergency and urgent situations for the Maker protocol, as well as the process for handling them.  Paragraph Summary This proposal defines an emergency voting system. Emergency votes are executive votes that can be initiated by any community member. This MIP aims to provide a general guide that can be applied to a wide range of urgent situations. Additionally, this MIP will differentiate between an emergency and an urgent situation, and provide processes which can be carried out to deal with either consistently.  Component Summary MIP24c1: Situation Definitions Defines the terms “urgent” and “emergency” for purposes of an expedited governance change. MIP24c2: Considerations of Expedited Protocol Changes Outlines the various considerations that should be made before enacting expedited changes. MIP24c3: Emergency Response Procedure A general procedure for managing emergency situations. MIP24c4: Urgent Response Procedure A general procedure for managing urgent situations. MIP24c5: Role of Arbitration Facilitators Outlines the tasks of the Arbitration Facilitators during emergency interventions.  Motivation The protocol has often required changes outside of the standard weekly and monthly governance cycles to help maintain the peg or to respond to changes in the ecosystem. The goal of this MIP is to provide a consistent process to manage emergencies and urgent issues.  Specification / Proposal Details  MIP24c1: Situation Definitions The procedure for managing expedited changes to the protocol will depend on whether a situation is classified as an emergency or urgent. Emergency: Any situation that would require immediate intervention to prevent initiation of Emergency Shutdown, severe peg divergence, or harm to members and users of the ecosystem. Urgent: Any situation that includes a time-sensitive matter that would need an expedited governance process, where following a standard governance cycle would be too slow, risk a larger problem, or constitute an important missed opportunity.  MIP24c2: Considerations of Expedited Protocol Changes There are several important factors to consider before expediting changes to the protocol.  Potential for MKR holders to miss a poll or executive vote due to departure from the standard governance cycles. Expedited votes may not allow for sufficient discussion, leading to a sub-optimal solution. Increased governance burden on community and increased workload for domain teams. Frequent expedited votes may signal a lack of appreciation for a consistent and predictable governance process.   MIP24c3: Emergency Response Procedure The ability to declare an emergency will be reserved for Facilitators due to their proximity to, and knowledge of, the Maker Protocol and surrounding ecosystem. If a community member wishes to declare an emergency, they will follow the urgent response procedure outlined in MIP24c4. If an Arbitration Facilitator agrees that the status of the urgent situation should be escalated to “emergency,” they will do so. The emergency response process will be initiated as follows: Declare an emergency in the public forum providing sufficient detail regarding the issue and why immediate action is required. If time does not permit, a forum post will be created immediately after or in parallel to taking emergency action. Creating a signal request thread or governance poll is optional.  If a remedy is known and uncontentious the Arbitration Facilitators will coordinate with necessary Ecosystem Actors to expedite an executive vote. If a remedy is not known or is contentious the Arbitration Facilitators will coordinate an emergency governance call to discuss solutions and a plan for subsequent actions, explicitly inviting known stakeholders.   MIP24c4: Role of Arbitration Facilitators Arbitration Facilitators will oversee emergency and urgent situation processes to ensure they are carried out in a civil and consistent manner. They will be responsible for confirming poll outcomes and identifying whether the community or external actors have attempted to abuse or game the emergency voting system, and may block a request for emergency action at their discretion. ",
                    "links": [
                        "https://forum.makerdao.com/t/emergency-urgent-governance-process/3926",
                        "https://forum.makerdao.com/t/covid-crash-emergency-governance-summary/2437"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.233552631578947
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#7",
                    "likes": "0",
                    "time": "28/02/2023-17:43:26",
                    "content": "MIP38 edit, @MIP-Editors   MIP38: Core Unit MIP Set Definitions  Preamble MIP#: 38 Title: Core Unit MIP Set Definitions Author(s): @juanjuan, @blimpa Contributors: @elprogreso, @iammeeoh, @gala, @twblack88 Tags: general, core-unit-framework, mip-set, core-unit-framework-mipset, living Type: Informational Status: Accepted Date Proposed: 2021-01-18 Date Ratified: 2021-03-25 Dependencies: MIP39, MIP40, MIP41, MIP4c2-SP10, MIP4c2-SP12 Replaces: n/a Ratification Poll URL: Forum URL: Extra: This MIP has been amended. See [MIP4c2-SP15](https://mips.makerdao.com/mips/details/MIP4c2SP15). The original version can be found [here](https://github.com/makerdao/mips/blob/7fdb552680486bbd84dfd84b64980e0999249043/MIP38/mip38.md).   References N/A  Sentence Summary MIP38 is the fundamental MIP in the Core Unit MIP Set. The definitions it contains hold the Core Unit MIP Set together.  Paragraph Summary MIP38 is the fundamental MIP in the Core Unit MIP Set, both defining the MIP Set and providing a framework. Core Units —further defined below— are the basic workforce divisions that Maker Governance can oversee, manage and prioritize. MIP38 contains a list intended to keep track of Core Units, their Budgets, and Facilitators. Core Units cannot be modified through this MIP but by using the corresponding dedicated MIP Component in the MIP Set.  Component Summary MIP38c1: Core Unit MIP Set Framework This component provides the basic definitions for the Core Unit Framework. MIP38c2: Core Unit List This component defines the Core Unit List, its format, and its upkeep. MIP38c3: Endgame transition This component defines the special rules of Endgame Transition as they apply to all Core Unit related MIPs  Motivation This MIP provides a basic structure based on Core Units, further defined below, capable of supporting the increasing complexity of the DAO and its continuous expansion. This MIP also contains a list that keeps track of existing and offboarded Core Units. Under its stripped-down, homogeneous nature, this structure avoids the hassle of ad-hoc implementations that are hard to analyze and interface.  Specification / Proposal Details  MIP38c1: Core Unit MIP Set Framework  Core Unit Core Units are the basic workforce divisions that Maker Governance can oversee, manage and prioritize. Core units are managed by one or more Facilitators (further defined in MIP41) who have access to a Budget (further defined in MIP40) that must be put to use to fulfill the Core Unit’s Mandate (further defined in MIP39). Core Units are established across three MIPs that, at inception, must be ratified simultaneously:  MIP39: Core Unit Onboarding and Offboarding Framework MIP40: Core Unit Budget Framework MIP41: Core Unit Facilitator Framework  More precisely, each Core Unit is defined via at least three subproposals:  One MIP39c2 subproposal establishing the onboarding of the Core Unit. Core Unit onboarding, modification and offboarding are further defined in MIP39: Onboarding and Offboarding Framework. One or more MIP40c3 subproposals that assign a budget to the Core Unit. The Core Unit budget is further defined in MIP40: Budget Framework. One or more MIP41c4 subproposals that designate a Facilitator for the Core Unit. The Facilitator role is further defined in MIP41: Facilitator Framework.  Collectively, these subproposals define and —upon approval by Maker Governance— onboard a Core Unit.  MIP38c2: Core Unit List This list contains all of the Core Units approved by Governance, alongside the Core Units’ key information:  Core Unit Mandates. Budget Implementation and Breakdown. Facilitator name, information, and commitment. Relevant Dates.  This list is updated by the MIP Editors when a subproposal from MIP39, MIP40, or MIP41 is ratified. Offboarded Core Units are archived at the end of the list under Offboarded Core Units. List Entry Template:   Core Unit Name (Core Unit ID)   Summary - 30 word max summary.  Ratification Date for the Initial Proposal Set - [yyyy-dd-mm]  Mandate  MIP39c2-SPX  Budget   Active Budget - MIP40c3-SPX   Budget Amount - xxx,xxx DAI / year  Budget Implementation - Manual/Simple/Advanced - MIP40c3-SPX   Budget Breakdown - MIP40c3-SPX internal anchor link     Facilitator  Awes M. Example - MIP41c4-SPX  Gre T. Example - MIP41c4-SPY      MIP38c2: Core Unit State  Risk (RISK-001)   Summary - Risk Core Unit ensures Maker Protocol can continue to grow safely by having proper risk management parameters and risk mitigation tools applied.  Ratification Date for the Initial Proposal Set - 2021-03-25   Mandate  MIP39c2-SP35   Active Budget   Active Budget - MIP40c3-SP56   Ratification Date - 2022-02-28  Budget Amount * A total of 2,760,000 DAI will be streamed to 0xb386Bc4e8bAE87c3F67ae94Da36F385C100a370a starting 2022-03-01 and ending 2023-02-28  Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP56 internal anchor link     MKR Vesting - MIP40c3-SP25    Facilitator  Primož Kordež - MIP41c4-SP1     GovAlpha (GOV-001)   Summary - This Core Unit intends to fulfill MakerDAO’s requirement of a consistent and well-run governance process managed by elected facilitators in order to remain stable and secure as it grows.  Ratification Date for the Initial Proposal Set - 2021-03-25   Mandate  MIP39c2-SP3   Budget   Active Budget - MIP40c3-SP59   Ratification Date - 2022-03-28  Budget Amount - A total of 1,079,793 DAI will be streamed to 0x01D26f8c5cC009868A4BF66E268c17B057fF7A73 starting at 2022-04-01 and ending at 2023-04-01.  Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP59 internal anchor link     MKR Vesting - MIP40c3-SP80    Facilitator(s)  Payton Rose - MIP41c4-SP12  Patrick_J - MIP41c4-SP37     Protocol Engineering (PE-001)   Summary - The Protocol Engineering Team’s responsibility is to extend the functionality of the Maker protocol, assist with the maintenance and operation of existing smart contracts, and ensure the safety and correctness of protocol design and implementation.  Ratification Date for the Initial Proposal Set - 2021-04-27   Mandate  MIP39c2-SP7   Budget   Active Dai Budget - MIP40c3-SP68   Ratification Date - 2021-04-25  Budget Amount -  7,590,000 DAI / year  Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP68 internal anchor link     MKR Vesting - MIP40c3-SP7 - MIP40c3-SP68    Facilitator  Derek Flossman - MIP41c4-SP7     Growth (GRO-001)   Summary - The Growth Core Unit aims to grow the available distribution channels for the Maker protocol by intelligently deploying the human and financial capital given by the DAO, increasing the supply and demand of Dai in the global markets.  Ratification Date for the Initial Proposal Set - 2021-04-27   Mandate  MIP39c2-SP19   Budget   Active Budget - MIP40c3-SP70 — winning option was “BearMarket”   Ratification Date - 2022-06-27  Budget Amount - 4,210,261.40 DAI / twelve months  Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP70 internal anchor link     MKR Vesting - MIP40c3-SP23    Facilitator  Nadia Alvarez - MIP41c4-SP4     Sustainable Ecosystem Scaling (SES-001)   Summary - The Sustainable Ecosystem Scaling Core Unit’s mission is to sustainably grow the Maker Protocol’s moats by systematically removing barriers between the decentralized workforce, capital, and work.  Ratification Date for the Initial Proposal Set - 2021-05-25   Mandate  MIP39c2-SP10   Budget   Active Budget - MIP40c3-SP55   Ratification Date - 2022-01-24  Budget Amount - A total of 5,844,444 DAI will be streamed to 0x87AcDD9208f73bFc9207e1f6F0fDE906bcA95cc6 starting 2022-2-1 and ending 2023-1-31.  Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP55 internal anchor link     MKR Vesting - MIP40c3-SP17    Facilitator  Juan - MIP41c4-SP10     Oracles (ORA-001)   Summary - The Oracle Core Unit is responsible for developing and administrating the Oracle Protocol. Oracles are a critical component of securing the Maker Protocol to ensure positions are sufficiently collateralized.  Ratification Date for the Initial Proposal Set - 2021-06-28   Mandate  MIP39c2-SP13   Budget   Active Budget - MIP40c3-SP45   Ratification Date - 2022-01-24  Budget Amount  6,966,069.84 DAI will be transferred to 0x2B6180b413511ce6e3DA967Ec503b2Cc19B78Db6 on 2021-01-28 1,805,407.21 DAI will be transferred to 0x1A5B692029b157df517b7d21a32c8490b8692b0f on 2021-01-28    Budget Implementation - Manual  Budget Breakdown - MIP40c3-SP45 internal anchor link)    MKR Vesting - MIP40c3-SP15    Facilitator  Niklas Kunkel - MIP41c4-SP13     Dai Foundation (DAIF-001)   Summary - The Dai Foundation Core Unit is responsible for facilitating the dialogue between the Dai Foundation and the Community regarding intellectual property safeguarding, intellectual property usage, and related activities.  Date Ratified - 2021-08-23   Mandate  MIP39c2-SP17   Budget   Active Budget - MIP40c3-SP24   Ratification Date - 2021-08-23  Budget Amount  2,138,591 Dai (first year) 1,038,599 Dai (second year) 463,186 Dai (third year)    Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP24 internal anchor link      Facilitator  Søren Peter Nielsen - MIP41c4-SP18     StarkNet Engineering (SNE-001)   Summary - In a volatile, high gas cost environment, DeFi protocols are attempting to build bridges to L2 protocols to access liquidity and remain competitive. This proposal is a plan to build a DAI bridge over Starknet within 3 months (phase I).  Ratification Date for the Initial Proposal Set - 2021-09-27   Mandate  MIP39c2-SP19   Budget   Active Budget - MIP40c3-SP47   Ratification Date - 2022-01-24  Budget Amount  One-off setup of DAI 229,792 on February 4th A total of DAI 257,500 (6*42,917) will be streamed to 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1 starting 02-01-2022 and ending 07-31-2022    Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP47 internal anchor link   MKR Vesting - MIP40c3-SP79      Facilitator   @badgerofthe9d - MIP41c4-SP20     Collateral Engineering Services (CES-001)   Summary - To operationalize collateral management within the Maker Protocol allowing anyone to onboard collateral while ensuring the stability and security of the ecosystem.  Ratification Date for the Initial Proposal Set - 2021-09-27   Mandate  [MIP39c2-SP37]((mips/MIP39c2-SP37.md at master · makerdao/mips · GitHub)   Budget   Active Budget - MIP40c3-SP57   Ratification Date - 2022-02-28  Budget Amount  259,184 DAI for 3-month budget runway shortfall streamed to 0x25307aB59Cd5d8b4E2C01218262Ddf6a89Ff86da 2,780,562 DAI streamed to 0x25307aB59Cd5d8b4E2C01218262Ddf6a89Ff86da from April 1, 2022 to March 31, 2023 259,184 DAI wallet top up streamed to 0xD740882B8616B50d0B317fDFf17Ec3f4f853F44f    Budget Implementation - Advanced  Budget Breakdown - MIP40c3-SP57 internal anchor link     MKR Vesting - MIP40c3-SP30    Facilitator   @Retro has been elected as the interim Facilitator after Robert Jordan’s voluntary offboarding via MIP41c5-SP13.    Development and UX (DUX-001)   Summary - Enabling the best-in-class decentralized decision making for the Maker Protocol by providing a meaningful user experience for all governance participants.  Ratification Date for the Initial ProposalSet - 2021-09-27   Mandate  MIP39c2-SP18   Budget   Active Budget - MIP40c3-SP52   Ratification Date - 2022-01-24  Budget Amount - A total of 1,934,300 DAI will be streamed to 0x5A994D8428CCEbCC153863CCdA9D2Be6352f89ad starting 2022-2-1 and ending 2023-1-31.  Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP52 internal anchor link     MKR Vesting - MIP40c3-SP27    Facilitator  0xdeniz - MIP41c4-SP32     Data Insights (DIN-001)   Summary - The Data Insights Core Unit (DIN-001) is responsible for providing free and permissionless datasets based on detailed Maker Protocol history.  Ratification Date for the Initial Proposal Set - 2021-10-25   Mandate  MIP39c2-SP22   Budget   Active Budget - MIP40c3-SP64   Ratification Date - 2022-04-25  Budget Amount  Unused Incorporation Budget (10,000.00 DAI) and other unused funds from existing monthly budget (est. 45,000.00 DAI) will be returned to the protocol not later than on 2022-05-10 A total of 1,083,000.00 DAI will be streamed to 0x7327Aed0Ddf75391098e8753512D8aEc8D740a1F starting 2022-05-01 and ending 2023-04-30 at a rate of 90,250.00 DAI per month    Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP34 internal anchor link     MKR Vesting - MIP40c3-SP64 internal anchor link    Facilitator  Tadeo - MIP41c4-SP35     Deco Fixed-Rate (DECO-001)   Summary - The Deco Protocol is a fixed-rate protocol designed to be flexible and safe. Its design anticipated that its first and most effective initial application may be on Maker.  Ratification Date for the Initial Proposal Set - 2021-11-22   Mandate  MIP39c2-SP23   Budget   Active Budget - MIP40c3-SP35   Ratification Date - 2021-11-22  Budget Amount  Initial seed transfer of 465,625 Dai 155,208.33 Dai/month streamed continuously    Budget Implementation -  Budget Breakdown - MIP40c3-SP35 internal anchor link     MKR Vesting - MIP40c3-SP36    Facilitator  Vamsi Alluri - MIP41c4-SP24     Immunefi Security (IS-001)   Summary - Immunefi’s Mission is to systematically improve security for builders, end users, and other stakeholders in the Maker Ecosystem by providing both reactive and proactive security services.  Ratification Date for the Initial Proposal Set - 2021-11-22   Mandate  MIP39c2-SP24   Budget   Active Budget - MIP40c3-SP58   Ratification Date - 2022-02-28  Budget Amount  95,442.5 DAI will be transferred to 0xd1F2eEf8576736C1EbA36920B957cd2aF07280F4 on 2021-12-01 138,000 DAI will be transferred to 0xd1F2eEf8576736C1EbA36920B957cd2aF07280F4 on 2022-03-01 A total of 366,562.50 DAI will be streamed to 0xd1F2eEf8576736C1EbA36920B957cd2aF07280F4 starting 2021-12-01 and ending 2022-08-01 A total of 207 000 DAI will be streamed to 0xd1F2eEf8576736C1EbA36920B957cd2aF07280F4 starting 2022-03-01 and ending 2022-12-01    Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP58 internal anchor link       MKR Vesting - MIP40c3-SP41    Facilitator  Travin Keith - MIP41c4-SP25     Sidestream Auction Services (SAS-001)   Summary - Sidestream Auction Services’s mission is to improve security, transparency, and accessibility of the Maker Protocol by providing and maintaining auction services through open-source development.  Ratification Date for the Initial Proposal Set - 2021-11-22   Mandate  MIP39c2-SP25   Budget   Active Budget - MIP40c3-SP43   Budget Amount - 282,598.13 Dai (Total Budget Cap spanning a three-month runway)  Budget Implementation - Simple via dssvest  Budget Breakdown - MIP40c3-SP43 internal anchor link     MKR Vesting - MIP40c3-SP44    Facilitator  Daniel Kremerov - MIP41c4-SP26     Strategic Finance (SF-001)   Summary - Strategic Finance Core Unit’s mission is to provide financial reporting and analysis to assist the DAO in evaluating the financial health of the protocol to enable strategic decision making and allocate capital more effectively.  Ratification Date for the Initial Proposal Set - 2022-01-24   Mandate  MIP39c2-SP36   Budget   Active Budget - MIP40c3-SP69 — winning option was “Business as usual”; accordingly, the links below point to the previous budget:   Budget Amount - A total of 989.004 Dai will be streamed to 0xf737C76D2B358619f7ef696cf3F94548fEcec379 (SF Core Unit Multisig) starting 07/01/22 and ending 07/01/23 at a rate of 82,417 Dai per month.  Budget Implementation - Simple via dssvest - MIP40c3SP46 internal anchor link   Budget Breakdown - MIP40c3-SP46 internal anchor link     MKR Vesting - MIP40c3-SP48    Facilitator  Mark Phillips (@Aes) - MIP41c4-SP28     TechOps (TECH-001)   Summary - TechOps Core Unit mission is to handle the system administration and technical support needs of the Maker Protocol and its Core Units.  Ratification Date for the Initial Proposal Set - 2022-01-24   Mandate  MIP39c2-SP29   Budget   Active Budget - MIP40c3-SP53 - Ratification Date - 2022-01-24 - Budget Amount - 2,246,400 DAI / year - Budget Implementation - Simple via dssvest - MIP40c3SP53 internal anchor link - Budget Breakdown - MIP40c3-SP53 internal anchor link   MKR Vesting - MIP40c3-SP54    Facilitator  Dumitru Zavrotschi (@dumitru) - MIP41c4-SP30  Simon Kelada-Polupanov (@simonkp) - MIP41c3-SP31    Offboarded Core Units  Governance Communications (COM-001)   Summary - The Governance Communications Core Unit performs a set of programs that focus on MakerDAO’s informational accessibility, stakeholder coordination, and communication practices as a decentralized and public organization.  Ratification Date for the Initial Proposal Set - 2021-07-26  Ratification Date for Offboarding - 2023-01-23    Related Proposals see       Content Production (MKT-001)   Summary - The Content Production Core Unit is responsible for creating, and supporting the creation of written, audio, and visual content that educates audiences on MakerDAO, promotes the work and culture of the ecosystem, and encourages people to use Dai and the Maker Protocol.  Ratification Date for the Initial Proposal Set - 2021-04-27  Ratification Date for Offboarding - 2022-01-24  Related Proposals see    MakerDAO Shop (MDS-001)   Summary - The MakerDAO Shop Core Unit helps build brand awareness and goodwill for MakerDAO and Dai by offering branded items (Swag, NFTs, etc) via the official MakerDAO store.  Ratification Date for the Initial Proposal Set - 2021-04-27  Ratification Date for Offboarding - 2022-03-28  Related Proposals see     Real-World Finance (RWF-001)   Summary - This Core Unit is designed to pursue Real-World Asset work and more generally helps MakerDAO to take over the traditional finance world.  Ratification Date for the Initial Proposal Set - 2021-03-25  Ratification Date for Offboarding - 2022-10-24  Related Proposals see     Strategic Happiness (SH-001)   Summary - The SHCU aims to promote community engagement and promote the Maker brand by strategically spreading happiness, positive vibes, and mild but delightful confusion throughout the Maker Community via memes, shitposts, and Bespoke Happiness Airdrops.  Ratification Date for the Initial Proposal Set - 2021-09-27  Ratification Date for Offboarding: - 2022-10-24  Related Proposals see     EVENTS (EVENTS-001)   Summary - Events Core Unit (EVENTS-001) will coordinate and execute MakerDAO branded events at Crypto/DEV Conference locations.  Ratification Date for the Initial Proposal Set - 2022-04-25  Ratification Date for Offboarding - 2022-10-24  Related Proposals see     MIP38c3: Endgame transition In case of conflict, this component supersedes other components in the MIP. To enable the smooth transition to Endgame, Core Unit related MIPs (MIP38, MIP39, MIP40, MIP41) continue to function temporarily during the Pregame after the Maker Constitution has passed. They are used only to provide budget continuity for existing, approved budgets, and to provide a temporary solution for designating Responsible Facilitators in the Scopes. New Core Units can no longer be proposed or be approved, new budgets cannot be proposed or approved, and recurring budgets do not automatically renew. The only exception to the rule against recurring budget is the Strategic Finance Budget which can recur a single time. All Core Unit roles defined in the Core Unit related MIPs no longer apply, and are superseded by the rules and responsibilities defined in the Maker Constitution or Scope Frameworks. If no direction is given to a Core Unit in the Maker Constitution or the Scope Frameworks, they can fall back on their existing Core Unit mandate, but must also make efforts to support and enable the transition to Endgame, and provide input for how their work can be incorporated in the Scopes. Over time, all budgets provided from the Core Unit related MIPs will run out, and the Core Units will be transitioned to new budgets and have their work regulated through the Maker Constitution and Scopes. Once the transition is complete and all budgets have run out or been offboarded, and no more payments occur to any Core Unit defined in the Core Unit MIPs, all of the Core Unit MIPs become obsolete and stop having any effect. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP56.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP56.md#list-of-budget-implementations",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP25.md",
                        "https://mips.makerdao.com/mips/details/MIP41c4SP2",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP59.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP59.md#budget-breakdown",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP80.md",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c4-Subproposals/MIP41c4-SP12.md",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c4-Subproposals/MIP41c4-SP37.md",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c2-Subproposals/MIP39c2-SP7.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP68.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP68.md#list-of-budget-breakdowns",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP7.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP7.md",
                        "https://mips.makerdao.com/mips/details/MIP41c4SP7",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP19",
                        "https://github.com/makerdao/mips/blob/34cce188049e6d6d1adcfcaf0c4fde1c6e4f7085/MIP40/MIP40c3-Subproposals/MIP40c3-SP70.md",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP70#list-of-budget-breakdowns",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP23",
                        "https://mips.makerdao.com/mips/details/MIP41c4SP4",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP10",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP55.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP55.md#budget-breakdown",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP17.md",
                        "https://mips.makerdao.com/mips/details/MIP41c4SP10",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP13",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP45.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP45.md#budget-breakdown",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP15.md",
                        "https://mips.makerdao.com/mips/details/MIP41c4SP13",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP17",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP24.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP24.md#budget-breakdown",
                        "https://mips.makerdao.com/mips/details/MIP41c4SP18",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c2-Subproposals/MIP39c2-SP19.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP47.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP47.md#list-of-budget-breakdowns",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP79.md",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c4-Subproposals/MIP40c4-SP20.md",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c2-Subproposals/MIP39c2-SP37.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP57.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP57.md#budget-breakdown",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP30.md",
                        "https://forum.makerdao.com/t/fallback-interim-facilitator-selection-process-ces-001/18911/30",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c5-Subproposals/MIP41c5-SP13.md",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c2-Subproposals/MIP39c2-SP18.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP52.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP52.md#budget-breakdown",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP27.md",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c4-Subproposals/MIP41c4-SP32.md",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c2-Subproposals/MIP39c2-SP22.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP64.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP64.md#budget-breakdown",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP64.md#mkr-vesting",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c4-Subproposals/MIP41c4-SP35.md",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c2-Subproposals/MIP39c2-SP23.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP35.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP35.md#budget-breakdown",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP36.md",
                        "https://mips.makerdao.com/mips/details/MIP41c4SP24",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP24",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP58.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP58.md#budget-breakdown",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP41",
                        "https://mips.makerdao.com/mips/details/MIP41c4SP25",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c2-Subproposals/MIP39c2-SP25.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP43.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP43.md#list-of-budget-breakdowns",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP44.md",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c4-Subproposals/MIP41c4-SP26.md",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c2-Subproposals/MIP39c2-SP36.md",
                        "https://github.com/makerdao/mips/blob/24779f52630df945595594759e4cb4b757f4c177/MIP40/MIP40c3-Subproposals/MIP40c3-SP69.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP46.md#budget-implementation",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP46.md#budget-breakdown",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP48.md",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c4-Subproposals/MIP41c4-SP28.md",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c2-Subproposals/MIP39c2-SP29.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP53.md",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP53.md#budget-implementation",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP53.md#budget-breakdown",
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP54.md",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c4-Subproposals/MIP41c4-SP30.md",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c4-Subproposals/MIP41c4-SP31.md",
                        "https://mips.makerdao.com/mips/list?search=%24%23cu-com-001&orderDirection=ASC&hideParents=true&",
                        "https://mips.makerdao.com/mips/list?search=%24%23cu-mkt-001&orderDirection=ASC&hideParents=true&",
                        "https://mips.makerdao.com/mips/list?search=%24%23cu-mds-001&orderDirection=ASC&hideParents=true&",
                        "https://mips.makerdao.com/mips/list?search=%24%23cu-rwf-001&orderDirection=ASC&hideParents=true",
                        "https://mips.makerdao.com/mips/list?search=%24%23cu-sh-001&orderDirection=ASC&hideParents=true&",
                        "https://mips.makerdao.com/mips/list?search=%24%23cu-events-001&orderDirection=ASC&hideParents=true&"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.428207198892478
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#8",
                    "likes": "0",
                    "time": "28/02/2023-17:49:47",
                    "content": "MIP39 edit @MIP-Editors   MIP39: Core Unit Framework  Preamble MIP#: 39 Title: Core Unit Framework Author(s): @juanjuan Contributors: @elprogreso, @iammeeoh Tags: process, core-unit-framework, mip-set, core-unit-framework-mipset Type: Process Status: Accepted Date Proposed: 2021-01-18 Date Ratified: 2021-25-03 Dependencies: MIP38, MIP40, MIP41, MIP4c2-SP10, MIP4c2-SP12 Replaces: n/a Ratification Poll URL: https://vote.makerdao.com/executive/template-executive-vote-approve-march-2021-governance-cycle-bundle-march-22-2021?network=mainnet#proposal-detail Forum URL: https://forum.makerdao.com/t/mip39-core-unit-framework/6096 Extra: This MIP has been amended. See [MIP4c2-SP15](https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291). The original version can be found [here](https://github.com/makerdao/mips/blob/7fdb552680486bbd84dfd84b64980e0999249043/MIP39/mip39.md).   References MIP39c2-Subproposal-Template.md MIP39c3-Subproposal-Template.md  Sentence Summary MIP39 is part of the Core Unit Framework MIP Set and describes the processes for 1) onboarding and offboarding Core Units, 2) modifying Core Unit Mandates, and 3) renaming Core Units.  Paragraph Summary MIP39 is part of the Core Unit Framework MIP Set, which further comprises MIP38, MIP40, and MIP41. MIP39 contains the full definition of Mandate within the Core Unit Framework; it also establishes the processes for:  Onboarding and offboarding Core Units. Modifying Core Unit Mandates. Renaming Core Units.   Component Summary MIP39c1: Core Unit Mandate Defines Core Unit Mandates. MIP39c2: Adding/Modifying Core Units (Process Component) Defines the processes for onboarding Core Units, refreshing Core Unit Mandates, and renaming Core Units. MIP39c3: Offboarding Core Units (Process Component) Defines the process for offboarding Core Units.  Motivation As the Foundation dissolves, MakerDAO must take over the tasks and responsibilities no longer fulfilled. We believe MakerDAO’s current structure is too ill-defined to be able to integrate these successfully. A new architecture is needed for MakerDAO to achieve full autonomy. Core Units are designed to be easy-to-transition-to and capable of accommodating both the current structures and the Foundation’s newly delegated operations within a coherent framework. Core Units define long-term work areas and cover a broad set of responsibilities or focus. They are the basic units of work that Maker Governance is able to oversee, manage and prioritize.  Specification / Proposal Details  MIP39c1: Core Unit Mandate Mandates are self-imposed declarations that define the work scope and responsibilities for any given Core Unit. Mandates are initially ratified at onboarding time, but they can be modified at a later time via single MIP39c2 subproposals. In the interest of being flexible, relatively broad and open-ended Mandates are to be preferred over granular Mandates. In the interest of promoting redundancy, parallelization, and decentralization within the DAO, Mandates can overlap across Core Units. Mandates are one of the three fundamental entities that define a Core Unit along with Budgets and Facilitators. The interaction among these entities is detailed in MIP38.  MIP39c2: Adding/Modifying Core Units MIP39c2 subproposals spearhead the onboarding of Core Units by defining their name and Mandate. Alternatively, when applied singly on a ratified Core Unit, MIP39c2 subproposals can be used to modify its name or Mandate or both.  Core Unit Onboarding Process A Core Unit is brought into existence within MakerDAO upon the simultaneous, bundled ratification of at least three subproposals:  One MIP39c2 subproposal that defines its name and Mandate. One MIP40c3 subproposal that defines its Budget. One or more MIP41c4 subproposals that define its Facilitators.  In the particular case of Governance Core Units, their Core Unit ID must have the prefix GOV. Although these subproposals can fulfill their Feedback and Frozen Periods independently, they need to be formally submitted at the same time. Upon Formal Submission, these subproposals will be bundled into one single, binary Ratification Poll that can be either fully rejected or fully accepted.          Subproposals involved in the Core Unit onboarding process. (Note that multiple MIP41c4 subproposals can be submitted when a Core Unit is to have more than one Facilitator.)     Core Unit Mandate Refreshing Process / Core Unit Renaming Process MIP39c2 subproposals can also be applied singly on ratified, active Core Units to modify their name or Mandate or both.  1005×161 8.74 KB   Subproposal Parameters and Template The parameters for MIP39c2 subproposals are:   Minimum Feedback Period: 1 month.  Minimum Frozen Period: 1 week.  Governance Cycle: Monthly.  MIP39c2 subproposals must use the template located at MIP39c2-Subproposal-Template.md.  MIP39c3: Offboarding Core Units (Process Component) Core Units can be offboarded from MakerDAO by utilizing MIP39c3 subproposals. The ratification of a MIP39c3 subproposal triggers the following sequence of events:  Determining who will be executing the unwinding plan:  The Retiring Facilitator An Interim Facilitator chosen via the Fallback Process defined in MIP41c6.   Adapting the Facilitator’s permissions to meet the needs of the unwinding plan Executing the unwinding plans for the Core Unit  An offboarded Core Unit should conduct all winding down activities within four months from the ratification date of the offboarding.  Unwinding Execution Plan Budgets built after the Core Unit Budget Process ratified via MIP4c2-SP19 include an unwinding plan that defines the tasks to execute at offboarding time and the compensation for them. Legacy budgets do not include unwinding plans. A broad, default plan and a compensation is provided here for them:  Transferring intangible MakerDAO assets (access to DAO-claimable platforms, e-mail accounts, websites, etc.) back into the DAO. Documenting and delegating the activities previously carried out by the unwinding Core Unit that impact the DAO. To the extent that this is reasonable and possible, provide enough detail so that other Core Units can pick up these activities. Settling outstanding debts both to contributors and external actors/services. Returning unused funds.  Unwinding compensation will transfer to the Retiring/Interim Facilitator upon completion. The compensation is set to be 33% of the annual salary of the Facilitator of the Core Unit that is being offboarded, as per its latest ratified budget. If the Core Unit budget is not public or cannot be accessed, a fallback budget is recommended. Compensation parameters could be set to Full-time, moderate facilitator experience, using a recent transparent budget as a reference.  Permissions Immediately after the ratification of the offboarding, some of the Facilitators’ permissions will be removed. They will only retain permissions that are necessary for the Core Unit unwinding. At this stage, the Facilitators are to be considered Retiring Facilitators.  Overview of the Offboarding Process upon a MIP39c3 Subproposal Ratification      886×708 41.2 KB      Sequence of events triggered by a ratified MIP39c3 subproposal.    MIP39c3 subproposals must use the template located at MIP39c3-Subproposal-Template.md The parameters for MIP39c3 subproposals are:   Minimum Feedback Period: 1 month.  Minimum Frozen Period: 1 week.  MIP39c3 subproposals must use the template located at MIP39c3-Subproposal-Template.md.  MIP39c4: Endgame transition In case of conflict, this component supersedes other components in the MIP. To enable the smooth transition to Endgame, Core Unit related MIPs (MIP38, MIP39, MIP40, MIP41) continue to function temporarily during the Pregame after the Maker Constitution has passed. They are used only to provide budget continuity for existing, approved budgets, and to provide a temporary solution for designating Responsible Facilitators in the Scopes. New Core Units can no longer be proposed or be approved, new budgets cannot be proposed or approved, and recurring budgets do not automatically renew. The only exception to the rule against recurring budget is the Strategic Finance Budget which can recur a single time. All Core Unit roles defined in the Core Unit related MIPs no longer apply, and are superseded by the rules and responsibilities defined in the Maker Constitution or Scope Frameworks. If no direction is given to a Core Unit in the Maker Constitution or the Scope Frameworks, they can fall back on their existing Core Unit mandate, but must also make efforts to support and enable the transition to Endgame, and provide input for how their work can be incorporated in the Scopes. Over time, all budgets provided from the Core Unit related MIPs will run out, and the Core Units will be transitioned to new budgets and have their work regulated through the Maker Constitution and Scopes. Once the transition is complete and all budgets have run out or been offboarded, and no more payments occur to any Core Unit defined in the Core Unit MIPs, all of the Core Unit MIPs become obsolete and stop having any effect. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c3-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c2-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c3-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/master/MIP39/MIP39c3-Subproposal-Template.md"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.499868187368188
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#9",
                    "likes": "0",
                    "time": "28/02/2023-17:52:45",
                    "content": "MIP40 edit @MIP-Editors   MIP40: Budget Process Framework  Preamble MIP#: 40 Title: Budget Framework Author(s): @Aes, @adcv, @SebVentures Contributors: @LongForWisdom, @madshills, @MakerMan Tags: core-unit-framework, mip-set, core-unit-framework-mipset, budget-framework Status: Accepted Date Proposed: 2022-03-27 Date Ratified: 2022-05-23 Dependencies: MIP0, MIP16 Replaces: MIP40 Extra: This MIP has been amended. See [MIP4c2-SP19](https://mips.makerdao.com/mips/details/MIP4c2SP19). The original version can be found [here](https://github.com/makerdao/mips/blob/7fdb552680486bbd84dfd84b64980e0999249043/MIP40/mip40.md).   Sentence Summary MIP40: Budget Framework contains a framework for managing budgets and modifying them in the DAO Primitives State MIP.  Paragraph Summary MIP40: Budget Framework contains a framework for managing budgets and modifying them in the DAO Primitives State MIP. The Framework includes features to provide transparency and clarity for Governance when making decisions around budgets and a design that enables a high degree of flexibility in implementing payment structures for the Core Units.  Component Summary MIP40c1: Budget Framework Gives an overview of the most critical characteristics of Budgets. MIP40c2: Composition of a Budget Describes the components of a Core Unit Budget proposal. MIP40c3: Adding/Modifying Core Unit Budget Process Describes the process for adding a budget to a new Core Unit or modifying the Core Unit’s existing budget. MIP40c4: Budget Implementation Details Provides clarity on how the budget payouts are addressed from a practical perspective once approved.  Motivation The Budget Framework MIP allows Governance to manage Budget Proposal requests for new and existing Core Units in a standardized way. The motivation is to promote transparency regarding the use of MKR-holder funds and increase fairness in the capital allocation decisions Governance must make. Facilitators should be able to manage their plans dynamically, for instance, depending on changing market conditions, in order to achieve the Objectives of the DAO. The Framework can help Governance guide a given Core Unit, as they could vote (or not) to attach multiple budgets to a Core Unit, each with a different, more specific objective.  Specification / Proposal Details  MIP40c1: Budget Framework Budgets are used to fund the work defined by the Core Units chosen by Maker Governance. A budget is attached to a Core Unit and is meant to be used only for that Core Unit. The Facilitators of each Core Unit administer Core Unit budgets. Once a budget has been approved, Facilitators will be encouraged to file correctly tagged expense reports to the appropriate subsection of the governance forums. Actual expenses should be reported on a monthly basis, following reporting recommendations outlined by SF-001 and SES-001. Facilitators are further encouraged to leverage internal and external tools to improve communication with MKR holders and to dynamically update reporting standards according to evolving DAO needs. If a Facilitator is offboarded from their Core Unit, quits, or goes missing, the budget will continue to be available to pay out according to its Budget Implementation to allow the Core Unit to continue with long-term operations as much as possible. See MIP41c6 for details on this process. Budget Proposal requests must be submitted during a Budget Submission Window. New Core Units can be submitted quarterly (March, June, September, or November Governance Cycles).  MIP40c2: Composition of a Budget Core Unit Budgets can have multiple entries. Having multiple budget entries, each with its implementation and breakdown, enables more advanced compensation and funding structures to be created if desired. Each entry must at least include each of the below elements:  Budget Term  Start Date is no later than 3mos after the formal submission date End Date is no later than 12mos after the Start Date   Increasing Value to Maker Tokenholders  Should demonstrate, over the length of the Budget Term either the potential for revenue growth and/or the potential for a tangible improvement in operational efficiency   Roadmap and Objectives  Provide a timeline for specific deliverables over the course of the Budget Term   Reporting Transparency  List expenses by type, per the Core Unit Operating Expense Budget Template  Also describe how much of the budget is to be utilized towards ‘on-going’ fixed services, and how much is applied to one-time type services/events (planned/unplanned/contingency) Disclose full-time equivalent headcount, by month   Contingency Planning  Explain how this Core Unit could guarantee minimally viable business continuity if the approved Budget Proposal was operating during a Bear/Superbear context: 10%/20% lower  Facilitators should formulate operational budgets capable of operating at lower funding levels Facilitators are encouraged to transparently communicate with collaborators regarding potential impact on compensation during downturns   Explain how this Core Unit could operate if the approved Budget Proposal were operating during a Bull context: With corresponding roadmap oriented around stretch targets   Unwinding and Defunding  Define how the Core Unit will be wound down in the event of a Governance vote to defund it, with accompanying rationale (period, use of funds, return of funds)  Describe what costs will be paid during this period and what costs will not be paid for, including but not limited to:  Finishing current initiatives. Handing initiatives off to another unit Archiving initiatives   Describe how funds will be returned to the DAO Describe one-time expenses that would be needed to wind down the core unit.  This also should be included in the one-time expenses to spin up Detail how the Core Unit will treat non-DAI funds, including MKR, whether vested or not, during the offboarding     Submission Period  Budget Proposals should be submitted during a budget submission window  Quarterly (March, June, September, or November Governance Cycles)     Considerations for Budget Modifications  If an already approved Core Unit is requesting a >10% increase in budget, the new budget proposal must include:  Variance analysis by expense type comparing proposed vs existing budget, including spend and headcount Variances of >10% require disclosure of driver(s)   Detailed business case to justify the increase in investment  Explain why the DAO should make this investment What problem does making this investment solve? Why is now the right time to make the investment? Detailed incremental deliveries expected as a result of increased investment     Considerations for Unwinding and Defunding  Reducing DAO overhead is critical, so managing an offboarding must execute with grace and clarity Please itemize which costs need inclusion for winding down or which will return to the DAO (eg., travel etc.) To conduct a smooth unwinding, it’s suggested to have a 2 of 3 multisig with the ex or interim facilitator executing the wind down   MIP40c3: Adding/Modifying Core Unit Budget Process Once a MIP40c3-SP subproposal passes, the Governance Facilitators or the MIP Editors will update the domain state MIP (MIP38) accordingly. This is a technical process component that can have on-chain effects that alter the Maker Protocol’s state. When subproposals generated from this component reach the executive vote stage of the MIPs cycle, the executive vote must include a technical state change to authorize the budget implementations specified in the subproposal to draw funds from the Maker Protocol.  Proposal Parameters   Minimum Feedback Period: 1 Month.  Minimum Frozen Period: 1 Week. Ratification Polls for MIP40c3 subproposals involving a Core Unit Budget Modification will have different requirements to MIP51c2. Instead of binary voting, they must use ranked-choice voting, with the options as follows:  A: Approve existing budget only (Business as usual) B: Approve increased budget C: Reject budget D: Abstain    In order for this Ratification Poll to conclude successfully and the contained proposal(s) move to Accepted status, each of the following conditions must be true:   A or B vote-weight must exceed C vote-weight when the poll closes. Winning vote-weight must exceed the Minimum Positive Participation value of 10,000 MKR when the poll closes.  MIP40c3 subproposals must use the template located at MIP40c3-Subproposal-Template.  MIP40c4: Budget Implementation Details Once a Budget Proposal is approved, the Core Unit’s Facilitators can begin drawing payments to fund their Core Unit according to their Budget Implementation. The Budget Implementation defines when and how the Core Unit Facilitators will receive the funds that make up their budget. This budget implementation standard to be used is available on this forum post. Variations from this standard must be explained. The Budget Implementation is binding. It should be understood to directly authorize the proposed funds to be drawn from the funding source (either the Maker Protocol or a treasury contract controlled by Maker Governance). Core Unit Budgets are paid out through Budget Implementations, which are smart contracts authorized by Maker Governance to draw funds from the Protocol. It can also be a manual (not smart contract-based) pre-approval by Governance. Maker Governance can explicitly turn a budget implementation off. Budget Implementations create a scheduled rate or transfer of funds taken from the Protocol and given directly to the Core Unit’s Facilitators. Advanced Budget Implementations can be used for more innovative cases, such as incentive payments or unpredictable expenses. They can be implemented in various ways, such as relying on multi-sig access or dependent on system variables such as Protocol auctions, Dai supply or Stability Fees.  Different Fund Types The Budget Implementation could draw funds from the Protocol in various ways, depending on the implementation’s objective. It could draw Dai from the Surplus Buffer and other sources, such as Governance owned smart contracts or reserves that are compatible with Budget Implementations. Printing MKR through this MIP is only allowed if the MKR is to be distributed with a programmed time-lock of at least 12 months. Budget Implementations that don’t verifiably distribute MKR with at least a 12-month time lock cannot be proposed through this MIP.  Return of Funds Every three months starting September 30th, 2022 Core Units will be required to return all funds in excess of three months of budget, defined as the most recent three months budget proceeding the return fund date (e.g. for September 30th deadline, July, August, and September budgets will be used). Exempt are funds destined for any outstanding payments for specific projects that the budget was originally approved for. Calculation Example: Core Unit A’s budget is 100,000 Dai per month for 12 months. If actual spend by the end of the budget period is 600,000, then the minimum that must be returned to the DAO is 300,000. Budget Remaining - (3 * Monthly Budget) = Minimum Amount to Return 600,000 - (3 x 100,000) = 300,000 Transfers should be made to the DssBlow contract, simply send a standard ERC20 Dai transaction: 0x0048fc4357db3c0f45adea433a07a20769ddb0cf  MIP40c5: Endgame transition In case of conflict, this component supersedes other components in the MIP. To enable the smooth transition to Endgame, Core Unit related MIPs continue to function temporarily during the Pregame after the Maker Constitution has passed. They are used only to provide budget continuity for existing, approved budgets, and to provide a temporary solution for designating Responsible Facilitators in the Scopes. New Core Units can no longer be proposed or be approved, new budgets cannot be proposed or approved, and recurring budgets do not automatically renew. The only exception to the rule against recurring budget is the Strategic Finance Budget which can recur a single time. All Core Unit roles defined in the Core Unit related MIPs no longer apply, and are superseded by the rules and responsibilities defined in the Maker Constituion or Scope Frameworks. If no direction is given to a Core Unit in the Maker Constitution or the Scope Frameworks, they can fall back on their existing Core Unit mandate, but must also make efforts to support and enable the transition to Endgame, and provide input for how their work can be incorporated in the Scopes. Over time, all budgets provided from the Core Unit related MIPs will run out, and the Core Units will be transitioned to new budgets and have their work regulated through the Maker Constitution and Scopes. Once the transition is complete and all budgets have run out or been offboarded, and no more payments occur to any Core Unit defined in the Core Unit MIPs, all of the Core Unit MIPs become obsolete and stop having any effect. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposal-Template.md",
                        "https://forum.makerdao.com/t/core-unit-budget-implementation-standardization/10758"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.465061165061165
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#10",
                    "likes": "0",
                    "time": "28/02/2023-17:59:56",
                    "content": "MIP 41 edit, @MIP-Editors   MIP41: Facilitator Framework  Preamble MIP#: 41 Title: Facilitator Framework Author(s): @juanjuan Contributors: @elprogreso, @iammeeoh, @blimpa, @gala, @twblack88, @LongForWisdom Tags: process, core-unit-framework, personnel-xboarding, mip-set, core-unit-framework-mipset Type: Process Status: Accepted Date Proposed: 2021-01-18 Date Ratified: 2021-25-03 Dependencies: MIP38, MIP39, MIP40, MIP4c2-SP10, MIP4c2-SP12 Replaces: n/a Ratification Poll URL: https://vote.makerdao.com/executive/template-executive-vote-approve-march-2021-governance-cycle-bundle-march-22-2021?network=mainnet#proposal-detail Forum URL: https://forum.makerdao.com/t/mip41-facilitator-framework/6098 Extra: This MIP has been amended. See [MIP4c2-SP15](https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291). The original version can be found [here](https://github.com/makerdao/mips/blob/7fdb552680486bbd84dfd84b64980e0999249043/MIP41/mip41.md)   References MIP41c4-Subproposal-Template.md MIP41c5-Subproposal-Template.md  Sentence Summary MIP41: Facilitator Framework describes the processes for onboarding and offboarding Core Units’ Facilitators.  Paragraph Summary MIP41: Facilitator Framework describes the processes for onboarding and offboarding Core Unit Facilitators. Facilitators are the accountable individuals responsible for interfacing between Maker Governance, the Contributors, and external resources to achieve the Core Objectives of the Protocol. Facilitators are always attached to one or more Core Units and cannot exist in a void, i.e., Facilitators are Facilitators only if they are attached to at least one Core Unit.  Component Summary MIP41c1: The Facilitator Framework Gives an overview of the important characteristics of the Facilitator Framework MIP. MIP41c2: Facilitator Governance Powers Specifies the Facilitators’ unique powers when interacting with the Maker Governance processes. MIP41c3: Governance Facilitator Governance Powers Specifies the special case of Governance Facilitators and their central role in the Maker Governance processes. MIP41c4: Facilitator Onboarding A process component that defines the process for onboarding a Facilitator to a Core Unit. MIP41c5: Facilitator Offboarding (Subproposal Process) A process component that defines the process for removing a Facilitator. MIP41c6: Interim Facilitators Specifies what Interim Facilitators are, the situations where they are necessary, and their responsibilities. MIP41c7: Interim Facilitator Appointment Process Specifies the process used to appoint an Interim Facilitator to a Core Unit.  Motivation A Facilitator is the most trusted actor in the MakerDAO community; they are given a high degree of autonomy and have resources and governance powers at their disposal. This Framework provides Governance with a simple way of managing and holding Facilitators accountable through the MIPs process.  Specification / Proposal Details  MIP41c1: The Facilitator Framework Facilitators play a key role in the Maker ecosystem by acting as the link between Maker Governance and the Contributors. Facilitators are always attached to a Core Unit that represents their primary responsibility and their Budget and Governance Powers. The Budget they manage and their Governance Powers are dependent on the existence of that Core Unit. The Core Unit Budget allows the facilitators to meet their responsibilities by hiring Contributors and purchasing services and products. Facilitators attached to a Core Unit administer the Budget for that Core Unit. How this is implemented in practice depends on the specific Budget Implementation. The Facilitator Commitment is an essential part of a Facilitator proposal. There, the Facilitator specifies their perspective on how to successfully achieve the Mandate of the Core Unit they will be attached to, how they plan to organize, and how they will develop accountability. The Facilitator Governance Powers enable the Facilitators to efficiently interact with Maker Governance processes related to their Core Unit.   MIP41c2: Facilitator Governance Powers Facilitators have special privileges in the Maker Governance Framework:  Facilitators have the power to propose expedited, urgent or emergency Executive Votes (defined in MIP24) related to their Core Unit. Facilitators have the power to propose weekly non-standard Governance Polls (defined in MIP16) related to their Core Units. Facilitators have the power to propose weekly Executive Votes (defined in MIP16) related to their Core Units. Facilitator governance powers for particular Core Units can be extended through MIPs. They may include technical access to smart contracts like multisigs or other privileges in the governance process.    MIP41c3: Governance Facilitator Governance Powers Governance Facilitators have extraordinary powers to respond to their responsibilities listed on MIP0c10:Governance Facilitator Role. In relation to governance processes, Governance Facilitators have exceptional powers and responsibilities. These are defined in multiple MIPs like:  The MIPs Framework (MIP0). The weekly governance cycle (MIP16). The urgent and emergency voting processes (MIP24). And others.  Governance Facilitators interpret the meaning of MIPs and their practical consequences. Governance Facilitators decide whether a Facilitator’s use of the powers defined in MIP41c2 are related to the Facilitators Core Unit, and therefore valid.   MIP41c4: Facilitator Onboarding This process component allows Governance to onboard a new facilitator with a Facilitator Commitment. The proposal parameters are:  Minimum feedback period: 1 month Minimum frozen period: 1 week  Once a Subproposal passes, the MIP Editor or Governance Facilitators modify the Core Unit’s entry specified with the new Facilitator’s name and information, and the new Facilitator Commitment. MIP41c4 subproposals must use the template located at MIP41c4-Subproposal-Template.md   MIP41c5: Facilitator Offboarding This component is twofold:  It describes how Facilitators are to be handled in the event of a Core Unit offboarding via MIP39c3. It establishes the process to offboard Facilitators. Full Core Unit offboardings are to be put forth via MIP39c3.   1. Facilitators and Core Unit Offboardings via MIP39c3 If a Core Unit offboarding subproposal passes, the Facilitator(s) of the affected Core Unit immediately loses all special powers listed on MIP41c2/MIP41c3. The Facilitator becomes a Retiring Facilitator in charge of executing the unwinding process for the offboarding Core Unit (described on MIP39c3). If the Retiring Facilitator fails to execute the unwinding plan, an Interim Facilitator - further defined in MIP41c6 - will take over these responsibilities.  2. Facilitator Offboarding Process A Facilitator can be offboarded without having the Core Unit they are attached to being offboarded. If there are no permanent facilitators remaining in the Core Unit then an Interim Facilitator will be appointed to take over responsibilities during the transition period as detailed in MIP41c7. MIP41c5 subproposal parameters are:  Minimum Feedback Period: 2 weeks. Minimum Frozen Period: 1 week. Poll Duration: 1 week.  MIP41c5 subproposals must use the template located at MIP41c5-Subproposal-Template.md   MIP41c6: Interim Facilitators Whenever a Core Unit finds itself with no Facilitator, an Interim Facilitator is needed to ensure the continuity or graceful wind-down of the Core Unit. An Interim Facilitator is empowered to serve in this role for a maximum of two months. If a new permanent Facilitator is onboarded to the relevant Core Unit through a MIP41c4 subproposal the Interim Facilitator is immediately offboarded and all powers and responsibilities are transferred to the new permanent Facilitator. In the event of a Core Unit offboarding, the Interim Facilitator is responsible for overseeing and executing the unwinding process as defined in MIP39c3. In the event of a Facilitator offboarding, the Interim Facilitator is responsible for both:  Ensuring the functional continuity of the Core Unit during the interim period. Making a good faith effort to deliver one or more viable Facilitator Onboarding subproposals for the Core Unit to Maker Governance. The Interim Facilitator may propose themselves as a permanent Facilitator.  The Interim Facilitator is empowered to use the Facilitator Governance Powers defined in MIP41c2 to keep existing operational processes running smoothly during the interim period. If the Core Unit is not being offboarded, the Interim Facilitator will receive monthly DAI compensation equal to that of the previous permanent Facilitator. If this information is not publicly available, the monthly compensation will be 15,000 DAI. When a Core Unit is offboarded and an Interim Facilitator is judged to be necessary to wind down the Core Unit gracefully, then compensation for an Interim Facilitator must be included as part of the offboarding subproposal.   MIP41c7: Interim Facilitator Appointment Process The Interim Facilitator Appointment Process assumes the existence of one or more permanent Governance Facilitators. If this is not the case, MIP41c7 must be considered non-binding. The Governance Facilitators are responsible for the implementation of this process. A majority of Governance Facilitators may modify this process to suit the circumstances by communicating details and reasoning publicly before the process begins. A voluntarily offboarding permanent Facilitator may publicly nominate a single Interim Facilitator. Subject to the nominated individual’s acceptance, they are immediately ratified as the Interim Facilitator. A single Interim Facilitator may be elected by a majority of Core Units voting in favor of a given individual within 72 hours of the initial Facilitator Offboarding. The individual must be willing to take the role to be eligible for election. Each Core Unit may cast a single vote for or against each candidate. In the event of a Core Unit containing multiple facilitators, they must come to a consensus and cast a single vote for their Core Unit per candidate. In the event an alternative Interim Facilitator is elected, they immediately replace the current Interim Facilitator, if one exists. Core Unit Facilitators should refrain from casting votes before the Governance Facilitators publicly communicate the details of the process in this instance. In the absence of a successful Interim Facilitator appointment within 72 hours, one or more permanent Facilitator onboarding proposals for the Core Unit may be submitted into the weekly governance cycle. This overrides the normal rules relating to the feedback and frozen periods.  Edge Cases If a voluntarily offboarding Facilitator has not nominated an Interim Facilitator, the other Core Unit Facilitators must elect an Interim Facilitator within 72 hours. If a permanent Facilitator is missing and uncontactable without notice and for unknown reasons, a majority of Governance Facilitators must use their best judgment as to how and when to proceed with the election process. If a Core Unit has no active Facilitators as a result of involuntary offboarding and has no active budget, no Interim Facilitator will be appointed unless there are winding down activities that require one. If a permanent Facilitator has not been chosen before the expiry of an Interim Facilitator’s two-month term, a majority of Governance Facilitators may extend the term by stating publicly that they are doing so, and the reasoning for this decision. If the Governance Facilitators do not do this, the Core Unit is offboarded, and any budgets are revoked. If after one month the full Interim Facilitator Appointment Process (including the expedited weekly cycle permanent Facilitator subproposals) fails to install either an Interim or permanent Facilitator, the Core Unit should be considered offboarded, and any budgets revoked. Appropriate MIP subproposals should be filled out by the Governance Facilitators and marked as Approved without going to vote. If any other edge cases occur, a majority of Governance Facilitators may resolve them to the best of their ability.  MIP41c8: Endgame transition In case of conflict, this component supersedes other components in the MIP. To enable the smooth transition to Endgame, Core Unit related MIPs continue to function temporarily during the Pregame after the Maker Constitution has passed. They are used only to provide budget continuity for existing, approved budgets, and to provide a temporary solution for designating Responsible Facilitators in the Scopes. New Core Units can no longer be proposed or be approved, new budgets cannot be proposed or approved, and recurring budgets do not automatically renew. The only exception to the rule against recurring budget is the Strategic Finance Budget which can recur a single time. All Core Unit roles defined in the Core Unit related MIPs no longer apply, and are superseded by the rules and responsibilities defined in the Maker Constituion or Scope Frameworks. If no direction is given to a Core Unit in the Maker Constitution or the Scope Frameworks, they can fall back on their existing Core Unit mandate, but must also make efforts to support and enable the transition to Endgame, and provide input for how their work can be incorporated in the Scopes. Over time, all budgets provided from the Core Unit related MIPs will run out, and the Core Units will be transitioned to new budgets and have their work regulated through the Maker Constitution and Scopes. Once the transition is complete and all budgets have run out or been offboarded, and no more payments occur to any Core Unit defined in the Core Unit MIPs, all of the Core Unit MIPs become obsolete and stop having any effect. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c5-Subproposal-Template.md",
                        "https://mips.makerdao.com/mips/details/MIP0#core-responsibilities",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c4-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/master/MIP41/MIP41c5-Subproposal-Template.md"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.645912900702621
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#11",
                    "likes": "1",
                    "time": "28/02/2023-18:12:24",
                    "content": "MIP51 edits, @MIP-Editors   MIP51: Monthly Governance Cycle  Preamble MIP#: 51 Title: Monthly Governance Cycle Author(s): @LongForWisdom  Contributors: Charles St.Louis (@CPSTL), Payton Rose (@prose11), Pablo (@Blimpa), @Elihu Tags: governance-cycle Type: General Status: Accepted Date Proposed: 2021-04-07 Date Ratified: 2021-05-25 Dependencies: MIP0, MIP16 Replaces: MIP3 Ratification Poll URL: https://vote.makerdao.com/executive/template-executive-vote-approve-may-2021-governance-cycle-may-24-2021?network=mainnet#proposal-detail Forum URL: https://forum.makerdao.com/t/mip51-monthly-governance-cycle/7366   References N/A  Sentence Summary MIP51 defines a Monthly Governance Cycle that provides a predictable framework for Maker Governance decisions.  Paragraph Summary MIP51 defines a Monthly Governance Cycle that provides a predictable framework for Maker Governance decisions. It replaces the existing Monthly Governance Cycle (MIP3). This new Governance Cycle aims to provide a more efficient and accessible framework for Maker Governance decisions.  Component Summary MIP51c1: Governance Cycle Breakdown Breaks the Governance Cycle down into the actions that take place each week of the monthly cycle. MIP51c2: Ratification Poll Defines the parameters for a Ratification Poll under the MIPs process. MIP51c3: Minimum Positive Participation Changes Defines the process for modifying the Minimum Positive Participation required for Ratification Polls to pass. MIP51c4: Calendar Exceptions Defines exceptions to the Monthly Governance Cycle due to holidays.  Motivation The new Monthly Governance Cycle has several goals versus the previous Monthly Governance Cycle defined in MIP3. First, it aims to reduce the cost of participation for governance by reducing the number of votes that take place for each monthly cycle. Many participants expressed frustration over the number of votes required in each cycle, and many simply remained confused as to why multiple votes were required each month. Second, it aims to increase protocol security by ensuring that only one Executive Vote is required per week under normal circumstances. It has been observed that the amount of MKR on the hat suffers during weeks where we have multiple Executive Votes, and this has caused some concern among the Smart Contracts Team. Third, it aims to remove the possibility of a monthly governance executive failing due to a lack of participation combined with a 4-day Executive Proposal expiry. This could be a significant setback for the DAO. Additionally, the difficulty in determining if the Executive failed due to lack of participation or opposition would complicate the steps taken after that eventuality. The proposed Monthly Governance Cycle should resolve these issues and allow the Monthly Governance Cycle to proceed more efficiently, with less of a security risk, and with additional participation. Additionally, the new Monthly Governance Cycle is less complex and hopefully more clear than the previous version.  Specification / Proposal Details  MIP51c1: Governance Cycle Breakdown The first Monday of each calendar month marks the beginning of the Monthly Governance Cycle. Proposals submitted into the Monthly Governance Cycle must follow the guidelines defined in MIP0. Time is inclusive and based on UTC (Coordinated Universal Time) and the Gregorian Calendar. Week 1, Monday  MIP Authors move their proposals to Formal Submission (Phase 5 described in MIP0c3). This phase lasts for 3 days. Proposals must be moved into the formal submission subcategory on the MakerDAO forums under the Maker Improvement Proposal category (as defined in Phase 5 in MIP0c3). Governance Process Support Ecosystem Actors must be informed by MIP Authors of the status change via commonly used communications channels.  Week 1, Thursday  The Arbitration Facilitators must come to consensus on whether each submission warrants moving forward to a Ratification Poll.  Arbitration Facilitators may consider blocking a proposal if they believe that moving forward to a Ratification Poll would negatively affect community cohesion. If the Arbitration Facilitators prevent a proposal from moving to a Ratification Poll, they must clearly communicate their reasons for doing so via the official forum. In the event the Arbitration Facilitators abuse this power they should be removed from their positions via any method Maker Governance determines is appropriate.    Week 2, Monday  The Arbitration Facilitators publish the set of Ratification Polls. The format of these is defined in MIP51c2. Ratification Polls are published to the community GitHub, submitted on-chain and appear on the official Voting Portal.  Week 4, Monday  The Ratification Polls conclude, and each proposal or set of proposals is marked as either Accepted or Rejected by the Governance Process Support Ecosystem Actors.    MIP51c2: Ratification Poll Ratification Polls under the Monthly Governance Cycle must meet these requirements:   Duration: 2 Weeks.  Minimum Positive Participation: 10,000 MKR.  Type: Binary Poll (yes/no/abstain).  Ratification Polls under the Monthly Governance Cycle must contain:  Links to a specific version of a single proposal or set of related proposals (MIP Set) within the official MIPs GitHub. The Sentence and Paragraph Summaries of each included proposal.  In order for a Ratification Poll to conclude successfully and the contained proposal(s) move to Accepted status, each of the following conditions must be true:   Yes vote-weight must exceed No vote-weight when the poll closes.  Yes vote-weight must exceed the Minimum Positive Participation value of 10,000 MKR when the poll closes.    MIP51c3: Minimum Positive Participation Changes The Minimum Positive Participation value defined in MIP51c2 may be modified via a successful Polling Vote under the Weekly Governance Cycle (MIP16). If such a vote is successful, the Governance Process Support Ecosystem Actors will update MIP51c2 and the change will come into effect in the following Monthly Governance Cycle. The Minimum Positive Participation value may not be changed for Ratification Polls that are in progress under any circumstances.   MIP51c4: Calendar Exceptions Due to the multitude of cultural and religious holidays occurring in and around the month of December, there will be no Monthly Governance Cycle in the December of each year.  ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP0/mip0.md",
                        "https://github.com/makerdao/mips/blob/master/MIP0/mip0.md#mip0c3-the-mip-lifecycle",
                        "https://forum.makerdao.com/c/mips/fs/16",
                        "https://forum.makerdao.com/c/mips/14",
                        "https://github.com/makerdao/mips/blob/master/MIP0/mip0.md#mip0c3-the-mip-lifecycle",
                        "https://forum.makerdao.com",
                        "https://github.com/makerdao/community/tree/master/governance/polls",
                        "https://vote.makerdao.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.474268353174603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#12",
                    "likes": "0",
                    "time": "28/02/2023-18:18:55",
                    "content": "    rune:  MIP51 MIP55 MIP101   We’d love to see MIP 96, MIP97 and MIP98 included so that Maker Governance can move towards project based budgeting.     rune:  New MIPs cannot be submitted.   replace with New MIPs except Endgame MIPs cannot be submitted (?)     rune:  Goerli testnet.   Goerli seems to be going to be phased out shortly, would replace with current relevant testnet     rune:  Facilitator  Derek Flossman - MIP41c4-SP7     add: MIP41c4-SP42 ",
                    "links": [
                        "https://forum.makerdao.com/t/mip41c4-sp42-protocol-engineering-facilitator-onboarding-pecu-001/19750"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9772727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#13",
                    "likes": "0",
                    "time": "28/02/2023-18:19:02",
                    "content": "MIP55 edits, @MIP-Editors   MIP55: Special Purpose Fund (SPF )  Preamble MIP#: 55 Title: Special Purpose Fund Author(s): @amyjung Contributors: @LongForWisdom @SebVentures Tags: process Type: General Status: Accepted Date Proposed: 2021-06-08 Date Ratified: 2021-07-26 Dependencies: n/a Replaces: n/a   Ratification Poll URL: https://vote.makerdao.com/polling/QmStS4VH?network=mainnet   Forum URL: https://forum.makerdao.com/t/mip55-special-purpose-fund-spf/8624 Extra: This MIP has been amended. See [MIP4c2-SP16](https://mips.makerdao.com/mips/details/MIP4c2SP16). The original version can be found [here](https://github.com/makerdao/mips/blob/4b04a40e758d3c675bfcad877b5da5a9ed08ba97/MIP55/MIP55.md).   Sentence Summary A Special Purpose Fund (SPF) is used to fulfill a narrow, specific, or temporary objective where approved funds are locked in escrow, releasable by a minimum of 2/3 signers, where at least 2 signers (called Comptrollers) are Mandated Actors or community members appointed by Mandated Actors.  Paragraph Summary A Special Purpose Fund (SPF) is used to fulfill a narrow, specific, or temporary objective where approved funds are locked in escrow, releasable by a minimum of 2/3 signers, where at least 2 signers (called Comptrollers) are Mandated Actors or community members appointed by Mandated Actors.  Funding is only available in Dai. A SPF must contain one Point of Contact (from the SPF receiver) and a minimum of two Comptrollers. Comptrollers execute payouts to final recipients based on the completion of milestones stated in the SPF Scope. Any SPF request less than or equal to 50k Dai can go into the Weekly Governance Cycle. Anything above 50K Dai must go through the Monthly Governance Cycle.  The request (a MIP55c3 subproposal) must fulfill its Feedback Period and its Frozen Period before its submission into either cycle.     Component Summary MIP55c1: Special Purpose Fund Requirements Outlines the requirements a Special Purpose Fund must meet to be valid for inclusion in the Governance Cycle. MIP55c2: Special Purpose Fund Process Details the governance process for proposals created by Special Purpose Funds. MIP55c3: Adding/Modifying a Special Purpose Fund This subproposal process allows Governance to create or modify an existing Special Purpose Fund through the provided subproposal template.  Motivation The creation of the Core Unit Framework launched the initial building blocks for organizing work for the DAO. Facilitators define mandates that cover long-term work areas and a broad set of focus and responsibilities for the protocol to be secure and successful.(1) Since then, community members have uncovered a need for a framework that is particular to purposes:  Of high priority, yet narrow in scope. Receivers of Funds are accountable to their deliverables, but do not hold long term responsibilities like a Core Unit. The request is one-off or irregular.  This MIP can be used for situations like:  Protocol Audit Funding. Legal Reserves for the DAO. Gas Reserves for Oracles / Protocol Deployments. Funding a team that works independently of Governance. Funding DAO objectives with no existing Core Unit or Facilitator.  Special Purpose Funds should be used infrequently. This MIP should NOT be used for:  Grants. Teams with long term objectives that should be Core Units. Vesting or DAO Mandated Actor / Contributor compensation.  The structure for Special Purpose Funds are specific to ensure minimum Governance overhead. Approved funds are locked in a multisig escrow, releasable by a minimum of 2/3 signers (a Point of Contact and at least 2 Comptrollers). The signers reduce future Governance overhead to a minimum and this provides flexibility for executing funds that need to be released at the time of completion, rather than waiting for a secondary Governance cycle to execute.  Specification / Proposal Details  MIP55c1: Special Purpose Fund Requirements In order to be recognized as a Special Purpose Fund, proposals must have the following:  There must be a clear and public explanation of the purpose and scope of the Special Purpose Fund. Must follow the multisig process outlined in MIP47: MakerDAO Multisignature Wallet Management. It must include a wallet address, official Point of Contact, and Comptroller signers must be publicly verified. The Scope must be limited by either timeframe or specific deliverable (For example: The Protocol needs audits for the launch of LIQ.2.0. Funds are approved to pay auditors, Dai goes into escrow, and 2 Comptrollers release funds to the auditors once audits are complete). The SPF Scope work must be auditable by Comptrollers.   MIP55c2: Special Purpose Fund Process A process component that provides clarity on how the payouts are addressed from a practical perspective once approved. Approved funding is attached to a Special Purpose Fund (SPF) and is meant to be used only for that proposal. The process is as follows:  MIP55c3 subproposals is submitted. MIP55c3 subproposals must use the template located at MIP55c3-Subproposal-Template.md. This template is considered ratified once this MIP moves to Accepted status. MIP55c3 subproposals must go through the Governance cycle to authorize Maker Governance to draw funds from the Protocol. Upon approval of the MIP55c3 subproposal, funds would be transferred first to the escrow multisig. The funds in escrow must be in a multi-sig with signatory requirements of a minimum of two Comptrollers. Funds must be held in escrow, only released when two Comptrollers sign off. Once the work is complete and approved by Comptrollers, funds would be released to the final recipient’s designated address.  Roles: Point of Contact and Comptrollers The SPF Comptrollers must ensure that transparency and accountability exist as the budget is spent. Comptrollers should communicate transparent accounting such as this Reporting Template. Comptrollers cannot be receivers of SPF funding. They execute payouts to final recipients based on the completion of milestones stated in the SPF Scope. Comptrollers should be Mandated Actors, but they may be community members appointed by Mandated Actors. A SPF Point of Contact is the person representing the SPF receiver. The Point of Contact can be the final receiver or a representative appointed by the fund receiver. If a SPF Point of Contact disappears, quits, or is no longer valid, the Special Purpose Fund has 14 days to replace or find a replacement. Otherwise, the Special Purpose Fund proposal and its funding will no longer be valid. Funding Considerations There are several important considerations to take into account before transferring value out of the Maker Protocol.  Transfer of DAI from the SPF multisig to an external address that is not controlled by Maker Governance is a one-way operation. Transfer of DAI from the protocol will take DAI from the Surplus Buffer if available. If funding a MIP55c3 subproposal would result in a FLOP auction, Governance Facilitator(s) will use established communication channels to ensure the community is informed.  Funding Implementation The initial funding implementation would use a simple funding implementation of a fixed total of funds taken from the Protocol and put directly to a multi-sig used for escrow.  If available, other advanced smart-contract based implementations can be used for automated distribution mechanisms, such as a simplified smart contract implementation of DSSVest.   MIP55c3: Adding/Modifying a Special Purpose Fund MIP55c3 subproposals must use the template located at MIP55c3-Subproposal-Template.md . This is a component that can have on-chain effects that alter the Maker Protocol’s state. When subproposals are generated from this component, the vote must include a Technical State Change to authorize drawing funds from the Maker Protocol. The proposal parameters Requests of less than or equal to 50k Dai may go into the Weekly Governance Cycle, provided the Feedback and Frozen Periods have been fullfilled. Anything above 50k Dai must go through the Monthly Governance Cycle. Parameters for requests of less or equal to 50K Dai:  Minimum Feedback Period: 2 Weeks. Minimum Frozen Period: 1 Week.  Parameters for requests of above 50K Dai:  Minimum Feedback Period: 4 Weeks. Minimum Frozen Period: 1 Week.   MIP55c4: Endgame Transition This component supersedes the other components in this MIP. No more SPFs can be created, but existing SPFs continue until they run out. Once no more SPFs are active from this MIP, it must be moved to obsolete status. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP55/MIP55c3-Subproposal-Template.md",
                        "https://docs.google.com/spreadsheets/d/1Bxb0f4K4db8bZzZSQ4NiOHLNv0cFVNeYTm77HoIlpMk/edit?usp=sharing",
                        "https://forum.makerdao.com/t/mip-54-dssvest/8025",
                        "https://github.com/makerdao/mips/blob/master/MIP55/MIP55c3-Subproposal-Template.md"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.438399327122153
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#14",
                    "likes": "2",
                    "time": "28/02/2023-23:06:51",
                    "content": "@rune, @Recognized-Delegates , the PR with the amendments has been created. It can be found here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#15",
                    "likes": "0",
                    "time": "01/03/2023-11:57:14",
                    "content": "    rune:  New MIPs cannot be submitted. All MIPs except the Endgame MIPs and their Subproposals lose their accepted status, and must be assigned as obsolete. They are automatically considered obsolete by Maker Governance, regardless of which status they have been assigned. All MIPs except the Endgame MIPs and their Subproposals have no effect, and do not impact Maker Governance, Core Units, or the Maker Protocol in any way, and cannot trigger Governance Polls or Executive Votes. This does not affect consequences of those MIPs that has already occured, such as smart contracts, legal entities, payments that have already been made, etc.   We ask that you not include this language, due to unintended consequences. For instance, this MIP58 subproposal, to remove Genesis as the broker for the RWA Foundation and housekeeping authorizations to make it compliant with basic legal and accounting requirements, would not be allowed. We’re not aware of any reference to RWA Foundation in MIP105, so this timely issue would be ignored. MakerDAO has evolved into its current governance state, so there is likely to be a lot of unnecessary “governance technical debt” created by a blanket ban. We recommend much more flexible language, like prohibiting specific activities so this restrictive text and mass MIP repeal doesn’t deauthorize governance from iterating upon or managing parameters of important modules like like the PSM (MIP29), the Flash Mint Module (MIP24), and D3Ms (MIP50). There could also be problems created for other, less dangerous areas, like DssVest (MIP64) or paying the growing network of keepers (MIP63). The combination of strict prohibitions and omissions of many details from the scope frameworks will not encourage the workforce to assume something is within their mandate or their responsibility. We recommend relaxing the prohibitions or lowering the number of MIP repeals, because we think this has potential for disorder and confusion around what specific activities are and are not authorized. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.144995877138734
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#16",
                    "likes": "0",
                    "time": "01/03/2023-13:55:03",
                    "content": "    rune:  New MIPs cannot be submitted.   I’d suggest that MIP98 and MIP97 are incorporated into the scopes in some way. While I understand that nothing should be done or even proposed outside the scopes, a framework to propose work is still needed, as scopes will want to have ecosystem actors and external teams to bid on tasks and Maker will want to get the biggest bang for it’s buck, so to say. MIP97 and MIP98 provide a good framework for that. They could be modified in a way so only scopes can trigger new MIPs there. This would achieve the aim to make it impossible for anything to happen outside the scopes, but at the same time maintain the framework for interacting with third parties and allow Maker to become a marketplace for the best talent to bid on work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.59366391184573
                },
                {
                    "author_link": "https://forum.makerdao.com/u/corn",
                    "index": "#17",
                    "likes": "0",
                    "time": "01/03/2023-14:42:26",
                    "content": "Hey @rune I see MIP92 w/ Yearn was not included here. Is this going to remain a “live” deal? CES is working on the tech assessment already. Also, I see the Risk CU is looking at MIP92 next. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#18",
                    "likes": "2",
                    "time": "01/03/2023-16:08:46",
                    "content": "Yes, the DLO framework will be integrated into every scope and be how all project budgets work. We just need the elements defining how to pick and negotiate projects to be much better defined, or it will be no different than the current subjective political process. But that is exactly the direction everything related to budgets needs to go. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#19",
                    "likes": "1",
                    "time": "01/03/2023-16:12:24",
                    "content": "All tech etc related to it will be retained, but it will not be possible to onboard unless it meets the requirements in the decentralized collateral scope (minimum yield equal to 3 month treasury rate, minimum 1 million surplus after all expenses in total). These benchmarks is also likely to be changed as we get a little more sophisticated about it, and it could result in them being lower (BA Labs already suggested some improvements to it that lower the surplus requirement in some scenarios). But right now the scopes are written to stop most work on small scale projects and focus the workforce towards a few large projects with high ROI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.543749999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#20",
                    "likes": "0",
                    "time": "01/03/2023-17:30:09",
                    "content": "    rune:  We just need the elements defining how to pick and negotiate projects to be much better defined, or it will be no different than the current subjective political process.   i’ll think about that and come back with a tentative structure after ETHDenver ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#21",
                    "likes": "1",
                    "time": "08/03/2023-15:54:28",
                    "content": "Formally submitting as part of the Constitution MIP Set. Adding some extra words to get past the spam filter: as the rainbow unicorn sang a haunting melody of love and adventure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                }
            ]
        }
    ],
    "group_index": "2149"
}