{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/should-we-burn-the-admin-keys-an-argument-for-minting-mkr/7175",
            "title": "\\xf0\\x9f\\x94\\x91 Should we burn the admin keys? An argument for minting MKR ",
            "index": 7175,
            "category": [
                "Governance"
            ],
            "tags": [
                "compensation",
                "vesting",
                "minting"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#1",
                    "likes": "11",
                    "time": "24/03/2021-13:49:53",
                    "content": "Is Maker complete? Are we done improving the Protocol? Should we burn the admin keys and let Maker run its course? Hypergrowth Some of us believe that we are just getting started, that Maker is ripe for hypergrowth, precisely what we want to achieve. The MKR we’re asking for is no different than a startup raising Series A. Yes, it will dilute the token holders, but the goal of that dilution is the sought hypergrowth. The Slippery Slope Argument “Minting MKR is a slippery slope.” Governance will (arguably) always have the power to mint more tokens. A Decentralized Maximalist might argue that having the admin key to change the code is the beginning of the slippery slope. The slippery slope argument sounds more like a motion of no-confidence towards Governance. And it’s by no means invalid. But if we do not trust Governance, we should frame it that way. The Social Contract MKR is burnt when things are going well and minted when needed. These needs might vary:  recover bad debt (we’ve seen this in the past) raise funds to grow (we’ve also seen this in the past; that’s why we have investors)  It seems that we have forgotten the second need. The Market Value of Valuable Contributors Every single worker has a market value. Right now, the industry dictates that a given person will earn a given amount that might seem fair or not. For example, there is no shortage of projects that will take any Maker developer without blinking before lunchtime. Should every contributor get MKR tokens? Maybe not. We will need to decide as a Community how much we want to align to the industry and how much we choose to override. Base Salary versus Bonus Most have agreed that the “base salary” should come from the surplus buffer to provide job security for the Maker contributors; some argue that any “bonus” should not. Usually, a worker will look at their total compensation package and decide if that is competitive or not. You can name each piece of the compensation however you want, but removing certainty to any of those parts will make the deal less attractive. An extreme implementation of that argument could hold that we should only pay minimum wage to our employees. Anything above that is a bonus that the contributor should only get if the Protocol is faring well. Making the total compensation package less certain will make our offers less competitive and hinder our capacity to attract talent. We should be worried about attracting the wrong talent: that is the actual slippery slope. If they are only here for the money, then… I have also heard that money should not be the primary factor for hiring someone. I think we all agree on that one. However, this should not mean that we need to underpay our contributors — much less not pay them at all. I don’t want any core contributor to consider an external offer because we are not competitive. How about if instead of minting we… We need MKR that is readily available to compensate people. Minting seems to be the easiest, direct answer to solve this need. Any other creative solution seems to carry risks of slippage, front-running, or both. What’s more, there might be risks attached to using elements such as the Surplus Buffer for things that are not intended. Things To Agree Should we burn the admin keys? First, we will need to agree on what type of project we are. Is this it? Have we achieved maturity? Do we let the burn bring value to the token holders? Should we consider burning the keys and ensure that Governance cannot change this (the code is the law) ? Do we want (hyper)growth? We need to decide if we want hypergrowth. To raise the required capital (MKR), we will need to mint. As an option, we might want to choose to be a bootstrapped project and only use the money we get from revenues. If that is the case, we need to be clear upfront about it and let contributors decide if they want to stay in a project with this constraint. Do we want an overarching framework? We probably don’t want to have this same discussion every time a Core Unit comes up with some compensation scheme. Ideally, we can agree on something that we can reuse (and review from time to time). Framing a Framework General Framework   Do we align with the industry and compensate with tokens (MKR)?   What is the best way of obtaining these tokens? (reduce slippage, avoid front-running, etc.)   Do we want to include a vesting period, a cliff, and weighting (you get more on your fourth year than in your first)?   How often should we review this framework?   etc.   Specific Framework   Which teams/contributors get MKR tokens?   How much MKR should they get?   etc.   Edge Cases   What happens when a contributor changes Core Units?   etc.   Next Steps Discussion We will have a Community Call on Wednesday, 31st, to discuss these topics. Working Group We will probably need to form a working group to tackle this issue and present a decent framework to the Community and teams. Please write to me if you’re interested.  Bonus: a diagram How much are we minting?  Minting Perspective1478×764 92.6 KB  If:  100 contributors (will we have that many?) at the suggested 0.1% rate (most will get less) stay for four years (turnover suggests it will be less)  Then we would be minting 10% of the total supply.  Edit: added link to the call. ",
                    "links": [
                        "https://forum.makerdao.com/t/framing-a-framework-for-mkr-compensation-wednesday-march-31-17-00-utc/7200",
                        "https://forum.makerdao.com/t/maker-relay-ep-38/7249",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/23",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-134-thursday-march-25-17-00-utc/7095/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-134-thursday-march-25-17-00-utc/7095/2",
                        "https://forum.makerdao.com/t/governance-at-a-glance-march-19-25/7199",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-22-24-2021/7192",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-25-30-2021/7275",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-march-28th-2021/7280"
                    ],
                    "GPT-summary": "The author proposes minting MKR to achieve hypergrowth and compensate contributors. They address concerns about the slippery slope argument and the need for a social contract. The post discusses the market value of contributors, compensation packages, and the need for a framework to compensate contributors. The author invites discussion and collaboration on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.519389658848615
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "5",
                    "time": "24/03/2021-14:19:03",
                    "content": "Great work on this. Some thoughts. I personally think MKR inflation should not exceed projected MKR burn per year, resulting in net inflation/MKR price depreciation. MKR mint allocation should only go to core units that can adversely affect the risk profile of the system thus making it necessary to align incentives/interest. This includes distribution weighting to the ones we deem most important on a scale (or perhaps flat if agreed upon). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.046875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#3",
                    "likes": "1",
                    "time": "24/03/2021-14:23:26",
                    "content": "Thanks, Aaron. I did cover this point:     Aaron_Bartsch:  I personally think MKR inflation should not exceed projected MKR burn per year, resulting in net inflation/MKR price depreciation.   here:     juan:  We need to decide if we want hypergrowth. To raise the required capital (MKR), we will need to mint. As an option, we might want to choose to be a bootstrapped project and only use the money we get from revenues. If that is the case, we need to be clear upfront about it and let contributors decide if they want to stay in a project with this constraint.   I think it’s a valid point to sustain, but we need to make sure we’re all on the same page. Some people want to work on hypergrowth projects so we need to be upfront with them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "1",
                    "time": "24/03/2021-14:33:50",
                    "content": "Right. Growth vs hyper growth or the equivalent of borrowing against your future for more potential firepower. Cause as I see it now we’re growing pretty well already and have quite the surplus accruing. Perhaps if we actually had somewhere to aim the warchest at it would be easier to digest a dilution. As it stands it’s all theoretical and ethereal (haha).     juan:  I did cover this point:   For sure, just expressing my personal opinion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.867857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/galabasquer",
                    "index": "#5",
                    "likes": "10",
                    "time": "24/03/2021-14:37:39",
                    "content": "As a technical point I will say, if we burn the admin keys of the MKR token, we can’t upgrade the flop contract anymore. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#6",
                    "likes": "1",
                    "time": "24/03/2021-14:47:47",
                    "content": "    Aaron_Bartsch:  Cause as I see it now we’re growing pretty well already and have quite the surplus accruing.   A couple of things:   We’re growing pretty well already because the Foundation is paying the tab.   I think that the price of getting the Smart Contracts, Risk, and Oracle Teams on board might push the supply past 1 million. We all believe that this will bring more growth, more value captured, and more burning MKR.   I believe that you are proposing the following: Step 1: let’s see how much money we will have (projected) Step 2: let’s form a team with that. Some questions for you:  What if that team will not be able to grow the Protocol, but only maintain it? What if they are not even able to maintain it?  ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.3184523809523805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "1",
                    "time": "24/03/2021-14:58:56",
                    "content": "Well that information would be useful in making a decision wouldn’t it. As a MKR investor on the outside, do I have all/enough information to make an informed decision in these regards? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#8",
                    "likes": "2",
                    "time": "24/03/2021-15:13:37",
                    "content": "@Aaron_Bartsch , before we go into studies (likely not very cheap) and projections (likely not very precise), I would like to know what your opinion on the two questions below:     juan:  Some questions for you:  What if that team will not be able to grow the Protocol, but only maintain it? What if they are not even able to maintain it?    ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.4945054945054945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#9",
                    "likes": "1",
                    "time": "24/03/2021-15:17:08",
                    "content": "Those are good hard questions. I really hope that is not the case but if it were then I think spurring further growth through minting would be necessary to realize the potential for the protocol that a lot of MKR holders envision. I’d be afraid what that potential scenario would do to the valuation of MKR… Perhaps that’s why the price is where it is today (insider information). If the Foundation is dissolving and making some financials public and they know it won’t look good vs expectations (speculation) then…yikes. These are details I think would be necessary to know to make a decision. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.321969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#10",
                    "likes": "1",
                    "time": "24/03/2021-15:54:50",
                    "content": "What is the Foundation’s position on this issue and when will they be unable to continue picking up the tab? Also, I understand we usually do not consider their MKR holdings but given that a lot of people suggest that those holdings will either be untouched forever or burned, surely, that’s a good place to start? Just making sure we consider all other possibilities that allow hypergrowth before minting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#11",
                    "likes": "1",
                    "time": "24/03/2021-15:59:06",
                    "content": "From inference it seems that your hypothetical scenario to mint 10% of supply (90-100k MKR) aligns closely with the amount the Foundation holds and the number of staff at the Foundation.  If this hypothetical scenario became true how would we handle MKR minting after the 4 year period? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#12",
                    "likes": "2",
                    "time": "24/03/2021-16:35:03",
                    "content": "    Aaron_Bartsch:  closely with the amount the Foundation holds and the number of staff at the Foundation   I’m not sure how much the Foundation holds.     AstronautThis:  What is the Foundation’s position on this issue and when will they be unable to continue picking up the tab?   Adding yet another variable into an already complex topic might derail the discussion and we might lose focus. Then we end up with no framework and no strong indication from the Community on how to proceed with these things. Can we assume that the Foundation will dissolve (soon) and that it will leave us with zero extra funds? That way we can have a solid plan that works in the stated situation, and if there’s something extra, even better! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75462962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "3",
                    "time": "24/03/2021-16:47:08",
                    "content": "    juan:  I’m not sure how much the Foundation holds.    image1393×64 2.93 KB  At least this much. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#14",
                    "likes": "5",
                    "time": "24/03/2021-16:49:46",
                    "content": "    juan:  I’m not sure how much the Foundation holds.   C’mon really? At minimum https://etherscan.io/token/0x9f8f72aa9304c8b593d555f12ef6589cc3a579a2?a=0x8ee7d9235e01e6b42345120b5d270bdb763624c7 It’s kind of annoying that we know you know more but have to play dumb for legal reasons. Handing off legal responsibility to community members is intellectually dishonest. Why don’t you come up with a proposal. You speak in assumptions and hypotheticals while trying to nudge the “community” in a certain direction. To me it sounds like Foundation members looking to “decentralize” into the DAO have a plan in place to finally get some MKR compensation that the Foundation has been unable to adequately provide. I personally don’t have an objection to that if they deserve it but would love some transparency on the matter instead of this vagueness and hand holding. Please tell me if I’m way off base here. Am I thinking too hard about this? Lack of information leads to speculation in order to fill in the gaps. If this is untrue I apologize. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.897486772486773
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#15",
                    "likes": "4",
                    "time": "24/03/2021-17:00:39",
                    "content": "@Aaron_Bartsch @juan does not work for the Foundation. He is strictly a community member and voicing his own opinions, while balancing some objective manners from an Operational Support perspective. The Foundation will announce dissolution details in the upcoming months. I personally do not have the timeline for this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#16",
                    "likes": "4",
                    "time": "24/03/2021-17:01:31",
                    "content": "    Aaron_Bartsch:  have to play dumb for legal reasons.   I have no relationship with the Foundation (maybe that’s why I’m more outspoken?). All my dumbness belongs to me. Full-disclosure: I will pursue compensation in MKR when proposing my Core Unit, so I AM biased. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#17",
                    "likes": "3",
                    "time": "24/03/2021-17:05:45",
                    "content": "@amyjung @juan Thank you for the clarification. I will continue this discussion in good faith. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#18",
                    "likes": "2",
                    "time": "24/03/2021-21:13:46",
                    "content": "This was very well laid out @juan. I was against minting from mostly just a PR perspective, in that I didn’t want people vaguely familiar w/ Maker to look at us and dismiss MKR because we were diverting away from the deflationary value proposition. But at a certain point why should I let an uniformed opinion about MKR dictate the course of action? We should pursue what has the best chance to continue and extend Maker dominance in the crypto-credit space. To that end, it’s pretty illogical to throw up fundamental objections to minting. We’ve seen the MKR token over 4x in value in the last few months, perhaps we should be looking to companies like Tesla who capitalized on market perception by printing a budget. The buy and burn model can still be at the core of what we’re building here, but especially at the true start of the DAO era I’ve come around to the idea of minting. Decades from now I think MKR holders will be much better off because we decided to fund our growth fully up to needs rather than an arbitrary revenue projection.     juan:  We’re growing pretty well already because the Foundation is paying the tab.   This is a pretty huge point that I ignored in my gut reaction to MKR minting. Without minting our “warchest” is just what has been diverted to the SB, and from a risk perspective we really don’t want to be drawing down that number. We’ve appreciated all this growth because the Foundation had the ability to sell MKR into the market (not that different than minting when you think about it) and that has lead to us hitting nearly 3B DAI and and over 100M in annualized SFs. We should absolutely take caution when making the decision to inflate MKR, but as Juan so eloquently pointed out here, assuming we wouldn’t take caution is the same as saying we don’t have faith in Governance to do the right thing in the future. If that’s the case, as someone looking to take on a serious role w/ GovAlpha, I’d love to hear the concerns and what we can do to strengthen faith in Governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.941872427983538
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#19",
                    "likes": "9",
                    "time": "24/03/2021-21:41:18",
                    "content": "Don’t know, yesterday I was chatting with @NikKunkel . He said that 100m usd/year (which is what we currently get as a protocol without any MKR minting) is a lot to spend efficiently. I agree. I’d be surprised if we actually need that much to grow effectively.     juan:   raise funds to grow (we’ve also seen this in the past; that’s why we have investors)  It seems that we have forgotten the second need.   I don’t think any MKR was minted to fund growth. Simply, a large portion of the initial 1m MKR was assigned to growth, with a long term strategic decision. Starting with 1m, with say 300k planned to be sold for growth, is not the same as starting with 700k and then eventually minting 300k for growth when needed. The community largely supported the stopping of MKR-burning, to create a buffer of 30 millions. So the community is not trying to stop growth at all. But I suspect this ‘Hypergrowth’ is mostly a way to just print MKR for Core Unit contributors. I think MakerDAO should fund growth just with the profits it makes: >100m/year.     juan:  Should every contributor get MKR tokens? Maybe not. We will need to decide as a Community how much we want to align to the industry and how much we choose to override.   I think we had enough community discussion with hundreds of posts, following the SC Core Unit budget proposal. At the end, the MKR voters will decide (many MKR do not belong to the people discussing in this forum). So perhaps after 1 month of discussions in the forum, which doesn’t seem to go anywhere,it is perhaps time to ask the MKR holders what they think about MKR minting. @juan thanks for this nice post. I think somebody should try to run a onchain poll to see what is the sentiment of the people that are actually going to decide (MKR whales). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7018633540372665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#20",
                    "likes": "8",
                    "time": "24/03/2021-21:51:22",
                    "content": "I want to add, as a separate post, that it is a shame that the Foundation has not yet informed us what the plan to do with their 93k MKR tokens. I understand they have their legal problems. And I assume they are in good faith and will burn the tokens, or donate them to the DAO somehow. Still, I (and quite honestly also most people I have spoken to privately) think this way of operating over the course of the last years has been… well… discouraging and disheartening. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#21",
                    "likes": "5",
                    "time": "24/03/2021-22:04:12",
                    "content": "Until we know what will happen with this massive amount of money I think the discussion is premature. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#22",
                    "likes": "3",
                    "time": "24/03/2021-22:51:56",
                    "content": "Thanks for sharing your view, Meeoh.     iammeeoh:  Starting with 1m, with say 300k planned to be sold for growth, is not the same as starting with 700k and then eventually minting 300k for growth when needed.   63.2% of all statistics are made up.* That said, you could argue that the 100% was devoted to making Maker into what it is today (growth included). There’s a saying that says “half of my marketing works; the problem is that I do not know which half”. It’s quite hard to remove pieces that are not growth-related. Is spending fees on a lawyer to set up a legal entity part of growth? Maybe not, but if that entity will allow you to sign an agreement with a partner that will double your revenues… You see where I’m going.     iammeeoh:  The community largely supported the stopping of MKR-burning, to create a buffer of 30 millions. So the community is not trying to stop growth at all.   Growing the buffer is not particularly audacious. It’s just enlarging the Dai reserves (still within the Protocol’s reach) which can be reduced any time Governance desires.     iammeeoh:  But I suspect this ‘Hypergrowth’ is mostly a way to just print MKR for Core Unit contributors. I think MakerDAO should fund growth just with the profits it makes: >100m/year.   As discussed with @Aaron_Bartsch, a valid position to hold. Governance (and the Community) just needs to be upfront about it.     iammeeoh:  I think we had enough community discussion with hundreds of posts, following the SC Core Unit budget proposal. At the end, the MKR voters will decide (many MKR do not belong to the people discussing in this forum). So perhaps after 1 month of discussions in the forum, which doesn’t seem to go anywhere,it is perhaps time to ask the MKR holders what they think about MKR minting.   I hear your frustration. The objective of my thread is to disentangle this complex topic and try to reach an agreement. Am I wasting my time?      reuptaken:  Until we know what will happen with this massive amount of money I think the discussion is premature.   So if the Foundation dissolves without commenting (maybe they just want to hold for the next 10 years) you are proposing to actually not have this conversation at all? Are you also against a framework for this topic? Or you are suggesting we should also ignore the request by the Smart Contracts team (and potentially the other Core Units coming after that)? We might lose a couple of Core Contributors along the way and send a strong message out there. Is that what we want to do? I’m happy to assess the framework (and this discussion) once we have any new piece of information (including what is the Foundation doing with all its MKR). This discussion doesn’t seem premature to me – it seems long overdue.  (*) Including this one, of course. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.499666999667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#23",
                    "likes": "2",
                    "time": "24/03/2021-23:01:48",
                    "content": "    juan:  So if the Foundation dissolves without commenting (maybe they just want to hold for the next 10 years) you are proposing to actually not have this conversation at all?   If they dissolve without commenting we should assume they’re keeping their MKR. I’m not against a framework, but I’m seeing not discussion about framework, but rather jumping to one particular solution without taking into account important unknowns. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#24",
                    "likes": "2",
                    "time": "24/03/2021-23:05:16",
                    "content": "    reuptaken:  If they dissolve without commenting we should assume they’re keeping their MKR.   Exactly my point. We should make safe assumptions (where possible) and try to have a constructive discussion.     reuptaken:  but I’m seeing not discussion about framework       juan:  Framing a Framework General Framework  Do we align with the industry and compensate with tokens (MKR)? What is the best way of obtaining these tokens? (reduce slippage, avoid front-running, etc.) Do we want to include a vesting period, a cliff, and weighting (you get more on your fourth year than in your first)? How often should we review this framework? etc.  Specific Framework  Which teams/contributors get MKR tokens? How much MKR should they get? etc.  Edge Cases  What happens when a contributor changes Core Units? etc.  Next Steps Discussion We will have a Community Call this Friday, 26th, to discuss these topics (agenda coming soon). Working Group We will probably need to form a working group to tackle this issue and present a decent framework to the Community and teams. Please write to me if you’re interested.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.130952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#25",
                    "likes": "2",
                    "time": "24/03/2021-23:16:09",
                    "content": "Do we align with the industry and compensate with tokens (MKR)? Yes What is the best way of obtaining these tokens? (reduce slippage, avoid front-running, etc.) Mint Do we want to include a vesting period, a cliff, and weighting (you get more on your fourth year than in your first)? One year cliff with streaming afterwards for up to 4 years seems reasonable. How often should we review this framework? Yearly or Quarterly Which teams/contributors get MKR tokens? Unsure. I guess if I think about it, you want all “employees” to be aligned with the goals of the protocol aka value of MKR so in order to do so you should provide MKR to all of them with a majority skew going to Oracles, Smart Contracts, Risk, and Governance. How much MKR should they get? Perhaps negotiated seperately from DAI compensation package? Not sure how to do this efficiently. What happens when a contributor changes Core Units? Depends on how the MKR is doled out in the first place. Probably best to be determined on a case by case basis. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.682142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#26",
                    "likes": "3",
                    "time": "24/03/2021-23:20:10",
                    "content": "Here is what I wrote to @SebVentures in Rocket Chat PM and would essentially be my proposal/opinion for MKR minting: I think the biggest thing is making sure MKR is still deflationary long term and making sure we all agree to this philosophy. So short term it’s ok if we mint a bit for incentives but overall we should ensure that the supply is still going down. I think whoever can come up with a solid proposal that addresses these issues will garner a lot of support. So we have to define what is an acceptable amount of minting based on current and projected revenues vs MKR price appreciation. It’s a bit of guess work but as long as we stay conservative with the minting we should be ok. For instance we can estimate that MKR burn would be at a minimum 1-3% annually and then if we know Core Unit expenses we can get to a rough number of MKR we can accept as minting so that we are still net deflationary. So lets say revenues EoY are 200M, Core Unit expenses are 20M, and price of MKR is 5k. So Revenues are 180M/5K MKR = 36k MKR to be burned. Let’s ignore surplus buffer for this calculation as long term I don’t think it matters in price calculation. So you have ~3.6% deflation and we agree to mint 10% of that or 3600 to be split between Core Units and other incentive programs for the next year. This is obviously just an example of the possibilities. Know that I have no idea how much expenses are going to be and so could be more than 100M. These are just rough guesses for illustrative purposes. Next you’d need to agree to the allocation of these MKR based on Core Unit importance or perhaps during the budget proposal the Core Units know how much is allocated by governance and can then vie for a percentage of the pot knowing that certain Core Units “deserve” more. Something along those lines. Alternatively, governance agreeing to a yearly inflation of x% for incentives and then Core Units vying for that may be a simpler option. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.596746031746031
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#27",
                    "likes": "3",
                    "time": "24/03/2021-23:37:37",
                    "content": "    Aaron_Bartsch:  So you have ~3.6% deflation and we agree to mint 10% of that or 3600 to be split between Core Units and other incentive programs for the next year. This is obviously just an example of the possibilities.   So I think setting a fixed amount would be a good direction from the perspective of governance. It creates solid expectations.     Aaron_Bartsch:  …and can then vie for a percentage of the pot knowing that certain Core Units “deserve” more. Something along those lines.   That said, I think this turns MKR incentives into a zero sum game for core units. Speaking as a (hopefully soon to be) facilitator of a core unit, that doesn’t feel like much fun. Personally, I would be more comfortable if governance made that determination (how to split annual / quarterly incentives) rather than the Core Units having to sort it out. From what I can tell those options are mutually exclusive though. Either you mint a fixed amount for incentives and have a zero sum game, or you mint an unfixed amount and you have a non-zero sum game. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.465401785714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#28",
                    "likes": "1",
                    "time": "24/03/2021-23:46:15",
                    "content": "Alright fair enough. So agree to mint 1% of circulating supply per year and whatever surplus we have can get burned during the year. So 10k available for incentives (Core Units, yield farming, voting). Smart contracts asked for 3400 over 4 years? So give them 10% of the 10k? It should be based on individuals not teams though so if a team that is more “important” deserves more MKR how do they get a larger percentage? Or should the DAI compensation be based on competitive salaries in the industry and then MKR compensation should just be even across individuals? I guess whenever a new employee is onboarded the facilitator would have to request a new vesting contract for that individual. I’m still thinking higher risk Core Units should get more MKR allocation because they can mess up the protocol more. Some ideas to flesh out more.     LongForWisdom:  Either you mint a fixed amount for incentives and have a zero sum game, or you mint an unfixed amount and you have a non-zero sum game.   I don’t think you want to have an unfixed amount. That’s where you get into slippery slope territory and end up printing 50% of supply just because people are asking for it (and I don’t think current MKR holders would go for that). Having a fixed supply/allocation determined by governance is the only way I see this getting past whales. You can still leave lot’s of room for flexibility as long as the pool is large enough and MKR holders stay competent in setting these parameters. However this starts to get complicated and I know a few people that want to minimize protocol complexity, not increase it. Having some combination of fixed/predetermined inflation based on data, paired with a pre-determined framework for said inflation is what will win (in my opinion). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.702810120913569
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#29",
                    "likes": "5",
                    "time": "25/03/2021-01:17:23",
                    "content": "If CUs decide they want to pay their employees in MKR, we could give them a bag of Dai and let them buy it off the open market, or we can mint the equivalent amount and let it be used for compensation. I think the latter option is strictly preferable to us than wasting a bunch of money on slippage due to a misunderstanding of the token’s social contract. If expenses is greater than incomes, the MKR token is inflationary. If incomes are greater than expenses, then it is deflationary. This is how the system has always been designed to work. If personnel costs are some reasonable amount, the token will continue to deflate over time. If personnel costs are significantly more than revenues, then I guess something has gone very wrong. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5324074074074066
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#30",
                    "likes": "2",
                    "time": "25/03/2021-03:22:58",
                    "content": "Is there anyone who has the ability to reach out privately and understand what their plan of action is? This is a very strange situation to me, a simple MKR holder, that the Foundation’s intentions are completely unknown and yet, that they are currently paying for Maker’s costs. Is there a fixed amount that they’re willing to pay, can that amount increase, etc.?     juan:  Adding yet another variable into an already complex topic might derail the discussion and we might lose focus. Then we end up with no framework and no strong indication from the Community on how to proceed with these things.   I see your point of view on this but I think this variable should be a part of the discussion, at the very least.     juan:  Can we assume that the Foundation will dissolve (soon) and that it will leave us with zero extra funds?   How soon is soon? If it’s a few months as suggested by @amyjung, then it makes sense to wait and see what happens before the deciding on the course of action you are proposing. If it’s a few years, maybe not. I know you’re not affiliated with them but how is the current arrangement working and who’s the person talking to them now? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.711979166666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#31",
                    "likes": "5",
                    "time": "25/03/2021-07:40:22",
                    "content": "Some very good points in this thread. Thanks to everyone that participates and @juan for launching the party. I will mainly summarize what I understood and fill in some holes. One important point is the idea to have a limited budget for workforce expenses. This is probably for the best. This provides a constraint and incentivizes Core Unit to limit their size to the best efficiency. Let’s say Governance decides to allocate $50M to the workforce for the near future (one year). This can be split into 25M DAI and 12k MKR. The DAI part would be the base salary (defined using market price). The MKR part could be allocated using a split where every worker has a weight on it (contributor vs facilitator, core core unit vs non-core core unit, …). This removes the MKR minting issue more or less. Governance has decided to an annual budget and if earnings are not enough, well you end up with a net MKR issuance. You can decide to express everything in DAI as well and said the equity part is $25M to be split no matter the price of MKR. There are pros and cons. It’s not super important. I personally prefer the MKR option as a Core Unit facilitator and as a MKR holder. You get/pay more if MKR increase but that also good for MKR holders. And it decreases the cost/dilution if there is a DeFi winter. The base budget (the first 25M DAI) is a limit for Governance to not spend too much and agree on everything (even if only a gentleman agreement), the second part is a fixed incentive that avoids the complexity of managing MKR issuance. It decreases as the protocol grows and you don’t end up with 1000 employees that want each 0.1% of MKR (hey that’s 100%). Core Units facilitators will have to coordinate to have a good expectation to provide to their contributors. Remains some questions:  Is $50M a good number? I just took 100M of annual revenues and left some room for securing the protocol by growing the Surplus Buffer. 50% for fueling the growth and 50% to secure the growth (assuming we target 0 net MKR issuance). Do you count gas expenses in it? I would say so. Anything that is non directly correlated to growth should be in it. Obviously, you count $3M for gas and it might end up between $1M and $20M at the end of the year, that’s the difference between a budget and the reality (the budgeted target being expressed in gas price).  I think this is fair to everyone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.063924963924964
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#32",
                    "likes": "6",
                    "time": "25/03/2021-07:55:24",
                    "content": "@juan, I salute your spin skills, any marketing team would be lucky to have you.     juan:  Do we want (hyper)growth? We need to decide if we want hypergrowth. To raise the required capital (MKR), we will need to mint.   Highly interesting. A choice between hypergrowth or not. Could you please provide a link to the specific proposal that will ensure this hypergrowth and how much MKR is needed? At the moment Maker bandwidth is approximately onboarding 2-3 collateral types per month and you are suggesting this will improve to the point of hypergrowth if MKR is handed out as a bonus?     juan:  Should we burn the admin keys? First, we will need to agree on what type of project we are. Is this it? Have we achieved maturity?   So it is hypergrowth or burn the admin keys? I have followed Maker since 2016 and not once have I heard anyone even jokingly implying the admin keys should be burned. In my estimate there is at least  a decade of coding left and given the speed of defi development it is quite possibly Maker will never be finished.     juan:   100 contributors (will we have that many?) at the suggested 0.1% rate (most will get less) stay for four years (turnover suggests it will be less)  Then we would be minting 10% of the total supply.   No we won’t. Because - as you write yourself - turnover suggest most people leave before the 4 year period is over. The new folks coming in will want the same deal - which is why MKR will keep getting printed.     juan:  But if we do not trust Governance, we should frame it that way.   I trust Gov alright - to a certain extent. All people involved should ask themselves why Bitcoin of all projects have such a enormous market cap. The answer, if we take away the name value and history, is that it is nearly inconceivably for any one individual or even any group to mess up the protocol to such an extent that other people cannot make a recovery. No bitcoin core dev or gov group ever prints BTC, that is a central part of the value proposition. I am not suggesting Maker has reached this stage yet, and I am not a anti-print maximalist, but any printing of MKR will need to come hand in hand with countermeasures to hinder future printing for any other reason than to keep the protocol above water. It is very hard to be just a little bit pregnant. I am sorry if I come across as a bit harsh on this topic. EDIT: typos ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.123870002546473
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#33",
                    "likes": "2",
                    "time": "25/03/2021-08:24:54",
                    "content": "    AstronautThis:  Is there anyone who has the ability to reach out privately and understand what their plan of action is?   I’m happy to discuss this in private in anyone feels like it. That said I don’t believe that anyone will reach out.     AstronautThis:  I see your point of view on this but I think this variable should be a part of the discussion, at the very least.   If we had a MKR whale that was contributing a lot, and helping a lot, and paying the bootstrapping, and all of a sudden went silent…  would we stop all activities? would we be upset? is it even fair?  I do understand that it is not the same, but I don’t think that we deserve the level of entitlement that we’re entertaining. Let’s assume they’re gone and plan for it, and reassess when new information arrives?  @Aaron_Bartsch , if there is a Working Group forming to create a Framework I would appreciate it if you were in there, as I believe that your constructive comments could add a lot of value.  @Planet_X Thanks for your (probably sarcastic) compliments. I know, though, that they are not ill-intended.     Planet_X:  bandwidth is approximately onboarding 2-3 collateral types per month and you are suggesting this will improve to the point of hypergrowth if MKR is handed out as a bonus    If we only keep onboarding 2-3 collateral types per month we will grow at a relatively predictable pace. However, we will be limited by the size of the collateral types we onboard. (Hence the initiatives of RWF, different MIPs that propose integrations, L2s, etc.) If I (or anyone) can guarantee any type of success, you should run away. I think that we’re quite committed to give it our best shot though.      Planet_X:  I have followed Maker since 2016 and not once have I heard anyone even jokingly implying the admin keys should be burned. In my estimate there is at least a decade of coding left   Maybe an hyperbole was not the best idea, but it does convey the argument. I fully agree. I do not think that we should burn anything (except for MKR).     Planet_X:  I trust Gov alright - to a certain extent.   I’m not asking for a carte blanche to print. Right now there is a group that wants to hire the best talent and grow Maker way more (we’re just getting started). There is another group that says that we should cap the expenses to our revenues. Once we decide which group we are in, we can start planning accordingly. But they are very different ways of running a project.     Planet_X:  which is why MKR will keep getting printed.   If we get 100 contributors at 0.1% and they left after 1 year, we would have minted 2.5% (assuming linear vesting). So when the new 100 contributors arrive, you still have 7.5% of the original deal to mint. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9977901131126945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#34",
                    "likes": "12",
                    "time": "25/03/2021-16:49:03",
                    "content": "Here is a dashboard to work hypothesis on expenses. It’s not taking in account MKR currently but you can copy the spreadsheet and make your own simulations. It’s only a simulation tool and doesn’t tell the truth as I don’t have the good input parameters anyway. I don’t have any idea what the Oracle Budget will be for instance.   docs.google.com    MakerDAO Budget Dashboard Sheet1   MakerDAO Budget Dashboard <a href=\"https://forum.makerdao.com/t/should-we-burn-the-admin-keys-an-argument-for-minting-mkr/7175/31?u=sebventures\">Based on this post</a> Params,MKR compensation Matrix (not used) Baseline?,Worst...       image1165×886 61.2 KB  ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1K2ebYb41BXcLzBcuUPfsxf72FThfZk61jwgx7koHfVk/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1K2ebYb41BXcLzBcuUPfsxf72FThfZk61jwgx7koHfVk/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#35",
                    "likes": "3",
                    "time": "25/03/2021-16:59:24",
                    "content": "    SebVentures:  Here is a dashboard to work hypothesis on expenses.   Amazing, Seb. I think this deserves its own thread instead of being buried in this one. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#36",
                    "likes": "1",
                    "time": "25/03/2021-19:51:07",
                    "content": "Amazing work Seb. This is pretty much what I envisioned. Just have to work on edge cases, parameters, and procedure. I look forward to seeing how this evolves. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#37",
                    "likes": "1",
                    "time": "25/03/2021-21:25:19",
                    "content": "    juan:  If we get 100 contributors at 0.1% and they left after 1 year, we would have minted 2.5% (assuming linear vesting). So when the new 100 contributors arrive, you still have 7.5% of the original deal to mint.   Do I understand well that this MKR benefit would be a kind of annual bonus for all? If so, the benefits paid in the MKR could be weighted by the number of successful years spent under the protocol.     SebVentures:  Is $50M a good number?   it is a matter of point of view. This amount is exactly twice the annual military spending of the Central African Republic … Seriously, exactly what results do we expect from spending this amount? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.192234848484848
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#38",
                    "likes": "2",
                    "time": "25/03/2021-21:53:45",
                    "content": "    purrfection:  Do I understand well that this MKR benefit would be a kind of annual bonus for all?   It’s not annual. Vesting is linear. And it’s not for all. That’s to be determined, as outlined here:     juan:  Specific Framework  Which teams/contributors get MKR tokens? How much MKR should they get?         purrfection:  This amount is exactly twice the annual military spending of the Central African Republic   How does this help? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#39",
                    "likes": "10",
                    "time": "26/03/2021-07:19:08",
                    "content": "@juan, I love what you do, and your post is definitely stirring the pot here. If anything, I view this post as a “Devil’s Advocate.” This conversation must be had. A lot has already been said on this topic, so I’ll try to cover some of what I think is worth considering.  First, where I stand:  We NEED to be competitive to retain talent. I am pro-vesting. Compensating devs/contributors w/ vested MKR, A LOT of MKR, is a must.  Crude as it was, @kevinwildenradt and I did propose MIP42.   Minting is not inherently evil. I am vehemently against minting without strict, clearly defined, codified constraints.  What I mean is, minting beyond the point of dilution.   Minting to dilution is a non-starter for me.  I will vote against it.   We need a clearly defined CU standardized framework, even if it means delaying the rollout of CUs. Vesting MKR should be voted on by the DAO for how much each CU receives.  I hope we are adult enough to not battle over scraps of who gets how much and can calmly accept the Maker governance community’s decisions.   MKR for vesting should ideally be set aside and reserved for CU teams ahead of their respective launches, likely open to monthly/quarterly/annual review. From where and how we obtain that MKR is the open debate.  @SebVentures G-Sheet is awesome.   So, I have a few key premises:  People suck. Humans have cognitive biases. MKR governance is composed of people. The printer button’s temptation is too powerful for any mere mortal to resist.  I do not care who you are… if the printer button is there, you will press it. No one, no matter their willpower or moral alignment, will resist the printer button on an indefinite timeline. We will come up with any and every \"reasonable\" justification to use it. Grow the team, retain talent, fund development, form partnerships… you name it. I don’t have an issue with minting per se. If, from a technical, market standpoint, it makes more sense to mint rather than use the surplus to acquire MKR and redistribute. So be it. The issue, as I see it, is minting freely to incentivize “promises” of future growth… and minting above our means (i.e., minting more than we burn) hoping that the growth incentivized by minting will outpace the dilution effect. This path has already been traveled. We know where it leads. I will argue this point til death. We are all human at the end of the day and are all susceptible to the typical cognitive biases that come with that. We need a system with a proper incentive structure that does not allow for bad (or stupid) actors to be able to make bad decisions. We need to think hard for another way. We must set strict constraints and work within those bounds. If we lose some talent as a result, it will be a tragedy, but I would much rather we retain the talent that is passionate about Maker and understands the power and future of MakerDAO.  We are the industry leader and the role model for the entire space. We must lead by example.  If we choose to go down the path of unrestricted minting for XYZ, we WILL devolve into a mess where everyone will be looking to vote for themselves to receive minted MKR in one way or another. I, myself, will become a proponent of minting. If we are minting… I WANT IN. You better be printing to me for staking my vote. You better print to me for any and every reason. Fuck those ppl who aren’t participating. Snooze, you lose… but you better print to ME!  This is NOT who I am at heart, but that’s what this incentive structure will lead me to become.  I am largely with @Planet_X:  I am not suggesting Maker has reached this stage yet, and I am not an anti-print maximalist, but any printing of MKR will need to come hand in hand with countermeasures to hinder future printing for any other reason than to keep the protocol above water. It is very hard to be just a little bit pregnant.   The Big Unanswered Question: The Future of The Foundation Treasury This remains the largest unanswered question, and imo, is perhaps one of the most important factors for this discussion. I fully understand that this is a touchy subject, and for legal reasons, we may not know the answer for a while. As touchy as it may be… the time has come to touch it. Once the foundation dissolves:  Will the MKR be burned?  Then we can freely mint up to the burn amount, reserve that MKR for the DAO treasury, and ration out MKR as needed for years to come. The minting issue becomes moot.   Will the MKR be transferred to the DAO treasury?  We can reserve that MKR and ration out MKR as needed for years to come. The minting issue becomes moot.   Will the MKR be donated?  No idea what to do in this case.   Will the MKR be disbursed to friends and foundation members?  I’d rate the odds of that at near-zero… but again, no idea what to do in this case.   Will the MKR be disbursed equally to all MKR holders after some snapshot?  Maybe this puts us back to a minting against revenue scenario.   Will the MKR be disbursed equally to all MKR holders that have locked their MKR in the voting contract after some snapshot?  Maybe this puts us back to a minting against revenue scenario.   Will there be some other plans for that MKR?  We’ll have to see what happens and adapt accordingly.    Depending on how this unfolds, we may have to completely readjust all of our plans for minting and vesting schedules.  TLDR:  Let’s not be irresponsible. Let’s pause and think about whether or how much we really truly need to be minting. I know this is a hard transition. We are all strong, intelligent, and passionate pioneers. We can get by without abusing the printer button. Resist the temptation at all costs. The entire industry is looking up to us. Let’s set the right example. Let’s not repeat the same mistakes that have plagued the traditional world for millennia.   Side Note:  I have no idea what burning the admin keys entails, so I won’t place a strong opinion there. That said, intuitively, it doesn’t seem like the play.   Tags: @LongForWisdom @cmooney @mrabino1 @iammeeoh @Aaron_Bartsch @amyjung @brianmcmichael @Joe_Quintilian @NikKunkel @galabasquer @flipflopflapdelegate @Derek @reuptaken @prose11 @ultraschuppi @twblack88 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.292598238482384
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#40",
                    "likes": "3",
                    "time": "26/03/2021-07:22:32",
                    "content": "Tags (Contd.) @Davidutro @Anna @Kurt_Barry @rune @Haiku ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#41",
                    "likes": "4",
                    "time": "26/03/2021-10:14:31",
                    "content": "Why don’t we buy the MKR instead of minting. It is mainly what companies are doing. You buy your share and redistribute them. Only companies with no cash are diluting. I don’t think burning the key is the answer to be honest. Yearn burned the key because of the lack of thrust from the share holder. We don’t have this issue, the only lack of thrust we have is that we are going to spend more than what we are going to earn and not going to burn anything. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.904761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#42",
                    "likes": "2",
                    "time": "26/03/2021-11:11:24",
                    "content": "    alexis:  Why don’t we buy the MKR instead of minting   I think I proposed something along the lines you are suggesting.     MIP40c2-SP7: Modify Smart Contract Core Unit Budget Maker Improvement Proposals       thank you @Derek! It is for me super interesting to be here, now, and witness the first baby steps of a multi-billion worth DAO budget definition.  Your Core Unit, being amazing, is a fantastic source of insights and ideas for discussion.  The more I think about it, the more I think my proposal (which I am now going to iterate in more details) might be interesting for you, other Core Units, and MKR-holders too.  PROPOSAL (in more details):    [Basic Methods] Beside the mo…     However I have to admit that @Derek subsequently made a good point. basically: what happens in a moment of crisis, when MakerDAO is not making (sufficiently making profits) profits for buying MKR to reward core units? It that phase, when talent is most needed than ever to recover, the incentives are not working in MakerDAO’s favour. I agree with this point, but perhaps we can build on it and find a way to secure rewards even when MakerDAO might experience a period of no profits? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.546365914786968
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#43",
                    "likes": "1",
                    "time": "26/03/2021-11:27:39",
                    "content": "    iammeeoh:  basically: what happens in a moment of crisis, when MakerDAO is not making (sufficiently making profits) profits for buying MKR to reward core units? It that phase, when talent is most needed than ever to recover, the incentives are not working in MakerDAO’s favour.   Unfortunately when you are not making enough monies you are bankrupt. So many companies went bankrupt after the ico bubble that is pretty fair to assume that makerdao has a good chance to end up there too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.535714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#44",
                    "likes": "1",
                    "time": "26/03/2021-12:33:16",
                    "content": "If you are bankrupt you can essentially do a funding round with minted MKR to accrue new funds to keep going (as long as there are parties willing). That is the power of minting. Let’s hope we never get there again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.136363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#45",
                    "likes": "8",
                    "time": "26/03/2021-12:36:25",
                    "content": "My personal take on this is to let the system settle first. I am in-favor of a cool-off period, followed by compensation by core unit being agreed upon no more frequently than once a year (unless new staff is added). After 12 months post-foundation, discussion about using MKR as incentives should be addressed. Until then, raw “DAI” compensation only should be used. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.003996003996004
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#46",
                    "likes": "4",
                    "time": "26/03/2021-12:44:23",
                    "content": "    alexis:  Why don’t we buy the MKR instead of minting. It is mainly what companies are doing. You buy your share and redistribute them. Only companies with no cash are diluting.   Is it? My understanding is that shares granted to employees are issued, and that buybacks are a different matter. Do you have an example of a company buying shares for the purpose of redistributing them to employees? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#47",
                    "likes": "2",
                    "time": "26/03/2021-13:08:51",
                    "content": "    swakya:  Is it? My understanding is that shares granted to employees are issued, and that buybacks are a different matter. Do you have an example of a company buying shares for the purpose of redistributing them to employees?   Google, amazon, tesla, goldman … Companies don’t issue share as far as they have cash. Only startup businesses pay with future share. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#48",
                    "likes": "2",
                    "time": "26/03/2021-14:03:43",
                    "content": "I’m confused. Do you mean that, say, Google will go on the market to buy the shares it needs to fulfill the stock compensation part that it does give to most of its employees? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.645833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#49",
                    "likes": "1",
                    "time": "26/03/2021-14:04:02",
                    "content": "@alexis, I’m not entirely sure that these statements are correct, and I believe we should try to build constructively. As examples:     alexis:  Unfortunately when you are not making enough monies you are bankrupt.   Some companies go through phases; they might even get bridge loans (if raising), or plain old loans. When you borrow against a future cashflow. If you believe that Maker will 3x, but if we mint/dilute 10% it will 100x (I’m making these up just as an example), you are probably better off minting.     alexis:  Companies don’t issue share as far as they have cash.   I believe there are more things to consider such as the Cost of Capital, leverage of capital, etc; there are entire teams of treasury optimizing these things. Let’s try to build something together instead of throwing statements around. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.107142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#50",
                    "likes": "0",
                    "time": "26/03/2021-14:19:08",
                    "content": "    juan:      alexis:  Companies don’t issue share as far as they have cash.   I believe there are more things to consider such as the Cost of Capital, leverage of capital, etc; there are entire teams of treasury optimizing these things. Let’s try to build something together instead of throwing statements around.   Give me one company full of cash which issues share with exception of big investment?     juan:      alexis:  Unfortunately when you are not making enough monies you are bankrupt.   Some companies go through phases; they might even get bridge loans (if raising), or plain old loans. When you borrow against a future cashflow.   Ok so let’s agree that the next step is the bankruptcy unless you reverse the cycle. As par my example ico bubble didn’t see much of them going through hell and come back. Actually, I am not even sure you can find any “token company” which could secure a plain old loans. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.455357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#51",
                    "likes": "0",
                    "time": "26/03/2021-14:23:27",
                    "content": "    swakya:  I’m confused. Do you mean that, say, Google will go on the market to buy the shares it needs to fulfill the stock compensation part that it does give to most of its employees?   Where ever they can find share, I believe market is the most common place. I am sure they distribute share and I am pretty sure they don’t increase the share supply often. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.7734375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#52",
                    "likes": "0",
                    "time": "26/03/2021-14:29:09",
                    "content": "Apple: Apple Shares Outstanding 2006-2020 | AAPL | MacroTrends ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#53",
                    "likes": "0",
                    "time": "26/03/2021-14:31:50",
                    "content": "    alexis:  Give me one company full of cash which issues share with exception of big investment?   After a 3-minute Google Search, let’s take the most cash-rich company in the world: AAPL. Exhibit A 28.03.2020 - 17.30 Billion outstanding shares:  image1074×784 60.1 KB  Exhibit B 17.04.2020 - 17.34 Billion outstanding shares:  image1052×774 59.4 KB  I’m not an expert on this topic, but I feel that your statements carry a lot of weight and we might be building on false premises. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#54",
                    "likes": "1",
                    "time": "26/03/2021-14:35:55",
                    "content": "I think it is a bit out of context but I believe that is a buyback program. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#55",
                    "likes": "0",
                    "time": "26/03/2021-14:39:08",
                    "content": "    alexis:  buyback program.   It’s literally the opposite: they’re ISSUING shares. I don’t want to get into contexts, or how is Apple managing their treasury. I want to avoid blanket statements that are not very constructive, that’s all. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#56",
                    "likes": "5",
                    "time": "26/03/2021-14:43:35",
                    "content": "Take a look at AMZN or GOOGL on the same site and you’ll get a very different picture. My point here is not to argue for going one way or the other. However I am interested in the discussion being based on facts (which can be rather complex) rather than unsourced blanket statements. From an accounting perspective, stock-based compensation is an expense. Yet it is also very useful to companies because it requires no cash – shares are in fact issued for compensation (according to e.g. corporatefinanceinstitute.com). Whether a company is overall increasing or reducing its outstanding shares count is the outcome of higher-level strategies; whether a company will or will not buy back stock depends on its capital opportunities, its internal evaluation of the current share price, etc. Providing MKR as compensation should be done (or not done) based on rather tricky tradeoffs we have to think through, regarding our image, the market for talent, the market reaction to issuance, etc. Not based on whether it puts us in some imagined “has no cash” bucket or constrained by the fact that we must buy those MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.324999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#57",
                    "likes": "2",
                    "time": "26/03/2021-14:46:36",
                    "content": "    swakya:  Providing MKR as compensation should be done (or not done) based on rather tricky tradeoffs we have to think through, regarding our image, the market for talent, the market reaction to issuance, etc. Not based on whether it puts us in some imagined “has no cash” bucket or constrained by the fact that we must buy those MKR.   totally agree. There is no black/white, and it’s a complex topic. I think Core Units should develop this topic in some serious details with the best techniques used in healthy companies. Fortunately we already have the Real-World Finance Core Unit that can assist (and is doing that, while we speak). Perhaps in the long(er) term we might even have a dedicated Core Unit for compensation management. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.055555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#58",
                    "likes": "0",
                    "time": "26/03/2021-14:48:53",
                    "content": "Yes sorry, That is true, I also believe that overall for normal company issuing share is a costly process and that is probably more the reason why they do it by batch. Where buying share seems a less painful process. While issuing token is probably more easier. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#59",
                    "likes": "7",
                    "time": "26/03/2021-14:51:51",
                    "content": "    alexis:  Give me one company full of cash which issues share with exception of big investment?   Bouygues, they rewards employees. Not a startup, full of cash. They just don’t care and shareholders probably prefers dividends. Unibail-Rodamco-Westfield that was on a verge of a nice dilution (50%) for almost no cash. Was cancelled at the last time thanks to an activist raid. The bond market reacted positively to the cancelation of the share offering (which should be the opposite but hey, stupid management was fired in the process so that’s a win). Société Générale is another case. If you are full of cash, with shareholders that don’t want dividend, share buyback is the good path. We have decided that the good play for MakerDAO is to have a Surplus Buffer of 30M. If we were rational we would mint MKR to fill the Surplus Buffer. But we don’t want to do that because we are a bit greedy (and honestly that’s fine to wait some months). Let’s not mix HR items with financials items. How you compensate contributors is HR, how you manage your balance sheet is finance. As said, MKR is liquid so you can always convert one to the other. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3652935606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#60",
                    "likes": "0",
                    "time": "26/03/2021-15:00:23",
                    "content": "    SebVentures:  Let’s not mix HR items with financials items. How you compensate contributors is HR, how you manage your balance sheet is finance. As said, MKR is liquid so you can always convert one to the other.   This. Please. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#61",
                    "likes": "3",
                    "time": "26/03/2021-16:47:12",
                    "content": "The snapshot you posted is incredibly misleading - I don’t think it was deliberate but it’s from last year and outstanding shares can fluctuate over short periods of time.  However, the long term trend in Apple’s share repurchases is clear.  Apple shares outstanding for the quarter ending December 31, 2020 were 17.114B, a 3.96% decline year-over-year. Apple 2020 shares outstanding were 17.528B, a 5.74% decline from 2019. Apple 2019 shares outstanding were 18.596B, a 7.02% decline from 2018. Apple 2018 shares outstanding were 20B, a 4.79% decline from 2017.  A company’s decision to buy back shares is completely separate from the stock compensation employees receive and is based on capital allocation. If a company is buying their own shares back, it is because they believe it is providing the highest ROI vs alternatives, namely reinvesting in the base business. If executives and employees are receiving stock compensation, it is because the value they bring to the business exceeds such costs which the market dictates.  Amazon shares outstanding for the quarter ending December 31, 2020 were 0.510B, a 1.19% increase year-over-year. Amazon 2020 shares outstanding were 0.51B, a 1.19% increase from 2019. Amazon 2019 shares outstanding were 0.504B, a 0.8% increase from 2018. Amazon 2018 shares outstanding were 0.5B, a 1.42% increase from 2017.  Looking purely at the buy backs/dilutions for these companies, one would assume Apple outperformed Amazon.  AAPL v AMZN1111×518 81 KB  Let’s take this a step further and look at an extreme example. For the prior three years revenue growth for CVNA has been 42%, 101%, and 128% respectively. The dilution is reflected below. How have shareholders done over this period, where revenue and share growth have both been quite high?  Carvana shares outstanding for the quarter ending December 31, 2020 were 0.065B, a 38.71% increase year-over-year. Carvana 2020 shares outstanding were 0.065B, a 38.71% increase from 2019. Carvana 2019 shares outstanding were 0.047B, a 55.93% increase from 2018. Carvana 2018 shares outstanding were 0.03B, a 97.12% increase from 2017.   CVNA vs AMZN and APPL1133×519 83.8 KB  Carvana is a used car platform, with very high fixed and capital costs. They are currently no where near profitability and analysts do not expect them to reach profitability for 3-5 years. I post these to illustrate that investment returns are not dictated by a decision to buy back from or dilute shareholders, but long term free cash flow which is derived from effective capital allocation. I understand that Maker was built and intended to be net deflationary over time. This is great in theory and long-term is an ideal model in my opinion, but only when MakerDAO’s growth has slowed and the expected ROI from the buy-back exceeds all other investment and capital allocation opportunities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.185487012987013
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#62",
                    "likes": "3",
                    "time": "26/03/2021-16:52:13",
                    "content": "    Aes:  The snapshot you posted is incredibly misleading - I don’t think it was deliberate but it’s from last year and outstanding shares can fluctuate over short periods of time. However, the long term trend in Apple’s share repurchases is clear.   Thanks, @Aes, for your well-researched answer. I was not trying to imply that AAPL is issuing shares long-term. I was just showing a cash-rich company that, in fact, issues shares. Just a quick counter example. I think @SebVentures was much more eloquent than me, and also pointed out this:     Aes:  A company’s decision to buy back shares is completely separate from the stock compensation employees receive and is based on capital allocation.   Finally, I really like how you framed this:     Aes:  I post these to illustrate that investment returns are not dictated by a decision to buy back from or dilute shareholders, but long term free cash flow which is derived from effective capital allocation. I understand that Maker was built and intended to be net deflationary over time. This is great in theory and long-term is an ideal model in my opinion, but only when MakerDAO’s growth has slowed and the expected ROI from the buy-back exceeds all other investment and capital allocation opportunities.   Thanks again for your post. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.175724637681159
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#63",
                    "likes": "0",
                    "time": "26/03/2021-16:52:26",
                    "content": "    Aes:  The snapshot you posted is incredibly misleading   This whole thread is misleading actually, it came from a mistake I made by replying without quoting. I am very sorry for that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#64",
                    "likes": "3",
                    "time": "26/03/2021-16:56:40",
                    "content": "Maker needs a treasury of DAI to weather a downturn in the market/DeFi Winter and ensure CU’s can continue to be paid without needing to issue MKR (which would be at undesirable prices in the aforementioned scenario). This would be separate from the Surplus Buffer and would be invested to generate a return. We would have to model out annual expenses and worst case scenarios to determine how much of a treasury to carry, but in my opinion this is an easy win to provide stability to CU’s and ensure MKR doesn’t get minted at low prices/unfavorable market conditions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.361111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#65",
                    "likes": "7",
                    "time": "26/03/2021-18:24:59",
                    "content": "Aight @aburban90 you tagged me, so here are some comments.     aburban90:  So, I have a few key premises:  People suck. Humans have cognitive biases. MKR governance is composed of people. The printer button’s temptation is too powerful for any mere mortal to resist.    Only two of these are correct.  People suck - No they don’t, on average humans cooperate more often than they defect. If this wasn’t true, civilisation wouldn’t exist. Humans have cognitive biases - Yes. MKR governance is composed of people. - Yes. The printer button’s temptation is too powerful for any mere mortal to resist. - Eh, I disagree, but no one mortal has the ability to push it, so it’s more or less beside the point.      aburban90:  No one, no matter their willpower or moral alignment, will resist the printer button on an indefinite timeline.   No one mortal has the ability to push it. What matters is whether multiple mortals can convince each other that it is a good idea.     aburban90:  and minting above our means (i.e., minting more than we burn) hoping that the growth incentivized by minting will outpace the dilution effect. This path has already been traveled. We know where it leads.   This choice is always a gamble. It can end well, it can end badly. It depends on the usage of the funds, but it isn’t inherently a bad choice, it is a risky choice. No one knows where it leads in any individual instance until it leads there.     aburban90:  We must set strict constraints and work within those bounds.   We cannot set hard-coded constraints. Governance cannot bind its own future actions in this way from a technical standpoint - not in a way that allows the protocol to still operate with MKR as the backstop to the system.     aburban90:  If we choose to go down the path of unrestricted minting for XYZ, we WILL devolve into a mess where everyone will be looking to vote for themselves to receive minted MKR in one way or another.   This is a slippery slope argument that isn’t justified. Why is it unreasonable to say that governance might vote in favour of minting for Core Unit alignment and incentives, but would not vote in favour of minting for individuals? Why is it certain that governance cannot use minting judiciously, especially when it already does so? We’re debating where the line is, not whether or not the line exists. We know there is a line, because we currently mint MKR in order to recapitalize DAI and prevent the death of the protocol. Ultimately there are different ways to die. We might die fast or we might die slow. Minting MKR to recapitalize the system is an example of using MKR mint to prevent dying fast. Minting MKR to pay salaries in DAI (in the absence of other funds) is another example of using MKR mint to prevent dying fast. Dying slow is much harder to see coming, and much harder to reason about, but that doesn’t mean it isn’t a threat. Some tools are dangerous. Often the most useful tools are the most dangerous. Arguing that the tool is so dangerous that we cannot touch it prevents both positive and negative outcomes of its use. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.976933621933622
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#66",
                    "likes": "4",
                    "time": "26/03/2021-19:20:47",
                    "content": "   Holy cow! What a crazy discussion you guys have here over issued and outstanding shares versus fully diluted shares, buybacks, and employee Stock options haha. When a corporation grants someone the right to buy shares later, such as granting a stock option to an employee, those shares are not yet issued and outstanding. Reserved shares are often referred to as the “unallocated option pool” or the “pool.” The unallocated option pool is not considered issued and outstanding. And no, Berkshire Hathaway is not currently buying back stock to Reward/pay employee bonuses. It’s rewarding the shareholders of BRK. All in all it reads as this discussion is not coming up with a solution. Lets keep it simple. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.661172161172161
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#67",
                    "likes": "3",
                    "time": "26/03/2021-20:48:13",
                    "content": "    juan:  That’s to be determined, as outlined here:   Thank you, it looks like I’m lagging behind, I can’t see through the whole picture well. This forum have too many entries in the past to read through and understand in my limited time. There will be more and more entries in the future as the Maker system evolves. This could be a problem for many of us.     juan:  How does this help?   I wanted to make it clear that — maybe from your point of view, it doesn’t work out that way — but it’s a large sum, with a great responsibility. This is a great opportunity for all of MKR holders, please use it wisely. Burning admin keys doesn’t seem like a good idea to me in a rapidly changing environment like crypto. Of course, I may have missed this topic earlier as well, I’m sorry if that happens. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.262605042016807
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#68",
                    "likes": "1",
                    "time": "26/03/2021-23:10:42",
                    "content": "    SebVentures:  Let’s not mix HR items with financials items. How you compensate contributors is HR, how you manage your balance sheet is finance. As said, MKR is liquid so you can always convert one to the other.   Well said, it’s possible to support minting maker in situations where the SB is tapped and we have outstanding debt to cover and not support minting maker to reward developpers on the SC team 995 mkr (2 Million dai) a year. These two thoughts are not mutually exclusive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#69",
                    "likes": "2",
                    "time": "26/03/2021-23:25:32",
                    "content": "    purrfection:  Burning admin keys doesn’t seem like a good idea to me in a rapidly changing environment like crypto.   Just for the record, I believe that we should not burn the admin keys. That hyperbole was used to illustrate the point that we should come up with a framework for minting Dai when needed.     purrfection:  This forum have too many entries in the past to read through and understand in my limited time.   I think it happens to all (to different extents). Thanks for contributing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.898809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/galabasquer",
                    "index": "#70",
                    "likes": "2",
                    "time": "29/03/2021-15:00:06",
                    "content": "a year? have you read the proposal? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#71",
                    "likes": "0",
                    "time": "28/06/2021-21:00:51",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}