{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/decentralized-frontend/14680",
            "title": "Decentralized frontend ",
            "index": 14680,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "media",
                "frontend",
                "network",
                "decentralized"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "5",
                    "time": "19/04/2022-00:04:12",
                    "content": "Is it necessary to decentralize the MakerDao frontend? At least it can be done with the “media network” project, in short, the media network is responsible for applying the same philosophy of web3 to the CDN (content distribution network), for the creation of content, it will make the content creators do not depend on a centralized entity. I think it would be good because it would add another degree of decentralization to Maker, and that is one of the objectives of all this. Tutorial on how to set up an uniswap front-end, host it on IPFS and serve it with Media Network Tutorial More information “Is a new protocol that bypasses traditional CDN providers’ centralized approach for a self-governed and open source solution where everyone can participate. Media Network creates a distributed bandwidth market that enables service providers such as media platforms to hire resources from the network and dynamically come and go as the demand for last-mile data delivery shifts. It allows anyone to organically serve content without introducing any trust assumptions or pre-authentication requirements. Participants earn MEDIA rewards for their bandwidth contributions, a fixed supply SPL token minted on Solana’s Blockchain…” Media network  1_OPoJRStNk9y9DGAApgp8LA945×345 20.8 KB  ",
                    "links": [
                        "https://media.network/",
                        "https://forum.makerdao.com/t/interfaz-descentralizada-traduccion/14870"
                    ],
                    "GPT-summary": "The author proposes to decentralize the MakerDao frontend using the \"media network\" project, which applies the philosophy of web3 to the CDN. The proposal aims to add another degree of decentralization to Maker. The post includes a tutorial on how to set up an Uniswap front-end, host it on IPFS, and serve it with Media Network. The post also provides information about the Media Network protocol and how it creates a distributed bandwidth market. A 3rd party gives constructive criticism and extends to the proposal, asking questions about its feasibility.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.556818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "2",
                    "time": "24/04/2022-17:20:25",
                    "content": "The concept is interesting but, it is not a good idea to depend on another protocol no matter how “decentralized” it is, that’s my opinion.  I don’t see it necessary for now ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#3",
                    "likes": "2",
                    "time": "24/04/2022-21:57:48",
                    "content": "Technically it could not be said to be 100% protocol dependent either because it is hosted on IPFS ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "1",
                    "time": "24/04/2022-23:34:04",
                    "content": "It is something to think about for sure. Sometimes we have to pivot in these everchanging times. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#5",
                    "likes": "1",
                    "time": "26/04/2022-17:10:52",
                    "content": "On further analysis, it would be nice to have a mirror in IPFS, after all with so much censorship nowadays.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#6",
                    "likes": "2",
                    "time": "27/04/2022-22:13:34",
                    "content": "MakerDAO as it is right now depends on other protocols who provide us the interfaces to the products, having more and more developing frontends for the MakerDAO services is a very good idea right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.963690476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#7",
                    "likes": "1",
                    "time": "01/05/2022-14:27:05",
                    "content": "I understand, I got carried away by the centrist vision of a protocol, really what makes DEFI special is the union of legos and protocols that form a solid structure. What better pillar to build that lego base than Maker.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.257142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#8",
                    "likes": "3",
                    "time": "04/05/2022-10:59:36",
                    "content": "Hi! I’m with a team that builds and maintains one of MakerDAO’s frontends and I wanted to share some thoughts on this topic. Unlike Uniswap, MakerDAO’s frontends rely on quite a bit more than just on-chain components. For example, the Governance Portal (vote.makerdao.com) relies on critical governance data (eg. the markdown of executive proposals) hosted on GitHub. Building decentralized frontends isn’t a silver bullet right now—we need to consider where+how critical data is hosted and explore decentralisation on that front. We have some ideas floating around within our team related to this topic but haven’t prioritised it yet. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.785714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#9",
                    "likes": "0",
                    "time": "05/05/2022-16:53:39",
                    "content": "Can you comment on what solutions you and your team have on the table?, and talk about those ideas you mention?, that is valuable and interesting information ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#10",
                    "likes": "0",
                    "time": "06/05/2022-08:26:08",
                    "content": "Not much to say at this point tbh—this is not a priority right now so we haven’t done a lot of research yet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4642857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "04/08/2022-08:26:31",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}