{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/what-is-the-point-of-giving-usdc-as-a-collateral-to-obtain-dai/8848",
            "title": "What is the point of giving USDC as a collateral to obtain Dai? ",
            "index": 8848,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MichelKesin",
                    "index": "#1",
                    "likes": "0",
                    "time": "18/06/2021-19:26:31",
                    "content": "I am not a friend of Dai being so heavily backed by USDC. Coinbase could go bankrupt for example or could be government ordered to freeze certain USDC. appvalley But what I understand even less is why? Who are those people that put up 2.2 Billion USDC to generate less DAI and pay interest for that? What is the point of this? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.601190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "2",
                    "time": "18/06/2021-19:49:07",
                    "content": "It’s not a collateral. Maker buys/sells USDC at a fixed price. If the market price deviates, it provides an arbitrage opportunity to those wanting to buy/sell USDC for DAI. Great question, though! It’s important people understand it’s not a vault. I think it says so on the PSM UI, but not sure where else. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "1",
                    "time": "18/06/2021-20:06:16",
                    "content": "    PaperImperium:  Great question, though! It’s important people understand it’s not a vault. I think it says so on the PSM UI, but not sure where else.   Yes, the PSM is basically a type of guarantee that is not linked to a vault, therefore it is not linked to a user, but free and anyone in proportion may give DAI for USDC or USDC for DAI. Maker’s earnings for this module is based on trading commissions of 0.1% I believe it is, unlike Vaults which is from stability fees. Therefore, I believe they do not enter into liquidations, I have not investigated further if MakerDAO can do anything with the USDC that are there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "2",
                    "time": "20/06/2021-00:25:16",
                    "content": "    MichelKesin:  Coinbase could go bankrupt   Bruh if CB goes belly up then we’ll all get REKT. Might as well turn the lights off. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}