{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/strategic-and-not-naive/9315",
            "title": "Strategic and Not Na\\xc3\\xafve ",
            "index": 9315,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#1",
                    "likes": "13",
                    "time": "13/07/2021-14:03:12",
                    "content": "I am seeing more and more Maker community members on the forum requesting more active donation, grant, and also liquidity programs. While they are good in theory, they have to be strategic. For example, just yesterday, we saw how DeFi Education Fund and its related people sold a large portion of UNI they got from Uniswap governance despite the governance got the commitment to not dilute it right away and allocate for 4-5 years.   twitter.com    Defi Education Fund @fund_defi    With the help of @GenesisTrading, we sold 500k UNI for ~$10.2M USDC in order to fund the efforts of the Defi Education Fund.   In the next 24 hours, we will be sending 500k UNI to Genesis and receiving ~$10.2M USDC in return.   9:55 PM - 12 Jul 2021           60                12              twitter.com    Igor Igamberdiev @FrankResearcher    1/3  Looks like Larry Sukernik, one of the multi signers behind the $20M DeFi education fund, dumped UNI five hours before the $10M OTC sale. https://t.co/JWlxZC2L4Q   12:23 PM - 13 Jul 2021           220                48            And while I can’t tell details while working at the Maker Foundation and previous blockchain career, you can probably guess there been countless broken promises and commitments when dealing with other entities, some even despite legal contracts. The truth is people are self-interested and usually so are their entities. If there’s no way to keep them accountable, they will take advantage of it. The issue is especially acute as DAO doesn’t have many ways to enforce such. And even if DAO can let’s say sue them, bringing lawsuit itself is difficult and expensive and can backfire in public sentiment (as they will portray themselves as “victims”). Therefore, while it’s good to see some are quite enthusiastic about initiatives, the governance might have an expensive lesson if not reviewed thoroughly. ",
                    "links": [
                        "https://twitter.com/fund_defi/status/1414704889897394178?s=20",
                        "https://twitter.com/fund_defi/status/1414704889897394178?s=20",
                        "https://twitter.com/GenesisTrading",
                        "https://twitter.com/fund_defi/status/1414704889897394178?s=20",
                        "https://twitter.com/FrankResearcher/status/1414923534019743758?s=20",
                        "https://twitter.com/FrankResearcher/status/1414923534019743758?s=20",
                        "https://twitter.com/FrankResearcher/status/1414923534019743758?s=20",
                        "https://t.co/JWlxZC2L4Q",
                        "https://twitter.com/FrankResearcher/status/1414923534019743758?s=20",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-150-thursday-july-15-17-00-utc/9331/3",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-8-15/9362",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-july-18th-2021/9479"
                    ],
                    "GPT-summary": "The author of the post discusses the importance of being strategic when implementing donation, grant, and liquidity programs in the Maker community. They provide an example of how the DeFi Education Fund sold a large portion of UNI despite committing not to dilute it right away and allocate it for 4-5 years. The author also mentions the issue of broken promises and commitments when dealing with other entities and the difficulty of enforcing accountability in DAOs. The post provides constructive criticism and an audit of the Maker community's initiatives.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "3",
                    "time": "13/07/2021-14:30:33",
                    "content": "As a popular saying goes, all that glitters is not gold. We should always think of the benefit as DAO and the beneficial as MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#3",
                    "likes": "7",
                    "time": "13/07/2021-14:59:16",
                    "content": "    Doo_StableLab:  The truth is people are self-interested and usually so are their entities.   “Show me the incentive and I will show you the outcome” - Charlie Munger In a DAO environment we need to think adversarily. Always assume  people will and are acting in their own self interest. Trust but verify. Vires in numeris. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#4",
                    "likes": "8",
                    "time": "13/07/2021-15:21:44",
                    "content": "    g_dip:  Always assume people will and are acting in their own self interest.   Yes, but additionally, we must strive to act in the interest of the greater good of the DAO. Defend the DAO against those that are self-interested, serve the DAO with integrity, honesty, and transparency. It’s easy to get too wrapped up in “DEFEND! DEFEND! DEFEND!” and forget about actually growing the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.064236111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#5",
                    "likes": "0",
                    "time": "13/07/2021-15:35:45",
                    "content": "Couldn’t agree more! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "4",
                    "time": "13/07/2021-16:02:44",
                    "content": "    Doo_StableLab:  I am seeing more and more Maker community members on the forum requesting more active donation, grant, and also liquidity programs. While they are good in theory, they have to be strategic.   So true–but the community is also lagging when it comes to providing Grants and  “keeping up with the Joneses” – right now AAVE is killing it:   aavenews.substack.com    Aave News: More Grants, Passing of the keys, and Stani Spills A recap of the Aave ecosystem, July 5th to July 11th 2021      Also, here’s why there is a lack of grants being distributed:   ",
                    "links": [
                        "https://aavenews.substack.com/p/aave-news-more-grants-passing-of"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.037414965986395
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#7",
                    "likes": "7",
                    "time": "13/07/2021-16:41:24",
                    "content": "Maker distributed millions in grants, hackathons, and events. The reason why the community is not aware of especially grantees is because many of them failed to gain traction and also many don’t even promote as such. For example, Pool Together which used to promote heavily that it’s supported by Maker doesn’t even list there anymore.  image1279×511 20.8 KB  It was an extremely unpopular opinion back in the Foundation, and it probably still is but I strongly believe Maker should invest rather than giving out blank checks in grants. Sure, it works out for some but investment is a better way to ensure the Maker community has influence over projects and also profit when they become successful. There are numerous DeFi protocols that Maker provided grant that released tokens and they could worth a lot but we didn’t enjoy such despite supporting early because it had no agreement like that. Now a bit less unpopular opinion is the Maker community really should revisit grant / hackathon and see what went well and what didn’t work. Because if not, we are just writing checks that are happy to switch to any others that provide better terms any second. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.923333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#8",
                    "likes": "6",
                    "time": "13/07/2021-20:58:01",
                    "content": "I would love to see both grants and strategic investments in other protocols. It would benefit MakerDAO to have a seat at the table of other important DeFi infrastructure and it is also good to have some grants for Public Goods. Of course, the grant should be vetted in order to make sure that the funds are not going to be misused. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#9",
                    "likes": "2",
                    "time": "13/07/2021-21:33:13",
                    "content": "I’m no expert but my understanding is that there are many intangibles to be gained with publicly advertised grants program. I see 2 big buckets: goodwill and exposure to incoming talent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#10",
                    "likes": "2",
                    "time": "13/07/2021-23:36:07",
                    "content": "I understand the desire to focus on Aave’s progress but let’s not forget that their governance is centralized and puppeteered by the Aave core development team, if not Stani. Anyone telling you otherwise is either uninformed or not telling the full story. Doing things in a decentralized, censorship-resistant way takes time and is frustrating no doubt, but let’s not permit the successes of a centralized team that hawks clearly regulated products financial products that would/should/do make regulators hair catch on fire (remember “Credit Delegation” ie, credit default SWAPS to retail on Twitter) to distract us from growing the DAO slowly. One of our missions of risk avoidance is to not create low hanging fruit for our friends at various three and four-letter governmental agencies. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.821428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#11",
                    "likes": "0",
                    "time": "14/07/2021-00:11:07",
                    "content": "Agreed. The issue is Maker has been funding public goods but then doesn’t have good ways to mitigate Free-rider problem (which arises in public goods in legacy economy as well). For example, if you look at highly celebrated grantees like Pool Together and Opolis, they started with Dai as only option after getting the grant but soon expanded to various stablecoins. And now USDC usage on their platforms are several times bigger than Dai. Of course, there are different ways to view this. Some can argue there are plenty of public goods that Maker system is also getting benefit without directly paying for. In addition, even if let’s say other stablecoins become dominant in grantee protocols, they still open up interesting opportunity for Dai. However, it is important to recognize the benefit of grants to Maker is not always straight forward and thus once again, crucial to review thoroughly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#12",
                    "likes": "1",
                    "time": "14/07/2021-00:18:10",
                    "content": "    Doo_StableLab:  there are plenty of public goods that Maker system is also getting benefit without directly paying for   I think Volmex creating a tokenized crypto volatility index that is 100% backed by DAI is a good case in point. As far as I know, MakerDAO did not contribute any funds to this endeavor but the product can grow DAI usage to be on par with the VIX in TradFi. I believe HanfleFi is also using DAI for their tokenized forex protocol. Something which I would like to see built in-house by MakerDAO, but it might save resources in redundancy if we actually made a strategic investment in its development. DAI could be enormous if it backs all DeFi forex trades. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#13",
                    "likes": "1",
                    "time": "14/07/2021-00:20:40",
                    "content": "While it’s good to discuss other governance/ protocols, I afraid the language is too harsh with criticizing AAVE team. We should respect other protocols and focus on objective discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#14",
                    "likes": "1",
                    "time": "14/07/2021-01:53:45",
                    "content": "    Tosh9.0:  I understand the desire to focus on Aave’s progress but let’s not forget that their governance is centralized and puppeteered by the Aave core development team, if not Stani. Anyone telling you otherwise is either uninformed or not telling the full story.   I mean if you want to call other protocols centralized than yea–I agree–ALL DeFi protocols are currently centralized–50% of DeFi is composed/backed by USDC. But give credit where credit is due. AAVE is doing well. Can’t take that away from them. Decentralized or not. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party giving feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.7875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#15",
                    "likes": "1",
                    "time": "14/07/2021-02:50:00",
                    "content": "Duly noted though I didn’t intend anything disrespectful. I have a lot of admiration for what they’ve done since the EthLend ICO and subsequent pivot (and I’ve used their protocol a ton in the past) though we shouldn’t kid ourselves that they operate in a decentralized fashion. You buy Aave, you are making a bet on Aave, Inc. to deliver on promises to accrue value in the token, and Stani and Co. are the team working behind the scenes to vote in what they want. There is nothing wrong with that;  it is simply a less risk-averse approach to regulatory developments than we are accustomed to here. NB: marketing/pumping things like credit delegation swaps to retail on Twitter rubs me the wrong way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.4861111111111107
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#16",
                    "likes": "1",
                    "time": "15/07/2021-18:25:23",
                    "content": "    Doo_StableLab:  While it’s good to discuss other governance/ protocols, I afraid the language is too harsh with criticizing AAVE team. We should respect other protocols and focus on objective discussion.   I see AAVE as the easiest way for retailers to issue IADs. I use it at Polygon for this. While still earning interest on the asset I am giving in gerentia. That’s great ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-54/9437"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#17",
                    "likes": "0",
                    "time": "15/10/2021-00:25:34",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}