{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ses-biweekly-status-update-ses-legal-research/16017",
            "title": "SES Biweekly Status Update - SES Legal Research ",
            "index": 16017,
            "category": [
                "Core Units",
                "Sustainable Ecosystem Scaling"
            ],
            "tags": [
                "core-unit",
                "ses-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SESLegalResearch",
                    "index": "#1",
                    "likes": "9",
                    "time": "24/06/2022-12:48:32",
                    "content": "Progress Update on SES Legal Research Projects SES Legal Research is presenting a summary on the progress made on some of the current legal projects. TL;DR In line with the SES Core Unit’s mandate to sustainably grow the Maker Protocol’s moats, SES Legal Research has been investing resources into a variety of high priority research projects aimed at improving the legal resiliency of the DAO. Today, we’re providing the MakerDAO community with an update, featuring:  The Self Insurance Fund (SIF) which has officially kicked off by conducting a feasibility study to assess legal risk exposure. We are asking for an active participation of @Recognized-Delegates and @Core-Facilitators​​ to gain valuable and well-rounded insights. The expansion and future of the SES Legal Research Team  The Self Insurance Fund The purpose of the Self Insurance Fund (SIF) is to cover potential legal and liability risks of permanent Contributors, Delegates and other important stakeholders of MakerDAO. In preparation for the kick-off of the first phase of this initiative, SES Legal Research announced the creation of a survey which is being sent to selected stakeholders of the DAO to evaluate the potential segments of insured persons and their respective legal risk exposure. On the SES Status Update call we will cover:  What a Self Insurance Fund is and why it is important for MakerDAO; Novel legal risks of engaging in a DAO and how a SIF can help; The role of the SIF in a comprehensive legal risk mitigation strategy for MakerDAO; Ongoing survey for assessing legal risk exposure of MakerDAO stakeholders. Permanent contributors, facilitators and delegates are invited to participate!  The Expansion and Future of the SES Legal Research Team SES welcomes @Balloonist as a new incubee, who will focus on building legal and regulatory resiliency for MakerDAO. Balloonist will join @layerzero and @Astrogator  in @SESLegalResearch research, a specialized team in SES focused on legal and regulatory topics. As part of their ambition to further decentralize its operations, SES plans to potentially spin-off the legal team in the future. With a background from a tier-1 law firm and most recently 3,5 years with the Danish Financial Supervisory Authority as a regulator, Balloonist has been drafting regulation on the crypto-area and has a deep knowledge about off and on-site inspections in financial institutions and how regulators assess risks. Balloonist is currently working on identifying and documenting MakerDAO’s key challenges on the regulatory side. Next steps We are looking for @Recognized-Delegates and @Core-Facilitators ​​ to fill in our risk assessment survey. If you are interested in participating, please contact @layerzero. To get even deeper insights into the projects and meet the legal research team, make sure to join the upcoming MakerDAO SES Status Update Call today, June 24th at 4:30pm CEST. Thank you for your interest. We are excited to continue working on high priority legal projects and the value they will deliver to the DAO. As always, we welcome your feedback and look forward to the discussion. Best, Your SESLegalResearch Team  @layerzero @astrogator @balloonist ",
                    "links": [
                        "https://forum.makerdao.com/t/self-insurance-fund/10563",
                        "https://forum.makerdao.com/t/self-insurance-fund-update/15943",
                        "https://www.crowdcast.io/c/ses-biweekly-status-update-6",
                        "https://www.crowdcast.io/c/ses-biweekly-status-update-6",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.855199049316696
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#2",
                    "likes": "1",
                    "time": "28/06/2022-12:57:47",
                    "content": "Is a recording of this call available? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SESLegalResearch",
                    "index": "#3",
                    "likes": "1",
                    "time": "28/06/2022-14:39:07",
                    "content": "Hello Kianga! We are rendering the video and will send the link as soon as is ready. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "0",
                    "time": "28/06/2022-16:05:46",
                    "content": "Great news, kindly post it here when ready. Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/07/2022-16:06:09",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}