{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/doo-thoughts-as-a-hawk-delegate/16453",
            "title": "Doo_Thoughts as a Hawk Delegate ",
            "index": 16453,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#1",
                    "likes": "9",
                    "time": "08/07/2022-17:12:40",
                    "content": "Disclaimer: This is my personal view and not representing all of other Hawks’ views. 4 months ago, I made a post calling for a responsible budget and process, which was echoed by various posts before and after this post. Whether the market is in bull or not, many community members were alarmed by the rapid increase in budget spending, and urged the governance to reconsider such increases. Unfortunately, we were in minority voting, as evidenced by most budget increases passing eventually. As the bear market becomes more severe and the Maker protocol’s income rapidly decreases, the community including many delegates are more willing to adjust budgets. Already several community members have made both informal and formal proposals to adjust budgets. Adjusting a budget is inherently difficult as it impacts contributors and initiatives. However, hawks arguing for cuts are not campaigning for such out of ignorance as some suggested. Resources are finite and without proper accountability, the protocol will not have enough resources to allocate to crucial initiatives. If the protocol runs out of treasury, MKR will need to be diluted and if that’s not sufficient and the protocol bankrupts, there won’t be a way to support the contributors. And many contributors at least will be able to move to different jobs as former Maker experience is highly sought after. But for MKR holders, after the protocol bankrupts, they will be holding tokens that are virtually worthless. I believe doves and hawks fundamentally agree on many points as both try to avoid the above situation and ensure the protocol is healthy and efficient. Therefore, while some might be more leaning in one way, I am confident that there are enough minds on both sides to make compromises and have civil discussions. ",
                    "links": [
                        "https://forum.makerdao.com/t/cu-budget-reduction-initiatives-wiki-summary/16448",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-7-13-de-julio-del-2022/16740",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-julio-del-2022/16629",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/5",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/4"
                    ],
                    "GPT-summary": "The author of the post is explaining their personal view on the need for responsible budgeting in the Maker protocol. They discuss the potential consequences of overspending and the importance of accountability. The post also extends an invitation for civil discussion and compromise between those who may have differing opinions on the matter. A 3rd party could provide constructive criticism, extend to the proposal, or audit and review the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.505645161290323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/07/2022-17:25:40",
                    "content": "    Doo_StableLab:  Therefore, while some might be more leaning in one way, I am confident that there are enough minds on both sides to make compromises and have civil discussions.   Agreed. Civil discussion is the way and I am more of an eagle myself anyway. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.875
                }
            ]
        }
    ]
}