{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - U-DROP (Untangled Finance DROP) - July 19, 2021",
            "index": "9167",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "29,884",
            "highest_fraction": 0.85
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip6-application-untangled-finance-drop-u-drop-diversified-trade-finance-fund/9167",
            "title": "MIP6 Application - Untangled Finance DROP (U-DROP): Diversified Trade Finance Fund ",
            "index": 9167,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Manrui_Untangled",
                    "index": "#1",
                    "likes": "8",
                    "time": "04/07/2021-17:52:54",
                    "content": " Untangled Finance DROP (U-DROP): Diversified Trade Finance Fund This MIP6 Proposal will finance a special purpose vehicle (“SPV”) established by Untangled Finance or affiliates thereof (the “Issuer”) to acquire Trade Finance (TFA) Assets. Untangled will make use of Centrifuge’s model.  Summary   UP Series LLC is a Digital Credit Fund set up by Untangled Finance, a digital securitisation platform. We partnered with Centrifuge as our technical infrastructure provider.   The Series will be set up to invest in Trade Finance Assets (TFA). TFA are short term, self-liquidating invoice-based financing in both domestic and cross border trade. TFA traditionally has a very low default rate.   TFA Series will invest in TFA from multiple asset originators. 3 originators have signed up to supply assets to the Fund. They have good underwriting records with zero default rate to date. All asset originators are subject to due diligence by Untangled and all due diligence material will be disclosed with the Maker RWF CU.   UP Series LLC has developed a rigorous risk management framework:  Asset originator’s participation in Junior token is determined by institutional-grade reserve methodology developed by rating agencies. Credit insurance will be applied where possible. The credit insurers will take the first loss in case of default.    Substantial benefits for investors:  Maker  An ‘abstraction layer’ - Maker Governance won’t need to deal with individual asset originator’s applications → improve turnaround time Scale up real-world adoption of Dai with proven, institutionally recognised structure and methodologies   Senior Investors (including Maker)  Diversification - avoid over concentration in a single originator, geography, borrower segment and collateral type Safety - institutional-grade risk management framework consisting of 3 layers: credit insurer, junior participation and (in the case of Maker) over collateralisation of the DROP senior tranche in exchange for Dai Transparency: daily on-chain portfolio performance tracking Premium returns over equivalent investments       1.Who is the interested party for this collateral application? The Issuer, UP Series LLC, set up by Untangled Finance, is represented by Quan Le (untangled, or [email protected], CEO at Untangled Finance) and Manrui Tang ([email protected], COO at Untangled Finance). The issuer will source and manage TFA assets. It will create and own non-fungible tokens (“NFTs”) representing each TFA asset in the pool. It will lock their NFT’s into the Tinlake protocol to serve as collateral. The issuer will pool its assets and offer ERC-20 tokens to investors, specifically DROP Tokens & TIN Tokens. Centrifuge is providing the technology and framework for bringing real-world assets to MCD. The main contact on Tinlake for the application is Martin Quensel, [email protected]) of Centrifuge as well as Colin Cunningham ([email protected]).   Provide a brief high-level overview of the project, with a focus on the applying collateral token  Untangled Finance, the Issuer/Asset Manager will originate new trade finance assets and use the Centrifuge’s model to use MCD as a liquidity provider to. 2.1 Collateral/Assets  Trade finance assets secured by accepted invoices, inventory or revenues Asset term: Self-liquidating in 30 to 180 days Legal form: Accepted invoices, Promissory notes, Supply chain loans Security: Credit Insured where possible Default history: less than 0.5%  Trade finance gives investors access to a USD 15 trillion marketplace. This market has until recently been dominated by commercial banks. New regulations, however, have reduced their ability to meet demand. This has opened a window of opportunity to non-banking investors who want to enter a stable, well-established market that shows limited correlation to traditional credit classes. With a financing gap of USD 3.4 trillion (USD 1.5 trillion pre COVID), the opportunities are abundant. In the current low-interest rate environment, there is growing demand for trade finance loans amongst institutional investors. This is also due to its efficient return on capital and low default history. When accessed in a robust and diversified way, and where care is taken to limit possible idiosyncratic or volatile risk factors such as commodity price risk, we believe it can be a powerful diversifier as part of a traditional credit allocation. As an investment, trade finance loans exhibit a number of attractive characteristics. They offer a yield pick-up over other liquid credits and are very efficient from a solvency capital perspective. With most of such loans being self-liquidating (when invoice receivers pay, revenue collected through secured cash collection account), short-dated, and often secured, the asset class also offers protection against default risk and market risk should the cycle turn. Trade finance can also provide an effective platform to realize responsible investment objectives. Asset selection: Only assets that fit certain criteria e.g. amount, duration, borrower type, credit rating etc will be selected to the pool. This is to further ensure no over concentration of borrower exposures, making the pool more diversified. 2.2 Pool Structure: Untangled Finance has structured the pool to initially reflect a 90% vs 10% allocation to Drop & Tin, respectively. We structured the pool to ensure that there is sufficient coverage from Tin for the Drop tranche based on the characteristics of the underlying asset pool e.g. historical loss, average asset size, initial pool size for each asset originator selected to the pool.  960×540 49.4 KB  (1) Asset originator/lending partner makes an advance to a borrower. (2)The asset originator accumulates a pool of assets then sells it to UP Series LLC. (3) UP Series LLC issues DROP to investors according to the proposed parameters*. (4) The proceeds from investment will then be used to pay the asset originator. (5) At the end of the asset term, the obligor/borrower repays the asset plus interest into a bank account of a SPV that is separate from the originator’s bank account. (6) The SPV converts the money in its bank account to Dai to pay investors back principal plus interest. 2.3 TIN portion Asset originators will participate in the higher risk part (called TIN, the ‘junior tranche’ or 3(b) in the diagram above). Because of this risk sharing by asset originators, there’s lower risk to investors if a borrower defaults. If this does happen, investors will be repaid (plus interest) before the asset originator’s share (Step (7) in the diagrams above). 2.4 Pool pricing The pricing of the pool (DROP fixed APR) is determined by the yield of a debt instrument with an equivalent credit rating plus a premium. 2.5 Pool monitoring Asset originators are subject to rigorous due diligence before on-boarding (a copy of DD reports will be shared with Centrifuge and the RWF CU of Maker). Once onboarded, asset originators need to fulfil daily reporting requirements via an API connection with the Untangled Platform (UP). It is possible to relevant legal clauses to automatic notification triggers on reporting covenants such as ratios of past dues, advance rate,  3. Provide a brief history of the project 3.1 Untangled Finance Untangled Finance, through UP Series LLC, is a digital credit fund focusing on bridging real-world assets to DeFi and doing so at scale. Our objective is to source a diversified asset portfolio that offers, at scale, strong returns, low risk and broaden access to asset classes that are traditionally reserved to institutional investors We are specifically focusing on the following asset classes:  Supply chain trade finance (this application) Green asset securitisation and green bonds issuance. SME Financing  Each asset class will be covered in a separate application. TFA opportunities differ widely in terms of complexity, and investors need to understand the true risk drivers behind the attractive returns. Untangled has spent a considerable amount of time assessing the market and possible entry points. We are confident that the strategy we offer benefits from the attractive aspects of the asset class, whilst limiting much of the downside. Trade finance differs from traditional corporate loan funds because they focus on specific sales, whereas normal corporate credit tends to be non-specific in terms of the use of funds. The financing of a specific sales contract rather than lending to a corporate is really the key to why trade finance consistently outperforms credit. Our strategy differs from other trade finance funds in the market both in its underlying philosophy and in its investment process. Portfolio construction is aimed at properly diversifying risk whilst still allowing for a robust analysis of each transaction on responsible investing and compliance due diligence criteria. We aim for a highly diversified portfolio in terms of geography, industry, and counterparties, which we regard as defensive in times of geopolitical uncertainty. We use an integrated approach to rating and risk analysis that builds off Untangled Finance’s significant expertise in credit, supplemented by advanced credit analytic models. We set out the vision of tokenizing supply chain trade finance in this whitepaper Key features of the Untangled Platform (UP)  1600×927 146 KB  UP is a one-stop shop for alternative lenders looking to raise funds and for investors to access alternative investment opportunities traditionally reserved for institutional investors. UP bridges real-world assets and DeFi. Untangled Platform is to integrate directly with Centrifuge’s smart contracts providing seamless user experience.  Originator On-boarding on Asset Tokenization  Once approved by a trusted third party, assets are tokenized as NFT/ ERC 721 tokens. Asset-level data templates are in accordance with European Central Bank. Consistent taxonomy and data representation enable meaningful comparisons for investors.  Structuring Digital Asset  Using UP to structure a conforming digital asset by assessing asset eligibility criteria to maximise funding and optimise costs of funds. Users can run scenarios to optimise funding parameters and link the parameters to legal documentation.  Investor On-boarding and Subscription  Investors are on-boarded to UP once they pass AML/KYC procedures appropriate for their jurisdictions. Legal agreements are drafted based on standard templates and executed digitally on the platform.  On-going performance tracking and investor reporting  Asset performance data such as repayment and an obligor’s finance position is dynamically updated to our platform via APIs. Issuers can set performance triggers based on smart legal clauses. Investors have access to a real-time reporting dashboard where they can track asset-level data and on-going performance updates. The Untangled Team: Untangled has used established market relationships and tapped top industry advisors to build the Untangled Team: Quan Le, Co-founder & CEO More than 20 years in technology development, commodity trading and yield farming (for rice in Africa), financial engineering. Co-founded Binkabi, blockchain-based commodity trading and financing platform in 2017 and Untangled, digital securitisation platform. Masters Degree of Applied Finance and Investment; ACA qualification Manrui Tang, Co-founder and COO 10+ year experience in blockchain, energy transition (to green), financial due diligence and M&A advisory. Co-founded both Binkabi and Untangled with Quan. Previously with PwC and National Grid (UK). Degrees from London School of Economics and Imperial College; ACA qualification. Tim Davies (Capital Markets, Structuring, and Securitisation Advisory. Investor) Over 25 years experience in securitisation with global financial institutions including RBC Capital Markets, RBS, Lloyds, and NatWest Markets).  Tim is recognised as a leading trade receivables funding expert, applying receivables financing techniques in the FinTech space over the past seven years to a variety of firms as a consultant and while at Demica, Demica Finance, NWM, and Blackstar Capital.  Undergraduate Degrees from University of Toronto and an MBA(Hon) from York University (Canada). 3.2 Originator selection Untangled Finance has partnered with a number of lending partners to originate the TFA assets globally. The following are in the initial batch of originators. The names of these and future originators will be revealed at a later date. U_Originator 1 Operating since 2016 in the Middle East, the company has helped small businesses that have limited/no access to bank finance with working capital lines in the form of invoice finance and vendor finance products. Within the e-commerce sector, the company has rolled out working capital solutions for marketplace sellers on Amazon (using the Fulfilled By Amazon model) and restaurants on food delivery apps such as Zomato, Talabat, Deliveroo. Based on revenue data on these platforms, the company makes short term, revolving credits, secured by future payments directly to the company’s bank account. To date, the company has funded over $15 million with zero loss. U_Originator 2 Here is an early payment company whose product allows suppliers to be paid early and buyers to extend their payment terms. Started in 2018 in Denmark the company is expanding to the Netherlands this year. The company was founded by an experienced team of business leaders, legal experts and software developers. The company’s credit exposures are 100% insured by Allianz (AA rated by S&P). To date, the company has funded less than $10 million with zero loss. U_Originator 3 Launched in 2016 by its experienced board (100% owners) who have financed the technology sector (hardware) for 20 years with relationships at owner or board level into the industry’s leading international distributors and vendors; The company achieved 150% YOY growth. It offers trade finance facilities of USD1-15m to long established, stable distribution companies with strong trading histories operating in the growth markets of the Middle East, Southern and Eastern Europe and Asia. To date, the company has funded over $100 million with zero loss. 3.3 About Centrifuge Centrifuge provides the infrastructure to allow transparent and secure onboarding of RWAs to MCD. New Silver 2 was the first asset originator to back DAI with RWA using the Centrifuge model. Untangled is one of many projects currently in the pipeline to help MakerDAO scale RWA backing to $300M by the end of 2021.  4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. Centrifuge’s mainnet deployment will be accessible via tinlake.centrifuge.io Technical documentation about Tinlake can be found here: GitHub - centrifuge/tinlake: bringing individual, non-fungible assets to DeFi Maker specific implementation here: https://github.com/centrifuge/tinlake-maker-lib 1 1  5. Link any available audits of the project. Both procedural and smart contract focused audits. Centrifuge has conducted several audits of its technology stack. The audits can be found here: https://github.com/centrifuge/security/tree/master/audits 2 1  6. Link to any active communities relating to your project.   Centrifuge Discourse Forum Maker Collateral Onboarding Calls: [1] , [2], [3], [4], [5], [6], [7 1] Untangled Linkedin   7. How is the applying collateral type currently used? The SPV will be financed by issuing DROP Tokens for 90% of the net asset value of the pool of NFTs plus cash on hand (collectively “Pool Valuation”) and TIN Tokens for 10% of the Pool Valuation. The Issuer will initially seek a 10 million DAI debt ceiling from MakerDAO, increasing to a 20 million DAI over the next 6-12 months. We expect to fill up this initial 10 million dai within 6 months based on our existing pipeline with our lending partners. The Issuer expects to invest in TFA assets that are typically less than 6 months. Upon the self liquidation of TFA assets, the Issuer will repay the outstanding balance drawn against the NFT and accrued interest thereon.  8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? Legal Setup Untangled Finance will form its own SPV (UP Series LLC) for the acquisition of TFA assets. The SPV will enter into a service agreement with Untangled Finance Limited to get support from Untangled Finance while using Centrifuge’s open and decentralized infrastructure. The SPV will tokenize the titles of each of its TFA Assets into NFTs and will add those NFTs to Tinlake as collateral. The SPV will utilize Tinlake to issue U-DROP and U-TIN backed by the pool of NFTs that are locked in Tinlake. Untangled Finance’s lending partners will retain the U-TIN tokens and will lock the U-DROP tokens into a MakerDAO Vault. Please find the documentation to the two-tranche structure here. This legal setup is very commonly used in the traditional financial system: The collateral for the individual assets are assigned to a legal entity, the “special purpose vehicle” and lenders get an ownership interest in the entire portfolio of this entity (with this entity the assets are in an a bankruptcy-remote structure that is not influenced by the Asset Originators) and provides the necessary support to ensure that anyone that owns a DROP token has a legal claim to the underlying assets.  9. Where does exchange for the asset occur? The SPV enters into a subscription agreement with lenders who receive DROP from the SPV in turn for providing DAI. The DROP token can be redeemed against the cash flows of the underlying collateral directly from the SPV by any DROP holder. This is ensured by the Tinlake smart contracts and is the primary way for interacting with these tokens.  (Determined by Legal Domain Team) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  First, the issuance of DROP and TIN tokens is handled via Tinlake, with AML/KYC procedures and compliance with US securities guidelines. Investors based in the US must be accredited investors (generally defined as having a net worth of at least $1 million). The offering structure overview and legal templates can be found here 1.  11. (Determined by Legal Domain Team) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. The issuance of DROP and TIN tokens is handled via Tinlake, with AML/KYC procedures and compliance with US securities guidelines. Investors based in the US must be accredited investors (generally defined as having a net worth of at least $1 million). The SPV issues DROP tokens for the Maker vault.  12. (Optional) List any possible oracle data sources for the proposed Collateral type. The Issuer will provide daily NAV updates for each underlying TFA asset, which will be used to value the NFTs. If an updated NAV submitted by the Issuer shows a decrease in the total expected value of an underlying TFA asset, then the value of the NFT will be marked down. If, as a result of such mark down, the outstanding value of the DROP Tokens increases to more than 90% of the Pool Valuation, then Tinlake will lock the Issuer from drawing any further Dai and will lock the TIN investors from redeeming. The Issuer may restore balance and unlock Tinlake by: (1) buying additional TIN tokens so that the proceeds will increase the cash reserve in an amount necessary to cause the value of outstanding DROP Tokens to be no more than 90% of the Pool Valuation or (ii) redeem DROP Tokens in an amount necessary to restore the value of outstanding DROP Tokens to no more than 90% of the Pool Valuation.  13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. Bankruptcy protection: even if the originator goes out of business, the loans are still safe as borrowers make repayment directly to the SPV’s bank account. We propose a Maker participate of up to 75% of DROPwith the remainder being provided by direct DROP investors  960×540 40.3 KB  From an overall pool perspective, Maker gets four buffers of safety:  Credit insurance on most assets with payout at 90% first loss 10% TIN tranches held by Asset Originators, Untangled and Centrifuge DROP co-investors, who share Maker interests DROP over-collateralisation i.e., 105 U-DROP for 100 DAI  Note: Opportunities only available to accredited and professional investors. ",
                    "links": [
                        "https://forum.makerdao.com/t/poll-rwa-working-group-centrifuge-model/4381",
                        "https://iccwbo.org/publication/icc-trade-register-report/#1550486691378-3a223d05-6e5e",
                        "https://untangled.finance",
                        "https://untangled.finance",
                        "https://untangled.finance",
                        "https://untangled.finance",
                        "https://untangled.finance",
                        "https://forum.makerdao.com/t/poll-rwa-working-group-centrifuge-model/4381",
                        "https://iccwbo.org/publication/icc-trade-register-report/#1550569973752-8879717c-dbf5",
                        "https://untangled.finance",
                        "https://library.iccwbo.org/content/tfb/pdf/2019-icctraderegisterreport.pdf",
                        "https://drive.google.com/file/d/16NHTYt9ogGYZB6Nvv___nykUgiaYxvao/view",
                        "https://www.ecb.europa.eu/paym/coll/loanlevel/transmission/html/index.en.html",
                        "https://untangled.finance",
                        "https://www.allianz.com/en/investor_relations/bonds/rating.html",
                        "https://tinlake.centrifuge.io/pool/0x53b2d22d07E069a3b132BfeaaD275b10273d381E/new-silver-2",
                        "https://tinlake.centrifuge.io/pool/kickfurther-1",
                        "https://github.com/centrifuge/tinlake",
                        "https://github.com/centrifuge/tinlake-maker-lib",
                        "https://github.com/centrifuge/security/tree/master/audits",
                        "https://discourse.centrifuge.io/",
                        "https://www.youtube.com/watch?v=336RkUuI6hA&t=4s",
                        "https://www.youtube.com/watch?v=3WyBwisQggk&t=10s",
                        "https://www.youtube.com/watch?v=PmUd5Ua6UJ4",
                        "https://www.youtube.com/watch?v=x44aQJEWpEQ",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-8-centrifuge-6s-capital-wednesday-september-16-17-00-utc/4062/3",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-13-consolfreight-wednesday-october-28-17-00-utc/4839",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-15-paperchain-wednesday-november-11-18-00-utc/4983/2",
                        "https://www.linkedin.com/company/untangled-finance/?viewAsMember=true",
                        "https://developer.centrifuge.io/tinlake/overview/tranches/",
                        "https://docs.centrifuge.io/tinlake/further-information/offering-structure/",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-34-untangled-friday-july-30-4pm-utc/9527",
                        "https://forum.makerdao.com/t/maker-relay-ep-54/9437",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/untangled-finance-collateral-onboarding-risk-evaluation/12006",
                        "https://forum.makerdao.com/t/maker-relay-ep-54-en-espanol/9476",
                        "https://forum.makerdao.com/t/rwf-ask-me-anything-september-2021/10234/7",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-07/9658",
                        "https://forum.makerdao.com/t/maker-relay-ep-55/9531",
                        "https://forum.makerdao.com/t/the-arranger-model-a-highly-scalable-rwa-framework/11298/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.473004134313658
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benjaminjwhitby",
                    "index": "#2",
                    "likes": "2",
                    "time": "12/07/2021-14:30:40",
                    "content": "Great platform.  Take a look @Gustav_Arentoft ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "1",
                    "time": "21/07/2021-09:17:47",
                    "content": "This application has been put up for a poll, but I see there has been no discussion about it here on the forum. Could the people that voted maybe say a few words about why they voted the way they did? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#4",
                    "likes": "0",
                    "time": "30/07/2021-15:55:02",
                    "content": "Hopefully the call today will get some engagement, starts in 5 minutes for those that are curious!     Collateral Onboarding Call #34: Untangled - Friday, July 30 4PM UTC Collateral Meetings   Collateral Onboarding Call #34: Untangled - Friday, July 30 4PM UTC  [image]  Time in your local-timezone format:  2021-07-30T16:00:00Z (UTC)  Mark it on your Google Calendar! Dial In Details Zoom call  Passcode: RWA-WG   Intro An open discussion where we discuss projects and potential assets for MCD, open for anyone to join.  If you’d like to present, check out this thread.   Agenda Intro by @JuanJuan  Presentation by @Manrui_Untangled Untangled Finance DROP (U-DROP): Diversified Trade Fin…     ",
                    "links": [
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=Mjlrb3A3Y21jZDFxZTd2aXFlbWF1cjBqN3QgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/88508073720?pwd%3DR1FiRCtKK0hIVGJyMlpiekZIelY2Zz09&sa=D&source=calendar&usd=2&usg=AOvVaw2bZFk9OiwA_yeyeiUyPYwE",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/",
                        "https://forum.makerdao.com/u/juanjuan",
                        "https://forum.makerdao.com/u/manrui_untangled/summary",
                        "https://forum.makerdao.com/t/fortunafi-external-audit-report-by-luca-prosperi/10363/18"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Harlock",
                    "index": "#5",
                    "likes": "1",
                    "time": "23/03/2022-02:03:24",
                    "content": "What is the latest status of this matter? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#6",
                    "likes": "2",
                    "time": "23/03/2022-07:47:38",
                    "content": "A risk assessment was published in December. MKR holders haven’t yet been allowed to vote on it as there is no Smart contract and Oracles assessments (both being formalities for such a RWA). It is unlikely to move anywhere. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-emerging-markets-green-opportunity-financing-for-atd-combustors-egyptian-power-plant-efficiency-projects/14489/44"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.988095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#7",
                    "likes": "0",
                    "time": "23/03/2022-10:47:45",
                    "content": "Do we know why? Was it forgotten by accident? Or is it soon? Thank you  @Oracles-Core-Unit @Protocol-Engineering ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Manrui_Untangled",
                    "index": "#8",
                    "likes": "1",
                    "time": "23/03/2022-11:07:00",
                    "content": "Hello @Harlock @SebVentures @Puzzler, thank you for asking. Please refer to @teej ’s Risk Assessment on Untangled Finance Untangled Finance - Collateral Onboarding Risk Evaluation. Our MIP21 adapter and related smart contracts are ready to be reviewed. We are waiting to hear back from @williamr regarding tech integration next steps. We will update the community when there is progress . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.414285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#9",
                    "likes": "3",
                    "time": "23/03/2022-12:41:48",
                    "content": "For context, I did a preliminary high level review of the technical setup of Untangled Finance to understand how it works. My initial impression is that the implementation mimics that of the Centrifuge RWA Vaults, as it uses MIP21 as a “sandbox” coupled with a MIP22-like liquidation system implemented in an overarching “manager contract” instead of the traditional Input and Output Conduits (see https://github.com/untangledfinance/untangled-maker-lib/blob/main/src/contracts/MakerLib.sol), which aims to automatically pay back the RWA Urn in case of default. Note, the liquidation system is not directly integrated into the Maker Protocol, and thus from the perspective of Maker the setup is still a MIP21 that relies on “dummy” token as collateral in the Maker system, with a DS Value as price Oracle and, if needed, manual liquidations triggered by Maker Governance. My initial impression is therefore that from a technical POV this implementation is similar in risk as the existing Centrifuge vaults, however a more in depth technical analysis of the provided smart contract is required to confirm this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.34345238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#10",
                    "likes": "2",
                    "time": "23/03/2022-13:10:28",
                    "content": "    Puzzler:  Do we know why? Was it forgotten by accident? Or is it soon?   Take a look at the RWF methods for analyzing RWAs–this Vid might help with some of your RWA questions: Skin in the Game ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/quntangled",
                    "index": "#11",
                    "likes": "2",
                    "time": "23/03/2022-15:41:53",
                    "content": "Thanks @lollike for providing the context. For anyone who is new to RWAs within DeFi we thought it might be helpful to further clarify the nature of the collateral token. The collateral token, referred to as SOT in our platform, represents the senior tranche of fractional interests from underlying assets of an asset pool. Each underlying asset is represented on chain with an NFT. They are then put into a pool (with specific contract address) from which the SOT token is issued. There are legal contracts and structure that bind the token to legal rights relating to the underlying assets, in the case of a pool liquidation. From a crypto-native’s standpoint, the collateral token may be regarded as ‘dummy’ but you could speak in the same way for any RWA-related token. What we have here is the ability for any token holder, Maker community included, to track onchain performance of underlying asset NFTs ‘backing up’ SOT, the collateral token. Coupled with the ability to enforce legal rights in liquidation events, the token represents a viable bridge between RWA and DeFi. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5852272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#12",
                    "likes": "1",
                    "time": "23/03/2022-15:47:26",
                    "content": "Just to clarify, the dummy token does not refer to any token by Untangled Finance, rather the dummy token (similar to RWA-001 for 6s) is the one that will be onboarded into the Maker Protocol to handle the internal accounting allowing Untangled Finance to draw Dai. The SOT token as I understand the proposed setup would not be onboarded directly into the Maker Protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Manrui_Untangled",
                    "index": "#13",
                    "likes": "6",
                    "time": "20/04/2022-23:00:44",
                    "content": "Hello everyone, Untangled’s MIP6 at its current form does not meet Maker’s new criteria for an arranger. We will therefore withdraw this application. We will come back with alternative ways of working with Maker. Best wishes Manrui ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.420454545454546
                }
            ]
        }
    ],
    "group_index": "3876"
}