{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/gusd-collateral-onbording-risk-evaluation/4791",
            "title": "[GUSD] Collateral Onbording Risk Evaluation ",
            "index": 4791,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "risk-domain-work",
                "gusd"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#1",
                    "likes": "5",
                    "time": "19/10/2020-11:47:27",
                    "content": "Legal Disclaimer: This communication is provided for information purposes only. This communication has been prepared based upon information, including market prices, data and other information, from sources believed to be reliable, but Maker has not independently verified such information and makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only, and do not constitute any recommendation for any action or an offer to provide investment advisory services. This content is not directed at nor intended for use by the MakerDAO community (“MakerDAO”), and may not under any circumstances be relied upon when making a decision to purchase any other digital asset referenced herein. The digital assets referenced herein currently face an uncertain regulatory landscape in not only the United States but also in many foreign jurisdictions, including but not limited to the UK, European Union, Singapore, Korea, Japan and China. The legal and regulatory risks inherent in referenced digital assets are not the subject of this content. For guidance regarding the possibility of said risks, one should consult with his or her own appropriate legal and/or regulatory counsel. Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any decision. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others.  Summary Proposed Risk Parameters Overview Metrics and Analysis Risk Parameters  Summary Proposed Risk Parameters GUSD Risk Premium: 4% Liquidation Ratio: 101% Debt Ceiling: 5 million Auction Lot Size: 50,000 Minimum Bid Increment: 3% Bid Duration: 6 hours Max Auction Duration: 6 hours Liquidation Penalty: 13% Dust: 100 Dai Overview Metrics and Analysis Supply & Market Share GUSD achieved its ATH of ~96m in circulating supply during Dec 2018 and Jan 2019, after which the supply started to contract, reaching its low in late Dec 2019 at ~3.75m GUSD. Nevertheless, the asset managed to attract new demand and is growing since. Today, the circulating supply is above 14m GUSD and has been growing with an average monthly growth rate of 18.6% in 2020. Chart1200×742 22.9 KBChart1200×742 22 KB Source: CoinMetrics Even though the supply is growing rapidly, other USD nominated stablecoins issued on Ethereum are growing with a higher rate, resulting in GUSD losing its already small market share. Considered assets are USDC, USDT (ETH), TUSD, PAX, BUSD and HUSD. Chart1200×742 26.9 KB Source: CoinMetrics & Coingecko (for TUSD) Price Volatility Given that GUSD lacks secondary markets, as there are very few in existence outside of Gemini Exchange, the price pattern is potentially questionable as it is not clear how and from which markets it was constructed. We relied on sources available to us, and the data differs quite a lot between them (CoinMetrics, Coingecko and CoinMakerCap). What is common to all data sources is that the asset is abnormally volatile for a stablecoin. Below is the price data presented by CoinMetrics for 2020. As visible, the asset experienced several divergences from the peg in both directions, sometime well over 5%. Please note that due to lack of GUSD/fiat/stablecoin pairs, the price is most likely calculated via ETH and BTC pairs, which is likely the reason for such high price divergence for a stablecoin. Chart1200×742 30.2 KB Source: CoinMetrics As visible below, the daily volatility of GUSD for 60d, 90d and 180d time periods is magnitudes greater than any comparable centralized USD on Ethereum. 1200×845 103 KB Source: CoinMetrics Daily Volume Traded GUSD has very small trading volume, not considering Gemini itself, as it is technically not GUSD anymore once deposited onto exchange. As mentioned above, there is a lack of secondary markets for GUSD. Among CEX venues, the most reputable ones are Bitfinex and OKEx. Historically speaking the OKEx is known for false reporting of trading activity and the risk team was applying large haircuts (90%) for mentioned exchange when considering it for weighted volume calculations inclusion in the past. Luckly, Curve launched a new metapool including GUSD, which is currently the largest and main secondary trading venue for GUSD besides Balancer, which is further explained in the next section. Below is the chart of GUSD trading volume on CEX, including Bitfinex USD and OKEx USDT and BTC pairs with no haircut. Chart1550×958 93.3 KB Source: CryptoCompare As visible, the majority of CEX trading activity is conducted on OKEx, which is very unreliable and most likely vastly over reported. Presence in open finance Among DEX/Non-custodial trading venues, GUSD was historically not present at all, or with economically meaningless trading activity. On Uniswap v1 and Kyber, GUSD was never traded, Uniswap v2 saw less than $7k trading volume in total. In late Sep, a single ETH account created three Balancer pools; (GUSD-WETH, 50/50) with ~$20k pool liquidity, (GUSD-WETH-WBTC, 33/33/33) with ~$1m pool liquidity and (GUSD- and 6 DeFi tokens) with ~$1m liquidity. In the first pool, he/she remains the only LP and in the second, he/she still dominates with 95.4% ownership and 99.6% in third. Combined trading activity on two Balancer pools, excluding WETH-WBTC trades amounts to ~$40k since inception. Above mentioned Curve GUSD metapool (GUSD-3pool LP) was incepted on Oct 7. The pool currently holds almost 3m or ~20% of total GUSD supply and has seen ~3m trading volume for trades including GUSD. There are more than 50 LPs in the GUSD Curve pool and ownership is distributed. GUSD is not present on any popular non-custodial lending & margin venue such as Compound, Aave or others. Among CeFi lending services, GUSD is present on BlockFi and Celsius. On-chain Transactions & Adjusted Transfer Value On-chain transaction volume in native units is correlated with circulating supply, average daily adjusted transfer value in 2020 was 696k GUSD. The average daily transaction count in 2020 was 91. Due to newly established trading venues on Balancer and Curve, these figures are expected to increase. Chart1200×742 23.6 KB Source: CoinMetrics Regulatory & Counterparty Risk  Issued and operated by Gemini Trust Company, LLC. Fiat funds are held by State Street Bank and Trust Co.  Oracles and Liquidations  Despite GUSD abnormal volatility (probably due to lack of stablecoin/fiat trading pairs), we recommend price fixation to 1$ and disabled liquidations. GUSD and Gemini are one of the most transparent and regulatory compliant financial institutions in crypto.  Risk Parameters GUSD Risk Premium: 4% Liquidation Ratio: 101% Debt Ceiling: 5 million Auction Lot Size: 50,000 Minimum Bid Increment: 3% Bid Duration: 6 hours Max Auction Duration: 6 hours Liquidation Penalty: 13% Dust: 100 Dai We recommend equal risk premium and liquidation ratio to other comparable assets in Maker’s collateral portfolio, which were decided by the governance; risk premium of 4% and liquidation ratio at 101%. The legal risk is comparable to other assets and addition of GUSD will potentially diversify the counterparty risk for stablecoins, which is the main reason for asset inclusion. Due to low supply of GUSD, we recommend an initial debt ceiling of 5m (~35% of total). We expect a potential increase in demand for GUSD in various applications and markets across the DeFi ecosystem, we recommend increasing the debt ceiling accordingly with real demand for dai issuance and demand for the asset in the wider ecosystem. Lead Researcher: Marko Stemberger Sources:  CoinMetrics; https://coinmetrics.io/; Oct 2020 Uniswap Info; https://info.uniswap.org; Oct 2020 Pools FYI; https://pools.fyi/#/; Oct 2020 CryptoCompare; https://www.cryptocompare.com/; Oct 2020 Etherscan; etherscan.io; Oct 2020 Curve; Curve.fi; Oct 2020 CoinGecko; https://www.coingecko.com; Oct 2020  ",
                    "links": [
                        "https://etherscan.io/tx/0xf100903fdf2461ad325553ada8f4d487f2a9762d64ce57c396f54ccd114064fa",
                        "https://etherscan.io/tx/0x0172faa7b7c21f67d6c4af26ae88288364c77b9c768b168ca117328e0d9c9818",
                        "https://coinmetrics.io/;",
                        "https://info.uniswap.org",
                        "https://pools.fyi/#/;",
                        "https://www.cryptocompare.com/;",
                        "http://etherscan.io",
                        "http://Curve.fi",
                        "https://www.coingecko.com",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-115-thursday-october-22-16-00-utc/4757/2",
                        "https://forum.makerdao.com/t/psm-gusd-a-collateral-onboarding-risk-evaluation/11559",
                        "https://forum.makerdao.com/t/uni-v2-gusd-dai-mip6-collateral-onboarding-application/7059",
                        "https://forum.makerdao.com/t/maker-relay-ep-21-en-espanol/5199",
                        "https://forum.makerdao.com/t/maker-relay-ep-21/5181",
                        "https://forum.makerdao.com/t/informal-poll-curve-basepool-composition/15347",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-115-thursday-october-22-16-00-utc/4757/5",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/41"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.160085285085286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#2",
                    "likes": "4",
                    "time": "19/10/2020-16:14:42",
                    "content": "Looks good to me. If the aim is to diversify stablecoin exposure, both SF and liquidation ratio need to be kept competitive to other stablecoin vaults (excl. USDT-A). As for low initial DC of 5m, I think it is ok to start lower and then increase it if there is any traction. The demand is though questionable, partially because it will be mostly driven by DAI price and arbitrage. We know USDC vaults still have DC unutilized and those might be more efficient and quicker when arbing the price. Also, GUSD is pretty illiquid and has only 14m supply, although this really isn’t a huge constraint for redeemable non volatile assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.894230769230769
                }
            ]
        }
    ]
}