{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/how-do-we-face-it-aave-will-launch-liquidity-mining-and-token-pledge-reward-programs-and-will-also-launch-a-new-token-aave-to-replace-lend/3159",
            "title": "How do we face it? Aave will launch liquidity mining and token pledge reward programs, and will also launch a new token AAVE to replace Lend ",
            "index": 3159,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "concerns",
                "liquidity-mining"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#1",
                    "likes": "0",
                    "time": "10/07/2020-07:45:59",
                    "content": "Like my initial guess, more and more DEFI will be added to liquidity mining, and the impact on our MAKER will become more and more obvious. How do we face these? Now, we should first adopt the simplest and most direct method (PSM), and then adopt some other complicated methods. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.011363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/07/2020-10:07:05",
                    "content": "I personally prefer to mortgage MKR to generate DAI and reward those who mortgage MKR. This mutual incentive will make the scale continue to expand. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/07/2020-16:48:05",
                    "content": "I don’t understand why everyone keeps saying to print Dai and sell it to buy MKR.  This idea is flawed because the value is not being held securely.  MakerDao would be selling Dai and then buying something (in this case MKR) that can simply rise in price to match the buying pressure and as soon as the trade needs to reverse poof MKR goes right back to the old price it was at and now all that value is gone.  Or worse, it could be lower even. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.918367346938775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/07/2020-00:14:51",
                    "content": "Yes, I gave up my idea. Because I saw better suggestions from the community.    Proposal: Use excess USDC from the PSM to buy and burn MKR   The PSM can restore the peg but the problem is that it may require a high USDC debt ceiling that many are not comfortable with and in theory could create a fatal risk for MKR hodlers. Let’s say, for example, that we needed 200m USDC debt ceiling in the PSM to restore the peg but we didn’t want to have more than 50m USDC debt ceiling. We could then take the 150m excess USDC and start to run our standard FLAP auctions to buy and burn MKR, which would remove all excess USDC risk from the protocol. Yes- this would create unbacked DAI which would have the exact effect we want in this scenario- lower the DAI price back to the peg. It would also provide a massive boost to the MKR price, creating more confidence in the system. Now, let’s say that we overshoot and having unbacked Dai quickly results in Dai falling below the peg. What would happen then? We would then raise SF but instead of using the excess Dai to run FLAP auctions, we would first retire the unbacked Dai. Essentially, by using the excess USDC to buy and burn MKR when Dai is above the peg, we would simply be borrowing from future SF income to buy and burn MKR in the present, when we most need it since there is essentially no income to support MKR when SF is at zero and Dai is above the peg.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.823333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#5",
                    "likes": "2",
                    "time": "11/07/2020-00:29:53",
                    "content": "You can refer to the role of the SNX token cited in the Synthetix project, some of our ideas are similar to this. As long as MKR is repurchased in the market, the number of MKR will decrease, and the price of MKR will be supported or even rise sharply. As long as DAI is printed, MKR will be purchased, and eventually the number of DAI will increase, and MKR is the price increase. They will inflate each other. Here, we use excess USDC to buy MKR in the market. In fact, this idea is similar in some places. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7749999999999995
                }
            ]
        }
    ]
}