{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-permit-the-rwf-core-unit-to-allocate-time-and-resources-to-reviewing-an-upcoming-new-silver-request-for-debt-ceiling-increase/15768",
            "title": "[Informal Poll] Permit the RWF Core Unit to allocate time and resources to reviewing an upcoming New Silver request for Debt Ceiling increase ",
            "index": 15768,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll",
                "ns-drop",
                "rwa",
                "rwa-002"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "4",
                    "time": "13/06/2022-14:55:06",
                    "content": "Summary New Silver has had a Maker Vault with a debt ceiling of 20mm DAI since April 2021. New Silver has used around 19mm DAI, without any defaults or losses. We have been working closely with Centrifuge and communicating with the RWF Core Unit regularly to come up with a mutually agreeable plan to ask the community for a debt ceiling increase to 100-150mm DAI (final amount TBD at signal request). This is an informal poll to allow the RWF team to engage in due diligence and legal negotiations (counsel cost to be borne by New Silver) prior to the formal DC signal request. Note: This poll is not the debt ceiling signal request; this is a poll to ask the community to allow the RWF Core Unit to spend time and resources to engage with New Silver. A formal signal request will be forthcoming after the RWF CU team completes diligence and legal reviews. For additional information, please see New Silver’s recent updates: May, April, March, Focus On #11. Others are available on the forum. Additional Information New Silver is asking the community to allow the RWF Core Unit to dedicate resources to work with New Silver on legal review and perform diligence in connection with New Silver’s upcoming signal request for a debt ceiling increase. Any outside legal counsel costs will be incurred by New Silver. Full details on the request will be forthcoming in the upcoming signal request after this work has been completed. At a high level, these are the tasks that the parties will engage in:  Implement the Trust Indenture legal structure as outlined in this post, as well as its’ required components such as trustee, payment agent, verification agent, custodian. Due diligence review Any other items, as needed  Here are the highlights of a few of New Silver’s achievements:  First and largest RWA Maker Vault At current volumes, earning >600,000 DAI per/year for the Maker community No losses since the start Signed a term sheet for $20mm with a US based institutional lender to provide junior capital New Silver participating in the junior tranche with >4mm DAI at-risk capital Expanded team from 5 to 19 people Brought on a CFO with experience at Goldman Sachs and Paypal Joined U.S. Green Building Council and rolling out green incentives for borrowers     Should the RWF Core Unit allocate time and resources for due diligence and legal for New Silver’s upcoming debt ceiling signal request?  Yes No Abstain     0 voters     Poll will run for 7 days. ",
                    "links": [
                        "https://forum.makerdao.com/t/new-silver-april-2022-update/15086",
                        "https://forum.makerdao.com/t/new-silver-march-2022-update/14598",
                        "https://forum.makerdao.com/t/focus-on-11-navigating-real-estate-investment-markets-with-new-silver/14646",
                        "https://forum.makerdao.com/tag/newsilver-update",
                        "https://forum.makerdao.com/t/centrifuge-update-cornerstone-agreement-complete-to-onboard-rwas-to-maker-with-centrifuge-successful-collaboration-with-incubating-lts/",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-09-15-2022/15843",
                        "https://forum.makerdao.com/t/governance-and-risk-195-thursday-june-16-at-17-00-utc/15816/2",
                        "https://forum.makerdao.com/t/collateral-onboarding-project-based-funding-request-pfr/17290/27",
                        "https://forum.makerdao.com/t/new-silver-july-2022-update/17262",
                        "https://forum.makerdao.com/t/new-silver-june-2022-update/16552",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/112",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-09-15-de-junio-de-2022/15954",
                        "https://forum.makerdao.com/t/encuesta-informal-permitir-que-la-core-unit-de-rwf-asigne-tiempo-y-recursos-a-la-revision-de-una-proxima-new-silver-request-para-el-aumento-del-techo-de-deuda-traduccion/15784"
                    ],
                    "GPT-summary": "New Silver is requesting a debt ceiling increase from the Maker community, and is asking the RWF Core Unit to allocate time and resources to engage in due diligence and legal negotiations prior to the formal DC signal request. The post provides details on the request, including the tasks that the parties will engage in, and highlights of New Silver's achievements. The post also includes an informal poll asking whether the RWF Core Unit should allocate time and resources for due diligence and legal for New Silver's upcoming debt ceiling signal request.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.300358851674641
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#2",
                    "likes": "1",
                    "time": "15/06/2022-14:52:23",
                    "content": "This is a large increase but I have been very impressed with New Silver’s performance and am very comfortable with it.  Macro environment may get difficult but New Silver has shown great transparency in their operations and shown themselves to have restraint in conservatively seeking out loans.  With such short loan durations, I don’t see too much in terms of risk. If anything, I’m interested to see how a RWA vault like does through economic turbulence that is sure to affect its sector.  We’ve been hearing so much about MKR’s advantage in cost of capital during higher rate environments.  Let’s see that thought put to action. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.252191558441559
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/06/2022-16:44:06",
                    "content": "Thank you, much appreciated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#4",
                    "likes": "3",
                    "time": "15/06/2022-16:54:43",
                    "content": "I do not support this at the current time. The RWF team has a very very full plate. I would like to see us prioritize diversifying counterparty exposure in RWA and focus on a flawless execution of significant new deals nearing completion. With current market turmoil teams must also reserve capacity for enhanced cross-CU coordination in real-time for ongoing due diligence, monitoring exposures/risks (credit, legal, operational, technical …) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.134090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/06/2022-17:44:11",
                    "content": "The impact to the RWF team should be minimized with New Silver using the, previously reviewed, indentured structure and covering cost for outside counsel. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.94949494949495
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/06/2022-17:50:36",
                    "content": "Still… focus and diversifying counterpary exposure is very important. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#7",
                    "likes": "3",
                    "time": "15/06/2022-17:55:47",
                    "content": "    Khan:  The impact to the RWF team should be minimized with New Silver using the, previously reviewed, indentured structure and covering cost for outside counsel.   As always, I am at the disposal of the Maker token holders as to collateral preferences. And while the Indentured Trustee structure will absolutely be helpful, RWF and the incubating LTS will still have to undertake a thorough diligence, coordinate with CES, ensure we have adequate reporting from the asset level, prepare a risk assessment, etc. I believe that the Maker community will look to me to confirm the work product of external counsel. And while New Silver’s assumption of costs is very helpful, I remain duty bound to review and comment on the transaction documents. We are more efficient in processing transactions, but there is still a material time commitment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.744107744107744
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#8",
                    "likes": "2",
                    "time": "15/06/2022-18:20:14",
                    "content": "there are some issues with the prior structure that should be reviewed and either improved or approved as is by Maker voters also this request is a significant increase in NS’s debt ceiling, in line with a significant increase in their loan origination volumes.  RWF would want to be confident that NS has both the operating capacity and available quality loans to ramp up to this scale.  And we are in a raising rate environment with a likely economic slowdown so RWF would want to understand how this will impact the NS business. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#9",
                    "likes": "2",
                    "time": "15/06/2022-18:53:06",
                    "content": "Thank you everyone for your feedback. Please allow me to provide some feedback to the comments   In terms of time commitment, fully defer to the RWF team, but just wanted to add that this will not be a rushed process and sufficient time, in line with the teams’ capacity, will be available.   In terms of diversification, the current DC and the future DC, if approved, would remain sufficiently small compared to Makers TVL. The new DC, if approved, would take about a year to fill, with short term loans coming in and out. With real estate, there is practically no chance of total principal loss, since residential real estate will very unlikely go to 0. There may be a delay in collections, but every state in the US enforces foreclosure. Also, being the first RWA vault on Maker and having “trailblazed”, together the with the community, on a number of issues, we believe our potential DC increase process will go a long way towards streamlining, optimizing and improving the process for future counterparties. Further, given the existing and potential current RWA pipeline, there should be additional diversification on-line prior to the potential new DC being filled.   In terms of the rising rate environment, we are certainly aware of it and are/have planned for it. The fix and flip space has existed through various downturns and, as research has shown, lenders had minimal defaults (and near 100% total recovery). At this stage, we are not in a real estate crisis, we are in an inflationary period. Real estate may be effected later on, which will likely be a modest price cooling (not a bad thing for New Silvers potential borrowers) and a slowdown in transactions, both of which we are cognizant of. The origination volumes for fix and flip are well over $50b per year, and New Silver is well under 1% of the market share at the moment. We believe this is an opportune time to go to market with a differentiated, attractive, well thought through product, and outcompete and improve on the TradFi backed incumbents. We believe we are in a great position, together with MakerDAO, to do that.   Thank you all again for your time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.506142506142506
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#10",
                    "likes": "0",
                    "time": "15/06/2022-19:47:35",
                    "content": "I voted abstain because I fear that events similar to the housing crisis of 2008 could happen in the near future. This historical overview about the housing market crashes on the New Silver website contains a lot of interesting information, but I think we should be cautious about the current situation. I am thinking something like this:  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.525974025974026
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#11",
                    "likes": "1",
                    "time": "15/06/2022-20:47:38",
                    "content": "Average Loan to Value: 71% Average FICO score: 699 Average Term: 10.8 months These three lines taken from the last report are what we should be paying attention to for New Silver.  To me, that means on average, as long as expected value of a construction does not decrease over 29% in 11 months, we should not expect a loss.  Even if it goes down quicker, I would expect the average borrower to take a pretty big loss before being okay with ruining such a high credit score.  These aren’t the same as 30 year mortgages and if there is a large real estate crash, I’d more expect loss of loan demand rather than loss of capital. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.238182577656262
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#12",
                    "likes": "1",
                    "time": "22/06/2022-20:43:12",
                    "content": "Thank you for everyone for voting here, we appreciate your time and continued support. We are looking forward to working with the RWF CU, and in the near future, present the community a thoroughly thought-out signal request for consideration. We will also be conducting an AMA and posting updates in order to keep everyone updated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "22/09/2022-02:43:59",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}