{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-26-de-abril-02-de-mayo-de-2022/14970",
            "title": "Relay Semanal: 26 de abril - 02 de mayo de 2022 ",
            "index": 14970,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NCO",
                    "index": "#1",
                    "likes": "5",
                    "time": "04/05/2022-23:10:23",
                    "content": " 1727×390 307 KB  ¡Hola a todos! ¡Gracias por consultar el Relay Semanal! Ya sea que tengas Maker (MKR) o DAI, poseas una Vault o quieras involucrarte más en la Gobernanza de MakerDAO, esta es tu parada rápida para estar al tanto de las actualizaciones del ecosistema de MakerDAO.  La versión online del libro animado, en inglés, se puede encontrar aquí    Dale amor a nuestra cuenta en Medium   Tenemos nuevas ideas de mejora y agradeceríamos tu feedback para ayudarnos a hacer del Relay Semanal una publicación más agradable.   ¡Chequéa esto!   SES y Julian están investigando desafíos y oportunidades para Maker en materia ambiental, social y de gobernanza (ESG - “Environmental, Social, Governance”). Actualmente están solicitando la opinión de la comunidad para ayudar a identificar temas con potencial relevancia comercial. Puedes ver la encuesta aquí. Para más información.   Eventos Actuales El desarrollo de una estrategia de crecimiento agresivo para Maker se ha convertido en un tema candente en las últimas semanas. Las siguientes tres publicaciones tocan este tema desde diferentes ángulos: 1. Marca, marketing y alineación de la visión interna; 2. Diseñar un balance más eficiente para maximizar los rendimientos; y 3. Hacer uso de diferentes palancas financieras para impulsar la demanda orgánica del Dai. MakerDAO - intagibles para una mejor DAO @Mamun posteó un seguimiento a este posteo previo enfocado en la necesidad del desarrollo de una estrategia de alineamiento interno entre los contribuyentes de MakerDAO y las Core Units; especialmente, en lo que respecta a la marca y el marketing/comunicaciones. En esta etapa temprana de su desarrollo, gran parte de la atención que rodea a la DAO se ha centrado en el aspecto tecnológico y de software. @Mamun argumenta que “la naturaleza desordenada de la interacción humana dentro de la DAO” no se ha abordado lo suficiente. En una organización tradicional, la marca y los valores fundamentales de una organización se definen de arriba hacia abajo. En la DAO, por otro lado, es posible que los participantes dentro de estructuras independientes, como las Core Units, no siempre tengan una idea clara del propósito unificado y los objetivos generales de la DAO, lo que puede conducir a una desalineación entre los contribuyentes y las Core Units. Dado que las Core Units, a menudo, necesitan trabajar juntas y colaborar en diversas tareas, esto puede generar problemas. La publicación continúa argumentando que, si bien la proactividad y la colaboración son dos de las cualidades más importantes que se deben buscar en un colaborador de la DAO, sin una “visión común” y la estructura y cultura para respaldarla, no podremos crecer y progresar al ritmo que nos gustaría sin importar cuántos miembros productivos tengamos, incluso si colaboran bien. En resumen, la publicación argumenta que Maker adolece de una falta de misión y visión, visible en la relativa independencia de las Core Units y, lo que algunos ven como su enfoque en operar de acuerdo con su mandato, lo que “sí se interpone en el camino de la colaboración”. Saber hacia dónde nos dirigimos y definir las relaciones entre las Core Units, puede fomentar un ambiente de trabajo entre Core Units más colaborativo y coherente. El Estado Actual de las Core Units  911×922 66.9 KB  Un mapa operacional enfocado a promover una estructura de colaboración y proactividad  1499×929 141 KB  Este posteo ya ha generado muchas discusiones. ¡Únete aquí! Un enfoque de balance para ejecutar una estrategia de crecimiento agresivo: el camino hacia los 300 millones de ingreso @SebVentures compartió su enfoque basado en el diseño del balance uniéndose a la discusión en curso del foro sobre el desarrollo y la ejecución de una estrategia de crecimiento agresivo.  Nuestro balance actual está levemente infrainvertido y deja sobre la mesa unos 9-11 millones de DAI en ingresos anuales.  Exploramos los bonos a corto plazo y la inversión en ETH, ya que estos activos no dependen de factores externos. Ambos aumentarían la rentabilidad para los titulares de MKR, pero estarán limitados por el tamaño del buffer de excedentes.     1909×787 213 KB  La principal exposición que tenemos (62%) son las stablecoins, que no necesitan capital ni generan ingresos. El siguiente elemento son los préstamos respaldados por criptomonedas, que aportan el 90% de los ingresos, mientras que es solo el 35% de nuestra exposición y el 88% del capital necesario. Los mercados monetarios DeFi están muy por detrás, al igual que los Activos del Mundo Real. Opción 1.A: Optimizar la actividad actual al invertir, el capital excedente, en bonos a corto plazo. Invertir el exceso de capital (Buffer de Excedentes actual menos el capital en riesgo del modelo anterior) en bonos a corto plazo permitiría una inversión de 373 millones de DAI. Esta inversión proporcionaría 9 millones de DAI de ingresos adicionales, impulsaría el RoE al 122% y el precio de venta al 5,3%.  1554×819 151 KB  Opción 1.B: Optimizar la actividad actual al invertir, el capital excedente, en ETH. Asignar el actual excedente del buffer de excedentes a ETH solo permitiría una inversión de 13 millones para mantener el CaR dentro del actual buffer de excedentes. Sin embargo, a pesar del pequeño tamaño de la inversión, esto conduciría a un aumento de 11 millones de DAI en los ingresos anuales, aunque ETH RoA será bastante volátil en comparación con los bonos a corto plazo.  1550×829 156 KB  La Core Unit de Finanzas Estratégicas recomienda una asignación mixta de bonos a corto plazo y ETH. La comunidad determinará la asignación final.   Tratando de diseñar la Estrategia de Crecimiento Agresivo, aprendemos que un aumento de capital podría ser acumulativo y que los tipos de activos escalables son importantes.  Incluso con un plan de crecimiento significativo (más de 2 mil millones de préstamos respaldados por cripto, más de 3000 millones de Activos del Mundo Real, más de mil millones de D3M de cripto), no es suficiente implementar toda nuestra base de activos si no podemos confiar en tipos de activos escalables (por ejemplo, bonos a corto plazo, ETH). Suponiendo que se realice el despliegue completo de nuestra base de activos (a través del plan esperado o solo con bonos a corto plazo), el aumento de capital (emisión de tokens MKR) será positivo para los titulares de MKR (es decir, aumentará sus ganancias). El uso de una oferta de deuda al 10% también es positivo. La estructura de la emisión de deuda no se analiza, pero se supone que es similar a la de las acciones (que podría no ser el caso).    La adopción de un enfoque de balance líquido y diversificado aumentaría los ingresos en 300 millones.  Esto daría 304 millones de ingresos anuales frente a los 76 millones actuales    Una propuesta, de un equipo de varios miembros de diferentes Core Units para recaudar capital y deuda para financiar una estrategia de crecimiento agresivo, sugirió aumentar la exposición mediante el uso de tres palancas principales:   Vaults Institucionales: Vaults de criptos a medida (ETH, WBTC) para instituciones Activos del Mundo Real Expansión Multicadena: Se trata de implementar Maker MCD en L2 o en una L1 diferente y/o proporcionar liquidez al estilo D3M a las plataformas de préstamos en cripto.   1558×925 232 KB  Un aumento en la exposición que satisfaga ciertas condiciones empujará al buffer de excedentes requerido a 157 millones de DAI, lo que significa que quedarán 87 millones de DAI por incrementar. Si lo incrementamos a 100% en equidad, le costará al Protocolo 48 mil MKR (asumiendo que los precios se mantienen), lo que corresponde a una dilución del 5,4% para los actuales poseedores de MKR. El cumplir con estos objetivos aumentaría los ingresos a 187 millones de DAI anuales. Esto representa una relación de Precio-Venta del 11%, mientras que los escenarios anteriores solo alcanzaban hasta el 5,4%. El rendimiento sobre el capital ha bajado al 119% y disminuye a medida que dependemos cada vez menos de los préstamos respaldados por criptomonedas de alto RoE. Este escenario también podría financiarse a través de la deuda, lo que daría como resultado un RoE más bajo pero una relación precio-venta más alta. Opción 2.A: Ampliar la exposición, a los bonos a corto plazo, es favorable incluso en un escenario sin crecimiento  1560×794 218 KB  Incluso utilizando un modelo del peor de los casos, en el que “invertimos en bonos a corto plazo y, esencialmente, nos limitamos a invertir nuestro excedente para nuestra capacidad de deuda actual”, terminaríamos con una exposición de 2,8 mil millones en bonos a corto plazo mientras que, el capital recién incrementado, aún se utilizaría en su totalidad. Incluso en el peor de los casos el aumento de capital sería favorable para los actuales poseedores de MKR, con un precio de venta del 9,6%. Opción 2.B: Agregar ETH a la mezcla es aún más favorable  1171×670 154 KB  Usamos las siguientes condiciones en nuestro modelo para agregar ETH a la combinación de activos:  Un incremento de 2 mil millones de DAI en préstamos respaldados por criptos a través de Vaults Institucionales e implementaciones de L2 MCD. Un incremento de mil millones de DAI en Mercados de Monet DeFi con el nuevo D3M para Compound, Fuse, y otros. Un incremento de 300 millones de DAI en Activos del Mundo Real. Invertir 100 millones de DAI en ETH. Guardar un 15% del buffer en stablecoins. El resto es invertido en bonos a corto plazo. La brecha entre el actual buffer de excedentes y el Capital en Riesgo de esta asignación se eleva en el mercado al precio MKR actual.  Como se demostró, agregar 100 millones de DAI en ETH, aumenta el incremento del capital en 91 millones. Análisis de impacto de tres factores ambientales:  La diversificación y la creación de una liquidez más fuerte, pueden optimizar, aún más, el balance general y mejorar los resultados.  1540×802 241 KB   Concluimos que tener un modelo de alto nivel es bueno para enfocar al protocolo a qué tipo de balance se quiere apuntar y cómo:  Deberíamos centrarnos primero en la combinación de tipos de activos a los que nos dirigimos. Luego, concentrarnos en comenzar con elementos de activos que sean escalables para que podamos asignar el balance rápidamente de manera enfocada. Luego, optimizar la combinación agregando activos no escalables.   1346×885 115 KB  Nota: La publicación completa es larga y detallada. Si estás interesado en una investigación más profunda de estas ideas, dirígete a la publicación completa que se encuentra aquí. Una Estrella del Norte - El DAI como Destino En esta publicación de @teej y un equipo de otros colaboradores, el aumento de la demanda orgánica de DAI, se presenta como una “misión central única” potencial para Maker. Hay una distinción clave entre DAI como un medio para un fin, por ejemplo, cuando un administrador de activos del mundo real abre una vault para cambiar DAI por decreto para lograr algo off-chain, como el desarrollo de bienes raíces, y DAI como un fin en sí mismo, o destino, por ejemplo, cuando un usuario de criptomonedas abre una vault de DAI para usar DAI, procede él mismo para lograr algo on-chain, como proporcionar liquidez a un AMM. ¿Por qué nos importa el DAI orgánico? Porque es más pegajoso. Cuanto más rígido sea el DAI, mayores, a más largo plazo y potencialmente más rentables serán los riesgos que Maker puede asumir en productos comerciales como D3M y Activos del Mundo Real. Dado que todo DAI pendiente es una responsabilidad del protocolo, este es un tema crítico. El objetivo es establecer un circuito de retroalimentación en el que el aumento de los ingresos mejore la opinión del mercado sobre el DAI, impulsando una mayor demanda orgánica de DAI, creando así más oportunidades de generación de ingresos, comenzando el ciclo nuevamente. Aquí hay un vistazo de cómo le está yendo a nuestro DAI en el frente de como medio versus como destino.     ¿Es DAI el Destino? Respuesta     Crypto-Loans (Préstamos de Criptos) Si   PSM Si   D3M Algo así   RWAs (Activos del Mundo Real) No todavía     Crecimiento Agresivo - Enmarcando la recaudación de fondos  867×431 42.8 KB  El núcleo de MakerDAO es su negocio de préstamos directos de cripto, que debe permanecer “rígido, descentralizado al máximo y sin permisos”. La segunda capa, el PSM, también debe permanecer algo rígida pero,al mismo tiempo, también debe tener cierta flexibilidad. Las capas D3M y RWA son donde, un margen excedente más grande, tiene el potencial de marcar el comienzo de una nueva era de crecimiento. Una de las claves para un crecimiento agresivo será la búsqueda off-chain de Activos del Mundo Real. Además de generar ingresos, las asociaciones fomentadas por la Core Unit de Finanzas del Mundo Real, con organizaciones conocidas y respetadas, mejorarán la marca de Maker, generando la mayor demanda orgánica de DAI que estamos buscando. Los autores creen que la distinción actual que hacemos entre D3M y Activos del Mundo Real, eventualmente, se disolverá a medida que se difuminen las líneas entre DeFi y TradFi (una tendencia que aumentará a medida que los rieles financieros del mundo real y los activos tradicionales se muevan on-chain). Ofrecen dos nuevas ideas de productos para su consideración. Modelo 1: B2B DAI  929×392 40.3 KB  No existe un prestamista comercial, institucional para el comercio on-chain. A diferencia del mercado de préstamos comerciales tradicional, el mercado de préstamos comerciales on-chain está casi intacto, lo que significa que el potencial de crecimiento en esta dirección es muy alto. Modelo 2: EZ DAI (DAI para gente normal) Las vaults de Maker pueden ser productos útiles para los expertos en criptos, pero presentan una curva de aprendizaje pronunciada para el inversionista o institución cripto individual promedio. Hay dos opciones, para productos más accesibles a los “normales”, que incluyen:   Vaults de acceso: la comunidad de Maker se ha referido, históricamente, a estas como Vaults institucionales (piensa en Nexo y Celsius). Estos productos podrían combinar la custodia de terceros, interfaces de usuario simples y otras optimizaciones, para que los usuarios cotidianos aprovechen un mercado, hasta ahora, poco alcanzado.  Vaults corporativas: estos serían, esencialmente, préstamos a plazo garantizados con criptomonedas para clientes corporativos. A medida que las criptomonedas de gran capitalización, como ETH y BTC, crecen en popularidad como activos de tesoro, las organizaciones que las utilizan, buscarán formas de obtener préstamos a tasas decentes contra sus tenencias.    Esta Semana en la Gobernanza  Propuestas de Mejora de Maker(MIPs) Actualización Semanal de MIPs #85 por @blimpa   1380×776 27.3 KB    La Ventana Formal de Presentación se encuentra abierta. Las propuestas elegibles han sido confirmadas y tendrán, en vivo, su Encuesta de Ratificación el 9 de mayo y se encontrará vigente por dos semanas hasta el 23 de mayo. La Ventan Formal de Presentaicón de Mayo cierra el 4 de mayo. El último día para poder postear una propuesta para el Ciclo de Gobernanza de Junio, es el 11 de mayo.  Discusiones Pre-MIP:  Propuesta Anti-inflacionaria DAI respaldado por subastas IAM para el Buffer de Excedentes Propuesta de Ideas en el Foro [Pre-MIP] Utilizar Gyroscope para cortar a través del nudo de Gordian del DAI: es una dependecia del USDC Una solución al estilo de Activos dle Mundo Real para reemplazar el PSM (Módulo de Estabilidad de la Pariedad)   Votaciones Ejecutivas Distribución del Presupuesto de las Core Units - 29 de abril de 2022 Esta propuesta ejecutiva ha sido aprobada y los siguientes cambios ocurrieron dentro del Protocolo de Maker: Transferencia de Presupuesto a las Core Units Según múltiples propuestas exitosas acerca del presupuesto, un total de 1.057.918 DAIs fueron transferidos a múltiples Core Units:     Core Unit Monto Transferido Propuesta     Ingeniería de Protocolos 800.000 DAI Propuesta   Eventos 149.692 DAI Propuesta   Comunicaciones de la Gobernanza 73.226 DAI Propuesta   Felicidad Estratégica 35.000 DAI Propuesta     Transmisión de Presupuesto a las Core Units Según múltiples propuestas exitosas acerca del presupuesto, un total de 9.758.130 DAIs fueron diferidos a múltiples Core Units:     Core Unit Monto Diferido Propuesta      Ingeniería de Protocolos) 7.590.000 DAI Propuesta   Conocimientos de Datos 1.083.000 DAI Propuesta   Eventos 748.458 DAI Propuesta   Comunicaciones de la Gobernanza 336.672 DAI Propuesta     Interacción de DssVest y ESM: Esta sección aclara la necesidad de los anteriores flujos de vesting en un nuevo contrato DssVest.  El contrato en DAI de DssVest fue actualizado para prevenir que las llamadas a vat.suck sean posibles durante un apagado de emergencia. Esto incluyó la verificación para garantizar que vat.suck solo funcione cuando el sistema esté activo para todos los nuevos contratos de vest. Se confió en el ESM para los contratos existentes a fin de permitir que los keepers eliminen los permisos de proxy de pausa si la Gobernanza se vuelve maliciosa luego del apagado. Ten en cuenta que esto es relevante solo después de que se produce un apagado. La funcionalidad completa del vest sigue siendo la misma que en el contrato original. Todas las transmisiones de presupuesto existentes quedan igual, pero las nuevas transmisiones provienen de un nuevo contrato.    Encuestas de la Gobernanza Activas Por favor, mira la encuesta de feedback, que se ha mencionado al comienzo de esta publicación, para ayudarnos a mejorar las Encuestas de la Gobernanza Activas. Hay dos encuestas que se encuentran activas:     Nombre de la Encuestas Debate     PPG - Propuesta de Comité de Mercado Abierto Debate   Investigar la Implementación de un D3M TrueFi Debate    Consulta la edición del 25 de abril del Relay Semanal para obtener más información acerca de las encuestas que han finalizado recientemente.  Encuestas del Visto Bueno de la Comunidad Por favor, mira la encuesta de feedback, que se ha mencionado al comienzo de esta publicación, para ayudarnos a mejorar las Encuestas del Visto Bueno de la Comunidad. Hay dos encuentas del visto bueno de la comunidad que se encuentran activas par la semana del 12 al 18 de abril de 2022.     Encuesta del Visto Bueno Desgloce Actual de Votos Fecha de Comienzo Fecha de Finalización     ATDC (Combustores ATD) Imagen próximamente 2 de mayo de 2022 a las 16:00 UTC 16 de mayo de 2022 a las 16:00 UTC   IPCL (Bonos Verdes de Energía de la India) Imagen próximamente 2 de mayo de 2022 a las 16:00 UTC 16 de mayo de 2022 a las 16:00 UTC    Consulta el punto de vista de “De Un Vistazo” sobre los tipos de Vault actuales y sus parámetros en MakerBurn.  Peticiones de Señal Activas Reiniciar la Quema @aburban90 presenta su solicitud a favor de reactivar la quema de MKR. Afirma que cerrar la quema también cerró nuestro único modelo de distribución de ingresos y que aún tenemos que reemplazarlo con algo mejor. Estas acciones han provocado que algunos stakeholders de OG pierdan la fe en nuestra capacidad de cumplimiento y entrega. Nuestra comunidad y los stakeholders son muy importantes, y existe la posibilidad de que estemos arriesgando su confianza en nosotros si continuamos sin quemar MKR en tiempos de precios tan bajos. Andrew ofrece dos opciones para lograr realizar esta propuesta:  Reiniciar, inmediatamente, el antiguo mecanismo de quema, con todas sus ineficiencias intactas y aceptar las pérdidas por deslizamiento. Reiniciar la quema de manera más lenta; en vez de una gran quema con grandes deslizamientos, una quema más lenta.  La votación se encontrará vigente hasta el 12 de mayo de 2022. Aquí puedes ver cómo va la votación:  1705×1152 268 KB   Desplegar el Balance en ETH Como se expresa en Hacia la toma de riesgos de activos y Un enfoque de balance para una estrategia de crecimiento agresivo, el ETH parece una buena inversión para MakerDAO. Sebastian de Finanzas Estratégicas avanza hacia el enfoque del balance para una estrategia de crecimiento agresivo al medir el sentimiento de la comunidad sobre si nos gustaría comenzar a trabajar en la asignación de algunos de los balances de MakerDAO en ETH y/o derivados de ETH y, de ser así, cuántos de estos. Él presenta los pros y los contras de implementar, potencialmente, esta inversión en ETH: Pros:  MakerDAO está utilizando Ethereum como su base y, por lo tanto, está ligado al éxito del ETH. ETH es un activo estratégico para las operaciones de la DAO ya que paga las tarifas del gas para transacciones y oráculos on-chain. La competencia (como Celo, TribeDAO y Angle) tienen ETH en su balance general y, el no tener ETH, pone a Maker en una clara desventaja competitiva. La próxima Fusión reducirá, significativamente, la emisión de nuevos ETH y creará un mercado competitivo para los balances con un alto grado de exposición al ETH. Las tarifas de participación posteriores a la Fusión, actualmente, se estiman en 7-11%, duplicando los rendimientos de participación actuales de la noche a la mañana y convirtiendo al ETH en un activo verdaderamente productivo.  Contras:  ETH es un activo volátil cuyo precio ETH/DAI puede fluctuar enormemente y, ocasionalmente, bajar durante períodos significativos. Los impactos de la Fusión y del L2, pueden tener impactos inesperados a largo plazo en el precio.  Sebastian también señala que esta Petición de Señal tiene como objetivo comprender si existe un deseo de la comunidad de trabajar en este tema. Actualmente no se atribuye ninguna prioridad y la implementación formal de tales acciones deberá pasar por los procesos de Gobernanza La votación se encontrará vigente hasta el 12 de mayo de 2022. Aquí puedes ver cómo va la votación:  1700×797 173 KB   1700×1265 255 KB   Cambiar el Parámetro lid en el Limitador de Tasas La introducción y la aprobación del Flapper Limitador de Tasas ha sido un éxito, pero solo permite activar una nueva subasta si la nueva subasta no incrementa el total de DAI actual en subasta por encima de cierto umbral (es decir, el lid), a menos que ese se encuentre al mismo valor que el bump. Actualmente, el valor del lid está establecido en 150 mil DAI, el cual puede correr cinco subastas flap al mismo tiempo. Sin embargo, ultraschuppi cree que no hay una buena razón para quemar tanto MKR, por lo que propone establecer el valor del lid al mismo que el del bump: a 30 mil DAI. Al tener un ratio de 1:1, el lid con el bump, asegurará de que solo habrá una subasta en paralelo corriendo al mismo tiempo. Lo bueno de esto es que, en el caso de un gran aumento en el Excedente del Sistema que cause un derrame en el buffer de excedentes, la extensión de tiempo de esas subastas resultantes será 5 veces mayor que la configuración actual, lo que producirá una quema más constante. Sin embargo, en sacrificio, limitaremos el MKR máximo quemado por día de 7.2MM DAI a 1.44MM DAI. La votación se encontrará vigente hasta el 13 de mayo de 2022. Aquí puedes ver cómo va la votación:  1705×552 93.4 KB     Comunidad Deep Dai-ve  Tweet de la Semana   twitter.com    D 🦇🔊 @EffortCapital  1/2  With D3M coming to @maplefinance  and @compoundfinance, institutions like @GenesisTrading (who leverage both platforms)  should be highly incentivized to borrow DAI for their operations, especially in a raising interest rate environment @MakerDAO   4:55 PM - 2 May 2022           6              Reuniones y Eventos Grabaciones de las Llamadas de la Semana Pasadas  Gobernanza y Riesgo | Ep. 188   Foro | Video    Enfoques #11 | AMA con New Silver   Foro | Video    Llamada de Discusión de Problemas # 6 | Incorporación de Colaterales   Foro | Video    Llamada de Incorporación de Colaterales #41: AMA de la MIP6 de los Mercados de Oasis Pro   Foro | Video    Llamada de Incorporación de Colaterales #40: StakeWise sETH2   Foro | Video      Próximas Llamadas  Llamada de Asignación de Activos de la MIP65 #1: Mandato de Baillie-Gifford  A determinar   Gestión de Colaterales Offchain | Alineación de Stakeholders 21   Link para Unirse | Notas de la Llamada      Gobernanza y Riesgo   Link para Unirse | Agenda - Jueves a las 16:00 UTC   Horas de Oficina de las Core Units   Link para Unirse | GovAlpha - Preguntas y Respuestas de la Gobernanza - Lunes 17:00 UTC  Link para Unirse | Seguridad Immunefi - Martes 00:00 UTC  Link para Unirse | Ingeniería del Protocolo - Martes 15:00 UTC  Link para Unirse | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Link para Unirse | Crecimiento - Miércoles 17:00 UTC  Link para Unirse | Finanzas del Mundo Real - Miércoles 17:00 UTC  Link para Unirse | Comunicaciones de Gobernanza - Viernes 18:00 UTC     Links Útiles  Abrir Foro y Chat de Maker Discusiones y debates en MakerDAO. Calendario de Llamadas Público | Calendario de Votación & Eventos Público Suscripción para todas las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participación Biblioteca de enlaces útiles para los Stakeholders; análisis de Protocolo, análisis de DAI, las métricas de colateral y liquidación, historia de la Gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Portal de Documentación Técnica Aprende más sobre el protocolo de Maker.    ¿Tienes algún Feedback? ¡Valoramos tu opinión! Haz nuestra encuesta para hacernos saber qué se nos está pasando por alto o podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Créditos @nothsa @Artem_Gordon  Esta es una traducción libre del artículo original en inglés gracias a @NCO y @Sebix ",
                    "links": [
                        "https://medium.com/@MkrGovComms",
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://docs.google.com/forms/d/e/1FAIpQLSc0MsZv8qFQfoJh5w15atJHfC-UknCNChoEP-jU5UfDXMVewQ/viewform?usp=sf_link",
                        "https://youtu.be/V5bliF28cbM?t=2726",
                        "https://forum.makerdao.com/t/makerdao-intangibles-for-a-better-dao/14860",
                        "https://forum.makerdao.com/t/the-maker-brand-team-some-strategic-thoughts/14725",
                        "https://forum.makerdao.com/t/makerdao-intangibles-for-a-better-dao/14860/14",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
                        "https://forum.makerdao.com/t/maker-growth-strategy-we-must-act-now/14501",
                        "https://forum.makerdao.com/t/a-balance-1",
                        "https://forum.makerdao.com/t/a-north-star-dai-as-the-destination/14838",
                        "https://forum.makerdao.com/t/weekly-mips-update-85/14914",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928",
                        "https://forum.makerdao.com/t/auction-backed-dai/13011/11",
                        "https://forum.makerdao.com/t/premip-iam-for-surplus-buffer/11584",
                        "https://forum.makerdao.com/c/mips/proposal-ideas/21?order=activity",
                        "https://forum.makerdao.com/t/pre-mip-using-gyroscope-to-cut-through-dai-s-gordian-knot-its-usdc-dependency/8865",
                        "https://forum.makerdao.com/t/an-rwa-style-solution-to-replace-the-psm/8705",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-distributions-april-29-2022#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP7",
                        "https://vote.makerdao.com/polling/QmWphKJY#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP32",
                        "https://vote.makerdao.com/polling/QmSVzGcm#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP30",
                        "https://vote.makerdao.com/polling/QmWQBUi6#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP11",
                        "https://vote.makerdao.com/polling/QmVdxBE5#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP7",
                        "https://vote.makerdao.com/polling/QmWphKJY#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP31",
                        "https://vote.makerdao.com/polling/Qme3VaY4#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP32",
                        "https://vote.makerdao.com/polling/QmSVzGcm#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP30",
                        "https://vote.makerdao.com/polling/QmWQBUi6#poll-detail",
                        "https://vote.makerdao.com/polling/QmTmehbz#poll-detail",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-april-2022/14863",
                        "https://vote.makerdao.com/polling/QmaoZpA8#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-truefi/14563",
                        "https://forum.makerdao.com/t/relay-semanal-19-25-de-abril-de-2022/14841",
                        "https://vote.makerdao.com/polling/QmRH6Bf6#poll-detail",
                        "https://vote.makerdao.com/polling/QmUQ7VDA#poll-detail",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn/14903",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834",
                        "https://forum.makerdao.com/t/towards-taking-asset-risks-a-primer/14265",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
                        "https://forum.makerdao.com/t/signal-request-change-lid-parameter-on-the-rate-limiter/14688",
                        "https://twitter.com/EffortCapital/status/1521171557313392640",
                        "https://twitter.com/EffortCapital/status/1521171557313392640",
                        "https://twitter.com/EffortCapital/status/1521171557313392640",
                        "https://twitter.com/maplefinance",
                        "https://twitter.com/compoundfinance",
                        "https://twitter.com/GenesisTrading",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/EffortCapital/status/1521171557313392640",
                        "https://forum.makerdao.com/t/governance-and-risk-188-thursday-april-28-17-00-utc/14833",
                        "https://youtu.be/V5bliF28cbM",
                        "https://forum.makerdao.com/t/focus-on-11-navigating-real-estate-investment-markets-with-new-silver/14646",
                        "https://www.youtube.com/watch?v=P6Mw6xvBlZ0",
                        "https://forum.makerdao.com/t/issue-discussion-call-6-collateral-onboarding/14751/2",
                        "https://www.youtube.com/watch?v=NJsmZL6mRcc",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-41-oasis-pro-markets-mip6s-ama/14767/1",
                        "https://www.youtube.com/watch?v=xFryn0W5DXc",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-40-stakewise-seth2/14676",
                        "https://www.youtube.com/watch?v=FsaSbsYvKlg",
                        "https://us02web.zoom.us/j/89494848349?pwd=MHhsbEJFTCtCNUJ6VG5YT1E2OGRxdz09",
                        "https://docs.google.com/document/d/1xup8M3mp1Fe-yaf-EfqwZ9bOzkINZQmnEN8G4OU1YSg/edit?authuser=1&usp=meetingnotes&showmeetingnotespromo=true",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/",
                        "https://chat.makerdao.com/",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forms.gle/Z2QAgywU2Sesm7Vy6",
                        "https://forum.makerdao.com/t/weekly-relay-april-26-may-2-2022/14939"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.164594928880644
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/05/2022-16:31:37",
                    "content": "Excelente aporte. Me pareció muy interesante la nueva propuesta de reactivar el mecanismo de la quema de MKR por las consecuencia que advierte el miembro del foro, ya sea volviendo al viejo sistema o mediante uno nuevo de quema mas lenta. Que complejo es mantener el equilibrio y que desafíos plantea a eso al sistema de votaciones que tiene sus tiempos lógicos de toma de decisiones. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#3",
                    "likes": "1",
                    "time": "10/05/2022-14:57:42",
                    "content": "Buen trabajo! @NCO, gracias por la traducción. Interesante la distribución de presupuestos para CUs, estaría bueno discutirlas un poco más! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}