{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-quarterly-report-q3-2022/19005",
            "title": "GovAlpha Quarterly Report Q3-2022 ",
            "index": 19005,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "cu-update",
                "quarterly-review"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "8",
                    "time": "30/11/2022-23:53:30",
                    "content": " Executive Summary  Successes   Successful onboarding of @Patrick_J in July as a second Governance Facilitator following @LongForWisdom stepping down at the end of Q2. Ongoing responsible use of the budget, coming in under budget once again and returning funds to the DAO. Successful pivoting of goals in view of a changing DAO landscape. Continuing to navigate a complex Governance scenario with the DAO while maintaining mandate of neutrality.  Appointment of @Gala as a second MIP Editor to share responsibilities with @blimpa. Ongoing close and productive working relationships with other Core Units and Recognized Delegates.  Particularly we would like to recognize PE and DUX for their close collaboration with GovAlpha over the quarter.   Our latest MKR vesting request was approved, although we have received feedback that we will take into account when submitting our next budget early next year, principally that submitting a budget every 6 months is causing unnecessary overhead.   Challenges  Ongoing difficulties with moderation duties on Discord and the Forum - with critique received from some that moderation is too lenient, while others feel it is too strict. Limited attainment of Quarterly Goals, see below. Apparent lack of awareness in the community of GovAlpha’s significant roles and responsibilities within the DAO. Our proposed MIPs to formalize the Recognized Delegate system and reform the compensation structure were not approved by voters. We have no plans to resubmit these MIPs at present, although the Community is welcome to take on this challenge if they wish.   Budget  GovAlpha’s Public Accounting sheet detailing budget status and all multi-sig transactions may be seen here. Note that the data on the summary page is incomplete if the quarter has not yet ended. We have also worked with SES to get our spending added to the SES expenses dashboard here. Overall Q3 spend was 197,688.99 DAI (down from 218,362.38 DAI in Q2 - a 9.47% reduction), compared to a total budgeted amount of 254,035.00 DAI.  We will therefore be returning 56,346 DAI to the Surplus Buffer.   Excluding the contingency buffer, we came in 10.51% under budget for the quarter. Although we underspent on People as a budget category, we overspent on the Contributors subcategory again. This was more than covered by the remaining budget in the Facilitators subcategory. See Budget Section for further details. We qualified for the SAFE airdrop, receiving an allocation of 5,542.48 SAFE tokens. We were able to mint 2,784.70 SAFE. The remainder will be vested over the next four years. Once transfers are enabled for this token, we will be sending them to the Pause Proxy as we have done with previous airdrops.  When claiming the SAFE airdrop it is a requirement to select a delegate address. In order to receive the tokens and maintain neutrality, GovAlpha delegated our voting power to the Maker Pause Proxy. The transaction logs for this delegation can be seen here.     Focuses for Q4 (Current Quarter)  Major - Initially Proposed - Separation of Powers Framework  Given the ongoing uncertainty with the Endgame proposals leading to an overhaul of the DAO’s structure, we have decided against pursuing this as a goal for the Quarter. Instead we will move up our major goal for Q1-2023.   Major - NEW - MIPs cleanup and tightening.  We have developed a list of multiple MIPs that we think could be clarified and improved. We will be working to bring many of these to governance over the quarter. If anyone wishes to assist with this, reach out to us and we can provide access to the list.   Minor - Forum plugin experimentation, emergency preparedness.   Planned focus for Q1 2023  Endgame - With the passage of the Endgame Prelaunch MIP Set a signal has been sent by MKR voters that this is the direction they wish MakerDAO to move in. GovAlpha will devote resources to the following tasks that we think will assist in the move towards the Endgame. This is a non-exhaustive list and we suspect many of these tasks will carry over into following quarters:  Documentation of Endgame structures and frameworks. Ongoing management of Governance as the transition to the Endgame state gathers pace. Advice and independent development of frameworks that can be used in the Endgame. For example, an arbitration framework is currently being worked on. Interim moderation and management of communications channels for clusters/metaDAOs until formal approval and handover of these channels occurs. Collaboration with other Core Units, particularly SES, to design and implement Endgame changes as determined by Maker Governance.     Analysis  Last Quarter’s Goals  Major Focus - Governance Audit + Analysis  Result - Abandoned In the light of significant proposed changes to the Governance structures and apparatus of MakerDAO, specifically the Endgame proposals, we felt that the expense and time required to procure a high-quality audit of Maker Governance was not an appropriate use of our CU’s resources this quarter.  Major Focus - NEW - Sourcecred Effectiveness Review  Result - proposal to stop funding Sourcecred approved by Maker Governance Instead, we pivoted resources and approach spending significant internal time reviewing the Sourcecred instance and setup due to concerns was no longer providing value to MakerDAO. Internal discussions, which included the development of a system that allowed trialing alternative configurations for Sourcecred (thanks @hernandoagf!), culminated in this forum post and this poll which will see GovAlpha withdraw DAI funding for the Sourcecred program once the October payments have been distributed. We are examining different options for rewarding governance participation internally and will present these to Governance once we have identified an alternative(s).  Minor Focus - Maker Operational Manual Updates  Result - Qualified Success We have spent some time reviewing all current entries in the Maker Operational Manual, ensuring consistency and accuracy with the current state of the Maker Protocol. While we still have a little way to go to ensure that every entry has been reviewed, we made significant progress on this and I am happy to consider it a qualified success. Each page now has an indication of when it was last updated and when a new update is due. Thanks to @LongForWisdom and @Gala for spearheading this work.  Example of the “Last Reviewed” footer at the bottom of a manual entry.  Minor Focus - Delivering CatFlipLike Status UI  Result - Qualified Failure We contracted dSpot to deliver a CatFlipLike Status UI for the Maker Protocol. This has been a long-term project for the Core Unit. Latterly, @tadeo from DIN has been assisting with this project and we are very grateful for his input here. This project is almost completed, with discussions having started regarding handover to Maker. Adrián from dSpot also presented it on the 2022-09-29 G&R call - link with timestamp. We are pleased with dSpot’s work but unfortunately we have missed our deadline for delivery of this UI and have also gone  over budget, hence the assignment of the Qualified Failure result. However, we are close to delivery and look forward to sharing the finished product with the Community.  Spending  Q3-2022 Actual versus Budget  1075×608 9.64 KB   Note: This graph includes GovAlpha’s Contingency Budget Line Item to better represent the use of our funding stream.  Spending Breakdown     Item Budget Actual     People 133,350.00 128,353.52   People - Facilitators 91,350.00 55,882.50   People - Contributors 42,000.00 72,471.02   Programs 72,500.00 65,191.00   Programs - Governance Incentives 65,000.00 45,905.00   Programs - Status UI 7,500.00 14,596.85   Programs - Other 0.00 4,689.15   Admin 50.00 57.24   Admin - Software 50.00 57.24   Travel & Entertainment 10,000.00 4,087.23   Travel & Entertainment - Travel 6,250.00 2,822.94   Travel & Entertainment - Activities & Events 3,750.00 1,264.29   Other Costs 5,000.00 0.00   Other - Gas 5,000.00 0.00   Contingency 33,135.00 0   Total 254,035.00 197,688.99     700×421 22 KB   People - Underspend  -3.75% = -4,996.48 DAI Facilitators underspend, Contributors overspend, reasons for this include:  The budget was constructed with the aim of having three Facilitators onboarded by Q3, instead LongForWisdom stepped down from the Facilitator role and is now a Contributor. Q3 therefore had a 10k reduction in the amount budgeted for Contributors compared to Q2. Long stepping down and reducing duties has led to other Contributors picking up more hours to fill the gap. An underestimation of Contributor spending when the budget was written.     Programs - Underspend  -10.08% = -7,309 DAI. Governance Incentives - underspend Status UI and Others - overspend  Underspent by more compared to Q2, despite paying out our first off-chain proposal bounties in Q3. Remained overbudget on Status UI and Others. Others overspending was due to funding ongoing work on the MIPs portal, which should be formally handed over to GovAlpha in Q4.  Travel and Entertainment - Underspend  -59.13% = -5,912.77 DAI  Underspent again on this category but we did spend more than previously having sent three CU members to DevCon in Bogotá.  Gas - No spend Following our decision to bulk-buy ETH in Q2, we did not need to buy any more ETH for gas this Quarter. At the end of Q3 the CU wallet contained 4.11 ETH.  Budget Return GovAlpha returned 56,346 DAI to the Surplus Buffer which is the unused budget sum for Q3. The transaction containing this transfer may be seen here.  Conclusion and Final Words  We have demonstrated ongoing responsible use of budgeted funds on behalf of the DAO, returning 56,346 DAI to the Surplus Buffer this Quarter. We have demonstrated an ability to pivot when stated goals proved unrealistic or potentially redundant, a possibility for any team when goals are being planned 6+ months in advance. A renewed focus on our own mandate and demonstrating the importance of GovAlpha to the DAO is needed. The Governance Facilitator role is critical to MakerDAO and is notably distinct from other Core Unit Facilitators. Governance Facilitators have significant extra powers and responsibilities defined in multiple different MIPs. These range from specific roles in governance processes to coordination and designation of emergency reponse procedures, with many other scenarios in between. During this quarter we have felt that this is not necessarily recognized by all within the Community. We are grateful to the many Community members and Delegates who value GovAlpha’s role and have been appreciative of our efforts publicly and privately. With the clear signal that MKR voters wish to proceed with the Endgame plan, GovAlpha will be devoting time and resources to assisting with this transition as well as designing frameworks and structures to ensure that Governance at all levels in the Endgame system is as robust as possible.  ",
                    "links": [
                        "https://forum.makerdao.com/t/new-additional-appointment-to-mip-editor-gala/17152",
                        "https://docs.google.com/spreadsheets/d/1IhTFGRh3NGL3Kp6TXj035T-898zHBSc2epEZGOPAF2k/edit#gid=934247838",
                        "https://expenses.makerdao.network/core-unit/GOV/finances/reports",
                        "https://forum.makerdao.com/t/govalpha-q2-2022-quarterly-report/18242/2",
                        "https://etherscan.io/address/0xbe8e3e3618f7474f8cb1d074a26affef007e98fb",
                        "https://etherscan.io/tx/0x966a36cd1f6c1aa860a6ee3ea22b05d3712febac89fc8a42938de21242515533#eventlog",
                        "https://forum.makerdao.com/t/poll-notice-signal-support-for-ending-dai-funding-for-sourcecred/18204",
                        "https://vote.makerdao.com/polling/QmYNSoyu#vote-breakdown",
                        "https://youtu.be/BWCkZCL20S4?t=912",
                        "https://etherscan.io/tx/0xe373735cba0902b458d2a4257a3289223704680cebac44dea705b110739cf966",
                        "https://etherscan.io/tx/0xe373735cba0902b458d2a4257a3289223704680cebac44dea705b110739cf966",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-november-2022/19023"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.571980883027394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/02/2023-23:53:51",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}