{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dai-backed-global-currencies/5981",
            "title": "Dai Backed Global Currencies ",
            "index": 5981,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/marioevz",
                    "index": "#1",
                    "likes": "4",
                    "time": "09/01/2021-03:50:54",
                    "content": "I don’t know if this has been proposed before but hear me out. What if we could print different global currencies, like EUR, YEN, GBP, and many others using a system on top of current Maker-Dai system? Making another collaterized smart contract system with Ether or WBTC for some other crypto just seems like too much trouble, plus, would there be enough Ether and crypto in general to guarantee these other Dai-like tokens to be collaterized in a healthy way? What about a system where we could put normal Dai in and print something like DaiGBP, or DaiYEN? These tokens would be indirectly collaterized by the tokens already serving as collateral in the current Maker-Dai system, and would be much easier to print, plus we wouldn’t need oracles for every currency and every crypto pair, we would only require info about the USD-GBP/YEN/EUR rates, so the system would be simpler. I am bringing this up because I was recently thinking about taking out a Maker loan to buy some stuff in my local currency, but then I would have to worry about my local currency decreasing in value against the US dollar when I have to repay the debt in USD. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4379699248120295
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#2",
                    "likes": "2",
                    "time": "09/01/2021-04:31:05",
                    "content": "Hi, thanks for joining this amazing community, in this forum post, you’ll see something related to your question and people asking about an EUR-DAI, there are some really interesting ideas over there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                }
            ]
        }
    ]
}