{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785",
            "title": "Delegate Round-up - October 2022 ",
            "index": 18785,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#1",
                    "likes": "5",
                    "time": "14/11/2022-21:12:48",
                    "content": " Delegate Round-up October 2022  Introduction Note, this edition was delayed due to some changes and restructuring within GovAlpha. We intend to continue this round-up, as we believe it’s a useful governance tool. Welcome to the October 2022 edition of The Delegate Round-up. The Delegate Round-up aims to provide an overview of the Recognized Delegates operating within Maker Governance. It also serves as a one-stop forum post where members of the Maker Community can monitor how Recognized Delegates are performing. In October there were twenty-one Governance Polls and four Executive Votes published to the voting portal. We welcomed CalBlockchain and ConsenSys as new Recognized Delegates in October, bringing us to a total of twenty-six Recognized Delegates at Maker. In October, there was a decline in the amount of MKR delegated to the Recognized Delegates with a decrease of 11,124 MKR, or -11.23%, compared to September. A break-down of payments to Recognized Delegates for October is available here  Recognized Delegates At the end of October, twenty-six Recognized Delegates were active in the Maker Protocol. In descending order of MKR delegated on the 31st of October, these were:     Delegate Delegated MKR Monthly Change Monthly Percentage Change     Flip Flop Flap Delegate LLC 16,576 7,664 86.00%   Doo 13,084 No change No change   schuppi 11,482 958 9.10%   Flipside Crypto 9,018 No change No change   Feedblack Loops LLC 8,268 950 12.98%   Penn Blockchain 7,489 -10 -0.13%   mhonkasalo & teemulau 6,640 No change No change   Hasu 6,103 No change No change   ACREinvest 3,100 No change No change   JustinCase 1,021 -12,017 -92.17%   [email protected] 1,813 No change No change   ChicagoDAO 1,500 No change No change   London Business School 1,001 No change No change   Chris Blec 374 -3,426 -90.15%   Frontier Research LLC 316.92 No change No change   Jason Yanowitz 83.27 82.87 -90.45%   monetsupply 25 -243 -2.49%   GFX Labs 19.44 -5000 -99.61%   CodeKnight 5.11 0.03 0.59%   ONESTONE 5.08 0.06 1.20   Llama  1.55 No change No change   pvl 0.29 No change No change   Gauntlet No MKR Delegated No change No change   RiskDAO New Recognized Delegate New Recognized Delegate New Recognized Delegate   ConsenSys New Recognized Delegate New Recognized Delegate New Recognized Delegate   CalBlockchain New Recognized Delegate New Recognized Delegate New Recognized Delegate   Total 87,923 -11,124 -11.23%     Recognized Delegates Visualized  bar chart showing MKR delegated to each Recognized Delegate1070×656 22.6 KB   pie chart showing relative vote weight of Recognized Delegates998×586 62.9 KB  Up-to-date visualizations can be seen on GovAlpha’s Governance Dashboard.  Delegate Metrics GovAlpha tracks metrics that monitor Recognized Delegate performance. These are useful to both current and prospective delegators in gauging how active Recognized Delegates have been and are used to calculate compensation for Recognized Delegates. The metrics currently tracked for Recognized Delegates center on participation in on-chain voting and communication by Recognized Delegates regarding their voting choices. These metrics can be seen on the delegate cards on the voting portal. In addition, a further breakdown of the participation metric is available for each delegate on their pages on the voting portal - here is a link to Flip Flop Flap Delegate LLC’s metric page as an example. For the calculations, we use the rolling 120-day window for calculating delegation metrics as per the recently ratified MIP4c2-SP24.  Participation For Participation, a score of 100% means that a Delegate has voted in all possible polls in the past 120 days. GovAlpha tracks Participation in Governance Polls and Executive Polls separately, then combines them to form an overall participation rating. Note that if Recognized Delegates choose not to support an Executive Vote and communicate this clearly, this will be counted as participating in the relevant Executive Vote. This is because there is no option to vote “No” to an Executive Vote. As of the end of October, the Delegate Metrics for Participation were as follows:     Delegate Name Poll Participation Executive Participation Overall Participation     Flip Flop Flap Delegate LLC 100% 100% 100%   Hasu 26.32% 28.57% 27.14%   Feedblack Loops LLC 96.55% 100% 97.22%   Doo 100% 100% 100%   JustinCase 100% 100% 100%   schuppi 100% 100% 100%   Flipside Crypto 87.93% 100% 90.28%   Penn Blockchain 100% 100% 100%   GFX Labs 100% 100% 100%   Chris Blec 94.83% 100% 95.83%   ACREinvest 94.83% 85.71% 94.37%   Gauntlet 81.25% 40.00% 71.43%   mhonkasalo & teemulau 100% 100% 100%   Codeknight 96.15% 100% 96.83%   Frontier Research LLC 100% 100% 100%   ONESTONE 100% 100% 100%   pvl 100% 71.43% 95.45%   [email protected] 92.98% 92.86% 92.96%   monetsupply 29.31% 28.57% 29.58%   London Business School 89.66% 64.29% 84.72%   ChicagoDAO 31.03% 57.14% 36.11%   Llama 94.74% 92.86% 94.37%   Jason Yanowitz 37.14% 37.50% 39.02%   RiskDAO No Data No Data No Data   ConsenSys No Data No Data No Data   CalBlockchain No Data No Data No Data     Communication For Communication, GovAlpha tracks how Recognized Delegates have communicated their votes. Recognized Delegates are rewarded with a higher score for providing the reasoning behind their voting decisions. The metric looks at votes from the last 120 days. For example, a score of 100% would mean a Recognized Delegate communicated all of their voting decisions and gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Delegate communicated their decisions but did not provide any reasoning for these decisions. Their scores for each vote are combined to give an overall communication rating. At the end of October, the Delegate Metrics for Communication were as follows:     Delegate Name Overall Communication     Flip Flop Flap Delegate LLC 100%   Hasu 5.56%   Doo 100%   JustinCase 100%   Feedblack Loops LLC 94.85%   schuppi 100%   Flipside Crypto 98.44%   Penn Blockchain 100%   GFX Labs 97.14%   Chris Blec 100%   ACREinvest 100%   Gauntlet 73.33%   mhonkasalo & teemulau 84.29%   Llama 95.31%   [email protected] 90.77%   monetsupply 0%   London Business School 90%   ChicagoDAO 0%   pvl 97.37%   ONESTONE 100%   Frontier Research LLC 100%   Jason Yanowitz 0%   Codeknight 100%   RiskDAO No Data   ConsenSys No Data   CalBlockchain No Data     Delegate Sourcecred October was the fifth and final month that GovAlpha ran the sourcecred program for Recognized Delegates, rewarding contributions from both Recognized Delegates and the entire community with DAI. Payments were sent to opted-in delegates who had received cred for their posts on 2022-11-04. The breakdown of payments was as follows, where delegates represent a team or group, only one account may participate, the participating account has been indicated:     Delegate Amount (DAI)     schuppi 543   Flip Flap Flop Delegate LLC 502   Flipside Crypto (rspa) 469   Doo 307   ACREinvest 304   Codeknight 273   ONESTONE 260   Frontier Research LLC 237   GFX Labs (GFXlabs) 217   Chris Blec 194   Llama (Llama) 156   Feedblack Loops 155   JustinCase 144   RiskDAO (nonstopTheo) 138   Penn Blockchain (Juanbug) 54   pvl 38   [email protected] ([email protected]) 10     Executive Votes By looking at how long it takes for an Executive Vote to pass, we can infer whether or not the Recognized Delegates are helping streamline the Governance Process. In October, the Governance Facilitators and Protocol Engineering Core Unit posted four Executive Votes to the voting portal. All of these votes passed successfully.     Executive Vote Date Posted Date Passed Duration (Days)     Monetalis Clydesdale (RWA007-A) Onboarding, Funding Ambassador Program SPF, Core Unit MKR Streams and Transfers - October 5, 2022 2022-10-04 2022-10-06 2   Collateral Auction Parameter Changes, MOMC Parameter Adjustments, Recognized Delegate Compensation for September - October 14, 2022 2022-10-13 2022-10-14 1   Enable DC-IAM for RWA-007-A (Monetalis Clydesdale), GUSD PSM Parameter Changes - October 13 , 2022 2022-10-18 2022-10-21 3   rETH Technical Onboarding, Enable Starknet DAI Bridge Fees - October 26, 2022 2022-10-25 2022-10-28 3     Delegate On-boarding At the end of October there were no new applications to become Recognized Delegates. If anyone else wants to hear more about becoming a Recognized Delegate or has any questions, please reach out to one of the GovAlpha team. We will be happy to help. To review the Recognized Delegate documentation, please see the Maker Operational Manual.  Previous Delegate Round-ups  June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021  ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366",
                        "https://forum.makerdao.com/t/penn-blockchain-delegate-platform/14419",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473",
                        "https://forum.makerdao.com/t/hasu-delegate-platform/13892",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://forum.makerdao.com/t/blockchain-columbia-delegate-platform/15202",
                        "https://forum.makerdao.com/t/chicagodao-delegate-platform/15358",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203",
                        "https://forum.makerdao.com/t/chris-blec-delegate-platform/15544",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298",
                        "https://forum.makerdao.com/t/jason-yanowitz-delegate-platform/17408",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675",
                        "https://forum.makerdao.com/t/riskdao-delegate-platform/18125",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246",
                        "https://forum.makerdao.com/t/calblockchain-delegate-platform/18407/2",
                        "https://www.makerdao-governance-dashboard.com/",
                        "https://vote.makerdao.com/delegates",
                        "https://vote.makerdao.com/address/0x0f4be9f208c552a6b04d9a1222f385785f95beaa#metrics",
                        "https://mips.makerdao.com/mips/details/MIP4c2SP24",
                        "https://etherscan.io/tx/0x8b968fbfc5ad3bfc368ad6ce3d2c63d859e30b680fc337be281e497f13c088ba",
                        "https://manual.makerdao.com/governance/what-is-delegation",
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630/",
                        "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
                        "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
                        "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
                        "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
                        "https://forum.makerdao.com/t/delegate-round-up-november-2021/12082",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2021/11336"
                    ],
                    "GPT-summary": "The post provides an overview of the Recognized Delegates operating within Maker Governance, including their metrics and performance. It also includes a breakdown of payments to Recognized Delegates and a review of the Executive Votes posted to the voting portal. The post is an explanation of the Delegate Round-up for October 2022 and does not advertise or ask for collaboration on any proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.543232808857809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ihsotas",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/11/2022-05:40:23",
                    "content": "I love the way maker is handling the entire governance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ]
}