{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/solar-company-defi/10274",
            "title": "Solar Company Defi ",
            "index": 10274,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jason_Perkins",
                    "index": "#1",
                    "likes": "5",
                    "time": "11/09/2021-14:06:16",
                    "content": "Hi, My Solar company had a leadership meeting yesterday and we were discussing trying to develop a defi solution for residential Solar Power installs as an alternative to standard financing we use.  To say the least we are all very uninformed on this topic and don’t even know if it’s possible?  Would anybody be able to educate or help us understand if this is a possibility?  A typical solar install is @ 35k USD and is secured via lien on the residence.  With the new federal incentives coming we feel setting this up would be a game changer, we just don’t know if it can be done …. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.981060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/09/2021-12:37:05",
                    "content": "@SebVentures or @Nadia? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "6",
                    "time": "13/09/2021-13:45:01",
                    "content": "Hi Jason, Solar energy seems to be liked by MKR token holders as they approved a $21M loan to a solar farm (deal still not closed). The Real-World Finance Core Unit (my team) is not providing structuring advice, but I can point you to RWA Co (@g_dip ) and Centrifuge (@_LS ) which have both successfully onboarded assets into MakerDAO. Happy to have my team work on your project post-application. ",
                    "links": [
                        "https://centrifuge.io/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cripe98",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/09/2021-17:04:59",
                    "content": "Hi Jason, I am a founding member of a project meant to help donate and finance people and ideas. We could partner with you guys at letsgo.finance if you want. I actually wanted to offer to partner with Maker if they are up to it. Looking for partnerships right now. DeFi or otherwise. Also my brother builds homes and wants them to be solar ready so we went over a lot of solar ideas just a few weeks ago. I want to set up a wind generator on my farm but I’m tempted by solar even with freezing and dark winters here. I personally run a tech company and have contacts if you need any development work or contacts. Love solar and want to help basically. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.522321428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jason_Perkins",
                    "index": "#5",
                    "likes": "0",
                    "time": "13/09/2021-17:30:02",
                    "content": "Thank you sir. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jason_Perkins",
                    "index": "#6",
                    "likes": "1",
                    "time": "13/09/2021-17:30:48",
                    "content": "Phillip, Thank your for responding.  I have forwarded to my CEO and VP and will advise. Thanks!! Jason ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "0",
                    "time": "13/09/2021-18:10:06",
                    "content": "    SebVentures:  The Real-World Finance Core Unit (my team) is not providing structuring advice, but I can point you to RWA Co (@g_dip ) and Centrifuge (@_LS ) which have both successfully onboarded assets into MakerDAO.   Any future plans in hiring someone with superb Project Finance experience? ",
                    "links": [
                        "https://centrifuge.io/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.916666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "0",
                    "time": "13/09/2021-19:13:40",
                    "content": "We already have @christiancdpetersen which is both a project finance guy and a lawyer guy. Sadly not full-time. I’m hiring more on the securitization side. Project finance can be seen as securitization, but it’s specific. Let me see how project finance works with SolarX works and let’s discuss it. We will need a full dedicated CU if you want to scale project finance. The project of @Jason_Perkins would not fall under this case has I guess his company would have the management side. From a lender perspective, it’s more stats than a dedicated project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6000000000000005
                }
            ]
        }
    ]
}