{
    "poll_list": [
        {
            "title": "Inclusion Poll for MIP12c2-SP5 - COMP Collateral Onboarding - September 14, 2020",
            "index": "4065",
            "option": "Yes",
            "supporting_mkr": "91,504",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip12c2-sp5-comp-collateral-onboarding/4065",
            "title": "MIP12c2-SP5: COMP Collateral Onboarding ",
            "index": 4065,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "collateral-onboard",
                "comp",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#1",
                    "likes": "7",
                    "time": "10/09/2020-00:12:55",
                    "content": "MIP12c2-SP5: COMP Collateral Onboarding Preamble MIP12c2-SP: 5 Title: Domain work requirements for onboarding the COMP collateral type Author(s): @Niklas Kunkel (@NiklasKunkel) Contributors: Charles St.Louis (@CPSTL) Status: Formal Submission (FS) Date Proposed: 2020-09-09 Date ratified: <yyyy-mm-dd>  Specification Summary This proposal defines the documentation and work requirements for the onboarding of the COMP Collateral type to the Maker Protocol, explicitly highlighting the domain teams’ objectives and work requirements needed to get it implemented to the Maker Protocol. If this proposal is ratified, the COMP collateral type will be added to the Maker Protocol allowing anyone to lock COMP in a Maker Vault to generate Dai. Proposal Details This subproposal contains the domain work products required for the COMP collateral asset to be added to the Maker Protocol. More specifically, it includes the risk parameters, oracle solutions, and the necessarily smart contracts required for the successful onboarding of COMP.   Risk Domain Work: The risk domain team’s work contains the following risk assessment for the COMP collateral type:  [COMP] Risk Domain Team Assessment    Smart Contracts Domain Work: The smart contracts domain team’s work required to get COMP added to the Maker Protocol includes an assessment of the general and technical information about the COMP token, a risk summary, formal verification considerations, audits & related documentation, a contract logic summary, administrative addresses, and lastly a contract risk summary. The full assessment can be viewed below:  [COMP] ERC20 Token Smart Contract Domain Team Assessment    Oracles Domain Work: The oracles domain team’s work required to get COMP added to the Maker Protocol, includes making sure the oracle price feeds to support the new collateral type are prepared. The full assessment can be viewed below:  [COMP] Oracle Domain Team Assessment    Motivation The goal of this proposal is to provide transparency to the Maker Community as to what the domain teams’ (Risk, Smart Contracts, and Oracles) work consists of in order to successfully add the COMP collateral type to the Maker Protocol. Relevant Information  MIP6 MCD Application: Compound [COMP] Collateral Status Index   ",
                    "links": [
                        "https://forum.makerdao.com/t/comp-collateral-onboarding-risk-evaluation/4049",
                        "https://forum.makerdao.com/t/comp-erc20-token-smart-contract-domain-community-assessment/3587",
                        "https://forum.makerdao.com/t/mip10c3-sp9-proposal-compusd-oracle-collateral-onboarding-oracle-assessment/4045",
                        "https://forum.makerdao.com/t/comp-mip6-collateral-onboarding-compound/3024",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-14/4450",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-pt-br-portugues/4328",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313",
                        "https://forum.makerdao.com/t/maker-relay-ep-13/4310",
                        "https://forum.makerdao.com/t/weekly-mips-update-15/4243",
                        "https://forum.makerdao.com/t/maker-relay-ep-12/4153",
                        "https://forum.makerdao.com/t/relay-ep-14-en-espanol/4457",
                        "https://forum.makerdao.com/t/weekly-mips-update-16/4536"
                    ],
                    "GPT-summary": "The post is a formal submission proposing the onboarding of the COMP collateral type to the Maker Protocol. The proposal defines the documentation and work requirements for the onboarding, highlighting the objectives and work requirements needed to get it implemented. The post contains risk assessments, smart contract domain work, and oracles domain work required for the successful onboarding of COMP. The goal of the proposal is to provide transparency to the Maker Community as to what the domain teams' work consists of to add the COMP collateral type to the Maker Protocol.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.620902906617192
                }
            ]
        }
    ],
    "group_index": "2687"
}