{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/vault-liquidation-mechanism-for-centrifuge-trade-finance-assets-a-pre-mip-discussion/3737",
            "title": "Vault Liquidation Mechanism for Centrifuge Trade Finance Assets: A Pre-MIP Discussion ",
            "index": 3737,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "centrifuge"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#1",
                    "likes": "16",
                    "time": "19/08/2020-22:38:27",
                    "content": "Vault Liquidation Mechanism for Centrifuge Trade Finance Assets: A Pre-MIP Discussion Centrifuge helps asset originators such as ConsolFreight and Harbor Trade Credit tokenize real world assets. Our contracts mint an ERC20 Token (DROP) that represents a security in the pool (to learn more, read our thread here. A key problem for Maker is a reliable process to liquidate a Maker vault backed by these tokens. When a legal entity invests in a pool they enter a legal contract with the issuer and therefore get a claim on the assets in the SPV. When Maker liquidates a Vault backed by these tokens it must have a way to get the DAI repaid by that was generated in the Vault. We are proposing a liquidation mechanism for short-term loan collateral powered by Centrifuge that does not need an auction without any additional legal structures. The solution proposed here does not work for all of our asset classes, specifically it only makes sense for assets that have a maturity of 90 days or less. For longer term assets an auction mechanism is probably still a better solution. Assets that fit into this category are receivables, payables, or short term inventory financing. Three asset origintors use Centrifuge and fit into this category. They have ongoing pools of loans and have submitted their MIP6 proposals: Harbor Trade Credit, ConsolFreight and Paperchain. Auctioning off the collateral or liquidating the underlying loans Maker’s crypto assets are liquidated through short-lived auctions where keepers immediately flip these assets to get liquidity and can profit on very low margin trades. Highly volatile crypto assets can quickly decrease in value and borrowers get liquidated from one hour to the next. It is a common occurrence. Trade finance assets are different. Valuation is stable and defaults are low. According to the International Chamber of Commerce (ICC), global trade finance default rates from 2008-2018 have been well below 1% per year. Asset Originators factor in expected defaults into their interest rate calculations. For a keeper to participate in an auction, they need to appropriately price the value of the collateral. This is a much slower process if you need to value a pool of loans compared to say ETH. The additional complexity for pricing these assets coupled with the infrequent occurrence of liquidations means that when such a liquidation happens, it requires more time for a keeper to assess the value of the collateral. While there is a large market of distressed private credit investors, their work as a potential keeper will be different, more expensive, and slower. The obvious solution if one wanted to stay with auctions would be to extend the auction time frame to days or even weeks to allow for these private credit investors to do their due dilligence and get the necessary liquidity. Which makes this entire process very slow given that the underlying assets have a maturity of less than 90 days. There is an simple alternative which results in more DAI to be recovered for Maker: Instead of trying to liquidate the shares (ERC20 tokens) of the pool on the market you can liquidate the underlying portfolio of loans as it matures. You simply prevent the asset originators from issuing any new loans and use all loan repayments to repay investors. This is winding down the pool on maturity of the last loan. For a pool of loans with a maturity date of 60 days (a normal value for trade finance assets) you would see already half of the pool repaid in 30 days. When given the choice of selling the collateral in an auction over 10 days at a severe discount or just waiting for 60 days for the portfolio to completely mature, letting the portfolio mature is the more sensible choice: it results in a better liquidation price for Maker than trying to find a distressed loan buyer in an illiquid market. Looking at the traditional financial industry you can confirm this as well: the distressed private credit buyers rarely trade in short term assets such as invoices as this is simply not worth it for either side. In short: Letting a portfolio of relatively short term loans mature and by stopping the origination of new loans instead of auctioning it off is a reasonable liquidation mechanism for Maker. How could this work in MakerDAO with our assets? Our Tinlake Pools are revolving pools and function very similarly to mutual funds. As long as investors don’t ask for any investment to be returned, the asset originator can continuosly reinvest the capital in the pool. When an investor wants their investment returned, any repayments from borrowers are routed to the investors wanting to redeem their investment. In Tinlake this all happens on chain. The smart contracts manage cash flows from borrowers and investors. When an investor wants to join a pool, they deposit DAI and the contract mints DROP tokens representing a share in the pool to the investor. This token accrues interest and the contract will allow it to be redeemed for DAI. When an investor wants to leave the pool, they request redemtion. This redemption request prevents any new loans to be originated and DAI flowing back into the pool will be used to redeem investors. If there is more demand for redemptions they will be made pro-rata to all investors that want to be redeemed. If there is more capital available, then that amount is made available to the asset originator to originate new loans. This rebalancing is done on a daily basis and is explained in this thread in more detail: Centrifuge: Onboarding RWA Backed Collateral to MCD 1054×1082 35.9 KB Using DROP Redemptions to liquidate a Vault Maker’s smart contracts are built in a modular way and allow for custom liquidation mechanisms depending on the collateral type. Currently ETH and other non-stablecoin collaterals use the Flipper Auction contract while USDC has no liquidations at all. There is also a discussion for upgrading liquidations for other asset types. For Vaults backed by the assets issued on Centrifuge, we can create an auction mechanism that allows Maker to automatically trigger the redemption request. As loans are being repaid, Maker automatically receives DAI from the Tinlake contracts guaranteeing that they get their share of DAI in the pool. Liquidations1135×1102 43.9 KB We are working to have a prototype implementation of the Tinlake Flipper contract ready to show to the community soon. How can the DAO be sure the SPV redeems its DROP tokens Our pools are backed by different investors. They sign a subscription agreement that binds the SPV and the Asset Originator to repay them their DAI plus interest when they want to exit the pool. The SPV is issuing a security and this process is enforced with legal contracts: the investors sign a subscription agreement for their investment. In the context of Maker a question that comes up: if the DAO can’t sign a contract, then how is it protected by the same mechanisms that other investors get when they sign the subscription agreement? The agreement contractually binds the SPV to take any repayments by borrowers and deposit them in the Tinlake contracts and let these contracts decide if it can: 1) originate new loans or 2) if the money is needed to repay investors and no new loans can be originated. As long as MakerDAO can be sure that the Tinlake contracts are used to distribute the money to the investors it has a guaranteed claim on the assets that is equal to an investor’s without any legal relationship. The only way that these smart contracts can be circumvented is if all of the investors would agree to modify the subscription agreement to permit this. If all investors agreed to try to circumvent Maker and cut it out of the proceeds from the pool. If just one investor objects to this and doesn’t waive their right to be reimbursed through the Tinlake contracts, they can sue the SPV for securities fraud and have a solid argument in court. To translate this to crypto-lingo: if 1 of n investors is honest, Maker can’t be cut out. So all we need to make sure is that we have some honest investors that pledge to honour the legal agreement they enter into with the SPV. In the three months we have already had a few Maker community members (and MKR holders) invest in our first pools. These investors already have an interest in ensuring that Maker doesn’t get cut out and the DAO could even elect community members who take on this role by investing a nominal amount in the pools (in theory $1 is already enough to have a sufficient legal claim against the SPV). Next Steps This new liquidation mechanism solves two problems at once:  The challenge of recruiting keepers interested in RWA liquidation and how to design an auction mechanism suitable for these assets Coming up with a legal framework that supports the liquidation mechanism: how can the DAO and the SPV safely issue these securities without violating any securities law?  We believe with this liquidation mechanism we don’t see any major obstacles anymore to proceeding on boarding these assets and want to accelerate this process. As a next step, we are asking the community to provide feedback on this proposal in the next days. In parallel Centrifuge will work with the three asset originators that are a good fit for bringing the first real world assets into Maker:   ConsolFreight: Freight Shipping Invoices, originated 800k DAI to date, can scale to 1M DAI debt outstanding from MCD by EOY  Harbor Trade Credit: Trade Finance, going live with a pool of 290k DAI in the coming days, can scale to 5M DAI debt outstanding from MCD by EOY  Paperchain: Music Streaming Royalties, financed 105k DAI in assets to date, can scale to 500k debt outstanding from MCD by EOY We expect to see at least three more asset originators to go live in the coming months that will look to Maker for financing.  In parallel, we are open to implementing this liquidation mechanism in Solidity and provide it to the community to review and comment on. As a result of this, we want to propose a new MIP that streamlines the on boarding for short term assets using Centrifuge following this mechanism. We’re looking forward to your feedback! ",
                    "links": [
                        "https://forum.makerdao.com/t/htc-drop-mip6-application-harbor-trade-credit-drop-short-term-trade-receivables/3502",
                        "https://forum.makerdao.com/t/centrifuge-onboarding-rwa-backed-collateral-to-mcd/2721",
                        "https://forum.makerdao.com/t/centrifuge-onboarding-rwa-backed-collateral-to-mcd/2721",
                        "https://iccwbo.org/media-wall/news-speeches/icc-trade-register-report-reveals-potential-impact-of-covid-19-on-trade/#:~:text=Results%20indicate%20that%20default%20rates,all%20when%20weighted%20by%20obligor",
                        "https://forum.makerdao.com/t/centrifuge-onboarding-rwa-backed-collateral-to-mcd/2721",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/2X/b/bc184cbdcc8b33980e2ec17d97b1b62d4ab86654.png",
                        "https://forum.makerdao.com/t/liquidations-system-1-2-upgrade-timeline/3592",
                        "https://forum.makerdao.com/t/cf-drop-mip6-application-consolfreight-drop-tokenized-freight-shipping-invoices/2214/1",
                        "https://forum.makerdao.com/t/htc-drop-mip6-application-harbor-trade-credit-drop-short-term-trade-receivables/3502",
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215/26",
                        "https://forum.makerdao.com/t/mip22-centrifuge-direct-liquidation-module/3930",
                        "https://forum.makerdao.com/t/kf-drop-mip6-application-kickfurther-drop-consignment-inventory-finance-for-ecommerce-retail-brands/4064",
                        "https://forum.makerdao.com/t/ns2drp-ns-drop-mip22-token-smart-contract-domain-team-assessment/5517",
                        "https://forum.makerdao.com/t/rwa003-cf4drp-cf-drop-mip22-token-protocol-engineering-domain-team-assessment/8382",
                        "https://forum.makerdao.com/t/rwa004-ht2drp-htc-drop-mip22-token-protocol-engineering-domain-team-assessment/8416",
                        "https://forum.makerdao.com/t/rwa005-ff1drp-fft1-drop-mip22-token-protocol-engineering-domain-team-assessment/8417",
                        "https://forum.makerdao.com/t/mip22-modulo-de-liquidacion-directa-de-centrifuge/5011",
                        "https://forum.makerdao.com/t/kf-drop-mip6-application-kickfurther-drop-consignment-inventory-finance-for-ecommerce-retail-brands/4064/2",
                        "https://forum.makerdao.com/t/mip13c3-sp5-declaration-of-intent-maker-to-commence-onboarding-work-of-centrifuge-based-collateral/4059",
                        "https://forum.makerdao.com/t/reinno-mip6-collateral-onboarding-application/3891/4",
                        "https://forum.makerdao.com/t/weekly-mips-update-13/3906",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-106-thursday-august-20-4-00-pm-utc/3657/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793",
                        "https://forum.makerdao.com/t/rwa006-pp1drp-p1-drop-mip22-token-protocol-engineering-domain-team-assessment/8418"
                    ],
                    "GPT-summary": "The post discusses a proposed liquidation mechanism for short-term loan collateral powered by Centrifuge that does not need an auction without any additional legal structures. The solution proposed here does not work for all of their asset classes, specifically it only makes sense for assets that have a maturity of 90 days or less. The post also explains how the DAO can be sure the SPV redeems its DROP tokens and proposes a new MIP that streamlines the onboarding for short term assets using Centrifuge following this mechanism. The author is asking for feedback from the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.706008364063919
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "3",
                    "time": "19/08/2020-22:55:22",
                    "content": "Great post. I’m sure others that are smarter than me on this stuff will have questions/comments but I’m really excited with what you have presented here and am looking forward to the next steps. Really interesting/ingenious liquidation solution. Great job! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.395833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "9",
                    "time": "20/08/2020-00:56:16",
                    "content": "A total game-changer for the entire Ethereum community! We will no longer be known as the community that chases meme coins, but as a community who brings Real World Assets to DeFi! I am super excited about onboarding RWA, and Centrifuge has put in a lot of hard work and dedication to make this happen. With the help of the Maker Foundation and our strong community we are NOT only that much closer to introducing Trade Finance, but we are also helping the struggling Artist who rely on Label Payments to make a living. Artist can now have access to faster payments, as oppose to waiting many months for their hard earn Money. We as the Maker Community will make a difference. Little by little, it is All coming together. As far as how this will work with regards to liquidations, IMO Lucas has written a very detailed explanation on how we can liquidate debt (if necessary). I also know that the rate of defaults in Trade Finance with short-term paper is very low. The explanation of revolving pools should be very familiar for anybody who has invested in Mutual Funds. There is a reason why Mutual Funds liquidate in an orderly fashion. Think about the concept. To end my rant  —I believe it is very important that we focus on creating boring value, because if the Large World Banks can provide the masses boring banking products, so can the Maker Community. Let us start creating an even-playing field boys & girl. I know we can. “The reality is, if you plan to start something great these types of opportunities are extremely rare. Maybe even once in a lifetime. After all, great opportunities will not wait.” -Mike Maples Jr. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.57502380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "2",
                    "time": "20/08/2020-11:32:03",
                    "content": "Great post, Lucas, really clear and well explained. Thanks! Just a few thoughts:     spin:  If just one investor objects to this and doesn’t waive their right to be reimbursed through the Tinlake contracts, they can sue the SPV for securities fraud and have a solid argument in court. To translate this to crypto-lingo: if 1 of n investors is honest, Maker can’t be cut out. So all we need to make sure is that we have some honest investors that pledge to honour the legal agreement they enter into with the SPV.   This seems pretty solid. Would Centrifuge be willing to invest a token amount in DROP for each asset onboarded to the Maker Protocol to provide an extra layer of assurance that there would be one more actor willing to challenge the SPV in court?     spin:  As a result of this, we want to propose a new MIP that streamlines the on boarding for short term assets using Centrifuge following this mechanism.   Excited to see what you come up with here!  One final question. Allowing the loans to wind down works well so long as everything is above-board with the trade finance asset originators. I seem to recall from one of the collateral meetings that liquidation in this manner wouldn’t work in the event of fraudulent activity on the part of the projects involved? Could you maybe speak to the recourse available to Maker and other investors in this (admittedly very unlikely) scenario? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.848129301254302
                },
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#5",
                    "likes": "9",
                    "time": "20/08/2020-11:41:29",
                    "content": "I think this is a great general insight about liquidations for short-maturity assets which are not readily traded: it makes a lot more sense for MakerDAO to force a wind-down the portfolio and wait for the loans to mature instead of trying to dump them quickly. This also removes the need to onboard multiple credible liquidation keepers for real world assets provided that the underlying assets of the pool are short-term loans (like in trade finance), which seemed like one of the major blockers for moving forward? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.172916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#6",
                    "likes": "1",
                    "time": "20/08/2020-15:04:39",
                    "content": "@spin thanks for the clarifications provided with this post. Very valuable.     spin:  Instead of trying to liquidate the shares (ERC20 tokens) of the pool on the market you can liquidate the underlying portfolio of loans as it matures. You simply prevent the asset originators from issuing any new loans and use all loan repayments to repay investors. This is winding down the pool on maturity of the last loan. For a pool of loans with a maturity date of 60 days (a normal value for trade finance assets) you would see already half of the pool repaid in 30 days.   Regarding these delayed debt service agreements, my understanding from reading the post is that basically the pool would let these short-term loan facilities to move into deliquency buckets as they come into maturity. And the agreement would basically give these facilities a “loan holiday” while it tries to renegotiate a sort of “debt consolidation” position that allows the borrower to end up paying the totality of its exposure only with some delay. How is the contract set to account for the accrued interests while the facility runs into delinquency even though the loan has arrived at maturity? I think this is important to make sure that there is still substantial incentive for the borrowers to actually finishing up paying the debt or renegotiating new terms. To sum up, preventing new originations is just one side of the story. The liquidation process needs to make sure payments still happen even after a facility is delinquent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.605271464646464
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#7",
                    "likes": "0",
                    "time": "20/08/2020-15:29:07",
                    "content": "This is an interesting idea worth exploring. What triggers the liquidation ? If there’s a price oracle for the portfolio tokens, then at least someone is pricing these assets. Whether it’s a market of a trusted rater, that’s already some information available to market participants. Could you say more about why it would be such a bad idea to have a regular auction with regular timeframes? My instinct is to rather let specialists buy these distressed loans’ cashflow from Maker at slashed prices and reduce Maker’s total exposure. I see an argument that Maker has essentially infinite liquidity and is thus well-positioned to take the time to receive as much value from the liquidated collateral as possible. But the level of intermingling with legal risk (the whole “1 of n” in a legal context) is high enough that it currently looks to me better delegated to specialists. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.540000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#8",
                    "likes": "3",
                    "time": "20/08/2020-16:22:50",
                    "content": "Thanks for the great feedback so far!     LongForWisdom:  This seems pretty solid. Would Centrifuge be willing to invest a token amount in DROP for each asset onboarded to the Maker Protocol to provide an extra layer of assurance that there would be one more actor willing to challenge the SPV in court?   Yes, definitely. We have participated in most pools so far and would definitely do so for anything that I personally would feel comfortable suggesting for collateral on-boarding. We actually have in the past not just taken part of the DROP (senior tranche) but also invested in TIN (the junior tranche taking the first loss) and have a very leveraged exposure to these assets.     LongForWisdom:  Could you maybe speak to the recourse available to Maker and other investors in this (admittedly very unlikely) scenario?   If a portfolio needs to be liquidated because the entire portfolio is fraudulent, that is most likely going to lead a loss for MakerDAO no matter how the liquidations are designed because no keeper or other mechanism would be able to liquidate. Similarly to the scenario where it becomes publicly known that accounting fraud at an issuer of a centralized stablecoin lead to a USDC/USDT/… is not backed by a dollar anymore. Typically the cost of recovering through fraud at that scale is very very hard. To take a recent example, who’s willing to bet that any of the Wirecard funds will ever be returned? Not many. There are a few things we can do though:  To start out, as a community we should do careful due diligence on all these assets. Asset originators are sharing information about their business and risk models and how they underwrite.  But more long term also the the following makes sense.  Loan by loan pricing and risk oracles: a big reason why we put all of this information about individual loans on chain is because we want oracles to provide information on individual loans. If we can get several independent entities to confirm that the loan exists, that the borrower exist and any information on the likelihood the individual loan gets repaid we limit the extent to which an asset originator can manufacture assets or misrepresent a pool. One interesting source of data we are researching at the moment is for example trade credit insurance rates which are a pretty good proxy for default risk. We are working on decentralizing the underwriting functionality that is currently done by the Asset Originator. Having multiple underwriters control what loans can get added to a pool and creating the right incentives for these underwriters can further reduce the risk that a single entity in the system might act fraudulently.  Of course we have to remember that all of these scenarios are cases of fraud and criminal offenses. Not protecting at all against these of course isn’t a good choice but it’s not a commonplace occurrence.     equivrel:  This also removes the need to onboard multiple credible liquidation keepers for real world assets provided that the underlying assets of the pool are short-term loans (like in trade finance), which seemed like one of the major blockers for moving forward?   Yes we believe so. That’s why we’re proposing to turn this into a MIP and get the community’s approval to go ahead with this structure to onboard the first RWA to Maker!     williamr:  How is the contract set to account for the accrued interests while the facility runs into delinquency even though the loan has arrived at maturity?   It depends case by case but the generally these loans do have an increased interest rate once the maturity date of the loan is hit. So yes, they are incentivized to repay speedily. The SPV will also be able to send a collections agency to the borrower past the maturity date and use legal means to enforce repayment. One thing that shouldn’t be forgotten: Maker might decide to liquidate a portfolio if a small percentage of the borrowers are delinquent causing the value of the portfolio to go down. If an asset originator has a diversified portfolio of loans coming from many businesses then the default of just one shouldn’t affect the rest. Therefore the remaining loans will be repaid and even without any special collections proceedings these loans will be repaid and the Vault would see that part of the portfolio repaid.     swakya:  But the level of intermingling with legal risk (the whole “1 of n” in a legal context) is high enough that it currently looks to me better delegated to specialists.   @swakya thanks for your comment and I see your concern. Specifically what the situation would have to look like is that every single investor in a portfolio of loans would have to decide to sign an agreement that would invalidate the agreement in place that ensures the Vault would get repaid. If only one party declined to sign this agreement the SPV would not be able to cut out the Vault without committing securities fraud. There is no real limit as to how much an investor must invest (1 DAI is enough) and we can add dozens of these investors. The number of people that would need to decide to act maliciously makes this a very very low risk and one that centralized stablecoins and WBTC also carry. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.561524470899471
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#9",
                    "likes": "1",
                    "time": "21/08/2020-00:58:58",
                    "content": "Thank you very much for the detailed answers. Let me try to approach from another angle by looking at the system one individual piece at a time. If Maker liquidates a vault, multiple actors could want to manage the claims in the vault. Actor A could be confident in the future value of the claims and not try to stop loan originations. Actor B could ask for its money back as fast as repayments come in. Actor B could be a team within Maker governance. It has some idea of how much money it could recoup by redeeming its loan share, and it could bid like any other entity up to the amount it expects to earn. If you identify Actor B with Maker, you can picture a system where Maker itself can bid on its liquidations with a preannounced bidding policy. In a dutch auction that’s the same as a price floor on the auction. Once the price reaches that floor, the auction fails and Maker takes possession of the assets and triggers the liquidation procedure internal to the loan portfolio. Now unless I’m mistaken, what you describe is equivalent to what I’m describing, but with the auction price floor equal to the auction starting price. The auction fails immediately every time and Maker manages the asset. Why not relax this restriction and allow Maker to try and sell the assets above some price floor (surely if the liquidation has been triggered, Maker has some idea of the value inside the vault) lower than the auction starting price? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.35875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#10",
                    "likes": "4",
                    "time": "21/08/2020-15:48:21",
                    "content": "I’m not quite sure I understand what you mean. I think this is most easily explained with an example. I will show below. One thing to keep in mind is that compared to other investors, Maker will most likely want to be the most conservative investor and liquidate much quicker than others. There are mechanisms we can build on top of this to allow for more flexbility in price or allow some price discovery beyond pro-rata redemptions based on the share of your pool. It’s definitely something we will research. Here’s the example. It does not take interest payments and overcollateralization into account but that is easy to add): Let’s assume we have a portfolio of three loans:  Invoice 1 - 500 DAI - Due in 5 days Invoice 2 - 500 DAI - Due in 30 days Invoice 3 - 1000 DAI - Due in 90 days  There are 2 investors each investing 500 DAI receiving 500 DROP (the share token of the pool) and we have a vault with 1000 DAI in debt collateralized with 1000 DROP. Now for some reason the Vault gets liquidated. There are a different scenarios that can happen. Let’s look at two: MakerDAO is the only DROP holder at first that wants to liquidate Here’s what happens:  The DAO wants to liquidate immediately and asks to redeem 1000 DROP Other investors still believe this is a good investment and decide to hold their DROP  The pool keeps track of the DAO’s order:  Redeem 1000 DROP to Vault = 1000 DROP (worth 1000 DAI) pending redemptions on day 1  When the first payment of 500 DAI comes in after 5 days, pending redemptions can occur:  Vault receives 100% -> 500 DAI returned for 500 DROP burned Pending redemptions are now 500 DROP  After 10 days, another investor (A) would like to redeem. Redemption orders are now:  Redeem 500 DROP to Vault Redeem 500 DROP to investor A Pending Redemptions are now 1000 DROP worth 1000 DAI.  (If no loans get repaid after this because they’re complete defaults, the Vault would have lost 50%) After 30 days invoice 2 gets repaid. There are 1000 DAI available; all pending redemptions can be repaid.  Vault is completely repaid-> 500 DAI returned for 500 DROP burned Investor A gets their full investment back -> 500 DAI returned for 500 DROP burned  The pool is now “healthy” again. There are no pending redemptions. There are 500 DROP outstanding and one loan worth 500 DAI. After 90 days the loan gets repaid. Because there are no pending redemptions at the time of repayment, the asset originator can use the 500 DAI to originate a new loan. Worst case: Other investors want to exit the pool as well Here’s what happens:  The DAO immediately asks to redeem 1000 DROP Other investors who’ve lost confidence in the pool also ask to redeem DROP  The pool keeps track of these orders:  Redeem 1000 DROP to Vault Redeem 500 DROP to investor A Redeem 500 DROP to investor B = 2000 DROP (worth 2000 DAI) pending in redemptions on day 1.  When the first payment of DAI 500 comes in after 5 days, it is then split up:  Vault receives 50% -> DAI 250 returned for 250 DROP burned A receives 25% -> DAI 125 returned for 125 DROP burned B receives 25% -> DAI 125 returned for 125 DROP burned  (If no more repayment happens, the Vault would have lost 75%) When the second payment comes in of DAI 1000 the same thing happens. The Vault would now have received 75% of the DAI owed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.745896464646465
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#11",
                    "likes": "2",
                    "time": "22/08/2020-22:45:56",
                    "content": "This is a very nice breakdown, thank you! It should be a great reference to point to in the future to explain how the system works.     spin:  allow some price discovery beyond pro-rata redemptions based on the share of your pool.   Yes! I’ll reuse your detailed example. When you say for some reason the Vault gets liquidated this means that internally, Maker is assigning a < 1000 DAI fundamental value to the 1000 DROP (there is no overcollateralization). Let’s say that valuation is 750 DAI. At this point it seems good for Maker to start by offering those 1000 DROP to anyone who thinks they’re worth more. One way to do this is a to start a liquidation auction with a 750 DAI price floor. If the 1000 DROP get sold above that, this is great for Maker; they get > 750 DAI today (no need to wait for repayments) and they are out of the DROP investor group. To be a little abstract, I think that 1) the decision to liquidate collateral and the mechanism by which that liquidation turns into cash should be decoupled and 2) as long as it can sell the collateral for enough Dai, Maker should strive to reduce its balance sheet sooner rather than later. I do like the mechanism you introduced here a lot and I look forward to seeing it in use. I don’t want to derail the thread more than I already have; this is a really great idea and it will probably be used for the liquidation of many collateral types. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.775735294117647
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "2",
                    "time": "28/08/2020-14:18:11",
                    "content": "Nice write up and good read on the Tin Token Design–highly recommend you brush-up your learning skillz on RWA/Trade Finance:    Centrifuge – 28 Aug 20    Token design proposal for underwriters to minimize trust in real-world assets How to Reassemble the Existing Financial Infrastructure A token model for underwriters to minimize trust in real-world assets  Centrifuge is a protocol for decentralized asset financing which lets businesses finance their real-world assets on-chain.... Reading time: 2 mins 🕑 Likes: 4 ❤      ",
                    "links": [
                        "https://discourse.centrifuge.io/t/token-design-proposal-for-underwriters-to-minimize-trust-in-real-world-assets/194"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#13",
                    "likes": "0",
                    "time": "29/08/2020-04:43:05",
                    "content": "Hello, Thanks for bringing forth the new proposal. I, for one, appreciate all the efforts made by your team to find a workable solution. That said, the most recent proposal raises a handful of questions that Centrifuge should address so that the DAO can conduct due diligence.  We are proposing a liquidation mechanism for short-term loan collateral powered by Centrifuge  that does not need an auction without any additional legal structures. The solution proposed here does not work for all of our asset classes, specifically it only makes sense for assets that have a maturity of 90 days or less. For longer term assets an auction mechanism is probably still a better solution.  Has Centrifuge worked with securities counsel in the design of this new proposal? If so, can you please (a) name the counsel, and (b) provide a memorandum from counsel explaining why this set-up no longer requires a broker-dealer? Alternatively, if you are uncomfortable sharing a memo or opinion, can you please summarize the legal analysis for how this proposed plan comports with relevant US securities law (all of the companies proposed by Centrifuge to date are, I believe, US-based).  Instead of trying to liquidate the shares (ERC20 tokens) of the pool on the market you can liquidate the underlying portfolio of loans as it matures. You simply prevent the asset originators from issuing any new loans and use all loan repayments to repay investors. This is winding down the pool on maturity of the last loan. For a pool of loans with a maturity date of 60 days (a normal value for trade finance assets) you would see already half of the pool repaid in 30 days.  This setup seemingly avoids the liquidation auctions by mashing the auction with the redemption, right? Perhaps the broker-dealer is not required for the auction as set up now, but what about with the sale of DROP from New Silver/Paperchain/Harbor Trade credit to investors? I searched for filings from all three companies on Edgar (https://www.sec.gov/edgar/search-and-access) and didn’t find anything, but maybe I used the wrong corporate names. And does Centrifuge receive any finder’s fee by directing investors through your website to the pools? I want to emphasize how crucial it is for the DAO to receive specifics on how the current Tinlake pools/DROP sales are conducted. To have confidence in Centrifuge’s new proposal and before on-boarding the proposed RWA collateral, we should see a historical pattern of compliant behavior from the company and its partners.  When an investor wants to join a pool, they deposit DAI and the contract mints DROP tokens representing a share in the pool to the investor. This token accrues interest and the contract will allow it to be redeemed for DAI.  Okay, as you state in other parts of the write-up, DROP is a debt security. Have the current issuers of DROP – New Silver, Harbor Trade or Paperchain – sold their tokens under a specific exemption (and, for instance, filed a Form D notice with the SEC)? I’m assuming that all of the issuers are US-based.  This rebalancing is done on a daily basis and is explained in this thread in more detail: Centrifuge: Onboarding RWA Backed Collateral to MCD 1  Is the TIN token still part of this model?  For Vaults backed by the assets issued on Centrifuge, we can create an auction mechanism that allows Maker to automatically trigger the redemption request. As loans are being repaid, Maker automatically receives DAI from the Tinlake contracts guaranteeing that they get their share of DAI in the pool. In the context of Maker a question that comes up: if the DAO can’t sign a contract, then how is it protected by the same mechanisms that other investors get when they sign the subscription agreement? The agreement contractually binds the SPV to take any repayments by borrowers and deposit them in the Tinlake contracts and let these contracts decide if it can: 1) originate new loans or 2) if the money is needed to repay investors and no new loans can be originated. As long as MakerDAO can be sure that the Tinlake contracts are used to distribute the money to the investors it has a guaranteed claim on the assets that is equal to an investor’s without any legal relationship. The only way that these smart contracts can be circumvented is if all of the investors would agree to modify the subscription agreement to permit this. If all investors agreed to try to circumvent Maker and cut it out of the proceeds from the pool. If just one investor objects to this and doesn’t waive their right to be reimbursed through the Tinlake contracts, they can sue the SPV for securities fraud and have a solid argument in court. To translate this to crypto-lingo: if 1 of n investors is honest, Maker can’t be cut out. So all we need to make sure is that we have some honest investors that pledge to honour the legal agreement they enter into with the SPV. In the three months we have already had a few Maker community members (and MKR holders) invest in our first pools. These investors already have an interest in ensuring that Maker doesn’t get cut out and the DAO could even elect community members who take on this role by investing a nominal amount in the pools (in theory $1 is already enough to have a sufficient legal claim against the SPV).  So, Maker would be the same as another investor in the pool? What occurs in the situation where there is a dishonest actor/investor, requiring another investor to bring a securities suit? Wouldn’t Maker’s claim to DAI from the pool become subservient to that of the investors initiating the lawsuit? My concern is that the DAO could easily be on the short end of the stick in case of dishonest actors/honest lawsuits. But that leads me to another worry. Do you believe that it provides adequate protection for the DAO to rely on investors to hire securities counsel, draft a complaint, and file an injunction to preclude the dishonest actor from stealing everything and escaping? And even if they can do those initial steps, pursuing recovery could take considerable (in other words, a long and indefinite) time and be prohibitively expensive. I understand the proposed new method may work from a game-theoretic perspective, yet it does not seem designed to provide the DAO with the maximum protections we should have. One other concern I have is that a dishonest investor fails to honor his or her legal agreement with the SPV and flees with the collateral, leaving the DAO with significant debt.  As a result of this, we want to propose a new MIP that streamlines the on boarding for short term assets using Centrifuge following this mechanism.  Would this MIP be limited to RWA issuers using the Centrifuge /Tinlake model? Or would it be general enough to be used by other parties, such as mrabino1’s proposed Delaware Trust model? ",
                    "links": [
                        "https://www.sec.gov/edgar/search-and-access",
                        "https://tinlake.centrifuge.io/",
                        "https://forum.makerdao.com/t/centrifuge-onboarding-rwa-backed-collateral-to-mcd/2721"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.322985381021095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#14",
                    "likes": "3",
                    "time": "30/08/2020-09:21:10",
                    "content": "    Tosh9.0:  Has Centrifuge worked with securities counsel in the design of this new proposal? If so, can you please (a) name the counsel, and (b) provide a memorandum from counsel explaining why this set-up no longer requires a broker-dealer? Alternatively, if you are uncomfortable sharing a memo or opinion, can you please summarize the legal analysis for how this proposed plan comports with relevant US securities law (all of the companies proposed by Centrifuge to date are, I believe, US-based).   Our legal counsel is Manatt (a law-firm that is very experienced with fintech, P2P lending and crypto law, just recently they grew their crypto/fintech team even more: https://www.crowdfundinsider.com/2020/08/165654-law-firm-manatt-boosts-fintech-practice-with-new-hires/). We do not have any materials that we can publish but have been consulting with them. If the community has the need to get a legal memo outlining the status of real world assets within MakerDAO this would be done best through a law firm that is specifically contracted to produce such a memo. We’re happy to cooperate on that, share our learnings and knowledge, and I would support a governance proposal for funding such a memo.     Tosh9.0:  This setup seemingly avoids the liquidation auctions by mashing the auction with the redemption, right?   Generally yes, though more precise would be to say: This setup seemingly avoids the liquidation auctions by mashing the Vault liquidation with the redemption. All of our SPVs have issued securities compliant with securities law in the US. So far none of these required a registration and were simply 506(b) sales for which registration is optional. Some of our asset originators are switching to 506(c) which requires registration but also allows public solicitation. I believe the first one of these will go live in September.     Tosh9.0:  And does Centrifuge receive any finder’s fee by directing investors through your website  to the pools?   Centrifuge is not brokering the sale of these securities or getting any finders fee. The SPVs have all worked with Manatt to ensure that the security offerings were done in a legally compliant way. If you would like to see the contract templates, I am happy to share previous versions with you and we intend to publish our legal contracts for the pools in September publicly ahead of time.     Tosh9.0:  Is the TIN token still part of this model?   Yes, I have omitted this part from the description of the liquidation but it is still part and in fact this has benefits for the liquidations themselves: Maker’s DROP tokens will always have priority in redemptions over any junior (TIN) token redemption. That means if the entire pool needs to be liquidated because all DROP investors want out, then Maker along with the other DROP investors will have recovered their share of the portfolio before any TIN investors have. That means it redemptions will be completed for Maker by the time the percentage of loans that equal the amount of money owed to the DROP tranche is repaid and not 100% of the portfolio.     Tosh9.0:  Wouldn’t Maker’s claim to DAI from the pool become subservient to that of the investors initiating the lawsuit? My concern is that the DAO could easily be on the short end of the stick in case of dishonest actors/honest lawsuits. But that leads me to another worry.   A key point here is that our smart contracts don’t give any other investors the ability to be treated differently than another investor. Therefore as long as any investor in the pool can force the SPV to distribute the funds through our contracts Maker will not be in this position. This is what I describe in the paragraph:     spin:  The agreement contractually binds the SPV to take any repayments by borrowers and deposit them in the Tinlake contracts and let these contracts decide if it can: 1) originate new loans or 2) if the money is needed to repay investors and no new loans can be originated.       spin:  The only way that these smart contracts can be circumvented is if all of the investors would agree to modify the subscription agreement to permit this. If all investors agreed to try to circumvent Maker and cut it out of the proceeds from the pool.       spin:  If just one investor objects to this and doesn’t waive their right to be reimbursed through the Tinlake contracts, they can sue the SPV for securities fraud and have a solid argument in court.   This means that just one investor willing to act in Maker’s interest can force the SPV to act in Maker’s interest with a solid legal claim.     Tosh9.0:  One other concern I have is that a dishonest investor fails to honor his or her legal agreement with the SPV and flees with the collateral, leaving the DAO with significant debt.   As I mentioned, the only way that Maker could be left out of this is by all investors in a pool colluding to void the contract initially signed with the SPV and agreeing on a new contract with the SPV that would circumvent Maker. If just one party does not sign this new agreement, the previous agreement would stay valid and that party can sue the SPV for securities fraud. It’s easy to add redundancies here: we can have many Maker community member invest small amounts in these pools and take on a similar role as Maker elected trustees in the Delaware trust model take on: they are the ones that can legally enforce the rights that the DAO can’t. I think the risk of this happening is low enough that it is safe for the DAO to pursue as one way of adding RWAs. Just compare this to USDC or TUSD as collateral: MakerDAO has no legal recourse to prevent the issuers of these coins to freeze any USDC held in the DAO as collateral.     Tosh9.0:  Would this MIP be limited to RWA issuers using the Centrifuge /Tinlake model? Or would it be general enough to be used by other parties, such as mrabino1’s proposed Delaware Trust model?   This only works because we do the loan portfolio liquidation on chain and can rely on our smart contracts to honor the Maker Vault’s redemption. It is specific to assets that can be liquidated this way. The Delaware Trust model needs to rely on trustees to wind down the portfolio and ensuring that the DAI raised from this liquidation is properly deposited into Maker’s smart contracts. ",
                    "links": [
                        "https://tinlake.centrifuge.io/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.557722312409813
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#15",
                    "likes": "2",
                    "time": "02/09/2020-17:38:00",
                    "content": "Thanks. Let me follow up on a few quick points:     spin:  If the community has the need to get a legal memo outlining the status of real world assets within MakerDAO this would be done best through a law firm that is specifically contracted to produce such a memo. We’re happy to cooperate on that, share our learnings and knowledge, and I would support a governance proposal for funding such a memo.   Aside from the fact that sharing formal legal memos regarding something like this is common commercial practice, your suggestion is not feasible. The DAO does not have a legal domain team yet, so we’re not equipped to cover these issues (nor should we, in my opinion, be allocating funds for a legal opinion/memo here to support Centrifuge’s product integrating with the DAO). However, if Centrifuge is keen to continue with this new plan, you all should at least summarize the justifications for why this strategy avoids the need for a broker/dealer. In my opinion, your team has a responsibility to provide the DAO with some analysis – the DAO doesn’t have the resources at this time to do this (as far as I know). Perhaps others disagree but I wanted to raise the point. Manatt is a big law firm with sophisticated lawyers, and they should help you prepare a response (bullet points, a summary or both).     spin:  All of our SPVs have issued securities compliant with securities law in the US. So far none of these required a registration and were simply 506(b) sales for which registration is optional.   The SPVs weren’t generally soliciting through Centrifuge’s website before (and aren’t now)? Moreover, according to my layman’s review, 506(b) sales still require filing the appropriate forms with the SEC. I did not see that those filings were made.     spin:  Centrifuge is not brokering the sale of these securities or getting any finders fee. The SPVs have all worked with Manatt to ensure that the security offerings were done in a legally compliant way. If you would like to see the contract templates, I am happy to share previous versions with you and we intend to publish our legal contracts for the pools in September publicly ahead of time.   Until recently, tinlake.centrifuge.io had a button instructing users to “invest”, similar investment priming language, and descriptions of the individual loans and “borrowers” all over the site. And, per its language, the Section 4(b) exemption is unavailable if any compensation is received, regardless of its form. Yes, Centrifuge might not be taking a direct cut or formally acting as a placement agent, and your business practices are your team’s business (though the question of Centrifuge being compensated in some form for these securities sales continues to stand). Still, I think the DAO should heed those past business practices in analyzing the current proposal and the collateral applications of Centrifuge’s partners. The DAO already surfaced issues with the New Silver team’s behavior at a recent startup (read about those here), and as part of my opinion on our due diligence, we should focus the same critical eye on Centrifuge and its other partners notwithstanding Centrifuge’s place in the community. Agreed that publishing the legal contracts is a good first step.     spin:  This means that just one investor willing to act in Maker’s interest can force the SPV to act in Maker’s interest with a solid legal claim.   I understand the intention, but, frankly, I believe you are underestimating the difficulties (which I tried to allude to in my earlier response) of bringing a securities fraud lawsuit. Perhaps to fully educate the DAO, you should break down, from beginning to end, how an “LLC member with a ‘solid legal claim’” will go about exercising that claim should the need arise. Saying only that they “can file a lawsuit” hand waives away the complexity involved for us, and it’s only fair to know the pain points involved.     spin:  It’s easy to add redundancies here: we can have many Maker community member invest small amounts in these pools and take on a similar role as Maker elected trustees in the Delaware trust model take on: they are the ones that can legally enforce the rights that the DAO can’t. I think the risk of this happening is low enough that it is safe for the DAO to pursue as one way of adding RWAs. Just compare this to USDC or TUSD as collateral: MakerDAO has no legal recourse to prevent the issuers of these coins to freeze any USDC held in the DAO as collateral.   Problem with this approach is that the exemption your issuers want to use limits those individuals that may partake in the investment, and you’re operating on the assumption that the legal case is able to be resolved quickly. Comparing USDC/USDT and the lack of protocol recourse against Circle/Tether, Inc. is a false equivalency. Neither of those two projects actively lobbied (and continue to lobby) the DAO to include their collateral. Those assets also are straightforward and have glaring security/regulatory dependencies (the issuers and custodians). On the other hand, Centrifuge-connected collateral is in a different league (and Centrifuge’s relationship to the DAO is different as well). Centrifuge’s proposals place difficult-to-decipher risk from exotic assets on multiple actors, while expecting beneficent acts by an “honest” member of an LLC to prosecute complicated securities fraud claims regardless of the economics of doing so. Of course, there is unknown with any RWA project. Still, it seems preferable to have a known historical quantity – like a trust company – sitting in the critical custodian position, rather than a pseudonymous individual or group. This, of course, is magnified by the added complexity of having DAO members separately and directly invest in each pool just to protect the DAO’s interests. If the DAO wants major institutions to finance with Maker, we should consider a set-up that draws in hedge funds, regional banks and financial institutions. Are there any HF professionals or commercial mortgage in the DAO that can opine? ",
                    "links": [
                        "https://www.sec.gov/divisions/marketreg/exemption-broker-dealer-registration-jobs-act-faq.htm",
                        "https://forum.makerdao.com/t/ns-drop-mip6-application-new-silver-drop-real-estate-backed-loans/3477/5",
                        "https://forum.makerdao.com/t/signal-request-raise-sf-on-rwa-when-issuers-unilaterally-change-terms/8858/28",
                        "https://forum.makerdao.com/t/ns-drop-collateral-onboarding-risk-evaluation/5418/40"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.513353006812309
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#16",
                    "likes": "3",
                    "time": "02/09/2020-19:51:47",
                    "content": "Thank you for your valid questions. As I mentioned, we will be sharing our final legal contracts publicly in the coming weeks as they are being finalized along with any supporting materials we can to explain the exact legal setup for this. I think this will answer some of your questions, @Tosh9.0 We have also gone ahead and submitted MIP-22 which documents the technical parts of this proposal on github and will post it on the forum momentarily. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-14/4028",
                        "https://forum.makerdao.com/t/weekly-mips-update-15/4243"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#17",
                    "likes": "0",
                    "time": "02/09/2020-20:20:07",
                    "content": "Great. So should we expect you or your team to address the points in my questions in this thread or in a future thread? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "3",
                    "time": "03/09/2020-09:55:58",
                    "content": "@Tosh9.0, could you maybe tone down the inquisition slightly? Asking questions is fine, but your persistence and tone implies that you believe Centrifuge is acting maliciously in some way, and I don’t think that’s warranted. Centrifuge (and Lucas) have - almost uniquely among potential collateral partners - shown an incredible willingness to work with MakerDAO with the goal of reaching a mutually beneficial integration with the Maker Protocol. Lucas set up the original collateral calls, and opened them up to include any potential collateral partners. He engaged with the collateral onboarding MIPs and is now writing MIPs with the aim of laying out a concrete method for getting Centrifuge assets into the Maker Protocol. Yes, this is self interested, but I’ve seen nothing that convinces me it’s malicious, and much that pushes me in the other direction. If Centrifuge can provide information that satisfies MKR Holders, then they’ll get onboarded, if not, they won’t. They aren’t obligated to answer your questions on any particular timescale, or at all. I’m happy that you’re engaging deeply, but please try to come across as less aggressive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.949845679012346
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#19",
                    "likes": "0",
                    "time": "04/09/2020-06:48:46",
                    "content": "Hi Long, Not sure what you are getting at, but you seem to see something in my questions that is not there. Anyway, criticizing my civility or praising Centrifuge’s good deeds distracts from what I am getting at. Are Centrifuge and its partners dealing with the novel regulatory issues involved in onboarding debt securities to the protocol? And can they explain in detail the complicated legal problems falling on the DAO if things go south? For instance, please look at my points about how the new proposal may require an LLC member to initiate a securities lawsuit to protect the DAO’s interests in case of fraud. That is a foreign process to most people, including me, so could Centrifuge or their lawyers walk us through their thinking? Also, to note, my inquiries about recent company practices and their partners’ past behaviors all shed light on how these groups may view their current regulatory responsibilities. This seems like fair game to ask, though there is no obligation to answer, as you noted. Although you may disagree, my opinion is that doing due diligence requires asking probing and direct questions. I do not think that is too much for Centrifuge (or any similarly situated project) to handle, especially when viewed in light of what they seek: to onboard complicated real-world assets with a novel and untested liquidation structure into our protocol, whilst MKR holders bear the ultimate financial risk. Tosh ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.247035573122529
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "1",
                    "time": "04/09/2020-08:03:42",
                    "content": "    Tosh9.0:  Not sure what you are getting at, but you seem to see something in my questions that is not there. Anyway, criticizing my civility or praising Centrifuge’s good deeds distracts from what I am getting at.   Multiple people have commented on this in the past, and one to me recently. Reading over everything, I had the same impression. I understand and accept that you’re probably not doing it intentionally, but yeah, please try to be more mindful of your language and how you come across. As facilitator it’s part of my job to moderate. This includes keeping things civil and responding to peoples concerns. I’ll leave the moderately complex legal and business questions to those more capable. To be clear, I’m glad that you’re here asking these questions, I’d just urge you to try to find a middle-ground so people don’t feel the need to come to me with concerns. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.678571428571429
                }
            ]
        }
    ]
}