{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-explorer-1-real-world-sandbox-grant-report/11715",
            "title": "\\xf0\\x9f\\x8c\\x8e Maker Explorer #1: Real-World Sandbox Grant Report ",
            "index": 11715,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "ses-001",
                "maker-explorer"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "14",
                    "time": "18/11/2021-17:44:06",
                    "content": " rwa-to-gimp1440×810 82.6 KB   Join us for the 1st session of Maker Explorer! This new series will serve as a looking glass into the different actors, credit types, and funding structures in the lending stack of TradFi as Dai determines it’s role in bringing real-world assets to DeFi. For our first session, Luca Prosperi @luca_pro will be presenting his final report from a SES funded research grant - Real-world Sandbox: A comprehensive framework to turbocharge Maker’s efforts to attract real-world finance. Luca is a decorated subject matter expert in the world of TradFi. This report has been built utilizing best-in-class TradFi professionals along side members of Core Units and the MakerDAO community. During our session Luca will discuss:   A Common Vision of the Lending Stack Credit Types and Collateral Eligibility Criteria Process Set Up & Governance Principles    Join us!  @Juan and @Retro will be our inaugural hosts.  When Time in your local-timezone format: 2021-11-24T16:00:00Z Mark it on your Google Calendar!  Where Zoom call Passcode: COREUNIT Alternatively, use this:  Find your local number: Zoom International Dial-in Numbers - Zoom Meeting ID: 829 4277 3725 Passcode: COREUNIT  Attn:  @SES-Core-Unit, @gov-comms-core-unit, @GovAlpha-Core-Unit, @Growth-Core-Unit, @Content-Production, @daif-core-unit, @Protocol-Engineering, @happiness-core-unit, @Oracles-Core-Unit, @Risk-Core-Unit, @Real-World-Finance, @dux-core-unit, @starknet-core-unit, @data-insights-cu, @collateral-core-unit ",
                    "links": [
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/ses-updates-18-11-2021/11717",
                        "https://forum.makerdao.com/t/maker-relay-ep-73/11882",
                        "https://forum.makerdao.com/t/maker-relay-ep-72/11773",
                        "https://forum.makerdao.com/t/ses-project-real-world-sandbox/10910/20",
                        "https://forum.makerdao.com/t/maker-relay-ep-73-en-espanol/11900",
                        "https://forum.makerdao.com/t/under-construction/12274/15",
                        "https://forum.makerdao.com/t/maker-relay-ep-72-en-espanol/11799"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.844341856060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#3",
                    "likes": "3",
                    "time": "25/11/2021-16:52:37",
                    "content": "This full call is available for review on the MakerDAO Youtube channel:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/11/2021-17:08:48",
                    "content": " Maker Explorer - Episode #01  November 24th, 2021  Agenda   00:00: Intro with Retro  00:43: Discussion and Questions with Luca Prosperi  01:02:48: Outro   Video https://youtu.be/qSVasC31A2w  Introduction  Retro  Agenda and Preamble 00:00  Welcome to everyone to Maker Explorer episode #01. I am Retro, a contributor from the SES CU. I am joined by Juan, our facilitator. We will be exploring topics throughout the Maker ecosystem. Today we are focused on Real-World Assets. We are joined by Luca, the team project lead from project Real-World Sandbox. He will present his Grant Report from the past several weeks of effort.   Discussion  Project Real-World Sandbox - Forum thread   Luca Prosperi 00:43  1920×1118 200 KB   1920×1117 231 KB   1920×1116 211 KB   1920×1113 171 KB   1920×1118 235 KB   1920×1115 269 KB   1920×1116 228 KB   1920×1118 174 KB   1920×1119 156 KB   1920×1117 237 KB   1920×1115 170 KB   1920×1113 249 KB   1920×1116 175 KB   1920×1111 249 KB   1920×1120 218 KB   1919×1116 203 KB   1920×1118 184 KB   Questions 12:50 - Eric: Can you give us a sense of what is the minimum credit standard? Do you think that BBB are better for anything that Maker is going to finance? 14:43 - Payton Rose: There might be disagreement in the community whether a point is met or not.  Who is determining these eligibility criteria? When decisions are made in terms of eligibility, how is that communicated to the community? 16:24 - Sébastien Derivaux: What would you do with RWA MIP6s already approved? 18:53 - Sébastien Derivaux: From your perspective and your report, you do not think we should invest in those investments. Is that what you present to the community to approve? 21:10 - Eric: Most of the assets considered here are not standalone investment grade. They will need to be structured, typically in a pool with some of them and with a decent-sized tranche of sub-debt or equity underneath them. Do you have any thoughts on where those other capitals would come from? This is not an insignificant portion of capital. 39:00 - Will: At a level where you have the counterparties interacting with the Portfolio CUs to assess and give their recommendations, you have the Compliance CU as the second line of defense. Are we assuming there is a prior line of defense than the Portfolio CUs, that understand the credit risk they are bringing to the table and do some of the heavy liftings that create efficiency in the system? Does your framework contemplate that first line of defense coming from the intermediary?) 43:00 - Will: If you are assuming there are three lines of defense of risk, but there is one group or network of a hub of counterparties that interact with these CUs and then one that oversees the assessment or the assessor to the assessees to the assessors. In the future how does that best practice circulate back into those CUs? Is it through the Compliance CU, or is there any mechanism that can implement the action? 47:04 - Will: We might have to consider the current setup. There is still discussion to be happening in the community. The current setup would talk about the business side of it. The reality is that there are a few interactions with different CUs at different touchpoints in time in the current flow, of how credit is underwritten within the Dao. I have contemplated that in the report. I will be happy to contribute to that and the flows from both the non-technical side and the technical components.  49:54 - Payton Rose: What do we do in the case of novel collaterals. Suppose Elon wants to come to us with a test-fired Falcon 9 rocket. Are we trying to speed up a reward finance portfolio CU for every new type, or are there ways we can stream like that to not be so reactive as different opportunities become available? 52:54 - Justin: There has been much focus on monitoring risk and understanding the risk in the collateral when onboarding. What about the ongoing monitoring of the loans? What happens in that system? There needs to be an entity monitoring both the arranger and the underlying collateral that we are lending against. Whether there is a focus on getting some of that data on-chain and on-chain monitoring or whether that is something we will figure out later. How much thought has been put into how that is resourced and monitored?  57:12 - Someone: What are the team’s general thoughts on moving all of this on-chain. I like the Centrifuge model of having asset financing on-chain. I wonder whether the view is that there will be billions and billions of Dai going out and that will be all on-chain or whether you think it is fine to have the Maker ecosystem on-chain and then all the financing going off-chain quickly. Or whether you believe they should be full-on integration, everything on-chain.  Closing Comment  Retro  Outro 01:02:48  Thank you so much for all the hard work that has gone into it already. We encourage everyone to check out the forum. Luca will be posting the full report shortly. Thank you to everyone for joining episode #01 of ME. See you next time.   Credits  Kunfu-po produced this summary.  @gala produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/qSVasC31A2w?t=43",
                        "https://youtu.be/qSVasC31A2w?t=3768",
                        "https://youtu.be/qSVasC31A2w",
                        "https://youtu.be/qSVasC31A2w",
                        "https://forum.makerdao.com/t/ses-project-real-world-sandbox/10910",
                        "https://youtu.be/qSVasC31A2w?t=43",
                        "https://youtu.be/qSVasC31A2w?t=770",
                        "https://youtu.be/qSVasC31A2w?t=883",
                        "https://youtu.be/qSVasC31A2w?t=984",
                        "https://youtu.be/qSVasC31A2w?t=1133",
                        "https://youtu.be/qSVasC31A2w?t=1270",
                        "https://youtu.be/qSVasC31A2w?t=2340",
                        "https://youtu.be/qSVasC31A2w?t=2580",
                        "https://youtu.be/qSVasC31A2w?t=2824",
                        "https://youtu.be/qSVasC31A2w?t=2994",
                        "https://youtu.be/qSVasC31A2w?t=3174",
                        "https://youtu.be/qSVasC31A2w?t=3432",
                        "https://youtu.be/qSVasC31A2w?t=3768"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.744538407329105
                }
            ]
        }
    ]
}