{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/request-for-adjustment-to-dsr-phrasing/926",
            "title": "Request for Adjustment to DSR Phrasing ",
            "index": 926,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "rates",
                "dsr",
                "dsr-spread"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "2",
                    "time": "08/12/2019-22:35:55",
                    "content": "UPDATE: New poll and discussion thread are here: Signal Request: Should we replace the weekly DSR governance poll with a DSR Spread governance poll? I’d like to request a change to the way the DSR governance polling question is phrased. Currently we are being asked for the absolute values of the SCD SF, MCD SF and DSR Rate. I think it is more appropriate to ask for the MCD SF - DSR Spread to replace the DSR Rate poll. With this phrasing change it helps keep the two values as orthogonal as possible. DSR Spread adjusts for system growth/migration speed whereas MCD SF adjusts for DAI peg stability. This will also help us avoid a situation where for whatever reason the DSR mistakenly ends up being voted higher than the SF. I believe this issue may come up once we start having to change the SF for peg stability as there is a problem of coordinating the values of the DSR and MCD SF to move in tandem. It’s not clear whether voters are signalling to increase/decrease the DSR spread or if they want to adjust for peg stability. IMO keeping the voting parameters as orthogonal as possible is essential for demonstrating voter intentions in the clearest way. EDIT Adding a vote as requested. Question: Should we switch the phrasing of the DSR governance poll from absolute DSR % to a MCD - DSR spread %?     Yes No     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-should-we-replace-the-weekly-dsr-governance-poll-with-a-dsr-spread-governance-poll/969",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-december-12-9am-pst-5-00-pm-utc/947/5"
                    ],
                    "GPT-summary": "The author of the post is requesting feedback on a proposal to change the phrasing of the DSR governance polling question. The proposal suggests replacing the DSR Rate poll with the MCD SF - DSR Spread poll to keep the two values as orthogonal as possible. The author believes this will help avoid a situation where the DSR is mistakenly voted higher than the SF and will demonstrate voter intentions in the clearest way. The post includes a poll to vote on the proposed change.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.789256198347108
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/12/2019-03:40:25",
                    "content": "Maybe set up a poll to see if this is a popular change? I don’t have a problem with it but it usually helps to get traction if they see that more people support it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "2",
                    "time": "09/12/2019-12:54:54",
                    "content": "    hexonaut:  This will also help us avoid a situation where for whatever reason the DSR mistakenly ends up being voted higher than the SF   I don’t see a problem with the DSR temporarily being higher than the weighted average SF. At the time of writing, only 20% of DAI is in the DSR so we have a lot of slack that we can use to our advantage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#4",
                    "likes": "2",
                    "time": "09/12/2019-16:16:42",
                    "content": "    Aaron_Bartsch:  Maybe set up a poll to see if this is a popular change? I don’t have a problem with it but it usually helps to get traction if they see that more people support it.   I’m not super familiar with the forums. How do i do that?     psychonaut:  I don’t see a problem with the DSR temporarily being higher than the weighted average SF. At the time of writing, only 20% of DAI is in the DSR so we have a lot of slack that we can use to our advantage.   The problem comes with the fact that you’ve given vault owners a way to earn a guaranteed % return on their ETH stack. It may max out the debt ceiling pretty quickly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.870833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "1",
                    "time": "09/12/2019-16:56:23",
                    "content": "    hexonaut:  I’m not super familiar with the forums. How do i do that?      image.png718×456 15.7 KB  For examples of setting up signalling posts, there are lots of examples under the signalling tag. There is also a post suggesting a process: Current Signaling Process ",
                    "links": [
                        "https://forum.makerdao.com/t/current-signaling-process/396"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.347222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/12/2019-17:59:37",
                    "content": "Agree with hexonaut, I was actually going to make a thread about this. When I saw this I was happy I didn’t have to do it myself. “It’s not clear whether voters are signalling to increase/decrease the DSR spread or if they want to adjust for peg stability.” This is spot on. It needs to be made clear. There are other reasons as well. Once Vault users begin hedging DSR they need someone who has the direct inverse exposure to them. If the spread is adjusted too much it makes it more difficult for them to secure that hedge. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#7",
                    "likes": "2",
                    "time": "09/12/2019-20:49:59",
                    "content": "Thanks for this. Updated! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#8",
                    "likes": "1",
                    "time": "09/12/2019-21:51:11",
                    "content": "EDIT: i’m wrong in my thinking, I misunderstood hexonaut (see comment) What are the options for a poll like that? What should the spread be between DSR and MCDSF?  0% at 2/2 0% at 3/3 0% at 3.5/3.5 0% at 3.75/3.75 0% at 4/4 0% at 4.25/4.25 0% at 4.5/4.5 0% at 5/5 0% at 6/6 0% at 8/8 (then multiply that by 1% at, 2% at, 4% at, etc…)  You have to define the spread = {,} and the rate combination = {,} so the number of exact choices becomes a lot more unmanageable. What you’re describing sounds like a separate poll to try to keep people consistent with their actual votes. People will express their opinion with exact values for the rates anyway. It would be cool to vote on a matrix though if there was a user friendly way to do it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.819444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#9",
                    "likes": "2",
                    "time": "09/12/2019-22:49:55",
                    "content": "So it would be a range of values with a lower bound of 0%. It doesn’t matter what the MCDSF is. You want the DSR to follow it minus this parameter. Since the DSR affects demand and SF affects supply in opposite directions it does not make sense to have these as separate parameters for controlling peg stability. Different parameters should affect different pieces of the system to keep things orthogonal in our collective brain. An example: DAI trading under $1. Current Options: Raise DSR or Raise SF Fixed Spread DSR Options: Raise SF ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#10",
                    "likes": "0",
                    "time": "10/12/2019-01:59:16",
                    "content": "This is confusing to me. What would the new poll actually look like like David tried to define? Can you provide a concrete example versus the abstract one you provided? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.982954545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#11",
                    "likes": "1",
                    "time": "10/12/2019-02:33:42",
                    "content": "Yeah so it could be something along the lines of. What should the Stability Fee - DSR spread be? 0% DSR = SF (for example a SF of 4% means the DSR is 4%) 0.5% DSR = SF - 0.5% (for example a SF of 4% means the DSR is 3.5%) 1% 2% 4% (for example an SF of 4% means the DSR is 0%) Some more examples for clarity: DSR spread of 1% and SF is 8% means the DSR is set to 7%. DSR spread of 4% and SF of 10% means the DSR is 6%. Does this clear things up? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#12",
                    "likes": "0",
                    "time": "10/12/2019-04:23:01",
                    "content": "That does, thank you. I think I still personally prefer the current implementation just because I’m used to it and it feels more binary to me (hopefully thats the right word choice to describe it). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.982142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#13",
                    "likes": "0",
                    "time": "10/12/2019-15:23:07",
                    "content": "I think my point still stands. In the end the actual rates need to be decided on, not just the spread. So your options will be the multiple of the two sets: the spread = {,} and the rate combination = {,} Could someone make a list of options that would work well for a poll like this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#14",
                    "likes": "0",
                    "time": "10/12/2019-16:34:04",
                    "content": "Maybe I’m misunderstanding. I am not suggesting getting rid of the MCD sf vote. That would stay as is. I am talking about replacing just the current DSR rate vote with a question about spread. Both the current and proposed setup provide the same end numbers. It’s just phrased as a spread and not an absolute number. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#15",
                    "likes": "1",
                    "time": "10/12/2019-19:51:10",
                    "content": "Ah, I see what you’re saying. So the spread vote + MCD SF vote would give a DSR value got it. I understand now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lix",
                    "index": "#16",
                    "likes": "0",
                    "time": "11/12/2019-18:48:22",
                    "content": "I voted No, but only because I would like to try using the IAM to tune the system instead of weekly votes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#17",
                    "likes": "0",
                    "time": "11/12/2019-19:00:27",
                    "content": "Can you elaborate on why the introduction of the IAM changes things? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lix",
                    "index": "#18",
                    "likes": "0",
                    "time": "11/12/2019-19:16:14",
                    "content": "The IAM will only need to be voted on when the bounds are set. Let’s say we vote to set the IAM DSR bounds from 1-8, and the ETH-A SF bounds from 1-16. The risk team could tune the SF and DSR at any time without having to worry about a vote pushing the DSR much higher than the SF. If we do keep voting each week, then I’ll change my vote on this signal request to yes for this reason you put above.     hexonaut:  a situation where for whatever reason the DSR mistakenly ends up being voted higher than the SF.   This makes sense and I 100% agree, I just don’t think it will be necessary after the IAM are implemented. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#19",
                    "likes": "2",
                    "time": "11/12/2019-19:36:20",
                    "content": "So my main reason for wanting this change is not because of the accidental DSR > SF issue. It’s because I believe it is a more natural fit to how we should be thinking about these parameters. As I said above we currently have two parameters to effect dai peg stability when it should be reduced to one for simplicity and clear signaling. With regards to the IAM, I think only the stability fee should be set each week with the DSR rate following it minus the spread parameter. The DSR spread should remain relatively constant because it effects growth/profit and not peg stability. Under this change and after migration I think we can simplify things down to 1 weekly poll of the global stability fee only. If we keep the DSR in terms of absolute rate we will almost certainly have to vote on 2 things week to week (the DSR and the global sf). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.41923436041083
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#20",
                    "likes": "0",
                    "time": "14/12/2019-18:41:52",
                    "content": "    hexonaut:   I don’t see a problem with the DSR temporarily being higher than the weighted average SF. At the time of writing, only 20% of DAI is in the DSR so we have a lot of slack that we can use to our advantage.  The problem comes with the fact that you’ve given vault owners a way to earn a guaranteed % return on their ETH stack. It may max out the debt ceiling pretty quickly.   OK, I’ve been pondering this for a few days. Why is it necessarily a problem to provide a guaranteed return? What happens when we add ETH vaults with more limited leverage and lower SF? If the DSR is rigidly limited by the lowest SF for any asset type then we’re artificially limiting our ability to govern effectively. If I take my ETH, open a vault, generate DAI, and deposit it in the DSR then I might extract 0.5% or 1% risk free, but I’m also tieing up capital. It’s not necessarily a great investment. Also, if DAI is trading below 1.0 then I think it could be worth temporarily raising the DSR above the weighted average SF to defend the peg. What we don’t want to do ever again is to raise the SF to 20% to defend the peg. Vault owners just loathed that experience, adding injury to an already bitter bear market. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2781954887218046
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#21",
                    "likes": "2",
                    "time": "14/12/2019-23:28:47",
                    "content": "This is a fair counterpoint to having a 0% lower bound. My intuition is to not go below a 0% spread but this does not have to be a hard constraint. My main point is to switch to the spread model instead of the current absolute value model because it is a more natural fit to how we should think of these parameters in my opinion. Low volatility assets are an interesting new case I have started considering more recently. For example SAI would have to have a negative vault-type fee to counteract the global sf rate or nobody would borrow with it. I still think that overall our collateral portfolio will mostly be more volatile assets and as such a global sf of countering bull/bear behaviour in the market as a whole should be dominating over something like having a USD analogue as a collateral type and focusing on that edge case. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.827840909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#22",
                    "likes": "0",
                    "time": "15/03/2020-05:28:47",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}