{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/how-the-endgame-metadaos-will-scale-faster-with-nadia-of-the-makerdao-growth-core-unit-drinks-with-makerdao-delegates/18537",
            "title": "How the Endgame MetaDAOs will Scale Faster with Nadia of the MakerDAO Growth Core Unit -- Drinks With MakerDAO Delegates ",
            "index": 18537,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "community-delegate-vlog",
                "drinks-maker-delegates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "11",
                    "time": "27/10/2022-10:08:57",
                    "content": "   In screaming woods and empty rooms or gloomy vaults and sunken tombs   The Halloween Dress Up Episode Starting @Nadia as Scarlett Johansson  Co-Starting: @ultraschuppi as Secretariat the Champion Racehorse  and @ElProgreso as Ozzy Osbourne  In this special Halloween episode of Drinks with MakerDAO Delegates we invited @Nadia of the @Growth-Core-Unit to talk about the adoption of the Endgame Plan, how Core Unit team members should be thinking about Clustering, or becoming Ecosystem Actors, and how Institutions are struggling to find capital efficiency within DeFi. We also discussed how MetaDAOs will scale faster than the current Maker Core, and how MKR token owners should be thinking about the Endgame. Shuppi and I really enjoyed spending Halloween in the Metaverse with Nadia, and hope you will as well.  Not Financial Advice This Content is for entertainment and informational purposes only, you should not construe any such information or other material as legal, tax, investment, financial, or other advice. Nothing contained on the FlipFlopFlap YouTube Channel constitutes a solicitation, recommendation, endorsement, or offer by @Nadia a.k.a “Nadia” @ultraschuppi a.k.a, Tim Schuppner @ElProgreso a.k.a, Frank Cruz @rspa a.k.a, Raphael Spannocchi, Flip Flop Flap Delegate LLC, Flipside Crypto, or any third party service provider to buy or sell any cryptocurrencies, securities, or other financial instruments. Nothing in this YouTube Video constitutes professional and/or financial advice.  The Tastings Nadia: Cafè de Argentina!     5 Stars      El Pro: Hand-picked cafè from the Southern Region of Bogota , Silvania, Colombia  4 Stars     Schuppi: Tannenzäpfle is a German Pilsner style beer  brewed by Badische Staatsbrauerei Rothaus in Grafenhausen-Rothaus, Germany  4 Stars     Incoming Clustering References: The Crimson Creator Cluster,  The Viridian Cluster, and The Spring Cluster      ",
                    "links": [
                        "https://forum.makerdao.com/t/viridian-cluster-introduction/18332",
                        "https://forum.makerdao.com/t/spring-cluster-introduction-and-proposal/18398",
                        "https://www.youtube.com/watch?v=oOBae_K1AUE",
                        "https://forum.makerdao.com/t/governance-and-risk-214-november-03-at-17-00-utc/18637/8",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/30"
                    ],
                    "GPT-summary": "The post is an episode of \"Drinks with MakerDAO Delegates\" where the author invites Nadia from the Growth-Core-Unit to discuss the adoption of the Endgame Plan, how Core Unit team members should be thinking about Clustering, or becoming Ecosystem Actors, and how Institutions are struggling to find capital efficiency within DeFi. The post also mentions how MetaDAOs will scale faster than the current Maker Core, and how MKR token owners should be thinking about the Endgame. The post also includes a disclaimer that the content is for entertainment and informational purposes only and should not be construed as professional and/or financial advice.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.283035714285714
                }
            ]
        }
    ]
}