{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/who-does-routine-due-diligence/7886",
            "title": "Who Does Routine Due Diligence? ",
            "index": 7886,
            "category": [
                "Governance"
            ],
            "tags": [
                "risk",
                "governance",
                "employment"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "7",
                    "time": "06/05/2021-16:52:08",
                    "content": "As the title states. Who does the routine due diligence on counterparties who wish to do business with us? This could be CUs, projects asking for grants, or entities offering to provide services to us directly. This is not specific to new CUs, but I see no reference to very standard things like verifying employment history, credit checks, criminal background checks, etc. These are routine things that need to be done before handing millions in operating budget to what are effectively contractors scattered across multiple jurisdictions. Is there some standard process for due diligence on people/entities that wish to do business with us? We have one for collateral, and we need one for parties we fund or do business with directly. At the least, a standard process would make for a fairer evaluation of those requesting to do business than doing it ad hoc each time. This is an urgent need ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-141-thursday-may-13-17-00-utc/7930/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-44/7974",
                        "https://forum.makerdao.com/t/maker-relay-ep-44-en-espanol/7998"
                    ],
                    "GPT-summary": "The author is asking for feedback on who does routine due diligence on counterparties who wish to do business with them. They are concerned about the lack of a standard process for due diligence and the need for one to ensure a fair evaluation of those requesting to do business.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.950487012987013
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "6",
                    "time": "06/05/2021-17:44:30",
                    "content": "How do you do due diligence on @LongForWisdom ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#3",
                    "likes": "2",
                    "time": "06/05/2021-17:51:29",
                    "content": "This summarizes it. I think we’d be doing the DAO a major disservice if we only accept “known” individuals. Pseudonymity is a valuable tool in the face of adversaries. IMO this kind of DD is something we should do when it makes sense (e.g. when onboarding an RWA borrower), but not for Official DAO Members. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.104166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "1",
                    "time": "06/05/2021-18:07:09",
                    "content": "I think if someone wants us to give them large sums of money that we have no way to claw back, it’s foolish not to do very standard stuff. No one who is doing material amounts of business with us is going to be using a pseudonym. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.517857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#5",
                    "likes": "1",
                    "time": "06/05/2021-18:32:44",
                    "content": "Fair, but then I think you need a good answer to @SebVentures 's question. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "1",
                    "time": "06/05/2021-18:39:12",
                    "content": "Also worth noting that with Core units, if they wish to have a Governance approved Multi-Sig they have to give the ability for Governance to take back funds. The community is welcome to decide if they will be harsher on Core Unit’s asking for funds and not planning to use an approved Multi-Sig. Each budget dispersal represents a small portion of current revenues, MKR holders have the chance to say whether they trust the funds will be spent wisely when the proposals are made in Good Faith, adding a hard DD requirement seems to go against the spirit of the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.032407407407407
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#7",
                    "likes": "0",
                    "time": "06/05/2021-18:40:55",
                    "content": "This is an interesting discussion! I guess one could rephrase the question to be: Are we able to allow the people working for or with the DAO to remain pseudonymous or do these individuals need to be treated like conventional employees/business partners in centralized institutions? So far, I’m not sure I’ve seen a situation where the pseudonymity was a problem but I can also imagine there might be some situations where no smart contract solution is sufficient. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.604166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "1",
                    "time": "06/05/2021-19:02:33",
                    "content": "    AstronautThis:  I guess one could rephrase the question to be: Are we able to allow the people working for or with the DAO to remain pseudonymous or do these individuals need to be treated like conventional employees/business partners in centralized institutions?   I think we can probably pick a threshold where it’s risky to not know who we’re doing business with. Want to do business above X amount with us? Then we need to know who you are and that the things you say you’ve done in the past are true. Don’t like it? Find someone else to be the responsible party for your proposal. I can think of other reasons we’d want to know who we are outsourcing our needs to, but just ask yourself where else in the world can you go and on the basis of some forum posts and maybe a Zoom call and be seriously considered for millions of DAI in funding? This doesn’t need to be something onerous. But a basic level of confirming that people are not financial criminals or scammers is a must. We’re starting to throw around large amounts of money, and we need a way that’s not ad hoc to do due diligence on people. I should stress this is not about any specific proposals before us right now – any due diligence will have to be ad hoc unfortunately. But we need to have a process in place so that basic due diligence is evenly applied to all future requests from unvetted parties to do business with us. Otherwise we open ourselves up not just to the risk of being scammed or defrauded, but also just of being accused of not treating people equally when they come to us with proposals. So a process we can point to protects us from the most obvious attempts at fraud/conning, protects us from favoritism that promotes bad ideas for funding, and protects applicants from any discrimination that could prevent good ideas from receiving big funding. I feel like this is a no-brainer. You can’t even be a bank teller without a credit check. Are we honestly going to fund or incubate startups that themselves have no history and not check on the people who are running them? The proposed SES unit in particular should have an interest in shaping this process. @juan @wouter I believe are the folks I should have tagged at the beginning. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.188013136288998
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#9",
                    "likes": "2",
                    "time": "06/05/2021-19:24:27",
                    "content": "IDK, feels like a lot of TradFi thinking. This is a Decentralized Autonomous Organization, adding KYC pulls us away from the heart of what we are trying to build. Plenty of companies like BlockFi if you wanna go the CeFi lending route. In general we want to promote accessibility to Governance, not take it away. We incentive good debate on the forums in an attempt to make this as open and transparent as possible. There is no CEO of the DAO and contributors can come and go as they please. The reason we have the Facilitator Onboarding Subprosal is to give community members willing to shoulder more accountability and responsibility a chance to let the community know who they are and what they are committing to. Might be helpful to look over Kathleen’s Facilitator Onboarding if you’re worried about credentials, or maybe Long’s Subproposal to see what that looks like from a pseudononymous prospective. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip41c4-sp9-facilitator-onboarding-cpm-001/7191",
                        "https://forum.makerdao.com/t/mip41c4-sp3-core-unit-facilitator-onboarding/6350"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#10",
                    "likes": "1",
                    "time": "06/05/2021-19:34:19",
                    "content": "    prose11:  adding KYC pulls us away from the heart of what we are trying to build.   They’re not our customers. We’re their customers. It’s one thing to let people self custody and talk about how we just provide the contracts and people do their own thing. But if we directly give large sums of cash to entities that use that money for nefarious purposes, get it stolen through lax security practices, or simply spend it on a private jet for their CU and have “meetings” in Cabo San Lucas, we’ve got a big reputation issue. The money is part of it. But so is there not being a sign out front that says “we give money to strangers who we can’t verify they actually are who they say they are!” At its most basic level, how do we verify someone has worked on project XYZ at company ABC if they’re telling us they can execute on something? Or that they aren’t $4 million in debt and skimming from us is easy because we don’t ask for more than a pie chart for a budget? If someone is a criminal, deeply in debt, or outright fraudulently claiming identity or expertise they don’t have, we would be negligent not to take the absolute most basic steps to verify these things. They’re not expensive. They’re not tedious. They’re absolutely routine. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.880952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "2",
                    "time": "06/05/2021-19:43:44",
                    "content": "We don’t get to this level of growth by not paying the people who contribute to it. There are lots of drawbacks to working for the DAO, but a huge advantage is the lack of traditional gatekeeping that stops qualified individuals from being able to contribute with their skills and expertise. Much like how we manage the risk of our vaults we ask MKR holders to manage the risk of distributions. If they are unhappy with a proposal they can vote it down (happens more frequently with things like Signal Requests, but I’d say part of that is due to our robust structure of requiring MIPs to be open for feedback for at least a month before they are submitted). The reason you haven’t seen as much questioning on the background of CUs so far is because they are more or less completely know entities. They are the people that have helped build the DAO to what it is today and are the ones brave enough to take the first steps of the transition while others wait to check the temperature of the DAO. The fact is anyone can bring up topics for debate on the forums and perhaps that includes some elements of DD you reference, but one of reasons the protocol was created to avoid the biases of traditional finance systems. Would be quite odd if we provided that for interacting with the protocol but took things like credit checks as gospel for dealing with Governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.508597883597883
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "0",
                    "time": "06/05/2021-19:52:54",
                    "content": "I don’t want to make this thread about specific CU proposals. Just because many people don’t like TradFi doesn’t mean everything they do is wrong. If someone comes and uses their work experience as evidence of why they should be given funds, we need to ensure they are who they say they are and that they have the experience they say they do. We cannot seriously use the ability to write an articulate forum post as the main line of defense against things getting approved in a voting ecosystem where there’s almost no participation – and presumably not that much attention paid. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.800595238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#13",
                    "likes": "2",
                    "time": "06/05/2021-20:54:05",
                    "content": "The crux of the issue is about trust. Whether that is through transparency of past performance or earned over time, whatever ways we determine that an individual or group is trustworthy enough to receive support from the DAO is up for debate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#14",
                    "likes": "3",
                    "time": "06/05/2021-20:55:53",
                    "content": " image873×328 96.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#15",
                    "likes": "3",
                    "time": "06/05/2021-22:17:48",
                    "content": "I am thick and trusting… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#16",
                    "likes": "1",
                    "time": "07/05/2021-00:05:48",
                    "content": "So, an anon asking for non-anon people, my mind just blowed up ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#17",
                    "likes": "0",
                    "time": "07/05/2021-00:35:15",
                    "content": "I’m not anonymous. I’m just too lazy to put a photo up  But I’m also not asking for large sums of money as a vendor or CU or whatever. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.910714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#18",
                    "likes": "1",
                    "time": "07/05/2021-03:28:51",
                    "content": "Paper makes great points – perhaps Dai could/should be allotted so the DAO can conduct background checks and search legal databases about CU candidates? Many of them are ex-Foundation now but with the sizable treasury and a growing ecosystem, it likely won’t be long before new faces (and perhaps some nefarious ones) join the fray. If those new persons want to receive funds from the DAO, perhaps their identities should be disclosed to a “DD CU”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.230519480519481
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "2",
                    "time": "07/05/2021-11:28:58",
                    "content": " image777×434 122 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#21",
                    "likes": "1",
                    "time": "07/05/2021-18:14:52",
                    "content": "But remember, El Pro, no one knows what happened to the Russian… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#22",
                    "likes": "3",
                    "time": "07/05/2021-18:34:50",
                    "content": "I think this is a risk-management issue and MakerDAO shouldn’t necessarily exclude anonymous contributors. A non-publicly known person would likely be considered higher risk, but this could be mitigated by, for example, a track record of good performance. Another risk mitigation strategy would be distributing funds in smaller amounts, or into some kind of vesting contract which can be cancelled by MakerDAO governance at any time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#23",
                    "likes": "1",
                    "time": "07/05/2021-18:50:31",
                    "content": "    Spidomo:  I think this is a risk-management issue and MakerDAO shouldn’t necessarily exclude anonymous contributors.   Agreed. Which is why a standard procedure would ensure fair consideration of all factors together ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#24",
                    "likes": "5",
                    "time": "09/05/2021-19:27:08",
                    "content": "    PaperImperium:  The proposed SES unit in particular should have an interest in shaping this process. @juanjuan @wouter I believe are the folks I should have tagged at the beginning.   We will indeed be looking into problems like this. As always, however, I would urge anyone who wants to pick this up to not wait for us. We won’t be able to solve all scaling challenges and will be working on the problems we see as the absolute priority. The first thing we would do, is to make the risk visible. @lollike, myself, and others within SES are currently starting to document protocol and DAO risks (operational, legal, technical, etc.), and potential projects (large and small) that can mitigate these risks. We’ll make sure to include the risk, and the due diligence process as a potential mitigation. More about this soon. A number of thoughts:   Pragmatically speaking, right now… Many of the core units that are currently being proposed, consist largely of Maker Foundation members. The Maker Foundation has  been running these checks. This is circumstantial but it reduces the immediate urgency a fair bit in many situations. I do agree the question becomes a lot more pertinent the moment a core unit composed only of (relative) outsiders is presented.   I think it would definitely be a big plus for a Core Unit to include background checks of their wallet signers into their process. As to who will be verifying this… This is one of those aspects where a trusted external party can play a big role. For example, the core unit can work with their self-accountability auditor for this. This is not a hard guarantee, but of course background checks never are.   The SES budget proposal has a multisig wallet setup that should be well suited to reduce this particular risk, as you are probably aware. See this paragraph. It offers three features in this regard:  The Auditors Wallet with external DAO representatives to check the monthly budget statements. Separate multisigs to isolate the major budget categories. The operational wallets have 3 signers and they are not the same signers for every operational wallet. (Still, the facilitator and team lead together do have a signing majority.)    So what about new joiners? This is another reason why we believe incubators will become so important for the health of the ecosystem. There are no legal obligations, things do rely on smart contracts and trust… but we want to grow and be welcoming to new people. But how can the, hopefully many, new joiners gain our trust? Incubator programs are the perfect environment to test the waters. For months, these teams will be collaborating closely with the incubator core unit. During that time, their budget is managed by the incubator and they are only paid for work done. The incubator can perform these background checks. It can help assess and shape the practices and procedures that the new core unit will follow in order to reduce risks like this. And it can also have an advisory relationship beyond the incubation program, once the team has spun out as their own independent core unit.   In general, I do agree that this is aspect is a risk issue and it should be treated as such. The bigger the amounts at risks, the more thorough the checks should be that are in place. I can imagine that we will have a framework sooner or later to quantify the risk and evaluate this against the relevant mitigation measures that are taken. Background checks can be one of those measures that reduce the risk of losing funds. In the case of pseudonymous contributors, there may be different possibilities.   Last but not least. Background checks largely assume malicious intent or at least coercion… What about the security practices of the signers though? The reality of blockchain is that the risk of losing private keys or getting them stolen may be bigger than bad intentions.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.771248196248196
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#25",
                    "likes": "0",
                    "time": "09/08/2021-01:27:25",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}