{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rwa-foundation-hvb-disclosure/16267",
            "title": "RWA Foundation: HVB Disclosure ",
            "index": 16267,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "summary",
                "risk-domain-work",
                "reporting",
                "hvb",
                "rwa-009"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#1",
                    "likes": "14",
                    "time": "01/07/2022-14:33:07",
                    "content": "When MKR token holders “greenlit” the HVB transaction, this required RWA Foundation to have access to Genesis Global Trading’s platform for the DAI/USD conversion. To support RWA Foundation and manage the KYC process for RWA Foundation, I submitted an electronic application on behalf of RWA Foundation and uploaded various KYC documents on behalf of RWA Foundation’s supervisor and the sole director. The application required the creation of a username, password and phone number for Google Authenticator. I created a username, password and provided a phone number. To ensure that I do not have personal access to the Genesis Global Trading platform at any time during the life of the HVB transaction, Ankura Trust has agreed to serve as an independent, third party custodian of the username, password and authenticator. Ankura Trust will change the username and password so that neither I nor any person associated with Maker has access to the Genesis Trading portal. This will occur before the 1st executive spell is initiated. Further, to ensure that the destination for (1) DAI→USD conversion is RWA Foundation’s escrow account with WSFS and (2) USD → DAI conversion is the urn or jar contracts, I have proposed the following belt, braces and suspenders approach:   Ankura Trust to agree not to change any of the destination accounts without Maker governance approval (agreed with Ankura)   Genesis Trading agree not to accept any instruction to change any of the destination accounts without Maker governance approval (pending Genesis legal review)   Restrict the ability of RWA Foundation’s director to change the destination accounts without Maker governance approval (to be incorporated into the Articles of Association of RWA Foundation)   There may be better ways to execute these activities in the future. And I welcome suggestions for future transactions. @Allan_Pedersen and I have recently discussed some of his ideas and approaches on this point, which are all very good. The advantage of having completed this exercise is that, for future transactions, I have better visibility on the issues/constraints associated with DAI/Fiat conversion. With this background and experience, I can better identify and develop robust mechanisms to “lock-down” the cash-flow. I hope that the Maker community will respect that my actions for RWA Foundation were undertaken in good faith and that, as evidenced by the above, I fully recognize the need to disassociate myself with any of the funds flows. ",
                    "links": [
                        "https://forum.makerdao.com/t/relay-semanal-28-de-junio-05-de-julio-del-2022/16473",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.978571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/07/2022-14:46:34",
                    "content": "Thank you for the transparency Christian. Just a few questions (playing devil’s advocate here).     christiancdpetersen:   Ankura Trust to agree not to change any of the destination accounts without Maker governance approval (agreed with Ankura) Genesis Trading agree not to accept any instruction to change any of the destination accounts without Maker governance approval (pending Genesis legal review)    Some folks might interpret this as points-of-failure. Can you please describe how Ankura and Genesis by a legally binding agreement cannot create their own instructions, or the instructions from an oversight agency won’t breach the described approach above?     christiancdpetersen:  The advantage of having completed this exercise is that, for future transactions, I have better visibility on the issues/constraints associated with DAI/Fiat conversion. With this background and experience, I can better identify and develop robust mechanisms to “lock-down” the cash-flow.   What would happen if you decided to rage-quit and decided to retire in Tierra del Fuego, Patagonia–how easily can the next Christian Peterson pick-up from were you left-off, and identify the necessities needed to run LTS? Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.935897435897436
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#3",
                    "likes": "6",
                    "time": "01/07/2022-15:41:31",
                    "content": "    flipflopflapdelegate:  Some folks might interpret this as points-of-failure. Can you please describe how Ankura and Genesis by a legally binding agreement cannot create their own instructions, or the instructions from an oversight agency won’t breach the described approach above?   Any time there is a third party, there is “point-of-failure”. The same applies to a trustee, independent director or otherwise. I am not sure that you can eliminate that risk (at least given the tools today) but each of Ankura Trust and Genesis will have a contractual obligation not to make any changes without Maker governance. RWA Foundation will have a breach of contract claim. The same concept applies to the RWA Foundation director. Any action by the director in contravention of the Articles of Association will be ultra vires. The same applies to the trustee of RWA Master Participation Trust. A breach of contract claim or a claim against the director does not eliminate the risk … it merely mitigates it. Further, we have sought to engage with a registered trust company (Ankura Trust) and a recognized exchange broker (Genesis) to minimize the risk. And for the director, RWA Foundation’s director is a “corporate director” – not an individual. We thought this further mitigated individual risk. It does not, however, eliminate collusion. Other than not dealing with humans at all, I am not sure what does (given the existing tools).     flipflopflapdelegate:  What would happen if you decided to rage-quit and decided to retire in Tierra del Fuego, Patagonia–how easily can the next Christian Peterson pick-up from were you left-off, and identify the necessities needed to run LTS?   This question has three parts: (1) Rage-quit after HVB documents are executed → My objective has been that HVB continues with reduced human intervention. I recognize that some may be required, thus the Delegated Committee concept and Maker governance vote. It will run without me. (2) Rage-quit before HVB documents are executed → We are focused on finalizing and executing the agreements in the next two weeks. So, I am not expecting to rage quit. Teej and Eric know the ins and outs and we are communicative and transparent as a team on what needs to get done in any event. RWF know the high quality external lawyers that have supported on various transactions. So, while there would be an inevitable delay, it would not prevent the transaction from being completed. (3) LTS in general - As you know LTS is “incubating” and I am coordinating with SES on a sensible budget and work force plan to ensure continuity. So the point is fully recognized. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.898118279569893
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/07/2022-15:55:19",
                    "content": "This is how we learn and move forward. We cannot work everything out ahead of time and expect it to run 100% as planned. Thank you for all of the effort you are putting in @christiancdpetersen and team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#5",
                    "likes": "3",
                    "time": "01/07/2022-15:56:30",
                    "content": "This transaction structure is a significant improvement in protecting Maker’s rights and providing transparency from prior ones. But we are always aiming to keep innovating and improving on these key items… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#6",
                    "likes": "0",
                    "time": "01/07/2022-16:01:24",
                    "content": "    Eumenes:  But we are always aiming to keep innovating and improving on these key items…   This is the way!   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/07/2022-11:22:47",
                    "content": "What is RWA Foundation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "1",
                    "time": "02/07/2022-13:04:08",
                    "content": "    rune:  What is RWA Foundation?   MIP58: RWA Foundations  image1450×516 187 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#10",
                    "likes": "0",
                    "time": "02/07/2022-13:29:35",
                    "content": "    rune:  What is RWA Foundation?   You offboarded me due to the RWA Foundation …      MIP41c5-SP2: Facilitator Offboarding (RWF-001)   The main reason why I want Seb to leave as Facilitator is because I believe he has engaged in what I call private entanglement by doing things such as […] proposing legal structures to the DAO from his platform as Facilitator where he personally controls the relationship with the lawyers   Which by the way (and for disclosure), all servicers were paid by my company for 2022. Relevant links:  MIP58: RWA Foundations Pre-MIP discussion - RWA Foundations RWA Foundation #001 - RWA Foundation  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip58-rwa-foundations/9680",
                        "https://forum.makerdao.com/t/pre-mip-discussion-rwa-foundations/9510",
                        "https://forum.makerdao.com/t/rwa-foundation-001-rwa-foundation/11066"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#11",
                    "likes": "1",
                    "time": "02/07/2022-18:09:47",
                    "content": "This is the equivalent entity of the “RWA International Ltd” in the 6s structure. It doesn’t matter whether it’s a limited company, Trust or a Foundation as long as it’s orphaned. Unlike what was being proposed for this entity in the past, in the HVB structure it is (to any significant extent) neutered and all real power remains with the Delaware Trustee (WSFS). Edit: Had to correct the entity type in 6s from “Trust” to “limited company”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.094387755102041
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#12",
                    "likes": "1",
                    "time": "02/07/2022-21:42:35",
                    "content": "    SebVentures:  You offboarded me due to the RWA Foundation …    One key and important difference in this setup though. It is no longer proposed, managed or services paid by the RWF Core Unit or its facilitator. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "30/09/2022-21:42:38",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}