{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/0-sf-to-go-long-on-eth/4732",
            "title": "0% SF to go long on ETH ",
            "index": 4732,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#1",
                    "likes": "3",
                    "time": "14/10/2020-07:32:17",
                    "content": "I suggested that MakerDAO buys ETH (as a protocol reserve/peg control) and that was rejected. If MakerDAO won’t do that, why not just let users do it themselves and help them to do that while maintaining the peg. My idea is to have a guaranteed 0% SF but just as long as the minted DAI is used to buy more ETH (possibly recursively until the limit) - no free farming :). Would that be technically possible using a special vault or some restrictions? We could also set LR to 125% and the OSM delay to 2 hours for such users. The 0% SF would ve valid until the peg is reached (to be defined) but for a minimum of 6 months. MakerDAO could also subsidize the network fees for that vault/users if possible. Some users objected to my statement that the peg is abandoned but I feel that way. Of course, the MakerDAO devs are constantly working on some features that might help with the peg but that work is not directly addressing the problem, it is not short-term and there is a high chance that it won’t help at all (no numbers to show otherwise). I said that the peg is abandoned because DAI is above the peg for 7 months and nobody is concerned enough about the current “status quo” of 1 DAI=1.01 USDC to suggest new immediate measures to increase decentralization and lower the DAI price. ",
                    "links": [],
                    "GPT-summary": "The author proposes that MakerDAO allows users to buy ETH with a guaranteed 0% SF as long as the minted DAI is used to buy more ETH. The author also suggests setting LR to 125% and the OSM delay to 2 hours for such users. The post includes criticism of the current state of the peg and questions about the feasibility of the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.383384262796027
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/01/2021-13:32:21",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}