{
    "poll_list": [
        {
            "title": "Should we add FTM to the Maker Protocol? - May 25, 2020",
            "index": "2292",
            "option": "No",
            "supporting_mkr": "41,138",
            "highest_fraction": 0.99
        },
        {
            "title": "Should we add LINK to the Maker Protocol? - June 22, 2020",
            "index": "2586",
            "option": "Yes",
            "supporting_mkr": "35,195",
            "highest_fraction": 0.92
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/link-collateral-onboarding-application/2586",
            "title": "[LINK] Collateral Onboarding Application ",
            "index": 2586,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "link"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "12",
                    "time": "21/05/2020-22:07:47",
                    "content": "[LINK] Collateral Onboarding Application  Who is the interested party for this collateral application?  @monet-supply Details about the LINK token and Chainlink system were graciously provided by an anonymous member of the Chainlink community.  Provide a brief high-level overview of the project, with a focus on the applying collateral token.  Chainlink is a generalized blockchain agnostic framework for building decentralized oracle networks that provide smart contracts with tamper-resistant access to real world data, events, and payments that reside on off-chain systems. The LINK token is used to pay node operators for delivering off-chain data/compute through LINK’s ERC677 (ERC20 compliant) transferAndCall() function. LINK will also be staked by node operators in service level agreements (SLAs) as collateral which can be slashed for malicious activity, unresponsiveness, or any other predefined condition in the SLA. The LINK token is essentially economic bandwidth for Chainlink oracle networks. SmartContract retains roughly 27% of the total supply of 1,000,000,000 LINK tokens out of an initial 30% allocation. SmartContract also controls an additional 35% of the token supply that is allocated to incentives for node operators. Roughly 38% of supply is circulating (35% from the initial token sale and 3% from SmartContract sales/dispositions).  Provide a brief history of the project.  SmartContract was founded in 2014 as a development company for externally connected smart contracts. Chainlink had a token sale in September 2017 with a cap of $32M. The Chainlink mainnet was launched in May 2019 with an ETH/USD reference price feed. Since then, there are now 30+ price feeds connected with 16 DeFi projects.  Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Whitepaper: https://link.smartcontract.com/whitepaper Documentation: https://docs.chain.link/docs Source Code: https://github.com/smartcontractkit/chainlink LINK token: https://etherscan.io/token/0x514910771af9ca656af840dff83e8264ecf986ca  Link any available audits of the project. Both procedural and smart contract focused audits.  Nick Johnson Audit Report: https://github.com/smartcontractkit/audits/blob/master/reports/Nick%20Johnson%20-%20Chainlink%20Audit%20Report.pdf Quantstamp Audit Report: https://github.com/smartcontractkit/audits/blob/master/reports/Quantstamp%20-%20Chainlink%20Audit%20Report.pdf SigmaPrime Audit Report: https://github.com/smartcontractkit/audits/blob/master/reports/SigmaPrime%20-%20Chainlink%20Smart%20Contract%20Security%20Review.pdf  Link to any active communities relating to your project.  Twitter: https://twitter.com/chainlink Reddit: https://www.reddit.com/r/Chainlink/ Telegram: https://t.me/chainlinkofficial Discord: https://discord.gg/aSK4zew  How is the applying collateral type currently used?  LINK is currently used within the Chainlink ecosystem as a means of payment to oracle node operators for delivering external data/compute to a specific blockchain environment. The LINK token will also be staked by node operators as collateral in service agreements which can be slashed for poor performance or non-responsiveness. LINK is also used as a collateral asset, representing 34% of Aave’s total market size ($23M of $67M) and 40% of Aave’s total value locked ($22M of $54M) as of 21 May 2020.  Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?  No organization bears legal responsibility for the collateral. The token is open source and permissionless, with no blacklisting/whitelisting or minting functionality. SmartContract retains roughly 27% of the total supply of LINK tokens, and including the 35% reserved for node operator rewards retains effective control of roughly 62% of total token supply. It looks like the ICO and company token holdings are managed through SmartContract Chainlink Ltd SEZC, which is registered in the Cayman Islands. SmartContract’s primary place of business is in the US state of California.  Where does exchange for the asset occur?  LINK is traded on centralized exchanges including Coinbase, Binance, Kraken, Gemini, Huobi, OKEx, Bittrex, as well as decentralized platforms such as Kyber, Uniswap, 0x, Loopring, and Oasis.  (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  I am not a lawyer and no part of this collateral application is legal advice. I am not aware of any publicly available legal opinions addressing the project or token’s regulatory standing. For context, LINK is listed on US regulated exchanges such as Coinbase, Gemini, and BinanceUS that are not qualified to offer exchange/brokerage services for securities. This article (https://www.sec.gov/corpfin/framework-investment-contract-analysis-digital-assets) from the SEC may also help frame discussions on the token’s legal classification.  (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.  Per the terms of use (https://chain.link/terms), LINK has not been registered with financial regulatory authorities in any jurisdiction. I am not aware of any regulatory actions regarding SmartContract or the LINK token.  (Optional) List any possible oracle data sources for the proposed Collateral type.  The centralized exchanges listed in (9) may offer data feeds that can be used for a LINK/USD oracle. Chainlink also has a LINK/USD price feed live on mainnet. It is updated every 1% price deviation by 9 independent security reviewed nodes connected to multiple price data aggregators such as BraveNewCoin (feeds data to bloomberg terminal), Coingecko, and Kaiko.  (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type.  N/a Full disclosure: At time of writing I own 60 LINK. Previous discussions relevant to LINK:     [LINK] Risk Parameter Request for Comment Risk       This thread is for discussion of risk parameters for LINK as a collateral type. An earlier discussion can be found in this thread [Action Required] State of the Peg. The parameters that should be discussed are   Debt ceiling Liquidation Ratio Stability Fee Auction parameters  As a result of this thread, a governance poll will go up (likely) Wednesday with a specific package of risk parameters.         [Action Required] State of the Peg Governance       MakerDAO Community,  DAI continues to trade in a perilous, dislocated state at $1.02-1.03. We believe this is an existential threat to MakerDAO’s long term success. Given the state of the peg, we believe emergency action is required and would like to gauge the community for feedback.  The MIPs process may take 1-2 months to onboard new collateral. Lack of action today is an implicit resignation to another 1-2 months of DAI dislocation, which is catastrophic to the broader Maker community of MKR …     ",
                    "links": [
                        "https://docs.chain.link/docs",
                        "https://github.com/smartcontractkit/chainlink",
                        "https://etherscan.io/token/0x514910771af9ca656af840dff83e8264ecf986ca",
                        "https://github.com/smartcontractkit/audits/blob/master/reports/Nick%20Johnson%20-%20Chainlink%20Audit%20Report.pdf",
                        "https://github.com/smartcontractkit/audits/blob/master/reports/Quantstamp%20-%20Chainlink%20Audit%20Report.pdf",
                        "https://github.com/smartcontractkit/audits/blob/master/reports/SigmaPrime%20-%20Chainlink%20Smart%20Contract%20Security%20Review.pdf",
                        "https://twitter.com/chainlink",
                        "https://www.reddit.com/r/Chainlink/",
                        "https://t.me/chainlinkofficial",
                        "https://discord.gg/aSK4zew",
                        "https://www.sec.gov/corpfin/framework-investment-contract-analysis-digital-assets",
                        "https://chain.link/terms",
                        "https://forum.makerdao.com/t/link-risk-parameter-request-for-comment/2118",
                        "https://forum.makerdao.com/t/action-required-state-of-the-peg/2025/51",
                        "https://forum.makerdao.com/t/action-required-state-of-the-peg/2025",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/20",
                        "https://forum.makerdao.com/t/mip12c2-sp6-link-collateral-onboarding/4066",
                        "https://forum.makerdao.com/t/link-collateral-onboarding-risk-evaluation/4047/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-16/4536",
                        "https://forum.makerdao.com/t/weekly-mips-update-14/4028",
                        "https://forum.makerdao.com/t/weekly-mips-update-15/4243",
                        "https://forum.makerdao.com/t/maker-relay-ep-15/4574",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-en-espanol/4576",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-pt-br-portugues/4597",
                        "https://forum.makerdao.com/t/using-chainlink-oracles-for-link-usd/2670",
                        "https://forum.makerdao.com/t/uni-v2-link-eth-mip6-collateral-onboarding-application/6190",
                        "https://forum.makerdao.com/t/uni-v2-link-dai-mip6-collateral-onboarding-application/6058",
                        "https://forum.makerdao.com/t/weekly-mips-update-13/3906"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and scalability",
                        "Community and engagement",
                        "Privacy, security, and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333843972928481
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#2",
                    "likes": "1",
                    "time": "23/05/2020-05:19:22",
                    "content": "Hmm, I didn’t realize that SmartContract retained so much of the supply of link. That unfortunately is not great. Doesn’t really affect use in the makerdao platform as inflation is slow and so not a major risk for mkr holders. As an example though, the state of xrp shows the perils of long term inflation and majority control of a token by a single party. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.676658163265306
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChainLinkGod",
                    "index": "#3",
                    "likes": "3",
                    "time": "18/06/2020-05:43:36",
                    "content": "I would like to chime in here and state that, in my opinion, LINK would be an obvious collateral addition to Maker. It is the largest and most liquid non-stablecoin ERC20 (well technically ERC677 I guess) and there is no shortage of linkies who are willing to go leveraged long on LINK. I think Aave is a prime example of that, which I have personally used myself. Behind only Ethereans, Linkies use DeFi applications more than any other community I know of. The addition of LINK to Maker would greatly increase the amount of DAI minted that could be minted. The supply is very transparent and it is being used to further the growth of the Chainlink ecosystem, which directly feeds into the value of LINK, which directly leads to speculation on LINK, which directly leads to people going leveraged long, which directly leads to more minting of DAI. LINK is highly liquid and has proved itself to be an anomaly as far as ERC20 tokens go when you look at long term price performance. Additionally to note, the team is not going to dump their tokens for a quick buck when it’s far more profitable to build a large, healthy, and growing ecosystem of oracle networks. Since LINK is not a governance token or a PoS coin, but a utility token (payments and staked as collateral) so the supply distribution is actually ideal for long term sustainability of the network. The team dates back to 2014 before the launch of Ethereum, and similar to the community, they’re in this for the long run. I see no downside from adding LINK as a collateral addition to Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.809784226190477
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#4",
                    "likes": "2",
                    "time": "18/06/2020-08:41:09",
                    "content": "Hi, if you check this list Collateral Status Index you can see that the LINK collateral application has already progressed through the Domain Greenlight and is approaching Community Greenlight. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "4",
                    "time": "18/06/2020-12:49:06",
                    "content": "Just to clarify, LINK hasn’t had any public Domain Greenlights yet. Community Greenlight is scheduled for next Monday. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-6/2914"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChainLinkGod",
                    "index": "#6",
                    "likes": "2",
                    "time": "19/06/2020-17:55:56",
                    "content": "A relevant point I want to bring up is that while there is a huge demand in the Chainlink community to use LINK within DeFi, currently the largest competitor of Maker, Compound, has yet to list LINK, leaving a major hole that Maker could easily fill and take market share out from under Compound. After the launch of the COMP token, Compound is dangerously close to overtaking Maker in Total Value Locked https://defipulse.com (Compound grew from $90M TVL to $410M in a couple days), and a good way for Maker to keep an edge ahead of them is to list high in-demand collateral that Compound does not support like LINK. It’s important to keep the status as the leading DeFi project, or you risk even more people switching to competitors. There is a large amount of LINK out there across many holders (153,000 on-chain addresses) waiting to deposit their LINK into DeFi. Not only that, but Linkies historically hold their LINK for a very long time. “Data extracted from the underlying blockchain and cryptocurrency markets reveal declining balances of the token held at exchanges. In the logic of digital-asset traders, that’s seen as a sign that holders of the token have no near-term intention of selling their LINK tokens” - CoinDesk (https://www.coindesk.com/first-mover-chainlink-marines-hodling-investing-oracles). Many of the other proposed collateral types I see do not have nearly as many holders, have holders who don’t hold for very long, and/or have communities who don’t use DeFi products very often. The demand for going leveraged long on LINK (and thus minting DAI) is much higher than the rest of all other proposed collateral types combined. Additionally, Linkies historically have heavily dogfooded, bootstrapped, and supported DeFi projects that use Chainlink oracles. This means if Maker used the https://feeds.chain.link/link-usd price feed, much more DAI would be minted as a result, due to the increased trust from Linkies. I think Rune sums it up very well in his comment here (Using Chainlink Oracles for LINK-USD). By adding LINK as a collateral type and using the Chainlink LINK/USD price oracle, not only will you will gain a huge amount of support from the large and growing Chainlink community, but a substantial amount of DAI will be minted as a result as LINK is not a collateral type supported by competitors such as Compound. This is a major mistake on the behalf of Compound, and is something that Maker can heavily benefit from by supporting LINK. In my opinion, this is the best possible time to list LINK as a collateral option under MCD enabling more DAI to be minted. ",
                    "links": [
                        "https://www.coindesk.com/first-mover-chainlink-marines-hodling-investing-oracles",
                        "https://feeds.chain.link/link-usd",
                        "https://forum.makerdao.com/t/using-chainlink-oracles-for-link-usd/2670/16"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.87075702075702
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/ftm-collateral-onboarding-application/2292",
            "title": "[FTM] - Collateral Onboarding Application ",
            "index": 2292,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#1",
                    "likes": "3",
                    "time": "01/05/2020-06:00:56",
                    "content": "Fantom Foundation submitted the MCD application previously ([FTM] - MCD Application by FANTOM - #5 by Andy_McCall), and here’s an updated application that complies with the MIP6 format. MCD Application Form for FANTOM  Who is the interested party for this collateral application?  Michael Kong, CIO at Fantom Operations Ltd  Provide a brief high-level overview of the project, with a focus on the applying collateral token.  Fantom is a distributed ledger technology stack. At its foundation, it is a DAG-based distributed ledger incorporating new methods of scalability, combined with a high-performance virtual machine and safe, secure smart contract execution.  Provide a brief history of the project.  Fantom did an ICO in 2018, and was one of the most popular ICOs in 2018, raising approximately USD$40million, mainly in Ether. Since then, Fantom has become a global company with team members located around the world in countries such as Australia, UK, USA, South Africa, Russia, Czech Republic, and others. Fantom has built and launched a mainnet In December 2019 based on “Lachesis”, our DAG-based aBFT consensus engine, combined with the Ethereum Virtual Machine (EVM) for smart contract support. It is open source and permissionless, meaning anyone can join or leave the network at many time. Using Lachesis and Proof of Stake, Fantom is able to achieve higher transactions per second and lower confirmation times than other existing projects out there.  Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Whitepaper: https://fantom.foundation/contents/data/2018files/10/wp_fantom_v1.6.pdf. Please not that the whitepaper has not been recently updated. Organization: Fantom · GitHub Go-lachesis: GitHub - Fantom-foundation/go-lachesis: aBFT consensus for permission-less networks Tokensale: GitHub - Fantom-foundation/tokensale: Token sale smart contract and audits Live ERC-20 token contract source code: https://etherscan.io/address/0x4e15361fd6b4bb609fa63c81a2be19d873717870#code  Link any available audits of the project. Both procedural and smart contract focused audits.    github.com   Fantom-foundation/tokensale/blob/master/audits/fantom-audit-first.pdf %PDF-1.5 %ÐÔÅØ 75 0 obj << /Length 319        /Filter /FlateDecode >> stream xÚ]ÉN1ïó9&ãz³pdiEo Ä¡*õÐV¯g¦PE-;ÿç%èÞºYgìFG8juIª&·Ü4ï äEÜ!uÒ» ¹]soçâ³k³T=cÊµÄ_wH%TÈË¨(Äø|ÎoI*&×j. úW]3rq«ë^]ÌÓ`ÍÐ½¸'? \týb{~¢ßçnnÊê8Ú¬zeË(@ÖEkRªgJ*~·\t-Kö× ³=ì¨_,cô!úU(þk½úîù ö{·{fmMmGûbT Ú¾$ Åbß>Ö»íehÙà;~âÐ7}¨ªB$cqQ`ÛÌnWÐ_í1Ê?ÔÉÞvÍ©®w' endstream endobj 71 0 obj << /Type /XObject /Subtype /Form /FormType 1 /PTEX.FileName (/home/age/texmf/tex/latex/SigmaPrime/imgs/SigmaPrimeMasterLogoBlack.pdf) /PTEX.PageNumber 1 /PTEX.InfoDict 83 0 R /BBox [0 0 433.700775 127.559052]      This file has been truncated. show original        github.com   Fantom-foundation/tokensale/blob/master/audits/fantom-audit-second.pdf %PDF-1.5 %ÐÔÅØ 75 0 obj << /Length 318        /Filter /FlateDecode >> stream xÚ]ÉN1ïó9&ãz³pdiEo Ä¡*õÐV¯g¦PE²­8ÿ/èÞºYgÌ¢#GAµº¤U[n÷r\"Ã?á:é» ¹]soçâ³k³T=cÊµÄßpH%TÈË¨(Äø|ÎoI*&×j. úW]3rq«ë^]ÌÓàõÐ½¸'? \týb{~¢ßçnnÊê8Z¯zeË(@VEkRªgJ*~·\t-Kö× ³=ì¨_,ãíC õ«Pü×zõÝóíçnvfeumFûÏ¨&¨ÖdÔñ¯ÇÀFØ÷õn{ZAö8Ò;Ê&²½é@j©Ö&ÏEm.kþ¹]B1Ç(z*ÿH'Û5?ÃªvË endstream endobj 71 0 obj << /Type /XObject /Subtype /Form /FormType 1 /PTEX.FileName (/home/age/texmf/tex/latex/SigmaPrime/imgs/SigmaPrimeMasterLogoBlack.pdf) /PTEX.PageNumber 1 /PTEX.InfoDict 83 0 R /BBox [0 0 433.700775 127.559052]      This file has been truncated. show original       Link to any active communities relating to your project.     Telegram    Fantom Foundation - English You can view and join @Fantom_English right away.         reddit    r/FantomFoundation      https://twitter.com/FantomFDN    Medium    Fantom Foundation – Medium The core of the new internet.      Discord (Fantom has migrated from Telegram to discord)  How is the applying collateral type currently used?  From the Binance research report: 1.For staking with a validator node: To secure the network in return for block and transaction rewards. Nodes will be ranked based on the speed at which they confirm transactions. Therefore, better performing nodes with better hardware will earn more rewards on average per FTM staked 2.To pay transaction fees: Users can pay transaction fees using FTM 3.To vote on on-chain governance proposals: Each token holder running a validator node, or who has delegated their FTM to a validator node, will be able to vote on proposals to change the structure of the mainnet, modify system parameters such as block rewards, and the election of moderators and the technical committee   Be used to provide liquidity for DeFi modules: Users will be able to collateralise their FTM and FTM rewards to generate stablecoins such as fUSD, which can be used across DeFi modules on the mainnet to lend and borrow, as well as generate Synthetic assets.   Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?   The token was issued in the Bahamas under Fantom Bahamas Ltd.  Where does exchange for the asset occur?  FTM is listed on many exchanges including Binance, OKEx, and Coinone. Full list can be found here: https://coinmarketcap.com/currencies/fantom/markets/reported/  (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  It was reviewed by a number of law firms including King and Wood Mallesons, Aird Berlis, Tomashevskaya & Partners, Osborne Clarke, Anderson Mori & Tomotsune, and P&A Law Offices. Fantom’s General Counsel is Fred Pucci, a securities lawyer.  (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.  N/A  (Optional) List any possible oracle data sources for the proposed Collateral type.  https://coinmarketcap.com/, Band Protocol, Chainlink  (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type.  Fantom Foundation Open to include others as well, such as from the Fantom community, and others. ",
                    "links": [
                        "https://fantom.foundation/contents/data/2018files/10/wp_fantom_v1.6.pdf",
                        "https://github.com/Fantom-foundation",
                        "https://github.com/Fantom-foundation/go-lachesis",
                        "https://github.com/Fantom-foundation/tokensale",
                        "https://etherscan.io/address/0x4e15361fd6b4bb609fa63c81a2be19d873717870#code",
                        "https://github.com/Fantom-foundation/tokensale/blob/master/audits/fantom-audit-first.pdf",
                        "https://github.com/Fantom-foundation/tokensale/blob/master/audits/fantom-audit-first.pdf",
                        "https://github.com/Fantom-foundation/tokensale/blob/master/audits/fantom-audit-first.pdf",
                        "https://github.com/Fantom-foundation/tokensale/blob/master/audits/fantom-audit-second.pdf",
                        "https://github.com/Fantom-foundation/tokensale/blob/master/audits/fantom-audit-second.pdf",
                        "https://github.com/Fantom-foundation/tokensale/blob/master/audits/fantom-audit-second.pdf",
                        "https://t.me/Fantom_English",
                        "https://t.me/Fantom_English",
                        "https://www.reddit.com/r/FantomFoundation/",
                        "https://www.reddit.com/r/FantomFoundation/",
                        "https://twitter.com/FantomFDN",
                        "https://medium.com/fantomfoundation",
                        "https://medium.com/fantomfoundation",
                        "https://discord.gg/6V42Gs8",
                        "https://coinmarketcap.com/currencies/fantom/markets/reported/",
                        "https://coinmarketcap.com/",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/15"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.87013919988058
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "4",
                    "time": "01/05/2020-06:39:59",
                    "content": "@Brian_Yun and @Doo, FANTOM is an interesting case, but I have a question: Presently FTM is an ERC20, which is not hard to integrate with Maker’s system, but the mainnet system is DAG based. How does this work? And what are the present use cases? If FANTOM used ERC20 initially to raise funds from the ICO and are later planning to migrate to a DAG system, I feel we might be dealing with a possibly solid but premature collateral type application. Maker’s resources are stretched already and I do not really feel like recommending onboarding interim solutions. Please correct me if there is anything I have misunderstood. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.275462962962964
                },
                {
                    "author_link": "https://forum.makerdao.com/u/giraffecum",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/05/2020-05:14:07",
                    "content": "I’m not sure what capabilities Maker has in regards to integrating non-ERC20 tokens but ever since Fantom’s Opera mainnet launched they have a native Opera token. Mainnet was launched in January 2020 and there is a dedicated bridge for converting ERC20 and BEP2 FTM tokens to the mainnet (and back, if desired). About 50% of tokens have been staked to mainnet. Not sure this answers your concern about Maker already stretching it’s resources, but Fantom is not premature vision. There is a fast and secure product ready for use. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/James_Zain",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/05/2020-17:37:05",
                    "content": "The mainnet FTM token has already been issued. However for the foreseeable future FTM will keep it’s ERC20 token. There is a bridge where users can swap between the ERC20 token and the mainnet token, and vice-versa (https://bnbridge.exchange) The present use cases for the mainnet token are to pay for transactions, and to secure the network by setting up a validator and staking tokens, or by delegating tokens to an existing validator. This year, tokenholders will also be able to vote on proposal and network changes via a governance contract, and also collateralise their FTM to generate assets such as fEUR, an EUR stablecoin. For the ERC20 token, it is mainly used for trading on exchanges. Since many exchanges support ERC20, we will likely keep it for a very long time. By adding ERC20 FTM as a MCD, we are also extending the use case of the FTM token, encouraging people to use both ERC20 and mainnet FTM. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.834259259259259
                }
            ]
        }
    ],
    "group_index": "2317"
}