{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collaboration-proposal-cryptotoday-com/13315",
            "title": "Collaboration Proposal <> CryptoToday.com ",
            "index": 13315,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/CryptoToday.com",
                    "index": "#1",
                    "likes": "0",
                    "time": "19/02/2022-09:07:52",
                    "content": "APOLOGIES if I have put this topic in the wrong section Hello, I’m Josip, the CIO of CryptoToday - a Decentralized Crypto Data Provider best described as decentralized CoinMarketCap. Website:  https://cryptotoday.com/  I wanted to reach out to you and ask if you want to be one of the first projects listed on CryptoToday, and place your project among others, such as Verge Currency and PIVX? More and more projects have problems with coinmarketcap and coingecko, and we really want to put an end to this through complete decentralization and putting power in the hands of the community. Important - Our Hacken audit will be done this week. Just think about it, how many times you were manipulated by CMC by being unfairly listed and them providing false information, let’s change that!? All we are asking for is mutual support on Twitter and telegram to inform our communities that we are working together to fight for decentralization. Tweet example:  https://twitter.com/vergecurrency/status/1493293107156242441 https://twitter.com/_PIVX/status/1493632135491637257  P.S.  You can hear more about CryptoToday on the Pomplianos podcast this week! https://twitter.com/APompliano Best, Josip CryptoToday ",
                    "links": [
                        "https://twitter.com/vergecurrency/status/1493293107156242441",
                        "https://twitter.com/_PIVX/status/1493632135491637257",
                        "https://twitter.com/APompliano"
                    ],
                    "GPT-summary": "The CIO of CryptoToday is proposing a collaboration with the recipient to be one of the first projects listed on CryptoToday, a decentralized crypto data provider. They are asking for mutual support on Twitter and Telegram to inform their communities that they are working together to fight for decentralization. The post also includes links to examples of tweets from other projects that have collaborated with CryptoToday.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party advertising proposal"
                    ],
                    "Sentiment": 6.276785714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "0",
                    "time": "19/02/2022-15:40:55",
                    "content": "I find what they propose interesting, although I don’t think Coingecko is particularly manipulable. What value do they present directly in the name of decentralisation? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#3",
                    "likes": "0",
                    "time": "19/02/2022-22:32:46",
                    "content": "I find the project interesting. Also the distribution of the tokens will be fair, I understand the part of placing in a pool, but a whale someone big will have preference? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CryptoToday.com",
                    "index": "#4",
                    "likes": "0",
                    "time": "19/02/2022-22:35:20",
                    "content": "    Saludiego_201:  What value do they present directly in the name of decentralisation?   As described in our whitepaper, currency listing protocols lack community verification. Our goal is to develop a fast and verifiably fair system for listing and providing details about your favorite tokens. With the current situation on the market, you can only see fairly established projects and get a shallow view of what the project is all about – no community exposure, no decision-making. We want to level the playing field for every crypto project and fully decentralize the process of listing and validating blockchain projects. The platform users will be the primary driving force in the decision-making process for listing projects on CryptoToday. OG voters protect the community against scams and bad actors. The LIST token will be used as a governance and utility token on the platform and the central operating part of the DAO. It will be used to list projects, reward Users, vote in the DAO decisions, call for revotes, etc. We beat the current coin listing sites by taking the centralization and their desire for bribe-taking, begging, and pleading to get listed there to the hands of the community with CryptoToday decentralized project. In short, any project now will be able to get listed, at a community-set low price, verified by the community, listed by the community. No need to buy favors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.645833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CryptoToday.com",
                    "index": "#5",
                    "likes": "0",
                    "time": "19/02/2022-22:37:31",
                    "content": "Our system is based on the 1 wallet = 1 vote rule. I think this is the first thing we should clarify. Buying votes on the Ethereum chain this way can get so costly that going to CMC could look like a walk in the park haha. Ok, let’s say some shady/bad project wants to buy their way into a revote because the community ousted them. They give an OG some amount to cast a revote and question the voting. He does it by staking his OG rep. The vote goes back to step 1 and the community needs to vote again. The chances of the vote changing are really small unless the OG provided some really compeling argument on why the vote should pass. Ultimately he is taking a bribe with 0 guarantees of the outcome while staking his reputation. Keep in mind that in order to be an OG on the platform you have to have 50 straight correct votes AND be in the 1% of the most successful voters. If you fail your revote you are going back to 0 while loosing tokens at the same time. From our perspective, people are usually going to be voting correctly because they guarantee honesty with their tokens. For an OG these stakes are even higher and the outcome is STILL LEFT TO THE COMMUNITY. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.602941176470589
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#6",
                    "likes": "1",
                    "time": "20/02/2022-00:24:40",
                    "content": "Thank you for the approach. However, especially since the platform is not yet launched, makes more sense to wait and see rather than committing. In addition, As both MKR and DAI are major coins, it’s expected that the crypto datat services will integrate such data anyway so would be great if there are more benefits than “to show we are working together to fight for decentralization” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.258928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#7",
                    "likes": "1",
                    "time": "21/02/2022-19:40:33",
                    "content": "Ok seeing it in macro the project I like it without a doubt if everything in the whitepaper is fulfilled I would like to belong to the community.     Doo_StableLab:  Thank you for the approach. However, especially since the platform is not yet launched   It is true what Doo says, it is better for both parties to wait until the project is already launched and in a mature stage. Thanks for your trust in Maker ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.375
                }
            ]
        }
    ]
}