{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/poll-should-we-the-maker-community-assemble-a-compliance-working-group-and-discuss-discover-the-direction-of-the-dao-with-regards-to-worldwide-regulatory-compliance/4531",
            "title": "[POLL] Should We, the Maker Community assemble a \\xe2\\x80\\x9cCompliance Working Group\\xe2\\x80\\x9d and discuss & discover the direction of the DAO with regards to Worldwide Regulatory Compliance? ",
            "index": 4531,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "1",
                    "time": "04/10/2020-13:05:56",
                    "content": "“If BTC and ETH Maxis all got along They’d probably gun me down by the end of this post” –Kendrick Lamar With regards to the recent allegations (All Defendants are presumed innocent, until proven Guilty beyond a reasonable doubt) made by U.S. Regulatory Agencies towards popular platforms in crypto, which in my opinion hint that the Department of Justice will start enforcing U.S. Anti-Money Laundering laws, what are the implications and risk to the Maker Community? The idea has already been ask by community member @SebVentures https://bit.ly/2Gye96v and it seems as if most of us want to avoid talking about it, or we believe Regulators just don’t understand us. If there is a “Risk” to ALL community members, including non-Americans—should we start a working group examining the possibilities of compliance initiatives? We have to believe and think that eventually there will be a day that Regulators will come after anybody who is not in compliance. And you have to believe/think that if you are an ANON it does not mean that you cannot be found by these powerful U.S. agencies. But I don’t need to tell you that. What I can tell you is that Risk is real, and fear is not. With that in mind I have create this Poll: Should we the Community create a Compliance Working Group?     Yes No Abstain     0 voters     Should we start thinking about implementing KYC/AML requirements for ALL components/moving parts of Maker?     Yes No Abstain     0 voters     Do you believe KYC/AML does not apply to DeFI?     Yes, KYC/AML does Not apply to DeFi No, it does apply to DeFi Abstain     0 voters     2020-10-04T04:00:00Z → 2020-10-17T04:00:00Z ",
                    "links": [
                        "https://forum.makerdao.com/t/specialization-unlocks-complexity/15709/12"
                    ],
                    "GPT-summary": "The author of the post is proposing the creation of a Compliance Working Group to discuss the implications and risks of U.S. Anti-Money Laundering laws on the Maker Community. The author is asking for feedback from the community through a poll and is also asking questions about the implementation of KYC/AML requirements for all components of Maker. The post could benefit from constructive criticism and auditing/reviewing by third parties.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.477588383838384
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/10/2020-13:15:48",
                    "content": "Can you redo the polls adding abstai and making vote public? Thanks  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "2",
                    "time": "04/10/2020-13:37:59",
                    "content": "Okay I think I got it right.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/10/2020-16:24:50",
                    "content": "    flipflopflapdelegate:  implementing KYC/AML requirements   Thanks for this poll. I am not sure the questions are very well conceived, though. While it’s clear that there will be some kind of KYC/AML involved with RWA, it should be kept distinct from non-RWA DeFi in my opinion. So for example it’s hard to answer to question2 \" Should we start thinking about implementing KYC/AML requirements?\" given the current options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.536458333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "0",
                    "time": "04/10/2020-17:27:41",
                    "content": "    iammeeoh:  So for example it’s hard to answer to question2 \" Should we start thinking about implementing KYC/AML requirements? \" given the current options.   Sorry, I meant KYC/AML for ALL moving parts of participating in Maker, RWA, or non-RWA. Hopefully that makes sense. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 3.680555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#6",
                    "likes": "1",
                    "time": "05/10/2020-04:44:54",
                    "content": "I’m glad that you brought this up, we don’t have any legal domain teams doing due diligence (at least in an open manner) in respect to collateral onboarding and this would be a good step forward, however once we do we can’t shut our eyes at things we don’t like & that’s something to consider. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#7",
                    "likes": "3",
                    "time": "05/10/2020-09:09:42",
                    "content": "I generally love polls but I will protest the wording in this one.  There is no such thing as Worldwide Regulatory Compliance. There are just an overlapping net of national and multinational frameworks. This makes KYC/AML “for all parts of Maker” impossible before you even try as you would need to comply with all KYC/AML in all countries. Do I believe KYC/AML does not apply to DeFi? KYC/AML are national sets of legislations with differing applications for businesses and private persons. Compliance is national and according to entity. One example being US individuals who are not accredited investors not being allowed to participate in ICOs, but it is ok for investment funds. For any non-US individual this does however not apply. For an individual European investor defi is no problem. For a company however it is likely chanceless as you need to KYC your customers  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "0",
                    "time": "05/10/2020-14:03:26",
                    "content": "    Planet_X:  I generally love polls but I will protest the wording in this one.   For sure–not the best wording on my attempt to get the community to talk about what we All probably don’t want to talk about–\"regulations.\"     Planet_X:  There is no such thing as Worldwide Regulatory Compliance. There are just an overlapping net of national and multinational frameworks.   Here my attempt is to discuss regulations by Regions. I don’t know much about the EU, Asia, South America, regulations–my attempt is to set up a working group with community members of each region, and explore–what are the regional regulations and what we can do to be compliant? If anything.     Planet_X:  This makes KYC/AML “for all parts of Maker” impossible before you even try as you would need to comply with all KYC/AML in all countries.   You’re probably right–my attempt is to explore the need to have KYC/AML for Oasis, and call me crazy–but even maker community members who will lead the DAO when the Maker Foundation is no longer around. I imagine if we are to pay Devs, Community, Risk Teams, we are going to have to report the expenditures, no?     Planet_X:  Do I believe KYC/AML does not apply to DeFi?   A top Tech Attorney stated recently  that in his experience dealing with some DeFi founders, most believe, “KYC/AML does not apply to DeFi”. Hence, I wanted to get an idea if the community thinks the same ( I highly doubt it). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.996969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#9",
                    "likes": "3",
                    "time": "05/10/2020-15:06:09",
                    "content": "It’s basically a question of: are you here only to make money or you also have some political/ideological beliefs/incentives. Compliance Working Group is probably a smart thing to do, but:     Planet_X:  There is no such thing as Worldwide Regulatory Compliance. There are just an overlapping net of national and multinational frameworks.   Money cannot be non-political. Decentralization is one of the core principals (voted on) of this DAO. I am not arguing to fight regulatory compliance, but giving preferential status to the US government is not something i would be thrilled of supporting. Also, If Wall Street power is not broken in next 10-20 years, this is not really DeFi. It reminded me of this post:    reddit    r/MakerDAO - KYC is absolutely not acceptable for MakerDAO! 242 votes and 78 comments so far on Reddit      ",
                    "links": [
                        "https://www.reddit.com/r/MakerDAO/comments/de0sys/kyc_is_absolutely_not_acceptable_for_makerdao/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.517857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#10",
                    "likes": "0",
                    "time": "05/10/2020-15:38:57",
                    "content": "    flipflopflapdelegate:  Here my attempt is to discuss regulations by Regions. I don’t know much about the EU   Currently there are no EU crypto regulations. It is, more or less, regulated on a national level. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving information about EU crypto regulations",
                        "3rd party giving feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "1",
                    "time": "05/10/2020-15:48:30",
                    "content": "    jernejml:  Also, If Wall Street power is not broken in next 10-20 years, this is not really DeFi. It reminded me of this post:  reddit  r/MakerDAO - KYC is absolutely not acceptable for MakerDAO!  242 votes and 78 comments so far on Reddit   Jern this is such a good Reddit post–thank you for sharing. Ya, I mean–I don’t want KYC/AML–I understand the struggle of people from other countries, who do not have opportunities as others do–and this is why I  DeFi  – I wish we could 1000% decentralize by tomorrow morning… hopefully the road to such is near ",
                    "links": [
                        "https://www.reddit.com/r/MakerDAO/comments/de0sys/kyc_is_absolutely_not_acceptable_for_makerdao/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#12",
                    "likes": "0",
                    "time": "06/10/2020-11:50:15",
                    "content": "I am vehemently opposed to KYC. The whole point of DeFI is to be permissionless. If we decide to add US-based KYC than we have successfully returned to square one. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "0",
                    "time": "06/10/2020-13:55:59",
                    "content": "I’m oppose to KYC as much as you brother. But the Regulators are laying down the hammer  Even McAfee who thought he was invincible got handcuffed and got thrown in the back of a paddy wagon. Anon, or non-Anon–it ain’t safe out there. These guys will find us–or they’ll have your buddy rat you out. What to do… ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Governor",
                    "index": "#14",
                    "likes": "1",
                    "time": "06/10/2020-14:41:45",
                    "content": "KYC/AML is a BIG NO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "05/01/2021-20:41:45",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}