{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/v1-governance-portal-feedback/41",
            "title": "V1 Governance Portal Feedback ",
            "index": 41,
            "category": [
                "Governance"
            ],
            "tags": [
                "feedback"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "0",
                    "time": "28/06/2019-13:40:10",
                    "content": "Previously in reddit there was a thread for governance portal feedback. This topic is meant for the community to collate and discuss feedback. ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking for feedback on the V1 Governance Portal and has created a thread for the community to discuss and collate feedback. The post may also be of interest to third parties who want to give constructive criticism, ask questions, or review the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "2",
                    "time": "28/06/2019-13:40:44",
                    "content": "Copying in my feedback from reddit… Basic QoL improvements A splash/overview page that shows each active poll, the currently winning option and whether you have voted on it. This should be a quick an easy way to see what is important now. This should include both polling and executive votes. A page to show recently concluded polls (by default the last month) and the winning option for each. This should give a quick overview of the recent activity and should include both polling and executive votes. This could be combined with the overview page suggested above. A page to show all polls that is searchable, filterable and sortable by as many criteria as possible. Anyone looking for specific information should be able to find it. A page to show the options for an individual poll. Each option is a single line of text, showing a title and the current percentage of the vote. Currently, when we have lots of options, they don’t fit on the screen. This should be easy to expand into a brief ~3 line description of the options, which can be further expanded into the full detail of the polling option. Options within an individual poll to be searchable, filterable and sortable on as many criteria as possible. This lets you have a ridiculous number of polling options if necessary. This lets voters and interested parties find what they are looking for. Useful expansions A UI to show the history of MKR distribution among polling options on a block by block basis. This helps gather potentially useful metrics around polling: Have minds changed, how swift is engagement, etc. An option to hide the amount of maker that has voted on individual options, for either some or all of the poll’s duration. This helps force voters to make their own decisions and not follow a majority. This should be temporary if we want to prompt consensus formation for some part of the poll duration. A UI for viewing the history of how an individual address has voted in all polls. This would allow MKR holders to judge the past decisions of maker holding addresses. This would allow MKR holders to identify addresses that have no voting history and therefore an increased likelihood of malicious activity. Gamer-changers Implement a comment system similar to the one on reporters.chat  There should exist a place to back opinions with MKR to help ensure that people are speaking in good faith (backed by monetary incentive).  Implement the ability (and supporting UI) for MKR holders to add poll options to an existing poll.  This helps to eliminate the anchoring and adjustment problem of fixed poll options. This undercuts the argument that Rich/Foundation/etc are stacking the outcome through selecting options. Combined with a comment system, this allows the organic formation of true consensus among MKR holders over the poll’s duration.  Incentivize MKR holders to vote by rewarding them directly with some percentage of the MKR collected as the governance fee.  If you want more holders to vote, then they should be directly rewarded for doing so. Holders are already rewarded for making the best decisions possible by the buy&burn mechanism, so if holders do vote, it is in their interest to vote sensibly. This promotes the development of vote delegation. Busy MKR holders can delegate to non-busy holders, and they can split the voting reward.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.95452380952381
                }
            ]
        }
    ]
}