{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-vaults-market-activity/9787",
            "title": "Maker Vaults Market Activity ",
            "index": 9787,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "analysis"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#1",
                    "likes": "17",
                    "time": "11/08/2021-04:53:45",
                    "content": "As we mentioned before, we are working on identifying market activity of vault users. This analysis is based on the snapshot taken on August 3rd and represents the majority of issued dai from non-stablecoin vaults and PSM (some LP vaults are also excluded) and focuses on dai rate arbitrage on popular DeFi lending markets on Ethereum. It includes 641 unique user accounts with 851 total vaults that issued 1.84B dai at the time of the snapshot (one user can own multiple vaults of the same type, e.g. ETH-A). The data does not include market activity done by a different address than the address who opened the vault (e.g. user issues dai, sends it to a different address and then does something with the dai), but the sample still represents a large amount of dai issued. One of the most popular dai activity is rate arbitrage between the stability fee and other on-chain lending markets such as Compound or Aave protocol markets. This can either be done by supplying dai on these lending markets, or recursive leverage farming which offers even higher yield arbitrage. This activity was greatly increased after Compound and later Aave introduced liquidity mining rewards. The net dai used in Compound recursive leverage farming from vaults we captured in the snapshot amounts to 330.14M, 165.62M in Aave v2 and 4.74M in Aave Polygon market. The total supply and borrow market size of dai after the recursive leverage produced by these vaults amounted to 1.28B & 0.95B in Compound, 787M & 621M in Aave v2 and 24M & 19M in Polygon Aave. The supply only strategy is less popular as it amounted to 64.14M dai in Compound and 1.34M in Aave v2, while there are no accounts with such strategy on Polygon Aave market in the snapshot. We also looked at Cream for such activities, but we did not identify a single account.  Chart1200×742 35.3 KB  As seen on the chart above, Compound is dominating recursive leverage farming with 66% share, while it is even more popular among accounts that arbitrage the rates by just supplying dai to the lending markets.  Chart1200×742 32.2 KB  The identified recursive leverage farming strategy users utilize six different vault types; ETH-A, ETH-C, WBTC-A and WBTCETH, UNIETH and DAIETH UNIV2. In total they issued 634.43M dai, while the total farming positions amounted to 500.51M dai, meaning they are still 133.92M or 21.1% dai short if they would want to repay the debt. These users are therefore less risky, because they can withdraw dai from lending markets on demand (except Polygon Aave market where withdrawal can take up to 3 hours), repay the debt in their vaults and increase their collateral ratio without bidding up dai on the market. ETH-A vault type is the most popular vault type for recursive leverage rate arbitrage strategy by far (approximately 28% of dai from ETH-A), the aggregated dai issued by vault type chart is below.  Chart1322×816 16.2 KB  For the supply only rate arbitrage strategy on the lending markets users utilize seven different vault types; ETH-A, ETH-C, ETH-B, WBTC-A, LINK-A, UNI-A and UNIV2 USDCETH, where ETH-C is the dominant one. In total, vault users issued 136.4M dai, while 65.48M is supplied to lending markets and not used for further recursive leverage, thus these strategy users are 52% dai short. The aggregated dai issued by vault type chart for supply only rate arbitrage strategy can be seen below.  Chart1200×741 19.6 KB  Here are some examples of how much these strategies are yielding approximately. We used the most popular vault type in each strategy, the typical CR these users maintain and rates in the lending markets at the time of writing for calculation. For cost of capital or the opportunity cost, the highest net supply rate across Compound and Aave v2 was used, which also includes liquidity mining rewards (0.56%). For the supply only strategy (SO), the popular vault type is ETH-C, which currently has a stability fee of 0.5% and typical CR of 500%. Supply only strategy yields 4.27% on Compound and 4.18% on Aave v2, therefore the dai rate arbitrage is 3.77% and 3.68% respectively, and yield on ether in collateral is 0.97% and 0.88% after 500% CR and 0.56% cost of capital is considered. For the recursive farming (RF) strategy with near to maximum possible leverage, the popular vault type is ETH-A, with current stability fee of 2% and typical CR of 200%. Recursive farming strategy yields 11.9% on Compound, 11.94% on Aave v2 and 15.39% on Polygon Aave market. The dai rate arbitrage is therefore 9.9%, 9.94% and 13.39%, and yield on ether in collateral is 7.10%, 7.14% and 10.59% respectively if we consider 200% CR and 0.56% cost of capital.  1234×369 34.3 KB  The highest yielding strategy of dai rate arbitrage is on Polygon Aave market, which yields 12.27% per year on ether capital considering the above assumptions. This strategy has a higher yield due to additional risks associated with Polygon sidechain and higher possibility of liquidation event in Maker, since withdrawal of dai from Polygon can take longer than OSM price update does. Considering that the recursive farming strategy yields around 8.8% on capital used for collateral per year on Compound and Aave v2 and that some of the vaults using this strategy represent a large amount of dai issued, the 2% ETH-A stability fee could potentially be increased.  Conclusion We are currently collecting this data on a daily basis with the intent to continuously monitor vault activity. This will allow us to better understand what vault users are doing with their dai, and how risky their vault position is relative to net short exposure to dai; a user who actually still owns majority of their debt can increase their collateral ratio faster and without bidding up dai on the open market. Additionally, understanding the effective yield of vault users can help determine stability fees for respective vault types. One of the things we are currently trying to solve is how to identify other addresses that vault users are using for different activities such as farming on lending markets without the manual work of looking at addresses on Etherscan. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-64-en-espanol/10548",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-september-2021/10659",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-august-15th-2021/9909",
                        "https://forum.makerdao.com/t/maker-relay-ep-64/10540",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-6th-12th/9823",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-august-2021/10106",
                        "https://forum.makerdao.com/t/decreasing-liquidation-ratios-proposal/9819/5"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.565476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/08/2021-12:21:51",
                    "content": "Really loving the analysis coming out of Risk lately! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/08/2021-13:44:03",
                    "content": "I love your work, you are doing it well, no complaints or reproaches from me, very good work team, keep it up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "3",
                    "time": "11/08/2021-18:35:06",
                    "content": "Finally! I was saying since inception of farming that it was likely that a rate increase to mitigate the returns on farming was probably the right thing to do.  Knowing where to apply that rate increase is quite important, knowing what effect the rate increase will have also important. I have been saying since even before BlackThursday that really good monitoring on what people were doing with vaults and DAI would give Maker operations and governance a key data element needed to be on top of key DeFI environment changes.     rema:  We are currently collecting this data on a daily basis with the intent to continuously monitor vault activity. This will allow us to better understand what vault users are doing with their dai, and how risky their vault position is relative to net short exposure to dai; a user who actually still owns majority of their debt can increase their collateral ratio faster and without bidding up dai on the open market.   So glad to see the above analysis coming foward @rema One question at the moment regarding the data and general vault analytics.   Is there a post or some kind of document regarding types of vault analytics you guys are working on?.   I had a whole bunch of ideas that came to me regarding this from my BlackThursday vault analysis many of which I still have not seen. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.007763975155279
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#5",
                    "likes": "2",
                    "time": "12/08/2021-07:06:28",
                    "content": "We don’t have a structured public document, but we prepared this feedback/ideas page - Discussions · blockanalitica/community · GitHub. Please share your ideas, or the things you would like us to look at here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ceresbzns",
                    "index": "#6",
                    "likes": "0",
                    "time": "19/08/2021-00:48:09",
                    "content": "Fantastic analysis! May I ask what tools you used to collect and analyze the data? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#7",
                    "likes": "0",
                    "time": "19/08/2021-02:27:29",
                    "content": "I think you can use Dune Analytics ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#8",
                    "likes": "2",
                    "time": "19/08/2021-11:18:48",
                    "content": "We used DeBank OpenAPI and MCDstate for the data, and the analysis was done in sheets. We are already collecting this data daily, and are working on a system which will automatically perform such analysis, without required manual work. The data and analysis will be available on Maker Risk Dashboard in the following weeks. ",
                    "links": [
                        "https://beta.mcdstate.info/",
                        "https://maker.blockanalitica.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "18/11/2021-17:18:58",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}