{
    "poll_list": [
        {
            "title": "Audit and Review Work for Phoenix Labs - February 20, 2023",
            "index": "19840",
            "option": "Yes",
            "supporting_mkr": "65,306",
            "highest_fraction": 0.77
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/pecu-seeking-governance-clarification-of-intent-re-phoenix-labs/19840",
            "title": "PECU Seeking Governance Clarification of Intent re: Phoenix Labs ",
            "index": 19840,
            "category": [
                "Governance"
            ],
            "tags": [
                "pe-001",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "7",
                    "time": "16/02/2023-06:43:04",
                    "content": " PECU Seeking Governance Clarification of Intent re: Phoenix Labs In advance of today’s G&R call where Phoenix Labs will be discussed, PECU is seeking a clarification of intent from Governance to determine whether PECU as a team should or should not participate in review and research of Aave v3 code changes as requested by Phoenix Labs and the Spark Lend initiative. The background here is that occasionally initiatives appear on the forum without having gone through a formal Governance vote, and as such, PECU is requesting clarification that MKR token holders and Delegates are actually in favour of this initiative and do wish to see us divert resources from other tasks to accomplish this work. The following is considered to be the immediate scope:  Review the Aave v3 fork and any differences (as part of a D3M integration) Review the new interest rate mechanics as part of Spark Lend Present a technical assessment of the integration partner (Spark Lend) Consider a resubmission to ChainSecurity pending any code changes Liaison with Phoenix Labs to create a Governance Executive when ready to launch  For transparency, Governance can also expect a portion of the following month’s audit resources to  be spent on this. By focusing on this work, PECU will be diverting resources away from its current Layer 2 review priorities, which will likely delay our deliverables for the duration of the above work, which according to the Phoenix Labs post is at least a month. This request for team resources is being posted in parallel with this request (for one engineer to be formally dedicated to Phoenix Labs). In our eyes a poll is sufficient confirmation for us to proceed with this work, however I will leave the governance formality to GovAlpha to confirm what they deem most suitable as an approval. ",
                    "links": [
                        "https://forum.makerdao.com/t/pecu-seeking-approval-to-transfer-engineering-resource-to-phoenix-labs/19841",
                        "https://forum.makerdao.com/t/pecu-seeking-approval-to-transfer-engineering-resource-to-phoenix-labs/19841",
                        "https://forum.makerdao.com/t/coldiron-eth-delegate-platform/11193/163",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/40",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/46",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/99",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/62",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/46",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/53",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/19"
                    ],
                    "GPT-summary": "PECU is seeking clarification from Governance on whether they should participate in the review and research of Aave v3 code changes as requested by Phoenix Labs and the Spark Lend initiative. They are requesting confirmation that MKR token holders and Delegates are in favor of this initiative and do wish to see them divert resources from other tasks to accomplish this work. PECU will be diverting resources away from its current Layer 2 review priorities, which will likely delay their deliverables for the duration of the above work.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.239267676767677
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#2",
                    "likes": "1",
                    "time": "16/02/2023-07:47:51",
                    "content": "Since SubDAOs are getting funding to boostrap, plus their own ogvernance token, branding/legitimacy, etc from Maker, the costs of this request should be charged back to this SubDAO in the future, cuz you don’t want to set a precedent where any creator/protector DAO starts asking PECU to do work for launching on-chain protocols. The whole point is to push complexity out, not put more on core teams. We are in a transition period, so exceptions are OK, just concerned on how to set the precedent correctly so once the transition is over, the new norm is not asking core teams to do work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.383116883116884
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/02/2023-12:15:57",
                    "content": "    Derek:  The following is considered to be the immediate scope:  Review the Aave v3 fork and any differences (as part of a D3M integration) Review the new interest rate mechanics as part of Spark Lend Present a technical assessment of the integration partner (Spark Lend) Consider a resubmission to ChainSecurity pending any code changes Liaison with Phoenix Labs to create a Governance Executive when ready to launch    Is there any chance you can put a dollar figure on this? Funding requests like budgets and SPFs are usually through the lens of DAI/dollar cost rather than opportunity cost, so it would be helpful to make an apples-to-apples comparison on what the dollar cost would be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.071969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#4",
                    "likes": "2",
                    "time": "16/02/2023-15:58:49",
                    "content": "Thanks for making this post - this is a major topic that will likely pop up continuously over the coming months and will need to be dealt with thoughtfully, as it concerns the general overhaul for improving the ROI of resource allocation in Maker. I will be covering this in full detail next week when I publish the Ecosystem Scope Framework draft and we hold the endgame calls to make the edits necessary to get the Ecosystem Scope Framework, Protocol Engineering Scope Framework, and other relevant MIPs into an april-ready state. The basic gist is that (exclusively during the pregame), all ecosystem actors and facilitators, in addition to their core duties of executing against the instructions provided in their responsible Scope Frameworks, must reasonably and thoughtfully based on their best judgement support in bootstrapping the potential value that will be available for SubDAOs to tap into at Endgame Launch, which includes adoptable products like Spark Protocol and SubDAO focused Ecosystem Actors like Phoenix Labs (assuming they are properly onboarded into the ecosystem scope framework as incubating ecosystem actors). The most important point to understand is that all the value that is generated for the SubDAOs is directly returned to the Maker Protocol and MKR holders, since the tokens are distributed through yield farming directly to MKR holders and to Dai holders that choose to farm SubDAO tokens rather than receive the Dai Savings Rate (making them positive value customers that generate a direct cash flow for the benefit of the Maker Protocol and MKR holders through Makers ability to deploy the capital they provide for yield). 50% of all SubDAO yield farming will go to MKR holders, and the other 50% of all SubDAO yield farming will go to Dai holders. So no external entities benefit or receive any of the value, and there’s no inherent efficiency loss or reduced return on any (properly made) investment into value creation that benefits SubDAOs during the pregame. This finally also means that supporting the incubation of SubDAOs when opportunities with a high ROI arise falls completely within the general definition of Core Unit responsibilities, since ultimately they are responsible for managing budgets in a way that generates more value for Maker than it costs the protocol. A critical part of the Endgame is that we can use the SubDAOs as a vehicle for capturing and monetizing a lot of the latent value that has been built up in the ecosystem surrounding the Maker Protocol over the years, and that they can benefit from a lot of synergy from both being small, agile and low cost teams, while accessing the economies of scale and latent value in Maker in a way where individuals inside the system can use their own best judgement to determine how value is best captured and created for Maker. This “synergize and work together under relatively flexible constraints” approach to bootstrapping the SubDAOs is exclusively something that’s realistic to do during the transition of the Pregame, while our processes and rulesets are still so primitive that we are much better off relying on the judgement of the individual Facilitators and Ecosystem Actors, and it will change after the launch of the Endgame, at which point the Scope Frameworks will be mature enough to have very rigid processes in place for unambiguous decision making related to resource allocation. Now finally, the most important thing is that, as I have hopefully managed to already communicate somewhat, is that the question of how to allocate resources - just as it always has been with Core Units and Facilitators - is ultimately up to the Facilitators based on their best judgement and understanding of the situation. In the context of Protocol Engineering and SubDAO focused Incubating Ecosystem Actors like Phoenix Labs, we will need to ensure there is clear language in the Ecosystem Scope that guarantees that the flexible and fast moving needs of Incubating Ecosystem Actors cannot block or supersede the core, immovable priorities of the maker Scopes, unless the ROI for doing so is overwhelmingly positive sum (as determined by the Facilitator). So e.g. we need to make clear in the Scopes that it is important that allocating resources to audits of Spark Protocol doesn’t significantly block or slow down critical protocol maintenance and operation, the launch of the UniV2 dss-kiln project, or other prioritized projects in the pipeline that are in line with the Protocol Engineering Scope Framework. But as long as that’s in place, then given that the community accepts and considers the Spark Protocol project valuable, the rules should be designed so that it makes sense for Protocol Engineering and other CUs in a position to do so to support with its incubation. Edit: One more important nuance to point, is that the mandate to reasonably assist in creating value for the Maker Protocol and MKR holders whenever a high-ROI opportunity presents itself should also apply the other way round, as @hexonaut also points out in the other thread related to PECU/Spark Protocol. We need to clearly specify in the Scope Framework that Incubating Ecosystem Actors are expected to use the resources allocated to them to assist in work that’s not related to their own project, if they find themselves in a position where they are uniquely well positioned to help or there is just a general critical need of resources due to an urgency or unforeseen circumstance etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.854460766198571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#5",
                    "likes": "0",
                    "time": "16/02/2023-16:41:45",
                    "content": "    rune:  The most important point to understand is that all the value that is generated for the SubDAOs is directly returned to the Maker Protocol and MKR holders, since the tokens are distributed through yield farming directly to MKR holders and to Dai holders   Can you confirm that 100% of SubDAO value will be returned to MKR participants? How are the SubDAO tokens initially allocated and how does the SubDAO continue it’s funding, maintenance, and growth in this scenario? This seems contradictory to the Spark Lend License at   github.com   GitHub - phoenixlabsresearch/sparklend at... - Plug and Play License d139aa0d9a95266130d5a3bbb59f878ecc099d96 Contribute to phoenixlabsresearch/sparklend development by creating an account on GitHub.      And also the technical details of the announcement describe that 10% of profits will be going to Aave.  Screenshot from 2023-02-16 12-05-36751×156 17.8 KB  ",
                    "links": [
                        "https://github.com/phoenixlabsresearch/sparklend/tree/d139aa0d9a95266130d5a3bbb59f878ecc099d96#plug-and-play-license",
                        "https://github.com/phoenixlabsresearch/sparklend/tree/d139aa0d9a95266130d5a3bbb59f878ecc099d96#plug-and-play-license"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#6",
                    "likes": "4",
                    "time": "16/02/2023-17:06:34",
                    "content": "    rune:  all ecosystem actors and facilitators, in addition to their core duties of executing against the instructions provided in their responsible Scope Frameworks, must reasonably and thoughtfully based on their best judgement support in bootstrapping the potential value that will be available for SubDAOs   Leaving aside the specifics of the Phoenix Labs proposals, Derek’s post appears to already be using his reasonable and thoughtfully based best judgement that the full cost of the proposal be transparent to MKR holders and their designated representatives. That should be encouraged. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/welsh",
                    "index": "#7",
                    "likes": "0",
                    "time": "16/02/2023-17:20:33",
                    "content": "I’m guessing that’s 10% of the 15% that Spark takes, not a great deal for AAVE considering they did the lion’s share of the work. IMHO Maker should not be paying a perpetual royalty on income generated from an AAVEV3 wrapper that only has legitimacy/utility because of its association with Maker and the cheap liquidity that Maker can provide. We should either pay a fixed upfront cost that can be voted up or down, or just have PECU implement it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 4.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#8",
                    "likes": "2",
                    "time": "16/02/2023-17:27:31",
                    "content": "Bear in mind that PECU has a full-time task of maintaining/monitoring/securing the Maker Protocol and adding the task of maintaining/monitoring/securing a custom fork of another large protocol is outside the boundaries of our mandate, capacity, and resources. In my technical opinion, it is not safe to stretch the PE team to this level of commitment, both in the opportunity cost of diverting our attention from core management and L2 expansion and in the cost of building a team that can safely manage an external protocol like Spark. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.386904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#9",
                    "likes": "3",
                    "time": "16/02/2023-17:59:04",
                    "content": "    brianmcmichael:  Can you confirm that 100% of SubDAO value will be returned to MKR participants? How are the SubDAO tokens initially allocated and how does the SubDAO continue it’s funding, maintenance, and growth in this scenario?   Yes, the only form of “genesis” distribution of the SubDAOs is to Dai and MKR holders, and permanent SubDAO token emissions continue to be yield farmed to Dai and MKR holders perpetually. There is also a treasury of SubDAO tokens available to pay Ecosystem Actors for additional work, and the set up is that the Incubating Ecosystem Actors will be hired with a part of their compensation getting paid through these SubDAO tokens. However,  this is not a founder allocation or similar, it is strictly payment for additional value producing work based on milestones and delivering actual value, so it is value creating and not a value outflow (in the same way that the Maker Protocol doesn’t lose value when it allocates budget to core units that produce useful work).  This seems contradictory to the Spark Lend License at  I agree that the way its currently written is not workable if you assume the plug and play rev share goes to Phoenix Labs, but I think the intention is that the SubDAO will adopt the ENS domain alongside the protocol itself, so the SubDAO will own the ability to set Plug and Play terms and be able to benefit from supporting other SubDAOs in adopting the same protocol.  And also the technical details of the announcement describe that 10% of profits will be going to Aave.  I think the way to view this is more of a value maximizing decision at the ecosystem actor and SubDAO level - IMO it is a very good strategy to ensure that there is a strong relationship and partnership with aave for future potential collaboration or adaption of open source code. Especially given that the rev share is time limited.  Leaving aside the specifics of the Phoenix Labs proposals, Derek’s post appears to already be using his reasonable and thoughtfully based best judgement that the full cost of the proposal be transparent to MKR holders and their designated representatives. That should be encouraged.  Yep, completely agree. The first step should be  to get as much transparency as possible into what is actually being done, what kind of value it creates, and how budgets line up with the outputs. The next step will be that the actual budgets are adjusted in line with how Maker Governance wants to allocate resources through the scopes. So auditing work on spark protocol done by the company behind PE should be paid for through a budget allocated to phoenix labs etc. But this is an ideal end state and it might take time to get budgets properly lined up for this.     brianmcmichael:  Bear in mind that PECU has a full-time task of maintaining/monitoring/securing the Maker Protocol and adding the task of maintaining/monitoring/securing a custom fork of another large protocol is outside the boundaries of our mandate, capacity, and resources. In my technical opinion, it is not safe to stretch the PE team to this level of commitment, both in the opportunity cost of diverting our attention from core management and L2 expansion and in the cost of building a team that can safely manage an external protocol like Spark.   The long term management and maintenance needs to come from phoenix labs or other subdao focused ecosystem actors - but for security audits etc. this is an obvious situation where there is significant value from having available resources from PE focus on the security, especially in relation to the DDM. However, it is definitely true that resources cannot be re-prioritized away from more important endgame priorities defined the scope frameworks in order to focus on SubDAO incubation work. In that case the better option is to use third party auditors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.916177721088436
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#10",
                    "likes": "2",
                    "time": "17/02/2023-16:34:26",
                    "content": "    rune:  I agree that the way its currently written is not workable if you assume the plug and play rev share goes to Phoenix Labs, but I think the intention is that the SubDAO will adopt the ENS domain alongside the protocol itself, so the SubDAO will own the ability to set Plug and Play terms and be able to benefit from supporting other SubDAOs in adopting the same protocol.   Yes to clarify all revenue share goes to Spark Protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.020833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#11",
                    "likes": "0",
                    "time": "18/02/2023-05:49:21",
                    "content": "Rune, You’re missing McMichael’s point…PE DOES NOT WANT the responsibility nor do they have the capacity to do their core work and watch over Spark. Quit trying to foist this on them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#12",
                    "likes": "2",
                    "time": "18/02/2023-16:54:38",
                    "content": "Phoenix Labs will be the maintainer of Spark Protocol. Maker needs to scale horizontally as part of the Endgame, and Spark Protocol is the first of many to help figure this process out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#13",
                    "likes": "1",
                    "time": "20/02/2023-15:16:06",
                    "content": "    hexonaut:  scale horizontally   Very much agreed here – the bigger the horizontal scale (and the more independent engineering teams building on top or adjacent to Maker core), the better. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 6.466666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#14",
                    "likes": "1",
                    "time": "20/02/2023-16:14:46",
                    "content": "    Tosh9.0:  the bigger the horizontal scale (and the more independent engineering teams building on top or adjacent to Maker core),   This is apt. Spark will likely require additional engineering resources. It is difficult to imagine a single engineer operating all smart contract development, security, devops, and a front end. Scaling full stack teams horizontally within MakerDAO is the promise of SubDAOs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.796428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#15",
                    "likes": "1",
                    "time": "20/02/2023-17:02:51",
                    "content": "    Tosh9.0:  PE DOES NOT WANT the responsibility   Maybe some PE CU members think differently but at least Derek as their facilitator is noting:     Derek:  PECU is requesting clarification that MKR token holders and Delegates are actually in favour of this initiative and do wish to see us divert resources from other tasks to accomplish this work.       Derek:  In our eyes a poll is sufficient confirmation for us to proceed with this work   So Derek wants the community’s feedback not outright saying “no, we can’t do it”. And if the community wants it, they will move toward such direction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.982142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#16",
                    "likes": "1",
                    "time": "20/02/2023-17:09:01",
                    "content": "    MadShills:  This is apt. Spark will likely require additional engineering resources. It is difficult to imagine a single engineer operating all smart contract development, security, devops, and a front end. Scaling full stack teams horizontally within MakerDAO is the promise of SubDAOs.   It’s possible that Spark might require additional resources and also additional funding (which happened numerous times for various CUs, SPFs, and etc) and that will be up to the governance. If they can’t deliver, then ideally they will be removed like many CUs before and future ecosystem actors, clusters, and etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.830357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#17",
                    "likes": "1",
                    "time": "20/02/2023-17:31:56",
                    "content": "    Doo_StableLab:  It’s possible that Spark might require additional resources and also additional funding   Agreed. Perhaps we may consider providing them ample resources upfront to reduce the risk of failure or sunk cost. I for one would like to see Spark wildly successful. To see it face challenges due to insufficient resource allocation upfront would be unfortunate. The team can only do so much if we don’t provide them with what they need. Let’s give them the best shot at success. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.726851851851852
                }
            ]
        }
    ],
    "group_index": "2196"
}