{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/how-to-get-back-dai-mistakenly-transferred/19349",
            "title": "How to get back DAI mistakenly transferred? ",
            "index": 19349,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Weimo",
                    "index": "#1",
                    "likes": "0",
                    "time": "08/01/2023-18:38:57",
                    "content": "I was going to transfer DAI from BSC to Ethereum network in the same wallet of mine (MetaMask). I didn’t really know how to do it correctly. I mistakenly pasted the DAI toke contract address as the receiving address so the DAI is disappeared. Please see details here: https://bscscan.com/tx/0xcfb146e8b7e0f77de28b0933273c5ae676d494d6f199c0fd020b9436757e59e6 Is there any way to get the DAI back to my wallet? What’s the correct way to do the above transfer? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/01/2023-21:12:51",
                    "content": "There is currently no way to get it back. There has recently been discussion of possibly changing that though. See     Implement the feature to refund people who lost money sending DAI to the DAI address Governance       implement the feature to refund people who lost money sending DAI to the DAI address  Many people, such as me, have lost money on dai, because it was transferred to the dai contract address by mistake, which means it was permanently destroyed  I think the money should be returned to the person who lost it         MIP94: Implement a Feature to Refund People who Lost Money Sending Dai to the Dai Contract Address RFC   MIP94: Implement a Feature to Refund People who Lost Money Sending Dai to the Dai Contract Address  Preamble MIP#: 94 Title: Implement a Feature to Refund People who Lost Money Sending Dai to the Dai Contract Address Author(s): @tradergalax Contributors: Tags: governance   Type: General  Status: RFC Date Proposed: 2022-12-20 Date Ratified: xx Dependencies: None Replaces: None Forum URL: https://forum.makerdao.com/t/mip94-implement-a-feature-to-refund-people-who-lost-money-sending-dai-to-the-dai…     ",
                    "links": [
                        "https://forum.makerdao.com/t/mip94-implement-a-feature-to-refund-people-who-lost-money-sending-dai-to-the-dai-contract-address/19227/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.392857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Weimo",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/01/2023-22:16:52",
                    "content": "Thanks for the info. Can I ask the owner of the token contract or whoever received the DAI to refund me from their wallet? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/01/2023-22:59:48",
                    "content": "No. That is not possible. Protocol changes would be needed to address this issue, as outlined in those threads. Your options are to wait for these changes to be made, or do what you can to support those changes happening. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#5",
                    "likes": "1",
                    "time": "09/01/2023-11:03:07",
                    "content": "@Weimo your transaction did not go to the contract address. It went to this address - 0x6B175474E89094C44Da98b954EedeAC495271d0F. Note this address is the DAI contract address on mainnet but it is nothing to do with Maker or DAI on BSC. If you want your tokens back, you will need to figure out the owner of that address and ask them to return them. @CodeKnight this instance is not equivalent to the others that you linked. Maker is not responsible for the deployment on BSC and has no control over the contracts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Weimo",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/01/2023-11:24:41",
                    "content": "Hi Patrick, Below snapshots show where I got this address. I imported this DAI from Metamask and believe it’s the official one. Would you please help me to find who is the owner? And what is your MakerDAO address?  image1170×2199 173 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Weimo",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/01/2023-11:32:48",
                    "content": "I checked on etherscan It shows the official website is makerDAO at the bottom:  image1170×2419 111 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#8",
                    "likes": "0",
                    "time": "09/01/2023-11:38:37",
                    "content": "The address is for the DAI contract on ETH mainnet. Your transaction occurred on BSC. These are not the same thing. It should not be assumed that a contract address on one is the same on the other. Maker does not control the BSC address.     Weimo:  I checked on etherscan   Irrelevant for a transaction on a different chain.     Weimo:  Would you please help me to find who is the owner?   I’ve no idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Weimo",
                    "index": "#9",
                    "likes": "0",
                    "time": "09/01/2023-12:01:35",
                    "content": "Can you at least tell me what is the correct way to do the transfer to prepare for the investment for makerdao? I connected from oasis to my metamask wallet and it has funds of BNB and DAI on BSC network however oasis said that it’s on a wrong network so I switched to ethereum main network and tried to transfer DAI from BSC to ethereum in my own wallet. That’s what happened. Moreover, after connected, Oasis end showed no place to fill out an amount to buy/earn DAI, or to borrow it. I don’t know what is wrong from my end. ??  image1170×2532 164 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.466666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#10",
                    "likes": "0",
                    "time": "09/01/2023-12:06:26",
                    "content": "I’m sorry this has happened, but there is nothing Maker can do to help you.     Weimo:  I switched to ethereum main network   You didn’t change networks, the transaction you linked took place on BSC. If the issue was due to an interaction with the Oasis frontend, you should ask Oasis directly. They are a third-party and not part of Maker. Their Discord is here: Oasis App ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.552083333333333
                }
            ]
        }
    ]
}