{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/research-paper-stablecoin-design-liquidity/8352",
            "title": "Research paper - Stablecoin design - Liquidity ",
            "index": 8352,
            "category": [
                "Resources",
                "Research"
            ],
            "tags": [
                "stablecoin",
                "research",
                "banking"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "10",
                    "time": "26/05/2021-20:38:50",
                    "content": "This is a research paper I worked on last month. With the RWA work, I don’t have much time to devote to those activities (sadly). I decided to publish it in a unfinished state as some parts are relevant to the discussion we are having currently regarding the PSM.  Crypto-banking 101 In my last paper, I’ve described the similarities between crypto-banking and regular banking. Stablecoin like USDC, DAI are just deposit. In turn, when you deposit DAI on Nexo, you no longer hold DAI but an on-demand IOU on DAI. Nexo will most likely not keep this DAI idle. The same is true when you deposit a one-dollar bill into your bank account. For banking to work you need to satisfy the rules of liquidity, the ability to exercise your IOU and solvency, the ability to stay creditworthy. In this paper, we will dig deeper into how crypto-bank should solve the liquidity constraint.  On liquidity When you own a crypto-bank liability (DAI for MakerDAO, aDAI for Aave, your DAI deposit on Nexo) you expect to be able to get your value back when needed (on-demand). This is why you think of your bank account as money. If you have deposited a $1 note into your bank account, you can get your $1 anytime (when the bank is open at least). The same applies to Nexo, you can deposit 1 DAI and get back 1 DAI anytime. This is getting more complicated for MakerDAO. You can’t deposit $1 to get 1 DAI and do the reverse. In the original design, someone needs to take a crypto-collateralized loan to be able to create those DAI. Just like when you get a consumer loan, your bank account gets filled with money. If you want to hold DAI but don’t want to take a loan you need someone else taking such a loan and selling you DAI. But you can face a demand and supply mismatch. The opposite exists as well. The Maker Protocol promises you $1 of assets at the shutdown nothing more. Therefore, you need to find a willing buyer of DAI.  image720×405 45.5 KB  This is why DAI was not good money last year. One type of money should be somewhat fungible with another type of money. When you transfer $100 from Citigroup to Bank Of America, $100 leaves and $100 arrive.  To become inside money, credit has to become as liquid as money. Inside money has to be convertible into outside money at par and at any time. The End of Banking Money, Credit, and the Digital Revolution — Jonathan McMillan   The need for a risk-free arbitrage Obviously, if you want to succeed as a stablecoin you need to be … stable, you need to feel like money. For that, you need to manage the market imbalance between the supply and demand of your stablecoin. The best way to solve this issue is to provide a risk-free arbitrage. The PSM is the solution that MakerDAO implemented to provide a risk-free arbitrage. You can sell USDC to the PSM and get DAI in exchange for a 0.1% exchange fee. As you can convert between USDC and $ at par at Circle, this means that you can convert from $ to DAI. This effectively caps the DAI price to around $1.001. The opposite works as well as you can get USDC that we store in the PSM for a fee of 0.04%. The price of DAI is at least $0.9996 as long as we have some USDC stored. The cool thing about risk-free arbitrage is that you don’t have to use the PSM to get a fair price. If the market price of DAI deviates on an exchange, someone will correct the price immediately to make a profit. While there is still a fee, the spread is becoming quite small and DAI really feels like money. As you can see in the chart below, the PSM is used in both ways (green for USDC inflows and red for USDC outflows) and we currently have up to 600M of USDC which would provide enough liquidity for anyone to convert DAI to $. The peg is now much better and this even bring some fees (right chart).  image1228×349 60.6 KB    dune.com    MakerDAO - PSM Dashboard Blockchain ecosystem analytics by and for the community. Explore and share data from Ethereum, xDai, Polygon, Optimism, BSC and Solana for free.      Other protocols have found other ways to solve the peg issue. FRAX which is an algorithmic stablecoin can be created using USDC and some FXS tokens (the governance token of FRAX). The sum should be $1 + 0.3% of fees. As FXS is a liquid token, anyone can create FRAX from USDC (or ETH as the UI propose) by adding some exchange costs. The price of FXS is not relevant by itself (but some slippage can add to the cost and it doesn’t work at the extreme).  image711×405 60.8 KB  The mint/redeem process of FRAX provide a risk-free arbitrage Frax provides the opposite as well. You can convert FRAX to get $0.86 USDC + $0.14 FXS for $1 of value (minus some fees). As you can convert FXS to USDC quite easily at a similar price, that gives you the full arbitrage. Internally, Frax holds some USDC and can mint as much FXS as need to make up to $1. So it’s a risk-free arbitrage as long as the FXS conversion slippage is small. The spread is a bit wider than MakerDAO as the fees are higher and your need to handle the FXS swap fees and slippage, but the principle is the same. For the last example, let see the epic failure of the FEI protocol. The idea was simple, you can always mint FEI with $1.01 worth of ETH. As the protocol owns a lot of ETH (let’s assume more than liabilities), he will reweight a Uniswap pool to correct the price if it falls too much below $1.  image1490×583 86.5 KB  Even with such careful attention on having a risk-free arbitrage in place, it was a mess. The reweight didn’t work as expected and FEI now trades around 0.8. The protocol has enough collateral to repay all the willing FEI holders and provide the risk-free arbitrage but [their governance decided](https://snapshot.org/#/fei.eth/proposal/QmWYNqr9Rcn8QFiZYyRqjQno3jXTToy3vM4bVKJkuntvoz) that it will not honor its debt. But it would have been possible to have a risk-free arbitrage with ETH as collateral. Converting ETH to  is quite simple as well as ETH is quite liquid. So a $ <-> FEI risk-free arbitrage would have been possible. As we have seen, you can find many ways to provide this risk-free arbitrage, but you need to keep something of value that is liquid. This can be called reserves or liquidity. Obviously, holding some idle USDC is not ideal to make a profit. Hopefully, it doesn’t have to be idle.  Liquidity doesn’t have to be idle cash A bank deposit is an on-demand liability. Obviously, even with quite a liquid market and stable assets, when you are selling something in a rush you might lose some money. But this is a solvency issue and no longer a liquidity one. In DeFi lending on Aave and Compound can be seen as a solution to earn a yield on the liquidity buffer. But even there, liquidity can dry up.  The Tether case Tether (USDT) has now disclosed its holdings. The only thing that is super liquid (intraday) is cash (most likely bank account and not physical cash) and Treasury Bills (short-term loans to the US government).  image2160×1328 232 KB  Tether holdings How risky is that? A good source can be ERNA and ultrashort term bonds ETF. You can see that the price is quite linear … except when it doesn’t (a 2% drop during Covid). The sharp recovery shows that the assets themselves were fine. But if you had to sell all of them during a bad period, you would have lost a few percent.  image822×454 19.7 KB  Therefore, Tether is quite sensitive to a systemic shock but you need a serious shock in the commercial paper market AND a USDT bank run to make it a reality.  How much liquidity buffer is needed? Banks had the issue of liquidity since the beginning. The more you hold reserves, the less you can make loans that generate profit. The less you have reserves, the more you risk a bank run and defaulting on the contractual liquidity. As described by Bagehot already in 1873:  the shareholders of the Bank of England will (…) always urge their directors to diminish (as far as possible) the unproductive reserve, and to augment as far as possible their own dividend. Bagehot, Walter. Lombard Street : a description of the money market  At this time, the Palmer rule was defined. A third of the on-demand liabilities should be kept as reserves (11% in actual cash):  In 1833 Horsley Palmer, the governor of the Bank of England, had adopted a rule: against all ‘liabilities to pay on demand’ (i.e. banknotes issued and deposits, which could be withdrawn without notice), the bank should keep a reserve of a third of the total value; two-thirds of this should be in securities such as government stock, and one-third in bullion (gold and silver). The Rise and Fall of the City of Money — Ray Perman  Looking at the free banking era in Sweden, it seems that the Palmer rule was used initially then the reserve/liquidity ratio was decreased over time.  image1350×809 84.9 KB  If we turn to modern US banks, we can see that the amount of cash on hand was decreasing until the banking crisis (with a bank run). This means that even with FDIC insurance and strong regulation, you still need to have significant reserves (around 15% currently).  It is therefore difficult to find what is the proper size of such a liquidity buffer. It obviously depends on the stability of your deposit accounts/stablecoins holders and the maturity of the rest of your assets. Nevertheless, if 5% cash is not enough for the real world, probably something between 10–20% is more appropriate for the crypto world where things are moving faster. ",
                    "links": [
                        "https://medium.com/@sebastien.derivaux/crypto-banking-101-ece9f1c2b031",
                        "https://www.coingecko.com/en/coins/susd",
                        "https://dune.com/SebVentures/psm",
                        "https://dune.com/SebVentures/psm",
                        "https://medium.com/fei-protocol/introducing-fei-protocol-2db79bd7a82b",
                        "https://www.theblockcrypto.com/post/104780/tether-usdt-reserves-breakdown-first-time-since-launch",
                        "https://www.ishares.com/uk/individual/en/products/297891/ishares-ultrashort-bond-ucits-etf-fund#/",
                        "https://en.wikipedia.org/wiki/Northern_Rock",
                        "https://forum.makerdao.com/t/maker-relay-ep-47-en-espanol/8547",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-47/8491",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-05/8483",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/33",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/6",
                        "https://forum.makerdao.com/t/mip39c2-sp27-adding-financial-strategy-core-unit/11938/8"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.581306073153899
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#2",
                    "likes": "1",
                    "time": "26/05/2021-20:48:58",
                    "content": "Liquity did well during the recent volatility. Why not use LUSD to diversify the PSM? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "3",
                    "time": "26/05/2021-20:57:39",
                    "content": "99% of LUSD is used for liquidity mining. Remains less than $10M. $1.2M of which are lost in an LQTY liquidity mining contract. Not exactly prime stablecoin material at this stage.  image910×146 7.19 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.270833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "1",
                    "time": "26/05/2021-21:59:51",
                    "content": "    ejbarraza:  Liquity did well during the recent volatility. Why not use LUSD to diversify the PSM   Liquity liquidated 1/3 of their customers, and their peg was down to 88c. The only real use for Liquity is to be very short ETH. They’re not a strong business and their coin doesn’t hold value when you need it to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.856481481481482
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "0",
                    "time": "26/05/2021-22:46:22",
                    "content": "Nice write-up and presentation. I do not get if you’re a proponent of hoarding more USDC via the PSM, or you’re implying that the “liquidity” of DAI is more important, therefore we are okay with such and we can sleep at night. My general feeling is that maybe the Community should consider backing DAI with a basket that would tilt away from the dollar to achieve an objective–which I don’t know if its to  break free of the dollar, or mimic a free-floating Currency that can trade almost near Par with USD. Looking at the dominance of the US Dollar, for now and into the foreseeable future—and given the lack of viable alternatives—the dollar is supreme/king. Although you might think differently when looking at the allocated reserves from Q1/19:  image645×544 32.3 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5249999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#6",
                    "likes": "2",
                    "time": "26/05/2021-23:59:02",
                    "content": "    flipflopflapdelegate:  consider backing DAI with a basket that would tilt away from the dollar to achieve an objective–which I don’t know if its to break free of the dollar, or mimic a free-floating Currency that can trade almost near Par with USD.   The objective is to have the best collateral base for any synthetic hard money. At some point we need to become Dai-agnostic and start launching more hard monies that either track existing currencies or try to be their own thing by tracking some complex CPI metric or something. I agree with ElPros sentiment here, it sucks to see so much of the collateral base just be alternative synthetic dollars. However, I think that their presence is an important anchor of the Dai peg (for the reasons Seb writes about above) and also that this doesn’t take away from the DAOs huge resolve and work towards onboarding all types of non-dollar-equivalent collateral types. I read this as a piece supporting PSMs since they provide a complete arb cycle for a strong peg, and as a dive into the risk behind stablecoins like USDC and USDT via their acceptance of riskier and riskier backing portfolios to grow their marketshare. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#7",
                    "likes": "1",
                    "time": "27/05/2021-08:42:11",
                    "content": "    flipflopflapdelegate:  I do not get if you’re a proponent of hoarding more USDC via the PSM, or you’re implying that the “liquidity” of DAI is more important, therefore we are okay with such and we can sleep at night.   The PSM is needed and I think we need a significant PSM going forward. This is needed for the risk-free arbitrage. But we need to diversify the risk. Let’s say 16% split between 4 stablecoins. And half of this exposure will be on Aave and Compound. So 4% USDC o/w 1% in aUSDC and 1% in cUSDC. 4 of GUSD o/w 1% in aGUSD, … Our max exposition to each stablecoin would be below 5% and the exposition to each money market protocol would be below 5%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.567708333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#8",
                    "likes": "0",
                    "time": "27/05/2021-14:53:34",
                    "content": "How did Alchemix and alUSD hold up during the recent volatility? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pensivepenguin",
                    "index": "#9",
                    "likes": "0",
                    "time": "27/05/2021-19:36:51",
                    "content": "Really? They were on the bankless podcast this morning and they said that LUSD only lost a few cents of value during the recent crash (I think they said down to 98 cents). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.844444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pensivepenguin",
                    "index": "#10",
                    "likes": "0",
                    "time": "27/05/2021-19:40:03",
                    "content": "And should the focus be on a basket of stablecoins which are decentralized or does that not matter? Right now DAI is so dependent on USDC which ofc is centralized. We shouldn’t reject centralized coins simply because they’re centralized but USDC is very much not trustless. And at the mercy of regulation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.909523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "0",
                    "time": "27/05/2021-19:40:29",
                    "content": "    pensivepenguin:  Really? They were on the bankless podcast this morning and they said that LUSD only lost a few cents of value during the recent crash (I think they said down to 98 cents).   On Coinbase’s feed alone they hit 88 cents the other day. I saw it happen in real time and still shows on the charts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.942460317460318
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pensivepenguin",
                    "index": "#12",
                    "likes": "0",
                    "time": "27/05/2021-19:45:04",
                    "content": "Something I always wonder about with stuff like the arbitrage you’re describing is the drag of fees. It is not hard to spot an arbitrage opportunity but in most cases you need a lot of capital if you’re actually going to make money off arb because fees are really high. So you’re depending on a relatively small number of whales to be the ones doing all the arb. I wonder how much of an impact this has. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.468452380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "25/08/2021-19:45:29",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}