{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/esg-focused-demand-deposits-at-goldman-sachs/11346",
            "title": "ESG focused Demand Deposits at Goldman Sachs ",
            "index": 11346,
            "category": [
                "Discontinued Categories",
                "Real World Finance"
            ],
            "tags": [
                "clean-money",
                "archive-rwf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#1",
                    "likes": "5",
                    "time": "01/11/2021-22:19:36",
                    "content": "  businesswire.com    Goldman Sachs, Xylem Launch First ESG-linked Demand Deposit Account Goldman Sachs, Xylem Launch First ESG-linked Demand Deposit Account      very interesting.  Goldman Sachs partnering with Xylem Inc., a water technology company. I am not sure how green these products are, but it does show a demand for ESG financing products.   I expect the more ‘green’ the product, the higher the demand…   currently there appear to be many greenwashded products as opposed to real ones. In 2019, Xylem — named for the water-transport mechanism in plants — signed an $800 million revolving credit facility that linked a floating interest rate to the company’s sustainability performance,  Goldman Sachs has launched its first demand deposit account related to environmental, social and governance (ESG) with water technology company Xylem as its first client, the companies announced in a press release Monday. The product, through Goldman Sachs’ transaction-banking (TxB) unit, connects the yield clients earn to the completion of ESG-related goals that clients set for themselves. Goldman in late 2019 committed to financing $750 billion in loans, underwriting, advisory services and investments for companies and projects focused on renewable energy, sustainable transportation, affordable education and other areas over 10 years. At the time, it was the largest pledge from any of the six biggest U.S. banks. Bank of America, Citi and JPMorgan Chase have since upped their pledges to $1 trillion or more.   Dive Insight: Goldman said during its 2020 Investor Day it had wanted to lean more heavily on transaction banking — the business of moving money around the world for large companies through such services as cash management and treasury. To that end, it launched transaction banking in the U.S. last June and, in the first year, attracted 250 clients and $35 billion in deposits. Goldman began offering transaction services in the U.K. in June of this year. The bank said in 2020 it was confident its consumer and transaction banking segments could yield $1 billion in annual revenue by 2025. In 2019, Xylem — named for the water-transport mechanism in plants — signed an $800 million revolving credit facility that linked a floating interest rate to the company’s sustainability performance, a first in the water technology industry, according to Smart Water magazine. The company completed a $1 billion green bond offering in senior unsecured notes a year later. The proceeds have been funneled into Xylem’s Green Finance Framework, and distributed into a number of eligible sustainability-focused projects, such as the manufacture of products that improve water quality, and research into water leakage detection systems that reduce waste. “This ESG-linked account is strongly aligned with our view that sustainability should be at the heart of both our business strategy and our financing approach,” Sandy Rowland, Xylem’s chief financial officer, said in Monday’s press release. “Banking products that recognize and reward ESG achievement are a welcome step forward in managing financing and sustainability interdependently. This account does that while delivering the flexibility we need to manage liquidity and payments.” Goldman Sachs CEO David Solomon, in announcing the bank’s 2019 ESG effort, said, “Companies have traditionally treated sustainability as a peripheral issue,” Solomon wrote. “We don’t have the luxury of that limited perspective any more.” The bank said in March it had committed $156 billion toward its $750 billion goal. The ESG-linked loan market has grown dozens of times over in the past year, according to data provider Dealogic. About $85.5 billion in ESG facilities were arranged in the first quarter of 2021, up 93.9% from the same time frame in 2020. ESG linking has gained steam elsewhere in finance this year. Investment firm BlackRock agreed to pay a higher or lower annual interest rate and commitment fee to a group of lenders on a $4.4 billion credit facility depending on its improvement on certain ESG benchmarks. In particular, the company aims to boost to 30% by 2024 the proportion of Black and Latinx people it employs. ",
                    "links": [
                        "https://www.businesswire.com/news/home/20210920005502/en/Goldman-Sachs-Xylem-Launch-First-ESG-linked-Demand-Deposit-Account",
                        "https://www.businesswire.com/news/home/20210920005502/en/Goldman-Sachs-Xylem-Launch-First-ESG-linked-Demand-Deposit-Account",
                        "https://www.bankingdive.com/news/goldman-sachs-environment-climate-policy-750b-goal-fossil-fuel-sustainable/569351/",
                        "https://www.bankingdive.com/news/bank-of-america-boosts-its-esg-financing-goal-to-1-trillion-by-2030/598203/",
                        "https://www.bankingdive.com/news/jpmorgan-citi-bank-of-america-environmental-social-governance/598537/",
                        "https://www.bankingdive.com/news/goldman-sachs-investors-day-david-solomon/571410/",
                        "https://www.ft.com/content/6de3b027-53c1-4fd8-b876-19696139954d",
                        "http://www.goldmansachs.com/media-relations/press-releases/2021/goldman-sachs-launches-transaction-banking-in-uk.html",
                        "https://www.bankingdive.com/news/goldman-sachs-expands-transaction-banking-services-to-uk/602216/",
                        "https://smartwatermagazine.com/news/xylem-inc/xylem-signs-revolving-credit-facility-couple-interest-rates-sustainability?amp",
                        "https://www.bankingdive.com/news/goldman-sachs-debuts-green-demand-deposit-account/606852/sustainability",
                        "https://www.bankingdive.com/news/blackrock-bets-its-interest-rate-on-esg-progress/597973/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6101190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/01/2022-22:20:27",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}