{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151",
            "title": "[BEAR] CU Facilitators: Transparent and Proactive Cash Management ",
            "index": 16151,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "sf-001",
                "bear-prep"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#1",
                    "likes": "12",
                    "time": "28/06/2022-14:17:06",
                    "content": "Hello @Core-Facilitators, @Recognized-Delegates Following our presentation on the latest G&R call, we dove deeper on earlier cash runway discussions and put together various scenarios to calculate Maker’s runway in the event of sustained operating losses. There is also a related Signal Request live right now that we would like to bring to your attention: [SIGNAL REQUEST] [BEAR] Building Financial Resilience & DAO Targets This is not a Signal Request, but an open voluntary invitation. There are good compelling business needs why some cash should and must remain on CU wallets (Oracle gas, PE continuity, one-time business-critical projects). All Core Unit Facilitators are kindly requested to:  Confirm the accuracy of actual expenses reported in the below on-chain snapshot Confirm on-chain snapshot of cash on hand and intent to return excess DAI to the DAO Provide an expense forecast through Q3 End (June, July, August, September) Return all excess cash over 3mos of monthly forecasted spend  More aggressive returns that could be possible due to underspend relative to budget will be greatly appreciated     image820×592 82.6 KB  Returning over 3mos of the budget is now part of the regular MIP40 process - this is more aggressive considering almost every CU has underspent their budget. We are kindly asking for CU proactivity in starting it early given market conditions. Doing so will not change much beyond enforcing shoring up loss-absorption ahead of Core Unit business continuity. Excluded from this snapshot are Oracle gas wallets and Foundation reserves, which bring the total balance to 15.8M. We would appreciate feedback on this by next Friday, July 8th. Thank you  On-chain process Calculation Example: Core Unit A’s forecast is 100,000 DAI per month for three months. If a Core Unit has 400,000 DAI on hand, they must return 100,000 DAI to the DAO. Core Unit Balance - (3 * Monthly Forecast) = Minimum Amount to Return 400,000 - (3 x 100,000) = 100,000 Transfers should be made to the DssBlow contract, simply send a standard ERC20 DAI transaction: 0x0048fc4357db3c0f45adea433a07a20769ddb0cf  Updates on feedback from various CUs below Editing as responses come in.  PE-001 SNE-001 IS-001 SES-001 SF-001 TECH-001 EVENTS-001 DAIF-001 DUX-001  Edit: updated table to show what our Dune query shows as CU DAI Balances   dune.com    Dune Blockchain ecosystem analytics by and for the community. Explore and share data from Ethereum, xDai, Polygon, Optimism, BSC and Solana for free.      Edit edit: For reference Events CU also not on the table because expenses are necessarily lumpy and will have to see ad-hoc. Edit^3: Updating list with responses by CU ",
                    "links": [
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/15",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/18",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/19",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/20",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/24",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/25",
                        "https://forum.makerdao.com/t/events-001-cu-update-month-1/16214",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/26",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/27",
                        "https://dune.com/queries/944529",
                        "https://dune.com/queries/944529",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-may-june-and-july-2022/17037",
                        "https://forum.makerdao.com/t/cu-budget-reduction-initiatives-wiki-summary/16448",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-june/16275"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.647980925324676
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/06/2022-14:25:08",
                    "content": "I think most core units use a two wallet multisig, auditor and ops. The setup for the auditor’s wallet allows for the DAO to pull those funds back at any time so that leaves the ops wallet. In this example, are you asking for a return of funds in the ops wallet in excess of the 3 months forecast? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#3",
                    "likes": "1",
                    "time": "28/06/2022-14:31:13",
                    "content": "We are looking at this in aggregate, without compromising business-critical expenses. Won’t be reasonable to just do a back and forth of funds within a few days imo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#4",
                    "likes": "4",
                    "time": "28/06/2022-15:59:25",
                    "content": "Hi @adcv, looking at the table it looks like the on-chain expenses table isn’t accounting for CUs that have returned funds via DssBlow. In GovAlpha’s case, we returned 150,050.83 DAI in June (transaction), but this has been lumped in as an on-chain expense. I get that technically it’s a wallet outflow but I was just wondering if there’s a better way of splitting out SB returns as otherwise, it looks like we’re spending all of our budget when we’ve actually been returning some to the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#5",
                    "likes": "2",
                    "time": "28/06/2022-16:25:03",
                    "content": "Thanks for this, useful feedback for how we are picking up transactions on Dune. Let me take a closer look. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "1",
                    "time": "29/06/2022-00:32:20",
                    "content": "    adcv:  Calculation Example: Core Unit A’s forecast is 100,000 DAI per month for three months. If a Core Unit has 400,000 DAI on hand, they must return 100,000 DAI to the DAO. Core Unit Balance - (3 * Monthly Forecast) = Minimum Amount to Return 400,000 - (3 x 100,000) = 100,000   I believe that we should allow the  @Core-Facilitators to decide what percentage/amount they believe they can return. Let them propose a percentage and then maybe they can even develop proposals for achieving more cuts (if necessary). I recommend this route since Facilitators know their Core Unit expenditures better than anybody. Looks like you’re proposing an automatic 25% shaving when you and I have no idea how much runway they might need over the next 3 months. And I get it, the priority is on Maker’s runway. But just this morning we had Fed Chair John Williams form the Federal Reserve Bank of New York say that there is currently a “slowdown” and there won’t be a recession. Hence, your guess, my guess is just as good as the prediction from the guy next door. Let the heart of the Core Units (Facilitators) decide the amount—let them put in the work—let them make any cuts where they will do the least damage to their ongoing operations. I believe that’s the best path forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.243801652892563
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#7",
                    "likes": "3",
                    "time": "29/06/2022-02:56:39",
                    "content": "One of the challenges I face as a facilitator is not understanding the complete the budgeting exercise. We’re being asked to forecast and return excess Dai. Fair enough. There is also a SR out to “drive budget cuts” with a \"“cold process-driven parameter.” Ok, what does that mean? How does that SR work in the context of this request? Is an update of a forecast (lower) a budget cut? Are we giving consideration for first doing this exercise and then determining “budget cuts?” As a facilitator, it’s tough to manage a team through all of this adjusting, reducing, cutting, and consolidating budget talk. Effectively, it puts people on notice. It’s human psychology. Please think about this during whatever plans we are putting together. We don’t have to be the top down corporation mandating draconian measures. While the protocol is software, the DAO is people. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.228098290598291
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#8",
                    "likes": "2",
                    "time": "29/06/2022-06:03:44",
                    "content": "    flipflopflapdelegate:  I believe that we should allow the @Core-Facilitators to decide what percentage/amount they believe they can return. Let them propose a percentage and then maybe they can even develop proposals for achieving more cuts (if necessary). I recommend this route since Facilitators know their Core Unit expenditures better than anybody. Looks like you’re proposing an automatic 25% shaving when you and I have no idea how much runway they might need over the next 3 months.   ElPro honestly this is very confusing. This post is doing exactly what you are describing. I am not proposing anything. This isn’t even a signal request. But Rune and others have repeatedly stated they want to ‘Claw back cash from the Core Units’ as a focus priority. So are we buttoning down the hatches and clawing back cash from the Core Units or not? Do we leave 15M Dai in Core Unit wallets or not? @rune could you kindly chime in and clarify whether we are ok with continued losses on a recurring income basis or not? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.001709401709402
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#9",
                    "likes": "0",
                    "time": "29/06/2022-07:01:11",
                    "content": "    monkey.irish:  How does that SR work in the context of this request? Is an update of a forecast (lower) a budget cut?   There are no budget cuts as those would require MIP40 processes mostly likely (governance to confirm) and that has not taken place. As actual run rates have been significantly lower than budgets this cash claw back asks essentially for the difference. What may be helpful for your planning is: forecast the next 3 months of actual (not budget) spend, compare that sum to the cash on hand in the CU wallet and return the excess. Should the SR pass and set a parameter of rNPI, it would effectively ask for a % of run rate to be further reduced. This does not affect the ask to claw back cash today. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#10",
                    "likes": "0",
                    "time": "29/06/2022-09:34:24",
                    "content": "    adcv:  15M Dai in Core Unit wallets or not   Hey, Adrian, do you happen to have a breakdown of the 15M? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "0",
                    "time": "29/06/2022-09:34:48",
                    "content": "    adcv:  ElPro honestly this is very confusing. This post is doing exactly what you are describing. I am not proposing anything. This isn’t even a signal request. But Rune and others have repeatedly stated they want to ‘Claw back cash from the Core Units’ as a focus priority.   Perhaps the wording reads as if SF is proposing a budget cut and I misunderstood . As Robert stated and ask above this could be viewed as an indistinguishable MIP40 request. Understood better now I will say, this claw back of cash won’t benefit the price of MKR. I believe the CU budgeting tooling that SES is currently working on will provide better clarity and should help SF provide better guidance. Perhaps we should wait for that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9799999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#12",
                    "likes": "0",
                    "time": "29/06/2022-09:40:07",
                    "content": "Gladly please find below (not a timeseries)    dune.com    Dune Blockchain ecosystem analytics by and for the community. Explore and share data from Ethereum, xDai, Polygon, Optimism, BSC and Solana for free.      EDIT: DMed you the csv ",
                    "links": [
                        "https://dune.com/queries/944529"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#13",
                    "likes": "1",
                    "time": "29/06/2022-09:45:06",
                    "content": "    flipflopflapdelegate:  I will say, this claw back of cash won’t benefit the price of MKR.   I agree with you fully, it’s literally just moving cash from one pocket to another. But Rune and others have expressed the desire to move excess non-operational cash from CU wallets to the surplus buffer.  image1812×1408 301 KB  Although we account for operating reserves as part of the surplus buffer in theory, it is true that in practice sheltering operational funds in CU wallets makes operating expenses senior to token holder funds as loss-absorption. So asking for a claw back is reasonable in this regard. This is unrelated to budgets, other than the fact the reason we have so much excess cash accumulated is that Core Units have mostly underspent relative to their budgets. Look forward to SES budget tool for help in this regard. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.703125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#14",
                    "likes": "3",
                    "time": "29/06/2022-12:41:18",
                    "content": "    flipflopflapdelegate:  Looks like you’re proposing an automatic 25% shaving when you and I have no idea how much runway they might need over the next 3 months.   To clarify - we aren’t proposing shaving anything and we’re asking Facilitators what they expect to spend in the next three months, then returning the amount above that figure. If there are cases where the Facilitator wants to keep excess funds, I believe that the reasons should be transparently shared with the community. Most core units already do a three month forecast, so this should be quite an easy exercise for them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9523809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#15",
                    "likes": "2",
                    "time": "29/06/2022-14:44:42",
                    "content": "Hey @adcv, thanks for pulling this together following the updated MIP40. The “Budget” table for PE-001 should show 510k for months through April 2022, and from May 2022 it is correct with the 632,500k as stated (with the new approved budget) The “Onchain” table, which I presume is meant to be the actual spend? If so, it’s a little off for PE-001, my records show:     Month DAI Total     January 2022 749,388.62 DAI   February 2022 518,142.54 DAI   March 2022 483,894.77 DAI   April 2022 514,625.87 DAI   May 2022 505,905.27 DAI   June 2022 TBD    “Current Dai Balance” was correct as of two days ago, however as per our budget MIP 400k DAI was moved to our emergency multisig, leaving only 214k in the team multisig. (this will of course change as we pull/pay the June expenses). With regards to the Contingency Multisig, your Dune analytics are only reflecting DAI, but in our case we have diversified stablecoin holdings (DAI, USDC and PAXG) so should be reflected accordingly. Happy to jump on a call if any of that is unclear. No budget returns to be completed at this point in time but we’ll definitely track & justify any excesses as described above. Thanks! ",
                    "links": [
                        "https://etherscan.io/address/0x83e36aAA1c7b99E2D3d07789F7b70FCe46f0d45E"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.461101398601399
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#16",
                    "likes": "1",
                    "time": "29/06/2022-14:55:47",
                    "content": "Very helpful Derek thanks a lot, also really helpful regarding the feedback on the query for the currencies you use - we are indeed only tracking Dai. Current balance was indeed pulled on the 26th I believe. Will shout in case of any questions ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#17",
                    "likes": "4",
                    "time": "29/06/2022-16:11:06",
                    "content": "The reason why I think it’s important to claw back the excess funds is because it’s an important long term best practice. Enforcing such best practice means we can get back on track of building a culture of collaborating on a trust-minimizing system. Once money has been sent off to core units, there is no reason we should expect to get it back if a dispute occurs, or a market downturn, or an organically emergent internal group gets an idea for something to spend it on etc. We can trust the core units today to not do this, but we are falling into the trap of relying on the integrity of the team today to fill the gaps we leave in the workforce design. There could be plenty of legitimate reason to leave teams with buffers, but they need to be formally defined and agreed on by the community (and afaik they already are, just in a way that caused this unintended buildup). They shouldn’t randomly accumulate when that wasn’t the intention or expectation, and when we discover that something like has happened we need to take action to fix our mistake. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.979166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#18",
                    "likes": "2",
                    "time": "01/07/2022-11:52:48",
                    "content": "Regarding the Starknet CU, we have DAI 368k in our multisig, including DAI 180k already provisioned for audits, and DAI 40k of unpaid salaries. So we have a remaining budget, mostly for salaries and conferences, of DAI 128k. Our burn is pretty consistent, around DAI 40k per month, with some spikes when we have audits. We originally had a burn prediction of DAI 65k per month but did not hire as much as planned because we did not need to given the context (delay on the fast withdrawals and the teleportation, delay on Starknet features). We originally planned to ask for a budget extension in July, but given the savings, we swill be able to sustain the core unit on the current budget until end of September or October (depending on exact audit cost). We will be requesting a budget extension in September which should sustain us until teleport is fully delivered. Depending on the final audit cost, our excess budget (over three months) might vary between DAI 0 and DAI 40k. Happy to answer any questions you might have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#19",
                    "likes": "1",
                    "time": "02/07/2022-05:19:21",
                    "content": "    adcv:   Confirm the accuracy of actual expenses reported in the below on-chain snapshot    Excluding the bug bounty payouts, it looks reasonably close. Currently our minimum monthly burn is 12k for staff and 10k for Immunefi professional services. We are spending close to the minimum, but there is some variability in on-chain payments because wallets were not set up for months and months.     adcv:   Confirm on-chain snapshot of cash on hand and intent to return excess DAI to the DAO    Cash on hand is controlled by the SES auditor wallet and should never be more than the total 3 month forecast.     adcv:   Provide an expense forecast through Q3 End (June, July, August, September)    There will be some cost to complete the initial operational audits and pay bug bounties. We are planning to lower our minimum spend from 22k to 12k per month.     adcv:   Return all excess cash over 3mos of monthly forecasted spend    Will be taken care of by SES auditor. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#20",
                    "likes": "9",
                    "time": "02/07/2022-11:40:47",
                    "content": "For those that are unfamiliar, here is an overview of the SES model with the built-in mechanism for returning excess funds:  20220702-budget-flow2782×1732 103 KB   Monthly Cycle The model follows a monthly cycle:   Core Unit submits their monthly budget statement with actuals and forecast for the next 3 months of their expenses to the Auditor. The 3-month forecast is based on expected invoices, so it can be significantly lower than the budget cap. For example: SES almost never expects to use the full incubation program budget because it rarely runs at full capacity.   Auditor reviews the budget statement, and once it is approved, the reconciliation happens: a) DssVest funds are pulled from the protocol. b) The Core Unit’s operational wallet(s) is/are topped up to the level of the 3-month forecast. If there is an excess amount in the operational wallets already (more than the 3-month forecast), these funds are returned to the Auditor wallet. This can happen if big expected costs are cancelled. c) Once the top-up is completed, any excess funds in the Auditor Wallet that exceed 2 months of budget cap are returned to the protocol via DssBlow.    Cash Buffers and Claw-back Abilities If this process is applied strictly, this results in the following buffers (ignoring only administrative delays in forecast updates):  Less than one month budget cap buffer in the DssVest contract. Less than two months budget cap buffer in the Auditor wallet. Less than 3 months forecast buffer in the Operational wallet.  In terms of claw-back capabilities:   The protocol is the beneficiary of the Auditor wallet which allows it to claw back these funds following a governance vote.   The protocol is sometimes the beneficiary of the Operational wallets in which case it can claw back these funds too. This depends on what the core unit proposed in their MIP40.   This setup seems reasonable from a number of perspectives:   It gives the core units enough runway so that (1) they can be confident they will be able to meet their obligations towards contributors and external service providers and (2) business continuity can be guaranteed, including in the event of a Maker governance deadlock.   It has accountability built in via the transparency reporting requirement that the operational top-ups depend on.   It gives the protocol the ability to claw back funds and relinquishes control over less than 3 months budget cap (how much less depends on the variability of the expenses, i.e. the difference between forecast and budget cap).   The DssVest stream limits the total spending rate to the budget cap as a hard guarantee.   Note that, in order to initiate this setup at the beginning, MIP40s have typically included a one-time seed transaction to fill the buffers that are mentioned in the process before the DssVest stream kicks in.  Participating Core Units Core Units that are following this setup are SES (auditor is GovAlpha), DUX, SAS, IS, TECH, and RWF. Changes in the buffer parameters (runway lengths) would require a MIP40 update of these Core Units. DECO follows a similar flow, but the funding model is quite different and does not depend on actual expenses. Instead there is a fixed maintenance fee and a profit sharing clause that kicks in once the maintenance fees have been repaid to the protocol. Budget statements:   SES – auditor: GovAlpha  DUX – auditor: SES  SAS – auditor: SES  IS – auditor: SES  TECH – auditor: SES  RWF – auditor: SES  DECO – auditor: SES  Currently we’re using GitHub to publish these. This will soon be made more accessible as we are working to make them available via the Performance Dashboard (included in the first release.)  Note on the Auditor role The auditor’s responsibilities have been restricted to objective, formal transparency reporting checks by design. What this means, is that the auditor makes sure that the core units are reporting their expenses regularly, and that they check the numbers add up before their operational runway is replenished. Additional clarification is requested from the core units when the expenses exceed the budget categories’ caps (for example due to cashflow delays or pre-payments, unforeseen costs, etc.) The auditor does not make any judgement calls on whether or not the funds are spent responsibly or wisely. For example, the auditor is not involved in negotiating fees with contributors, much less in judging whether the fees are reasonable and fair. Similarly, the auditor cannot prevent outright fraud if a core unit decides to lie in their transparency reports.  Action Items Action items relevant this forum thread:   In the past, DssVest pulls haven’t always been executed when it was possible to avoid, often to save gas costs. Excess funds have typically been left sitting in the DssVest stream rather than returned through DssBlow. I have asked our auditors to strictly apply the process going forward so that the maximum amount of funds are returned to the protocol (but also pulled).   We’ll be working with SF to make it easier to have live access to the data and connect it to the on-chain transactions that are taking place.   We’re working with the core units (1) to improve the timeliness of the reporting and (2) to ensure that forecasts aren’t overly conservative in covering unlikely future expenses.   We are continuing the work on our budget tooling and DAO performance dashboard to remove the manual overhead from the process and make on-chain verification of the numbers trivial.   ",
                    "links": [
                        "https://github.com/makerdao-dux/transparency-reporting",
                        "https://github.com/makerdao-sas/transparency-reporting",
                        "https://github.com/makerdao-is/transparency-reporting",
                        "https://github.com/MakerOps/tech-001-transparency-reporting",
                        "https://github.com/makerdao-rwf001/transparency-reporting/tree/main/monthly-budget-statements",
                        "https://github.com/deco-protocol/maker-cu-transparency-reporting",
                        "https://forum.makerdao.com/t/introducing-a-budget-reporting-tool-for-core-units/15710"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.408307210031348
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#21",
                    "likes": "1",
                    "time": "02/07/2022-13:43:36",
                    "content": "    wouter:  In the past, DssVest pulls haven’t always been executed when it was possible to avoid, often to save gas costs. Excess funds have typically been left sitting in the DssVest stream rather than returned through DssBlow. I have asked our auditors to strictly apply the process going forward so that the maximum amount of funds are returned to the protocol (but also pulled).   Thank you wouter ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.479166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Monsanto",
                    "index": "#22",
                    "likes": "0",
                    "time": "03/07/2022-06:58:08",
                    "content": "Do the Budgets include Contingency? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#23",
                    "likes": "1",
                    "time": "03/07/2022-10:30:33",
                    "content": "Yes, but there’s no hard rule. Most core units have not come close to touching their contingency buffers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.909722222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#24",
                    "likes": "1",
                    "time": "03/07/2022-18:29:42",
                    "content": "Please see below for responses:  Confirming on-chain expenses are accurate On-chain balance was accurate as of the reported date but now sits at $24.6K after running June expenses. SF carries minimal cash on hand, at less than 1/3 of our monthly budget so do not intend to return cash to the DAO currently. Please see below for our forecast, through year end 2022. Summer budget variance is driven by hiring two interns for the summer from HBS (MBA) and Penn (undergrad), and a grant for an independent review from a Certified Treasury Professional of our ALM framework.  image1002×109 19.3 KB   As SF will not have greater than three months of cash on hand three months from now, SF does not currently intend to return cash to the DAO.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.62962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/simonkp",
                    "index": "#25",
                    "likes": "1",
                    "time": "04/07/2022-06:23:46",
                    "content": "Thank you Wouter. Confirm this is TechOps CU (TECH) current budgeting setup which has been working exceptionally well. Except maybe for the error prone conversion of the report numbers into Markdown that are then uploaded to Github for viewing. Which is why we are excited to have started testing the Budget Tool that exports Markdown for us and looking forward to view these on the performance dashboard. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.736111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#26",
                    "likes": "3",
                    "time": "07/07/2022-06:29:37",
                    "content": "The DAIF Core Unit is populating the SF budget template with budget and actuals for our full budget period, and expect to start reporting into the SES Budget Tool once we have closed the books for June. TL;DR with an un-budgeted expense over the next month we do expect to use all our vested funds. Details: We were running below budget in the beginning (2021) due to some of our service still being provided by Maker Foundation, and the board not being at the budgeted 7 members. OTOH we are now experiencing higher than budgeted expenses. This is due to:  We budgeted Techops costs before the Techops CU was created, and the costs have been slightly higher (Much tools and process work have been completed this year, and the outstanding work will be spread out so we have agreed with TechOps to reduce this post notably in the new budget) Trademark legal expenses have been higher than budgeted We did not budget to pay VAT on any services. While a company can deduct VAT from their expenses this is not the case for a non-profit organization, so we have to pay VAT for our EU based service provider expenses The budgeted time for facilitator work was minimal and it has been necessary to use more time on facilitator work Finally and importantly, we have a significant un-budgeted one-off expense: For the reserves our assumption was that we could add these to the foundation base capital and then if needed move them to be operational capital. It has unfortunately turned out that the authorities do not allow this, so if we added the reserves to the base capital they can not be used for “operational” expenses and thus not serve their purpose as stated in the budget “to have a “war chest” to cover extraordinary expenses or temporary issues with funding of day-to-day operations.”. To keep the reserves available indeed as reserves that are ready for a critical situation, we have to pay an estimated un-budgeted amount of $185k DAI in taxes. We have certainly taken this learning into account and have made sure to adjust our new budget such that we won’t be hit with any tax on the reserves buildup for this next period.  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-spxx-modify-dai-foundation-core-unit-budget-daif-001/16379/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.507313922636503
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#27",
                    "likes": "3",
                    "time": "07/07/2022-09:27:52",
                    "content": "Reporting in on behalf of the DUX Core Unit  Year-to-date monthly spend over 2022 According to our monthly budget statements, there are a few corrections to be made to the on-chain spend overview provided by SF CU:   January & February 2022: The report states incorrect numbers, however the aggregated amount is accurate (being: 182,660 DAI). The actual spend for January is 86,500 DAI (as opposed to 47,000 DAI, and for February the actual spend is 96,160 DAI (as opposed to 135,660 DAI).  April 2022: The report states a 110k DAI spend as opposed to the actual spend of 105k. The 5k difference can be explained by a 5k DAI sponsorship coming from the Growth CU, but pre-funded by DUX team. The 5k DAI was sent to the DUX wallet soon thereafter.  June 2022: 1801 DAI difference which can be explained through a purchase of 1 ETH on June 7th, of which 0.3 ETH is sent to one of DUX team’s CU members to fund his signer wallet (ie. the wallet used to execute all DUX CU multisig transactions)  Also, the report states a current DAI balance of 285,081 DAI, whereas the actual DAI balance of our operational wallet at time of writing is 204,599 DAI. Our monthly budget statements are accessible by anyone, are audited by SES, and can be verified together with our team’s multisig (ie. ‘operational wallet’). Compliance with SES model As the first incubee of SES we fully comply with the SES model for budget management, with SES being our assigned auditor. They perform checks on our monthly financial reports and control the auditor wallet which sits in between the Maker Protocol and our team’s multisig wallet. Based on the model’s prescription we will never have more than 3 months of budgeted runway in our operational wallet (ie. the wallet that is within control of the DUX CU members). Refer to Wouter’s elaborate reply for more information about the checks & balances built into the model. Lastly, we’re currently being onboarded as one of the first CUs to start using the SES transparency dashboard. The dashboard will aggregate CU information, including monthly financial reports and roadmap updates. Q3 forecast and buffer Over the third quarter of this year I expect our CU’s monthly spend to average out at 115k DAI/mo, taking into account the payment of an annual contract (RPC endpoint provider), the preparation of our 2nd (and last) team offsite, and some one-off legal fees. Right now we have less than 2 months of runway sitting in our operational wallet, and therefore we won’t be returning any funds as part of this initiative by SF CU. As we do not have control over the DssVest buffer and/or our Auditor Wallet, we refer to @wouter’s commitment regarding these funds (as quoted below).     wouter:   In the past, DssVest pulls haven’t always been executed when it was possible to avoid, often to save gas costs. Excess funds have typically been left sitting in the DssVest stream rather than returned through DssBlow. I have asked our auditors to strictly apply the process going forward so that the maximum amount of funds are returned to the protocol (but also pulled).    (edit: added correction to DAI balance) ",
                    "links": [
                        "https://etherscan.io/tx/0x20bd1e953f72fca0af29b80f406ed197a431584e494804177076e781f05a7562",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/20",
                        "https://forum.makerdao.com/t/dux-monthly-update-june-2022/16324/3",
                        "https://forum.makerdao.com/t/dux-roadmap-spotlight-q3-2022/16372/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.43099647266314
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#28",
                    "likes": "2",
                    "time": "07/07/2022-10:54:36",
                    "content": "    0xdeniz:    January & February 2022: The report states incorrect numbers, however the aggregated amount is accurate (being: 182,660 DAI). The actual spend for January is 86,500 DAI (as opposed to 47,000 DAI, and for February the actual spend is 96,160 DAI (as opposed to 135,660 DAI).  April 2022: The report states a 110k DAI spend as opposed to the actual spend of 105k. The 5k difference can be explained by a 5k DAI sponsorship coming from the Growth CU, but pre-funded by DUX team. The 5k DAI was sent to the DUX wallet soon thereafter.  June 2022: 1801 DAI difference which can be explained through a purchase of 1 ETH on June 7th, of which 0.3 ETH is sent to one of DUX team’s CU members to fund his signer wallet (ie. the wallet used to execute all DUX CU multisig transactions)    For context: these differences are the difference between cashflow and budget expenses (shifting some numbers between months.) I don’t believe they’re super relevant for this thread if they span only one month. In general, most of our reporting is currently reflecting cashflow. For example: security deposits that will be returned on a later date are reported as expenses. It’s a potential area of improvement on our reporting that we can have a look at in the future. It definitely tends to muddy the reporting. But for now, we’re still streamlining the basics. This will improve the timeliness of the financial reporting, which in turn will reduce the differences between cashflow reporting and expenses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.561111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#29",
                    "likes": "3",
                    "time": "07/07/2022-11:20:52",
                    "content": "Indeed, believe this phasing difference is due to the difference between cash movements visible on-chain and reported expenses which may come closer to an accrual basis. Still useful nonetheless to double check our queries, thank you @0xdeniz and @wouter. I’m starting to come around to the view that blockchain accounting might always be expressed on a cash or at best a near-cash basis. Being able to record something as simple as a non-cash depreciation expense requires an incredible amount of assumptions around trust, contracts and enforceability. For an on-chain protocol, it is always more conservative to assume that once a value has changed it has changed for good, until reversed. SES’ wallet setup helps in this regard, as would some form of automatic enforcement of cash returns to the surplus buffer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.887499999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#30",
                    "likes": "2",
                    "time": "07/07/2022-11:55:06",
                    "content": "    adcv:  Being able to record something as simple as a non-cash depreciation expense requires an incredible amount of assumptions around trust, contracts and enforceability. For an on-chain protocol, it is always more conservative to assume that once a value has changed it has changed for good, until reversed.   Agreed. A more effective improvement might be to better identify all cash buffers and make this information easily discoverable and accessible to stakeholders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.504166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#31",
                    "likes": "0",
                    "time": "05/10/2022-11:55:55",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}