{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/speaker-series-2-duke-university-fuqua-business-school-professor-campbell-harvey-july-13-3-00-pm-utc-11-00-am-edt/9035",
            "title": "[Speaker Series] #2 -- Duke University Fuqua Business School Professor Campbell Harvey; July 13 3:00 PM UTC/11:00 AM EDT ",
            "index": 9035,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "guest-speaker",
                "pubcall-:-speaker-series"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "5",
                    "time": "29/06/2021-16:13:26",
                    "content": " Link to the event.   Submit a question for Dr. Harvey anonymously.   image1193×718 1.09 MB  I am pleased to announce our second guest, Professor Campbell Harvey of Duke University, on July 13th, 3:00 PM UTC/11:00 AM EDT. We will discuss Prof. Harvey’s forthcoming book, DeFi and the Future of Finance (which can be pre-ordered on Amazon here), permissionless banking and lending, and the crypto ecosystem. Feel free to submit questions either in this thread or in the anonymous question box. Questions may also be submitted live for those who attend the event synchronously. Coming up in one week! ",
                    "links": [
                        "https://app.suggestionox.com/r/VPqPdb",
                        "https://en.wikipedia.org/wiki/Campbell_Harvey",
                        "https://www.amazon.com/DeFi-Future-Finance-Campbell-Harvey/dp/1119836018",
                        "https://app.suggestionox.com/r/VPqPdb",
                        "https://forum.makerdao.com/t/maker-relay-ep-54-en-espanol/9476",
                        "https://forum.makerdao.com/t/maker-relay-ep-54/9437",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/speaker-series-1-st-louis-federal-reserve-senior-vp-june-29-3-00-pm-utc-11-00-am-et/8080/16",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892045454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "2",
                    "time": "30/06/2021-02:47:20",
                    "content": " Episode 2: July 13th, 2021: Duke University Fuqua Business School Professor, Campbell Harvey  Agenda   00:00: Introduction  00:41: Questions and Answers   Introduction  Chris Cameron 00:00 Campbell Harvey Biography  Good morning, and welcome to the MakerDAO series. My name is Chris Cameron, and I will be hosting this meeting and asking Professor Campbell Harvey a set of questions. Campbell Harvey is a professor at Duke University. He is here to talk about his forthcoming book called DeFi and the Future of Finance.   Questions and Answers  Campbell Harvey  Q: I have read the paper several times discussing what this book is based upon. It reads to me almost like it is about decentralized finance. It also includes a bit of an extended meditation on the history of finance and money in particular. Those who have not read the paper can give us a quick overview of what you are laying out? 00:41  Yes, it begins with a historical perspective. The first markets were really inefficient because they were based on barter where you actually had to match people; if I want a cow, I can offer two goats, but I need to find somebody who wants them. That makes the cow very difficult to transact. However, barters are a P2P system. This P2P inefficiency was broken where people actually could accept some sort of token to create a type of money. Originally coinage was actually worth something, and then we eventually progressed into Fiat. The US went up the gold standard in 1971, and most other countries followed. Gold is a currency that is not backed by anything valuable other than three things; one is legal tender, which is important if you need to accept dollars. The second is the government’s ability to tax. The third is the government’s ability to incarcerate you if you do not pay your taxes. There is a back key and what we have recently come through is another transformation where we actually have a decentralized token. Bitcoin was the genesis of this transformation, which is not controlled by anybody. We are headed with tokenization through a full circle, which is how I start my book. What I mean by that is if you can imagine in the future where everything is tokenized. We can interact on a P2P basis with efficient barter. When I was studying Economics at the University of Chicago, I never thought that there was any possibility of returning to a barding system. Still, this new technology allows us to do that in a very efficient manner.  Chris Cameron: Yeah, I have visions of UniSwap and SushiSwap in my head when you mention efficient barters.     Q: Does that mean that DeFi is the future or that centralized finance was a middle stage before we come all the way back to the beginning of this circle? 02:40  Centralized finance played a very important role historically speaking. It made markets more efficient by offering fair prices, which are good in terms of social welfare. If prices are not fair, somebody is being ripped off, which is not good for the economy. Centralized finance played a very important role. It is interesting to me that there is not that much difference between the centralized finance of today compared to 150 years ago. Indeed, I have an example in my book where I exhibit a photo of one of the first Western Union wire transfers from 1873 for 300$.  Chris Campbell: What rate were they charging? Out of curiosity.   That’s exactly where I am going. The fee per sending that wire transfer is 9$ or 3%. That means nothing has changed for the last 150 years. I swipe a credit card, and it is a 3% fee. I transfer dollars to euros to send to Europe, and the rate I get is almost exactly 3% off of the market rate; it’s extraordinary that we are stuck. We have the inefficiency of our banking systems, such as zero percent interest rates where the borrowing rates are too high. You are paying for all of the brick-and-mortar and third parties within the system. This is insecure. In addition, the costs are high, and there is a lot of time delay. Now, this was great 50 years ago, but today it doesn’t make any sense. People do not realize that when they buy something like a stock, the official ownership transfer takes two days, but you believe it happens automatically. If you are using a broker, you actually give the broker the rights to that stock ownership for two days. Essentially, what is happening is there is another methodology happening, which is called FinTech. It is addressing some of these inefficiencies within the current centralized finance system. As one of the speakers in my course remark, and I agree with this, the current wave of FinTech like Plaid, Strike, and things like that refer to as putting lipstick on a pig. That means that you are building many FinTech products based upon centralized architecture, which is inherently inefficient. I believe that this current wave of FinTech, while useful in that it reduces fees and it makes things a lot fairer. Still, it’s ultimately a fleeting stage of finance. If you really want to look to the future, you need to look to DeFi.   Q: We spoke about decentralized vs. centralized finance quite a bit. What do you consider is the dividing line between centralized and decentralized? We talked about decentralized operations, decentralized control, and etc. 08:23  There is no clear answer to this but let me just state my opinion. Exchanges such as Binance and Coinbase are simply centralized brokers where you need to trust them with your keys. They largely deal with DeFi, but they are centralized. Changpeng Zhao of Binance likes to refer to this as CeDeFI (Centralized-Decentralized Finance), and those institutions are playing a very important role. When I began teaching my blockchain course in 2014, Coinbase was just a startup. I once had a problem with my account, and I was on the phone with the CTO. They made it easier for people to get into space. One very large barrier is that it has not been easy for the average person to get in, but now it is much easier. However, we are still not completely there. These centralized components have been important and have played an important role and even within the actual token space. You have got centralized tokens such as USDC and USDT. The collateral supposedly for tether is there, but for USDC, it is definitely there. However, DAI is decentralized. It’s a little weird where if you have collateral for DAI, which is based on USDC, it becomes a little more difficult to think through, but there is a mixture. I think it is clear you know, for example, that MakerDAO is decentralized, whereas USDC or USDT is not.   Q: As centralized elements like exchanges or directly Fiat backed redeemable stable coins like Tether in USDC intermingle more with decentralized aspects like MakerDAO, Uniswap, or other protocols, does that mean that at some point there will be finance again? Will the centralized and decentralized aspects ever separate, and if not, which one becomes more dominant? 11:26  You are asking me for my vision of the future.  Chris Campbell: yeah, you have a crystal ball, right?   Obviously, I can not tell what is going to happen. I do think that we will have centralized currencies for a long time. So I know that the central banks are working on their digital currency. It is a very hard problem for them to figure out through so many different models. They will be competitors for some of the cryptos. Some countries will try to regulate, but I think that the central banks are late to the game, and indeed, they are so late that it might be too late. It is now basically outside of their control. What do you need for DeFi? You need a mobile phone and potentially a VPN if there is a regulatory issue. Venezuela is a great example of a failed state in terms of monetary and fiscal policy where their well-off people are opening a bank account in Miami. They have a 400% inflation, but it’s no big deal because they have their money in USD in some bank within the US. Whereas the average person there is just getting walloped. However, now the average person has a mobile phone, and if they have some token on their phone in US dollars, it is much more protected. I do think that Fiat will be around for quite a while. Still, at some point in the future, everything will be tokenized and used to pay for or to buy whatever you, such as tokenized equity or service that just populates in your wallet. Suppose a person does not want what you are offering. In that case, a program goes out and looks up various different market makers to figure out the best conversion that happens automatically and seamlessly. In the future, I think that there will be much less emphasis where people talk about the dollar as the reserve currency or a vendor threat in terms of the Chinese currency, etc. All of these ideas are just stuck in a past view of finance. Look at the past 150 years and extrapolate from that. When you extrapolate from that, you get more the same thing where DeFi is an extraordinary opportunity because this new technology is not so simple. It is a challenge to teach, and my master’s students struggle with this. I told them during the last lecture that if they believe that they understand everything we covered in that course, then I failed as an instructor because it is just not possible to do that in the length of a single course. A lot of what I teach is for my students to know what they do not know. Hopefully, they manage to figure this out. This is a complicated space which means that a lot of what is happening in the crypto space is completely under the radar. You look at the media, and all they discuss is the Bitcoin price, Dogecoin, and whatever Elon Musk is doing. the exciting stuff happening in the crypto space is not happening with Bitcoin or Dogecoin; it’s happening in DeFi. So, what does that mean? That means that there is a big opportunity for those set in early, and we are in very early in this space. We are less than 1% into this disruption of finance. Those that invest the time to figure out how space actually works, which is a challenge to actually do, but those people will be in a very strong position when this goes mainstream.   Q: Do any of your students move into any aspect of crypto or crypto-adjacent finance career path, or is this more of an elective course? 16:55  Some aspects of the course are fun, and others I do not think my students would think are fun. When you are going through the elliptic curve in a digital signature algorithm, it can be pretty tough. I do not hold back on that, so they need to understand the details of how this actually works. It is a course that is technically challenging, but the most important aspect of my course is it emphasizes that my students do not need to be computer scientists to win in this space. The most important ingredient is creativity; you find an important problem that can potentially be solved with blockchain technology and go after it. If you do not have a CS background, you can find a developer. They are hard to find today, but you can find somebody. You need to know a certain level of technical detail what is actually going on, which is difficult. to understand Ethereum is more challenging than Bitcoin. We do spend time on that. In fact, my students have deployed two smart contracts in the course, which everybody has to do. They need to deploy a contract to the test net, of course, but nonetheless, that exact same contract could be deployed on the main net. We also have the coin that we use in the course to show the students how to create that token. Then I use it in an interesting way. If a student participates in the course, I have one of my teaching assistants live and send out the coins in real-time to your MetaMask while updating this coin called FQ1 (Fuqua School of Business 1). I was going to call it FUQ, but that did not go too well. Anyways, students can see in real-time what is actually happening and then initiate discussion on how we could repurpose this for other ideas. Creativity is the most important thing.   Q: Let me push back and play devil’s advocate a bit. In your paper, and presumably, in your book as well, a lot of the advantages you point out for DeFi over centralized finance we have today are things like near-instantaneous settlements, wider access, and interoperability. A lot of these struck me as technological advantages and not necessarily organizational advantages. What happens when that technological edge is gone, and centralized organizations have access to all the same tools and the same quality developers and have the same level of competence that many of these crypto, native, decentralized protocols have? Is there still an advantage for DeFi? 21:13  This relates to my comments on FinTech. The centralized players want to survive. I was invited to a major world stock exchange to give a speech. I showed up and was joined by all the senior management plus the Board of Directors. It was very interesting. I said, ‘okay, what’s up?’ I knew that I would have to talk about DeFi, but it was essentially the single question of how much time we have? I think the financial institutions are grappling with that question. In the meantime, they’re going to have to become more efficient, and we’ve seen that happening already; Credit card fees have obviously come down with cashback and things like that. There have been important innovations in terms of online cash transfers. The costs to use this will come down, which is good. Still, it can only come down to a certain degree because you need to financially support all of the centralized infrastructures. So yes, it will become more efficient in the short term. Still, at some point, it just doesn’t make any sense to use the centralized institution when you can do it far cheaper by being decentralized. Again, my example about my wire transfer from dollars to euros; The person on the phone said, ‘you’re such a good customer that we’re going to waive the fee.’ Yes, that’s how it works, and many people are very pleased with that, but the fee, the real fee, is the spread that the bank is making as a profit. That spread is enormous and really punitive and unfair. Even if that spread decreases, which it will in the future, you still need to support all infrastructures. It’s much more efficient to deal directly with an algorithm. Basically, the algorithm is enabling direct P2P interaction. That, to me, is the most efficient way to interact. You need to wonder if the ultimate centralized institutions, which are the central banks, are also asking whether this will get out of control, especially in some smaller countries.- Essentially, centralized institutions are buying time. In a few years, almost everybody in the entire world will have access to a smartphone. Internet will be available across the globe, effectively free. In a world like that, the justification, the economic justification for centralized control, simply decrease. Historically, I understand that the Federal Reserve was founded a little over a hundred years ago. I understand all of that and the problems that they were solving. Today, it’s not clear whether they continue to solve problems or are creating problems.  Chris Cameron: That’s a good point. We had a guest from the Federal Reserve last week, and, yeah, they seemed like they’re struggling with the direction to go from here. I like reading your work because I’m an archeologist by trade, so I love the examples of the ancient Egyptian markets for barter, coins, and Lydia, and whatnot.     Q: One of your examples goes into detail about the Iraqi Swiss dinar. Maybe you could take a minute to get people up to speed on what happened after that the Gulf war in Iraq following the Gulf war with the Swiss dinars vs. the newly issued ones? 25:53  All of this is motivated by the idea that you can have a currency that doesn’t have a tangible value or isn’t backed by anything. A lot of this has to do with the incredible disagreement over the true price of Bitcoin. Some people perform crazy math calculations where they say, well, Bitcoin equals gold and old’s worth $9 trillion. There’ll be 21 million Bitcoins. Therefore a Bitcoin is worth $400,000. That logic is, obviously, flawed because you assume the result in the first step. Some people believe it’s $400,000, but other people believe it’s worth zero. The reason is that it doesn’t have any tangible value. It has no fundamental value. There are no dividends or cash flows. There’s no backing. It’s just an algorithm. It’s scarce, yeah, of course, but that doesn’t guarantee value. There are lots of things that are scarce, and yet they are worthless. So how does this actually work? There are several historical examples, but I really like the example of what happened with the first Gulf War. Essentially, a rock was split into two pieces. The Kurds in the north were autonomous, and Saddam Hussein was in the south. Extensive sanctions were imposed, and it turns out that the dinar that existed in Iraq was printed in the UK. the printing plates actually came from Switzerland. When the sanctions were imposed, there was no way to actually print additional money. Saddam and his associates scrambled; They basically developed a facility to do printing within Iraq, and they created a new dinar. The old dinar was called the Iraqi Swiss dinar and used the term Swiss because the printing plates were made in Switzerland. What Saddam had to do was to convert the old Swiss dinar into the new dinar, and an edict went out saying that all locals had to exchange for the new dinar. If you didn’t do it, then the old Swiss dinar would be worthless. People scrambled to go to the banks to exchange their old dinar for the new Saddam’s dinar. However, people in the north couldn’t do that because they are completely autonomous. The north was left with the old Swiss dinar, which is worthless in the south. At some point, they say that you can’t convert, and therefore their currency is worth zero in the south since it had no central banking backing it whatsoever. Saddam inflated the old dinar by printing it like crazy. Eventually, the exchange rate was 300 new dinars to buy a single Iraqi Swiss dinar from the north. It’s extraordinary that the currency with no official backing becomes 300 times more valuable than the currency officially backed by the government. The lesson here is that Bitcoin, Ethereum, or something like that can have value even though it’s not officially backed. What people forget, and again, some very prominent people, which I don’t want to name right now, forget this idea that value can be obtained differently. Yes, there may be tangible value. For example, suppose I’ve got a gold coin. In that case, I can actually melt that down and sell it to a jeweler or use it in electronics or dentistry. There’s lots of tangible value for gold, but you need to also consider intangible value. Today’s economy is driven by intangible value. Things that are difficult to value like your software, R&D, IP, all this stuff is intangible. If we recognize intangible value for value in companies, surely we can recognize intangible value for the crypto space. Indeed, this applies to Bitcoin. There are many other cryptos like Ethereum that do have some tangible value. It is effectively a computing platform, and just like Amazon Web Services (AWS) has tangible value, a platform like Ethereum should have some tangible value. Nevertheless, if you put it together, it all means that it’s valuable.  Chris Cameron: Wow. You pretty much blew through any questions I was planning to ask.     Q: A final question concerns the Swiss dinar as an analogy for how some crypto assets could see widespread usage. I’m struck, though, that the Swiss dinar had the advantage of already being a unit of account and medium of exchange in the north. For something starting from zero and without widespread usage, is that really a path that seems workable? I know that one of your co-authors for this book is behind another stablecoin. I don’t know; maybe they had some insights or-- I’m just curious about how Dai already has widespread acceptance. I have to say it was before I woke up to crypto that a lot of that happened. In hindsight, it seems inevitable, but in real-time, it’s hard to put your finger on exactly how something that’s not directly redeemable nor backed by a centralized authority can bridge that gap to what you’re talking about of a decentralized and independent central authority currency. 32:39  You’re correct. People already had the Iraqi Swiss dinar in their wallets. However, this was different because people generally thought this was a temporary thing, that this wasn’t a long-term equilibrium. Indeed, there was no way to replenish, and paper currency has got a certain life before it disintegrates. I think that this is an example of using something that doesn’t have any fundamental value, which people believed in and as society believed in its value. It functioned appropriately for that particular situation. It is a historical example, and there are many other examples that I could give in terms of things that were used that didn’t have any fundamental value; there was the stone currency of the Island of Yap in the South Pacific or prisoners of war in World War II where cigarettes actually became a currency and worth far more than the actual cigarette elsewhere. There’s plenty of examples here. What DeFi offers is something different in that it is a vision of what the world could be. You see a little bit of it today, and this is more of long-term technology. This is not something that’s just going to last a few years. To create something like that, when you start from scratch, as with any innovation, it takes a while to actually be accepted. We had the internet for years before it was launched as the worldwide web. I was using the internet for an email in 1983, or even before that. It was there, but it just wasn’t easily available. That’s kind of where we are today. Another analogy of where we are today is before Mozilla was introduced in the mid-1990s. At that time, it was not easy to deal in the web space, but it became easier. Given the vector that we’re on, it’s not hard to forecast that this could be the structure of the future system of exchange, again, as almost everything is tokenized. I think we need to draw the distinction between stuff that is short-term, like the Iraqi Swiss dinar, and a new technology that solves many of the problems that exist with centralized finance and is poised to become the premier leading technology. DeFi is not fleeting, but it is early, and there are risks. My book extensively discusses the risks that we face in this space, but the opportunities are enormous, and new technology always has risks. If you want something risk-free, then you’re not going anywhere. You’re just stuck with what you’ve got. Indeed, even what you’ve got right now has got risks. You can’t be too risk-averse here when the opportunity is so massive. I do believe that we’re on the right vector. There will be ups and downs, and not just for the price of Bitcoin. There will be incredible challenges in bringing the technology into the mainstream, but the vector is very positive for this idea.   Conclusion  Chris Cameron 35:83  Awesome! You’ve been very generous with your time. This is a great place to end the call. Everybody, make sure you hop over to Amazon or wherever books are sold and pick up a copy of DeFi and the Future of Finance. We’ve been here today with Duke University’s Professor Campbell Harvey. Do you have a Twitter account or anything where people would be able to follow you? You have a lot of fans here in the chat.  Campbell Harvey: Yes, I’m @camharvey on Twitter, and I’m also active on LinkedIn and other forums. I will also mention that I’m currently working on a Coursera course module on DeFi. It will offer certification in DeFi. It’ll closely follow my book, although you know space moves so fast. We wrote the book with Uniswap V2, and we had to basically scramble to incorporate a V3. The Coursera course will be launched sometime in September. The book will be released in August. Chris Cameron: Awesome. Thank you so much for your time. I think we’re going to have to get you back here again at some point. Campbell Harvey: Okay, Cool.   Chris Cameron: Take care, everyone. Stay safe.   Common Abbreviated Terms DAO: Decentralized Autonomous Organization RWA: Real-World Asset DeFi: Decentralized Finance P2P: Peer-to-Peer  Credits  Andrea Suarez produced this summary. Artem Gordon produced this summary. David Utrobin produced this summary. Queensphine Ntinyari produced this summary. Everyone who spoke and presented on the call, listed in the headers.​  ",
                    "links": [
                        "https://youtu.be/EQNL5sT_AwU?t=41",
                        "https://www.youtube.com/watch?v=EQNL5sT_AwU&t=55s",
                        "https://en.wikipedia.org/wiki/Campbell_Harvey",
                        "https://www.amazon.com/DeFi-Future-Finance-Campbell-Harvey/dp/1119836018",
                        "https://youtu.be/EQNL5sT_AwU?t=41",
                        "https://youtu.be/cwF0ae8iIrI?t=240",
                        "https://youtu.be/cwF0ae8iIrI?t=503",
                        "https://101blockchains.com/cedefi-vs-defi/",
                        "https://youtu.be/cwF0ae8iIrI",
                        "https://youtu.be/EQNL5sT_AwU?t=1015",
                        "https://youtu.be/cwF0ae8iIrI?t=1273",
                        "https://youtu.be/EQNL5sT_AwU?t=1553",
                        "https://youtu.be/EQNL5sT_AwU?t=1959",
                        "https://youtu.be/EQNL5sT_AwU?t=2333",
                        "https://twitter.com/camharvey?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor",
                        "https://www.linkedin.com/in/camharvey/",
                        "https://www.coursera.org/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.585694042521489
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#3",
                    "likes": "1",
                    "time": "30/06/2021-03:52:18",
                    "content": "Any chance this can be streamed live on Maker’s YouTube channel as well as the Crowdcast platform? Would be easy to link YouTube streams on Reddit/Twitter/etc. and will also result in more views because it doesn’t need signing up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.782828282828283
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "0",
                    "time": "30/06/2021-10:06:15",
                    "content": "These will be handed over after the fact to any Maker CU that has use for them. I will hopefully today be able to get uContent CU the one from yesterday Sorry. Didn’t answer the first part of your question. I can’t right now, but it looks like I may be able to upgrade my Crowdcast subscription to do simulcast. It’s probably not prohibitively expensive, so let me see if we can make that happen. Great idea! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.096938775510204
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "5",
                    "time": "06/07/2021-22:09:44",
                    "content": "Today is the day! Join us as Prof Harvey talks DeFI, his upcoming book (which features MakerDAO in it), and decentralized finance’s awesomeness. Mark your calendars and submit those questions about the future of DeFi: Suggestion Ox || Questions For Prof. Harvey of Duke University ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "0",
                    "time": "04/01/2022-11:18:54",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}