{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/forced-dai-sale-from-dsr/1562",
            "title": "Forced DAI sale from DSR ",
            "index": 1562,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "rates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#1",
                    "likes": "0",
                    "time": "16/03/2020-00:22:24",
                    "content": "The DSR created strategical demand for DAIs, but the system needs tactical facility flooding markets with DAIs on demand and working authomatically. I would propose to give any DSR account a possibility (or an obligaion?) to sell DAIs locked in the DSR automatically if the rate goes up. The target asset may be set by the DSR customer. The triggering rate may be also set by the customer withing the limits set by governance. It should be economically reasonable for someone collecting 4% annual DSR  to get it immediately in case of DAI price spike. It makes also the maker system healthier, automatically flattening spikes. Although a third-party DeFi may implement this logic, it could be also possible to make it obligatory in DSR: you must sell DAI (with reasonable profit) if there is a system need. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "1",
                    "time": "16/03/2020-02:17:46",
                    "content": "I think lots of DSR depositors would be happy to provide liquidity if it was easy enough. This issue has been raised before, probably more than once. Do any exchanges offer CHAI/USDC markets with limit orders? I really think this is just a matter of financial engineering more than making it some kind of obligation of DSR depositors. For example, this morning, once the gas price had come down from nose-bleed levels, I sold my DAI for USDC using curve.fi for a 4.5% gain. I was happy to do this during the calm after the storm. The problem that needs to be solved is to make this easy enough to do during a liquidity crunch with wild volatility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.611111111111111
                }
            ]
        }
    ]
}