{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govcomms-bi-weekly-update-oct-30-nov-12/11604",
            "title": "GovComms Bi-Weekly Update: Oct 30 - Nov 12 ",
            "index": 11604,
            "category": [
                "Core Units",
                "Governance Communications"
            ],
            "tags": [
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "2",
                    "time": "12/11/2021-14:58:38",
                    "content": " Published Forum Thread  GovComms Bi-Weekly Update Oct 30 - Nov 12, 2021  Administrative Update  Added Roles Visual Diagram We added a visual description of the roles between our full time team members to our public drive. Check it out   GovComms Roles Map1003×1483 44.1 KB   Budget Modification The budget modification proposal SP40 has been Formally Submitted for the November Cycle. The main changes are:  Travel figures updated; More accurately reflects expenses by assuming one team-wide offsite for three people, and coverage for two people to attend up to three events per year. Salary line item updated; More accurate. Hourly Compensation item updated; More accurate. Operating Expenses item updated; More accurate.  For detailed figures visit the proposal linked above.  Work Being Done Since the launch of the CU, we have added a ton to our public drive. Supporting documentation around all our active projects is growing with project plans/descriptions, metrics tracking, and workflow process docs coming into existence and being iteratively improved upon.  Meetings at Maker, The Call Calendar We are continuing to formulate a vision for meetings and coordination at MakerDAO. Currently we have a public call calendar that anyone can subscribe to. We are putting together documentation for what this calendar will be. The vision is to give permissions to select Facilitators and key team members who are leading various initiatives and sub initiatives to be able to schedule public calls with strict invite lists as well as calls with open access. This will be key for improving visibility and feedback opportunities for stakeholders of all types.  Translations Carrying forward the legacy work of some community development team contributors, our team has continued to fund translations of select publications into Spanish. We held a meeting with the content production team after our former meeting with the contributor team in order to help bridge their work to a Core Unit with the appropriate mandate to house the work. Content Production is piloting an ambassador program that includes translations for content. Handoff nearly complete   Stakeholder Database We are in the process of reviewing and solidifying a deal with legal counsel that specializes in global tech GDPR compliance. Soon after we will begin work to bring our practices up to a standard that ensures the protection of collected stakeholder data.  Information Output Audit Thomas has completed a written report of the first findings of the Audit. We shared it prior to our very first Status Update call, which happened Nov 11th and had a handful of attendance from facilitators and representative team members. The video can be found on our drive here. The next step for the audit is checking in with each Core Unit Facilitator to capture their feedback on the audit findings. If the Core Units agree with the findings, then the next step will be to finalize the audit and set a timetable for completing each recommendation.  Issue Discussion Calls We created a draft of the process documentation for coordinating and organizing these calls. The next call is being planned.  Published 10/30/21 - 11/12/21 Maker Governance Review (Dual effort between MKT-001 & COM-001) October 2021 Maker Relay (Dual effort between MKT-001 & COM-001) #69 Eng | #69 Esp #70 Eng | #70 Esp Forum at a Glance 10/28 - 11/4 11/4 - 11/11  Up Ahead  Emergency Playbook Work Mandate Refresh COM-001 MKR Comp Package Coordinating the next Issue Discussion Call Next steps for Information Output Audit Monthly MakerDAO CUs update  ",
                    "links": [
                        "https://drive.google.com/drive/folders/1GBAeTx4jmob7wRs7_LK32Bh_Y-pHzPvV?usp=sharing",
                        "https://docs.google.com/document/d/1Kecu6_Qso_DDQ03E_8DcMZglg6TjB2qmpxVQ7ASYXgQ/edit?usp=sharing",
                        "https://forum.makerdao.com/tag/espa%C3%B1ol",
                        "https://docs.google.com/document/d/1bBfcFFjKj6vsXlFakNQ92wc17LvbYH5cI-LmxEB10Bg/edit?usp=sharing",
                        "https://drive.google.com/file/d/1WjKS3Qd5LTchNIM0XJZhP_W4cOEEu4mG/view?usp=sharing",
                        "https://docs.google.com/document/d/1QRA7aRRxM_CJzWMs-0HWlrHjxfbx48ou2QeeopkNSkI/edit?usp=sharing",
                        "https://forum.makerdao.com/t/maker-governance-review-october-2021/11517",
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439",
                        "https://forum.makerdao.com/t/maker-relay-ep-70/11528",
                        "https://forum.makerdao.com/t/maker-relay-ep-70-en-espanol/11569",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-28th-november-4th/11441",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-4th-november-11th/11591",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/under-construction/12274/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.793699186991869
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/02/2022-14:58:58",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}