{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-updates-april-8/14615",
            "title": "Growth CU updates: April 8 ",
            "index": 14615,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "5",
                    "time": "14/04/2022-00:12:28",
                    "content": " General Updates  On Institutions. As we mentioned in previous updates, DAI was approved by the Aave community to be included in the AaveArc Market. After working with Fireblocks, they whitelisted the D3M contract, allowing it to participate in the Arc pool. We are working with Governance House to start the governance process for the D3M in the Aave and the Maker community.  On Bankless. As part of our first steps towards improving the Maker brand, we took a sponsorship slot in the Bankless podcast. You will hear about Maker during the Bankless show on YouTube and learn that we are not just a stablecoin, because with Maker, the power to mint your money it’s in your hands.    YouTube    ✂️ MakerDAO 25 seconds · Clipped by Nadia Alvarez · Original video \"FRAX & the 4pool Curve Takeover | Sam Kazemian\" by Bankless       The Brand team. Last Wednesday, we presented our Brand team incubation proposal. In case you missed it, here is the recording and an explanation of our plan.  ETH Dubai. @joce_chang organized a private dinner with the Maker ecosystem (our partners) and invited some of the Vault whales that came to the event. During this dinner, Jocelyn talked with institutions with an existing vault and pitched them IV.   Star of the week   Paraswap integrated the PSM  https://twitter.com/paraswap/status/1512445024474181638  MakerDAO twitter Account. Twitter followers (MakerDAO account): 208.2k (0.68% WoW) Number of tweets: 8 posts (+0% WoW) with 45 tweets (-13% WoW)  Twitter engagement rate: The third-party metrics tool (Unbox Social) that we are using does not measure with the same formula as Twitter Analytics native tool. As we don’t have direct access to the Maker Twitter account, we will be working with TechOps to get the reports that will allow us to get that metric more accurately.  MakerGrowth Tweet of the week   twitter.com    MakerDAO Growth @MakerGrowth  Our views on 4pool/3pool/2pool and the future of DAI.  🧵👇  1/   6:56 PM - 8 Apr 2022           45                10            ",
                    "links": [
                        "https://www.youtube.com/clip/UgkxbIxidmt2gNnc715nxT4DlWpSWCfzq2p_",
                        "https://www.youtube.com/clip/UgkxbIxidmt2gNnc715nxT4DlWpSWCfzq2p_",
                        "https://forum.makerdao.com/t/the-maker-brand-team/14442/16",
                        "https://twitter.com/paraswap/status/1512445024474181638",
                        "https://twitter.com/MakerGrowth/status/1512504651236663311",
                        "https://twitter.com/MakerGrowth/status/1512504651236663311",
                        "https://twitter.com/MakerGrowth/status/1512504651236663311",
                        "https://twitter.com/MakerGrowth/status/1512504651236663311",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.613888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/05/2022-11:48:37",
                    "content": "Hello Nadia–I’ve been meaning to ask–with regards to Stargate Finance, any luck on getting DAI listed/proposed? What is the Stargate team indicating? Do we need to create a proposal to the Stargate community to get DAI listed? Do you happen to know if there’s any timeline and cost to get it done? (trying to get an idea of what are the obstacles). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#3",
                    "likes": "2",
                    "time": "27/05/2022-12:51:16",
                    "content": "Hey Frank, we are working with the stargate team, and Maki will be proposing to integrate DAI on Optimism, Arbitrum, and Ethereum as they want to integrate canonical DAI, later, the idea is to add the D3M. @hexonaut has been following this integration in case you need more details. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "1",
                    "time": "27/05/2022-13:22:27",
                    "content": "I was considering posting a proposal in the StarGate Forum, hence why I was asking timelines & cost (one of the requirements), but it sounds like you guys have it figured out and are way-ahead with communicating with Maki & the community. Thank you. Onwards and upwards! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "25/08/2022-13:22:30",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}