{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/new-coins-as-collateral-available/1010",
            "title": "New Coins as Collateral available? ",
            "index": 1010,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "collateral-onboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/kevin.gruendel",
                    "index": "#1",
                    "likes": "1",
                    "time": "22/12/2019-22:48:30",
                    "content": "Hey, Does anybody knows, when OMG can be used as collateral for DAI? If it is already usable, does OMG needs to be in the wallet to show as an collateral option in Oasis? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/12/2019-05:48:03",
                    "content": "Hi @kevin.gruendel, Welcome to the MakerDAO Forum!!! Feel free to make a little post about yourself in the official welcome tread here :     The Official Welcome Thread       Thanks to Makerman’s thread, I’m starting up this welcome thread for our forum users. It’s important for us to get to know a little about each other as we work together to effectively manage MakerDAO.  Please use this thread to introduce yourself   Things to potentially include:   How you were introduced to Maker Where you’re geographically based out of Background info on your personal, intellectual, professional, and academic interests etc.     Leave a comment in the Feedback section : https://forum.makerdao.com/c/site-feedback If any question feel free to contact a Moderator, they will greatly help you out!!! ",
                    "links": [
                        "https://forum.makerdao.com/t/is-there-a-thread-here-to-welcome-new-forum-members/766",
                        "https://forum.makerdao.com/c/site-feedback"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.657894736842104
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#3",
                    "likes": "2",
                    "time": "23/12/2019-14:58:17",
                    "content": "We are working on the process for collateral onboarding. Its pretty far along, but once that is agreed on an interested party can start the application for OMG, which would take some time since risk, legal and technical analysis takes alot of work, not to mention the bureaucracy which would take minimum 2-3 months I think. Personally I’d guess onbaording OMG will take at least 9 months maybe longer probably not shorter (depending if the analysis part is already underway and if the community is interested) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46875
                }
            ]
        }
    ]
}