{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-quarter-review-may-june-july/10329",
            "title": "Growth CU Quarter Review (May-June-July) ",
            "index": 10329,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "11",
                    "time": "15/09/2021-02:19:10",
                    "content": " Growth CU Quarter Review (May-June-July) This post summarises the results of the Growth Core Unit’s work of the first quarter after approval by the Maker Governance. To achieve our core unit mandate, we follow the “Growth Process,” which consists of all the necessary steps to move a prospect from an early-stage lead to a closed integration and co-create a growth campaign (B2B Activations).  Current situation. Our current Growth Process is:  1348×514 32.8 KB  More details about each one of the stages can be found in our Core Unit Proposal. To measure the results of our work, we use the rate of growth in “tier-weighted closed deals’’. This is the number of deals closed weighted by the tier that they fall into. For the M-J-J Quarter, we closed 33 deals and worked on various B2B activations with our partners. As explained in our proposal, the resources we put on a partner depend on its Tier. For Tier 1 partners like BlockFi, which can help us to increase Dai visibility in the market, we dedicate resources to allow them to build a message around Dai’s value proposition for their users.  image1090×1422 161 KB  Curious about what B2B activations are? For the following months, we have 612 leads in the Outreach stage and 393 opportunities in the next stages of our Process (Once a lead passes the outreach stage, it’s considered a qualified opportunity and becomes part of our pipeline). The current view of our pipeline is:  1048×620 48.3 KB   Our focus during M-J-J Quarter. During these months, besides the administrative tasks related to the incorporation of a functional CU and the transition from the Foundation to the DAO (we didn’t talk much about it, but as others have mentioned, it takes a lot of time and effort) we started with a regional focus as we stated in our proposal:   Africa: We couldn’t progress in this region because we didn’t have someone to cover it.   Asia: We are focused on the main markets → India and China, positioning not just Dai but also Maker Vaults. We are also working with different companies from Singapore and the RWF team to help them onboard as RWAs collaterals.   Latam: We continued our work with local exchanges and wallets to enable more on/off ramps for DAI to the local currencies in the region. As the Play-to-Earn movement has become more popular in this region, we are working with tournament platforms and Axie schools to insert Dai into their ecosystem.   Europe: We participated in Ethcc as speakers and organized with other CUs the MakerMafia event to show everyone about what’s happening with Maker. Also, various of our strategic partners are in Europe, and after conversations with them, we started pushing the Institutional Vaults initiative (for a product-focused on crypto-institutions) and the D3M integration (for a product-focused on protocols integrations).   North America: This region includes various strategic partnerships we want for the protocol. With the attention of TradFi into DeFi, we have been having conversations with important players who wish to interact with Maker, and that’s why a lot of our efforts in this region is to educate compliance and legal teams about how the Maker protocol works and to find out a way for them to use it. In this region, there are also various crypto-artist and NFT projects we are working with to integrate Dai into their universes.    Lessons learned.   Although SES and PE team has been helping us with some technical tasks from our partners -thanks guys! -, we needed someone in our team dedicated to this. Not just helping our partners with their technical questions but also creating documentation for them and making it simple to interact with the Maker Protocol (from a partner PoV).   We needed someone focused on the African market with the understanding of it, but this market is small, and we also needed someone else focused in Europe because of all of the deals we have in there and their complexity.   We also noted that the latest projects developed by small groups of devs in hackathons were not using the Maker Protocol, some of them included Dai because it’s in the DeFi mindset but no one was creating wow-solutions on top of Maker. We have an incredible community, but we see the urgency to attract new people to the DAO, and we think one way to do it, is to have a presence in more hackathons and show the crypto-community we want them to help us to build a better ecosystem.   We spent 14k DAI more of the budget assigned for B2B activations, and we had to be pretty conservative with our expenses in here because we knew we had a limited budget. The reasons for it was:    We expected to have a Marketing CU and collaborate with them in these initiatives (and also share the costs) During our last months at the Foundation we weren’t doing this type of initiative, also it was a pandemic year where things were going slower, so we didn’t know for sure how the new dynamic was going to be. When working on the budget I didn’t think we were going to close as many Tier 1 and 2 that the team closed, I was expecting a slow beginning of the CU, conversely, the awesome @Growth-Core-Unit team adapted themselves very fast to the new reality and accelerated the closing time cycle.   The calendar quarter is not aligned with our budget, is not serious but is confusing    ",
                    "links": [
                        "https://forum.makerdao.com/t/b2b-activations-report-jun-jul-aug-2021/10236",
                        "https://forum.makerdao.com/t/b2b-activations-report-jun-jul-aug-2021/10236",
                        "https://forum.makerdao.com/t/maker-relay-ep-65-en-espanol/10784",
                        "https://forum.makerdao.com/t/maker-relay-ep-65/10697",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-10th-16th/10344",
                        "https://forum.makerdao.com/t/mip40c3-sp37-growth-core-unit-budget-gro-001/10228/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.671332972582973
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "5",
                    "time": "15/09/2021-05:35:56",
                    "content": "    Nadia:  We also noted that the latest projects developed by small groups of devs in hackathons were not using the Maker Protocol, some of them included Dai because it’s in the DeFi mindset but no one was creating wow-solutions on top of Maker. We have an incredible community, but we see the urgency to attract new people to the DAO, and we think one way to do it, is to have a presence in more hackathons and show the crypto-community we want them to help us to build a better ecosystem.   Not that I am any kind of hackathon-expert, but the ones I have seen tend to involve some new shiny exiting gadget that devs can play with. Maker could already be considered as part of the defi bedrock and is subsequently considered as rather old and uninteresting. Who cares about complex financial products when you can iterate on bored apes sitting in yacht clubs? Maybe possibly it is time to start viewing hackathons more as recruitment opportunities and move on to collaborate with established companies producing software for the financial industry? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.950757575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "1",
                    "time": "15/09/2021-13:13:09",
                    "content": "Fantastic update. I am always amazed at the number of leads and opportunities. The non-standard quarter threw me off a little. I wonder if it is worth pushing all CUs to align with the calendar quarters in the start of the new year. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.811079545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "3",
                    "time": "15/09/2021-13:20:59",
                    "content": "Thanks @Nadia for this nice post. Very useful indeed.     Nadia:  We also noted that the latest projects developed by small groups of devs in hackathons were not using the Maker Protocol, some of them included Dai because it’s in the DeFi mindset but no one was creating wow-solutions on top of Maker. We have an incredible community, but we see the urgency to attract new people to the DAO, and we think one way to do it, is to have a presence in more hackathons and show the crypto-community we want them to help us to build a better ecosystem.   This is quite concerning indeed. I wonder if you can shed further light on this topic:  what are the protocols that most people/small groups/new devs/etc focus on nowadays? Why isn’t Maker considered (as it used to be? - separate question)? Is this just due to the lack of PR, or the codebase/documentation/etc is complicated, etc.  Great that you see “hackaton activity” as one of the ways forward.     Planet_X:  Maker could already be considered as part of the defi bedrock and is subsequently considered as rather old and uninteresting. Who cares about complex financial products when you can iterate on bored apes sitting in yacht clubs?   I am not 100% this suffices to explain things. Integrating with Maker means interacting with:  DAI (this already happens, thanks to the current big status of DAI as stablecoin) Vault creation PSM/flash-loans/etc  If nobody integrates with 2/3, it means that other protocols’ APIs are used instead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.870454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "2",
                    "time": "15/09/2021-13:31:39",
                    "content": "@iammeeoh Money. It comes down to money. Research the $5M hackathon Solana had and the 13,000 teams that showed up. Money talks  ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-63-en-espanol/10443"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/09/2021-13:42:23",
                    "content": "    flipflopflapdelegate:  @iammeeoh Money. It comes down to money. Research the $5M hackathon Solana had and the 13,000 teams that showed up.   So one just need 5m usd to get 13k teams (?!?!) work on something? It looks as something we should add to our expenses list asap, if that’s actually true. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.267361111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "3",
                    "time": "15/09/2021-13:46:17",
                    "content": "    iammeeoh:  if that’s actually true.   Here it from the horse’s mouth:    Solana | News – 23 Jun 21    Announcing winners of the Solana Season Hackathon Over 13,000 builders registered for the hackathon and 350 teams submitted projects spanning DeFi, NFTs, Web3 and beyond.      There was also a write-up on how some people can make more money hacking than building a startup–google it–should be there. Crazy but true. ",
                    "links": [
                        "https://solana.com/news/announcing-winners-of-the-solana-season-hackathon"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#8",
                    "likes": "1",
                    "time": "15/09/2021-19:34:10",
                    "content": "and we are sitting on a treasury of 84,001 MKR…gathering dust. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#9",
                    "likes": "8",
                    "time": "25/09/2021-22:23:55",
                    "content": "    Nadia:  Africa: We couldn’t progress in this region because we didn’t have someone to cover it.   I would be interested in covering Africa. I have been working with the Real World Finance core unit on a part time basis since April. I would certainly welcome the opportunity to help on Africa too. Professionally, I worked on a large $25B project in Mozambique from 2012 to 2020 and have been interested in Africa since the early 1990s. I actually have a Masters’ Degree in African Studies from UCLA (1994) and my undergraduate degree was history with a focus on Africa. In addition to Mozambique, I have worked on various matters in numerous Southern African countries and more recently, have begun to develop some professional relationships in West Africa. I will DM @Nadia ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#10",
                    "likes": "2",
                    "time": "27/09/2021-19:04:30",
                    "content": "Looks like Revolut from the U.K is launching a Liquidity Mining Token, similar to NEXO–might be in-line for a DAI partnership/institutional vault: Revolut to Launch Crypto Token ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "26/12/2021-19:05:21",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}