{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-197-thursday-june-30-at-21-00-utc/16216",
            "title": "Governance and Risk #197 - Thursday, June 30 at 21:00 UTC ",
            "index": 16216,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "3",
                    "time": "29/06/2022-19:03:27",
                    "content": " 197 f1920×442 27.8 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only and should not be relied upon as legal, business, investment, financial, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only and do not constitute any recommendation for any action or an offer to provide investment, financial, or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478; please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-06-30T21:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Poll + Executive Status  @MIP-Editors - MIPs Update  @Artem_Gordon - Forum at a Glance   Initiative Updates  None this week.   Selected Discussions   Open Mic General Q&A Ask us stuff  Anonymous question box  ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1gh5UpZpMfIyQsr6Z121lhywydcnsrCDB2R_NfbNtGig/edit?usp=sharing",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "1",
                    "time": "29/06/2022-19:31:39",
                    "content": " Episode 197: June 30th, 2022  Agenda   00:04: Introduction  01:52: Votes and Polls  03:46: MIPs Update  08:59: Forum at a Glance  17:47: Open Discussion  27:17: Conclusion   Video Link  Introduction  Agenda and Preamble  Payton Rose 00:04  Hello, everyone. Welcome to the 197th Governance and Risk call here at MakerDAO. My name is Payton; I go by Prose11 online. I am a governance facilitator. I am joined live by awesome people interested in and working for the Maker protocol. Before we get into things, we will review a few ground rules.  This is a recording. Try not to speak over one another. If you have something you would like to add to the conversation, maybe you wish to hop in after the speaker finishes; you can utilize the raise hand function for Zoom, under reactions. If you are unable or unwilling to use the mic, feel free to drop your question in the chat. I am more than happy to read it off at an appropriate time. This is an open meeting; we encourage you to ask questions, give your commentary and join in on the collaboration.   That should cover us for ground rules. Let us get to the agenda.  As usual, we will start with the governance round-up covering the latest votes, Maker Improvement Proposals, and what is going on in the Forum. We have no initiative updates or set discussion topics today. Once we get through those updates, we will open up the mic to anyone to see if there are some topics we would like to discuss. I know it also has been a meeting-heavy week. If we want to keep it shorter, that is fine, too. There is also plenty we can discuss as well.     General Updates  Votes  Payton Rose 01:52 Polls:  Asset Allocation for MIP65 (Clydesdale)  Vote Breakdown:  US Short Treasuries (80%) + IG Corp Bond (20%) ~68,250 MKR Voting (57.67%) Abstain ~32,636 MKR Voting (27.58%) US Short Treasuries (100%) ~14,360 MKR Voting (12.13%) Reject Options ~3,100 MKR Voting (2.62%)      Executive:  Yesterday’s Executive | ~67,500 MKR Support  Risk CU MKR Transfer Activate Liquidations (Step 2) on Collateral Offboarding   Next Week’s Executives  Core Unit Budget Transfers and Streams Keep3r Stream Delegate Compensation     MIPs  Pablo 03:46 Weekly MIPs Update #93  961×613 25.2 KB   June Ratification Polls closed on Monday. Out of the 11 ratification polls we had, six got accepted. We will do a rapid recap of the outcomes. We are starting with MIP75, Task Forces, and its child subproposal for onboarding what would have been the first task force: the Growth Task Force. Both were rejected. We also had MIP74 Permissionless Open Market Operations, ratified with 59% of the votes. We had two Core Unit Budgets–GRO-001 & SF-001–, both of which passed with qualifications.  Growth’s budget had multiple non-standard options, out of which the one named bear market was the winner. This represents a 28% increase concerning Growth’s previously approved budget. As for the budget for Strategic Finance, the winning option was to approve their existing budget, extending their previously ratified budget for one year.  Both of these budgets more or less conformed to the new budget process.     We had two Core Unit Facilitator Onboardings–IS-001 & DIN-001–, or attempts at onboarding.  Psychonaut for the Immunefi Security Core Unit was rejected, leaving that CU with Travin as its sole facilitator. Tadeo for the Data Insights Core Unit was accepted. Tadeo is succeeding the ex-facilitator, Thomas, who stepped down voluntarily.   We had a proposal to onboard the Lending Oversight Core Unit. This onboarding was rejected, and so was the Makershire Special Purpose Fund, with similar percentages.  This special purpose fund was to be supervised partly by the rejected Lending Oversight Core Unit.   Finally, the amendments for MIP16, that updated that MIP to reflect the current executive cadence, and Keeper Network (Keep3r) were accepted. We will start with the newest Proposals in RFC. Recognized Delegate Kianga Daverington is proposing the creation of an SPF to pay legal fees and expenses to retain her as a full-time Interim Chief Legal Officer of MakerDAO for six months. We also have two proposals aiming to offboard the Events Core Unit–Modify Core Unit Budget (EVENTS-001) & Facilitator Offboarding (EVENTS-001).  These should be considered as one. The current ratified procedure establishes that a Core Unit can only be offboarded if it has no budget or facilitator.    MIP72 authorizes 6s Capital as a Real-World Asset Arranger for MakerDAO.  This proposal will not be entering July’s Governance cycle, despite being able. It will remain in RFC for some time. Meanwhile, the author asks the community to get involved and provide feedback.  There might be a Know Your MIP call coming for this MIP.      MIP41c4-SP37 is the only proposal formally submitted for the July Governance cycle.  Patrick_J has submitted a proposal to become a facilitator for GovAlpha.   We have two amendments, MIP4c2-SP15 for amending the Core Unit offboarding process is going to remain in RFC. MIP4c2-SP21 amends a MIP0 to introduce the notion of retrospection dates for MIPS. It will also stay in RFC for now. Finally, for important dates: Wednesday, July 6th, is the last day to submit proposals that will be eligible to enter the August Governance Cycle. The Formal Submission window for July, the loneliest formal submission window we have ever had, will open on Monday.   Forum at a Glance  Artem Gordon 08:59 Post: Forum at a Glance: June 23rd - 29th, 2022 Video: Forum at a Glance   There is an update to the Forum at a Glance: we pinned it as a continuous thread to make it more navigatable and easier to find. If anyone has any feedback on how that worked, let us know.   News & Announcements:  Endgame Decentralized Voter Committee Meetings: Wednesday, June 29, 9 pm CEST and Thursday, June 30, 9 pm CEST Announcement - At end of term MakerMan will be retiring as a delegate. Doo_Upcoming Resignation from Maker Growth Core Unit  Meet Your Delegate #16 - pvl  Pvl Delegate Platform      Discussions:  Simple MakerDAO — Governance from first principles Governance Security Module (GSM) Adjustment [Informal Poll] [Informal Poll] DAI borrowing incentive ideas that the DAO could test?    Signal Requests:   [BEAR] Building Financial Resilience & DAO Targets – Ended on June 30th, 2022.   Signal Request: LP our AAVE and ENS with ETH on Uniswap v3 – Ended on June 30th, 2022.   Immediately Onboard BUSD & Introduce 0% PSM – Ends on July 9th, 2022.      Open Discussion  Payton Rose 17:47   Payton: Thank you, Artem. We appreciate it. I did note that there is always more in the written version.  Chris, you mentioned your post on the USDC-PSM. It is highlighted in there, and other goodies as well. Thanks for putting that together, Artem. I encourage everyone to go check it out.   Today, we do not have a planned discussion topic or initiative updates. Thus, we want to turn over the mic to you, the community who showed up today, and ask what you are interested in discussing today. I know it has been a long couple of weeks in Maker governance. I understand if there is not much we want to discuss.  We had several votes ending on Monday, some of which were pretty contentious. There might be a few topics we could flush out a little more. If you think you have a topic feel free to raise your hand or drop it in the chat, and I will be happy to call it out.    Chris: Just on what we were typing about that thread, it got interesting the past couple of hours. Joao from Circle, the VP of product, came in and offered some thoughts from Circle. I would suggest anybody interested in that topic check it out and get a better sense of how Circle thinks about USDC and the PSM.   Artem: Thanks, Chris. I was about to reply. I did not add yours because we try to stick to three announcements and discussions per call. I always tell people to check out the Forum at a Glance. Unfortunately, I have to pick which ones to add, and I cannot add all of them just for the sake of time.    Payton: We had many calls today; some people might feel zoomed out.  We discussed a few different governance structures and ways to allocate work at the DAO. Those are also potential topics.    22:36   Kianga: I have a quick question. I saw your comment in the chat about strategy. What is happening with Wouter’s initiative? Was it called Resiliency? It was going, and then suddenly it stopped. Is it on pause? Does anyone on this call know what is happening with that?  I was hopeful that the resiliency initiative would be this coalescing force to bring in the threads of all the different strategy review processes and planning attempts currently happening in many different ways across the DAO.    Payton: I do not see Wouter here, but I can give the update that I know of: they had taken some time off to allow room and the other calls to take place.   Kianga: I thought that it would be parallel, separate, and not dependent on anyone else’s process.  Payton: That is the idea. It was a bandwidth issue; many people were attending these calls. They wanted to ensure they were valuable before hosting them. My understanding is that it should be coming back fairly soon. I thought it was next week, but it could be the week after.    Kianga: To the question in the chat. From my perspective, I think we are all collectively trying to undertake planning for strategy and review of the whole DAO, and it is a challenge, but it is occurring. Somehow. In different ways.   Person 1: I can quickly offer that from what I have seen done in the past with my clients–especially bringing in outside advisors like Deloitte or McKenzie–, given the size and scope of Maker at this point, it might be helpful to have a type of facilitation and structuring.  Kianga: I have not seen that proposed. What an awful idea that we get some help from people who have helped organizations break bottlenecks in their business. Has that been proposed? I have not seen it. Great suggestion.  Payton: I agree. I also do want to be encouraging. This week we saw the voice chat rooms being encouraged for Discord. That is a great way to have spontaneous conversations like this. Also, you are welcome to contact David or me about getting public events on the MakerDAO calendar. Alignment and strategy. This applies to everyone, and everyone might have a different approach. We want to encourage people who wish to host these discussions to do so in the format they see fit.     Conclusion  Payton Rose 27:17  Thank you for attending to those who came live. For those watching the recording, we will be back to our “regular time” next week at 17:00 UTC. Look for us there. I hope everyone has a great rest of their day. Thanks!  Suggestion Box Common Abbreviated Terms CR: Collateralization Ratio DC: Debt Ceiling ES: Emergency Shutdown SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal OSM: Oracle Security Module LR: Liquidation Ratio RWA: Real-World Asset RWF: Real-World Finance SC: Smart Contracts Liq: Liquidations CU: Core Unit   Credits  Andrea Suarez produced this summary. Constanza produced this summary. Everyone who spoke and presented on the call.​  ",
                    "links": [
                        "https://youtu.be/CTJsxelOSNk?t=112",
                        "https://youtu.be/CTJsxelOSNk?t=226",
                        "https://youtu.be/CTJsxelOSNk?t=539",
                        "https://youtu.be/CTJsxelOSNk?t=1067",
                        "https://youtu.be/CTJsxelOSNk?t=1637",
                        "https://www.youtube.com/watch?v=CTJsxelOSNk",
                        "https://youtu.be/CTJsxelOSNk?t=4",
                        "https://youtu.be/CTJsxelOSNk?t=112",
                        "https://forum.makerdao.com/t/signal-request-asset-allocation-of-mip65-clydesdale/15922",
                        "https://youtu.be/CTJsxelOSNk?t=226",
                        "https://forum.makerdao.com/t/weekly-mips-update-93/16129",
                        "https://vote.makerdao.com/polling/QmTRtpp3",
                        "https://vote.makerdao.com/polling/Qmbs5Kx5",
                        "https://vote.makerdao.com/polling/QmaivXCv",
                        "https://vote.makerdao.com/polling/QmdMkg2N",
                        "https://vote.makerdao.com/polling/QmVMc78Z",
                        "https://vote.makerdao.com/polling/QmaR6q4L",
                        "https://vote.makerdao.com/polling/QmWhsLCU",
                        "https://vote.makerdao.com/polling/QmWYajMq",
                        "https://vote.makerdao.com/polling/QmZjU2pG",
                        "https://vote.makerdao.com/polling/Qmerh2xJ",
                        "https://vote.makerdao.com/polling/QmXbgVGz",
                        "https://forum.makerdao.com/t/mip55c3-sp5-interim-chief-legal-officer/15981",
                        "https://forum.makerdao.com/t/mip40c3-sp73-modify-core-unit-budget-events-001/15991",
                        "https://forum.makerdao.com/t/mip41c5-sp8-facilitator-offboarding-events-001/15992",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/mip41c4-sp37-governance-facilitator-onboarding-gov-001/15284",
                        "https://forum.makerdao.com/t/new-mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://forum.makerdao.com/t/mip4c2-sp21-add-retrospection-process-to-prune-unused-mips/15142",
                        "https://youtu.be/CTJsxelOSNk?t=539",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247",
                        "https://youtu.be/CTJsxelOSNk?t=534",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247",
                        "https://youtu.be/CTJsxelOSNk?t=564",
                        "https://forum.makerdao.com/t/endgame-decentralized-voter-committee-meetings-wednesday-june-29-9pm-cest-and-thursday-june-30-9pm-cest/16212",
                        "https://forum.makerdao.com/t/announcement-at-end-of-term-makerman-will-be-retiring-as-a-delegate/16098",
                        "https://forum.makerdao.com/t/doo-upcoming-resignation-from-maker-growth-core-unit/16085",
                        "https://forum.makerdao.com/t/meet-your-delegate-16-pvl/16206",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022",
                        "https://youtu.be/CTJsxelOSNk?t=715",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207",
                        "https://forum.makerdao.com/t/governance-security-module-gsm-adjustment-informal-poll/16205",
                        "https://forum.makerdao.com/t/informal-poll-dai-borrowing-incentive-ideas-that-the-dao-could-test/16057",
                        "https://youtu.be/ZMuA4wxjeec?t=811",
                        "https://forum.makerdao.com/t/signal-request-bear-building-financial-resilience-dao-targets/16004",
                        "https://forum.makerdao.com/t/signal-request-lp-our-aave-and-ens-with-eth-on-uniswap-v3/15863",
                        "https://forum.makerdao.com/t/signal-request-immediately-onboard-busd-introduce-0-psm/16233",
                        "https://youtu.be/CTJsxelOSNk?t=1067",
                        "https://forum.makerdao.com/t/can-we-justify-the-existential-risk-posed-by-psm-usdc/16180",
                        "https://youtu.be/CTJsxelOSNk?t=1356",
                        "https://youtu.be/CTJsxelOSNk?t=1637",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-june-2022/16529",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-july-2022/17038"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.806050005063162
                }
            ]
        }
    ]
}