{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/retrieving-lost-dai/12949",
            "title": "Retrieving lost DAI ",
            "index": 12949,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tariq.haji",
                    "index": "#1",
                    "likes": "3",
                    "time": "01/02/2022-00:48:48",
                    "content": "Hi, Some of you may remember me from like 6 months ago when I made some posts about how I accidentally sent $35k DAI to the Polygon contract address: https://etherscan.io/tx/0x9e1cd1bc681c6b1f30ab82bb7fe2e329356f1691ad0d6662967a0bb2b144001c I spent months contacting everyone I possibly knew, including getting in contact with Polygon CEO, as well as Rune himself (CEO of Mkr). Unfortunately, all my efforts resulted in bad news. Essentially, that polygon contract, no one has private keys to, so my $35k DAI is essentially gone and cannot be recovered. As a recent University graduate, $35k is life changing money, and this has been bothering me every day for the last 200 days. I managed to speak with Rune on twitter as he was kind enough to reply. He mentioned to me that I can be more active on the forum (maybe help others who have been through similar experiences and make sure no one else makes this mistake), and sign up for sourcecred. I am a tad new to this, so if someone can help guide me to applying for sourcecred, and allow myself to be more active in the community that would be great. Cheers ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.386762360446571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/02/2022-00:55:56",
                    "content": "You can find the SourceCred opt-in stuff here: What is SourceCred and how do I opt in? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "2",
                    "time": "01/02/2022-22:12:36",
                    "content": "Sorry to hear this bro, hopefully being an active member on the forum with the sourcreed can help you out a bit. Paper is innovative with making a request like this but try it bro all the luck in the world. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.777777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/billybob",
                    "index": "#5",
                    "likes": "0",
                    "time": "05/07/2022-05:08:53",
                    "content": "wow just saw this, and my thread has been replied to, where i made a human error in losing 236k dai. im still waiitng about another month to make a response on my thread as i was advised to wait until mid q3, but yeah my dai was lost stupidly, my only mistaken transaction in 5 years, in the midst of a bad breakup, and it just happened to be my largest transaction i was moving. great stuff here and hopefully the team is moving along a path of recourse for us one time mistakers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                }
            ]
        }
    ]
}