{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposal-btc-usd-eth-btc-oracles-set-protocol-dydx-tbtc/2019",
            "title": "[Proposal] BTC/USD & ETH/BTC Oracles (Set Protocol, dYdX, tBTC) ",
            "index": 2019,
            "category": [
                "Governance"
            ],
            "tags": [
                "oracles",
                "proposal",
                "ethbtc",
                "btcusd"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#1",
                    "likes": "3",
                    "time": "18/04/2020-01:22:21",
                    "content": "Under the responsibilities delegated to me by the Oracle Team Mandate, I’m submitting the following three proposals to the MKR Governance community for consideration. Proposal: ETHBTC Oracle Proposal (tBTC) Proposal: BTCUSD Oracle Proposal (Set Protocol, dYdX) Proposal: Whitelist Set Protocol) Please review and give feedback. I’ll suggest that comments on a specific proposal should be posted in the respective thread in order to compile all the discussion in one place. Action Items Timeline 4/17 Oracle Team submits proposal to Maker Forum for community review 4/20 Polling Votes begin (ends 4/24) 4/24 Proposals that were ratified by MKR Governance in the Polling Votes are submitted for an Executive Vote ",
                    "links": [
                        "https://forum.makerdao.com/t/proposal-btcusd-oracle-set-protocol-dydx/2011",
                        "https://forum.makerdao.com/t/proposal-whitelist-set-protocol-on-ethusd-oracle/2013"
                    ],
                    "GPT-summary": "The author of the post is submitting three proposals related to BTC/USD and ETH/BTC oracles to the MKR Governance community for consideration. The author is asking for feedback on the proposals and suggests that comments on a specific proposal should be posted in the respective thread. The post also includes an action items timeline. Some 3rd parties may give constructive criticism or ask questions about the proposals.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.35
                }
            ]
        }
    ]
}