{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/short-take-exciting-news-and-opportunity-for-rwa-teams/16849",
            "title": "Short take: Exciting news and opportunity for RWA teams ",
            "index": 16849,
            "category": [
                "Discontinued Categories",
                "Real World Finance"
            ],
            "tags": [
                "rwf-0x",
                "archive-rwf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#1",
                    "likes": "11",
                    "time": "27/07/2022-13:13:12",
                    "content": " News   I have some exciting news to share with the community, The team has completed all work required for major onboardings of SocGen/OFH and HVBank. See spell details. This marks a major milestone started late 2021. In line with my initial vision that I communicated from the get-go to the community (also here, here and here) after I became the facilitator of the RWF-001 CU the idea was always to groom personnel so, once they prove themselves, they create spin offs of the original core unit to scale and decentralise RWAs.  The motto has always been: “professionalise and decentralise”  The size and the complexity of the total addressable market for RWAs is simply too big for a single unit operating globally and across asset classes.  Opportunity    This is a great opportunity for team folks such as @eumenes and @teej to put forward their names to spin off a separate RWF-002 CU focused in North America, should tokenholders wish so. Watch this space! At the same time, the RWF-001 CU is starting a journey of transformation towards a Metadao paradigm. The key benefit will be increased specialisation, professionalisation and venture building in a more narrowly focused DAO environment purpose built for RWAs. This transition requires new and different sets of talents and skillsets to focus on Maker core consolidation, full transparency automation and organisational change towards a subDAO. The end goal of the transformation is more efficient, automated and faster RWA processing. I’ll cover more on this in a separate post. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152#contributors-17",
                        "https://forum.makerdao.com/t/mip41c4-sp27-facilitator-onboarding-rwf-001/11308/5",
                        "https://forum.makerdao.com/t/the-lending-oversight-core-unit-love-001-cu-overview-incubation-update/13858/2",
                        "https://forum.makerdao.com/t/mandate-risk-teams/282",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/8",
                        "https://forum.makerdao.com/t/governance-and-risk-201-thursday-july-28-at-17-00-utc/16859",
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967",
                        "https://forum.makerdao.com/t/my-response-to-unacceptable-behaviour/17028",
                        "https://forum.makerdao.com/t/mip39c2-sp-creating-rwf0x-from-a-split-of-rwf-001/16967/12",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-21-27-de-julio-del-2022/16941",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-july-2022/16954"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.655420666290231
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "8",
                    "time": "27/07/2022-13:42:56",
                    "content": "Is it possible to get a Q&A/AMA on how this is going to work, and what areas RWF-001 CU will focus on, how will RWF-002 budget itself, etc.? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#3",
                    "likes": "6",
                    "time": "27/07/2022-14:14:57",
                    "content": "I wonder whether there is any vote that has been passed and gives authority to CU Facilitators to spend time and resources to adapt towards a new framework - in this case the MetaDAO framework which hasn’t been voted on. If I am wrong and missing something I apologise. In addition, as a MKR holder I’d like to understand whether there is an indication that @williamr is indeed the best person available for Maker’s flagship MetaDAO, or whether this role would be open to others to be assessed on. If I understand the MetaDAO construct correctly, those subDAOs are de facto independent sub-protocols. If this is the case, I’m looking forward to hear @williamr’s pitch as leader. In the meanwhile, I’d like to hear what is the mandate to dedicate resources to morph in a setup that has no MKR holder onchain support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.597402597402597
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/07/2022-14:29:07",
                    "content": "This is very interesting, especially considering the limbo we are in here in the US.  RWF-002 North America would be tasked with some precedent setting issues I would think. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#5",
                    "likes": "3",
                    "time": "27/07/2022-17:40:09",
                    "content": "I’m confused as to why governance should be expected to support creating a 2nd RWF Core Unit when we’re already in the process of cutting budgets and perhaps even offboarding other Core Units. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#6",
                    "likes": "4",
                    "time": "27/07/2022-20:49:20",
                    "content": "I’m also a bit curious about RWF-002. I appreciate that the idea of spinning off more RWA teams predated the MetaDAO idea, but to the extent that this RWA opportunity is couched in terms of building towards the Endgame Plan, I recall this slide from Rune:  Screen Shot 2022-07-28 at 8.41.09 AM1770×930 58.9 KB  Just to be clear, I know this plan is hardly set in stone (as @luca_pro points out, I don’t think there has been any formal governance process around the Endgame Plan). But there does seem to be a discrepancy between “freezing all further RWA activity” and “spin off a separate RWF-002 CU focused in North America”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/itsjake007",
                    "index": "#7",
                    "likes": "0",
                    "time": "27/07/2022-22:23:07",
                    "content": "Excited to see new ways to get involved in the wake of the new structuring! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.136363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#8",
                    "likes": "1",
                    "time": "02/08/2022-18:48:15",
                    "content": "It is very interesting to see this being proposed. From what I understand, RWF has the budget to grow and become more descentralised. I would love to hear more about this, to learn how it’s supposed to work. That being said, a bold move given the context. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.4833333333333325
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "31/10/2022-18:48:20",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}