{
    "poll_list": [
        {
            "title": "MakerDAO Supports EIP1559 - March 1, 2021",
            "index": "6646",
            "option": "Yes",
            "supporting_mkr": "34,208",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-does-makerdao-support-eip-1559/6646",
            "title": "[Signal Request] Does MakerDAO support EIP-1559? ",
            "index": 6646,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tvanepps",
                    "index": "#1",
                    "likes": "12",
                    "time": "18/02/2021-16:12:15",
                    "content": "Simple Summary of the EIP “A transaction pricing mechanism that includes fixed-per-block network fee that is burned and dynamically expands/contracts block sizes to deal with transient congestion” (Source) The concept was initially proposed in 2018 by Vitalik Buterin (Source), and first formalized as an EIP by Eric Conner. Since then, it has been implemented in 4 clients, subjected to expert academic review, and is currently in the testnet proving phase. See here for an up-to-date list of resources maintained by Tim Beiko. Why is signaling needed for something external to MakerDAO? It is useful to measure community sentiment, especially when it will have varying impacts on Ethereum stakeholder groups; this includes the application layer. We are also reaching out to many other leading applications and tools, and will present our findings at the upcoming 1559 community panel on Feb 26th. Our results would be incomplete without the MakerDAO community’s position represented. Client teams are far enough along in implementation and testing that a network upgrade potentially including 1559 has been tentatively scheduled for July 2021. In the unlikely event of a contentious chainsplit, MakerDAO would have to choose which chains to maintain the DAI system on. Clear, early signals from leading applications regarding their preferred featureset (eg. the chain that implements 1559 or not) will help to decrease uncertainty for the entire ecosystem leading to the upgrade. While there is no exact precedent for this type of direct survey, given the scope of the change, we thought it important that application communities become familiar with the mechanisms that make 1559 work. It is not expected that explicit polling for EIPs will become common in the future. Expected Benefits  More predictable gas fees, reducing user overpayment  “Shopping on Amazon is a lot easier than buying a house in a competitive real estate market. On Amazon, there’s no need to be strategic or second-guess yourself; you’re either willing to pay the listed price for the listed product, or you’re not” (Section 4.2) This will lead to better UX for users and applications   Preventative maintenance to avoid possible future chain reorgs  In conditions where fees significantly outweigh block rewards, there is an ever present incentive for block producers to carry out short term reorgs to capture as much value as possible. Burning the BASE_FEE removes this latent incentive. Read more here: On the Instability of Bitcoin Without the Block Reward    Cements the role of ETH within the Ethereum crypto-economic system  Burning the BASE_FEE adds a real and consistent cost to economic abstraction (paying for transactions out-of-band, or “off-chain”, in non-ETH assets)   Will allow in-protocol congestion oracle  Once EIP-1559 is live, it will enable a native congestion oracle via EIP 3198 - A useful tool for applications    Possible Downsides  Technical complexity  Reforming the fee market for a live, value bearing chain like Ethereum is no small task. All client level issues aimed to de-risk it are tracked here.   Miners are largely opposed to it, and are threatening to make the upgrade contentious  The BASE_FEE burn, an integral part of the system, has led to miner opposition because it will reduce their income.    Misconceptions  Lowering individual transaction fees  Transaction fees are a function of supply and demand, and this EIP does not attempt to increase average available blockspace or alternatively, reduce demand.   BASE_FEE burning is meant to punish miners  Burning the BASE_FEE is the simplest mechanism to ensure the elastic blocksize is not gamed by miners. If not burnt, then miners could costlessly increase the blocksize while extracting maximum BASE_FEEs from users, and recoup their sent losses.   Increasing ETH price  While sometimes mentioned by proponents of this EIP, this is not a stated goal for any of the constituent mechanisms.    Thanks to the MakerDAO community for their consideration, we are looking forward to questions and discussion!    MakerDAO supports EIP-1559  Yes No Abstain     0 voters     LFW: This poll will continue until Thursday 25th February and move on-chain on the following Monday, regardless of the off-chain signal outcome. This is so we can see MKR Holder response in addition to the community response. ",
                    "links": [
                        "https://ethresear.ch/t/draft-position-paper-on-resource-pricing/2838",
                        "https://hackmd.io/@timbeiko/1559-resources",
                        "https://medium.com/ethereum-cat-herders/ethereum-1559-community-call-d43d5f0bf909",
                        "http://timroughgarden.org/papers/eip1559.pdf",
                        "https://www.cs.princeton.edu/~arvindn/publications/mining_CCS.pdf",
                        "https://github.com/ethereum/EIPs/blob/master/EIPS/eip-3198.md",
                        "https://github.com/ethereum/pm/blob/master/Fee%20Market%20Meetings/mainnet-readiness.md",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-129-thursday-february-18-17-00-utc/6506/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-february-21st-2021/6741",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-129-thursday-february-18-17-00-utc/6506/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/18"
                    ],
                    "GPT-summary": "The post is a signal request asking whether MakerDAO supports EIP-1559, which proposes a new transaction pricing mechanism for Ethereum. The author explains the benefits and possible downsides of the proposal, and why it is important to measure community sentiment. The post also invites questions and discussion from the MakerDAO community.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Community and engagement",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.432910271546635
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/02/2021-16:19:40",
                    "content": "Thanks for outlining the situation and bringing this to MakerDAO. One note:     tvanepps:  official statement (blog or twitter)   Would you clarify if the outcome of this signal will be including in an official statement from you/others or that you are asking for an official statement from MakerDAO? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "5",
                    "time": "18/02/2021-16:22:07",
                    "content": "Good call, I missed that. The outcome of this poll and the following on-chain poll will be something @tvanepps (or anyone else) can point at in a twitter post or blog post. MakerDAO doesn’t tend to offer official statements in this way, there is no official MakerDAO (as opposed to Maker Foundation) twitter account. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/timbeiko",
                    "index": "#4",
                    "likes": "9",
                    "time": "18/02/2021-16:24:03",
                    "content": "Hi there, 1559 champion here      LongForWisdom:  The outcome of this poll and the following on-chain poll will be something @tvanepps (or anyone else) can point at in a twitter post or blog post. MakerDAO doesn’t tend to offer official statements in this way, there is no official MakerDAO (as opposed to Maker Foundation) twitter account.   That’s fine, we can point to an on-chain or off-chain vote as the “signal”. If the Maker Foundation wants to share it on social media/blogs, that’s even better, but if there is a policy against doing this, no worries. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.15
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#5",
                    "likes": "9",
                    "time": "18/02/2021-16:25:36",
                    "content": "I’ve been mining ethereum since 2017 and just broke even on my investment three weeks ago.  This has taken a considerable amount of work and dedication.  I am exactly the kind of miner we need on the ethereum chain, and this threatens to wipe out my years of work to finally make a profit.  I don’t personally support this EIP and I think the community is downplaying the importance of miners and the security/decentralization they provide for the network. Aside from that, I am concerned that burning the base fee will lead to ETH deflation; which is great for the token, but as the price of ETH increases the cost of transactions for our users increases (so long as demand stays the same or increases).  For those in support of this EIP, I would be interested in your take. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tvanepps",
                    "index": "#6",
                    "likes": "1",
                    "time": "18/02/2021-16:32:37",
                    "content": "I’ve removed this request. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#7",
                    "likes": "6",
                    "time": "18/02/2021-16:34:29",
                    "content": "Ethereum would be best served to stop tinkering with monetary policy if it wants anyone to take it seriously. IMO it adds needless complexity to reasoning about fees, the fee market is already a barrier to onboarding new users, so adding two fee components just increases the cognitive overhead. That said, I personally fully support whatever decision the core Ethereum developers choose on this. Professionally, the EIP itself has only tangential effects on MakerDAO’s operations, and is probably good for our risk model if our primary collateral type becomes deflationary. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.851515151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#8",
                    "likes": "3",
                    "time": "18/02/2021-17:45:50",
                    "content": "I am for anything that smoothes out the transaction fee and provides some predictability on the pricing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#9",
                    "likes": "1",
                    "time": "18/02/2021-17:53:25",
                    "content": "While not part of the poll, I am for EIP-1559… BUT after the PoS “merge” is complete (so in X months) … in my eyes, adding friction with miners until the merge is just not needed (and is playing w/ fire). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/timbeiko",
                    "index": "#10",
                    "likes": "3",
                    "time": "18/02/2021-18:04:12",
                    "content": "    brianmcmichael:  IMO it adds needless complexity to reasoning about fees, the fee market is already a barrier to onboarding new users, so adding two fee components just increases the cognitive overhead.   To be clear, the TIP would be set in almost all cases to a default value behind the scenes by wallets. Unless there is a sudden spike in demand, most users would have a single value to set, and would likely have their transaction included quicker than under the current regime. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.86940836940837
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#11",
                    "likes": "0",
                    "time": "18/02/2021-18:13:53",
                    "content": "    cmooney:  Aside from that, I am concerned that burning the base fee will lead to ETH deflation;   I eth price moons further, i promise i will act antideflationary. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#12",
                    "likes": "0",
                    "time": "18/02/2021-18:14:15",
                    "content": "    cmooney:  as the price of ETH increases the cost of transactions for our users increases (so long as demand stays the same or increases)   This is weird logic. If the cost of transactions increase then, eventually, demand will decrease. I don’t see how EIP 1559 affects transaction costs. Transactions costs are purely a function of demand for transactions. Moving low value traffic to level-2 is the way to reduce level-1 congestion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.664285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#13",
                    "likes": "0",
                    "time": "18/02/2021-18:15:55",
                    "content": "    psychonaut:  Transactions costs are purely a function of demand for transactions.   Well that is in theory what this is supposed to help, as many folks over-bid to get into a block… and when everyone over-bids, then the average fee excess is just economic waste… (my understanding…) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.955357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#14",
                    "likes": "4",
                    "time": "18/02/2021-18:47:26",
                    "content": "I got into crypto by mining.  First mined Monero chains with my gaming computer, then bought extremely overpriced GPUs and built a 5-GPU rig for ETH.  I mined ALLLLL the way down through the depths of the bear market (at a hefty loss), and through DeFi summer until my cards got bricked by the 4GB DAG file increase.  Held all my ETH and about doubled my expenses + electricity. IMO, miners are getting overpaid right now, and I’m welcoming the burning. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.318948412698412
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#15",
                    "likes": "0",
                    "time": "18/02/2021-18:52:44",
                    "content": "Yeah, obviously cmooney did not have best strategy. Most miners should not be profitable, otherwise we are significantly overpaying. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "0",
                    "time": "18/02/2021-18:57:15",
                    "content": "It was against against my better judgement, but I polled for “Yes.” Reason: I hope and pray it will increase block size by 2x. However, I do think that miners will make this a worrisome and stressful experience for the Ethereum community which will lead to bad press. I also remember coming across this reddit post last month, which made me realize the miners point of view–not All miners are making a killing:    reddit    r/ethereum - Flexpool officially announces its position against EIP-1559’s... 37 votes and 103 comments so far on Reddit      ",
                    "links": [
                        "https://www.reddit.com/r/ethereum/comments/ky09kn/flexpool_officially_announces_its_position/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tvanepps",
                    "index": "#17",
                    "likes": "4",
                    "time": "18/02/2021-19:22:54",
                    "content": "Just to clarify, 2x block gas limit increases (under the “elastic blocksize” feature) are only temporary to accommodate demand spikes. They are balanced out by 1/2x blocks (~6.25mm gas) so as to not increase rate of state growth. Over long periods, average available blockspace will remain the same as before 1559. Regarding miners, while we have to consider the needs of every stakeholder group in protocol changes, we cannot let the needs of a single subset overly encumber the greater benefit of the entire ecosystem.  not All miners are making a killing  This is the equilibrium state of the mining network - when the mining ecosystem is saturated at scale, most miners will be just above breakeven profitable. If it were any higher, hashrate would join the network, attracted by the profits and increase the overall mining difficulty. Adrian Sutton had a great piece recently addressing this point, would encourage you to read it: Why Miners Can Be Simultaneously Paid Too Much and Struggling to Survive ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.792857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#18",
                    "likes": "2",
                    "time": "18/02/2021-19:35:23",
                    "content": "    mrabino1:  and when everyone over-bids, then the average fee excess is just economic waste   Which is exactly what EIP-1559 is designed to fix. Fees should come down to match actual demand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.953703703703703
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#19",
                    "likes": "4",
                    "time": "18/02/2021-20:55:25",
                    "content": "I think it’s a good idea for Maker to signal in support of eip1559. Adjusting the fee mechanism may help reduce risk of disorderly liquidations - it makes it prohibitively expensive for miners (or others) to corner the fee market, and offers extra block space supply elasticity during spikes in demand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#20",
                    "likes": "1",
                    "time": "18/02/2021-21:35:55",
                    "content": "I think @cmooney raise an excellent point. The miners we need are priced out. But this is not related at all to EIP-1559. My understanding is limited but the fees from minting are fixed in ETH while those from fees are more volatile. But you can expect a baseline of fees over a long period. Today or soon, you can probably hedge the ETH price just like the McChicken & Ray Dalio. Whatever the fees are (minting + average gas costs), the mining process is a commodity. It means the largest miners (buying power) with the lowest energy costs increase capacity until it’s no longer profitable for them. Which is already unprofitable for 98% of the small competitors. You can double the average gas costs or burn all of it, the equation works exactly the same. EIP-1559 will remove some hash power but the increase of ETH price will add some as well. PoW is by design leading to mining concentration. This seems to be a serious problem that is not addressed (not sure I never thought about that before). Not sure PoS will change much. EIP-1559 is important to surf on the deflation narrative that will help to put ETH as a store of value in the eyes of the public until we solve scalability issues. And with PoS it would be good to kill BTC that is an environmental nightmare. PS: I have a feeling that TIP will be used almost all the time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.43295739348371
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#21",
                    "likes": "3",
                    "time": "18/02/2021-22:51:34",
                    "content": "    tvanepps:  2x block gas limit increases (under the “elastic blocksize” feature) are only temporary to accommodate demand spikes.   I don’t think that this is a safe assumption. With multiple AMM’s there are now legions of arbitrage bots working non-stop to smooth out price discrepancies between Uniswap, Sushi, 1inch, Balancer, Curve, and everyone else. Each new AMM increases network traffic by an exponential, rather than linear factor. High fees and high demand are the new paradigm for Ethereum, and increasing the block size only provides a short-term subsidy for traders until we’re back at the prices we’re at now. The market is telling us that it’s willing to pay these prices for transactions, and increasing the throughput will only increase the number of transactions on-chain until we’re back to our current rate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.622402597402597
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tvanepps",
                    "index": "#22",
                    "likes": "2",
                    "time": "19/02/2021-02:56:29",
                    "content": "This is not my assumption, more an extrapolation based on data. After 30 min of full blocks, the BASE_FEE grows exponentially to help smooth demand, at a certain point the arbitrage bots will find their profits eaten away and wait for the BASE_FEE to drop. I pulled a chart and a quote from last summer’s Deribit writeup by Hasu and Georgios.  State of extended congestion: It should be now clear that EIP-1559 allows for larger blocks for a short period of time, but not a longer period. After only 30 min of burst demand, the BASEFEE for a simple 21000 gas transaction will have surpassed $1000 (assuming initial BASEFEE = 1 Gwei). The only way for BASEFEE to return to more “normal” levels is for blocks below 10m to be mined.  image1218×664 83.8 KB ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.793956043956044
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#23",
                    "likes": "2",
                    "time": "19/02/2021-04:07:22",
                    "content": "Won’t that cause a lot of griefing of oracles? I could see another Black Thursday type event if it’s a lot easier to pump gas fees up. If we see another major market downturn, oracles will be frozen because gas fees will be insanely expensive as arbitrageurs and users run to DEXs/lending platforms to unwind positions. High gas fees won’t stop people from panicking and stop transacting to lower fees, it’ll cause even more panic no? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.055833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#24",
                    "likes": "0",
                    "time": "19/02/2021-11:05:12",
                    "content": "    SebVentures:  Whatever the fees are (minting + average gas costs), the mining process is a commodity. It means the largest miners (buying power) with the lowest energy costs increase capacity until it’s no longer profitable for them   You can’t just buy more ‘local’ power without increasing marginal cost. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#25",
                    "likes": "0",
                    "time": "19/02/2021-11:42:33",
                    "content": "    tvanepps:  After 30 min of full blocks, the BASE_FEE grows exponentially to help smooth demand   This is new to me. Happy to see and learn this. Do you have the equation? thx ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.107954545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#26",
                    "likes": "1",
                    "time": "19/02/2021-11:45:40",
                    "content": "    SebVentures:  Not sure PoS will change much.   The issue / challenge is how many people have 32ETH. No question that today it can be run from home… I hope it stays that way for the long-haul to avoid centralization. In my eyes, concentration of staking will only occur when there are so many shards that the local box just cannot keep up with the storage (and possibly networking) requirements. Today, I have the beaconchain (mainnet) running just fine a Raspberry Pi (and NUC). PoS most certainly fights against centralization (unless stakers decide to “just use” AWS). I would encourage everyone to run a validator. Ignore the economics for a moment, participation in the network help advance decentralization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.04047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tvanepps",
                    "index": "#27",
                    "likes": "2",
                    "time": "19/02/2021-18:40:13",
                    "content": "you may be misunderstanding. it’s not “easier to pump gas fees up” to get to an exponential rise of the BASE_FEE, there would also be paying users that have burnt ETH to get there. Meaning, there are real costs associated with manipulating the BASE_FEE, such that it would be prohibitively expensive to do so. The situation would be no different than in previous times of ETH volatility and spiking gas prices. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.533333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#28",
                    "likes": "0",
                    "time": "19/02/2021-18:41:47",
                    "content": "I’m not worried about miners pumping up gas fees, I’m just concerned about the increased possibility of extreme network congestion during panicky times. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/timbeiko",
                    "index": "#29",
                    "likes": "7",
                    "time": "19/02/2021-18:53:04",
                    "content": "The increase of the base fee is linear across -12.5%/+12.5% the previous block’s base fee depending on the gas utilisation of the block (between 0% and 200%, the max allowed post-1559). In other words:  If blocks are 0% full, the base fee goes down 12.5% compared to the previous block’s base fee; If blocks are 100% full (i.e. gas used == target gas limit), the base fee stays the same; If blocks are 200% full (the max allowed post-1559), the base fee rises 12.5% compared to the previous block’s base fee.  With a 12.5% increase/decrease & ~15 second block times, it takes roughly 5 minutes for the base fee to rise/lower 10x, 10 mins for 100x, etc. EDIT: just learned I’m capped at 3 replies per topic because I’m new here. If you have more questions for me, please hop in the #1559 discord and I can answer them there  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.668049543049543
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#30",
                    "likes": "2",
                    "time": "19/02/2021-18:55:40",
                    "content": "Thank you! I wish this concise response was circulating in twitter! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#31",
                    "likes": "5",
                    "time": "19/02/2021-19:00:17",
                    "content": "    timbeiko:  EDIT: just learned I’m capped at 3 replies per topic because I’m new here. If you have more questions for me, please hop in the #1559 discord and I can answer them there   Fixed. Stay as long as you want  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.857954545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/uxt",
                    "index": "#32",
                    "likes": "4",
                    "time": "20/02/2021-10:00:27",
                    "content": "Regarding the effects of mining concentration from PoW - it’s not entirely clear what is optimal. Having too much centralization is definitely very bad, but there are also diminishing returns on decentralization. Ideally, we’d also like participants that have a lot invested in the system, such as their career and multi-million dollar facilities. These two properties exist virtually, by design, in most DPoS systems, as well. An acceptably decentralized number of validators is targeted, and validators wishing to compete (along with their delegators) must put money on the line to prove their commitment. I’m still not entirely convinced PoS will be able to compete with PoW from strictly a security perspective. There are many edge cases to consider, and compromise is usually permanent, barring a coordinated manual intervention fork. That said, security should only exist to serve a goal. And what is the goal of Ethereum? I do not see it as the ultimate store of value, nor do I think it can compete for such a goal. Such a goal implies being conservative, simple, and highly secure. Ethereum is adaptive, fast moving, even experimental at times. It strives to unlock functionality, and ether is the use-token that is meant to be used for interaction. Because of this nature, I think it’s best left slightly inflationary, despite that I’d personally profit otherwise. Inflationary money is typically spent more easily, and that environment attracts more applications. I do think the adaptive block sizes in EIP-1559, and PoS/sharding from Eth2, are all great fits for the protocol, though. And @brianmcmichael makes an excellent point that MakerDAO would probably prefer deflationary collateral. So perhaps it’s worth accepting regardless. Does anyone understand why the controversial burning clause was included in EIP-1559, rather than as a separate proposal? Functionally it seems a fixed fee with dynamic blocks should be entirely possible without the burning. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.061616161616161
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#33",
                    "likes": "5",
                    "time": "20/02/2021-14:36:55",
                    "content": "    uxt:  Does anyone understand why the controversial burning clause was included in EIP-1559   Yes, it enshrines ETH as an unavoidable token in the network. If the base fee wasn’t burnt (status quo) then miners could collude with people submitting transactions to get those transactions mined for 0 ETH and some other token exchanged via back channels. I have read that this has already happened on-chain, but I don’t have an example to point at. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tvanepps",
                    "index": "#34",
                    "likes": "4",
                    "time": "24/02/2021-16:44:43",
                    "content": "Bumping this thread to hopefully get a few more people to weigh in. Thanks everyone for the discussion, I’ve enjoyed the questions. The 1559 Community Panel livestream will be Feb 26 at 9:00 ET / 14:00 UTC, you’re invited to join the livestream here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#35",
                    "likes": "9",
                    "time": "25/02/2021-19:12:36",
                    "content": "Poll is now closed, it appears that the community is strongly in favour of EIP1559. There are a couple of suspiciously new accounts, but nothing that would change the outcome. As detailed in the OP, I will also put this on-chain on Monday 1st March. That on-chain poll will conclude on Thursday 4th March. Thanks to all who voted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.069696969696969
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#36",
                    "likes": "2",
                    "time": "26/02/2021-08:33:04",
                    "content": "This article by F2Pool is quite insightful on the matter in my opinion: Staying on the (b)right side of history: EIP-1559 | by F2Pool 🐟 | Feb, 2021 | Medium ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#37",
                    "likes": "4",
                    "time": "26/02/2021-15:12:13",
                    "content": "    psychonaut:  This is weird logic. If the cost of transactions increase then, eventually, demand will decrease. I don’t see how EIP 1559 affects transaction costs. Transactions costs are purely a function of demand for transactions. Moving low value traffic to level-2 is the way to reduce level-1 congestion.   We don’t really know what will happen to demand, as our users are not the only ones using the network.  I agree that higher costs will likely reduce demand, but let me elaborate on the real point I wanted to make about our users. gas * gwei = tx cost Since gwei is ETH, if we increase the cost of ETH, then we increase the cost of gwei, thus increasing the cost of a transaction.  The more expensive transactions are, the more users get priced out of the network.  Therefor, an increase in the price of transactions will lead to less user participation in Maker.  At very least because we will need to increase the dust as transactions get more expensive and auctions cost more to clear.  Less participation in Maker isn’t just abstractly bad, we need market participation to balance the peg, and the more distributed this participation the better for risk. I will also point out that, we do not currently have an L2 strategy that is beyond the idea phase.  Perhaps a more deflationary ETH that leads to higher transaction costs will make L2 our number one priority, but I believe deflationary ETH will hurt us before it helps us. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4581904761904765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#38",
                    "likes": "4",
                    "time": "27/02/2021-01:45:06",
                    "content": "“New analysis finds EIP-1559 will cut miner revenue by at most 20-35%” --@hasu ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#39",
                    "likes": "8",
                    "time": "05/03/2021-15:28:37",
                    "content": "Looks like EIP-1559 has been accepted for the London fork scheduled for this summer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#40",
                    "likes": "0",
                    "time": "05/04/2021-01:29:23",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3301"
}