{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - CAT (ShuttleOne Credit Application Token) - September 21, 2020",
            "index": "3633",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "41,750",
            "highest_fraction": 0.97
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/cat-mip6-application-credit-application-token-cat-global-supply-chain-financing-shuttleone/3633",
            "title": "[CAT] MIP6 Application - Credit Application Token (CAT): Global Supply Chain Financing (ShuttleOne) ",
            "index": 3633,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/shuttlenaut",
                    "index": "#1",
                    "likes": "7",
                    "time": "11/08/2020-09:35:23",
                    "content": "Overview of System 1. Who is the interested party for this collateral application? About ShuttleOne ShuttleOne is a digital asset blockchain infrastructure company that builds systems that support governments, institutions and business to business platforms. ShuttleOne services the Southeast Asian region in remittances, microlending and trade financing. Founded in Singapore in 2018, ShuttleOne has built a network of fiat on/off ramps for digital assets across Southeast Asia and China. About Global eTrade Services (GeTS) Global eTrade Services (GeTS) is a subsidiary of CrimsonLogic. Its mission is to power global trade connectivity by making trade more accessible, predictable, and easier to fulfil. The company has linkages to 61 Customs nodes across the world, with more than 175,000 connected parties and conducting 24.1 million transactions annually. GeTS has a suite of logistics, compliance, and financial products under its wing. Products and services include CALISTA, TradeWeb, OTB, and many more. CALISTA™ is a global supply chain platform that brings together the key regulatory and financial activities of logistics in a digital ecosystem. For certain trade routes, GeTS have visibility and control of the entire supply chain. GeTS achieves this with its service coverage and strategic port partnerships. Applicants Shuttle One Pte Ltd Lim HongZhuang CEO Keith Steven Muljadi Board Non-Executive Director  2. Provide a brief high-level overview of the project, with a focus on the applying collateral token  CALISTA™ powered by ShuttleOne Bringing together both digital logistics prowess of GeTS’ flagship product CALISTA and ShuttleOne’s ecosystem, ShuttleOne’s defi infrastructure supports CALISTA Finance by way of financial risk management in a A.I powered credit scoring for the financial and business viability of merchants in the supply chain with financial data. ShuttleOne maps the fiscal health of the merchant applying for a loan alongside port operations data to get a complete picture of the business viability of these merchants in asset based cargo movements utilizing a mix of NFT and ERC20 Tokens that provides onchain and offchain management of trade financing and operational oversight. Merchants are able to apply for a loan anywhere globally where GeTS has port and custom linkages. So far, CALISTA Finance powered by ShuttleOne has serviced more than 30 over merchants in 2020 within Southeast Asia and China in over US$300,000 of trade financing. Port Operators can verify goods’ and trades’ legitimacy (i.e physical checks on cargo in storage awaiting shipping). This is achieved by strategic partnerships with port operators globally. The data GeTS possesses provides oversight of cargo movement and powers financing decisions. Financiers have greater confidence to finance trades that they have sight over. Trade data is also used within financier’s credit assessments. This provides them with a deeper understanding of borrowers from not only financial data but also alternative operational data. This sharpens their risk management of credit disbursement. CALISTA Insights also provides trade-related data to empower lending decisions. On-Chain Risk Assesment: Risk Assessment Token (RAT, ERC721) During the process of risk assessment and verification of cargo, ShuttleOne captures basic merchant information and tokenizes the merchants’ financial data and port operational data into a non-fungible token in RAT. RAT tokens data are stored on chain and can be easily verified by parties within the supply chain logistics platform from operations to finance.  Data Captured: Master Bill of Laden Customs Declaration Packing List Agent Agreement Buyer/Seller Details Invoice of Cargo Other Logistics Operational Data  Compliance in Finance   Credit Model Methodology Standard Scorecard The hypothesis of the credit risk weighted model is as follows:   At any given random day towards maturity, the borrower has predicted ability to repay the trade financing   The methodology is a statistical model to predict quality outcomes of   a. Default b. No-Default  Operational Data combined with Credit assessment of merchant provides an all round analysis of fiscal performance of credit and scoring  Let be the probability that the event occurring where , the the odd ration can be defined as Odds= p/(1-p) Therefore, the credit risk weighted model is as follows: log⁡(Odds)=β0+β_1 x_1+⋯+ βnxn The Weighted Evidence (WE) is utilized by applying operational data correlation using the Kolomogorov Smirnov (K-S) as a performance measure against standard deviation of the calculated parameters given a coefficient for confidence that risk governance will decide over a given period of time. Thereafter, the score card can be calculated with the following: Score=A-B*log⁡(Odds) Score=(A-B* β0+∑(-WEi *β_i) Where  Β -operational data regression coefficient of data attributes β0-operational data regression intercept WE-Weight of Evidence value for the given operational data  Operational Data is collected via platforms of operational partners where correlations between operational data of merchants are scored alongside standard deviation of cash flow analysis and weighted into a score percentage of a maximum of 1000 basepoints as a form of risk management combining not only credit cashflow analysis but also operational data of merchant in assessment for risk. Aside from financial data and port operational data utilized for risk assessment, ShuttleOne also ensures process control and assessment to compliment these on-chain assessments as described below under Section 8. The Applying Collateral: Credit Application Token (CAT, ERC20) Merchants’ data as risk assessed above are thereafter issued CAT token(s) according to the invoice of cargo requesting for credit. The applying collateral is the Credit Application Token (CAT). It has the following metrics: Addressable Yearly Cargo Assets: US$800mil Average Yearly Interest Rate (APY): 9% APY Trade Finance Tenure: 30 Days - 60 Days Estimated Average Trade Financing Ticket Size: US$50,000 [UPDATE ON ADDRESSABLE MARKET SIZE WITH NEW PORT OPERATOR 18 Aug 2020]  image800×450 9.09 KB   3. Provide a brief history of the project  3.1 Overview of GeTS main products and services     Product and Services Overview     CALISTA Logistics Provides services such as freight booking and freight management…   CALISTA Freight eXchange A marketplace to connect buyers and sellers for freight forwarders   CALISTA P!ng Track and trace of goods   CALISTA Finance Powered by ShuttleOne Provides services such as cross-border payments, trade financing, and business insurance.   CALISTA Compliance Facilitate trade declaration, import, and export permit applications to Customs authorities globally.   CALISTA Insights Flexible middleware that provides instant access to trade, logistics, freight data that businesses can use for insights.   TradeWeb™Live! A platform that facilitates permit declaration to Singapore Customs.   OTB Permissioned blockchain for industry partners and networks to improve visibility and security.    CALISTA Logistics Freight Booking allows users to check shipping schedules, book, and manage freight services for FCL, LCL, and multi-modal services (provided by Carrier/NVOCC).  Shipping Instructions facilitate filing of Shipping Instruction. This is achieved with cargo details and requirements for physical transportation. Companies can submit Shipping Instructions to Carriers and view the draft Bill of Lading.  CALISTA Logistics also covers haulage services. Firms can make haulage service booking through confirmed Freight Bookings.  CALISTA Freight eXchange CALISTA Freight eXchange facilitates RFQ, booking, invoice management and verification, and online payment. It is a marketplace of logistics service provider listings.  CALISTA P!ng CALISTA P!ng provides end-to-end visibility on cargo movement and status. Users can receive timely alerts and notifications for prominent events. This enhanced visibility enables better planning and management of cargo and downstream processes.  CALISTA Compliance CALISTA Compliance digitalises the filing of trade compliance documentation. Users can submit compliance-related documents such as Shipping Instructions on the platform.  TradeWeb™Live! TradeWeb is an integral part of GeTS’ compliance coverage in Singapore. Customers can streamline their cargo declaration process using TradeWeb™Live!. TradeWeb sends declarations to the Singapore Customs and other controlling agencies directly… Users complete their permit declaration on the platform. They can declare all kinds of permits, from imports, exports to air, land, and sea permits.  CALISTA Finance Powered by ShuttleOne CALISTA Finance Powered by ShuttleOne takes advantage of the blockchain for basic financial services in trade financing and value transfers.  ShuttleOne was a connection into CALISTA to enable CALISTA Finance with partnered terminal/port operator in Singapore operational processes in ASEAN. 3.2 Goals  Utilizing alternative port operational data to improve credit scoring for merchants Collateralizing cargo assets onto the blockchain complying with strong offline operational processes to safeguard defaults Perform remittance/pay transactions in cross border trade financing in a compliant manner in digital assets Operationalize Computer Vision, Algorithmic Credit Scoring to automate Financial Risk Management   3.3 Performance Summary  ShuttleOne conducted businesses in ASEAN wide between May 2020 - July 2020.  Countries   China Thailand Malaysia Singapore   Total Merchants Interacted  50  Average APY on Loans  12% APY (0% Default)  Total Loans Disbursed in Digital Currency (Dai)  US$143,432 (ShuttleOne) US$6,636 (Institutional) US$30,000 (Third Party Deposits) [UPDATE ON ON-GOING TRIALS 18 AUGUST 2020]  image800×450 10.5 KB   4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.   Linkages of CALISTA systems into ShuttleOne   Initiation of Trade   Trade documentation is uploaded into the ShuttleOne systems by port operators   Export of Goods   ShuttleOne gets a signal within the cargo trade systems that cargo is prepared and ready for export   Completion of Trade   Cargo Systems Signals Payment has been made to ShuttleOne’s fiat off/on ramps and merchants repays smart contracted loans via Collateral Manager   GitHub: Codes & Repositories Risk Assessment Token: RAT Contract Credit Application Token: CAT Contract  5. Link any available audits of the project. Both procedural and smart contract focused audits.  We are currently undergoing audits via various government appointed ministries. On the blockchain front, we’re also undergoing code audits with several prominent code auditors in the blockchain space.  6. Link to any active communities relating to your project.  ShuttleOne Telegram ShuttleOne Twitter  One Stop Information on ShuttleOne  7. How is the applying collateral type currently used?  The CAT token provides on chain visibility to the amount of risk assessed trade finance that is being requested for within the ShuttleOne infrastructure. The CAT token has these characteristics: CAT Value: Hard Pegged 1:1 to Dai (Issued 1:1 based on Cargo Documentation) Token Type: ERC20 Token Supply: Based on Credit Application for Trade Financing Backed By: Cargo Assets Against Bill of Lading The CAT token is used as an onchain representation of debt based on cargo in transit for trade financing.  8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?  The collateral’s responsibility resides and is reinforced in the countries that the borrowers reside in. Typically these are B2B merchants applying for a loan in their local jurisdiction(s). To work with cross border trade financing, ShuttleOne has signed agreements and operational partnerships with the relevant port operators to confiscate collateral for and begin liquidation should there be a case of default. The Off Chain to On Chain Overview is as follows:  The off chain legality of control resides in a partnership with the Collateral Manager (port operators) and ShuttleOne. The Collateral Manager assumes the role to confiscate goods and liquidate should there be a default.  9. Where does exchange for the asset occur?  The exchange of the asset occurs within the dex of ShuttleOne (between funders and borrowers).  10. (Determined by Legal Domain Team) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  ShuttleOne is currently an “Exempt Status” company applying for the Digital Payments Licensing Act in the Republic of Singapore. We are allowed to conduct business (having notified the Authority) until our licensing is granted or rejected. Quote: “Please note that these entities are not licensed under the PS Act to provide the specific payment services, but are allowed to continue to provide the specific payment services. The exemption will cease after the specified period; or if the entity submits a licence application under the PS Act, on the date that the application is approved or rejected by MAS, or withdrawn by the applicant.” Monetary Authority of Singapore List of Exempted Companies ShuttleOne Legal Memoranda (Republic of Singapore) It is the view of our lawyers and application to the Monetary Authority of Singapore that our systems facilitate basic financial services in value transfers and trade financing as a technology provider.  11. (Determined by Legal Domain Team) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.  We’ve filed the following with the Monetary Authority of Singapore in our interaction with the Singapore jurisdiction amongst other more sensitive information. ShuttleOne AML Policy ShuttleOne Enterprise Wide Risk Management  12. (Optional) List any possible oracle data sources for the proposed Collateral type.  DAI Feeds (https://www.liquidityproviders.io/) Collateral Invoices (CALISTA & Cargo Trade Systems)  13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type.  We are sensitive to the type of cargo that we are financing (choice via HS CODE and Credit/Risk Assessment Models) we are building liquidators and collection agencies processes working closely with the port operators and our partners. Reason for the sensitivity, varying type of cargo requires different types of liquidators. At the moment we are focused on:  Medical Supplies Wholesale food supplies Commodities (Oil & Chemicals)  The type of liquidators for these above mentioned segment are:  Hospitals, Government Health Ministries Supermarkets Energy & Chemical Traders  ",
                    "links": [
                        "https://globaletrade.services/",
                        "https://www.crimsonlogic.com/",
                        "https://github.com/shuttle-one",
                        "https://github.com/shuttle-one/moneyprotocol/blob/master/RatToken.sol",
                        "https://github.com/shuttle-one/moneyprotocol/blob/master/cattoken.sol",
                        "https://t.me/shuttleone",
                        "https://twitter.com/shuttle_one",
                        "https://github.com/shuttle-one/flyshuttleone",
                        "https://www.mas.gov.sg/regulation/payments/entities-that-have-notified-mas-pursuant-to-the-ps-esp-r",
                        "https://github.com/shuttle-one/flyshuttleone/blob/master/Shuttle%20One%20-%20PS%20Act%20Assessment%20020620.pdf",
                        "https://github.com/shuttle-one/flyshuttleone/blob/master/ShuttleOne%20AML%20Policy.pdf",
                        "https://github.com/shuttle-one/flyshuttleone/blob/master/EWRA%20-%20Shuttle%20One%5B7079260v1%5D%20(1).XLSX",
                        "https://www.liquidityproviders.io/",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/49",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/3",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-6-wednesday-august-26-17-00-utc/3791",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-6-wednesday-august-26-17-00-utc/3791/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-13/4310",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-pt-br-portugues/4328",
                        "https://forum.makerdao.com/t/maker-relay-ep-14/4450",
                        "https://forum.makerdao.com/t/relay-ep-14-en-espanol/4457",
                        "https://forum.makerdao.com/t/maker-relay-ep-15/4574",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-en-espanol/4576",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-pt-br-portugues/4597",
                        "https://forum.makerdao.com/t/collateral-status-index/2231"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and scalability",
                        "Grants, funding, and resource allocation",
                        "Privacy, security, and risk management",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357612428893422
                },
                {
                    "author_link": "https://forum.makerdao.com/u/meltdem",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/08/2020-15:43:30",
                    "content": "thanks for this proposal @shuttlenaut - really interesting approach. tokenizing BoLs, LoCs, and invoices for cargos in trade finance sounds very appealing, but have some practical questions about collateral liquidation. what recourse is there and what is the legal channel in Singapore to resolving conflicts involving these types of assets? what authority sets or validates the value of the cargo re: secondary sale or liquidation, and do they provide any guarantees as to the 1:1 parity of CATs to $ recovered in case of default? would be helpful to get more detail on this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shuttlenaut",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/08/2020-16:19:38",
                    "content": "Thanks Meltem for these questions. I shall break down your questions to the following categories: 1. Legal Jurisdiction on Liquidation of Asset/Collateral & The Debt Collection Process As ShuttleOne is a Singapore based company. Should the borrower reside in Singapore’s jurisdiction. It is fairly straightforward in terms of legality to pursue the borrower in a case of a default. We’ve partners that deals in these process of debt collection in a compliant and legal manner. Should the Merchant resides in cross border jurisdictions, Singapore’s court of arbritration has been the center of more international disputes. However, we have showcased that these are actually last resorts should we need to go to the arbritration courts. We believe our innovations in processes allow us to risk manage and debt collect easier. However when it comes to cross border jurisdictions, the legal process becomes a bit more tricky. Traditionally, the fragments in legacy finance causes this gap in financing. For example, a bank that is domiciled in Singapore usually do not entertain loans that originate from outside the country unless they have subsidiaries. Which generally in terms of such cross border trade financing, it is the work of investment banks (for e.g JP Morgan), but truly how many SMEs can be clients of JPM. How ShuttleOne tackles this tricky scenario is a partnership we’ve signed with global port operators. In our diagram above and i will pull it up here again this is the role of what we call the Collateral Manager.  On the Master Bill of Lading, should the cargo be the asset that is backing the trade finance, ShuttleOne and/or the Collateral Manager becomes the Consignee of the cargo. Which means to say, we are legally able to instruct the port to hold, release or confiscate the cargo upon a case of a default at any port of call/destination. This gives ShuttleOne and our partners onchain and offchain oversights of the cargo in transit and more importantly a relative risk reduced loan in cross border trade financing. Generally, the Collateral Managers are customs or port operators. Unfortunately, due to confidentiality agreements I am unable to represent these publicly. I do beg the community’s pardon for this. 2. The price discovery of the assets regarding Cargo in default In all our trade financing that we’ve done in the past 4 months, the borrower is needed to pay a 30% downpayment to the Collateral Manager and ShuttleOne and our funders will therefore facilitate 70% of the collateral value. This almost mimicks the ratio of collateralization in the Maker Protocols at this moment. This is a process and technological process internally when loans are applied for. This again, is not a process norm usually. Either the seller or the cargo gives 100% credit (in terms of cerdit terms) or the buyer needs to fund the cargo 100% BEFORE the cargo is delivered. Or what the industry terms will have it as “payment on sight of Bill of Lading”. Unless of course, you are a JP Morgan client. This becomes another financing gap/opportunity. SMEs before the pandemic already faces such a funding gap. What this means is that, should there be a default, the cargo (which ShuttleOne/Collateral Managers have control over till release upon payment) is financing the asset at a 30% haircut. Reducing the risk of such cross border financing value. Scenario Analysis: Price of Cargo: $100 Downpayment from Buyer: $30 Loan to Value: $70 In a case of default, we are able to sell the cargo within a band of $100 to $70 and the possibilities of recovering 100% of the LTV is high, we will not be able to provide any guarantees to the 1:1 ratio for CAT/DAI and it will be at a “best case” basis and liquidators/keepers vary from cargo to cargo. In summary, game theory will have it that if the merchant wants his cargo release, he pays up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520865633074935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/minhtamnv",
                    "index": "#4",
                    "likes": "4",
                    "time": "27/05/2021-07:02:28",
                    "content": "Hi guys, This is Tam from ShuttleOne. I would like to update a few milestones since our latest update: · ShuttleOne  has successfully financed the first batch of electric vehicles for commercial use in Singapore as part of the Climate Change Agenda. · The ultimate beneficiary of the commercial electric vehicles, SMRT is the operator of taxis, buses, motorbikes fleets in Singapore and is heading to change their entire taxi fleet into electric vehicles. The successful deal is a milestone for the decentralized finance community as one of the biggest and most progressive use cases of decentralized finance in real-world businesses. This is an example of the usecase of ShuttleOne Network in tokenize real-assets and financing services based on them. The details of usecase: https://medium.com/shuttleone/shuttleone-a-defi-blockchain-company-funds-the-first-commercial-electric-vehicles-in-singapore-8236da65f11 As of Q1 of 2021, CALISTA Finance - the finance solution powered by ShuttleOne, has serviced more than 4,000 merchants over US$3,500,000 of trade financing. Businesses are using ShuttleNetwork financing service as part of their capital management strategy: increase cashflow and inventory. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.386363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/minhtamnv",
                    "index": "#5",
                    "likes": "1",
                    "time": "30/06/2021-06:32:33",
                    "content": "**Will DeFi be the key to build platforms into its own economy? ** As ShuttleOne ecosystem grow into servicing global trade platform like CALISTA Finance. We see the potential for ecosystems like B2B and B2C platforms to grow and build their own financial services to service their users. In platforms where capital or cashflow could be an issue for acquisition. Building their own financing infrastructure ensures more successful deals for platforms As ecosystems grow, one of the biggest challenge to acquire more successful deals within the marketplace or between users and the service provider will be financial solutions. When a client faces difficulty in paying or getting credit for the payment, the successful rate will fall. For services that require a bigger amount of capital or cash flow, users need to find solutions outside of the marketplace, like looking for government grants or bank loans. Sometimes, if the issue needs complicated solutions to solve, the deal mostly falls through. E-commerce platforms are the master of increasing the platforms success rate. Their check out processes are purposely made so fast and easy, so customers don’t have a lot of time to rethink their decision. DeFi has unlocked the door for fast and easy financing service where anyone can access a loan within 10 minutes. What if DeFi can be integrated into platforms as payment or loans? In Asia, we call platforms that build and provide their own financial services to their ecosystems “super apps”. Looking at the successful cases of “super app”, Wechat and Alibaba in China, or Grab and Gojek in South East Asia, we can find a common theme: the key to make an app become highly recurring and extremely useful for their users is to remove the rigid payment through seamless solutions**.** If you go to any Chinese consumer target stores, the most popular payment methods are Alipay and Wechat. Grab is also trying to push GrabPay as a standard payment method in Southeast Asia markets. Super apps also can take a step further and remove the cashflow hurdle for its users by offering loans and credit. In China, Alipay and Wechat dominate the market, the applications also offer microloans to its users to borrow small amounts to pay for food delivery or hotel booking on its apps. DeFi will be the key for platform-owned financing service  Solving the payment issue  Gojek, an Indonesia ride-hailing startup faces the payment issue when they intend to expand their services to various markets. Users in one market cannot seamlessly pay for the service when travelling to another country. The reason for this difficulty is the fragmentation of payment services in Asia. Unless using regional payment platforms, Gojek needs to onboard a local remittance vendor for each market. Blockchain remittance is a financial solution that removes the rigidness in relying on central systems, exchanges or banks for payment. Instead of relying on its own resources to build a payment network, applications can adapt blockchain payment, like using DAI stablecoin as payment. It is secure, fast, low fee and innovative for cross-border payments, especially for platforms servicing in multiple markets.  Solving the cash flow issue  Advance, credit or loans are well-known methods to acquire a paying client. The decision-making process is one step faster for the client when they do not need to worry about coming up with the money at the time of purchase. That is why credit cards are a widely popular payment method for consumer applications. However, not all clients can get access to financial services. There are almost 80% of consumers and 65% of SMEs businesses are not getting access to financial services such as loans and credit. Decentralized finance (DeFi), a solution implementing blockchain technology, solves this issue by removing the gatekeepers and middlemen and connecting the ones in need of borrowing directly with the ones with capital power, using unbiased credit scoring and digital currencies as liquidity. ShuttleOne, using DeFi infrastructure, evaluate platforms data to assess credit score and build a sustainable risk and liquidation process based on the ecosystem. In global trade ecosystems, like GeTS, ShuttleOne can offers trade financing service by evaluating the trade invoices and commodities that can be collaterized for trade deals in wholesale, retail, e-commerce, transportation, etc. For default risk mitigation, ShuttleOne works with PSA (Port of Authority of Singapore) to control the moving cargo between ports and liquidate the asset in case of a default. Keep in mind that different ecosystems and industries will have different set of data and method to assess credit and mitigate risk. With blockchain, it is now possible for ecosystems to integrate  data into smart contracts and create their financing services using DeFi methodology. ShuttleOne bridge DeFi to platforms economies Speaking of that infrastructure, ShuttleOne is bridging ecosystems with decentralized finance resources. As an operating financial system enabling users to utilize platform data, the door is opened for platforms to provide their own financial services under the ShuttleOne umbrella. The option to extend such financial services to customers creates a more compelling ecosystem and ensures customers don’t have to look elsewhere. Keeping that in mind, the economic potential of ShuttleOne becomes more outspoken. Any investor lending liquidity to this protocol will be exposed to the potential of having major companies launching their own financial services. Currently, ShuttleOne is integrated with GeTS, a B2B global trade ecosystem that is servicing global trade businesses in 60+ countries. We estimate there are $58 million USD worth of trade financing that we can support within this economy. When ShuttleOne infrastructure is plugged into an ecosystem, we are immediately exposed to its existing economy and grow our user base exponentially. The question is: How do we increase enough liquidity to service these ecosystems. Tam: Hey guys, this is my most recent article on DeFi implementation into real-world. The article is written by me based on ShuttleOne’s approach in bridging DeFi to the real world and is featured on Thefintechtimes. We thought this is something that the Maker community will appreciate Let us know your thoughts on this methodology and would love to pick your brains on this topic. ",
                    "links": [
                        "https://sdgs.un.org/goals/goal9",
                        "https://thefintechtimes.com/super-apps-is-defi-blockchain-the-key-to-their-expansion/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.92917343073593
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#6",
                    "likes": "1",
                    "time": "14/04/2022-03:45:33",
                    "content": "Collateral Engineering Services (CES) is following up with Greenlit collateral applications that have been open for some time. I want to notify you of some changes we have made in the past month. If you are interested in continuing the collateral onboarding process, we ask that you update your application using the most current template, MIPs Portal. Note the current recommended guidelines for onchain collateral, MIP6 Recommended Guideline Metrics for Onchain Collateral Onboarding. Please reply within a week as to your intention. If we do not hear back from you, your collateral application will be marked as inactive and you will need to reapply. To reapply, please start with a new MIP6 application. The collateral onboarding process is documented here, https://collateral.makerdao.com/ Thanks CAT! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-recommended-guideline-metrics-for-onchain-collateral-onboarding/14503",
                        "https://collateral.makerdao.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.448347107438016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shuttlenaut",
                    "index": "#7",
                    "likes": "1",
                    "time": "15/08/2022-07:37:13",
                    "content": "Hi @monkey.irish i am the applicant for this which we were greenlit earlier in the vote. Since sep 2020, we’ve an emailserver issue which caused my access to the shuttle.one domain to be limited and therefore missed this update. As such, may i humbly request to restart the convo instead of reapplication as our real world financing has started to span APAC-ports, LatAM (in Q4 2022) while maintaining the current state of business with our partners here in Singapore. My new contact/email since Sep 21 is [email protected] do let me know and thank you for your consideration! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.070732838589982
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#8",
                    "likes": "0",
                    "time": "15/08/2022-16:21:05",
                    "content": "At this time, it’s best to follow the instructions in my prior post as to posting a new application. Instructions can be found here, Quick Start Guide - Collateral Onboarding Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.719696969696969
                }
            ]
        }
    ],
    "group_index": "2583"
}