{
    "poll_list": [
        {
            "title": "Change of Covenants for P1-DROP (Peoples Company Series 1) - November 15, 2021",
            "index": "11236",
            "option": "Yes",
            "supporting_mkr": "51,094",
            "highest_fraction": 0.51
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-p1-drop-change-of-covenants-for-p1-drop-farmlands/11236",
            "title": "[Signal Request][P1-DROP] Change of covenants for P1-DROP (farmlands) ",
            "index": 11236,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "rwa",
                "p1-drop"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "1",
                    "time": "27/10/2021-16:52:54",
                    "content": "The P1-DROP (farmlands) onboarding was approved by Maker Governance already. A DC of 0M DAI was set while waiting for the actual legal implementation. The latter was delayed by the result of the audit on New Silver. We receive updated documents from AEA that are under review by Shearman & Sterling. There is still some work to be done before increasing the DC. The initial risk assessment listed as an allowed investment :  Geographical limits: focus will be on Iowa but also include Illinois, Nebraska, South Dakota, Kansas, Missouri, Minnesota, Washington, Oregon Property acquisition price: mainly between $500k to $1 million, but with a full range from $250k to $1.5 million  We’ve got a request to increase this acquisition price up to $2.85M which would provide a MakerDAO exposure of 2M per farm. The expected Debt Ceiling is 20M and the TIN+equity tranche would be 8.5M. They also asked to add  Arkansas as a possible state. With @jameskmccall (who wrote the risk assessment), we don’t see those changes as significant and support to move forward.  Pros  Filling the DC more quickly Allow for higher monitoring focus on each property   Cons  Higher idiosyncratic risk exposure (notice that SolarX which was approved is 20M on only one property)   Poll    Do you agree to the changes in the covenants for P1-DROP as detailed in this post?  Yes No Abstain     0 voters     Next Steps This signal poll will end on Wednesday, November 10th, at which point if there are more ‘Yes’ votes than ‘No’ votes, it will move to an on-chain poll. ",
                    "links": [
                        "https://forum.makerdao.com/t/p1-drop-mip6-risk-assessment-alternative-equity-advisors-drop-us-agricultural-real-estate/8232",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439",
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-21st-october-28th/11262",
                        "https://forum.makerdao.com/t/consultation-poll-centrifuge-global-debt-ceiling-cap/11619",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/9",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-11-18/11713",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/maker-relay-ep-70-en-espanol/11569",
                        "https://forum.makerdao.com/t/maker-relay-ep-70/11528",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-28th-november-4th/11441"
                    ],
                    "GPT-summary": "The post is an explanation of a proposal to change the covenants for P1-DROP (farmlands) in order to increase the acquisition price and add a possible state. The author provides pros and cons and asks for feedback through a poll. The post also mentions the delay caused by an audit on New Silver and the ongoing review of updated documents by Shearman & Sterling.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.687200956937799
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#2",
                    "likes": "7",
                    "time": "27/10/2021-19:36:53",
                    "content": "I have very little trust in any of the current centrifuge setups. In terms of their legal setup and enforceability, and especially their tax setups, they are all failures. As deals they are probably decent (not considering their structure). Overall they look great today, but we have no guarantees we are getting anything back if something goes wrong with the relationship, the legal structure, the taxation etc. The entire concept of how a liquidation would occur has never been tested. At least the other centrifuge deals can be unwound and restructured as they are relatively short term and liquid, and we can get this done before anything goes wrong with them. But in this potential deal we’re chaining ourselves to illiquid land in a terrible structure. I have no confidence we would get the money back we throw into this if anything goes wrong, and 5 years or however long it is, with random actors we know nothing about, is a very, very long time for something to go wrong. In the interest of protecting MKR holders from pointless losses it’s crucial we reject this deal, either at the forum stage or at the MKR voting stage. We can’t allow this kind of low quality collateral to go through just for the sake of having something happen on the RWA front. edit: toned down the language and yes theres a lot of pent up frustrations behind this post, which makes it seem very sudden. But while working in the Foundation I have not been able to comment on the quality of the centrifuge structures and have had to watch as we walked into these problems that will take a lot of time and energy to get out of in the future… So at least I will do what it takes to make sure we don’t sleepwalk into an even bigger problem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.643729575163399
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "1",
                    "time": "27/10/2021-20:04:29",
                    "content": "Is there any enhancement to the liquidation mechanism? If I recall, the borrower would have several years to sell a property, but the property itself is not actually collateral (just the revenues from it)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#4",
                    "likes": "2",
                    "time": "27/10/2021-22:25:20",
                    "content": "The proposed changes from that which were voted on by the DAO and  passed are de minimis. one adding Arkansas and the other a small increase in the per asset loan amount.   This is not an invitation to bork the entire deal.  The worst thing that can happen IMO, is to keep changing the parameters and appetite for risk every 6 months.  That is not how long-term projects work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 3.28125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "6",
                    "time": "28/10/2021-09:20:24",
                    "content": "This signal request is about changing the covenants and is not related to the collateral onboarding. Creating a new one is probably a better way to signal that MakerDAO wants to renege its commitment. @rune is not providing any argument beyond “I have little trust”. You used words like “kill”, “trash” and “abomination” in public settings. This is quite remote from scientific governance and not what I would like Maker standard to be. AEA trusted MakerDAO that the governance poll was serious. AEA is trusting MakerDAO to keep the peg in the future. How can MakerDAO build this trust with such random behavior? Regarding the legal setup, if you took the time to ask (or read RWF reports) you would have seen that we are working to use the RWA Foundation to provide clean legal ownerships of the DROP. I also had a meeting no later than Monday with Shearman & Sterling to evaluate the possibility to have a security interest in the SPV membership (i.e. ability to get control of the SPV in case of breach of some conditions, something we steal from the SolarX case). Those 2 things would fix 99% of your concerns (assuming I get them right). Centrifuge is also doing serious work on their side. No one says it is easy, but dismissing the work is not fair. @PaperImperium that’s still the case, The facility is for 5 years and then they need to use their best effort to sell it. After an additional 1.5 years, the independent manager can remove them and appoint another servicer. This was negotiated before MakerDAO had the ability to exercise power (as not being a legal entity). This is something a RWA Foundation fixes. @Rune, if we want to be serious and go beyond complaining, insulting people and answering the wrong question in this Signal Request, I suggest we get a meeting with @spin (Centrifuge), myself (some GovAlpha members @LongForWisdom , @prose11 ?) to discuss what are your concerns and how to solve them. My DM are open on Discord. My understanding is that you have enough MKR to influence significantly votes. Having a better clarity on your intentions would help avoid wasting time. ",
                    "links": [
                        "https://forum.makerdao.com/t/my-response-to-unacceptable-behaviour/17028/21"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.12659632034632
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#6",
                    "likes": "1",
                    "time": "28/10/2021-09:51:07",
                    "content": "I did not intend to get into the nitty gritty on RWA just yet, but now that there is an attempt at ramming this deal through I have no choice but to focus on it. I hoped I could have first spent more time on introducing the broader concepts in more detail first and gained consensus around things such as the critical importance of separation of powers for decentralisation and risk minimisation - which will help shed light on why this deal is so bad. Just want to clarify that in principle I don’t have anything against centrifuge, peoples company etc. I believe it is possible to create a process where we can continue to work with them in a way that is constructive and considers the interests of MKR holders, and in want to emphasize that in particular centrifuge are valueable partners that have helped trailblaze RWA in Maker, and they should be rewarded for that effort. That doesn’t change that every RWA deal has to be optimized and structured for the benefit of MKR holders and Dai holders, and what we are presented with here is something I am very strongly against (as you can tell from my reaction). Will follow up shortly ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6535714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#7",
                    "likes": "4",
                    "time": "28/10/2021-10:27:14",
                    "content": "I apologize to everyone involved for the strong language and emotional reaction. The centrifuge deals - but especially this deal in particular - has caused me a great deal of stress while I was working in the Foundation and could only passively observe what was happening, while being unable to provide any sort of input on them and what I perceive to be fundamental problems with them that need to be fixed before they have any chance at becoming positive EV exposure as Dai collateral. In my opinion the existing centrifuge structures are already problems that need to be damage controlled, and will be complicated and distracting to fix - the prospect of then sleepwalking into making that problem significantly worse with this deal here simply made me panic. Overall I still think we are better off because of the momentum New Silver created for us, and we now have quality trustee-based solutions like the 6s capital vault that about to start scaling. While it will take some effort to fix the situation we will be in a great spot once we emerge on the other side. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.580176767676768
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#8",
                    "likes": "2",
                    "time": "28/10/2021-14:24:36",
                    "content": "I think or at least hope that after a meeting with @SebVentures you would feel more comfortable with the structure and legal protections and underpinnings.  I have also had questions on the “strategic” foray of the DAO into real world assets, but my concerns are probably slightly different.  I have, with our small company, originated and serviced 3B in agricultural loans secured by agricultural real estate.   It is a great investment asset class, but it is specialized and requires its own skillset and expertise and to date, we have managed to accomplish our originating without the secured lender losing its P.  Through the years, now going on decades, I have seen “lenders” and “investors” come into the space and talk about how they want to scale to billions.  Maybe they even make a few loans.  There is nothing more damaging to both the borrower “the farmer” and the lender than trying to put a short term investment horizon into a long term investment.  Whenever a lender “changes its mind” it is the same as a “rug pull” where the lender tries to fire sale its investments, and the farmers have to find a new lender under duress. The typical underwriting process I have outlined above is simple and well traveled.  What makes underwriting to this particular SPV structure more challenging (to say the least) is actually MakerDAO itself and its inability to contract, or do the things that any financial party would be able to do.  In my opinion, these legal formalities are possible to mitigate and address.  There is no reason that I can think of, that having Centrifuge system, with a SPV can’t work, but I guess we can wait and see what the lawyers come up with. My issue is that it appears that after approximately a year of various players going through the DAO process, AMA’s, DAO signalling, risk analysis, risk mitigation, negotiation, MIPS, legal review, etc. we are now taking this opportunity to shoot from weeds, when any concerns could have been addressed in about 20 other times in the process.  Personally, I think it can be argued, that having a claim on a payment stream from real property assets like farms is much more tangible and less likely to volatility than certain bets on magical internet protocol governance coins. Alas, time will tell, I guess.  I felt this was somewhat of an ad hominem attack and feel it necessary to address even though I am still uncertain of the specific concerns other than some hand wavy concerns about legal structure.  This is somewhat of an experiment in DAOs and governance and smart contracts, and attempting to wire a blockchain system to a meatspace legal system.  There are no sure fire answers, as we are building the bridge while we walk across the river. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.499819624819625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "2",
                    "time": "28/10/2021-14:40:11",
                    "content": "Going to weigh in a bit because I was flagging these a bit early on mostly due to concerns expressed to me by parties I trust.   The concern was predominantly over chain of custody on assets and exit clauses.  At some point @SebVentures finally did a review which flagged a number of issues in the Centrifuge Tinlake structures - which are in process of being corrected. My take has been small stuff the protocol can handle but as these things get larger we need to reign them in.  The idea 1 year ago was the protocol needed to do ‘something’ small even if not ideal so we could develop RWF infrastructure.  1 year later and we are approaching a point that infrastructure is developing and now we need to make some decisions. I am still waiting for a satisfactory Centrifuge clean-up restructure that satisfies the issues @SebVentures raised. I totally understand these comments here:     jameskmccall:  My issue is that it appears that after approximately a year of various players going through the DAO process, AMA’s, DAO signalling, risk analysis, risk mitigation, negotiation, MIPS, legal review, etc. we are now taking this opportunity to shoot from weeds, when any concerns could have been addressed in about 20 other times in the process.   Hence I empathize with the frustration here.    There is both a balance of protocol risk, and go-head follow through that has to be weighed here and I really want a risk, RWA assessment regarding multiple issues here.  Is the centrifuge structure something we can grow to B’s? Is it scalable in current incarnation because from what i am seeing we are seeing these centrifuge vaults going piecemeal - I don’t see how we clearly scale. When I see @SebVentures raising issues with structure I want to flag this entire class at a max DC of 50M and they can decide how to play within that until governance and the CUs come into line with a clear direction forward for the next 12 months.  A go no-go type assessment where the no-gos come out as a list of actionables or reasons to be a no-starter that can’t be fixed.  The problem here is we have already gone ahead and in the past I have been repeatedly told that pulling back on stuff we have already done is difficult at best.   Hence would urge @rune to factor this into thinking.   Maker can take on a few couple million projects and we can just limit the DCs to limit damage.  Kind of a half-way - half-assed approach to making no-one happy but everyone satisfied. I really want to have a serious discussion about whether centrifuge as it sits constructed or will be fits the scaling model to B’s getting Maker to its goal of 1T of well collateralized DAI in circulation or whether this has issues getting to scale or wrestle out other issues here. Would be happy to set this aside as a RWF CC where we have governance players, legal, RWF CU, risk and possibly a PECO CU rep there to see if we can come to some sort of greater decision that leads to a longer term agreement to co-ordinate planning.   I just don’t like jerking around RWA players looking to utilize the protocol, and I don’t want to waste governance and RWF CU time if Centrifuge is no longer an ideal fit, or to fully push forward if it is. For now I am going to abstain on this simply because I don’t have good clarity on the issues here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.499007936507937
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#10",
                    "likes": "3",
                    "time": "28/10/2021-15:15:09",
                    "content": "Appreciate it, to me the issues are in this request are whether to add Arkansas and modestly increase the per transaction amount. What this poll, is turning into is a complete squeamishness over having a small portion of the assets be “illiquid”, with interest rate risk, and a different “contract risk”, that being the Centrifuge system, and the GORILLA in the room, is “should we be doing this at all?” Which honestly is fine.  The system is the MKR tokens get to decide these things I guess.   But it should be clear that they are also burning their credibility faster than makerburn.com burns MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "2",
                    "time": "28/10/2021-15:28:57",
                    "content": "    SebVentures:  @Rune, if we want to be serious and go beyond complaining, insulting people and answering the wrong question in this Signal Request, I suggest we get a meeting with @spin (Centrifuge), myself (some GovAlpha members @LongForWisdom , @prose11 ?) to discuss what are your concerns and how to solve them. My DM are open on Discord.   Happy to set up/facilitate such a meeting if the parties think it will be helpful. Think that convo should probably be moved over to Discord.  Would like to see this thread shift back toward the topic at hand. This Signal is currently pretty contested so it would be good to hear from people that voted what’s guiding their thoughts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.953703703703703
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#12",
                    "likes": "4",
                    "time": "28/10/2021-15:31:29",
                    "content": "    jameskmccall:  Appreciate it, to me the issues are in this request are whether to add Arkansas and modestly increase the per transaction amount. What this poll, is turning into is a complete squeamishness over having a small portion of the assets be “illiquid”, with interest rate risk, and a different “contract risk”, that being the Centrifuge system, and the GORILLA in the room, is “should we be doing this at all?” Which honestly is fine. The system is the MKR tokens get to decide these things I guess. But it should be clear that they are also burning their credibility faster than makerburn.com burns MKR   As a previous business owner here I am sensitive to these things which is why I tend to go for middle of the road here solutions.   I think we can find the middle of the road solution while MakerDAO decides the ‘whether we should be doing this at all’ go - no-go addressable/unaddressable concerns list. The Arkansas part I am a ‘support’ the amount seems to have grown here to what nearly 3M?   This is in a range that Maker could absorb with existing SB.   I mean I want to look carefully at the larger picture - global DC on all the Centrifuge assets if there is some existential question regarding the ‘class’.  I also really want to hear form all of you in RWF whether you see Centrifuge vault(s) scaling into the billions once this settles or will Centrifuge always be a small player and never hit 1B or beyond. I am looking at the 1T DAI mark and feel like we are just pissing around on 1-3M.  It is like my wife says - why do you even bother to spend 5min to save $1 when you are making $50-100/hr with investments.   Maker profits are what 1-2M/month net expenses we are quibbling over minutia vs. going after the bigger questions here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.009868421052631
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mamoore930",
                    "index": "#13",
                    "likes": "1",
                    "time": "28/10/2021-17:17:48",
                    "content": "Interesting discussion to say the least!  As a representative of the “random actor”, I would like to provide a link to a webinar that our affiliate, Peoples Company, is hosting regarding its just released 2021 National Land Values report.  This report features data-driven research on current farmland values across the U.S., trends that may impact future values, and practical stories from around the country.  It starts at 3pm Eastern U.S. time on Oct 28th.  It will be useful in understanding the high quality of the collateral involved in the transaction.  Here is the link to register for the webinar: Webinar Registration - Zoom. I hope you can attend.  If not, it will be made available on YouTube in the next few days. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party advertising proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.436111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mamoore930",
                    "index": "#14",
                    "likes": "0",
                    "time": "28/10/2021-17:27:50",
                    "content": "Here is a link also to the 2021 National Land Values Report: Industry Research | Peoples Company.  Enjoy! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mamoore930",
                    "index": "#15",
                    "likes": "3",
                    "time": "28/10/2021-18:03:54",
                    "content": "I would also like to point out that the transaction structure has been basically unchanged from initial discussions that started nearly 1 year ago and we appreciate that it was approved by the decentralized administration that governs Maker just a couple months ago.  It would be severely disappointing if the structure is changed at this point.  The critique of the structure is understandable…any lender would see that.  However, changing the structure to address the mentioned concerns might make this financing look like loans we can get from a bank of which there is no shortage.  We finance farm properties with banks several times each year.  The structural features of the DROP financing is what makes it appealing to us.  Offsetting the concerns raised about structure, is the fact that we have to keep 20% - 30% subordinated capital in each farm asset.  We will feel substantial pain before DROP tokens are impacted by any losses.  Also, we are a very experienced farmland investor, appraiser and broker and we manage farmland on behalf of some prominent investors.  We and our affiliate, Peoples Company, have been involved in farmland transactions since the 1960s.  Collectively, we are involved in well over $1 billion of farmland appraisals and brokerage transactions each year and manage over 50,000 acres of farmland.  These credentials are important to understand because this will help ensure we select strong assets, partner with strong farm operators as lessees and have the ability to sell farms as quickly as possible if a DROP redemption is requested.  In practice, we believe we can liquidate a single farm in approximately 90 days.  If a portfolio of farms needs to be liquidated, that may take longer.  Any asset portfolio would.  However, the farmland market is huge – a $3.1 trillion asset class with approximately 1% - 2% changing hands annually, or more than $31 billion farmland transactions each year.  So, liquidating $20 million to $30 million of farmland in an orderly fashion is nothing the market can’t handle. Lastly, we have always discussed this as a first evolution of a very interesting opportunity for us, Centrifuge and Maker.  There is room to grow this but I think we all expect to find problems or imperfections to fix along the way without impacting the value proposition vis-à-vis financing that can be obtained from banks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.972431077694235
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#16",
                    "likes": "1",
                    "time": "28/10/2021-19:16:05",
                    "content": "I would much rather gain users by undercutting the banks on cost than undercutting them by taking on weird risk I don’t understand. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#17",
                    "likes": "16",
                    "time": "28/10/2021-20:53:15",
                    "content": "I wanted to comment on the concerns that you brought up Rune. I am struggling make sense of your most recent response:     rune:  I would much rather gain users by undercutting the banks on cost than undercutting them by taking on weird risk I don’t understand.   Perhaps we can get past the hand waving and work on understanding what exactly these risks are together.  Centrifuge & AEA has shown readiness throughout this entire process to engage with the DAO and talk about how this deal is structured. As for the structure you talk about earlier in the thread, I want to respond with the following: We hear you and think we understand your concerns. We started together on this RWA journey when no one thought it was possible. We’ve shown that we can and want to work on improvements with the DAO to build out a safe legal framework for Centrifuge issuers, as well as our Investors including MakerDAO, to mint DAI and bring valuable collateral to MakerDAO. Our success with the first RWA Maker vaults is attracting more professional and established borrowers to DeFi and MakerDAO (e.g. Nebula & Monachil), and also arguably created positive externalities in terms of PR and others. Nevertheless, these early pioneers were doing the first transactions back when DAI was +/- 1% off the peg and they were +12mo into waiting for Maker to even figure out how to do a RWA collateral onboarding process with them. These startups had the confidence to try DeFi, Maker, and Centrifuge in the early days and paved the way for larger MIP6s both from partners using Centrifuge and others. I think this is aligned with the RWF CU strategy to focus on fewer but bigger RWA vaults, and partners who can provide scale. But how do we want to treat our early partners who trusted us to be able to prove that DeFi is not only working for the big shops but everyone? We think we have a moral commitment to creating something, which is not only cheaper but also better (much like Rune’s call to positively impact the environment by focusing on green assets). And to follow through on the plans we put in motion. First of all there is no Centrifuge structure. Centrifuge is a decentralized protocol to onboard assets, like a farm, as an NFT and have the entire fund administration on-chain. Fully transparent and including a first loss protection in form of the TIN tokens. The on chain tokenization framework is coupled with a legal framework that the issuers set up to ensure there is legal recourse. When we proposed MIP22 we made certain trade offs (much like single collateral DAI made tradeoffs to ship before MCD was fully matured over a year later). However, Centrifuge and all issuers using Centrifuge smart contracts I believe have proven to the community a readiness to keep working on it and work on this together. None of us think that the work stops here and in fact its still in going on. We have already made substantial progress and have a clear roadmap going forward:  In the case of P1-DROP (as well as the other RWAs), AEA (the Issuer) had already improved the independent manager arrangement ensuring better bankruptcy remoteness. AEA are well into discussions with 3rd party providers, who will act as fund administrators adding another layer of oversight. A third step is to engage a trustee for the assets. These improvements will be made in the coming weeks. We are currently discussing how to give DROP a security interest in the underlying assets, which will take a little longer. The RWF CU is involved here and we have a good way forward. Ultimately though, the RWF CU made a lot of progress with MIP58 RWA Foundations (MIP58: RWA Foundations) to give the DAO a direct claim and enforceability, and to address possible tax issues. At this point there will be slight structural differences between 6S trust setup and the setup that Centrifuge Issuers are employing but will offer similar protections to DAI & MKR holders.  From our side, we are going to put more effort into communicating the progress on this roadmap more actively with the community and will start posting regular updates in the forum. We are fully aligned here: no one is proposing raising any of the debt ceilings beyond a point that becomes a true threat for Maker and not scaling this up until more progress has been made on the above roadmap. Speaking as an MKR holder and long time community member myself, I would never support taking on risk that could irreparably damage both Maker & Centrifuge. I also wanted to second Seb & Prose’s offer of setting up a call where we can discuss these issues:     prose11:  Happy to set up/facilitate such a meeting if the parties think it will be helpful. Think that convo should probably be moved over to Discord.   I believe these are issues we can work through without destroying a year long project and endangering the reputation of the DAO.     MakerMan:  I am looking at the 1T DAI mark and feel like we are just pissing around on 1-3M. It is like my wife says - why do you even bother to spend 5min to save $1 when you are making $50-100/hr with investments. Maker profits are what 1-2M/month net expenses we are quibbling over minutia vs. going after the bigger questions here.   Thanks for your comments MakerMan overall. I wanted to address this one in particular though: I can tell you that we are talking to debt investors who have issued securities in the billions and are looking at the work we’ve been doing with Maker. And some of them are looking at how they could tap into Maker themselves. We should see these conversations come to the public forum soon. ",
                    "links": [
                        "https://forum.makerdao.com/t/mc-drop-mip6-application-monachil-capital-partners-lp-drop-senior-secured-credit-facility-for-a-private-credit-fund/8543",
                        "https://forum.makerdao.com/t/rwa-strategy-update-being-more-strategic/11078/21",
                        "https://forum.makerdao.com/t/mip58-rwa-foundations/9680"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.593148353839144
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Niall",
                    "index": "#18",
                    "likes": "3",
                    "time": "29/10/2021-11:48:09",
                    "content": "Fascinating thread. New here so excuse the basic commentary. The real world is illiquid. Crypto currently runs on digital rails for digital assets only. How can we reconcile these two basic facts? The question is off topic but I guess that is what we need to figure out. (I’m off to look in the other posts to see where that may have been answered. Great work @jameskmccall and team for pushing the boundaries. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.692234848484849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#19",
                    "likes": "0",
                    "time": "29/10/2021-13:46:59",
                    "content": "There are some really good points made here.  The market for loans is the same as any other market.  Institutions feel that they set the rate, but in actuality it is the market that sets the rate.  The rates on US farmlands are low.  The “DAO” accepted the MIP6 under the terms shared and if people don’t accept this “de minimis” change in terms, then what?  Does it go forward under the original terms of the MIP6? To me it is obvious that this is more to do with certain DAO members having a competing product to Centrifuge and looking to take this opportunity to throw shade.  I find it hard to believe that people have such a distaste for Arkansas farmlands.  I hope that if there are concerns or feature requests for the Centrifuge system to address these get added as feature requests and AEA doesn’t get caught in the crossfire. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.686309523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#20",
                    "likes": "1",
                    "time": "29/10/2021-14:35:20",
                    "content": "    jameskmccall:  I find it hard to believe that people have such a distaste for Arkansas farmlands   This has moved me to abstain. I disliked both the terms of this deal and the rushed process to approve it. I am also still unsupportive of increasing exposure to Centrifuge assets until the legal structure is upgraded (my understanding is that this is being worked on already). But in the narrow interpretation of this signal request— approve/disapprove of these covenant changes — I agree there is nothing in the changes that appears objectionable. Upon reflection, this request should probably not be the forum for debating substantive revisions to this deal, but do encourage further discussion that did not occur when this was originally pushed into a vote the first time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#21",
                    "likes": "1",
                    "time": "29/10/2021-14:43:09",
                    "content": "Yeah, it was premature on my part to get so triggered by this post. I interpreted this signal request as being about activating the DC of the structure, which I am against. Not that it would just change some stuff that is totally irrelevant as long as the DC remains at 0, which means it is effectively not onboarded as collateral. Fundamentally the way this deal is currently structured simply is not compatible with the interests of MKR holders. It’s not about liquidity or term length, it is how those things exercabate the issues of a structure that is not using state of the art best practices when it comes to enforcement and liquidation - which means doing it the way all the banks, and all the institutions have done it for hundreds of years, using senior secured credit positions held with top-tier trustees. There is no reason why this deal cannot be structured that way, using competitive terms. There is simply no universe where MKR holders should sign up to scale, or do anything other than PoC experiments, with suboptimal legal structures. It just doesn’t make any sense. We need to instead investigate how we can restructure this deal and other centrifuge-enabled deals in a way where it becomes appealing to MKR holders to take the risk on it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.2727272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#22",
                    "likes": "0",
                    "time": "29/10/2021-15:56:17",
                    "content": "This signal request appeared to me to be plenty self explanatory that it was regarding two small changes to the MIP6 that was approved by the procedures set out by MakerDAO.  There are plenty of hot shot attorneys that are going to “doc” up the deal and make sure that the structure is negotiated and protects the interests of the DAO and reflects the terms as negotiated. It is disingenuous at best to refer to SPV and trust structures that have been done for 100’s of years, as to some extent this is all novel.  There is no well traveled play book. With digital assets liquidations and oracles are live and completed on a per block basis.  This clearly has advantages and disadvantages.  Like recently Cream was exploited and it also appears that potential partner Aave is alleged to have a vulnerability that “could” have been exploited for Lord knows how much.  My point is that you appear to be arguing about the color of paint on a house, when building in an earthquake zone. I am perhaps reading between the lines, but I am going to guess that you have the solution?  Is it a proprietary one?  Does it require MakerDAO to incorporate somewhere? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.834710743801653
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#23",
                    "likes": "8",
                    "time": "29/10/2021-17:46:40",
                    "content": "Just had a really productive conversation with @spin about a path to how we can restructure the current centrifuge-enabled deals and provide better terms and scalable structures to future partners. I will be posting my proposal on what I call the Arranger Model asap, which is a way to standardize RWA to optimize for MKR holders concerns around risk and enforcement, making it possible to scale it to very high debt ceilings. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.756666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#24",
                    "likes": "2",
                    "time": "29/10/2021-20:28:37",
                    "content": "Thanks, look forward to learning about the proposal “Arranger Model” when it is published.  I am just really befuddled of the process and procedures of the DAO and can only assume maybe that there has been a shift of the power center of the DAO since the MIP6 risk assessment and MIP6 were published in June of this year.  I realize that with delegated powers maybe that has shifted the dynamic somewhat where the voice that did not have confidence in the Centrifuge model or the contemplated “trust” structure is able to flex.  I don’t know.  I really have only had the limited basis of doing a risk assessment on this one deal, and perhaps don’t see the governance mechanizations and the larger strategic vision. That said, my risk analysis was contingent on legal buttoning and due diligence.  It was also premised on what I thought the rough model for the real asset container, SPV model, Drip/Drop, etc.  Therefore I would request to the extent that this model is going through serious revision that the risk analysis is not relied upon either until I have at least had the chance to review these substantive and material changes to the structure.  It would appear that from the “no” votes in the signal, that appear to control large blocks of delegated and owned maker, that either large players in the DAO hate Arkansas or have no confidence in this structure, asset class, and model. I am disappointed, but understand that strategic visions of DAO’s can change and with that I guess they have the ability to take a second bite at the apple.  I know that all parties have had to put up with me, even though I am ornery we tried to get a deal that would protect and benefit all the players. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.829274891774892
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#25",
                    "likes": "3",
                    "time": "29/10/2021-22:37:01",
                    "content": "    jameskmccall:  That said, my risk analysis was contingent on legal buttoning and due diligence. It was also premised on what I thought the rough model for the real asset container, SPV model, Drip/Drop, etc. Therefore I would request to the extent that this model is going through serious revision that the risk analysis is not relied upon either until I have at least had the chance to review these substantive and material changes to the structure. It would appear that from the “no” votes in the signal, that appear to control large blocks of delegated and owned maker, that either large players in the DAO hate Arkansas or have no confidence in this structure, asset class, and model.   I’ll be the first to tell you that your Alternative Equities Advisors Assessment was impeccable and thank you, for the analysis you performed back in May. And as you mentioned earlier, the infighting we are witnessing within DeFi gets us nowhere. We woke up this morning to developments in DeFi that can harm the ecosystem, divide it, and take it to a blackhole with no escape. The recent $130M Flash Loan via Cream Finance has led to a Feud between AAVE and YEARN.  Do we do the same here, or prove to the world that we are united.  image892×1414 91.1 KB   And then… And then later today we got a $58M rug pull that some folks are alleging that it was orchestrated courtesy of the  team using an EOA. This has led to accusations between team members that this one or that one is responsible. All in all these events make DeFi look like  https://etherscan.io/address/0xb1302743acf31f567e9020810523f5030942e211 13,597 WETH Rugged  Together We Are Great Energy—Divided We Will Fall Apart. I don’t have the right answers on what is the right structure and how we should proceed with RWA Collateral types, but this is how I’m thinking about it. We must work together to find the right solutions for MakerDAO. The Maker Community has an appetite for RWAs,  therefore we must find the right structures that works for the benefit of the DAO. We must ALL understand and educate one another on what Real World structures best PROTECTS MKR token owners. A “No” Vote has nothing to do with disliking Arkansas. Go Razorbacks!  image666×598 52.6 KB  So ya, IMO there is nothing wrong with iterating on RWA structures–there is a need for checks & balances–there shouldn’t be a split within the community—we should ALL support RWA iterations. And yes, I know repeating a process is  painful—because we All wanted RWAs and honestly, so far not much has been executed. For now, RWAs have been a big disappointment. A promise with not much deliverance. The greatest performers iterated over and over. Let’s become the greatest performers by performing iterations of what can be the ultimate super power of MakerDAO RWAs. I look forward to the Arranger Model and hope that it will keep this community united. ",
                    "links": [
                        "https://etherscan.io/address/0xb1302743acf31f567e9020810523f5030942e211"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.649489795918368
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lex_node",
                    "index": "#26",
                    "likes": "8",
                    "time": "29/10/2021-22:52:14",
                    "content": "I’m not a regular contributor but the Centrifuge deals have drawn my interest periodically because of the legal engineering involved, and I thought I’d jump in here to remind people of some history and +1 @rune 's take from a legal perspective. From the start of MakerDAO wanting to do off-chain collateral, many people warned about the risks of off-chain collateral in general as well as the specific ways it was being implemented in this case. @Tosh9.0 made a series of brilliant posts breaking down the issues and highlighting the way they were being brushed under the rug with hand-wavey assurances. He was shot down for being “negative” even though he was asking exactly the right questions.  image1280×661 91.7 KB  Securitization is a well-trodden legal path; when handled by experts it will inevitably involve extensive third-party due diligence, including legal opinions regarding enforceability and separation of assets. I am glad to see that now at least a good law firm is involved, but legal due diligence only goes so far. More broadly, there is the issue that illiquid debt securities and asset-backed securities do not have their risks and value dynamically re-priced in a market, thus there is nothing to tell MakerDAO when the position is undercollateralized such that a liquidation should be triggered. Of course, there is also no liquidation mechanism because that involves off-chain actions (including possibly going to bankruptcy court in an insolvency scenario). Risks can be long buried, but in practice all these assets will just retain their “face value”…e.g, tokenized freight receipts could end up being valued at the face $ amount even though, unbeknownst to MakerDAO, the payers could be insolvent and, if there were such an insolvency, the receipts should be getting marked down dramatically. This is a set-up for people selling hidden risk to MakerDAO with little chance of such risks being accurately re-priced over time. Also, no lawyers can gap-fill for subject matter expertise like the correct way to price risk. In that sense, the process here is wrong–people selling the risks should never be the ones charged with due diligence and pricing, but that is basically what happens here because although I’m sure MakerDAO risk folks try their best, simply put they are not experts in pricing of things like tokenized fractional interests in freight invoices and farm land (and very few people are). The only subject-matter experts involved are the sellers of the risk and of course they don’t have the best incentive (though I understand in some/all cases they have some exposure to the riskiest tranche). For all these reasons, I think these types of deals are a risk magnet for MakerDAO. MakerDAO should focus on buying publicly traded bonds, treasuries, public company stocks, etc. where risk is less likely to be hidden, instead of these wonky types of illiquid assets that expose MakerDAO to tremendous information asymmetry and counterparty performance risks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.516895604395604
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#27",
                    "likes": "6",
                    "time": "30/10/2021-00:17:04",
                    "content": "I don’t entirely disagree, I was asked to help out for this reason.  We own and invest in farms, and my Dad was a field agent helping insurance companies place loans on agricultural real estate and now that is also my day job.  To help insurance companies and other lenders place loans on quality farm operations. I assume(d) the model might be more like what a University endowment might do.  Keep liquid up to a certain point, and also place money in high quality, longer term, less liquid investments.   My concern early on is that a DAO probably doesn’t have the mentality to stick with farmland through a down cycle. That said, I look at farms (especially in the corn belt)as a bond that pays its dividends in corn and soy.  There are advantages to corn dividends in certain economical environments.  But your point on bonds is interesting, as I have a distrust of them and generally avoid them at all costs.  But we all like what we are comfortable with.  Yes, the DAO should stick with what it is comfortable with, though I know that many insurance companies love agricultural investing for the very diversity that it brings. That said, my issue is never really about whether the DAO should or should not invest in agriculture.  It is just that they don’t appear to be following the very process that was set out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.976380262249828
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#28",
                    "likes": "0",
                    "time": "01/11/2021-14:39:56",
                    "content": "Wanted to bump this, as a reminder the poll ends on Wednesday. Currently vote is quite tight with the majority abstaining. Please lock in your vote before Wednesday if you’d like to influence this Governance process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.553571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mamoore930",
                    "index": "#29",
                    "likes": "3",
                    "time": "02/11/2021-12:43:17",
                    "content": "As you discuss a path forward…We have learned a great deal about DeFi and it seems to makes a lot of sense to use farmland as collateral for Dai or any other stablecoin because of its own stability as an asset class.  So, we remain interested in devising an approach and structure that works for all and are excited about the potential for this opportunity.  If it would help advance the discussions and thinking, we are available to have a live conversation about this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.5227272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#30",
                    "likes": "0",
                    "time": "12/11/2021-19:22:57",
                    "content": "Thanks to those who participated with the additional time provided. This proposal will be live onchain for a poll on Monday (2021-11-15). Voting will last for three days. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#31",
                    "likes": "4",
                    "time": "12/11/2021-22:03:04",
                    "content": "@mamoore930 Maybe recommend a live session with a pre-defined agenda. Due to the nature and heated debate, I’d recommend taking the time to collect some questions from the parties that expressed themselves here prior to such session. So we can have a proper thoughtful and constructive session, away from keyboards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.34280303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#32",
                    "likes": "0",
                    "time": "13/12/2021-08:03:35",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "257"
}