{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-brand-update-september-october-2022/18842",
            "title": "Maker Brand Update - September + October 2022 ",
            "index": 18842,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "update",
                "gro-001",
                "brand"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerGrowth",
                    "index": "#1",
                    "likes": "11",
                    "time": "18/11/2022-21:02:30",
                    "content": "Hi Maker community, This is the regular update from the Brand team to keep you in the loop with our processes, progress, and future plans. This post covers:  PR efforts Marketing campaigns Social Media metrics (Twitter & LinkedIn) Learnings and ongoing initiatives for increasing the Maker brand awareness and strengthening the brand position.  To revisit previous Brand updates, please click the following links: August, July, June.   Spotlight:  The first IRL Maker ad! We placed a few ads in the El Dorado International Airport in Bogota to roll during DevCon. One of them was a rolling video strategically placed on a TV at the immigration check-in, where everyone flying in had exposure to it while standing in line. Our ads were recognized by many of the crypto community, and we have received plenty of Twitter mentions & positive feedback around it! Besides, thousands of non-crypto people were also exposed to it. This was a first-time test of IRL ads for our Brand team, which was very successful and taught us more about brand awareness, the knowledge that we will further use in the favor of growing Maker’s exposure to the world.  image1184×1186 124 KB   Dai a different Stablecoin Alongside with Bankless we published an article related to Dai and what makes it different, how it works and how it maintains its peg regarding being decentralized. Covering from MakerDAO Vaults, why borrowing DAI can be beneficial to lot of people, mostly in countries affected by inflation, to our new tools like de Peg Stability Module (PSM), the Dai Direct Deposit Module (D3M), Maker Teleport and new Vaults like Real World Assets (RWA) ones. In the article you can find examples, infographics and lot more here .  image1010×810 28.1 KB   Our PR work    CoinDesk: Coinbase to Benefit Significaly from $1.6 Bn Transfer from MakerDAO’s USDC, Analyst Says - October 21  Bloomberg: DeFi Protocol MakerDAO puts $500 Million in U.S. Treasuries, Bonds - October 6  Yahoo Finance: Stablecoin Issues MakerDAO to Invest $500M in Treasuries, Corporate Bonds - October 6  CoinLive: Pyth Partners with MakerDAO to bring DAI to Solana - October 3  TheBlock: MakerDAO Votes Yes to Adding GnosisDAO Token as Collateral for DAI - September 20  Euromoney: DeFi Pioneer MakerDAO Funds Regulated US Bank (interview with Gregory Di Pisco) - September 7  Ambire Wallet Twitter Spaces (with Flip Flop Flap Delegate): The Future of Ethereum and Stablecoins with MakerDAO - September 7   Ongoing PR work   Discussion on enabling the DSR As per this recent forum post, we are working on creating opportunities to explain the DSR tot eh broader audience through the media and present what activating the DSR would mean for users in the crypto community. We are currently pitching the topic to different media channels and journalists and seeking interview opportunities  Fast Withdrawals on L2s and the Maker Teleport We have been working on an official announcement for the Maker Teleport and FWs to L2s which includes Twitter posts, unique visual graphics, an official video and an article in collaboration with BanklessDAO. Incorporated, we have added the information on the 10,000 DAI grant offered by Growth CU for integrating Maker Teleport and we are helping spread the word to attract developers and projects looking to integrate this product.  rETH Collateral onboarding and Compund D3M activation Ongoing PR work - drafting and pitching the announcements to selected media channels, as well as looking for interview opportunities and other PR collaborations.   Our Twitter work   Monthly Impressions: Total tally of all the times our Tweets have been seen.   image1362×839 18.5 KB   Monthly Engagements: All the ways people interact with the MakerDAO Twitter Account and its posts.   image1361×838 117 KB   New Followers: New gained followers by month   image1362×839 18.6 KB   Monthly Average Engagement Rate: Ratio between impressions and engagements on a monthly average.   image1361×842 36.7 KB  Below you can also see a comparison table of the new followers gained since our team has taken the MakerDAO official Twitter account under management.  image1863×671 220 KB   Our Twitter Highlights & Learnings:  After July, our Twitter impressions started to decrease. This behavior is normally expected given the Devcon event, and the market conditions, a parameter that is extremely linked to crypto social media activity. However, our engagement rate is stable. This is one of the most important metrics for us, as it explains what percentage of our audience interacts with our posts after giving us impressions. We noticed that posts with visual graphics tend to have better numbers than posts without. We’re focusing more on visual graphics for future social media posts, with the aim of boosting our visual appeal and thus increasing our engagement. (We’re expecting improved numbers for November according to this).   Top Tweets from September:  What are the risks of an Ethereum PoW chain after the Merge takes place? What are the risks of replay attacks from an Ethereum PoW after the Merge is executed? Devcon Ticket Giveaway   Top Tweets from October:  MakerDAO Executed a New Debt Ceiling of 500 million DAI for PSM GUSD MakerDAO Executed the first DAO balance sheet investment in bonds (MIP65) MakerDAO Approved Coinbase Institutional Rewards through a Ratification Poll   Announcements   During September and October, we’ve managed and executed the following important announcements:  Pyth adds DAI feeds Monetalis Clydesdale Coinbase Institutional Rewards approval Endgame Prelaunch MIP set approval PSM GUSD 500 million DAI Debt Ceiling GNO Greenlight Stability Fee Being Significantly reduced The Merge implications Open Call with Coinbase CFO     The Brand Team Ongoing Initiatives    Website redesign A few months ago, we introduced in our schedule weekly Brainstorming Sessions to help us navigate through the current issues we see with Maker as a brand and creatively brainstorm solutions. After focusing a few sessions on finding out what Maker looks like now and what can we do better to represent its actual value and goals on the market, and in the world, we came up with better ideas on how to adjust the messaging and design - which will be implemented on the new version of the makerdao.com official website. Last week, we hired an external design & web development agency that will help us make these ideas come true. Our project starts this week and will take 3-4 months to complete.  As we explore what is best to be showcased on the official website, we will be working with mandated actors to help us by contributing their knowledge on each website section according to their mandate (eg. PE will help us on structuring some of the technical documentation, Oracles will contribute to the oracle section, etc.) In the final stages of the project, we will user-test different layouts and designs to ensure the new website ticks the right boxes.   Marketing campaign with Binance Pay On November 4th, we announced a campaign targeting Argentinian users in collaboration with Binance. All Binance users in Argentina who hold at least 10 DAI in their accounts could earn up to 1,009 DAI by ordering a Binance Card. Additionally, users will get a 5% cashback in DAI (token voucher) on top of the regular 8% cashback when spending with their Binance Card.  The campaign is ongoing and will last until November 30th. After that, we will use the campaign metrics to measure the effectiveness and get a better understanding of the usage of DAI on Binance. Every marketing campaign teaches us something new about crypto users, and that knowledge is further used to do better targeting and strategies in the future. Binance Card page.  We want to hear from you  Question of the month: What do you think the MakerDAO website is lacking the most at the moment? Share your thoughts, feedback, or tips with us in the comments below. Please use this link if you prefer engaging with us anonymously. ",
                    "links": [
                        "https://forum.makerdao.com/t/growth-cu-brand-and-communications-update/17347",
                        "https://forum.makerdao.com/t/maker-brand-update-june-july-2022/16858",
                        "https://banklesspublishing.com/dai-a-different-stablecoin/",
                        "https://www.coindesk.com/business/2022/10/21/coinbase-to-significantly-benefit-from-16b-transfer-of-makerdaos-usdc-analyst-says/",
                        "https://www.bloomberg.com/news/articles/2022-10-06/defi-protocol-makerdao-puts-500-million-in-treasuries-corporates",
                        "https://finance.yahoo.com/news/stablecoin-issuer-makerdao-allocates-500m-102723787.html?guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAGK3Tdo1BEq_YZ5yED35pONP36306jrGmd8sJDy0GvknkspESmZV04logMvfzo3_lU83WoeQo1b9rST2AFGYUweeP9nK43OmHYm4DIiusTCekDdW9swv9S6YIKVG97wWAR7SaTuS3RbKDV56VvyVlFcgTx2U08aFSUWj1JQN43yz&guccounter=2",
                        "https://coinlive.me/pyth-partners-with-makerdao-to-bring-dai-to-solana-25068.html",
                        "https://www.theblock.co/post/171316/makerdao-governance-votes-yes-to-adding-gnosisdao-token-as-collateral-for-dai",
                        "https://www.euromoney.com/article/2alcnqnle1dn19ipnmoe8/fintech/defi-pioneer-makerdao-funds-regulated-us-bank",
                        "https://twitter.com/i/spaces/1eaKbrbQmyVKX",
                        "https://forum.makerdao.com/t/discussion-on-enabling-the-dsr/18759",
                        "https://twitter.com/MakerDAO/status/1567953156474019843?s=20&t=B0FbUR8uoxcgV3RgM450lg",
                        "https://twitter.com/MakerDAO/status/1569759801038573575?s=20&t=csUjjcX5UeoOWCbMjMWOLg",
                        "https://twitter.com/MakerDAO/status/1573296095278649344?s=20&t=Qo3PDBGhpoWM7OKiK7FI0A",
                        "https://twitter.com/MakerDAO/status/1583571044698583040?s=20&t=KqTeuDRs5mrMLKpo3VcsOQ",
                        "https://twitter.com/MakerDAO/status/1578007896868233216?s=20&t=cOxRK1_e-1epLlyPCbQwUA",
                        "https://twitter.com/MakerDAO/status/1584595297325441026",
                        "https://twitter.com/MakerGrowth/status/1575169241002938368?s=20&t=EZ8fxWzYpHzgvBuM9ZRf7g",
                        "https://twitter.com/MakerDAO/status/1578007896868233216?s=20&t=rdQZTvIUfkm3h6vdrbWRkQ",
                        "https://twitter.com/MakerDAO/status/1584595297325441026?s=20&t=mEFviKGwGlEOvoURLqZhvw",
                        "https://twitter.com/MakerDAO/status/1584922715756134402?s=20&t=8BkJ1Yg6USrjuaB6B4mSZg",
                        "https://twitter.com/MakerDAO/status/1583571044698583040?s=20&t=KqTeuDRs5mrMLKpo3VcsOQ",
                        "https://twitter.com/MakerDAO/status/1572208685014720513",
                        "https://twitter.com/MakerDAO/status/1569389615852752903",
                        "https://twitter.com/MakerDAO/status/1567212004561092609?s=20&t=hEb8i0OrJ0X3ltx2ys0JuA",
                        "https://twitter.com/MakerDAO/status/1572646649456885767?s=20&t=hEb8i0OrJ0X3ltx2ys0JuA",
                        "http://makerdao.com",
                        "https://www.binance.com/es-AR/support/announcement/especial-de-binance-card-pag%C3%A1-con-dai-y-acced%C3%A9-a-recompensas-en-dai-c7810a434b64447c8fbc496c3d22a379",
                        "https://www.binance.com/es-AR/cards",
                        "https://freesuggestionbox.com/pub/dclolom",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-october-2022/18650",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-november-2022/19023"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.755989275875639
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#2",
                    "likes": "1",
                    "time": "22/11/2022-21:09:59",
                    "content": "    MakerGrowth:  The first IRL Maker ad!   Went to DevCon and what a big surprise was this, just congrats to the team! Now, whatching the graphs, seems like twitter engagement is going down slowly, you know why? Is there any lack of recurrent tweets? Or you think is because of all the crypto drama around twt? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.106944444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerGrowth",
                    "index": "#3",
                    "likes": "5",
                    "time": "24/11/2022-21:07:59",
                    "content": "Hi @RoFz, thanks for your question! Let’s start with some quick numbers: (#)Tweets:   October - 212 (October by tweet - Google Sheets)   September - 259 (September by tweet - Google Sheets)   August - 258 (August by tweet - Google Sheets)   July - 247 (July by tweet - Google Sheets)   We only slightly decreased October’s tweet number compared to the previous month (-18% approximately). Now, let me give you more context after investigating more in what happened during those months: We had our best month in terms of impressions and engagement during July. In that month, we also had our single tweet with the most impressions and engagements. (https://twitter.com/MakerDAO/status/1543998801786068992). Following the case of this tweet, the topic around our best-performing tweets during July and previous months was real-world finance and recent MakerDAO’s RWA proposals. Given that context, we continued pushing tweets with this topic during the next months, but the attention decreased according to our impressions and engagements — it’s hard to predict when a trend has ended or even if it has ended at all. In addition to that, October was a very particular month. We spent over 1 week tweeting about the Devcon event and Maker’s participation. People tend to engage less with these kinds of tweets with self-promoting purposes, and a specific in-real-life event that most of our Twitter audience probably didn’t attend. Still, we couldn’t miss the opportunity to talk about Maker’s participation in Devcon because we had a big opportunity to gain a potential new audience for the long term. On top of that, the recent market conditions could have impacted our audience’s activity on Crypto Twitter. When the market is flattening this is something that I’d expect. Anyways, I’m describing here potential cases I could identify, but there may be more situations that are off our radar and could affect our metrics, such as the Twitter algorithm’s interest in boosting our tweets or the general Twitter level of activity during those specific months. However, I’d like to highlight two important things:   Our engagement rate is high and growing, which is really important! That means an important share of our impressions is converted into engagements. That can represent our audience being more interested in sharing, reading, and linking our posts    Metrics improved in November! We just surpassed 1 million impressions during November and expect to close the month with a number between 1.3-1.5 million impressions, which is very close to our all-time high!    1600×691 169 KB  Lastly, social media is kinda dynamic, hard to predict in the short term. For that reason, and a broader, long-term branding improvement, our focus needs to be on the long term, and that is also why we are so focused on engagement rate. If we get more people to engage with our brand, it is more likely that they will be following our posts in the long run. The more people we have in the long run, the more our true community that wants to be with us grows! ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1hQ2LNO6DcEhX5B4IWUhhTxdRiEJWnkDX0YKK4C-Rh-0/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1r0bKLQcBtoDFPn1mdLVxGZApybGTJd_zw8FlIo0utq0/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1k9QnvXtIxFEF3gd4XVbPl7YqGkUrtDwCQi2OnPoLBpQ/edit?usp=sharing",
                        "https://twitter.com/MakerDAO/status/1543998801786068992"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.60416097060834
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ihsotas",
                    "index": "#4",
                    "likes": "2",
                    "time": "25/11/2022-17:37:21",
                    "content": "Growth team is rocking. I love these updates very short and crisp. As per my understanding current traction channel for Maker is Twitter & Branding which is eventually helping in getting backlinks & community development. Are we exploring any other traction channels? I am very keen to see social engineering channel which might be very good thing to explore. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.105208333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#5",
                    "likes": "0",
                    "time": "29/11/2022-19:07:23",
                    "content": "    ihsotas:  social engineering   What do you mean by that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.302083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ihsotas",
                    "index": "#6",
                    "likes": "0",
                    "time": "30/11/2022-18:12:34",
                    "content": "I mean you know that running Gads is a nightmare for crypto businesses, can we build few basic apps, like contests, light games (where we can add maker branding and if the player reach certain level we might plan some giveaway), calculators…etc we can leverage these tools to open by the other traction channels like SEM. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.983418367346939
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alen_Lipus",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/12/2022-10:23:53",
                    "content": "    MakerGrowth:  Brainstorming Sessions   Do you use any tools for brainstorming sessions? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "02/03/2023-10:24:29",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}