{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/monetary-theory-makers-unusual-superpowers/8301",
            "title": "[Monetary Theory] Maker's Unusual Superpowers ",
            "index": 8301,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "monetary-policy"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "10",
                    "time": "24/05/2021-14:05:33",
                    "content": "As might be guessed from the speaker series I’m organizing, I would like the DAO community to become more familiar with monetary policy and the theoretical base that underpins all mainstream understanding of monetarism. For MakerDAO, this is not just a theoretical exercise. The Maker Protocol has some superpowers that heretofore I’ve not seen mentioned. I will let my economics education show and do that mentioning here. Grasping the significance of these will underline exactly what a powerful thing has been built on this protocol. I cannot overemphasize enough the power some of these allow us in terms of both scaling and being able to play the white knight for dollar-demoninated economies and markets. Maker can profitably loan at negative real interest rates Normally, it is a money-losing proposition for lending terms that are less than expected inflation, as the repayment is – in purchasing power – less than the amount loaned. For those unfamiliar with the concept, imagine a bank lends for one year at 2%, but inflation ends up being 2.5%. The bank has 102% of the funds lent out at the end of the loan, but ~99.5% of the purchasing power of the principle it loaned out originally. Maker does not suffer from this problem. Why? The answer lies in two facts. The first is that Maker generates DAI, which is successfully pegged to the USD. 1 DAI approximates 1 USD with very little slippage. The second is that the opportunity cost is different for Maker. Because we can mint DAI against collateral, we do not have to source the funds lent out from other sources, or from idle funds that would otherwise be put to work in other uses. In a manner, the protocol rubs its hands together and makes DAI appear while locking up collateral. As long as the peg is maintained, this means that dollar-equivalents are created. This is not a secret. Memes about about the (de)central bank concept. What this means, however, is that as long as absolute yield is positive, the protocol can profitably lend at below-inflation rates. If the appeal of this to borrowers is not obvious, imagine you are a government or corporation on the other end of the example above. You borrow $1 but pay back $0.995 at the end of the loan in real terms. This comes with some strong caveats. What is true in theory is often entangled in real-life friction and surprises. The biggest of which is that there is no room for defaults or disorderly liquidations when lending at ultra-low rates. Only the absolute safest assets are appropriate for this kind of lending. However, we already have proof of concept, though it has gone unrecognized. The PSM effectively makes this type of lending, with a fixed 10 bps in “interest” on loans of indeterminate time against USDC. Note also that many loans financed by the protocol – including if it becomes reality, against farmland in Iowa – are also tracking below expected inflation with the 10-year breakeven expected rate currently in the neighborhood of 2.5%. Hopefully the fact that this is already being done within the protocol should allay any fears about this – as long as the nominal yield is positive and the assets are themselves ultra safe. I hope it also does not need additional emphasis to point out that Maker can outcompete traditional lenders unquestionably, as long as there is zero or near-zero risk of the debt becoming bad. The physics of our fund sourcing gives us an ability to, say, finance lending to the US Treasury in ways that cannot be matched by anyone other than another central bank. Edited to add: @SebVentures correctly pointed out below that I was leaving implicit the assumption that the DSR (or any future method of MarkerDAO borrowing) is at or near 0%. For obvious reasons, we cannot accept margins below the DSR unless we have motivations beyond profitability for a transaction. Maker’s loans exert deflationary pressure The loans facilitated by the protocol for our crypto assets exert deflationary pressure. The key reason is that the self-lending enabled by Maker vaults require deposit of collateral that itself can be used as a medium of exchange, thanks to the highly marketable properties of any asset on multiple exchanges. This means that while DAI supply grows, total money supply of the crypto economy shrinks when a Maker vault is utilized. The reason for this is simply the overcollateralized nature of Maker lending. If a user deposits $200 in ETH and withdraws $100 in DAI, the total money supply has faced a negative growth event. Note that in fractional reserve lending, that deposit would be loaned out into the economy, making it inflationary in terms of growing the money supply. Maker vaults lock the collateral out of circulation, though. I’ve not fully thought through the implications of this as Maker becomes larger. If there is not a robust integration between the crypto and real-world economies, I can this this having undesirable effects. When Maker has enough scale, this aspect will be highly desirable, however, on the part of certain real-world borrowers if there is robust integration. Maker is far from the only deflation-exerting force in the crypto economy, so linking the two should help the crypto economy sop up some level of inflation if the crypto economy can in aggregate become large enough to matter. Note also that Maker’s power to profitably lend at below real rates against real-world assets are likely to also exert deflationary pressures, though it is not clear in what magnitude, as this is a frontier in economic thought that hasn’t been explored. Implications While there are other implications I am still working through and asking others to think through, there should be one obvious application of these two “superpowers” in combination. If we want 1 trillion DAI, there already is a collateral market that is deep enough for us to use as a springboard to make DAI ubiquitous enough that our core business becomes a must-have for more customers. Dollar-denominated, AAA-equivalent debt by or guaranteed by the US federal government and the more credit-worthy states offer an easy on-ramp for DAI growth. This should also be extremely appealing to certain borrowers (Treasury is the most obvious) if Maker is scaled large enough to make a material difference in lending rates. Maker can – at a profit – lend to the US government at a rate that is not only below inflation, but also in a manner that reduces the inflationary pressures of such borrowing on the global economy. This serves to stabilize price levels most world economies and dollar-denominated markets while simultaneously relieving fiscal pressure on the US government – and at scale, Maker brings in large profits that dwarf our current income. US government debt is both easy to monitor and brings relatively few additional risks, as long as the technical complexity of integrating these instruments with the protocol can be successfully solved. DAI is already heavily exposed to the risk of default by the US government, small though it is, so directly lending to the government or to holders of government debt who themselves collect a spread should not carry as much additional risk as most new collateral types. Practically speaking, it likely holds less regulatory risk than the large amount of USDC on our balance sheet, as there is always the chance that Circle/USDC itself is the target or regulatory backlash rather than Maker/DAI. The underlying promise of USDC redeemability also means Maker is already heavily exposed to risks associated with cash and near-cash held by Circle, but at the moment Circle collects the yield instead of Maker. I should caution much of this is predicated on the peg remaining intact, though this type of program could also be sped up if we needed to exert (a small amount of) downward pressure on the peg. It would also serve as a way to diversify our portfolio of stable-assets away from stablecoins – in particular USDC. ",
                    "links": [
                        "https://fred.stlouisfed.org/series/T10YIE",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/3",
                        "https://forum.makerdao.com/t/paperimperium-delegate-platform/8992",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-21-27/8379"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.499764657038364
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "24/05/2021-14:43:04",
                    "content": "Oooff U.S. Debt wrapped in DAI  that’ll be a tough sell IMO. Most DAI users want a decentralized way of protecting their Wealth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/05/2021-14:47:18",
                    "content": "Isn’t that better than Circle debt (USDC)? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#4",
                    "likes": "0",
                    "time": "24/05/2021-14:51:24",
                    "content": "Seems to me USDC is more liquid for 10bps. And better to play its role as demand/supply buffer via the PSM. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "3",
                    "time": "24/05/2021-14:51:58",
                    "content": "There is one assumption that you are making. It is that we can borrow at 0%. While true currently, I’m not convinced it will stay. As described in my crypto-banking paper, there is a continuum between stablecoins and the revenue is the spread between borrowing and lending rate. If you borrow at 2% you can’t lend at 1% no matter what is the inflation. We need to maximize the following formula:  net interest income = (average SF - DSR) * DAI supply  You can see that since the crash, DAI supply is declining while it is increasing for fiat-backed stablecoins. They have a low spread but are able to increase faster those days.  image1153×386 29.8 KB  The USDC PSM is already kind of investing in t-bills. It’s just that we don’t get the yield (as we leave it to Circle). My aim is to keep SF above 2% so we can increase DSR to 2% and grow like hell. PS: There are some talks for something like you expect but there is nothing concrete yet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.318181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#6",
                    "likes": "2",
                    "time": "24/05/2021-14:54:26",
                    "content": "I agree - our under-supply problem is temporary… the Growth CU should be going full throttle to make sure it persists once the speculation dies down ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1574074074074066
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "2",
                    "time": "24/05/2021-15:03:00",
                    "content": "    PaperImperium:  Isn’t that better than Circle debt (USDC)?   Probably yes, but perhaps best to “free” DAI completely from USDC exposure–and get away from exposure to U.S. inflation and a hike in Interest Rates --which will lead to a decline in the Value of U.S. Debt (Treasuries). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "1",
                    "time": "24/05/2021-15:07:21",
                    "content": "    flipflopflapdelegate:  perhaps best to “free” DAI completely from USDC exposure–and get away from exposure to U.S. inflation and a hike in Interest Rates --which will lead to a decline in the Value of U.S. Debt (Treasuries).   If we are holding a portfolio to maturity, a decline in the market value of the debt doesn’t matter. Likewise, the DAI would not exist without the loan, so any positive yield is theoretically profitable. Inflation does eat into that, but unless the US defaults, it is a net profit, no matter how small the margins. And it can be replicated as much as we want — peg is the limiting factor. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.048295454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#9",
                    "likes": "0",
                    "time": "24/05/2021-15:28:45",
                    "content": "    SebVentures:  There is one assumption that you are making. It is that we can borrow at 0%. While true currently, I’m not convinced it will stay.   This is a good point, and will edit the post to reflect that this assumption was not explicitly stated. I do not believe the DSR will need to be raised for a very long time, but you are not incorrect that it matters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.231249999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "1",
                    "time": "24/05/2021-15:29:11",
                    "content": "US Treasuries are backed by future tax revenue. As a thought experiment, suppose the US Gov put all future tax revenue into a Maker vault, withdrew the maximum about of DAI, and “invested” it in pork barrel projects across the country. Suppose the environmental pollution from all this pork causes the birth rate to decline by some small fraction per year. Projections of future tax revenue decrease slightly. The USGov vault becomes undercollateralized. Maker is in trouble. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.486111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#11",
                    "likes": "1",
                    "time": "24/05/2021-15:31:18",
                    "content": "I don’t think the Fed is going to relinquish control over the financing of US debt. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "0",
                    "time": "24/05/2021-15:31:40",
                    "content": "    psychonaut:  Maker is in trouble.   As long as DAI is pegged to the USD, Maker would be in trouble anyway in the event of a US default event – or anything else they could do that would leave holders of dollars “rekt”     ejbarraza:  I don’t think the Fed is going to relinquish control over the financing of US debt.   That’s up to Treasury (or the secondary markets). Also, note that the Fed cannot literally lend out to the point it makes a loss unless it can be recapitalized by Treasury. Normally this would be done with a gift of Treasury securities. Currently, the Treasury requires Fed financing to raise money. So that’s a bad news bears scenario that Maker (if large enough) can actually prevent. I don’t think that would happen, but we would be an alternative source of “dollars” as long as the market for DAI<>USD remained on-peg and liquid. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.483766233766234
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#13",
                    "likes": "2",
                    "time": "24/05/2021-15:34:46",
                    "content": "    PaperImperium:  As long as DAI is pegged to the USD   Hence the importance of eurDAI, jpyDAI, etc. Even with the current usdDAI, I think Maker should try to diversity across nation states. US Treasuries seems like the wrong direction to me, but maybe treasuries could be a positive interim step. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.596590909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#14",
                    "likes": "2",
                    "time": "24/05/2021-15:39:08",
                    "content": "I think the government relinquishing any control over monetary policy is wishful thinking. If they can’t control it 100%, then they won’t take part. So unless Maker is nationalized I don’t see the government using DAI. I do however see third-party investors creating closed end funds that invest in treasuries and tokenize them to mint DAi. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#15",
                    "likes": "3",
                    "time": "24/05/2021-16:24:30",
                    "content": "It’s quite amazing how 1-year ago–Circle had only $730M of USDC outstanding, and today Maker (PSM) holds Double that amount…  image703×342 41.7 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                }
            ]
        }
    ]
}