{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - HVBANK (Huntingdon Valley Bank Loan Syndication Collateral) - April 18, 2022",
            "index": "14219",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "77,717",
            "highest_fraction": 0.93
        },
        {
            "title": "Add RWA-009 (HVBank) as a new Vault Type - July 4, 2022",
            "index": "14219",
            "option": "Yes",
            "supporting_mkr": "117,540",
            "highest_fraction": 0.87
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219",
            "title": "MIP6: Huntingdon Valley Bank Loan Syndication Collateral Onboarding Application ",
            "index": 14219,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "impact-:-medium",
                "hvb",
                "mips",
                "rwa",
                "rwa-co",
                "rwa-009"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/RWAC",
                    "index": "#1",
                    "likes": "41",
                    "time": "25/03/2022-15:38:32",
                    "content": "Note: This is a MIP6 application being submitted by RWA Company LLC (“RWAC”) on behalf of HV Bancorp Inc. (“HVBank”) Authors: Greg Di Prisco (@g_dip) & Max Glass (@maxglass) of RWAC, with Dan Krewson & Hugh Connelly of HVBank DISCLAIMER The content of this communication is for informational purposes only. You should not construe any information contained herein as legal, tax, investment, financial, or other advice. You should not rely on the information contained herein as a basis for making any business, legal or other decisions. RWA Company LLC and its members, officers, directors, owners, employees, agents, representatives, suppliers and service providers cannot be held liable for any of the information contained in this communication. Nothing contained herein constitutes a solicitation, recommendation, endorsement, or offer by RWA Company LLC or any third party service provider to buy or sell any securities or other financial instruments in any jurisdiction. THIS INFORMATION IS PRESENTED “AS IS” FROM HV BANCORP INC AND ITS PUBLIC FILINGS; RWA COMPANY LLC TAKES NO RESPONSIBILITY FOR ITS ACCURACY. Quoted and example yields are as of 3/21/2022  SUMMARY TERMS:   Counterparty: (RWA-XX) Huntingdon Valley Bank, a Pennsylvania Chartered Bank founded in 1871, held by HV Bancorp. Inc. (NASDAQ Listed: HVBC)   The Real World Asset(s): Huntingdon Valley Bank originated loans, rated “6” or better (lower is better) by HVBank’s credit assessment, 50% held by HVBank, 50% by a Trust for the benefit of MakerDAO (“MBPTrust”)   Lender Legal Entity for the benefit of MakerDAO: A Delaware statutory trust for the benefit of MakerDAO (a “MakerDAO Bank Participation Trust” or “Multi-Bank Participation Trust” or “MBPTrust”)   An Initial Debt Ceiling of: $100 Million   12 month goal: $1 Billion   Yield Benchmarks: 30-Day Average SOFR (currently 0.083%) & “Like-Term” US Treasury (e.g. 5-year UST currently 2.310%)   Minimum yield (a spread over the benchmarks) to the MBPTrust at the time of origination and participation (net of all S,G,&R Fees):  → For floating rate loans: 75 basis points over 30 Day Average SOFR (implying a minimum floating yield today of 0.833%);  → Fixed rate loans: 30 basis points over the like-term treasury (today, 2.610% for a loan with 5 years of fixed rate)   Expected net yield to the MBPTrust at the time of origination and participation is conservatively (net of all S,G,&R Fees): 3.00%   Retroactively adjusting the vault stability fee to match the net yield to the vault from the MBPTrust (the “Real Stability Fee”): monthly   [ALTERNATIVE] Stability fee will be set to 0% and cost of capital will be outlined in the purchase agreement, net interest will be sent to the surplus buffer: quarterly   Disclaimer: Except for statements of historical fact, certain information set forth in this presentation contains forward-looking information and forward-looking statements. These statements are not guarantees of future performance and undue reliance should not be placed on them. Such forward-looking statements necessarily involve known and unknown risks and uncertainties, which may cause actual performance and financial results in future periods to differ materially from any projections of future performance or result expressed or implied by such forward-looking statements. Although forward-looking statements contained in this presentation are based upon what management of the Company believes are reasonable assumptions, there can be no assurance that forward-looking statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. The Company undertakes no obligation to update forward-looking statements if circumstances or management’s estimates or opinions should change except as required by applicable securities laws. The reader is cautioned not to place undue reliance on forward-looking statements. Neither principals nor employees of RWAC retain equity or debt positions in Huntingdon Valley Bank or HV Bancorp Inc. Here is Google Doc of this MIP that’s optimized for navigation according to RWF CU’s criteria. Here is a .pdf of this MIP on RWAC’s website, also optimized for navigation:   static1.squarespace.com    MIP6+-+HVBank+-+Final+-+3.25.2022.pdf 612.82 KB       Executive Summary:  This MIP6 is submitted by Huntingdon Valley Bank (“HVB” or “HVBank” or the “Bank” or “Portfolio Manager” or “Asset Manager” or “Counterparty”), a State Chartered American commercial bank owned by the publicly-held holding company HV Bancorp. Inc. (NASDAQ Listed: HVBC), subject to regulatory oversight from the Federal Reserve, the Federal Deposit Insurance Corporation (FDIC), the Pennsylvania Department of Banking and Securities, and the Securities and Exchange Commission (SEC) (Investor Relations and Public Filings). HVBank proposes using a legal structure wherein HVBank enters into a Master Purchase Agreement, having more than one Portfolio Purchase Agreement, with a Delaware Statutory Trust for the benefit of MakerDAO (the “MakerDAO Bank Participation Trust” or the “Multi-Bank Participation Trust” or “MBPTrust”). While the facility will be structured with the intention of having the ability to onboard multiple banks, it is currently only intended to be used for HVB. A Trust Agreement will establish The Multi-Bank Participation Trust for the benefit of MakerDAO as a separate, bankruptcy-remote entity, with a regulated Delaware Corporate Trustee who will verify that all material actions of the Trust are carried out in accordance with MKR votes. HVBank intends for the Master Purchase Agreement, together with any Portfolio Purchase Agreement, to govern true participation(s) of loans originated by HVBank under Pennsylvania law and not as a direct financing. The First Portfolio Purchase Agreement proposed is for pari-passu participations in loans (individually a “Participated Loan” or collectively the “Participated Loans”) that are either originated by HVBank or are loans purchased or syndicated from another State- or Federally- Chartered financial institution or other satisfactory non-chartered financial institutions, with each Participated Loan assigned a credit rating by HVBank of 6 or better (lower is better) out of 10 (credit rating details herein, see HVBank’s Credit Rating System). HVBank will retain a minimum of fifty percent (50%) ownership in the principal of the HVBank Participated Loans. Over time, HVBank will petition MakerDAO to reduce the minimum ownership percentages on Participated Loans such that HVBank proposes to retain down to a minimum of five percent (5%) ownership at all times. This would mirror other existing loan syndication or partnership programs like the SBA or Main Street Lending programs. The HVBank loans originated by HVBank’s Commercial Lending Division have fixed and floating rates, with generally five (5) or fewer years of term, however from time to time on construction or mortgage loans total terms of up to ten (10) years as may be required by market conditions and underlying collateral, and they belong to one of the following Loan Categories: (i) amortizing commercial mortgage loans on stabilized commercial real estate investments (“Amortizing CRE Mortgages”); (ii) construction financing secured by commercial real estate investments (“Construction Loans”); (iii) senior revolving debt of private lender clients of HVBank who finance the prior two Categories “Lender Finance Lines”); (iv) loans (term or revolver) to non-real estate businesses that are collateralized by receivables, inventory, equipment, and/or other assets of the business (“Business Loans”); (v) the government guaranteed portion of Small Business Administration loans (“SBA Loans”); and (vi) senior-secured revolving lines of credit to approved private equity funds used to support investments through assigned capital calls (“Capital Call Lines”). In summary, all loans originated by HVBank in its ordinary course of business and that in all factors comply with the Bank’s credit policy and loan origination guidelines, including but not limited to the aforementioned loan Categories, shall be considered the HVBank Participated Loans and therefore the proposed Initial Loan Categories. Furthermore, all loans purchased by HVBank and participated with the MBPTrust must meet all standard credit and risk conditions of HVBank described herein and fit one of the aforementioned Categories (i) through (vi), with a satisfactory credit rating from HVBank, and HVBank having a pari passu relationship with the MBPTrust. For the quarters 2Q21, 3Q21, and 4Q21, HVBank’s Commercial Lending Division originated new commercial loan production of $42.4M, $27.6M, and $49.6M, respectively, in the aforementioned Loan Categories. In the 1Q22, HVBank originated year-to-date $31.1M with an additional $46M in underwriting or closing processes. The following table illustrates the diversification of loan production for the periods 1Q21 through 1Q22 and the projected pipeline as they pertained to the Loan Categories. This table does not present production in prior periods or production from other business areas of HVBank such as the residential mortgage division. This graph shows the quarterly accretion of HVBank Originated and HVBank Syndicated Loans diversified across the proposed Loan Categories as support for the proposed production for the Master Purchase Agreement.  1422×1033 14.2 KB  HVBank currently has a legal lending limit of approximately seven million dollars ($7M) per borrower relationship. While the proposed facility will participate in loans to new borrowers and to repeat borrowers of HVBank, the proposed relationship with MakerDAO will be strategic for HVBank insofar as it will allow the Bank to maintain and grow relationships with customers by expanding its effective lending limit. Loans to new and to repeat borrowers will comply with the same credit requirements. On the 2021 commercial loan production, the gross interest yield on all non-construction loans averaged about 4.50%, gross interest yield on construction loans averaged about 5.0%, and the total weighted average gross interest yield averaged about 4.65%. For the year ended 2021, HVBank as a whole reported $210,000 of loan losses (losses incurred on an outstanding loan) on total average assets at FYE of $554.4 million (average loans of $313.8 million) and total outstanding loans at FYE of $376.5 million, for a credit loss rate of around 0.06%. Total average assets includes treasury securities, cash, investments, deposits at other banks, loans held for sale (residential mortgages), and outstanding loans (loans receivable) net of allowance for loan losses. Link to view this table  The guaranteed minimum net floating rate yield to the Multi-Bank Participation Trust (the “MBPTrust”, for the benefit of MakerDAO) at the time of origination and participation is 75 bps over the average one (1) month SOFR (replacement for LIBOR) (currently 0.083%, so the guaranteed minimum net floating rate yield to the MBPTrust would currently be 0.833%). The guaranteed minimum net fixed rate yield to the MBPTrust at the time of origination and participation is 30 basis points (“bps”) over the closest like term United States treasury yield (i.e. the “like term treasury”). For example, the 5-year like term treasury rate is currently 2.310%, so the guaranteed minimum net fixed rate yield to the MBPTrust on fixed rate loans with maturities of 5-years would currently be 2.610%). MakerDAO will be the proportionate beneficiary of over-performance in the yield and HVBank is incentivized to over-perform for MakerDAO as both entities share in the maximum market sustainable yield. At the current benchmark rates, the expected net yield to the MBPTrust (net of expected S,G,&R Fees) at the time of origination and participation is conservatively 3.00%. The intention of the portfolio is to have a mix of fixed and variable rates that hedge overall rate exposure, balancing yield with other risk factors. So called “S,G,&R Fees” include all fees for the Loan Servicing (by HVBank), fees for Loan Reporting by RWA Company LLC (“RWAC”), and fees for governance-work by RWAC (these collective fees are “S,G,&R Fees”). HVBank’s Servicing Fees: HVBank will be the Master Servicer and, as needed, the Special Servicer, utilizing HVBank’s full Servicing Departments and Special Servicer expertise, which handles nearly one billion dollars of annual loan transactions across all divisions. HVBank Originated commercial loans will primarily use Pennsylvania law and will, if under Pennsylvania law, include a Confession of Judgment provision which gives the lender enormous leverage in the event of a borrower default. RWAC’s G&R fees: RWAC is building a (wide) bridge between regulated banking systems and (regulated) Decentralized Finance. For regulated counterparties, RWAC abstracts away the challenges presented by Maker governance and acts as a navigator to the process. As part of RWAC’s Reporting Service, RWAC will retrieve and deliver the off-chain data about assets relevant to the facility, and distribute this information to the MakerDAO community (unless said data must be permissioned, in which case RWAC will distribute that data to relevant Core Units who are under NDA). As part of this governance-work, for the benefit of MakerDAO, clients of RWAC who are seeking governance approval for a debt ceiling (the borrower-counterparties) have agreed to the following provisions, which RWAC believes benefit MakerDAO:  To furnish all information necessary for RWAC to provide its services. Counterparty will be responsible for the completeness and accuracy of all of the information counterparty provides to RWAC and counterparty will be asked to sign verifications attesting to reasonable accuracy and completeness. If counterparty knowingly or willfully provides any incorrect or incomplete information that RWAC relies on, that will cause irreparable harm to RWAC To attend all calls, presentations, visits, and other meetings upon RWAC’s reasonable request. To facilitate communication between RWAC and borrower-counterparty’s other advisers, including legal counsel, accountants and tax advisers, as is reasonable. To work exclusively in coordination with RWAC when interacting with MakerDAO in any capacity To share data with RWAC necessary for a MIP6 application to MakerDAO for a vault (a credit facility) and for maintaining the good standing of any vault  The provision of RWAC’s Engagement Agreement that HVBank “work exclusively with RWAC when interacting with MakerDAO in any capacity” (until such time RWAC ceases to operate or a Counterparty terminates their engagement with RWAC) is intended make RWAC valuable to MakerDAO as a trusted service provider through which MakerDAO can efficiently manage many Counterparties. RWAC believes this role offers increasing value to MakerDAO as real asset lending scales. RWAC will not in any way impede communication between any counterparty and any relevant core units or the community. RWAC will act as an additional hand-holder or guide for decision-makers at regulated TradFi counterparties (and traditional service providers) who may be new to crypto and MakerDAO. The total S,G,&R Fees will be equal to one and one-quarter of one percent (1.25%) per annum on the first $10,000,000 participated to the MBPTrust of each individual Participated Loan (the “Base Loan Balance”). Over the Base Loan Balance, S,G,&R Fees on amounts participated to the MBPTrust out of each Participated Loan shall be three quarters of one percent (0.75%) per annum. For example, if HVBank participates $12M of a loan ($24M total loan size) to the MBPTrust, the S,G,&R Fees shall be ($10MM * 1.25%) + ($2M *.75%) = $125,000 + $15,000 = $140,000 per year, reducing proportionately to any amortization of the underlying loan (S,G,&R Fees decline on each participated loan as each loan amortizes). G&R will be 50 bps (0.50%) paid to RWAC for that work but, so that the ongoing alignment of interests between RWAC and MakerDAO is reinforced, the G&R Fees shall be at risk for RWAC if the MBPTrust fails to achieve the guaranteed minimum yields promised. The requested initial debt ceiling for the first Master Purchase Agreement, First Portfolio Purchase Agreement of the MBPTrust is one-hundred million dollars ($100M) of HVBank Participated Loans diversified across all proposed Loan Categories, to be deployed over a period of twelve (12) to twenty-four (24) months from inception. At MakerDAO’s option, for the purpose of scaling and diversifying real world asset collateral, The MBPTrust could expand the scope of the First Portfolio Purchase Agreement or enter into additional Portfolio Purchase Agreement(s) with HVBank, with debt ceilings(s) to be determined at the time of approval and issuance, allowing for the Trust to purchase loans originated by HVBank (or syndicated, on the market, with HVBank’s coordination and participation), with floating and fixed rates in one of these Additional Loan Categories to follow. If rates are fixed, the maximum maturity on any fixed rate period is five (5) years.  (vii) residential mortgages that conform to Agency Requirements (“Agency Residential Loans”) (viii)residential mortgages originated by HVBank that advantage owners of digital assets(“Crypto Primary Residence Loans”) (ix) a portfolio of performing unsecured consumer loans (“Personal Loans”)  The Agency Residential Loans, Crypto Primary Residence Loans, and Personal Loans (collectively the “Additional Loan Categories”) will allow HVBank and the Trust to diversify their investments into a wider range of asset classes and debt types. These Additional Loan Categories are not included in the First Portfolio Purchase Agreement and are being highlighted as an option for Subsequent Portfolio Purchase Agreements that increase scale and diversification of real asset collateral for Dai. Any Subsequent Portfolio Purchase Agreement(s) will contain mutually agreed upon parameters between the Trust and HVBank, including that HVBank retain a minimum ownership sufficient to align the Bank’s interests with MakerDAO, that loans are rated “6” or better (lower is better) by HVBank’s credit assessment, and that HVBank service the loans.  —---------------------------------------------------------------------------------------------------------------LONG FORM ANSWERS BELOW----------------------------------------------------------------------------------------------------------------  The long form answers below reference this criteria provided by RWF CU.   The Asset Manager, Huntingdon Valley Bank Huntingdon Valley Bank has been operational since 1871. As of December 31, 2021, the Bank reported assets at fiscal year end of $557.79 million, employed about 140 people across a variety of specializations and departments, and operated nearly a dozen offices in 3 states (PA, DE, and NJ) with a geographic operating area running from New York to North Carolina and as far west as Ohio and West Virginia. In addition to its core traditional banking services that have been delivered to the communities it serves for more than 150 years, the Bank is strategically diversified and operates several specialty or niche lending or operating businesses that include, but are not limited to, residential mortgages, investment real estate, construction lending, e-commerce lending, asset-based lending, lender finance lending, personal secured and unsecured lending, syndications with other institutions, and government lending (SBA, Main Street, PPP), with experienced and seasoned personnel in each operational area. HVBank’s origination, servicing, and compliance operations are described in detail below.  HVBank’s Regulatory Oversight, Legal and Compliance, Audit and Quality Controls, Risk Management, Financial Management, Portfolio Management, Reporting to Investors, to Loan Syndication Participants, and to MakerDAO. Huntingdon Valley Bank (“HVBank”) is a full service commercial bank chartered by the Commonwealth of Pennsylvania, USA, that is owned by the holding company HV Bancorp. Inc., NYSE listed as HVBC, and headquartered in Doylestown, PA, USA. As a state chartered and publicly traded bank, it operates with regulatory oversight from The Federal Reserve System (the “Fed\"), Federal Deposit Insurance Corp (the “FDIC”), the Pennsylvania Department of Banking and Securities, and the SEC. The Bank, across all of its departments, is annually subjected to nearly 3 dozen different audits and external reviews from multiple agencies and firms. Some of the key reviews and audits are:  Regulatory: Annually the FDIC and State Department of Banking perform a complete audit of the loan portfolio, processes, departments, conflicts, etc Financial: Financial audits, along with an independent loan review (distinct from the CRF Advisor Loan Review discussed below), is provided annually by outside auditor S. R. Snodgrass, P.C. (https://www.srsnodgrass.com/) Snodgrass is an independent auditor with expertise in financial services. (financial reports: Financial Reports - As Reported Financials | HV Bancorp, Inc.) Compliance: independent regulatory and compliance oversight is supported by Accume Partners, an independent, industry-leading internal audit, risk management, compliance, and advisory firm who since 1994 has worked with over 600 banks to advise on internal and external regulatory matters (https://www.accumepartners.com/) Loan Review: the Bank’s loan portfolio is at least annually reviewed (credit quality, stress testing, credit scores, underwriting, operational excellence, etc.) by independent firm CRF Advisors, Inc. CRF Advisors is a credit risk management firm that services financial institutions, non-profit organizations, and financial services companies. They focus on assisting clients with the identification of potential credit issues through loan portfolio credit review and portfolio stress testing (http://www.crfadvisors.com/loan-review/ )  In addition to these, the Bank is a publicly-held company and subject to all required SEC reviews and reporting, including 10Qs, 10Ks, etc., all of which are available at EDGAR Entity Landing Page These are The Governance Documents of The Bank:  Bylaws of HV Bancorp, Inc. Articles of Incorporation Code of Ethics for Senior Officers Audit Committee Charter Compensation Committee Charter Nominating and Corporate Governance Committee Charter  HVBank currently has an active number of existing participations (like the participation contemplated in this MIP6) with other State or Federally-charter financial institutions, and satisfactory non-chartered financial institutions. When HVBank is “the Lead Bank” in a Participation (i.e. the Originator and Servicer of the loan to be participated), HVBank provides the participating partner institutions (e.g. MakerDAO) a participation certificate that includes the percentage of the loan, the amount of the current draw or payment, and the balance and pro rata shares of the participating loan, among other information and documentation. In addition, the Lead Bank provides to its participants all financial and operational documentation collected as a function of the loan approval and issuance. To meet any and all MakerDAO reporting requirements, HVBank has engaged RWA Company LLC (“RWAC”). HVBank will provide RWAC and The Trust Sponsor monthly servicing reports with signed verification that covenants of Master Purchase Agreement and Portfolio Purchase Agreement are met (RWAC will not be Trust Sponsor or a financial intermediary of any kind). RWAC will transmit any confidential data under NDA to the RWF (“Real World Finance”) Core Unit (“Confidential Data”). RWAC will meet all reporting requirements defined by the RWF Core Unit that are within its power and ability to perform.  The Leaders at HVBank Who Spearhead This MIP6 HVBank’s purpose is to provide superior banking services and products in a manner that brings joy to its customers by creating a culture of teamwork, candor, and positivity (the “HVB Way”) (see Purpose and Values). HVBank is reinventing local banking with superior resources and products, delivered through its customer-first philosophy, and values-driven employees. HVBank is committed to acting responsibly in every interaction to enable success for its customers and communities. Within HVBank, RWAC is working with Dan Krewson, Senior Vice President and Market President, and Hugh Connelly, Executive Vice President and Chief Lending Officer. Mr. Connelly and Mr. Krewson head up multi-disciplinary teams of experienced individuals within HVBank in commercial lending, facilitating the identification, approval, documentation, origination, and servicing of a portfolio of commercial loans. Mr. Connelly is the former President of Business Banking, Cash Management and SBA Lending at PA-based Univest Bank and Trust Co. He has more than 30 years of experience in banking and finance with his current roles at HVBank including EVP of business banking, CLO of the bank, Founder of e-commerce lending platform Braavo Bank, and oversight of all special commercial lending projects. In 2015 he led the development of a small business banking subscription product. Hugh was trained as a corporate banker in the CoreStates Bank Management Training Program. He moved through the corporate bank assuming roles of additional responsibility including developing the West Coast market and lending in Europe. He next moved into the investment bank where he helped issuers securitize over $1.2 billion in small business loans/leases. Leaving corporate America in 1999, he became a serial entrepreneur founding three specialty finance companies, VerticaLease.com, FirstLease, Inc. and Vanguard Leasing, Inc. which was acquired by Univest and re-branded Univest Capital, Inc. He received his bachelor’s in finance from Temple University, and his master’s in finance from Drexel University. He earned the Microfinance Certification jointly issued by the London based Microfinance Association and The University of Rome. Mr. Connelly earned the professional certifications of the Chartered Financial Analyst (CFA) and Certified Treasury Professional (CTP). Mr. Krewson has nearly 20 years of experience in banking and finance and in his current role at HVBank, Krewson is responsible for building commercial and specialty lending divisions. He is developing several new products and business ventures inside the institution in addition to the subject facility, including a leasehold improvement financing product, and a consumer lending product. He started his career in Philadelphia as a formally trained commercial credit analyst with National Penn Bank, later moving into commercial lending. After National Penn, he moved with a team to Valley Green Bank and spent 5 years growing the bank, which led to its eventual sale that, at the time, was the highest multiple paid for a bank in the nation in nearly a decade. Daniel then spent a few years as a national consultant and broker, advising firms on debt and funding strategies before taking a position as the Southeastern PA regional president for Mid Penn Bank and later HVBank. Daniel has helped fund, structure, or advise on more than $500 million in business loans and real estate development projects during his career. He has a bachelors of science in finance from West Chester University and an MBA from Villanova University. He graduated summa cum laude.  How Interests are Aligned in this Structure There are no known conflicts of interest and all transactions will be arm’s length. All Participated Loans are rated “6” or better (lower is better) by HVBank (ratings that are strictly audited by regulators because it is a public company and regulated bank). The Trust and HVBank together will always be the most senior debt capital and HVBank will retain a minimum of fifty percent (50%) ownership in each loan participated. As such, HVBank shares equally in losses while MakerDAO benefits from HVBank’s incentive to maximize yield. Additionally, Maker will benefit from the positive effects of HVBank being a public company with a fiduciary responsibility to its shareholders and extensive regulatory oversight. Any syndicated loan purchased by HVBank must fit the credit rating and loan type parameters of the Agreements (eliminating adverse selection risk). The MBPTrust will have a pari passu relationship with HVBank (i.e. level footing between the Parties). RWAC will pay MakerDAO’s legal fees required to structure and complete the transaction so that RWAC has financial and reputational skin in the game. RWAC’s fees will be at risk if the MBPTrust does not earn the minimum spreads over the Benchmarks. RWAC Principals hold MKR. RWAC will meet all reporting requirements defined by the RWF Core Unit that are within its power and ability to perform. RWAC will not be the Trust Sponsor or a financial intermediary of any kind.  HVBank’s Business Units, Origination Team, Technology, and Leadership Within HVBank, the origination and servicing of commercial loans is handled by business banking (“Business Banking”) division which includes (i) an Origination Department with a team of experienced lenders, business developers, and closing professionals, (ii) a Credit Department, this includes a Chief Credit Officer (CCO), a credit manager, and a team of credit analysts, (iii) a loan operations or Servicing Department, with a director of operations and a multi-member team of servicers. Mr. Connelly is the direct supervisor of the Business Banking division and Mr. Krewson is the head of the Origination Department. Connelly and Krewson, along with the CCO, the credit manager, and the director of operations (the “Executive Team”), have developed and implemented standard policies and procedures for the origination, approval, settlement, and servicing of loans from inception to termination. HVBank utilizes a suite of resources to support the origination and servicing of loans including (i) a loan accounting core system by FiServ (Financial Services Technology, Mobile Banking, Payments | Fiserv), one of the largest global providers of technology services to banks, and (ii) nCino (https://www.ncino.com/), a secure cloud-based end-to-end banking services and CRM system based on the Salesforce platform. In addition to the aforementioned, HVBank is led by a President, Robert Marino, a CEO, Travis Thompson, and a board of independently elected members. Furthermore, the Bank maintains a full-time General Counsel, Henry Van Blunk, a full-service regulatory and compliance department led by COO, Christopher Jacobs, a sub-servicing department specifically for commercial loans led by the Director of Commercial Loan Operations Jacquelyn Fitzpatrick, a full-service IT services and support department, and a finance department led by its CFO, Joseph O’Neil. A complete list of all corporate officers and directors can be found at: Corporate Governance - Officers & Directors | HV Bancorp, Inc.  HVBank’s Credit Rating System HVBank utilizes a 10-point risk rating scale to analyze every commercial loan. The proposed acceptable scale for all loans eligible for the Master Purchase Agreement are rated “6” or better (lower is better), otherwise what are commonly known as “Pass ratings”. While there exist 10 categories in HVBank’s credit rating system, the significant majority of risk ratings fall between 4 and 6, reflecting a normal risk distribution. Risk Ratings of 1, 2, and 3 are as much outliers as 7, 8, 9, and 10, with 5 being the mean and median. This is standard at most financial institutions who employ a common 10 point credit rating system. Risk ratings are first assigned to a loan during the underwriting process according to the guidelines to follow. Those ratings are recorded internally when the loan is booked and reported quarterly to the bank’s board and auditors and at least annually to its regulatory agencies, including the FDIC and PA Department of Banking, as well as periodically sampled and tested by regulators, external auditors, and internal review process. In addition, all loans, along with risk ratings, are reviewed annually through the credit process with the risk rating reconfirmed or adjusted. In general, risk ratings tend to remain stable through the life of a loan but if an adjustment is required it is made and reported immediately. Risk ratings impact capital ratios, reserves, and decisions by bank management. Any alterations to the ratings methodology below–which would first need to be authorized by the Bank’s CEO, CCO, and Board of Directors–will also be reported to RWAC and subsequently to the Maker Community.  The definitions of the scales are:  1. Substantially Risk Free (1): Loans assigned this rating would generally be characterized as substantially risk free and represent a credit extension of the highest quality. The Borrower usually has unquestionable credit capacity, exceptionally strong financial condition, low business cycle risk, excellent management. Extremely strong capacity to meet all financial obligations and access to alternative financial markets. For commercial real estate, single property situations are in coveted locations, with robust demand, underleveraged and with unquestionable existing and future cash flows. Market outlook is highly favorable. Credit tenants with long-term leases. 2. Minimal Risk (2): Loans assigned this rating would be characterized as minimal risk to Borrowers with very strong primary and secondary sources of repayment. Strong financial condition and trends, balance sheet, operation, cash flow, debt capacity and coverage ratios. No legal or other personal disputes evident or implied. No contingencies. Included in the category may be loans secured by U.S. government securities, U.S. government agencies, highly rated municipal bonds, insured savings accounts and insured certificates of deposit drawn on high quality financial institutions. For commercial real estate, single property situations are in preferred location, with strong demand, lowly leveraged and with solid current and foreseeable future cash flow. Market outlook is highly favorable. Credit tenants with long-term leases. · Industry. Minimal industry cyclicality and vulnerability to sudden economic or technological change. Capital intensiveness and degree of operating leverage modest. Highly favorable regulatory, legal and labor environments and long-term outlook. Leader with dominant share in a stable industry. · Earnings/Cash Flow. Very strong earnings trend. Continuing substantial excess cash flow and debt service coverage that has an extremely high probability to continue. Strong ability to internally fund capital expense/expansion needs. · Asset/Liability Values. Highest quality assets. Minimal or insignificant intangibles. Leverage extremely low relative to the industry. Extremely high liquidity compared to needs/liability structure. · Financial Flexibility/Debt Capacity. Substantial debt capacity with access to global capital markets virtually assured at all times. Strong capacity to meet all financial obligations. · Management. World-class organization. Highly experienced management team with-continuity and depth. Modern/highly efficient facilities and excellent internal controls. · Financial Reporting. Clean audit with no qualifications from a national accounting firm. A clean management letter from an accounting firm. 3. Modest Risk (3): Loans assigned this rating would be characterized as having modest risk to Borrowers with strong primary and secondary sources of repayment. The Borrower has the ability to perform according to all terms of the credit agreement. Modest contingencies. For commercial real estate, properties are high quality but often incur some regional tenants with moderate lease tenures. Area and property type trends are supportive of current and future debt serviceability. Properties typically financed through individual mortgages with access to multiple competing lenders. Market outlook is highly favorable. Credit tenants with long-term leases. · Industry. Industry not overly cyclical or vulnerable to sudden economic or technological change. Capital intensiveness and operating leverage modest. Favorable regulatory, legal and labor environments and long-term outlook. Near top in industry with very strong market share. · Earnings/Cash Flow. Consistently generates excess cash flow and debt service coverage with high probability to continue. Ability to provide a significant part of capital expenditure needs (expansion) internally. · Asset/Liability Values. Assets of very high quality. No reliance on the value of intangibles. Leverage is very low relative to the industry. Liability type and tenor provide a good match for the asset structure. High liquidity compared to needs/liability structure. · Financial Flexibility/Debt Capacity. Has ready access to national capital markets. Ample debt capacity. · Management. Broad industry experience with good continuity and depth in most positions. Relatively efficient operations and a high level of internal controls. · Financial Reporting. Clean audit with no qualifications from a major accounting firm. 4. Better than Average Risk (4): Loans assigned this rating would be characterized as better than average risk to Borrowers with sound primary and secondary sources of repayment. The Borrower is a reasonable credit risk and demonstrates the ability to repay the debt from normal business operations. Measurable, but acceptable contingencies. For commercial real estate, stable properties with moderate leverage. Rarely exceeds underwriting standards except during periods of temporary lease transition. Properties often incur some regional tenant risk with moderate lease tenures. Area and property type trends are supportive of current and future debt serviceability. Properties typically financed through individual mortgages with access to multiple competing lenders. Market outlook is highly favorable. Credit or strong non-credit tenants with long-term leases. · Industry. Moderate linkage to business cycle. There may be some vulnerability to sudden economic or technological change. Neutral legal, labor and regulatory environments and long-term outlook. · Earnings/Cash Flow. Positive earnings and ratio trends. Excess cash flow and debt service coverage with a good probability to continue. Good track record. Ability to provide for most capital expenditures (expansion) needs internally. · Asset/Liability Values. Assets of above average quality that are conservatively valued. Little reliance on the value of intangibles. Leverage lower than average relative to the industry. Liability type and tenor provide a good match for the asset structure. Facilities are efficient and in very good condition. Slightly higher than average liquidity compared to needs/liability compared to needs/liability structure. · Financial Flexibility/Debt Capacity. Broad access to Capital Markets or other well-regarded Banks, insurance companies, private placements, or other financial institutions. Ample debt capacity. Strong repayment history. Moderately adequate capacity to meet financial obligations over the long-term. · Management. Solid financial controls and good reporting. Moderate industry experience in most areas, adequate depth. Excellent reputation in the industry, market and/or community. Unquestioned character demonstrated by repeated performance. · Financial Reporting. Clean audit or audit with qualifications of nominal impact. Accountants review of the highest caliber from a reputable firm. Management, personal financial statements and other financial information is always timely, comprehensive and accurate. Budget variance and projection information is available in a timely fashion. Forecasts are accurate. Interim financial information required on a frequent basis. 5. Average Risk (5): Loans assigned this rating would be characterized as average risk to Borrowers with stable primary and secondary sources of repayment. Solid and generally stable financial condition offsets softer earnings, tighter cash flow, and increasing leverage. Measurable contingencies. For commercial real estate, properties are less insulated from tenant or regional impacts and extended lease turnover periods or concessions. Leverage and re-leverage often caused by expansion or acquisition. Outside support is expected to deal with periodic volatility. Market outlook is favorable. Excess cash flow and debt service coverage from recurring and stable sources. Acceptable mix of non-credit tenants, and long-term leases. · Industry. Obligor is well known in domestic/regional markets. Meaningful market share in industry. May be susceptible to unfavorable changes in the economy. Some cyclicality. Serious financial deterioration in industry is unlikely. Neutral legal, labor and regulatory environments and long-term outlook. Regulatory and legislative issues create some vulnerability but significant potential impact on Borrower not likely. Tends to be price follower with average market share and reasonable growth rate vs. local competitors. Smaller company with strong position in local market. · Earnings/Cash Flow. Average confidence in certitude of earnings, cash flow, and debt service. Trends are positive but may be somewhat inconsistent. Revenues and cash flow are not heavily reliant upon one product or customer. Contract renewal history is good. Ability to provide for some capital expenditures (expansion) needs internally. · Asset/Liability Values. Assets of average quality with ascertainable values. Fixed assets in good working order with remaining economic useful life. May have some reliance on intangibles. Leverage acceptable based on peer group and industry type. Liability type and tenor provide an average match for the asset structure. Relatively few affiliated receivables or loans. Average reliance on trade. Subordinated debt is deep and can count as equity. Facilities average or somewhat less efficient than average. Average liquidity compared to needs/liability structure. · Financial Flexibility/Debt Capacity. Readily able to refinance debt with other financial institutions at similar rates and terms. Stable and highly desirable relationship with well-regarded Banks. May be a smaller company with modest annual working capital needs and ability to clean-up. Good trade repayment history. Access to trade credit as a supplemental source of financing. Low to moderate capital asset requirements. High confidence in ability to meet debt repayment schedules over the medium term. May be slightly vulnerable over the long-term due to exposure to potentially adverse business, financial or economic conditions affecting capacity to meet long-term financial obligations. · Management. Reasonable industry experience with a modest amount of depth in key positions. Internal controls may be average quality. Proven character with demonstrated ability to deal with adversity. Average compensation levels relative to revenues and earnings. Principals have the ability and willingness to inject capital. Good labor relations. Low litigiousness potential. · Financial Reporting. Accountant’s review of high caliber from a reputable firm. Management, personal financial statements and financial information is sometimes untimely, not complete and occasionally in need of adjustments. Budget variance and projection information is sometimes late and/or inaccurate, or is not required. Forecasts are largely accurate for material items. 6. Acceptable Risk - Watch (6): Loans assigned this rating would be characterized as acceptable risk to Borrowers with acceptable primary and secondary sources of repayment, although deterioration and/or volatility is evident. Measurable contingencies exist. For commercial real estate, properties generally are higher than normal risk but cash flow and asset values are intact. Borrowers with stable fundamentals operating in soft or competitive markets property types. Also includes unseasoned, leveraged Borrowers in that growth tenant turnover, soft market fundamentals or weak management have led to declining coverage and increasing leverage. Market is very competitive; market concessions or abatements are being given. Market outlook is stable. Acceptable non-credit tenants; some short-term leases exist, but lease renewal history is good. · Industry. Competitive industry, subject to wide cyclical swings or sudden deterioration due to technological or economic factors. Long term outlook is uncertain. Barriers to entry declining. Market niche increasingly competitive. Position within industry may be deteriorating. Maintenance of market share requires exhaustive use of resources. Increasing reliance on untested products. Smaller company with average position in local market. · Earnings/Cash Flow. Earnings, cash flow and debt service are somewhat strained and subject to volatility or unproven but supported by secondary sources. Outlook uncertain. Able to provide maintenance-related capital expenditure funds but may need to borrow essentially all of expansion-related capital expenditures needs. · Asset/Liability Values. Assets of below average quality and unstable values. Significant intangibles may exist. Fixed assets near or at the end of their useful life. Leverage higher than average relative to the industry. Liability type and tenor may not provide a good match for the asset structure. Facilities outdated and generally much less efficient than average. Lower than desired liquidity compared to needs/liability structure. · Financial Flexibility/Debt Capacity. Limited access to large Banks. Strong reliance on debt financing. Could experience some difficulty refinancing with another Bank at similar rates and terms, but may have access to alternative sources, including trade. Bank relationship satisfactory. However, prone to deterioration in a difficult economy. May be smaller Borrower with consistent working capital needs and some longer-term capital needs. Substantial trade reliance with slightly blemished payment history and/or concentration of suppliers. High capital asset replacement requirements. Interest rate sensitivity creates vulnerability and limits additional debt capacity. · Management. Limited industry experience with little or no depth. Actual or potential friction between owners or potential successors. Internal controls are marginally satisfactory. Substantial manual record keeping. Acceptable character and perceived ability to deal with adversity; no basis for questions. Above average litigiousness potential. High compensation levels relative to revenues and earnings. · Financial Reporting. Audit contains qualifications that could potentially have a negative impact. Unaudited statements may not be reliable. Review quality statements supported by inadequate or inconsistent scope, frequency and timeliness. Some deviation in accounting practices cast uncertainty on the quality of information. Credibility and independence of the accounting firm may be questioned. Management financial information is not always reliable with regard to quality and/or timeliness. Interim statements and/or forecasts proven unreliable. 7. Special Mention (7): A “Special Mention” asset has potential weaknesses that deserve management’s close attention. If left uncorrected, these potential weaknesses may result in deterioration of the repayment prospects for the asset or in the institution’s credit position at some future date. Special mention assets are not adversely classified and do not expose an institution to sufficient risk to warrant adverse classification. 8. Substandard (8): A “Substandard” asset is inadequately protected by the current sound worth and paying capacity of the obligor or by the collateral pledged, if any. Assets so classified must have a well-defined weakness, or weaknesses that jeopardize the liquidation of the debt. They are characterized by the distinct possibility that the institution will sustain some loss if the deficiencies are not corrected. 9. Doubtful (9): An asset classified “Doubtful” has all the weaknesses inherent in one classified substandard with the added characteristic that the weaknesses make collection or liquidation in full, on the basis of currently known facts, conditions, and values, highly questionable and improbable. 10. Loss (10): An asset classified “Loss” is considered uncollectible, and of such little value that its continuance on the books is not warranted. This classification does not mean that the asset has absolutely no recovery or salvage value, but rather it is not practical or desirable to defer writing off this basically worthless asset even though partial recovery may be realized in the future.  Individual Investment Decision Process: “Approvers” and the “Commercial Loan Summary” HVBank Internal Approval Process: HVBank reviews all internally originated loans or identified syndications through its commercial lending department. Once a loan request has been received or a loan opportunity identified, the following process is generally followed:  The loan originator (a specialized employee of HVBank) will collect relevant information on the proposed Loan, Borrower(s), Guarantor(s) (if any), Collateral (as such), and other information pertinent to the adequate review and satisfactory approval of the specific loan request. The loan originator will then prepare an internal loan presentation for the loan approvers (the “Approvers”). The Approvers are determined by an Approval Matrix that generally includes the loan originator, the Market President, CLO, the CCO, the President, and/or the CEO. Once the Approvers, in conjunction with the loan originator and in accordance with credit policy, have determined an appropriate structure for the loan, a term sheet is then issued to the prospective Borrower. Upon acceptance of a term sheet, the loan originator then works with the credit underwriting department and the prospective borrower to evaluate the relevant metrics of the loan, confirm compliance with all rules and regulations, and prepare a Commercial Loan Summary (“CLS”) for approval (Please see the section below for additional information of the Credit Approval Process). The credit underwriting department is independent of the loan originator resulting in the end CLS being independent of the origination function. Once a loan is formally approved by the Approvers, the loan originator then works with the Bank’s loan operations departments and outside counsel as needed to prepare documents and ensure that the related file is compliant with any requirements set forth in the loan’s corresponding CLS. Once the loan has been closed and booked, the loan originator will work in tandem with the credit underwriting and loan operations teams for the life of the loan to ensure that the loan is properly managed, reported, monitored, and serviced. The management and servicing includes the ongoing collection of financial documents and metrics, and the evaluation of covenants on a basis set-forth in the loan’s corresponding CLS.  All loans are processed in this manner and HVBank will not have a separate process for Participated Loans, including those that are syndicated, that is inferior to its existing processes. All Participated Loans shall be reviewed, underwritten, approved, documented, and serviced in a manner satisfactory to all HVBank’s loans, whether participated or not. Participant Approval Process MakerDAO and the Trust shall have their own approval process independent of the HVBank approval process. MakerDAO and the Trust will have entered into all agreements, including all participations, with HVBank representing that, to the best of its knowledge, based on the information provided by its borrowers and based on its underwriting, all loans fall within the collateral guides of the Agreements. A Collateral Management Agent may be hired to make the same representations (potentially this Collateral Management Agent job is performed by the same Delaware Corporate Trustee). This Collateral Management Agent and/or the Corporate Trustee will make its own independent investigation of each Participated Loan to ensure conformity with the Agreements and to approve each Participation by the MBPTrust. Neither (a) the execution and performance of the agreements contemplated herein and the ownership of Participation Interest(s), nor (b) the sharing in the profits or losses arising from the transactions contemplated by the agreements contemplated herein, is intended to be, nor shall be construed to be, the formation of a partnership or joint venture between HVBank and MakerDAO and the Trust, or any of them. HVBank makes no representation or warranty to MakerDAO and the Trust regarding (a) the collectibility of the Participated Loan(s); (b) the existing or future financial condition of any borrower, or any other party liable for repayment of the Participated Loan(s); (c) the value or any other condition of any collateral securing the Participated Loan(s); or (d) the accuracy of any information supplied or to be supplied.  Investment personnel for fund and individual investments The credit approval process begins following the acceptance of a term sheet by a prospective borrower according to the process described above. Additional details include:  The loan originator will collect relevant financial and non-financial information from the borrower and complete a checklist which is sent to the commercial credit manager. The commercial credit manager reviews the checklist to ensure the file is complete and then assigns a credit analyst to complete the CLS. The credit approval process, following the assignment of a credit analyst, is an iterative process in which the loan originator and credit analyst will work together with the prospective borrower to analyze and properly present the credit and non-credit characteristics of the loan in the CLS. Once completed, the CLS is then sent to the Approvers. The Approvers, which are based on predetermined matrices with credit, dollar amount, and relationship exposure modalities, will either (1) approve the CLS as presented, (2) deny the CLS as presented, or (3) send the CLS to the loan originator and credit analyst with additional questions, comments, or suggestions. If the CLS is sent to the loan originator and credit analyst, the iterative process begins again until the Approvers questions, comments, or suggestions are addressed. Formal signatures are collected following a verbal approval of the Approvers, if the CLS is approved as presented. If the CLS is denied, it is removed from the Bank’s underwriting system, and a loan declination letter is sent to a borrower.  The credit function of the bank is distinctly separate from the loan origination function, the former reporting through the CCO and the latter the CLO. This creates a separation of responsibilities and inherent checks and balances. An internal Asset and Liability Committee (ALCO) meets monthly to review the Bank’s portfolio mix and concentrations – accordingly adjusting or making recommendations as necessary. It is a dynamic, but carefully managed process.  Process for changing Investment Guidelines and Policies All decisions are handled via credit policy. All changes to credit policy, i.e. investment guidelines and policies, are handled by the CCO, CLO, President, CEO, and Board of Directors  Process for Transitioning to Another Asset Manager If Master Servicer, Servicer, or Special Servicer is guilty of gross negligence or willful misconduct the Trustee may appoint a new Master Servicer, Servicer, or Special Servicer in accordance with the Trust Agreement or Portfolio Purchase Agreement.  Asset Manager Historical Performance HVBank has provided consumer and commercial banking services since 1871. HVBank is in the business of making many forms of commercial loans to US businesses primarily in the Mid-Atlantic region. The Bank currently has a legal lending limit of around seven million dollars ($7M) per borrower relationship. For the quarters 2Q21, 3Q21, and 4Q21, HVBank’s Commercial Lending Division originated new commercial loan production of $42.4M, $27.6M, and $49.6M, respectively. In the 1Q22, HVBank originated year-to-date $31.1M with an additional $46M in underwriting or closing processes. On the 2021 commercial loan production, the gross interest yield on all non-construction loans averaged about 4.50%, gross interest yield on construction loans averaged about 5.0%, and the total weighted average gross interest yield averaged about 4.65%. For the year ended 2021, HVBank as a whole reported $210,000 of loan losses (losses incurred on an outstanding loan) on total average assets at FYE of $554.4 million (average loans of $313.8 million) and total outstanding loans at FYE of $376.5 million, for a credit loss rate of around 0.06%. Total average assets includes treasury securities, cash, investments, deposits at other banks, loans held for sale (residential mortgages), and outstanding loans (loans receivable) net of allowance for loan losses.  The Proposed First Portfolio Purchase Agreement Huntingdon Valley Bank seeks to enter into one or many Portfolio Purchase Agreements with this Multi-Bank Participation Trust whereby HVBank can participate loans to the Trust in furtherance of MakerDAO’s goals for Dai stability, collateral diversification, and yield. As a First Portfolio Purchase Agreement proposed herein, the Trust would participate, pari passu, in loans (the “Participated Loans”) that are either originated by HVBank or–as a mechanism to scale and diversify assets –loans purchased or syndicated from another acceptable State or Federally-Chartered financial institution, with each Participated Loan assigned a credit rating by HVBank of “6” or better (lower is better) out of 10 (credit rating details herein). These credit ratings are audited by regulators and other third parties numerous times per year. Collateral for the First Portfolio Purchase Agreement: HVBank proposes that in the First Portfolio Purchase Agreement, MakerDAO consider loan participations in Commercial Real Estate or Commercial Business Loans, because the underlying collateral is real and, in the event of a Borrower’s Default, the position can be liquidated by HVBank and the MBPTrust with minimal slippage. The MBPTrust and HVBank benefit from HVBank’s expertise (as “Special Servicer”) in liquidating real assets. For all assets originated by HVB, they have acted as Servicer for the entirety of their 150+ years in business. In general, HVBank typically does not engage in unsecured, i.e. loans without collateral, or non-recourse, i.e. loans without the personal guarantee of their principals, lending. This is typical of commercial banks, who generally issue secured loans with guarantees, unless there is a material mitigating circumstance (e.g. (i) highly liquid and high net worth guarantors, (ii) significant and consistent cash flows coupled with other exemplary factors, (iii) loan type specific features such as unsecured personal loans, or (iv) partial collateralization due to the structure of the loan or the nature of the business or industry). In all cases, HVBank is competently reviewing all business and loan factors, credit factors, external factors, and available information to make a determination regarding the appropriateness of security and recourse. HVBank proposes that MakerDAO, through the MBPTrust, consider loans in the categories to follow that are (i) primarily secured, (ii) financing supported by satisfactory operating entities, (iii) and indicate sufficient cash flows: 1. Amortizing CRE Mortgages – mortgage loans secured by investment properties with sufficient cash flows. These loans offer MakerDAO predictable loan balances and interest income. These loans have fixed interest rates and terms. The MBPTrust would make a one-time advance for its participation and receive steady cash flows on principal and interest over the remaining loan term. These loans, generally, have a 5 year term, but can extend up to 10-years based on market conditions, competition, rate environment, and borrower preferences. Interest rates are generally fixed only up to 5-years with longer terms subject to floating rates or rate resets to mitigate interest rate risk. 2. Construction Loans – non-revolving, multi-advance lines of credit for the purpose of supporting construction. These loans have higher yields and shorter loan terms offering MakerDAO an opportunity to generate interest income from floating rate loans. The MBPTrust and HVBank would make an initial advance and then be required to make additional advances as the construction project progresses. Upon completion the loan would be repaid in full from a sale or convert to an Amortizing CRE Mortgage. These loans have a 12-24 month terms. These loans are typically floating rate but convert to a fixed rate if held through conversion. 3. Lender Finance Lines - senior revolving lines of credit to direct lenders of the first two types of loans – HVBank has a niche lending area with this type of private direct lender with about $30M to $40M in the portfolio. The Private Direct Lenders’ loans to their borrowers have higher yields and shorter terms and interest is generated from floating rates. The collateral pool is generally more widely distributed, offering an additional layer of diversification. The MBPTrust and HVBank (pari passu) would make an advance based on a pool of collateral managed by HVBank or a third-party custodian, with advances adjusting monthly. These loans are revolving in nature and extend for at least 12 months. 4. Business Loans – term loans and lines of credit for non-real estate operating businesses that are primarily secured by trading assets (accounts receivable, inventory, equipment) and enterprise value of the operating company that evidence sufficient cash flows to support historical and pro forma debt service. These loans to businesses diversify the asset pool while providing strong yields and staggered maturities. Advances by the MBPTrust and HVBank (pari passu) would be based on a predetermined agreement and generally not more than once a month. These loans can be fixed or floating rate with maturities of up to 5-years. 5. SBA Loans – generally Business Loans with an SBA guarantee provided on up to 75% of the principal amount of the loan. SBA guarantees are typically pursued due to a specific event, for example, leveraged buyout, business acquisition, collateral shortfall, length of experience, or expansion. SBA Loans are always required to maintain upfront satisfactory cash flow coverage and seek to take all available collateral, business and personal, as a function of approval. Advances by HVBank and the MBPTrust would generally occur at the time of issuance; however, SBA Loans can sometimes offer a revolving or multi-advance feature. These loans can have maturities of up to 10-years and are generally floating rate. 6. Capital Call Lines – loans to private equity funds that are supported by the assets of the funds, specifically, the uncalled equity commitments. These loans are subjected to strict borrowing conditions and advance rates and support funds that generally invest in one of the preceding categories. The nature of these funds means that the end collateral and investments are more diversified than direct loans to subject borrowers with risk diluted across a wider base. Advances by the MBPTrustand HVBank (pari passu) would be based on a predetermined agreement and generally not more than once a month. These loans are typically committed for 12 to 36 months with floating rates. The following table is a generalized breakdown of pricing type (fixed or floating) by Loan Category. In practice, the loan portfolio is generally half floating and half fixed adjusting from time to time as Loan Categories wax and wane throughout the year.  It is understood that the MBPTrust and HVBank will enter into legally enforceable agreements that will ensure the compliance of all pledged assets with RWF CU’s Investment Criteria. However, it is the sole responsibility of MakerDAO and the MBPTrust to determine that the participation complies with any RWF CU requirements. HVBank makes no warranties or representations regarding compliance with any Investment Grade Debt requirements. Participation Terms: MakerDAO’s security interest in the loan documents and associated collateral would be apportioned through a Master Purchase Agreement (and Portfolio Purchase Agreement(s)) or a Master Credit Agreement vis a vis the MBPTrust. For the HVBank Participated Loans, HVBank will retain a minimum of fifty percent (50%) ownership. Over time, HVBank will petition MakerDAO to reduce the minimum ownership percentages on Participated Loans such that HVBank proposes to retain down to a minimum of five percent (5%) ownership at all times. Any loan originated, participated or syndicated through the MBPTrust will meet all standard credit and risk conditions of HVBank described herein, and be any type of loan HVBank originated or purchased in its ordinary course of business, generally fitting one of the aforementioned Loan Categories (i) through (vi).  Loan Participation Eligibility Criteria: In order to expedite MakerDAO’s loan review process, HVBank proposes offering for participation loans that match the following criteria. 1. Preliminary Conditions:  Loan is currently in good standing with the Bank Properly collateralized Satisfactory cash flow coverage of loan payments (for new construction, satisfactory payment plan during construction and satisfactory pro forma cash flow based on underwriting of the subject property and market fundamentals following completion) No events of default No loans to insiders or other Reg O All loans meet standard compliance measures, searches, etc.  2. Commercial Construction and Investment Real Estate Secured Loans     Internal Risk Rating PASS or better (6 or better)     Loan Type Amortizing commercial mortgage   Credit Score(s) Principals Minimum of 680; no bankruptcy within last 10 years   LTV (Loan to Value) Maximum LTV of 75%; appraised value determined by an independent appraiser and reviewed by a third party appraisal management firm to confirm property value and compliance with all FIRREA regulations   Debt Service Coverage Minimum of 1.20x, as consistently measured by Bank’s credit policy   Covenants Compliance with all financial and affirmative covenants   Default No current, ongoing, or unresolved event of default, as defined by the loan documentation   Good standing Account considered to be in good standing at the financial institution    3. Non Investment Real Estate Business Loan     Internal Risk Rating PASS or better (6 or better)     Loan Type(s) Amortizing commercial mortgage (owner occupied)   Credit Score(s) Principals Minimum of 680; no bankruptcy within last 10 years   LTV Maximum LTV of 80%; appraised value determined by an independent appraiser and reviewed by a third party appraisal management firm to confirm property value and compliance with all FIRREA regulations   Debt Service Coverage Minimum of 1.20x, as consistently measured by Bank’s credit policy   Covenants Compliance with all financial and affirmative covenants   Default No current, ongoing, or unresolved event of default, as defined by the loan documentation   Good standing Account considered to be in good standing at the financial institution    4. Other Business Loans     Internal Risk Rating PASS or better (6 or better)     Loan Type(s) Amortizing term loan; revolving line of credit   Credit Score(s) Principals Minimum of 680; no bankruptcy within last 10 years   LTV and Advance Rates Properly collateralized based on acceptable advance rates as determined by the Bank’s credit policy; proper periodic reporting of advance rates and borrowing base reports if required   Debt Service Coverage Minimum of 1.20x, as consistently measured by Bank’s credit policy   Covenants Compliance with all financial and affirmative covenants   Default No current, ongoing, or unresolved event of default, as defined by the loan documentation   Good standing Account considered to be in good standing at the financial institution    Process: Following initial review, approval, and documentation of the Participation Fund program with Maker.  Upon HVBank presenting a participation opportunity, the MBPTrust will receive access to a secured online data room folder which will contain a copy of HVBank’s underwriting memo and associated loan documents. The MBPTrust will review and respond with a purchase decision within five (5) business days. Once the MBPTrust agrees to participate, a subject participation agreement will be prepared and sent to the Trust for execution (subject to the terms of the Master Purchase Agreement and Portfolio Purchase Agreement between the Trust, and HVBank). Upon execution the MBPTrust will advance its funds within 24 hours via Fedwire in US dollars. If multiple advances are required, the MBPTrust will receive a Participation Receipt or Notice indicating the amount of the advance and the required timing, no less than once a month during the term of each loan.  Monthly as loan payments are received, HVBank will remit to the Trust’s account all monies received and owed to it, less any servicing fees, in accordance with the Participation Agreement. HVBank will remit said funds to the Trust within three (3) business days of receipt and reconciliation. HVBank will remit funds to the Trust via Fedwire in US dollars. HVBank will be the Servicer and, as needed, the Special Servicer, utilizing HVBank’s full Servicing Departments and Special Servicer expertise, which handles nearly one billion dollars of annual loan transactions. All HVBank Originated commercial loans will use Pennsylvania law and will contain a Confession of Judgment provision which gives the lender enormous leverage in the event of a borrower default. Unless otherwise required, HVBank will seek to use Pennsylvania law in all commercial loans, including syndications, and therefore obtain a Confession of Judgment. Fees for the Loan Servicing (by HVBank), fees for Loan Reporting by RWA Company LLC (“RWAC”), and fees for governance-work by RWAC are collectively the “S,G,&R Fees”. The total S,G,&R Fees will be equal to one and one-quarter of one percent (1.25%) per annum on the first $10,000,000 participated to the MBPTrust of each individual Participated Loan (the “Base Loan Balance”). Over the Base Loan Balance, S,G,&R Fees on amounts participated to the MBPTrust out of each Participated Loan shall be three quarters of one percent (0.75%) per annum. For example, if HVBank participates $12M of a loan ($24M total loan size) to the MBPTrust, the S,G,&R Fees shall be ($10MM * 1.25%) + ($2M *.75%) = $125,000 + $15,000 = $140,000 per year, reducing proportionately to any amortization of the underlying loan (S,G,&R Fees decline on each participated loan as each loan amortizes). These Servicing Fees include 50 bps (0.50%) of G&R Fees paid to RWAC for that work, but RWAC’s G&R Fees shall be at risk if the MBPTrust fails to achieve the guaranteed minimum yields promised so that the existing and ongoing alignment of interests between RWAC and MakerDAO is reinforced.  Historical Performance With These Loan Types HVBank currently has a legal lending limit of around seven million dollars ($7M) per borrower relationship. “Legal Lending Limit” is a regulated term and is proportionate to a certain tier of the Bank’s capital. Thus, as the Bank’s capital base grows its Legal Lending Limit proportionately grows. The proposed relationship with MakerDAO and proposed facility will be strategic insofar as it allows the Bank to grow. HVBank has been participating in loan syndications as the Syndicator and as the Participant for many decades and has team members currently on staff with extensive syndication expertise. The Bank will hire additional personnel to support syndications, as well as the entire Master Purchase Agreement arrangement, as needed. For the quarters 2Q21, 3Q21, and 4Q21, HVBank’s Commercial Lending Division originated new commercial loan production of $42.4M, $27.6M, and $49.6M, respectively. In the 1Q22, HVBank originated year-to-date $31.1M with an additional $46M in underwriting or closing processes. On the 2021 commercial loan production, the gross interest yield on all non-construction loans averaged about 4.50%, gross interest yield on construction loans averaged about 5.0%, and the total weighted average gross interest yield averaged about 4.65%. For the year ended 2021, HVBank as a whole reported $210,000 of loan losses (losses incurred on an outstanding loan) on total average assets at FYE of $554.4 million (average loans of $313.8 million) and total outstanding loans at FYE of $376.5 million, for a credit loss rate of around 0.06%. Total average assets includes treasury securities, cash, investments, deposits at other banks, loans held for sale (residential mortgages), and outstanding loans (loans receivable) net of allowance for loan losses.  Annual and Quarterly Public Filings: As of 09/30/21 (last reported quarterly filings): Travis J. Thompson, Esq., Chairman, President & CEO, commented, “We are pleased with HVB’s outstanding year to date performance as Residential Mortgage maintained its robust pace closing 1,885 new loans totaling $490 million, while our Business Banking team successfully facilitated $95.1 million in Paycheck Protection Program loan forgiveness in addition to new commercial loan originations totaling $105.6 million.” Total assets decreased $325.3 million to $536.3 million at September 30, 2021, from $861.6 million at December 31, 2020. The decrease was primarily the result of decreases of $329.9 million in cash and cash equivalents and $14.9 million in net loans held for sale (residential mortgages), offset by increases of $15.8 million in investment securities, $1.4 million in mortgage servicing rights and $1.2 million in right-of-use assets, and $864,000 in other assets. Cash and cash equivalents decreased $329.9 million to $84.7 million at September 30, 2021 from $414.6 million at December 31, 2020 as a result of anticipated outflows of retail deposits from certain accounts (PPP - deposits swelled and then declined).   s25.q4cdn.com    Press-Release-for-9-30-21-final.pdf 462.24 KB      As of 12/31/20 (last reported annual filings): Total assets increased $507.0 million, or 143.0%, to $861.6 million at December 31, 2020, from $354.6 million at December 31, 2019. The growth in total assets was primarily due to increases of $394.0 million in cash and cash equivalents $58.8 million in loans receivable, $45.7 million in loans held for sale, $2.4 million in available-for-sale securities, $2.0 million increase in mortgage servicing right, $1.7 million in operating lease right-of-use asset and $1.7 million in mortgage banking derivatives.   s25.q4cdn.com    Press-Release-December-31-2020-draft-8.pdf 249.23 KB       Three year financial model including required funding The proposed initial debt ceiling for the First Portfolio Purchase Agreement is one-hundred million dollars ($100M) of HVBank Participated Loans diversified across all proposed Loan Categories (i) through (iv), including Syndicated Loans, to be deployed over a period of twelve (12) to twenty-four (24) months from inception. $100M is intended to be the balance of the MBPTrust, and corresponds to an additional $100M of assets on HVBank’s own balance sheet, subject to the maintenance of a 50% pro rata participation interest percentage. MakerDAO and the Trust agree that the Participation Fund shall be adequately funded at all times during this initial period to meet the funding needs of the First Portfolio Purchase Agreement (while the vault debt ceiling is available after MakerDAO governance approval, and the Trust facility is funded up-front from the vault, the facility will not not funded in-full or any more than reasonable for operations, expected fundings, and any other required expenses such a loan loss reserve that mirrors HVBank’). The guaranteed minimum net floating rate yield to the Multi-Bank Participation Trust (the “MBPTrust”, for the benefit of MakerDAO) at the time of origination and participation is 75 bps over the one (1) month SOFR (replacement for LIBOR) (currently 0.083%, so the guaranteed minimum net floating rate yield to the MBPTrust would currently be 0.883%). The guaranteed minimum net fixed rate yield to the MBPTrust at the time of origination and participation is 30 basis points (“bps”) over the closest like-term US treasury yield (e.g. currently 2.310% for the 5yr Treasury, so the guaranteed minimum net fixed rate yield to the MBPTrust would currently be 2.610% on a 5yr loan). MakerDAO will be the beneficiary of over-performance and HVBank is incentivized to over-perform for MakerDAO. At the current benchmark rates, the expected net yield to the MBPTrust (net of expected S,G,&R Fees) at the time of origination and participation is conservatively 3.00%. The intention of the portfolio is to have a mix of fixed and variable rates that hedge overall rate exposure, balancing yield with other risk factors. HVBank has drafted a financial model for participation of a forward flow of loans into the MBPTrust over 24 months (8 quarters) and will share that financial model for review in detail. HVBank can share a more detailed financial model as needed. At MakerDAO’s option, for the purpose of scaling and diversifying real world asset collateral, The MBPTrust could expand the scope of the First Portfolio Purchase Agreement or enter into additional Portfolio Purchase Agreement(s) with HVBank, with debt ceilings(s) to be determined at the time of approval and issuance, allowing for the Trust to purchase loans originated by HVBank (or syndicated, on the market, with HVBank’s coordination and participation), with floating and fixed rates (if fixed, not for more than 5 years) in one of these Additional Loan Categories:  (vii) residential mortgages that conform to Agency Requirements (“Agency Residential Loans”) (viii) residential mortgages originated by HVBank that advantage crypto holders (“Crypto Primary Residence Loans”); and (ix) a portfolio of performing unsecured consumer loans (“Personal Loans”)  The Agency Residential Loans, Crypto Primary Residence Loans, and Personal Loans (collectively the “Additional Loan Categories”) allow the Trust to diversify its investments into a wider range of asset classes and debt types. The Subsequent Portfolio Purchase Agreement(s) will contain mutually agreed upon parameters between the Trust and HVBank, including that HVBank retain a minimum ownership sufficient to align the Bank’s interests with MakerDAO, that loans are rated “6” or better (lower is better)by HVBank’s credit assessment, and that HVBank service the loans. These Additional Loan Categories are not included in the First Portfolio Purchase Agreement and are being highlighted as an option for Subsequent Portfolio Purchase Agreements that increase scale and diversification of real asset collateral for Dai. Any Subsequent Portfolio Purchase Agreement(s) will contain mutually agreed upon parameters between the Trust and HVBank, including that HVBank retain a minimum ownership sufficient to align the Bank’s interests with MakerDAO, that loans are rated “6” or better (lower is better) by HVBank’s credit assessment, and that HVBank service the loans.  1423×1034 13.1 KB   Transaction Financial Structure The transaction financial structure intends to establish a special purpose vehicle that is a Delaware statutory trust (“DST”) called the Multi-Bank Participation Trust ( the “MBPTrust”) such that the MBPTrust can enter into a distinct Portfolio Purchase Agreement with Huntingdon Valley Bank (and, after finding success with HVBank, MakerDAO may onboard other commercial banks from time to time as opportunities arise). MakerDAO and the Trust agree that the Participation Fund shall be adequately funded at all times during this initial period to meet the funding needs of the First Portfolio Purchase Agreement (while the vault debt ceiling is available after MakerDAO governance approval, and the Trust facility is funded up-front from the vault, the facility will not be funded in-full or any more than reasonable for operations, expected fundings, and any other required expenses such a loan loss reserve that mirrors HVBank’s standard reserves). The Trust will contain a revolving pool of assets, where HVBank participates assets to the Trust and services the assets as they amortize or revolve. The Portfolio Purchase Agreement will stipulate mechanisms to ensure that (i) the new on-boarded assets meet the eligibility criteria set forth in the financing documents and (ii) HVBank will act to make sure the Trust’s overall portfolio maintains the stipulated risk retention standards.  Cash flow diagram (Dai to USD to Dai)  721×522 34.6 KB   Priority of Payments Funds are first applied to interest and fees, secondly to principal due, and thereafter to other costs such as Trustee Fees and S,G,&R Fees. Monthly, as loan payments of principal and interest are received, HVBank will remit to the Trust’s account all monies received and owed to it, less any S,G,&R Fees, in accordance with the Participation Agreement. HVBank will remit said funds to the Trust within 3 business days of receipt and reconciliation. HVBank will remit funds to the Trust via Fedwire in US dollars. Recurring transaction expenses, such as Trustee and S,G,&R Fees shall be taken from interest payments from loans owned by the Trust. RWAC’s G&R fees are at risk if the guaranteed minimum yield is not achieved. Dai slippage is currently taken from interest payments from loans owned by the Trust (but should be negligible due to PSM and broker-dealer TWAP).  Trust Account Control The SPV will be a Delaware Statutory Trust that is Administered by a regulated corporate Trustee in Delaware. The Trustee will be a financial institution that is well capitalized and that carries insurance such as Directors and Officers insurance and/or errors and omissions insurance. This Trust will be a Directed Trust, and the Trust Sponsor which provides this direction will be an entity which ultimately seeks its own direction from a committee appointed by MakerDAO. The Trust Sponsor will have limited administrative and commercial decision-making power, and all material terms in the Purchase Agreement will not be amendable without the affirmative vote of MakerDAO - as verified by the Delaware Trustee (acting as the “Verification Agent’'). Payment from the MBPTrust account to the Dai vault may be directed by the Counterparty, Trust Sponsor, RWAC or the Trustee - all of whom may be listed as eligible to direct transfers of capital back to MakerDAO.  Transaction Legal Structure While the legal structure proposed is contemplated to have a Trust Sponsor, a Delaware Statutory Trust, a Trustee, and Participation Agreements (collectively the “Transaction Documents”), the final Transaction Documents will emerge from arm’s length negotiation between the parties and the support of counsel.  821×501 30.2 KB  MakerDAO will engage legal counsel (through core unit(s) as needed). Subject to external counsel’s consent and internal on-boarding processes, the same counsel will represent RWAC and relevant core units. RWAC’s payment of the proposed transaction’s legal fees is to give it financial and reputational skin in the game. To the extent of any unforeseen conflicts that require the relevant core units to engage separate counsel, such determination will be made by the incubating Legal and Transactional Services core unit at the time. This will be a cost for Maker. RWAC is building a (wide) bridge between regulated banking systems and (regulated) Decentralized Finance. These Trust and Transaction Agreements are an important open source primitive for DeFi to do business with TradFi. A Delaware Statutory Trust structure has been used previously with 6S Capital’s MakerDAO Vault and the legal documents for that structure are viewable here: https://www.rwa.company/6scapital The Delaware Statutory Trust is a legal entity purposely built for bankruptcy remoteness and this article covers the key features that make DSTs ideal for structured finance. For loans participated to the Trust, HVBank will be the Servicer and, as needed, the Special Servicer, utilizing HVBank’s full Servicing Departments and Special Servicer expertise, which handles nearly one billion dollars of annual loan transactions. HVBank loans will primarily use Pennsylvania law and will, if under Pennsylvania law, include a Confession of Judgment provision which gives the lender enormous leverage in the event of a borrower default.  MakerDAO Specific Issues: A Legal Structure for the Benefit of MakerDAO Huntingdon Valley Bank intends to use a modified version of the Delaware statutory trust structure used in the 6s Capital Vault. MakerDAO will engage (directly or through an authorized Core Unit) a high quality, experienced law firm to advise on the structuring, tax, and regulatory compliance of the MBPTrust. RWAC will pay MakerDAO’s legal fees (see above). RWAC’s payment of legal fees equates to RWAC’s skin in the game beyond its reputation. The proposed MakerDAO Bank Participation Trust or Multi-Bank Participation Trust (the “MBPTrust”) Structure is formed in the following manner and addresses the MakerDAO Specific Issues as follows:  A Trust Sponsor  The MBPTrust is formed by a Trust Sponsor. The Trust Sponsor is currently proposed to be a Cayman Islands Foundation, whose sole legal representative is its Supervisor. The jurisdiction and corporate structure of the Trust Sponsor may be amended on the advice of counsel. The Cayman Foundation, in its capacity as Trust Sponsor, will seek instruction from a committee elected and maintained by Maker Governance. It will pass this instruction to the Delaware Trustee when appropriate. It is anticipated that the Trust Sponsor will occasionally be required to weigh in on commercial and managerial issues with the facility. The Trust Agreement itself and any material term (the definition of which will be mutually defined by HVBank and the relevant Core Units) in the credit agreement may only be amended by using a Verification Agent, which checks for the affirmative vote of MakerDAO to corroborate the content of any amendment. The Trust Sponsor will issue irrevocable instructions to the Delaware Trustee and to the broker-dealer in order to ensure the security of cash flows.   A Delaware Statutory Trust (the “MBPTrust)  The MBPTrust is a legal entity which will purchase and custody the assets, or liens over assets. It is proposed to be a Delaware Statutory Trust. This entity will enter into a Master Purchase Agreement (and Portfolio Purchase Agreement(s)) or a Master Credit Agreement with Huntingdon Valley Bank (the “Transaction Documents”). Said Transaction Documents will provide clear rules around the ability of Huntingdon Valley Bank to participate loans to the MBPTrust. All Transaction Documents pertaining to or entered into by the MBPTrust will require an affirmative vote of MakerDAO, via a Verification Agent, to amend. Any actions deemed “immaterial” in the agreements will be referred to the Trust Sponsor. The Delaware Trustee will have irrevocable instructions from the Trust Sponsor to only transfer USD from its escrow account to the Trust or to the bank account of the broker-dealer.   A Broker-Dealer  In order to ensure secure transactions from Dai to USD and vice-versa, the address of a regulated broker-dealer will be encoded into the MIP21 secure conduit. It is only this entity which will ever touch Dai. The broker-dealer has irrevocable instructions from the Trust Sponsor to only exchange Dai for USD and vice-versa based on pre-agreed upon terms and may only send that Dai or USD to the Trust Sponsor’s escrow account with the Trustee’s bank or to the secure conduit.     MakerDAO Specific Issues: Mandatory and Administrative Decisions The terms and the final Agreements for the MBPTrust will be approved by a vote of MKR token holders. Thereafter, decisions by all Parties will be in accordance with those Agreements and if the Agreements are ambiguous then clarifying amendments will be brought to an MKR vote or to a trusted third party appointed by an MKR vote. ",
                    "links": [
                        "https://docs.google.com/document/d/1gkHXiCbkN2A_HLMRD4Wfur753Dwa6cxULfuThwSdoz8/edit?usp=sharing",
                        "https://static1.squarespace.com/static/60942fb61249302a48a934a5/t/623dd89ebe079b28f03e6768/1648220318486/MIP6+-+HVBank+-+Final+-+3.25.2022.pdf",
                        "https://static1.squarespace.com/static/60942fb61249302a48a934a5/t/623dd89ebe079b28f03e6768/1648220318486/MIP6+-+HVBank+-+Final+-+3.25.2022.pdf",
                        "https://static1.squarespace.com/static/60942fb61249302a48a934a5/t/623dd89ebe079b28f03e6768/1648220318486/MIP6+-+HVBank+-+Final+-+3.25.2022.pdf",
                        "https://www.hvbancorp.com/corporate-profile/default.aspx",
                        "https://docs.google.com/spreadsheets/d/1YTJfTuER5CKcD3bavPy5ga5iy_l-q0yYGobbxEOhMxo/edit?usp=sharing",
                        "https://www.macelree.com/confessions-of-judgment-why-should-you-care/",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697/5",
                        "https://www.nyse.com/quote/XNCM:HVBC",
                        "https://www.nyse.com/quote/XNCM:HVBC",
                        "https://www.srsnodgrass.com/",
                        "https://www.hvbancorp.com/financial-reports/as-reported-financials/default.aspx",
                        "https://www.accumepartners.com/",
                        "http://www.crfadvisors.com/loan-review/",
                        "https://www.sec.gov/edgar/browse/?CIK=1594555&owner=exclude",
                        "https://www.hvbancorp.com/corporate-governance/documents/default.aspx",
                        "https://s25.q4cdn.com/332646200/files/doc_downloads/governance/Bylaws-of-HV-Bancorp-Inc..pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_downloads/governance/Articles-of-Incorporation.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_downloads/governance/Code-of-Ethics-for-Senior-Officers.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_downloads/governance/Audit-Committee-Charter.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_downloads/governance/Compensation-Committee-Charter.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_downloads/governance/Nominating-and-Corporate-Governance-Committee-Charter.pdf",
                        "https://www.myhvb.com/Purpose-and-Values.aspx",
                        "http://VerticaLease.com",
                        "https://www.fiserv.com/en.html",
                        "https://www.ncino.com/",
                        "https://www.hvbancorp.com/corporate-governance/board-of-directors/default.aspx",
                        "https://docs.google.com/document/d/1YppU47s6gqdwejqaqRTPD104p2OWeCeVie-5eI4N1YQ/edit#heading=h.3pp52gy",
                        "https://www.macelree.com/confessions-of-judgment-why-should-you-care/",
                        "https://s25.q4cdn.com/332646200/files/doc_news/2021/11/Press-Release-for-9-30-21-final.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_news/2021/11/Press-Release-for-9-30-21-final.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_news/2021/11/Press-Release-for-9-30-21-final.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_news/2021/11/Press-Release-for-9-30-21-final.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_news/2021/Press-Release-December-31-2020-draft-8.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_news/2021/Press-Release-December-31-2020-draft-8.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_news/2021/Press-Release-December-31-2020-draft-8.pdf",
                        "https://s25.q4cdn.com/332646200/files/doc_news/2021/Press-Release-December-31-2020-draft-8.pdf",
                        "https://www.rwa.company/6scapital",
                        "https://www.morrisjames.com/newsroom-articles-Overview-of-the-Delaware-Statutory-Trust-Act-in-Structured-Finance-Transactions.html",
                        "https://www.macelree.com/confessions-of-judgment-why-should-you-care/",
                        "https://forum.makerdao.com/t/mip70-huntingdon-valley-bank-self-contained-onboarding-strategy-execution/14468",
                        "https://forum.makerdao.com/t/6s-capital-rwac-monthly-report-march-2022/14532/4",
                        "https://forum.makerdao.com/t/mip6-application-rfa-canadian-federally-regulated-mortgage-originator/17303/24",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/6",
                        "https://forum.makerdao.com/t/collateral-onboarding-and-management-update/17441",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-junio-05-de-julio-del-2022/16473",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-additional-risk-assessment-love-cu-in-incubation/15886",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-rwa-collateral-onboarding-risk-assessment/15828",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/57",
                        "https://forum.makerdao.com/t/mip117-rwa-master-participation-trust-to-onboard-loanstreet-as-loan-liquidator/19772",
                        "https://forum.makerdao.com/t/mip95-100m-of-cogent-bank-loan-participations/19338/17",
                        "https://forum.makerdao.com/t/know-your-mip-19-mip95-cogent-bank/19705",
                        "https://forum.makerdao.com/t/mip95-100m-of-cogent-bank-loan-participations/19338",
                        "https://forum.makerdao.com/t/2-boletin-de-noticias-diciembre-del-2022/19316",
                        "https://forum.makerdao.com/t/mip90-liquid-aaa-structured-credit-money-market-fund/18428",
                        "https://forum.makerdao.com/t/poll-inclusion-request-hvbank-legal-update/17547/8",
                        "https://forum.makerdao.com/t/the-schuppi-and-elpro-delegate-happy-hour-featuring-greg-diprisco-of-rwa-co/17346",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-blocktower-credit-arranger/16900",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-julio-del-2022/16629",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/17",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/4",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/29",
                        "https://forum.makerdao.com/t/this-week-in-governance/16382/2",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/51",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/82",
                        "https://forum.makerdao.com/t/governance-house-delegate-platform/15191/8",
                        "https://forum.makerdao.com/t/rwa009-huntingdon-valley-bank-collateral-onboarding-oracle-assessment/16069",
                        "https://forum.makerdao.com/t/rwa009-hvbank-mip21-token-ces-domain-team-assessment/15861",
                        "https://forum.makerdao.com/t/rwf-collateral-onboarding-update-huntingdon-valley-bank/15015",
                        "https://forum.makerdao.com/t/the-official-welcome-thread/771/122",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/38",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/70",
                        "https://forum.makerdao.com/t/governance-and-risk-187-thursday-april-21-17-00-utc/14708/2",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/68",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-18-de-abril-de-2022/14700",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-3/14549",
                        "https://forum.makerdao.com/t/ces-sprint-update-4-2022-q1-mar-14th-to-mar-25th-2022/14451",
                        "https://forum.makerdao.com/t/mip71-huntingdon-valley-bank-collateral-block-exemption/14469",
                        "https://forum.makerdao.com/t/collateral-status-index/2231"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.425706496100517
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#2",
                    "likes": "4",
                    "time": "27/03/2022-19:34:03",
                    "content": "    maxglass:  Huntingdon Valley Bank (“HVB” or “HVBank” or the “Bank” or “Portfolio Manager” or “Asset Manager” or “Counterparty”), a State Chartered American commercial bank owned by the publicly-held holding company HV Bancorp. Inc. (NASDAQ Listed: HVBC), subject to regulatory oversight from the Federal Reserve, the Federal Deposit Insurance Corporation (FDIC), the Pennsylvania Department of Banking and Securities, and the Securities and Exchange Commission (SEC)   Thank you for this application.   What specific additional approvals will HVB and/or HVBC require from its regulators to complete the contemplated transactions?   Is entering into the specified agreements within the current capacity and authority of the relevant entities?   What additional/unique considerations does engaging with a DAO and permissionless protocol raise in terms of the entities’ banking licenses and internal corporate authority, if any?   Have issues relating to question 3) above been raised and discussed yet with decisions makers at the bank/company Board level and regulatory agencies whose additional approval would be required to enter into the arrangements described?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.263888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daniel_Krewson",
                    "index": "#3",
                    "likes": "16",
                    "time": "28/03/2022-17:28:35",
                    "content": "Thank you for the questions @ACREinvest This is Dan Krewson, Market President for HVB and one of the authors of the MIP6. Here are the questions and responses for your review.  What specific additional approvals will HVB and/or HVBC require from its regulators to complete the contemplated transactions?  Response: No additional approvals will be required from regulators as the MBPTrust is an independent agent acting of its own accord to enter into a participation with HVB as any participation partner would. The only difference is that instead of MBPTrust being a bank or non-bank financing entity funded by traditional sources (equity, deposits, etc.), it is funded through the issuance of DAI by MakerDAO.  Is entering into the specified agreements within the current capacity and authority of the relevant entities?  Response: Yes, the Chief Lending Officer is authorized to enter into participation agreements with a participation partner. This authorization approval is clearly specified in the Bank’s credit policy.  The Board is aware of the transaction but it does not need to approve a new syndication or participation partner.  What additional/unique considerations does engaging with a DAO and permissionless protocol raise in terms of the entities’ banking licenses and internal corporate authority, if any?  Response: HVB’s engagement with a DAO and permissionless protocols, and specifically MakerDAO, have no direct bearing on our banking license, or ability to do business.  HVB is a US-regulated bank and as such has the right to buy and sell loan participations to other banks, investment funds, private individuals, etc.  All that is required is that the investor is shown to be a legitimate party and cleared within the regulatory rules, namely KYC/BSA/AML. The compliance guidelines are met with the design of this relationship.  Therefore, no specific or additional considerations are required for HVB to engage with MakerDAO and permissionless protocol related to the Bank’s license/charter or corporate authority. The management team is well aware of other concerns regarding these matters that pertain to operational questions that have either been addressed in the MIP6 or will be addressed in the subsequent Master Participation Agreement.  Have issues relating to question 3) above been raised and discussed yet with decisions makers at the bank/company Board level and regulatory agencies whose additional approval would be required to enter into the arrangements described?  Response: The CEO and President of the Bank are both informed and involved in the process however their explicit approval is not required for the Bank to enter into a participation agreement as these authorities are granted to the executive officers in the ordinary course of business. Nonetheless, all relevant parties, including the Bank’s board—which was notified of the MIP6 proposal—are aware of the proposed relationship. Please let me know if you have any follow up or other questions.  Dan  @g_dip ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4027545035609545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#4",
                    "likes": "2",
                    "time": "28/03/2022-19:16:06",
                    "content": "Thanks very much! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "5",
                    "time": "28/03/2022-20:08:14",
                    "content": "Hello–question for RWAC @g_dip @maxglass Will the S, G,&R fees also include reporting of on-site visits/on-the-ground inspections of all loans made by HVB? I believe this is something the DAO is missing with the handful of RWA loans that have been deployed. I point this out, because I believe to this day, no community member and/or Core Unit team members has ever been on-site to any of the many loans that are currently outstanding. Proponent of doing such in the near future. TY! Speaking of seeing RWA loans managed more efficiently, will the HVB Stability Fees be paid monthly, quarterly, semi-annual, annual? I believe to date only NEW SILVER has paid some SFs back to the DAO.  image1298×138 73.9 KB  You mention above   that the gross average yield is 4.65% – minus the S, G, & R fees (200 basis pts) – can you please walk me through how the external link below   is calculating net 3%  Please correct me if I am wrong here. But in this diagram, you point to the possibility of the PSM used for the ability to trasfer USD into the DST. Is this indicating that HVB will draw DAI —> swap via PSM to USDC, and have “Broker-dealer” convert to USD?  If so, will the USDC from the PSM be acceptable by the DST? Please clarify if I am misreading the diagram.     maxglass:  This Trust will be a Directed Trust, and the Trust Sponsor which provides this direction will be an entity which ultimately seeks its own direction from a committee appointed by MakerDAO.   Good to see a MakerDAO Committee structure being used to direct the Trust Sponsor. Do you have any thoughts of the number of committee members–will it be 3 of 5, or 5 of 7 committee, (perhaps similar to a multi-sig) and will RWAC recuse itself from being apart of the committee? Thanks in advanced. And excited to see this RWA MIP-6 application posted! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.651022727272728
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#6",
                    "likes": "0",
                    "time": "28/03/2022-20:11:34",
                    "content": "    Daniel_Krewson:  All that is required is that the investor is shown to be a legitimate party and cleared within the regulatory rules, namely KYC/BSA/AML. The compliance guidelines are met with the design of this relationship.   Thanks Dan! Could you possibly give more color here? “…All that is required is that the investor is shown to be a legitimate party and cleared within the regulatory rules, namely KYC/BSA/AML. The compliance guidelines are met with the design of this relationship…” it sounds like you have already KYCed MBPTrust which was constructed to deal with these very issues? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "0",
                    "time": "29/03/2022-10:23:12",
                    "content": "Interesting proposal and thank you for the application My questions:  Has current RWF2.0 team reviewed this enough for it to pass through to the RWF examination phase? Regarding what is being purchased.   Is this a fixed set of loan agreements (aka a loan portfolio that exists or one that is yet to be created?)  Who holds these instruments being purchased Is it the case that the only control over the portfolio is this credit rating of 6 and the types of loans and not the relative allocations between the types of loans, nor any control over geographic spread? What does wind down look like.  If Maker governance decides to DC 0 this vault. I don’t see anything about taxes here regarding profits, nor how this tax liability would be handled within the fee structure.  My point here is that the holder of these purchase agreements would also have tax liabilities - how is this handled in the fee structure and how is this going to be handled just generally from a tax liability and reporting standpoint.   I guess I am trying to figure out how tax compliance is handled because I see no intermediary in a tax neutral jurisdiction for the fund flow of DAI (with taxable profits presumably) back to Maker.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2746913580246915
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#8",
                    "likes": "4",
                    "time": "29/03/2022-11:48:40",
                    "content": "Thank you for your comment @MakerMan, Regarding your point (1), I guess with RWF2.0 you refer to the combination of RWF-001 (@williamr and team), incubated LTS-001 (@christiancdpetersen), and incubated LOVE-001 (aka myself). @maxglass and team have discussed extensively with RWF-001 the details of the proposal with the intentions of providing the best possible MIP6 to the forum. As it has happened (and is happening) with every potential counterparty that asks for feedback, RWF-001 has tried to help with guidance and with testing some of the details of the proposal. I believe that @teej has been the closest to this proposal in its pre-MIP phase so I will let him comment if needed. As I reminder, the current draft MIP67 outlines at a high-level the process followed by the core units. The process followed by RWF-001 has followed this approach based on what I have seen. When it comes to the MIP6 in its current form, neither RWF-001 nor LOVE-001 have completed a risk assessment. As it has happened most recently for Monetalis (v1 + v2), the two core units will provide two independent risk assessments in order to give MKR holders the most complete package possible to assess the proposal. Following publication, we remain available to organise a session on the proposal with MKR delegates or broader community if required. In the meanwhile, we encourage the community to continue asking questions to the team on the details that are unclear or require further colour. Those answers will be incorporated by the risk assessments. Regards, Luca ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#9",
                    "likes": "5",
                    "time": "29/03/2022-13:10:08",
                    "content": "  Has current RWF2.0 team reviewed this enough for it to pass through to the RWF examination phase?   An “examination”, no. A triage, sure. We’ve worked with RWAC to ensure that HVB’s application is exhaustive vis a vis commercial, legal, and technical considerations. As you will see in the google doc version of the MIP-6, the application tracks the Methodology in an effort to give the community a full picture. I hope that RWF’s interaction with counter-parties pre-MIP will ensure that each subsequent MIP-6 will be more thoughtful and transparent than the last. An “examination”, or risk evaluation will come should the community be so inclined.   Regarding what is being purchased. Is this a fixed set of loan agreements (aka a loan portfolio that exists or one that is yet to be created?) Who holds these instruments being purchased   As per the proposed structure in the current MIP-6, there are not yet covenants/requirements around the split between Maker’s participation in assets that currently live on HVB books and in newly originated assets. As the two routes differ significantly in the suite of risk and opportunities they present to the protocol, this issue will be investigated with care. As for your second question, the debt notes (participations) will be sold into and held by the trust (“MBPTrust”) should they be eligible as per the purchase agreement and signed off on by the collateral agent.   Is it the case that the only control over the portfolio is this credit rating of 6 and the types of loans and not the relative allocations between the types of loans, nor any control over geographic spread?   Again, should the community look to pursue this application further, the RWF team will embark on comprehensive risk assessment. A key piece of this will be understanding the concentration risks and building structural diversity into the term sheet/purchase agreements. Concentration vulnerabilities in areas such as, but not limited to the following will be considered: collateral asset type, native originations vs. syndications, geographical distribution, amortizing vs. non-am, recourse vs. non-recourse to project sponsors etc. In terms of other controls, HVB has constraints around borrower credit scores, LTVs, and debt coverage (DSCR, Debt Yields, etc.). You can rest assured that every single control, risk metric, and concentration vulnerability will be scrutinized into oblivion.   What does wind down look like. If Maker governance decides to DC 0 this vault.   Great question. We will approach these complicated but important topics should there be appetite from the community to pursue the HVB opportunity. Even for a structured MIP-6, such detail is probably a level too deep. As currently structured, this MIP-6 application represents the first potential MakerDAO vault where A) the counter-party is participating on level footing (pari passu) in each of MakerDAO’s assets and B) the counter-party is responsible for master and special servicing these assets. What this means is that, should the MakerDAO community seek to wind down the vault due to cause (broad deterioration, delinquency, default, collateral value drawdown etc.), the structure aligns HVB to move in the same direction as MakerDAO. These are their assets too and they are incentivized to use their special servicing arm to salvage value for their shareholders and for MakerDAO’s token holders.   I don’t see anything about taxes here regarding profits, nor how this tax liability would be handled within the fee structure. My point here is that the holder of these purchase agreements would also have tax liabilities - how is this handled in the fee structure and how is this going to be handled just generally from a tax liability and reporting standpoint. I guess I am trying to figure out how tax compliance is handled because I see no intermediary in a tax neutral jurisdiction for the fund flow of DAI (with taxable profits presumably) back to Maker   Another good question. Not my area of expertise, at least not quite yet. Although I do know that we will be sparing few expenses on counsel, including tax counsel. I will exit stage left and let @christiancdpetersen or @g_dip speak to any proposals for tax treatment. More broadly, @Daniel_Krewson @g_dip @maxglass if I have misconstrued anything, please feel free to slice and dice. ",
                    "links": [
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.503864191364192
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#10",
                    "likes": "0",
                    "time": "29/03/2022-13:57:13",
                    "content": "    teej:    Has current RWF2.0 team reviewed this enough for it to pass through to the RWF examination phase?   An “examination”, no. A triage, sure. We’ve worked with RWAC to ensure that HVB’s application is exhaustive vis a vis commercial, legal, and technical considerations   Notice I used the term ‘examination’ as contrasted with the word ‘assessment’, you used a term ‘triage’.   Given no formal terminology is used here I am going to keep asking the same questions on MIP6’s.  At some point governance is going to need some clear declaration of intended process as well as who is responsible to carry out the pieces of process. The point is that there is some assumption that the engagement ‘sourcers’ have enough expertise to at least run a preliminary examination to see if a MIP6 is warranted. I want to be clear here since we seem to be completely in a no-mans land on what a MIP6 application means to governance nor what the real process is for an Asset Originator to navigate Maker proper. If MIP6’s just become this free for all, and RWF (rightly so to maintain distance to AOs and sourcers btw) waits to conduct assessments then it will be governance stuck with trying to judge not just MIP6’s to pass, but also to prioritize RWF risk and legal assessments.   Since there are going to be significant costs and governance is the overall management go between I believe it would be helpful to see how AO’s are intended to navigate Maker.  This is  from a AO contact to sourcer, sourcer helping put together a MIP6, what it means for governance to pass or block a MIP6, prioritization of MIP6 processing with RWF (who controls this or how is it managed), and then assessment reports (if a fail a process for AO, sourcer to appeal and/or to resubmit a MIP6), etc. etc.  If there is a flow-chart document describing the terms and players in this RWA AO process that I missed I apologize and please direct me to it.  If not then Maker and AO’s definitely need one.  If there is some internal agreed upon model unpublished please publish as it is entirely unclear given the statements here about how governance is supposed to react to these MIP6s except as ‘intent to onboard’ that has no elements of prioritization detail except as first in first out (as an example) I honestly don’t know with the information on hand what to do.  My expectation was that these RWA MIP6 applications would at least undergo some form of prescreening for suitability by the sourcer or via some other well defined process or group (not RWF per se since this would put RWF as gatekeeper to AO Maker access imo) before these MIP6 were presented to governance to ‘intent to onboard’ MIP6 applications which would lead to formal RWF assessor, risk and legal reviews. Feel free to correct any inaccuracies, and/or add color to details here. Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.505580357142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#11",
                    "likes": "2",
                    "time": "29/03/2022-15:12:13",
                    "content": "Thanks @MakerMan, You are touching several important points here. You have not been the first one to point to lack of clarity r uncertainty on what a MIP (or a SIGNAL) means for more practical purposes. I believe @LongForWisdom has shared some thoughts here, and @monkey.irish has contributed his views. The way collateral is onboarded within Maker is an area core units are thinking deeply how to innovate. On your specific points below, I would again point you towards the MIP67 we are proposing in this governance cycle.     MakerMan:  This is  from a AO contact to sourcer, sourcer helping put together a MIP6, what it means for governance to pass or block a MIP6, prioritization of MIP6 processing with RWF (who controls this or how is it managed), and then assessment reports (if a fail a process for AO, sourcer to appeal and/or to resubmit a MIP6), etc. etc.    In general, we are trying to document the intention of the various core units to provide to governance the most complete MIP6 possible, with the highest chance of success, while respecting the ability for every outside party to access directly governance through a MIP as they see fit. It is for this reason that, as explained in the MIP67 drafted and mentioned above, the core units remain available to be consulted to provide feedback and guidance to originators/ sources that want to make sure they are covering all points that will be assessed by the core unit risk assessments. It’s not only RWF-001 that is involved in this, but also Growth, LTS, CES, LOVE, and others if applicable. The intention is again improving the quality of the MIPs while keeping  transparency and respect for decentralisation. Since the inception of the so-called RWF 2.0 with @williamr joining as facilitator, this has been done with every party interested, including Monetalis and Huntingdon Valley Bank, as well as all the other parties that have received a successful MIP or SIGNAL in the previous phases.     MakerMan:  If there is a flow-chart document describing the terms and players in this RWA AO process that I missed I apologize and please direct me to it.   We do not have an updated flowchart that describes what the MIP67 puts in words, but we will work on this ASAP and share with the community.     MakerMan:  I honestly don’t know with the information on hand what to do. My expectation was that these RWA MIP6 applications would at least undergo some form of prescreening for suitability by the sourcer or via some other well defined process or group (not RWF per se since this would put RWF as gatekeeper to AO Maker access imo) before these MIP6 were presented to governance to ‘intent to onboard’ MIP6 applications which would lead to formal RWF assessor, risk and legal reviews.   The line between “offering advice” and “gatekeeping” is a thin one we do not want to overtake. For this reason, while all core units are happy to provide guidance and support to the originators (on a reactive basis) to put together the best MIP possible, we are trying to post-pone any detailed risk assessment or cost disbursement following a signal from the community. It is the expectation of the originator, obviously, that by collaborating with the core unit to construct a good quality MIP, the probability of receiving a positive risk assessment should be higher. While this goes in the direction of improving quality, it is not gatekeeping, as we are making very clear that the consultation with RWF and others is not mandatory and the access to voting is available for everyone. Although so-called “arrangers”, being them intermediaries, consultants, or principal investors, are a crucial element of the verification process, they cannot substitute some level of analysis and guidance coming from the core units as they act in their own interest, or often in the interest of the underlying borrower. We envisage, in the long term, those intermediaries to align their incentives fully with maker with some form of staking or co-investing, but this is not yet the case. Lastly, on prioritisation, RWF remains available for anyone trying to get guidance and colour about how to interact with Maker, at the cost of heavy workload. This does not mean, however, as the MIP67 tries to document, that the RWF doesn’t intend to keep some level of discretion in prioritising where to spend time. We believe to be in the mandate of RWF to exercise judgement on how to engage with all counterparties that want to onboard on Maker, also considering that each counterparty maintains free access to forum and governance. I hope that I managed to answer most of your points. Regards, Luca ",
                    "links": [
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.981190375982043
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smartcontracts",
                    "index": "#12",
                    "likes": "0",
                    "time": "29/03/2022-17:26:48",
                    "content": "Lots to look at and consider. A few quick questions-  Do we think that we will have a perfected security interest in the collateral. This is really only evidenced if we’re capable of executing and filing UCC forms. Otherwise, this is a lot of complexity for an effectively unsecured loan. Do we know who’s doing the workouts on any defaulted collateral, like syndication agents. Loan workouts can have conflicting objectives, where for instance, HVB has other relationships with a borrower, and their interests supersede ours. If done properly, we’d have independent workout expertise.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.505208333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#13",
                    "likes": "7",
                    "time": "29/03/2022-23:10:06",
                    "content": "    flipflopflapdelegate:  Will the S, G,&R fees also include reporting of on-site visits/on-the-ground inspections of all loans made by HVB? I believe this is something the DAO is missing with the handful of RWA loans that have been deployed. I point this out, because I believe to this day, no community member and/or Core Unit team members has ever been on-site to any of the many loans that are currently outstanding. Proponent of doing such in the near future. TY!    Q1: Is it included in the fees? Yes, this is part of servicing. Q2: Is someone performing independent site visits? Yes, both as a part of ongoing KYC and the standard review of each client, which is part of the Bank’s credit policy that we have frequent contact with customers.      flipflopflapdelegate:  Speaking of seeing RWA loans managed more efficiently, will the HVB Stability Fees be paid monthly, quarterly, semi-annual, annual? I believe to date only NEW SILVER has paid some SFs back to the DAO.   Payments will be processed according to the underlying loan documentation and the participation agreement. In general this means as payments are collected monthly by the Bank, the Bank will directly remit the participant’s (i.e. the Trust) share along with any documentation including but not limited to a participation certificate. In terms of getting these payments from the Trust back to the Vault, this is something that can be determined based on economic feasibility (i.e. how costly it will be to do so and what economies of scale can be achieved by waiting), but they will generally be available for transmission on a monthly basis.     flipflopflapdelegate:  You mention above  that the gross average yield is 4.65% – minus the S, G, & R fees (200 basis pts) – can you please walk me through how the external link below  is calculating net 3%   3% is a conservative estimate of future flows. Based on past performance it would be higher.     flipflopflapdelegate:  Please correct me if I am wrong here. But in this diagram, you point to the possibility of the PSM used for the ability to trasfer USD into the DST. Is this indicating that HVB will draw DAI —> swap via PSM to USDC, and have “Broker-dealer” convert to USD?   Sorry if this wasn’t as clear as it could have been. I was trying to demonstrate that the broker-dealer may choose to use the PSM to convert Dai to USDC and then to USD rather than going to the open market to trade the Dai directly to USD in order to avoid slippage.     flipflopflapdelegate:  Good to see a MakerDAO Committee structure being used to direct the Trust Sponsor. Do you have any thoughts of the number of committee members–will it be 3 of 5, or 5 of 7 committee, (perhaps similar to a multi-sig) and will RWAC recuse itself from being apart of the committee?   RWAC will not be on the committee. As for the specifics around membership and process, we intend to work with the relevant CUs and the community to determine the correct balance.     Eumenes:  it sounds like you have already KYCed MBPTrust which was constructed to deal with these very issues?   The specific Trust referenced in the MIP does not yet exist, but given other Trust structures in the DAO (e.g. 6s) they do not anticipate it being a problem, as long as there is not a material departure in form. Furthermore, the HVB team has worked with WSFS (the proposed trustee) over the years and are comfortable with their compliance and KYC processes. HVB will work directly with them, our legal counsel, and internal compliance, to resolve any KYC or other compliance matters that could arise. However, if no material changes to the existing “DST” structure, HVB does not see any reason why the contemplated structure would not pass its KYC process.     MakerMan:  Has current RWF2.0 team reviewed this enough for it to pass through to the RWF examination phase?   I will let them answer this question. We did work extensively with the various core unit teams (not just RWF) to get this into the form it’s in today and their feedback was invaluable.     MakerMan:  Regarding what is being purchased. Is this a fixed set of loan agreements (aka a loan portfolio that exists or one that is yet to be created?) Who holds these instruments being purchased   Q1: Fixed set of loan agreements? It is not the intent to transition an existing portfolio of loans to the DST. The loans in the DST will be a combination of existing loans or new loans, heavily favoring the latter. Existing loans would enter the DST only if they met the criteria and there was a sufficient reason, primarily, expanding the underlying loan relationship. Q2: Who holds these instruments being purchased? Uncertain of the “who” referenced in the question. The DST will be purchasing the loans, if that is your question. Specifically though, any loan that enters the DST will be an HVB loan with HVB the servicer for the DST. HVB would not be an intermediary (i.e. a pass-through of loans to the DST for another institution) nor would the DST issue loans independent of HVB or participate loans with another entity (i.e. without HVB’s participation).     MakerMan:  Is it the case that the only control over the portfolio is this credit rating of 6 and the types of loans and not the relative allocations between the types of loans, nor any control over geographic spread?   We didn’t think this level of specificity was appropriate for a MIP6, but we intend to work with the relevant CUs and the community to determine the right credit and investment decisions. We can’t engage counsel and start drafting the actual documents until we have greater certainty of being on-boarded. That being said, (1) we built into the framework high level credit and investment decisions that would determine the quality of the assets being purchase regardless of location, asset type, loan type, etc. prior to any asset moving to the DST, (2) there are natural geographic concentrations and diversity due to the nature of the Bank’s footprint, and (3) the allocations would generally mirror the Bank’s portfolio allocations assuming a relative pro rata sharing of organizations, which naturally is diversified among real estate lending, business lending, and the other Loan Categories mentioned in the MIP6. The primary geographies of the bank’s activity are also discussed in the MIP6.     MakerMan:  What does wind down look like. If Maker governance decides to DC 0 this vault.   If Maker sets the DC to 0, no additional Dai would be able to be drawn from the Vault (obviously). From there, Maker could direct the Trust to sell its existing loans (to an acceptable replacement participant) for cash and then recapitalize the Vault with the proceeds, or wait until the loans mature and do so then.     MakerMan:  I don’t see anything about taxes here regarding profits, nor how this tax liability would be handled within the fee structure. My point here is that the holder of these purchase agreements would also have tax liabilities - how is this handled in the fee structure and how is this going to be handled just generally from a tax liability and reporting standpoint. I guess I am trying to figure out how tax compliance is handled because I see no intermediary in a tax neutral jurisdiction for the fund flow of DAI (with taxable profits presumably) back to Maker.   I’m not a tax expert. I can say that we’ll do whatever is in our power in terms of structuring to ensure that Maker can (legally) be in the most tax advantageous position. We are hiring very experienced law firms to handle these issues for us.     smartcontracts:  Do we think that we will have a perfected security interest in the collateral. This is really only evidenced if we’re capable of executing and filing UCC forms. Otherwise, this is a lot of complexity for an effectively unsecured loan.   As a direct participant in the loans themselves, the DST would have pari passu perfected security interests in all collateral pertaining to those specific loans (collateral secured by a recorded mortgage and/or UCC or other appropriate security documentation) and in no way be subordinated to the Bank’s interests. This would be clearly identified in the subject participation and loan documents and would mirror the commonly accepted structure of bank-to-bank participations. Lastly, as a general rule, HVB rarely if ever lends on an unsecured basis. On those rare occasions a credit decision that allows for an unsecured loan would be based on material mitigating factors.     smartcontracts:  Do we know who’s doing the workouts on any defaulted collateral, like syndication agents. Loan workouts can have conflicting objectives, where for instance, HVB has other relationships with a borrower, and their interests supersede ours. If done properly, we’d have independent workout expertise.   HVB, like most banks, does not utilize independent third party work out agents since it is in the best interest of the bank to directly work out a loan to maximize recovery. To a certain degree, workouts are managed at the highest levels of the institution since they impact credit quality, ratios, capital requirements, and regulatory oversight. The DST would directly benefit from this as an equal partner to the Bank. The suggestion that the bank may have conflicting interests to the specific loan seems to be extremely unlikely given the economics of lending, but the fact that they are a heavily regulated institution should provide comfort in this area. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.495366934652649
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#15",
                    "likes": "2",
                    "time": "13/04/2022-20:03:56",
                    "content": "    g_dip:  Q1: Fixed set of loan agreements? It is not the intent to transition an existing portfolio of loans to the DST. The loans in the DST will be a combination of existing loans or new loans, heavily favoring the latter. Existing loans would enter the DST only if they met the criteria and there was a sufficient reason, primarily, expanding the underlying loan relationship.   @Daniel_Krewson In further thinking about Maker’s asset mix, the natural next questions relate to geography and asset class.  Can you describe the historical footprint of the bank’s portfolio geographically? Does HVB intend to double down on the geographies it understands well or scale up in markets less familiar to it? Similar vertical vs. horizontal scaling question but with regards to asset type. As per the graph titled “Modest Diversified Growth”, the theoretical future production skews towards mortgages (stabilized am and construction) and syndications but also includes non-trivial volumes of products newer to HVB like personal loans and lender finance. Does the bank intend to double down on asset types with high historical production or fan out?   What are the proposed servicing fees (Master + Special) on the first $10M of each loan participated to the trust? Do these converge with industry standards? If not, please provide rationale. As per the financial reports provided in the MIP-6, deposits spiked in 2020 to $730MM ( and then fell in 2021 to $464MM. The more precipitous decline was seen in cash and cash equivalents: $415MM in 2020, $121MM in 2021. @maxglass attributes both declines to PPP deposits booming and then busting.  Would the bank attribute the decline in deposits from 2020 to 2021 to any other cause other than PPP boom and bust? If not, does the following thinking capture the effect? → HVB helped customers apply for PPP stimulus which were deposited directly at HVB. These funds were generally not redeployed by HVB into longer-term assets (like mortgages) because they were by nature transient. Stimulus goes to immediate needs and such deposits were thus unlikely to be sustained. Does the bank anticipate further outflows of deposits in 2022? If so, for what reason?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.160818387961246
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daniel_Krewson",
                    "index": "#16",
                    "likes": "2",
                    "time": "19/04/2022-23:35:42",
                    "content": "@teej these are all great questions.   In further thinking about Maker’s asset mix, the natural next questions relate to geography and asset class.  a. Can you describe the historical footprint of the bank’s portfolio geographically?  The Bank has been based in Pennsylvania, outside of Philadelphia, for more than 150 years with a geography that has grown over time around that center point, first through retail branch expansion and later residential and commercial loan production and administrative offices. These core banking services are delivered throughout the Mid-Atlantic region. Asset class and loan type also informs geographic distribution, such as conforming residential mortgage loans delivered throughout the East Coast and the Braavo Bank e-commerce division providing credit nationally. Other specialty or niche lending areas continue to grow appropriately through carefully considered and well-informed credit decisions for each subsequent client.  b. Does HVB intend to double down on the geographies it understands well or scale up in markets less familiar to it?  The Bank will continue to invest in the markets and geographies that it serves while carefully and strategically expanding.  c. Similar vertical vs. horizontal scaling question but with regards to asset type. As per the graph titled “Modest Diversified Growth”, the theoretical future production skews towards mortgages (stabilized am and construction) and syndications but also includes non-trivial volumes of products newer to HVB like personal loans and lender finance. Does the bank intend to double down on asset types with high historical production or fan out?  HVB is a full service commercial bank that provides a wide range of products and services. Community banks in general typically have a large proportion of real estate secured loans as is appropriate for reinvesting in the communities that they serve. But HVB, like all community banks, seeks to diversify the portfolio mix by providing loans to a wide range of qualified borrowers in a wide range of industries and loan types. By investing in experienced team members (loan and credit officers), responding to market conditions, needs, and competition, and through careful investment in resources (technology, people, infrastructure), the Bank is, and does, grow through diversification of asset mix.   What are the proposed servicing fees (Master + Special) on the first $10M of each loan participated to the trust? Do these converge with industry standards? If not, please provide rationale.   The proposed fees are up to a maximum total of 125 basis points (0.0125) and only on the first $10,000,000 of loan outstanding followed by 75 basis points (0.0075) in total on all balances in excess of $10,000,000. Of that amount, as the Servicer, the Bank collects 75 basis points (0.0075) of the first $10,000,000 and 25 basis points (0.0025) on the remaining balances. The additional 50 basis points on all amounts (0.0050) will be funded to RWA Co. who will be providing additional reporting, servicing, and monitoring services on the assets held in the trust, among other services, on an ongoing basis for the life of the assets in the Trust. These are standard and fair servicing fees on a standard Bank-to-Bank participation and in particular with this Bank-to-Non-Bank Trust structure given that the Bank will be handling a materially larger portion of accounting and servicing than would be typical in a standard Bank-to-Bank participation where each party has its own full-service loan accounting, servicing, booking, and credit departments.   As per the financial reports provided in the MIP-6, deposits spiked in 2020 to $730MM ( and then fell in 2021 to $464MM. The more precipitous decline was seen in cash and cash equivalents: $415MM in 2020, $121MM in 2021. @maxglass attributes both declines to PPP deposits booming and then busting.  a. Would the bank attribute the decline in deposits from 2020 to 2021 to any other cause other than PPP boom and bust?  Due to deposits flowing in from the issuance of PPP loans (more than 450 loans issued in the first round), which then flowed out as the recipients used the funds towards payroll and other crucial expenses to keep their businesses operating.  b. If not, does the following thinking capture the effect? → HVB helped customers apply for PPP stimulus which were deposited directly at HVB. These funds were generally not redeployed by HVB into longer-term assets (like mortgages) because they were by nature transient. Stimulus goes to immediate needs and such deposits were thus unlikely to be sustained.  It was the expectation from the origination of the PPP program that the funds generated from the PPP loans would be funded to a deposit account at the time of issuance and then used by the Borrowers for the eligible expenses that supported the loans (e.g. payroll). The large increase and subsequent decline in balances was fully anticipated.  c. Does the bank anticipate further outflows of deposits in 2022? If so, for what reason?  There is no expectation of another material outflow of deposits. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4254071325499895
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#18",
                    "likes": "2",
                    "time": "20/04/2022-12:09:43",
                    "content": "    luca_pro:  @maxglass and team have discussed extensively with RWF-001 the details of the proposal with the intentions of providing the best possible MIP6 to the forum. As it has happened (and is happening) with every potential counterparty that asks for feedback, RWF-001 has tried to help with guidance and with testing some of the details of the proposal. I believe that @teej has been the closest to this proposal in its pre-MIP phase so I will let him comment if needed. As I reminder, the current draft MIP67  outlines at a high-level the process followed by the core units. The process followed by RWF-001 has followed this approach based on what I have seen. When it comes to the MIP6 in its current form, neither RWF-001 nor LOVE-001 have completed a risk assessment.   Consistent with the above from @luca_pro, the incubating Legal and Transactional Service (LTS) core unit has provided some high-level guidance on the MIP6. However, as this is a MIP6 application and not a self-contained MIPxx, LTS has not undertaken an extensive review. LTS will engage with the applicant and RWA Company more thoroughly if the Maker community greenlights the application. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.886363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#19",
                    "likes": "12",
                    "time": "20/04/2022-16:23:03",
                    "content": "Given the completeness of both the initial MIP-6 and of the responses from HVB and RWAC, RWF is comfortable issuing the following recommendation for the benefit of MakerDAO token holders who may participate in the active green-light poll. Token holders should always DYOR, but we thought a qualified, albeit underbaked opinion might help those less close to the intricacies of structured finance and specifically, the proposed HVB transaction. Recommendation: Greenlight Executive Summary: HVB is the most thoughtful Real World Asset MIP-6 to date. It contemplates commercial alignment, legal structure, and how MakerDAO might interact with the real world. By participating in HVB assets via an appropriate structure, MakerDAO constructs a bridge to a regulated institution and accesses modest yield on a diverse portfolio of assets from real estate to business loans. Because MakerDAO and HVB will be participating on level footing in the same assets, interests are mainly aligned—market yields on originated assets should simply pass through to MakerDAO (less fees). Because the trust will be structured to ingest a wide range of assets as long as they are eligible and to ensure transparency and best practices (as previously outlined by @christiancdpetersen in various threads), such a facility has potential to scale. Due to these structural factors, RWF advises the community to greenlight this MIP-6 submission and to move toward a comprehensive commercial, legal, and technical risk analysis.   Opportunities:   Brand: Huntingdon Valley Bank is a publicly traded bank established in 1871 and regulated by the FDIC, the Federal Reserve, and the SEC. MakerDAO is the oldest and most robust DeFi protocol on earth. HVB attains flexibility and savviness by plugging into DeFi via MakerDAO. MakerDAO gains legitimacy and a measured, established hand in the real world by participating in HVB assets. If approved, a participation agreement between a protocol and US bank would forge a new chapter of history and send a powerful signal to institutional counterparties of what is to come.  Alignment: MakerDAO participates pari passu, or on level footing, with HVB in originated assets. This means that the bank is incentivized to do things that are in the best interests of MakerDAO, lest it punish itself. This principle is important with regard to asset origination but critical with regard to recoveries and special servicing.  Risk/Reward: Due to the nature of a participation facility as opposed to a revolving credit facility or warehouse line, the net yield on HVB-originated assets will be passed through directly to MakerDAO. HVB is incentivized to price its originations efficiently and even opportunistically as it retains large pieces of such originations. To the extent that MakerDAO comprehensively “underwrites the underwriter”, token holders have some assurance that risk is priced well.  Responsible Scale: HVB is a community bank, not a bulge bracket, not a FinTech. Community banks thrive by understanding their backyard and growing responsibly with local businesses and individuals with whom they have lending relationships. With Pennsylvania and real estate-secured assets at its center, HVB intends to both double down on core strategies and to carefully diversify its portfolio.    Risks:   Concentration Risk: The proposed vault will have a debt ceiling of $100MM. This will represent the largest RWA vault to date and 5th largest MakerDAO vault currently outstanding. Despite the trust to which MakerDAO is a beneficiary being bankruptcy remote, this vault will represent a large, concentrated implicit exposure to HV Bancorp, Huntingdon Valley Bank, and asset values in the Northeast of the United States.  Development Risk: The proposed vault is backed, to some extent, by loans for the construction of commercial and residential properties. Within real estate credit, construction loans are some of the riskiest loans. These assets are exposed to the creditworthiness and competence of the developer, the competence of the contractor, the possibility of cost inflation (materials, labor, etc.), the possibility of delays, and the always-present possibility that the market turns. MakerDAO’s vault will ultimately be collateralized by the underlying properties. It is much more difficult to liquidate or sell on the open market a half-baked construction project than it is a stabilized, cash-flowing commercial asset.  Servicing/Fee Risk: As structured, the % of gross yield going to various servicing and governance fees seems high relative to my experience in CMBS lending. Should token holders greenlight the proposal, this item will have to be analyzed and negotiated carefully to ensure that services like DAO <> Bank governance, master servicing, and special servicing are priced correctly.  Regulatory Risk: Forging a partnership with an established, regulated entity represents both an opportunity and a risk to MakerDAO.  Scaling Risk: Though HVB has been extending credit since inception in 1871, it has done so at a conservative pace. Sober underwriting is generally a good thing. With that said, there is some uncertainty around HVB’s ability to responsibly scale its production and put $100MM to work in 12 months.    ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-emerging-markets-green-opportunity-financing-for-atd-combustors-egyptian-power-plant-efficiency-projects/14489/28",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-india-power-green-bonds/14485/20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.606830884295673
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#20",
                    "likes": "4",
                    "time": "20/04/2022-16:45:34",
                    "content": "I have to read this in piecemeal but, while I am not admitted in Pennsylvania, having a confession of judgment is generally ideal to have in your pocket. I just wanted to mention that as I was making my way through it.  Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#21",
                    "likes": "6",
                    "time": "22/04/2022-15:00:24",
                    "content": "I would like to thank @maxglass and both the RWAC and HVB teams for this proposal. I am writing the following as prospective facilitator of the incubating Lending Oversight Core Unit (LOVE), consistent with the mandate to develop good internal checks and balances, and act as a second internal line of defence for what concerns structured lending risk. This review represents my personal opinion and doesn’t constitute legal, tax, investment or other advice.  TL;DR LOVE supports the greenlight recommendation provided by RWF-001. Interacting with a Fed-regulated financial institution constitutes a great step ahead for Maker’s real-world asset program, with very positive signalling implications. In addition, HVB’s intention to remain exposed alongside MakerDAO (pari passu) is a valid (although not yet perfect) demonstration of interest alignment and long-term mindset. In case the application will be voted in favour, LOVE will support the following phases of the collateral onboarding process.  About the Proposed Credit Collateral There are several aspects that make the proposal appealing for MakerDAO, and consistent with the eligibility criteria described by the team through MIP67:  Loans in the perimeter will be originated either by HVB itself, or by other regulated financial institutions   HVB rating system, being under the supervision of the Federal Reserve, is heavily audited and offers satisfactory comfort to MakerDAO about the quality of the underlying collateral  MakerDAO exposures will be pari passu with HVB, that would retain (at the beginning) 50% of all exposures - this offers strong indication to MakerDAO about alignment of incentives and borrower’s skin in the game (this hasn’t yet been seen in the other MIP6s so far by the DAO) HVB would represent a turn-key solution for the DAO, with the bank focused on originating, servicing, and working out the loans  Key concerns:  Indirect originations syndicated by HVB should be carefully considered A reduction of HVB’s retained exposure (down to the 5% limit indicated in the MIP6) should be carefully investigated Although pari passu exposure gives a strong signal of incentive alignment, a 5-10% junior first-loss tranche retained by the originator should be considered best practice, and its implementation explored as the exposure grows in size and expands in scope  Collateral is long-ish in nature, although this does not constitute a problem, the maturity profile of the book should be monitored as it grows in size The proposal indicates that capital call lines, i.e. lines of credit to private equity funds, secured by the capital commitments of the fund’s Limited Partners, are part of the perimeter - although this line of business has grown and proven successful for specialised lenders, it has a very different profile vs. the other categories and should be carefully investigated  Servicing and RWAC-related fees will be significant in relative size, and MakerDAO should consider a scheduled reduction in fees as volumes grow beyond the initially proposed 100M Although it is understandable that HVB has interest in linking up with MakerDAO in order to reduce their capital and liquidity burden, we should always monitor the bank’s underlying liquidity and capital position    About RWAC and HVB Teams as Proponents HVB is publicly-held commercial bank, subject to regulatory oversight by the Federal Reserve. Interacting with borrowers that are regulated, publicly held, and demonstrated significant public track record is consistent with the path indicated by RWF-001 and teams through MIP67. Lending to real-world counterparties is, by its own nature, opaque when compared to the world of smart contracts. For this reason, track record, proven institutional quality, and team depth, are crucial when assessing intentions and ability of a borrower. HVB’s application represents a step forward in the quality of real-world MIP6s for MakerDAO, with positive immediate and indirect effects for the community. At the same time, regulatory concerns emerging from dealing with a US-based regulated bank should be carefully investigated. RWAC has been working alongside MakerDAO in trying to bridge the real world with the world of smart contracts for a long time. In doing so, RWAC has a good understanding of all governance requirements and of all the internal mechanisms of oversight and monitoring of the DAO. I am confident that RWAC is very well positioned to support HVB in the evolution of the application, and of the relationship, in case it will be voted in favour.  About the Process Followed THE RWAC and HVB teams have interacted with RWF-001 for a long time in order to prepare the best possible MIP6 to the Maker community. This is consistent with RWF’s role as described by the MIP67 (i.e. providing guidance and support to prospective high-quality counterparties). In addition RWF-001 has published an initial, supportive, risk assessment of the MIP6 (here). LOVE supports the conclusion of such a risk assessment. Regards, Luca ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219/19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.881993984106659
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#22",
                    "likes": "2",
                    "time": "25/04/2022-13:45:43",
                    "content": "    teej:  Scaling Risk: Though HVB has been extending credit since inception in 1871, it has done so at a conservative pace. Sober underwriting is generally a good thing. With that said, there is some uncertainty around HVB’s ability to responsibly scale its production and put $100MM to work in 12 months.   Can @Daniel_Krewson or someone else tell me if HVBank has previously had success with deploying these sums responsibly? Apparently, ~50% of loans will be residential real estate. We’re still in a very low-interest environment. That raises some concerns about how well these loans will perform as interest will likely have to be raised substantially in the nearer future to combat inflationary tendencies. Given HV Banks’ long history we assume underwriting was done with the appropriate rigour but it would probably be in the interest of MakerDAO to monitor loan health and offboard collateral should default rates fundamentally change. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.847222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daniel_Krewson",
                    "index": "#23",
                    "likes": "4",
                    "time": "25/04/2022-15:21:55",
                    "content": "    rspa:  HVBank has previously had success with deploying these sums responsibly? Apparently, ~50% of loans will be residential real estate. We’re still in a very low-interest environment. That raises some concerns about how well these loans will perform as interest will likely have to be raised substantially in the nearer future to combat inflationary tendencies. Given HV Banks’ long history we assume underwriting was done with the appropriate rigour but it would probably be in the interest of MakerDAO to monitor loan health and offboard collateral should default rates fundamentally change.   Through its various departments, HVB originates between $750 million and $1 billion a year in loans (residential conforming mortgages, residential and commercial investment mortgages, construction loans of various end use (investment and owner occupied; for sale and for hold), traditional business lending (working capital lines, equipment financing, asset-based lending, term loans), specialty lending (e-commerce, digital ABL, capital call lines, lender finance, leasehold improvement financing), consumer finance, and wholly-owned divisions with specialty lending focuses (e.g. Braavo Bank). Of this growth, commercial lending originations have grown from about $100mm a year to more than $200mm a year and continue to grow as the Bank brings on individuals or teams of experienced lenders. For many years HVB has been investing in sophisticated and experienced bankers, generally from larger institutions, to build and grow the commercial lending and business banking areas, which complements the historically robust residential mortgage area and the traditional retail model, while taking advantage of consolidation in the banking industry that has resulted in many opportunities locally and outside of the Bank’s traditional geographic market. This growth has included full service and independent credit underwriting and credit risk department and loan operations department that collectively underwrite, review, monitor, and service the loans that are originated in the lending areas. Lastly, the Bank is closely monitoring the micro and macro economic factors that impact lending and portfolio management including the impact of interest rates on the residential housing markets as well as the impact on development and rentals/leasing. This is an ongoing and dynamic process with internal and external expertise hyper focused on the economic environment. The Bank believes that its diversified asset growth model, with a targeted focus on different asset classes, loan types, and borrower types, helps mitigate the exposure risk along with the close monitoring of loans and the aggregate portfolios. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.714912280701753
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#24",
                    "likes": "0",
                    "time": "25/04/2022-15:43:11",
                    "content": "Thanks for your thoughtful answer. Deeply appreciated. May I ask how the 2008 housing crisis and deleveraging went for HV Bank? The reason I’m asking is that I think this is a good proxy for a worst-case scenario. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daniel_Krewson",
                    "index": "#25",
                    "likes": "3",
                    "time": "25/04/2022-18:43:03",
                    "content": "Good questions, and it’s certainly top of our minds too. During the Great Recession the Bank had a mostly different set of leaders and it did survive the crisis while remaining independent, partly by hiring some specialists plus the leadership at the time. But more importantly, it was evident to the Board (which included our current CEO as a then Board-member) that in order to survive in the long term the Bank needed to diversify beyond residential mortgage origination and retail banking. This led to a multi-year strategic plan that included a mutual-to-stock conversion, going public, and developing the commercial lending division. The commercial lending team is comprised of experienced bankers who nearly to a person all went through the Great Recession, several working together at prior institutions that successfully navigated that period and are implementing lessons today at HVB (e.g. know your customers and markets, asset diversification, liquidity and net worth focus, consistency in underwriting, advance rates, equity, coverage ratios, covenants, reporting, etc., quick response to issues and economic signs, focused problem solving, experienced lending and credit teams, increased due diligence, etc.). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.411666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#26",
                    "likes": "0",
                    "time": "26/04/2022-08:37:52",
                    "content": "Excellent, thank you. This is the response I hoped to get. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vishal_Mehta",
                    "index": "#27",
                    "likes": "0",
                    "time": "07/05/2022-05:28:50",
                    "content": "This MIP is as good as it can get and can be used as a reference point for other MIPs. Congratulations to all involved in putting this together. Please share your feedback on the below questions   Would this be deemed as an asset selldown or risk participation in the books of HVB   Would Maker be entitled to sell its share of the portfolio equally (Tag along) in case HVB decides to selldown its share of the portfolio.   Can Maker go ahead and selldown its share independently without taking explicit consent from the borrower or HVB   Regards Vishal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#28",
                    "likes": "1",
                    "time": "05/07/2022-15:42:52",
                    "content": "What assurances does MakerDAO have that a bank won’t be forced by a regulatory body to confiscate all funds associated with the vault? For instance, this theoretical scenario: Apr 2023: The NY Times reports that Putin is using a stablecoin called DAI to circumvent US sanctions. President Biden demands that any bank associated with MakerDAO immediately sever ties and freeze assets. The banks have no choice but to comply. Have these situations been war-gamed? How are these potential situations being accounted for? Some might think that this should be considered as a “black swan” however “black swans” are unpredictable, and this scenario isn’t just predictable, but an argument can be made that it’s likely. Thanks in advance for your replying before the vote deadline! I’m a new recognized delegate and just trying to catch up & get as much info as I can before I vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.81198347107438
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#29",
                    "likes": "2",
                    "time": "05/07/2022-15:51:50",
                    "content": "    ChrisBlec:  Some might think that this should be considered as a “black swan” however “black swans” are unpredictable, and this scenario isn’t just predictable, but an argument can be made that it’s likely.     twitter.com    Peter Schiff @PeterSchiff  Despite no evidence of crimes, Puerto Rico regulators closed my bank anyway for net capital issues, rather than allow a sale to a highly qualified buyer promising to inject capital far in excess of regulatory minimums. As a result accounts are frozen and customers may lose money.   10:50 PM - 3 Jul 2022           6.8K                930            ",
                    "links": [
                        "https://twitter.com/PeterSchiff/status/1543729010278113281?s=20&t=7rKbDk-bgwQtTCkk8pbZAA",
                        "https://twitter.com/PeterSchiff/status/1543729010278113281?s=20&t=7rKbDk-bgwQtTCkk8pbZAA",
                        "https://twitter.com/PeterSchiff/status/1543729010278113281?s=20&t=7rKbDk-bgwQtTCkk8pbZAA"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.83
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#30",
                    "likes": "0",
                    "time": "05/07/2022-15:53:43",
                    "content": "    cmooney:  https://twitter.com/PeterSchiff/status/1543729010278113281?s=20&t=7rKbDk-bgwQtTCkk8pbZAA   Thanks for sharing. I didn’t know about this. This is exactly what I’m concerned about. If it can happen to gold, why can’t it happen to DAI? What assurances does MakerDAO have? If MakerDAO doesn’t have assurances or can’t have assurances, then how can we allow this to proceed in good faith to MKR holders? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#31",
                    "likes": "2",
                    "time": "05/07/2022-16:14:20",
                    "content": "I’m not a lawyer, and I definitely do not play one on the internet, but this is how I think about it:   DAI is too tiny for Putin or any other state actor to ever want to use it. Putin won’t even get out of bed for less than $100B    Assets sit in US Dollars at WSFS (Delaware) via a trust called RWA MPTrust   2a. The DAI that will be minted is brand new DAI (minted with RWAToken) that has never been touch by any eth wallet and/or used by anybody on the blockchain. Think of it as brand new cash that you picked up at the Fed. Easily trackable, open-sourced, and the most transparent money system on the planet. Hands down.   Once the money is put to work by HVB (Real Estate) the US Gov might have to put people out on the streets, close down businesses, etc., since the money will be working in Real Estate. Last time I checked the US Government is not in the business of creating more homelessness and closing down small businesses. (but that can be debated since some people think the US Gov is always up to no-good).   And last but not least — spend time learning — here’s a great write up: [RWA009] HVBank/MIP21 Token CES Domain Team Assessment   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.324431818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#32",
                    "likes": "6",
                    "time": "05/07/2022-16:14:24",
                    "content": "The only way to get true protection against seizure of real world assets is to diversify jurisdictions. Ultimately it is an unavoidable risk we choose to take just like the black swan volatility risk of using crypto collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.383333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#33",
                    "likes": "0",
                    "time": "05/07/2022-16:18:28",
                    "content": "Is it really a black swan if it’s entirely in the hands of just a few predictable people (regulators/politicians) and is already happening to other asset classes (see @cmooney’s shared tweet above)? I’d argue that this wouldn’t be a black swan event at all. As I said above, it’s entirely predictable and perhaps even likely. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.470833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#34",
                    "likes": "4",
                    "time": "05/07/2022-16:41:38",
                    "content": "You could make the same kind of argument about correlated crypto volatility and the fact the us and eu government could effectively ban it all and send it all to zero. Ultimately it is very unlikely in both cases especially if a RWA seizure were to happen suddenly with no warning at all (with a warning we will always have time to shift around the assets). In my opinion in the long run we should aim to balance the risk about 50/50 between RWA and decentralized collateral, (although this may be out of our control since we can’t control demand for crypto leverage) As we have discussed before, if we want to keep a 1 USD peg and keep Dai competitive with centralized stablecoins, then we will always have RWA exposure no matter what. What’s important is that over time we do everything we can to make it as resilient as possible, such as using highly protected structures such as Delaware trusts (there’s a massive difference between e.g. puerto rico and delaware), diversify jurisdictions so we can absorb losses of just a single jurisdiction suspending rule of law., and to engage politically with initiatives such as financial inclusion and clean money that makes it politically more costly to unfairly target maker and damage the positive social impact the project can have. @gov-comms-core-unit can we split off this thread so we don’t derail the HVB thread with general black swan risk discussions? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.312328643578644
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#35",
                    "likes": "1",
                    "time": "05/07/2022-16:43:13",
                    "content": "    rune:  @gov-comms-core-unit can we split off this thread so we don’t derail the HVB thread with general black swan risk discussions?   This isn’t a fair request. I don’t share the view that this is a black swan on the level of the US govt banning all crypto. This is very different and very particular to DAI. This is a very relevant topic to this vote. Please don’t censor the forums. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8238095238095235
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#36",
                    "likes": "8",
                    "time": "06/07/2022-01:37:47",
                    "content": "@ChrisBlec - Thank you for the question. HVB’s regulators have regulatory authority over HVB. Therefore, assuming the instruction to confiscate was legal, HVB will likely have to comply. I am not clear what “assurances” RWA Foundation could seek from HVB that would otherwise override a legal instruction to confiscate. I do not have any experience as to whether such an instruction would be valid or legal in the first instance. As an aside, when US investors make investments in other countries, these investors will typically seek protection under a bilateral investment treaty (BIT) between the US and the destination country. Sometimes the US investor will invest through a country that does have a bilateral investment treaty with the destination country. A bilateral investment treaty may set out rules in respect of expropriation (or regulatory expropriation). See UNCTAD - International Investment Agreements The Cayman Islands (not surprising) does not have a BIT with the US. In this transaction, however, we do have the advantage of RWA Foundation as the Maker “touch point” with the real world. If your scenario occurs, Maker has the ability through the Delegated Committee and/or directly through Maker governance, to have some ability to mitigate the potential action. Without that touch point, Maker would have no options. I generally agree with Rune that “diversification” and “engagement” are an important part of the overall strategy. However, neither diversification nor engagement entirely eliminates the potential risk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.252083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#37",
                    "likes": "5",
                    "time": "06/07/2022-12:07:09",
                    "content": "    christiancdpetersen:  However, neither diversification nor engagement entirely eliminates the potential risk.   So in other words, Risk is real, Fear is a Choice.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#38",
                    "likes": "0",
                    "time": "06/07/2022-12:33:37",
                    "content": "    ChrisBlec:  For instance, this theoretical scenario: Apr 2023: The NY Times reports that Putin is using a stablecoin called DAI to circumvent US sanctions. President Biden demands that any bank associated with MakerDAO immediately sever ties and freeze assets. The banks have no choice but to comply.   I think there needs to be a large bold disclaimer on there saying, “Don’t read unless you have had at least one cup of coffee”  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.309523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#39",
                    "likes": "1",
                    "time": "06/07/2022-13:51:20",
                    "content": "One also needs to develop a smart view on the probabilities of these different attack scenarios and then determine which ones have significant risk to Maker and the determine how to best mitigate these scenarios.  Ultimately Maker is risk weighting various risks (risk weight - probability of risk X damage from risk assuming it occurs) and managing accordingly ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.324404761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#40",
                    "likes": "2",
                    "time": "06/07/2022-14:07:15",
                    "content": "Won’t be splitting this thread just yet. Chris’s comments ask about a higher-level concern that’s relevant to the proposal and I see that Christian provided helpful context wrt HVB. I may split it off if there are more comments about the general topic that are not specific to HVB. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#41",
                    "likes": "4",
                    "time": "06/07/2022-14:19:41",
                    "content": "Think CP addressed Blec’s concerns perfectly. I want to echo @Eumenes’ comments particularly. We are navigating a landscape of probabilities and attached outcomes. EV calculations are not a perfect science but a dynamic dance. We should make the best moves we can with the information at our disposal, mitigate the associated risks, and then be good Bayesians. A LOT has changed since Maker started, both endogenously and exogenously. To fail to adapt is to die. Perfectionism (i.e. zero risk) is the enemy of progress. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#42",
                    "likes": "2",
                    "time": "06/07/2022-15:59:29",
                    "content": "Love this quote:     teej:  Perfectionism (i.e. zero risk) is the enemy of progress.   Let’s move forward with calculated risks and enough upside to outweigh these risks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#43",
                    "likes": "0",
                    "time": "06/07/2022-16:28:41",
                    "content": "    flipflopflapdelegate:  So in other words, Risk is real, Fear is a Choice.    It’s not about “fear”. It’s about ensuring survival and not putting the DAO’s collective head in the sand on certain risks simply because they’re too difficult to grapple with.     teej:  Perfectionism (i.e. zero risk) is the enemy of progress.   It’s not about “perfectionism”. It’s about ensuring that the DAO does everything possible to minimize the impact of any predictable risk. Illegal regulatory action based on unpredictable uses of DAI is a very real, very predictable situation. The DAO needs to acknowledge this and plan for every possibility before going all-in on a proposal like HVB. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.437554112554112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#44",
                    "likes": "1",
                    "time": "06/07/2022-22:02:45",
                    "content": "@Davidutro Agreed on your suggestion. Certain aspects of the conversation on the thread relate to risks and controls, and how the DAO can handle them. This is not necessarily specific to HVB. HVB here is an example. The way the transaction was structured is dealing with some of those risks, in many ways in a more mature fashion than precious ones. It is an evolution. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.511904761904762
                }
            ]
        }
    ],
    "group_index": "868"
}