{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/digitized-mining-in-russia/15881",
            "title": "Digitized Mining in Russia ",
            "index": 15881,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "news"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#1",
                    "likes": "2",
                    "time": "17/06/2022-17:10:32",
                    "content": "The news related to Russia and Bitcoin mining are nothing new, the interesting thing at the moment is that the adoption is going much faster than they think, Coindesk had announced it in 2020 but it was more of a speculation since in the congress of Russia there was no issue related to mining and Russia at that time.    coindesk.com – 30 Dec 20    Russian Oil Drilling Giant Opens a Crypto Mining Farm Run on Gas Energy Gazpromneft, a subsidiary of Russian oil and gas giant Gazprom, is opening a bitcoin mining venue on one of its oil drilling sites.      The feedback of the leftover gas in the extraction of oil would be used as resources for the mining of Bitcoin, although it was only a report, that topic was not officially touched on. Of course, it is not a new model, since American companies already used this model.  The interesting thing comes when they officially touch on the issue of mining digitization in Russia yesterday.  IMG_20220617_1231281920×2560 219 KB  The participants to highlight, in addition to the people with important positions in their area, are:  IMG_20220617_1312501080×910 146 KB     google.com – 16 Jun 22    Russia's Gazpromneft and BitRiver Partner to Develop Crypto Mining Operations The oil-producing subsidiary of state-owned natural gas giant Gazprom will provide energy to data centers set up by BitRiver.         Bitcoin Magazine    Third Largest Russian Oil Company Gazpromneft Partners With BitRiver To Mine... Gazpromneft, the third-largest oil producer in Russia, is partnering with Swiss-based bitcoin mining company BitRiver to mine bitcoin with excess resources.      Thus managing not to miss a beat with respect to expenses for transportation and logistics and adding profit by balancing expense and profit, all thanks to cryptocurrencies and the PoW system.    OilPrice.com    Gazprom Neft CEO: Russia Already Exports Half Of Its Oil To Asia | OilPrice.com Half of Russia's crude is headed east to Asia, compared to 75 percent of Russia's oil exports which were being shipped to Europe earlier this year according to Gazprom Neft chief Dyukov      “We believe that redirecting of all Russian oil and products volumes may not be possible due to infrastructural limitations, buyers’ self-restrictions and logistical complications, such as potential restrictions on providing insurance for cargos carrying Russian oil,” The quote indicates that they want to add extra profit and therefore explore digital mining. We know that we are in a delicate moment for the global economy, but we must see some bright lights in dark times. The total environment of the world at a social, economic and political level is changing, cryptocurrencies will be protagonists and we will be part of it.   twitter.com    halfin @halfin  Running bitcoin   3:33 AM - 11 Jan 2009           50K                17K            ",
                    "links": [
                        "https://www.coindesk.com/markets/2020/12/30/russian-oil-drilling-giant-opens-a-crypto-mining-farm-run-on-gas-energy/?_gl=1",
                        "https://www.google.com/amp/s/www.coindesk.com/business/2022/06/16/russias-gazpromneft-and-bitriver-partner-to-develop-crypto-mining-operations/%3FoutputType=amp",
                        "https://www.google.com/amp/s/www.coindesk.com/business/2022/06/16/russias-gazpromneft-and-bitriver-partner-to-develop-crypto-mining-operations/%3FoutputType=amp",
                        "https://bitcoinmagazine.com/business/gazpromneft-partners-with-bitriver-to-mine-bitcoin",
                        "https://bitcoinmagazine.com/business/gazpromneft-partners-with-bitriver-to-mine-bitcoin",
                        "https://oilprice.com/Energy/Crude-Oil/Gazprom-Neft-CEO-Russia-Already-Exports-Half-Of-Its-Oil-To-Asia.html?utm_source=tw&utm_medium=tw_repost",
                        "https://oilprice.com/Energy/Crude-Oil/Gazprom-Neft-CEO-Russia-Already-Exports-Half-Of-Its-Oil-To-Asia.html?utm_source=tw&utm_medium=tw_repost",
                        "https://twitter.com/halfin/status/1110302988?s=20&t=UwKMPBtaoYNfu8JPiJC1JA",
                        "https://twitter.com/halfin/status/1110302988?s=20&t=UwKMPBtaoYNfu8JPiJC1JA",
                        "https://twitter.com/halfin/status/1110302988?s=20&t=UwKMPBtaoYNfu8JPiJC1JA",
                        "https://twitter.com/halfin/status/1110302988?s=20&t=UwKMPBtaoYNfu8JPiJC1JA"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.224147727272728
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "2",
                    "time": "17/06/2022-17:56:44",
                    "content": "So is the new media narrative going to be “Bitcoin funds the murder of Ukranians”? Can’t see this being a positive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.909090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/06/2022-18:21:46",
                    "content": "Ukraine also has a fairly large portfolio of BTC, the narrative of BTC has no color, I only write it for adoption Edit: Remember that BTC was widely used to trade on the Deep Web, and the media called it “evil money” and you see how you and I are talking about it 10 years later https://www.theguardian.com/technology/2013/oct/03/bitcoin-price-silk-road-ulbricht-value ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.261904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#4",
                    "likes": "0",
                    "time": "18/06/2022-02:46:15",
                    "content": "And unfortunately, people are so easily manipulated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                }
            ]
        }
    ]
}