{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/should-we-move-makerdao-s-forum-from-discourse-to-a-web3-native-forum-system-metaforo-io/19981",
            "title": "Should we move MakerDao\\xe2\\x80\\x99s forum from Discourse to a Web3 Native Forum System - Metaforo.io   ",
            "index": 19981,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/HowdyMetaforo",
                    "index": "#1",
                    "likes": "0",
                    "time": "27/02/2023-11:15:02",
                    "content": "Basic Details: Project Name: Metaforo - Web3 Native Forum for Web 3 Governance This text will be hidden Team Name: Metaforo Project Overview Metaforo Website: https://www.metaforo.io Discord: Metaforo.io Twitter: https://twitter.com/realmetaforo Youtube: Case Study - Shapeshift Migrating to Metaforo from Discourse      Deck: Metaforo.io Overview The forum is a critical piece of infrastructure for any DAO. It’s where community members come together to brainstorm ideas, draft proposals, give feedback on each other’s ideas, and generally coordinate to get things done. It’s critically important for DAOs that their forums are decentralized and owned by community members. Many crypto projects and DAOs have their communities on Discourse. However, because Discourse is a web2 tool with centralized data ownership and other limitations, some projects are looking for Web3 forum tooling alternatives. Metaforo is a Web3 native forum that has many of the same features as a traditional forum system, such as creating topics, commenting, liking, and polling. But it is web3 native. All content is stored on Arweave, and all governance processes are token-gated and token-weighted. Problems: Discourse is a web2 tool with centralized data ownership and other limitations, including:  Sybil attacks: These occur when multiple fake email addresses are used to abuse the governance process. Lack of on-chain proof of work: This can make it difficult to verify the authenticity of proposals and votes. Lack of motivation for contributors, including low participation rates in voting. No Web 3 access control to discussions and voting: This means that the platform is not as secure or decentralized. No token-weighted voting: Without this, voting power is not distributed fairly among stakeholders. No display of snapshot strategies: This can make it hard for users to understand how proposals are being evaluated and selected. Lack of DAO ownership: This means that the community does not have full control over the platform and its decision-making processes. Centralized data storage. Monthly subscription fee.  Solutions: Metaforo is Web3 native with decentralized data ownership  Wallet connections are used to reinforce identity validation and prevent Sybil attacks on voting. The DAO Admin can issue SBT (Staked Based Token) to members as proof of work, increasing the authenticity of proposals and votes. Wallet integration makes it easy to reward contributors with tokens, NFTs, and POAPs. A mobile app with push notifications is available to encourage higher voting participation rates. Token gated pools are supported, and voting power is calculated using snapshot strategies to ensure fair distribution of voting power. Snapshot strategies are displayed to keep the forum and governance processes in one place and make it easy to understand how proposals are being evaluated and selected. Gnosis safe is supported to ensure that the DAO community has full ownership over the platform. Decentralized data storage on Arweave. Best of all, there is no monthly payment required to use Metaforo - it’s completely free to use!  What to Expect after Migrating to Metaforo from Discourse:  All members and content from your previous forum will be transferred to Metaforo. Users can log in to their new Metaforo account using their Discourse account, and then connect their wallets to their email address. Your forum URL will stay the same, and all existing thread URLs will be automatically updated to the new platform. Metaforo offers an NFT and token-based permission system, which allows for specific token or NFT holders to join, view, vote, and more. Multiple voting permission controls are available, including erc20, erc721, erc1155, and snapshot strategies. Gnosis Safe login is supported so the DAO’s treasury can be appointed as the admin of the forum. The best part is that all of these features are available at no cost to you and your team.  Some Crypto Projects that have made metaforo.io their new home recently ShapeShift: https://forum.shapeshift.com/ BuilderDao: https://forum.builderdao.io/ Contact Contact Name: Howdy Contact Email: [email protected] Discord: Bue | Metaforo#5801 Telegram: Telegram: Contact @Bluefishie Contact Howdy for an obligation free demo and feel free to create a group on https://metaforo.io/ to get a feel of its feasibility. We are open to any custom feature requests. Vote For: Set up a test group on Metaforo.io to see if it’s a good fit for the MakerDao. Aainst: The current Discourse Community is good as it is, no need to look elsewhere. ",
                    "links": [
                        "https://discord.gg/uwxYdPx2wh",
                        "https://twitter.com/realmetaforo",
                        "https://www.youtube.com/watch?v=7jUyabZIb0k",
                        "https://app.pitch.com/app/public/player/6d195f9b-8d30-4ba0-ae07-fc0ad522f4ef",
                        "http://metaforo.io",
                        "https://forum.shapeshift.com/",
                        "https://forum.builderdao.io/",
                        "https://t.me/Bluefishie",
                        "https://metaforo.io/",
                        "http://Metaforo.io"
                    ],
                    "GPT-summary": "The post proposes the use of a Web3 native forum system, Metaforo, as an alternative to Discourse for DAOs. It explains the limitations of Discourse and how Metaforo addresses them. The post also provides solutions and benefits of using Metaforo. The author invites the MakerDao community to set up a test group on Metaforo to see if it's a good fit. The post also mentions other crypto projects that have migrated to Metaforo.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.021707459207459
                }
            ]
        }
    ]
}