{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/brainstorm-how-do-we-ensure-small-vaults-have-a-place-at-maker/6072",
            "title": "[Brainstorm] How do we ensure small vaults have a place at Maker? ",
            "index": 6072,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion",
                "dust",
                "growth"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "6",
                    "time": "16/01/2021-16:43:48",
                    "content": "This post is intended to offer a broader discussion on strategies MakerDAO members see fit for maintaining the ability for smaller vaults to exist. You may want to check out the conversation on the Bite Rebate Poll to inform the discussion here. The Signal Request to Increase the Dust Parameter is expected to be finalized by on-chain voting next week, raising the Dust Parameter (minimum DAI debt per vault) to 2,000 DAI. The security of the protocol is paramount, which helps explain why the Dust Parameter was just 20 DAI in August of last year and will now (probably) be 2,000 DAI just five months later. If we do not put together a plan that allows for liquidations to be preformed more cheaply, our Community will be at the mercy of Gas prices and ETH appreciation, preventing many valuable operations from people not currently in our community. I will use one last wall of text here to briefly explain why this issue is so near and dear to me. Put simply, I would not be here contributing to this vibrant and supportive community if I had found out about Maker even a couple weeks later than I did. For me, being able to test the vaults by borrowing the minimum (at the time) of 100 DAI was paramount for me being able to understand and trust the system with more of my assets. Less than a week after opening my testing vaults, the Dust Paramater was increased to 500 DAI, prompting me to join the community and start posting on the forum. I am constantly grateful that I found MakerDAO mere days before it might have slipped away from me, as I now consider this community a home and a welcome personal obsession. Seeing as the dangers of a higher Dust Parameter include:  inability for new users to “test” vaults at reasonable risk levels a barrier to entry in the DAO for contributors with less capital effectively pricing out users with a native currency weak to USD diverting market share to platforms (like Aave and Compound) without high minimums more concentrated positions from individual vault users making compatible “partner” solutions like B.Protocol more difficult to manage  And a variety of different vectors for solutions have been suggested like:  rebating keepers that call bite on undercollateralized vaults incorporating a Layer 2 solution to cut down on expenses expanding partnerships with groups like B.Protocol that offer committed liquidators updating Liquidations2.0 to be more efficient for liquidating smaller vaults moving small undercollateralized vaults to an ETH reserve fund hiring someone to manually preform bite calls  I think it’s time we start aggregating and discussing what might be a reasonable path forward. There are reasonable concerns about bandwidth and development cost, but I firmly believe the amount of vault users and contributors to MakerDAO we will gain in the long run by investing into a solution will cover those costs ten-fold. Thanks for reading and please drop your thoughts below! If you like an idea you’ve already seen in the forum, I suggest giving a tag or a linkback to draw in some discussion! ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-increasing-dust-parameter/5963",
                        "https://forum.makerdao.com/t/fears-about-new-dust-limit-increase-pr-responsibility-for-new-small-account-users/5307",
                        "https://forum.makerdao.com/t/maker-relay-ep-28/6118",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124",
                        "https://forum.makerdao.com/t/informal-poll-creating-a-bite-rebate-contract-for-keepers-acting-on-small-vaults/5979/29"
                    ],
                    "GPT-summary": "The author of the post is seeking feedback and constructive criticism on strategies to maintain the ability for smaller vaults to exist in MakerDAO. The post discusses the potential dangers of a higher Dust Parameter and suggests various solutions to address the issue. The author encourages readers to drop their thoughts and ideas in the comments section and to tag or link back to previous discussions on the topic.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.516837647306398
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#2",
                    "likes": "3",
                    "time": "16/01/2021-16:52:47",
                    "content": "    prose11:  updating Liquidations2.0 to be more efficient for liquidating smaller vaults   or alternatively/additionally give higher (relative) liquidation penalty to small vaults. if a minimum liquidation penalty would be 50 to 200 DAI + 13% of the debt, then the LIQ 2.0 system would safely be able to give 200 DAI tip for the caller of bite. for vaults with 150% CR, it would probably allow supporting minimum debt sizes of 200-1000 DAI (depending on the actual tip, and the efficiency of liq 2.0 process) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "2",
                    "time": "16/01/2021-16:55:04",
                    "content": "I wonder if having a higher LR would allow smaller dust as well… But cannot get the math around it done  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#4",
                    "likes": "3",
                    "time": "16/01/2021-16:56:35",
                    "content": "This is something that can likely be done once we have a viable L2 solution such as Optimism. Until then we are stuck with the heavily congested main chain. I don’t think there is a way around it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.958333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "0",
                    "time": "16/01/2021-17:05:32",
                    "content": "Wow way more initial responses than I expected on a weekend lol thanks everyone!     yaronvel:  or alternatively/additionally give higher (relative) liquidation penalty to small vaults.   I like this idea a lot and it wouldn’t be too hard to implement. The goal after all is not to get liquidated and even if someone wanted to test liquidations, having a low Dust limit with a higher penalty would seem agreeable.     ultraschuppi:  I wonder if having a higher LR would allow smaller dust as well… But cannot get the math around it done    Likewise for this idea! If the dust is low enough, being forced to open with more collateral would still be way cheaper than a higher dust limit. What if we added a high LR, low dust vault arrangement for each new collateral type?     hexonaut:  This is something that can likely be done once we have a viable L2 solution such as Optimism   Hearing xDAI present on this week’s collateral call definitely makes me optimistic that we could implement some L2 solutions imminently. Out of curiosity, are we currently running any experiments with L2 compatibility? I know @NikKunkel mentioned that an L2 oracle is desired on the last Governance and Risk call, seems like that would have to be the first step in putting something together ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.459116161616162
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#6",
                    "likes": "2",
                    "time": "16/01/2021-17:49:34",
                    "content": "What if We keep the dust parameter. But we add a new parameter to switch from AMM vs dutch auction. Under x amount, auto liquidation via AMM at a swap cost. Swap should be the cheapest options to liquidate. Over x back to doutch auction as we currently do. Amount under the attack vector can be calculated if we own the liquidity and know the swap fees. For the actual kick of the auction either we incitive people to start the auction via some reward or we loop on those specific vault during the price changes. Also on another hand the attack describe is not really applicable as the attaquant needs to show it is game way before the attack. And it is visible we would pass from 20k vaults to 1M vaults. At that time if we increase the dust the attaquant is the attacked as he needs to pay a lot of gas to exist its position. Or I missed something but this attack needs a lot of capital with a big chance of losing it. Actually, would taking a position on gas saving token more profitable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3347107438016526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "0",
                    "time": "16/01/2021-19:11:14",
                    "content": "    hexonaut:  This is something that can likely be done once we have a viable L2 solution such as Optimism. Until then we are stuck with the heavily congested main chain. I don’t think there is a way around it.   Totally agree–we will be stuck w/L1 for the foreseeable future–you got Compound announce their App-chain, we got Layer 2’s coming online and they won’t be directly interoperable and composable the way Layer 1 is. I myself tried Loopring and left because there was barely any liquidity. All in all we are going to have to think about Layer 2 DApps a lot different than the way we think about the basic Apps we use today. I actually came across this conversation this week:  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.053030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#8",
                    "likes": "0",
                    "time": "16/01/2021-19:24:06",
                    "content": "    prose11:  I like this idea a lot and it wouldn’t be too hard to implement. The goal after all is not to get liquidated and even if someone wanted to test liquidations, having a low Dust limit with a higher penalty would seem agreeable.     ultraschuppi:  I wonder if having a higher LR would allow smaller dust as well… But cannot get the math around it done    Likewise for this idea! If the dust is low enough, being forced to open with more collateral would still be way cheaper than a higher dust limit. What if we added a high LR, low dust vault arrangement for each new collateral type?   That is the solutions I prefer overall, eth and wbtc should be enough for new joiner. And as said actually eth-c is not really interesting except for rate psychological reason. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.210265151515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#9",
                    "likes": "3",
                    "time": "17/01/2021-11:30:38",
                    "content": "In addition, one of the pain points for small vaults when raising dust parameter is also how it impacts existing small vaults. It’s my understanding that small vault holders have to lock up additional collateral just to mint big enough vault and then close it instead of closing their small vaults directly. Correct me if I am wrong though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#10",
                    "likes": "1",
                    "time": "17/01/2021-12:17:46",
                    "content": "    Doo:  It’s my understanding that small vault holders have to lock up additional collateral just to mint big enough vault and then close it instead of closing their small vaults directly   no. in fact they cannot lock up additional collateral before they would first either close their debt, or increase it (and the latter might not be possible if their collateral is small). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.694444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#11",
                    "likes": "1",
                    "time": "17/01/2021-13:38:06",
                    "content": "Ah ok. Thanks for clarification. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#12",
                    "likes": "0",
                    "time": "17/01/2021-16:35:05",
                    "content": "    yaronvel:  in fact they cannot lock up additional collateral before they would first either close their debt   Erm… I guess that is not correct, you should always be able to add more collateral. I guess what you mean that it might be complicated to release the necessary collateral to swap it for DAI to repay and with that closing the vault. Repay with flashloan would help here, I heard defisafer is already offering something like that ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.364583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#13",
                    "likes": "3",
                    "time": "17/01/2021-16:49:39",
                    "content": "    ultraschuppi:  Erm… I guess that is not correct, you should always be able to add more collateral.   see this line in the code. it checks that debt > dust, and revert otherwise, even if the operation is ilk deposit. I was also surprised/disappointed to find it our, when one of B.Protocol users was not able to deposit more collateral after the last dust level increase. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#14",
                    "likes": "0",
                    "time": "17/01/2021-16:51:24",
                    "content": "Oh…  wow… that was unexpected. On the other hand: if you have more collateral to add you can easily swap to DAI to repay and with that closing. It is a lot harder if you have nothing to add - then you are basically locked (without additional tools) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.808333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#15",
                    "likes": "2",
                    "time": "17/01/2021-16:54:11",
                    "content": "Only if your would be added collateral is entirely enough to repay the loan though. You can’t even pay down DAI debt when your vault is below the dust minimum unless you are paying it off entirely. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.805555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#16",
                    "likes": "1",
                    "time": "17/01/2021-17:06:41",
                    "content": "Unless the collateral is not enough to repay the full debt, but it is enough to save save you from liquidation. Then, sfyl. A flash loan can save u here, but it force u to trust other systems. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.28125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#17",
                    "likes": "2",
                    "time": "17/01/2021-17:23:28",
                    "content": "DAI native flashloan is already near (weeks not months), so could have build something native ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#18",
                    "likes": "9",
                    "time": "18/01/2021-00:38:16",
                    "content": "I think the answer here is for a “mega-vault” solution. A protocol (maybe @sowmay @Samyak with Instadapp or @yaronvel with bprotocol?) could open one big vault and then manage the users positions (and handle liquidations) external to Maker. The only job of this sub-protocol operator would be to ensure that their own liquidation system worked well enough to ensure that the “mega-vault” is never liquidated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#19",
                    "likes": "4",
                    "time": "18/01/2021-13:57:59",
                    "content": "Our proposal for committed keeper mechanism     MIP13c3-SP9: Onboarding a new collateral type backed by B.Protocol (Declaration of Intent) RFC       Preamble MIP13c3-SP#: 9 Author(s): Yaron Velner (@yaronvel) Contributors: n/a Status: Request for Comment (RFC) Date Proposed: 2021-1-05 Date Ratified: <yyyy-mm-dd> Declaration Statement: Onboarding a new collateral type backed by B.Protocol. Declaration to Replace: n/a  Specification Context and Motivation  Maker, and the DeFi ecosystem in general, has conservative collateral ratios (CR), in order to mitigate potential failures in the liquidation process. High CRs narrows the potential user bas…      could also support such low dust level, as instead of liquidating the vaults, it just add unsafe vault position to the keeper vault, which is pretty light on gas. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.566363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#20",
                    "likes": "0",
                    "time": "18/01/2021-15:24:36",
                    "content": "Can you explain a bit further? I thought that if bprotocol failed to liquidate a vault, it simply reverted to the normal liquidation mechanism? Are you saying your implementation would batch small vaults into a larger position? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#21",
                    "likes": "2",
                    "time": "18/01/2021-15:47:05",
                    "content": "There are two parts to it:  B.Protocol liquidators will be forced to liquidate, as long as they are solvent. And this will be enforced by the same tip mechanism as in LIQ-2.0. If B.Protocol liquidators are insolvent (and in particular it means they lost their initial $0.5m deposit), then it goes to the standard liquidation system.  But the liquidation of the liquidators will be simply to move them the underwater position. Meaning they will have a big vault, and it will be their responsibility to keep it solvent. It does not mean that user vault will automatically go to them, only when user vault get under water. However, this process is much cheaper gas wise. As for small positions they don’t need to hedge. And not auction mechanism is triggered. This is why lower dust level could be supported there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.239583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#22",
                    "likes": "1",
                    "time": "18/01/2021-21:09:18",
                    "content": "So in essence - a user could only open a Vault below the dust limit in B.Protocol, and in the event of mass liquidations the liquidators would have no choice but to bid on the collateral? If so, this sounds like a great use case for B.Protocol! Is it possible to have a special vault type that must be open via B.Protocol where there’s actually a maximum rather than a minimum? To ensure there will be sufficient liquidators? Or does this not make sense? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.969387755102042
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#23",
                    "likes": "0",
                    "time": "18/01/2021-21:29:27",
                    "content": "To simplify the discussion, let’s say that ETH-C will be a new collateral type, backed by B.Protocol keepers. So the dust level for ETH-C could be set to a value much lower than $2k. In the event of liquidation, the B.Protocol liquidators will have to cover for the bad vault position. The experiment we offer in the RFC is to just start with low ceiling, and this way we can make sure the number of liquidators (i.e., their locked capital) fits the maximum debt. But this is currently only in RFC phase. This is not the currently deployed B.Protocol system over ETH-A. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.097402597402597
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#24",
                    "likes": "0",
                    "time": "18/01/2021-21:42:51",
                    "content": "I’m not sure this solves the problem. The issue isn’t organic users creating small vaults, it’s the potential for an attack where one user creates tons of small vaults (I believe it was you that identified this in the first place?). In this latter scenario, if the number of liquidations exceeds B.Protocol’s Keeper pool, all of the “dusty” vaults would just end up in the normal liquidation system and we’re back at square one. Would it not make more sense to have a special Vault type, backed exclusively by B.Protocol which only allowed “dusty” vaults? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.230519480519481
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#25",
                    "likes": "2",
                    "time": "19/01/2021-07:28:42",
                    "content": "The attack we described stem from the fact that it is very cheap (gas wise) to split your vault, and it is x10 more expensive to liquidate it (with current liquidation process). With B.Protocol the process will be cheaper (when b.protocol is the one who liquidate). If B.Protocol liquidators go default, then maker keepers will have to liquidate a big vault (the liquidator’s vault). But in any case, the ceiling of ETH-C should be such that Maker feels comfortable letting B.Protocol hadle. So say it allows initially $5m ceiling. Then an attacker cannot have bigger debt, even if he splits it to small vaults. Answering your question about supporting only small vaults. For us, as a business model it is not very appealing, as the motivation to support small Vaults is the hope the user will eventually increase his vault after he try it out for a while. A model where Maker changes its liquidation process in ETH-A, and send us all underwater small vaults for us to liquidate, would make sense. But requires much more effort on Maker side. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.327136752136752
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#26",
                    "likes": "4",
                    "time": "19/01/2021-17:49:35",
                    "content": "So pretty exciting development, @Davidutro had Yield Protocol on the Community Call today to talk about their fixed rate loan products that are built on Maker. Because of the polling and backend stuff that they are doing (i.e. interacting with Maker ETH vaults themselves rather than having their users do it), they have a minimum loan amount of less than 1 DAI. This means that small account users have somewhere to go and are still fundamentally utilizing Maker. One downside here is that Maker doesn’t get the visibility, Yield Protocol does. Check them out!    yield.is   Yield Yield Protocol brings fixed-rate, fixed-term borrowing and lending to decentralized finance.      ",
                    "links": [
                        "https://yield.is/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.170833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#27",
                    "likes": "1",
                    "time": "19/01/2021-18:08:03",
                    "content": "I think, since Yield protocol also liquidates positions, they may need to increase that limit eventually so they don’t encounter the same problem of many small unliquidatable positions. Gas costs suck. That’s the real culprit behind pricing out smaller users. In the meantime though, users can borrow super small amounts at fixed rate and term through Yield’s v1 app. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.12962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#28",
                    "likes": "0",
                    "time": "19/01/2021-21:33:38",
                    "content": "Afaik when u borrow from yield protocol, the dai u get is not being minted on Maker, but rather from a liquidity pool. But it is a fixed duration loan, and if you don’t repay it at the end of the loan, then a dai from Maker is borrowed to repay it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving additional information on proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#29",
                    "likes": "0",
                    "time": "19/01/2021-21:35:14",
                    "content": "That is correct @yaronvel It does not generate Dai from the Maker Protocol directly. It’s a secondary Dai lending and borrowing platform. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#30",
                    "likes": "1",
                    "time": "20/01/2021-06:00:10",
                    "content": "For me it sounds like we caring about macro-economics at maker while leaving the space for smaller vaults to secondary platforms. Imvho that is totally okay.     prose11:  One downside here is that Maker doesn’t get the visibility, Yield Protocol does. Check them out!   yepp, just looking at the price of MKR in the last year we have not gained anything from the yield-craze. But I don’t worry about it too much, actually I am happy if other products just utilize our product (DAI). I still would like to have Maker as inclusive as possible, so we should definitely review the dust as soon as Liq2.0 gets deployed ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#31",
                    "likes": "1",
                    "time": "20/01/2021-12:24:16",
                    "content": "It’s great to see this ideas coming up, but it think even for people opening small vaults with this gas prices is not proffitable, i defend the position of having a small Dust parameter but yeah, actual gas prices combined with the ETH price itself, makes all processes pretty hard to execute. I think at the end we need to start focusing in a L2 solution in the short-middle term, as well with liquidations 2.0 and wait for ETH 2.0 in the long term … ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.148809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#32",
                    "likes": "0",
                    "time": "21/04/2021-18:24:20",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}