{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/minimum-debt-on-makerdao/11086",
            "title": "Minimum debt on MakerDao ",
            "index": 11086,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ZhakirSetie",
                    "index": "#1",
                    "likes": "2",
                    "time": "19/10/2021-10:25:07",
                    "content": "I was just trying out Oasis for the first time to see if I could borrow small amounts of Dai via Makerdao and saw that the minimum debt is a whopping $10K worth of Dai creat ed…does anyone have any advice on what could be done here? https://9apps.ooo/ Also, what kind of solutions is MakerDao looking into for this? Feels like this is going to be leave out a lot of people who don’t have that kind of money to just put away at hand. ",
                    "links": [],
                    "GPT-summary": "The post is a question about the minimum debt on MakerDao and the author is seeking advice on what can be done about it. The post also asks about the solutions that MakerDao is looking into for this issue. The post does not fit perfectly into any of the listed topics, but the closest matches are 3rd party asking questions about proposal, 3rd party giving constructive criticism of proposal, and 3rd party extending to proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "3",
                    "time": "19/10/2021-10:40:51",
                    "content": "It’s primarily a gas price issue. The concern is that if gas costs are too high then debt auctions will be less attractive if a vault needs to be liquidated. This could result in the protocol losing money. The most recent thread examining this is here:     Gas Environment and Dust Limit Review - August 2021 Risk       Here is an update on the gas market environment and dust parameter (minimum permitted vault debt). I plan to begin posting these updates on a more regular basis to help the community stay aligned on the dust parameter and respond to changing conditions.   EIP 1559 and Gas Market Changes Ethereum recently activated the London hard fork, which initiated EIP 1559. This creates a fairly large change to the gas fee market. Gas fees are now separated into two sections, a base fee and miner tip. The ba…     That said, if the ETH POS merge is successful and gas costs reduce then we may be able to review this. However, there is an uncertaim timeline on this at present. ",
                    "links": [
                        "https://makerdao.world/en/learn/governance/param-debt-floor",
                        "https://notes.ethereum.org/@vbuterin/eip-1559-faq"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.855317460317461
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ianaz",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/10/2021-07:48:33",
                    "content": "I’d add that in the future we’ll be able to mint DAI on an Ethereum’s L2, reducing costs even more. I could imagine this minimum be set to 50-100 by then More info:    A Multichain Strategy and Roadmap for Maker Governance   A Multichain Strategy and Roadmap for Maker The aim of this forum post is to present a bird’s eye view of the Layer 2 ecosystem and the various opportunities that exist. By presenting our interpretation of the multichain landscape we hope to be able to (1) Guide and engage with the broader community on this specific topic, (2) Gather feedback regarding the various opportunities, and (3) Align technical and development resources to agree on a strategy for how MakerDAO should embrace this new and…         MakerDAO's Timeline for Launching DAI on Arbitrum One Integrations       Hi all,  After months of development we are excited to see the Arbitrum team make their Layer 2 solution, Arbitrum One, available publicly on mainnet. This Optimistic rollup will facilitate the mass scaling of Ethereum and EVM compatible smart contracts by reducing transaction costs and latency. Optimistic rollups make this possible by minimising the amount of on-chain data by rolling up data into a cryptographically hashed transaction to reduce the required computation on base layer Ethereum.  S…     ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdaos-timeline-for-launching-dai-on-arbitrum-one/10100",
                        "https://offchain.medium.com/mainnet-for-everyone-27ce0f67c85e"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.684014514896868
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "0",
                    "time": "20/10/2021-16:43:42",
                    "content": "You can use other lending protocols, which also have good advantages for that, you deposit your ETH and use it as collateral to borrow DAI. And the ETH does not stop earning you interest. You have that in the system because of the price of gas, plus the operational costs of maintaining those vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "19/01/2022-22:44:35",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}