{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/consultation-poll-centrifuge-global-debt-ceiling-cap/11619",
            "title": "[Consultation Poll] Centrifuge Global Debt Ceiling Cap ",
            "index": 11619,
            "category": [
                "Governance"
            ],
            "tags": [
                "centrifuge",
                "informal-poll",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#1",
                    "likes": "7",
                    "time": "13/11/2021-00:19:18",
                    "content": " Background Recent discussions in the community have brought back old concerns regarding existing Centrifuge legal structures. While such discussions contribute to improvements in governance, they also bring more long-term uncertainties to the collaboration between Maker and the 3rd party borrower community. Centrifuge is an integral part of that long running network. Recent proposals for an arranger model and other RWA-related R&Ds have created a further option to the future relationship between Maker and the borrower community via scalable intermediaries, called “arrangers”. While these discussions are still at consultation stage, Centrifuge has expressed its willingness and commitment to becoming an “arranger” and upgrading its structuring framework to accommodate Maker tokenholders’ requirements.  Motivation This consultative poll has two purposes:   Committed and uncommitted debt ceilings: To consult the community and MKR tokenholders on whether they wish to have a global debt ceiling cap implemented across vaults utilising old Centrifuge structures.   Discretionary debt ceilings: To consult the community and MKR tokenholders on whether they see a discretionary debt ceiling as a viable option to Centrifuge-related projects that prove the establishment of acceptable structuring by the DAO (i.e. upgraded and robust). Discretionary is an exception rule applied on a case by case basis. It is not globally set. See notes below for clarification.   The definitions for terms used in this poll are described below.  Current state Below are the current committed and uncommitted debt ceiling amounts (in DAI) by each Centrifuge-facilitated project. Committed DC total DAI 64M. Uncommitted DC total DAI 165M. Global DC: 229M. Committed debt ceilings:     Name Category RWA Token Debt Ceiling     NewSilver Real estate RWA002 $20,000,000   ConsolFreight Trade finance RWA003 $2,000,000   Harbor Trade Credit Trade finance RWA004 $7,000,000   FortunaFi Venture-debt RWA005 $15,000,000   Peoples Company Farmland RWA006 $20,000,000    Uncommitted debt ceilings:     Name Category Token Requested DC Note     FortunaFi: Pipe Venture-debt FF1DRP $15,000,000 Top up   Naos.finance Inventory and AR PA-DROP $20,000,000    Monachil CF Credit fund MC-DROP $10,000,000    NebulaCapital/Tinka Consumer Finance NCP01-DROP $50,000,000    REIF Real estate REIF-DROP $50,000,000    UntangledFinance Trade Finance Fund U-DROP $20,000,000      Definitions Global debt ceiling: The total amount of Vault debt ceiling (in DAI) that is available to all Centrifuge RWA Vaults. It’s an aggregated DC for all DROP issued via Centrifuge. The total is calculated by summing up the committed debt ceilings, the uncommitted debt ceilings plus any discretionary debt ceiling. Global debt ceiling cap: The maximum amount of global debt ceiling (in DAI) that can be committed to the aggregate of all Centrifuge RWA Vaults. It’s a maximum cap for all DROP.  Note the intention of a global debt ceiling cap is to prevent the total debt ceiling from exceeding a certain amount (in DAI). MKR tokenholders have discretionary rights to increase the global debt ceiling cap should they have reasonable reasons for its review (e.g. acceptable legal structuring).  Committed debt ceiling: The total amount of Vault debt ceiling (in DAI) that is committed to all Centrifuge RWA Vaults. The definition of commitment is based on an on-chain vote post-risk assessment in which a requested DC by the borrower was specified and approved by vote. Recent signal requests still under deliberation are not included in the calculation (e.g. RWA006). These may be considered discretionary debt ceilings (see below). Uncommitted debt ceiling: The total amount of Vault debt ceiling (in DAI) not yet committed to any Centrifuge RWA Vault. The definition of an uncommitted debt ceiling is based on a requested DC by the borrower (e.g. asset originator or fund) for MIP6 applications still under due diligence. Discretionary debt ceiling: The amount of debt ceiling (in DAI) that is available to a specific Centrifuge RWA Vault. The discretion of approval is entirely up to the community of MKR tokenholders. Think of this as a risk policy exception to the global debt ceiling cap.  Should a global debt ceiling cap be implemented?  Only applicable to old CFG structures.      Yes No Abstain     0 voters      If a global debt ceiling cap is implemented, what should it be? Select one of the following options.     Current committed DC, no more. (i.e. $64M) Current committed DC + 15M Current committed DC + 40M Current committed DC + 70M Current committed DC + 100M Current committed DC + 130M Current committed DC + 170M Abstain     0 voters      Should discretionary debt ceilings be allowed? Only for CFG counterparties (e.g. AOs) that have A) implemented DAO accepted legal structuring standards* and B) obtained a DAO accepted legal review by an independent 3rd party.     Yes No Abstain     0 voters      *Important note: the definition of an unanimous DAO-wide acceptable structuring standard is not clearly defined. A few attempts at comparing structuring standards are available here and here. More on the topic will come from a trained and experienced legal counsel. Therefore the “discretionary” question above assumes that a consensus of the DAO is reached. And the proper consultation with DAO stakeholders has been done.  The poll will be running until 26 November 2021. Subject to consultation feedback, a more formal signal request will follow. Questions, comments and clarifications are welcomed. @Recognized-Delegates @Real-World-Finance @GovAlpha-Core-Unit @SES-Core-Unit @collateral-core-unit @spin @martin @ctcunning @roollie @rune ",
                    "links": [
                        "https://forum.makerdao.com/t/the-arranger-model-a-highly-scalable-rwa-framework/11298",
                        "https://forum.makerdao.com/t/ses-project-real-world-sandbox/10910",
                        "https://forum.makerdao.com/t/centrifuge-collateral-a-way-forward-with-a-delaware-statutory-trust-and-the-arranger-model/11566",
                        "https://forum.makerdao.com/t/real-world-asset-legal-structures-a-comparison/9877",
                        "https://forum.makerdao.com/t/real-world-asset-legal-structure/9093",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-11-18/11713",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/untangled-finance-collateral-onboarding-risk-evaluation/12006"
                    ],
                    "GPT-summary": "The post is a consultation poll by Centrifuge, a third-party borrower community, seeking feedback from the Maker community and MKR tokenholders on implementing a global debt ceiling cap and discretionary debt ceilings for Centrifuge-related projects. The post explains the current state of committed and uncommitted debt ceilings and provides definitions for terms used in the poll. The post also invites questions, comments, and clarifications from recognized delegates, real-world finance, GovAlpha-Core-Unit, SES-Core-Unit, collateral-core-unit, and other stakeholders.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.345238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zerocool",
                    "index": "#3",
                    "likes": "0",
                    "time": "14/11/2021-22:55:55",
                    "content": "Any reason why we can’t see who the voters are on these polls? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#4",
                    "likes": "1",
                    "time": "15/11/2021-01:01:19",
                    "content": "@zerocool No particular reason. Just realised it’s a default setting which I cannot revert. @prose11 does governance have permissions to activate show voters? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "1",
                    "time": "15/11/2021-02:42:31",
                    "content": "No way to change the settings after it’s started unfortunately. Up to you if wanna restart with different settings. From the governance side there’s no requirement here given it’s an informal poll, but it often is nice to be able to ask people why they supported different options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/11/2021-03:57:53",
                    "content": "To everyone voting. We really encourage those expressing their votes on the global DC cap and discretionary DC to provide background to their reasoning. This is an important pre-SR consultation which could help shape up the near-future relationship between the counter-party (Centrifuge) and the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/justin1066",
                    "index": "#7",
                    "likes": "1",
                    "time": "15/11/2021-13:01:57",
                    "content": "It makes sense to implement a debt ceiling on pools with the current structure. But it does not make sense to me to prevent a discretionary debt ceiling being implemented for pools where Centrifuge and the RWA CU have worked together to implement a superior structure that all parties are happy with.  With a new structure in place, beginning to deploy discretionary capital is the best way to continue learning.  Testing > debating in my mind. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.636363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#8",
                    "likes": "2",
                    "time": "15/11/2021-15:10:36",
                    "content": "Thanks for putting together this poll. I have one question on the poll format, @williamr: Your question on the debt ceiling numbers I think should be interpreted as follows: A vote on +100M should count as  vote for both +40M & +100M. Correct? As for Centrifuge’s position, we’ve described it in a lot more detail in this thread but I want to highlight how I think about the questions above:   Should a global debt ceiling cap be implemented? The legal structure that our first pools went live with was never intended to be scaled indefinitely. There is a roadmap for improvements that we are working on together with members of the DAO. We proposed to limit debt ceiling for the current setup and are in agreement here.  If a global debt ceiling cap is implemented, what should it be? Our post initially proposed the most conservative: not raising any debt ceilings until improvements have been made. We wanted to be conservative but I believe issuers who have been working already for months to get onboarded to Maker would appreciate having some flexibility. If an additional debt ceiling should be allowed it could be used for new collaterals to start onboarding while the DAO organizes its legal review process and deploys the trust setup.  Should discretionary debt ceilings be allowed? We believe that with a new legal setup issuers should be going back to a standard process the DAO uses to allocate debt ceilings. This is currently in shift with the proposal of the arranger model but also other ideas. I don’t know though if at that point we should still call it discretionary? Isn’t it just business as usual at that point?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.521022727272728
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#9",
                    "likes": "0",
                    "time": "15/11/2021-23:35:10",
                    "content": "@spin Great questions. Let me try to clarify them and the intention behind the poll.     spin:  A vote on +100M should count as vote for both +40M & +100M. Correct?   The calculation for DC cap is always current committed + a buffer. So, if a vote is for current +40M it means: 64+40 = 104M. For current + 100M = 64 +100 = 164M and so on. Note that it is a single option voting, so it implies voters are voting for the highest DC cap only. On the questions themselves, they were intentionally drafted with a “transitory” period in mind. i.e. the period between the current legal structuring being in place and one in which Centrifuge and its partners have worked out a legal framework the DAO is ok with (has signed off on). While that period might be relatively fast (say one month), in reality this could take longer. Hence the “discretionary” DC is an optionality for MKR tokenholders should they decide to onboard a new collateral in that interim. For the sake of the example, let’s assume asset originator A is experienced with structuring in tradFi and has got a legal setup that the DAO accepts, subject to legal reviews. And let’s assume that it can be done faster than a common CFG legal framework. At that point, MKR tokenholders could have the optionality but not the obligation of approving a transaction for that specific AO A debt ceiling (i.e. discretion to approve). So all of this consultation is only for this transitory period. Once an “arranger” framework is in place for CFG, a new consultation will be done. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.598780007870917
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#10",
                    "likes": "0",
                    "time": "16/11/2021-13:09:18",
                    "content": "Just to clarify, if you look at the current results:  Screen Shot 2021-11-16 at 11.11.431462×1100 50.4 KB  This actually means:  37% Abstain 27% think that the current DC should be kept (64M) 36% think that the debt ceiling should be >= Current + 40M 15% think that the debt ceiling should be >= Current + 100M 6%  think that the debt ceiling should be >= Current + 170M  Right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.204081632653061
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#11",
                    "likes": "1",
                    "time": "16/11/2021-18:55:01",
                    "content": "Right. That’s what the snapshot is saying. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#12",
                    "likes": "0",
                    "time": "24/11/2021-08:17:38",
                    "content": "Just for note. The poll will be running for a couple of days yet. At this stage, there appears to be willingness for implementing a global DC cap on Centrifuge assets and also to allow a discretion for approval of specific vaults by MKR tokenholders. Feel free to reach out for comments or questions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "22/02/2022-08:18:35",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}