{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-adjust-the-eth-b-auction-parameters-beg-and-chop/6621",
            "title": "[Signal Request] Adjust the ETH-B Auction Parameters ('beg' and 'chop') ",
            "index": 6621,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "auctions",
                "eth-b",
                "sig-status-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#1",
                    "likes": "4",
                    "time": "17/02/2021-17:37:49",
                    "content": "In the latest MakerDAO Risk Team Flip Auctions Report, you may have noticed lower Auction Efficiency for the ETH-B vault. To incentivize Keeper participation we may want to increase the ‘beg’ parameter (auction bid increment in %). A higher ‘beg’ should make Keepers more comfortable bidding earlier, placing less risk for MakerDAO. It should be noted that ETH-A does receive a lot of participation, though there is still benefit to MakerDAO if Keepers are more comfortable placing earlier bids for ETH-B. We may also want to increase the ‘chop’ parameter (penalty fee). Due to ETH-B’s lower Liquidation Ratio, ETH-B vaults have a smaller asset buffer at auction compared to other vaults. This represents a greater risk to the MakerDAO protocol. A higher ‘chop’ will also incentivize vaults to be more cautious to not get liquidated. A side benefit of increasing Keeper participation is that we may be able to increase the ‘Box’ parameter. Cons:  A higher ‘beg’ may result in lower penalty fees collected by MakerDAO Higher ‘chop’ and ‘beg’ may result in less collateral being returned to liquidated vaults   Auction Efficiency may improve to counteract the penalty fee     Vaults are incentivized to not get liquidated       What should the ETH-B ‘gap’ be?  3% - No Change 3.5% 4% 5% Abstain     0 voters        What should the ETH-B ‘chop’ be?  13% - No Change 15% 17% 19% Abstain     0 voters     This Signal Request will run until Thursday, February 25th. Winning votes will proceed to an on-chain governance poll on Monday, March 1st. Please leave any thoughts or comments below! ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-129-thursday-february-18-17-00-utc/6506/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/governance-at-a-glance-feb-12-18-2021/6644",
                        "https://forum.makerdao.com/t/makerdao-flip-auction-stats-ytd-data/6474/3",
                        "https://forum.makerdao.com/t/flip-auctions-parameter-adjustment-proposal/6732"
                    ],
                    "GPT-summary": "The author of the post is explaining a proposal to adjust the ETH-B auction parameters to incentivize Keeper participation and reduce risk to the MakerDAO protocol. The post also includes two polls asking for feedback on the proposed changes. A 3rd party could give constructive criticism of the proposal, ask questions about the proposal, or audit and review the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.974206349206349
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "5",
                    "time": "17/02/2021-17:42:07",
                    "content": "We need to be a little bit careful about changing the rules on existing vaults with regards to stuff like the liquidation penalty. If it’s not super obvious that we’ve done so, this could cause a nasty surprise for vault users. And cause them to blame Maker for changing an important parameter without informing them. Stuff like the stability fee is expected to move. The penalty not so much. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.403645833333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/02/2021-17:53:18",
                    "content": "@LongForWisdom The counterargument is that the ETH-B vault liquidations has a substantially increased risk of loss for MakerDAO compared to other vaults. Though you make a very good point for why we may want to stay with the status quo. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.9625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "3",
                    "time": "17/02/2021-17:56:12",
                    "content": "    Jiecut:  The counterargument is that the ETH-B vault liquidations has a substantially increased risk of loss for MakerDAO compared to other vaults.   Yep, I don’t disagree. I’m just a little wary of a self-inflicted black-thursday-like event. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.645833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#5",
                    "likes": "2",
                    "time": "17/02/2021-18:02:43",
                    "content": "It’s hard to keep everyone informed of changes when there is no centralized channel of communication and no way of “pushing” notifications. It kind of sets up personal responsibility for users of these protocols to stay informed/educated on what they’re using. Hopefully we can continue to develop better UI/UX so that these “customers” can stay informed easier/faster. Having a CDP app that pushes this kind of news to users would be ideal but of course there will always be some who fall through the cracks and I don’t think we should have to take responsibility for that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.923611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#6",
                    "likes": "0",
                    "time": "17/02/2021-18:11:05",
                    "content": "    Jiecut:  A higher ‘beg’ may result in lower penalty fees collected by MakerDAO   really? isn’t this just affecting the collateral left after auction so it just hurts the vault owner? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#7",
                    "likes": "0",
                    "time": "17/02/2021-18:31:21",
                    "content": "Is there a reason you’ve left the stability fee out of the poll? I would consider that to be a third parameter which affects the overall safety of the Vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#8",
                    "likes": "1",
                    "time": "17/02/2021-20:57:39",
                    "content": "Is there any methodology to say that adjusting those parameters will increase auction efficiency and by how much or are we just hoping that it will. I don’t feel qualified to choose a number on this poll not knowing that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "3",
                    "time": "17/02/2021-21:19:28",
                    "content": "    Jiecut:  @LongForWisdom The counterargument is that the ETH-B vault liquidations has a substantially increased risk of loss for MakerDAO compared to other vaults.   Increased risk.  Based on what?     g_dip:  Is there a reason you’ve left the stability fee out of the poll? I would consider that to be a third parameter which affects the overall safety of the Vaults.   Agree @g_dip. Stability fee, low Surplus, lack of a Reserve. I am back to a tiered vault approach in terms of risk management.  We just keep jacking up the DCs vs creating new vaults with different LR, SF and looking at risk and complaining.  If you want to change the liquidation fee - do it on a new vault and then just reduce the DC on the old one.  Why not poll vault holders on what they think about this?   I keep coming back to wanting to poll vault owners generally…   I mean has Maker ever gotten feed back directly from vault owners other than when things fail or to get some info on how to improve the Maker experience?     ultraschuppi:  really? isn’t this just affecting the collateral left after auction so it just hurts the vault owner?   The above statement is generally true.  in fact having a variable ‘beg’ was one of the many tools I have discussed in previous posts to help manage liquidation loads.  The idea here was when the system is getting hammered consider reducing the ‘beg’ to alter the LR profile to try to reduce the number of vaults that would come under the liquidation gun.   A significant alteration to the ‘system’ to be sure but conceptually one of many ways to deal with risk. I consider the primary way to reduce risk to be raising a reserve, surplus and then figuring out mechanisms to help vaults NOT get liquidated.   Either some additional fee for liquidation insurance or a DSR backing reserve to help buffer auctions.  Or as I suggested in the past a DAI-Rebate token dripped out for maintaining a high CR.   The concept here on a DSR-L was that when OSM-auction prices are disjointed you want a fund to step in to take a percentage of the collateral being offered at auction (at the auction price) in exchange for some extra return taking on the risk.    The point here is when auctions are fetching 80% or lower than the OSM to simply have this fund take on 20% of the liquidity at the auction prices.  50ETH out at $100 when the price is at $120 - the DSR-L takes the next 10ETH  at $100 etc.   If this gets worse and we are clearing 50ETH at $50 and the OSM is at $100 it takes 50ETH at 50 for each 50ETH sold etc. There are lots of ways to reduce the risk profile here - hurting your vault owners by upping liquidation fees may be great for Maker but it sucks for vault owners. Figuring out how to improve keeper liquidity or liquidation liquidity and maybe offering other vaults with Higher LRs with lower SF and lower liquidation fees and or dripping rebates for vaults maintaining a higher CR perhaps would yield better solutions and approaches to risk management than the above. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.378661616161616
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#10",
                    "likes": "0",
                    "time": "17/02/2021-21:47:19",
                    "content": "I had another thought regarding ‘risk’ in the Maker system. The risk of liquidations being tied to a single network (main net).   I will hazard an idea (which are plentiful) that might be rewarding in this respect.   Why not consider opening up the auction process to bidders with DAI on other L2s?    We already know mempool front running is a ‘thing’ with some miners even offering services to help front runners.   What if main net becomes so expensive and clogged during a liquidation event the only place to source liquidity reliably IS one or more L2s? The idea here would be to duplicate the liquidation system so that offers backed by deposited DAI could exist on multiple L2s and the ‘system’ properly constructed looks at these offers before closing the deal and locking the gem for the bidder?    If you want to talk about risk to this system I see one of the biggest risks being that the main net simply won’t provide access to anyone but a privileged entity that has already backend gamed the situation to determine where the flaws in the system are and end up being uniquely positioned to take advantage based on network limitations. I know we are still in the throws of a liquidation upgrade but if you want more bidders why not offer up liquidations on multiple networks - particularly ones where fees to bid are low. Probably something to put in the Liquidation and systemic risk research hopper but if we have main net fees at 100-300gwei now - tell me where you think this lands when we have a price catastrophe like Black Thursday and how anyone is going to be bidding on anything with 2000-30000gwei network access gas. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.409047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#11",
                    "likes": "3",
                    "time": "23/02/2021-23:05:43",
                    "content": "Bump, polls close in 2 days. Sorry for not being more active in this thread. Lots of good points on why ‘chop’ shouldn’t be raised. Less discussion on ‘beg’. At first glance, raising ‘beg’ may look like a higher fee which is worse for vault holders. But, a higher ‘beg’ can result in better auction efficiency. With the high gas prices, Keepers may be unwilling to start a bidding war when they can be easily outbid, so they don’t try. And if Keepers end up placing bids earlier with a higher beg, due to volatility, vault holders may end up getting better execution at auction end. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.771354166666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#12",
                    "likes": "3",
                    "time": "25/02/2021-23:02:53",
                    "content": "13% - No Change was the winning vote for the ETH-B ‘chop’. An ETH-B ‘beg’ of 3% - No Change and 4% both won with >50% of the vote. Generally that’d mean a binary poll for 4% would be placed on-chain on Monday. But because of recommendation by the Mandated Risk Team, a poll for a ‘beg’ of 5% for the ETH-B vault will be place on-chain on Monday. They have good reasoning and hopefully the community will support this proposal on-chain.     FLIP Auctions - Parameter Adjustment Proposal Governance       Hey all,  After liquidating close to 10m debt this Tuesday we got new insight of how robust current Liquidation system 1.2 is and we decided to propose adjusting few parameters. First, let’s take a look at data covering auctions this Tuesday, 23th February.   [Screenshot 2021-02-25 at 09.31.06]  [Screenshot 2021-02-25 at 16.44.05]  Main takeaways  9.9m debt auctioned and 259 auction events in about 9 hours 1.223m penalty fee collected of total 1.285m (62k missing) no loss generating auction for …     ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1DfIrn55YjS_chpnmcMoZ6yhzbznwGquu6A0qrynNHFM/edit#gid=1527238063"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.495695592286501
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "28/03/2021-09:03:07",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}