{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-governance-overhead/1129",
            "title": "Maker governance overhead ",
            "index": 1129,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "13",
                    "time": "16/01/2020-11:35:52",
                    "content": "I will start this article by saying I have changed my mind with regards to Maker governance. I used to be satisfied to contribute, seeing my vote mattered and doing highly interesting work. The work is fantastic, but there is a lot of it and the workload is only going to increase.  mkr governance time1280×720 26 KB  The above chart shows the time spent on participating in Maker governance and the overall community. You could of course argue the hours spent endlessly, that is why the chart is not highly detailed. What the chart does point out is that the community activities are increasing in number and each activity is increasing both in duration and complexity. Social media: Maker chat, reddit, forum, twitter, youtube etc etc. This has increased but the increase in quantity is offset by the lack of necessity to follow all of it. Weekly meetings: these meetings used to be held on Sundays and detailed what the dev team had done during the week. The usual duration of these meetings would be in range of 10-30 minutes, with some outliers. Governance and risk: these meetings started out at about 1 hour but lately and despite efforts they started pushing 90 minutes in late 2019. Community call: these calls have consistently been somewhat shorter than 60 minutes. The problem is that there are more and more topics to talk about as the DeFi boom continues. Onchain voting: in the beginning these were quick and easy votes dealing with the stability fee. Now there are both more votes and more complex issues upcoming like SAI shutdown, decision bundling and DSR spreads. This trend is only likely to continue unless steps are taken. Collateral onboarding: already there are multiple applications waiting for community review. Although the onboarding process is still a work in progress, as long as the process involves multiple rounds of discussion and community voting it is going to be time consuming. Crypto collateral is hard enough, but Vault material could easily extend to top stocks and bonds, as well as major raw materials. And that is not even considering already received proposals for life insurance Vaults, athlete funding and non-fungible assets of which there could be a huge range of. This type of work can’t be done by just opinionating. Synthetic assets: while still on the drawing board, synthetic assets could bring with it a complete set of governance issues in addition to DAI. Keep in mind the workload for DAI and then multiply this across two handfuls of major currencies. The resource requirements could be nearly limitless at this point and what is shown on the chart could just be the tip of the iceberg. At this point I could produce another wall of text but I won’t. I would just like to get your input. Our community is exceptionally resourceful and there are multiple steps that can be taken to change the direction we are headed, but for now just tell me if you feel I am right or wrong about this - ok? ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-sourcecred-trial/2551",
                        "https://forum.makerdao.com/t/sourcecred-trial-final-report/4569",
                        "https://forum.makerdao.com/t/informal-poll-increasing-the-sourcecred-payments/7489/55",
                        "https://forum.makerdao.com/t/planet-x-delegate-platform/9422",
                        "https://forum.makerdao.com/t/governance-the-mkr-lifestyle/5165/16",
                        "https://forum.makerdao.com/t/makerdao-governance-audit-report/2995",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-january-23-9am-pst-5-00-pm-utc/1165/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-january-16-9am-pst-5-00-pm-utc/1126/2",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-june-21st-2021/8958/10"
                    ],
                    "GPT-summary": "The author of the post discusses the increasing workload and complexity of participating in Maker governance. They provide a chart showing the time spent on various community activities and express concern about the potential resource requirements for future governance issues. The author asks for feedback on their observations and suggests that changes may need to be made to address the issue.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.5848422410922405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "3",
                    "time": "16/01/2020-14:21:05",
                    "content": "I think given the activities you have listed you are probably correct. Given that I have done a fair amount of work donating my time I take a reverse approach.   I define how much time I can give to an organization (as well as what I consider strong skill assets) and do two things.   Limit the time per week to a general maximum (this may fluctuate, but if I do more during an event then I take time off from the organization to balance my average donated time/week).   Time management is extermely critical because organizations will almost ALWAYS take more of what a person offers freely and they will tend to do it under guises of ‘emergencies, we need you, you are the only one who CAN do this, etc.’    Remember you are the one in control of how much time you give the above activities.   The activities should NOT take time from you.   Focus your time only on the things you are really good at that you can do quickly.   I am a terrible copy editor, but a great analysis, idea, and process optimization guy.   Honestly when it comes to charitable work I really try to focus on what I like to do, and can do well.  Anything that becomes a grind I just set it aside or hand off.   Then I just roughly keep track of hours and make sure to limit them.   No-one is paying you, you don’t have to give. Something that hit me recently is an idea that every day instead of waking up and thinking who is going to take what today (or who needs what), I turn it around and honestly ask myself what I am capable of giving.   Sometimes all I have is to give a better tone, perhaps a smile.   Other days a little more.  Realize if you have nothing to give that may be a time to ask someone if they can help you with what you need. If your time is becoming excessive with Maker - well limit stuff.   I do nothing in social media for Maker except answer a few questions.   Gov and Risk I tend to think about that because of my own analysis - my goal is to hit some of these things with some straightfoward analysis and try to be done with them.  Community call - those just go on - if I can make it I will - if not will catch up later.    I think some of those could be shorter (or some of these calls could happen with a bit more focus - but that is another debate).   Collateral onboarding - somehow need to streamline this process but I am not familar with the process at all so just speaking off top of my head.   Honestly the work to onboard a potential $10M collateral process - seems like a waste.    We need to identify the BIGGEST (> $1B) and BEST (easiest to implement) collateral to onboard and focus on 1 or 2 of these.   Frankly I am not seeing it and everything people are talking about (bonds, insurance) seems too complex and problematic I want to set this aside and focus on growing the markets we already have and optimizing the processes while we sort through what we would like to onboard next. As to synthetic assets that is a whole other topic I am leaving alone until someone puts together some kind of proposal with a report.   I have no interest in taking on that topic as a ‘first investigator’ as I simply don’t have the time or inclination at this point.   Too many other things to focus on at this point (low hanging fruit) that already exists. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.059232026143791
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "4",
                    "time": "16/01/2020-18:12:38",
                    "content": "Another thought did come to me regarding your post Planet_X. Perhaps an idea we can discuss could be to think about how to reduce time spent on things by people. The first thing that came to mind is why can’t we have various standard reports we have in the CC just be posted somewhere.    Like the ‘State of the PEG’.  We could just have a master forum thread “State of the PEG” that has the weekly reports by vishesh posted and people can just forum poll there if anything needs to be done or not and then move some changes into the governance polling.   Only if there is a problem or something needs to be done quickly and face to face should something about the PEG be in the CC.   This way everyone doesn’t have to sit through the report and can just read it - at their leisure in the forums. This is just one example that came to mind that would save about 15minutes * number of people of time in the CC and asynchronize some of these Maker Community Management functions. I’m sure other people will have ideas for how we can improve Maker community collective productivity (less time same or more output). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "2",
                    "time": "16/01/2020-18:15:52",
                    "content": "    MakerMan:  The first thing that came to mind is why can’t we have various standard reports we have in the CC just be posted somewhere. Like the ‘State of the PEG’. We could just have a master forum thread “State of the PEG” that has the weekly reports by vishesh posted and people can just forum poll there if anything needs to be done or not and then move some changes into the governance polling.   I would love this to be a thing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#5",
                    "likes": "0",
                    "time": "16/01/2020-19:53:23",
                    "content": "Need a Maker Newsletter tbh. I nominate @Davidutro  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#6",
                    "likes": "2",
                    "time": "16/01/2020-20:10:30",
                    "content": "As much as I would actually love to help produce that, I have 0 bandwidth. Perhaps the newsletter could be community produced. I’m sure some sort of bounty or recurring grant could be set up for this. I think the original problem was nobody being comfortable collecting emails. So there was talk about solutions, but it fizzled out. I would produce it as a side-project if I had time, it sounds like a lot of fun and a good exercise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.124999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "1",
                    "time": "16/01/2020-20:17:07",
                    "content": "I was more joking but thought of you since you do such a great job with the meeting summaries and community meeting videos. I imagine you are extremely busy as is. Thanks for the response regardless! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.65
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#8",
                    "likes": "0",
                    "time": "18/01/2020-18:02:47",
                    "content": "I will assume a lot of you worked for a corporation or within a bigger team. Sooner or later you realize you cannot control all aspects of the project and have to accept it. The only way this can work long term is to NOT aim for efficiency/flexibility (unlike companies), but strict separation of domains. Different teams should communicate very rarely and within defined strict protocols (analogous to software) On the other hand, we need to be efficient in the beginning while we are still bootstraping the system (that’s why we need Foundation). I doubt humans are capable of such things and likely this will fail long term. Still, it’s an interesting/worthy experiment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.94375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#9",
                    "likes": "0",
                    "time": "23/06/2020-21:06:56",
                    "content": "Hi @Planet_X In your visual presentation, you forgot to include a time consuming operation, Data analysis and classification of that data in parallel with Social Media integration, witch should be an integral and in relation with the process. Otherwise Social Media, is not used for his potential but only as a promotion effect. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.055555555555555
                }
            ]
        }
    ]
}