{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - GNO (Gnosis) - June 21, 2021",
            "index": "8484",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "35,739",
            "highest_fraction": 0.96
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/gno-collateral-onboarding-application/8484",
            "title": "[GNO] Collateral Onboarding Application ",
            "index": 8484,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "mips",
                "gnosis"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/StefanGeorge",
                    "index": "#1",
                    "likes": "11",
                    "time": "01/06/2021-17:26:13",
                    "content": "On behalf of the Gnosis community, I am submitting the proposal to add GNO as MCD collateral. [GNO] Collateral Onboarding Application 1. Who is the interested party for this collateral application? Gnosis 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token. GNO is the governance token of GnosisDAO, which was launched November 23rd 2020. The GnosisDAO is giving GNO holders direct stake in Gnosis’ strategic decision making and fund management. Via token-weighted voting, GNO holders may participate in core roadmap decisions of Gnosis’ core product lines. Funding of projects and other initiatives are made available only for proposals approved by a majority of GNO token holders. GnosisDAO is guiding development over Gnosis’ core products, including:   The Gnosis Safe Multisig: a platform for digital asset management used by MakerDAO, Ethfinex, Synthetix, Uniswap and many more. Currently holding 1.6% of the total ETH supply and over $32B in total value, Gnosis Safe is a leading smart contract account solution for the Ethereum ecosystem. Dune Analytics Dashboard for Gnosis Safe   The Gnosis Protocol: a meta DEX-Aggregator which facilitates gasless order placement and the ability to match retail traders with each other, hence offering better prices than pure dex-aggregators whilst protecting users against MEV. The first customer facing interface is CowSwap.   The Gnosis Auction: Gnosis Auction is a platform for conducting fair, transparent, and decentralized token price discovery. Batch auctions set the price exactly where supply and demand meet. This ensures the same fair price for all participants.   OpenEthereum: the former Parity Ethereum client, since May 2020 maintained by Gnosis. OpenEthereum provides the core infrastructure essential for speedy and reliable services for miners, service providers, and exchanges that need efficient synchronisation and maximum uptime.   The GnosisDAO treasury consists of 8M GNO Tokens that are being sent via a vesting contract over 8 years, as well as 150k ETH. 3. Provide a brief history of the project. Gnosis was founded in 2015 by Stefan George and Martin Köppelmann as part of ConsenSys. In April 2017, Gnosis raised funds and spun out of ConsenSys to become an independent company. Gnosis has since built and supported a variety of products contributing to the Ethereum infrastructure. Please find a timeline of the major milestones of Gnosis’ core products here:   2015: Development begins on Gnosis’ prediction markets platform, which later became the Conditional Tokens Framework. A first iteration launched on Ethereum mainchain one week after Ethereum’s launch.   Feb. 2017: Launch of Gnosis Multi-signature Wallet, which was quickly trusted by projects such as Golem and Aragon to securely manage their ICO treasuries.   May 2019: Gnosis “awakens” community-governed organization DXdao, which has since separated into a distinct entity that maintains a close collaboration developing interfaces for our underlying open-source protocols, such as Omen and Mesa.   December 2019: launch of the Gnosis Safe, the successor of the Gnosis Multisig. It is now storing more than 15 billion USD, including more than 2% of the total ETH supply.   July 2020: 5 years of building on prediction markets culminates in the release of Omen, DXdao’s decentralized prediction market platform powered by Gnosis’ Conditional Tokens Framework.   April 2020: Gnosis’ DEX Gnosis Protocol v1 launches. It has hosted many IDOs for projects including mStable, API3 and many more. Gnosis is currently working on an advanced IDO protocol that will offer more functionalities and flexibility. Additionally, Gnosis is currently working on Gnosis Protocol V2, a Meta Dex Aggregator which matches the orders of retail traders with each other and channels those orders that can’t be directly matched to underlying on-chain AMMs for execution (more details here).   May 2020: OpenEthereum (formerly Parity Ethereum) begins a new phase of stewardship by Gnosis, with support from the Ethereum Foundation   November 2020: Gnosis decentralizes governance and decision-making to GnosisDAO, a prediction market-driven collective.   April 2021: Gnosis Protocol v2 launches. The first live UI is CowSwap, the next one will be the Balancer swap interface, which is integrating Gnosis Protocol v2 to offer their users better prices and more security. Within the first week of being live, CowSwap already ranked 7th in number of distinct traders across all Ethereum DEXes.   Gnosis’ core mission is to help Ethereum strive, and is thus also engaging in a few community initiatives, such as running Open Ethereum (the former Parity Client), FullNode (one of Europe’s largest Ethereum development hubs), organizing DappCon (one of Ethereum’s core community conferences) and has its own Ecosystem Fund, GECO, with the aim of funding early stage Ethereum projects. Gnosis is also very committed in supporting the MakerDAO ecosystem, mainly: Since November 2019, Gnosis provides core infrastructure for the stability of Maker/DAI by running a light MakerDAO oracle. When the MakerDAO system was at risk in March 2020 (Black Thursday event), Gnosis opened a new CDP with 30k ETH, selling the 600k created DAI to increase the supply of DAI to support its peg:  ETH deposit transaction  Minting of DAI transaction  Depositing DAI into GPv1 DEX transaction   4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Gnosis Github GNO token contract (Github) Gnosis Blog (hosted on Medium) Website  5. Link any available audits of the project. Both procedural and smart contract focused audits.  Gnosis Safe: Both formal verification as well as multiple security audits have been conducted on the Gnosis Safe Contracts (Link). Gnosis Protocol: Audit Report. Prediction Markets: Prediction Markets V1 contracts (link), Conditional Tokens contracts (link).  6. Link to any active communities relating to your project.  Gnosis Forum Gnosis Discord Gnosis Twitter Gnosis Safe Twitter CowSwap Twitter   7. How is the applying collateral type currently used? GNO is the governance token of GnosisDAO, giving GNO holders direct stake in Gnosis’ strategic decision making and fund management. Currently, GNO holders are able to use their GNO to signal their preference in proposals Gnosis should undertake which may maximize GNO value via the Gnosis Forum and Snapshot. Via token-weighted voting, GNO holders may participate in core roadmap decisions of Gnosis’ core product lines. Funding of projects and other initiatives are made available only for proposals approved by a majority of GNO token holders. The GnosisDAO treasury consists of 150k ETH, and 8M GNO Tokens that are locked in a vesting contract and released linearly over 8 years. The linear vesting schedule ensures that GNO becomes accessible to the GnosisDAO gradually and does not allow for any abrupt changes to the token supply and its value. Funds obtained in the GnosisDAO treasury can only be touched via a three-phase governance process that requires public forum discussions and a snapshot quorum threshold of 4% of the circulating GNO supply. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? GNO was issued in an ICO in 2017 by Gnosis Limited. Gnosis Limited is incorporated in Gibraltar. 9. Where does exchange for the asset occur? GNO can be bought and exchanged on centralized exchanges such as Kraken, Bittrex and Bitfinex, as well as on a variety of decentralized exchanges such as Uniswap, Balancer, SushiSwap and more. Find a list of trading pairs on centralized and decentralized exchanges here. 10. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. N/A 11. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. No, there have been no regulatory registrations for the GNO. 12. (Optional) List any possible oracle data sources for the proposed Collateral type.  Kraken Uniswap V2 Balancer ChainLink  13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type.  Prycto Market Maker   ",
                    "links": [
                        "https://gnosis-safe.io/",
                        "https://www.duneanalytics.com/tschubotz/gnosis-safe_2",
                        "https://github.com/gnosis/gp-v2-contracts",
                        "https://cowswap.exchange/",
                        "https://gnosis-auction.eth.link/#/",
                        "https://github.com/openethereum",
                        "https://etherscan.io/address/0xec83f750adfe0e52a8b0dba6eeb6be5ba0bee535",
                        "https://blog.gnosis.pm/the-dxdao-has-awoken-78cb2e39661c",
                        "https://dxdao.eth.link/",
                        "http://omen.eth.link/",
                        "https://mesa.eth.link/",
                        "https://blog.gnosis.pm/omen-and-the-next-generation-of-prediction-markets-2e7a2dd604e#:~:text=Introducing%20Omen,on%20questions%20of%20their%20choice.",
                        "https://forum.gnosis.io/t/should-gnosis-build-gnosis-protocol-v2/741",
                        "https://medium.com/openethereum/whats-ahead-for-the-openethereum-client-43da126921c2",
                        "https://blog.gnosis.pm/announcing-gnosisdao-a7102fcf9224",
                        "https://cowswap.exchange/#/swap",
                        "https://medium.com/balancer-protocol/the-crypto-cinematic-universe-crossover-event-of-the-summer-balancer-gnosis-protocol-bgp-638568aa0385",
                        "https://www.fullnode.berlin/",
                        "https://dappcon.io/",
                        "https://blog.gnosis.pm/unveiling-the-gnosis-ecosystem-fund-7353926bfb65",
                        "https://etherscan.io/tx/0x25610a20c8271125ad24813fe41e8970de8f3b5ca510979c23dc7e3860865769",
                        "https://etherscan.io/tx/0x9711deed9a6451904f13cc7825510685b57c7d7f1ccb8f355c42f8030a19fd32",
                        "https://etherscan.io/tx/0xa7ec412764e257345c41bf600201d87e631871ae142acbc7aa2f213a54b18d80",
                        "https://github.com/gnosis",
                        "https://github.com/gnosis/gno-token",
                        "https://blog.gnosis.pm/",
                        "https://gnosis.io/",
                        "https://github.com/gnosis/safe-contracts#audits-formal-verification",
                        "https://github.com/gnosis/gp-v2-contracts/blob/main/audits/GnosisProtocolV2May2021.pdf",
                        "https://github.com/gnosis/pm-contracts#audits",
                        "https://github.com/gnosis/conditional-tokens-contracts/tree/master/docs/audit",
                        "https://forum.gnosis.io/",
                        "https://chat.gnosis.io/",
                        "https://twitter.com/gnosisPM",
                        "https://twitter.com/gnosisSafe",
                        "https://twitter.com/MEVprotection",
                        "https://forum.gnosis.io/c/dao/20",
                        "https://snapshot.page/#/gnosis",
                        "https://etherscan.io/address/0xec83f750adfe0e52a8b0dba6eeb6be5ba0bee535",
                        "https://etherscan.io/token/0x6810e776880c02933d47db1b9fc05908e5386b96#tokenExchange",
                        "https://www.kraken.com/features/api",
                        "https://uniswap.org/docs/v2/core-concepts/oracles/",
                        "https://prycto.com/market-making/",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-32-gnosis-wednesday-june-16-17-00-utc/8778",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-50-en-espanol/8966",
                        "https://forum.makerdao.com/t/maker-relay-ep-51/9011",
                        "https://forum.makerdao.com/t/maker-relay-ep-51-en-espanol/9063",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-144-thursday-june-3-17-00-utc/8459/2",
                        "https://forum.makerdao.com/t/stake-mip6-collateral-onboarding-application/5551/8",
                        "https://forum.makerdao.com/t/gno-collateral-onboarding-risk-evaluation/18820",
                        "https://forum.makerdao.com/t/bff-partnership-with-gnosisdao/15969/18",
                        "https://forum.makerdao.com/t/maker-relay-episode-50/8897"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Token economics",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.943771440823328
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/06/2021-18:49:42",
                    "content": "I like the Gnosis project and hopefully GNO gets onboarded as collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#3",
                    "likes": "1",
                    "time": "01/06/2021-22:25:09",
                    "content": "My first thoughts is re the cost to maintain oracles for this. Right now there are active discussions about unapproving defi tokens for that reason. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.670634920634921
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#4",
                    "likes": "7",
                    "time": "02/06/2021-01:08:32",
                    "content": "I disagree on the discussions about considering oracle costs and off-boarding some tokens, especially in an environment where the number of quality tokens is very low. Tokens are not our customer, it is users who hold a diverse portfolio of crypto assets. We should look at some tokens as loss leaders to simply get those users to see us as a one-stop shop for all their borrowing needs. Specific to GNO on-boarding, I want to highlight that GnosisDAO has been one of our biggest supporters for years and I think it is time for MakerDAO to reciprocate. One more anecdote I can remember is that Gnosis was one of the first big projects to open a large CDP to signal their vote of confidence in Single-Collateral Dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "3",
                    "time": "02/06/2021-01:40:31",
                    "content": "    vamsi:  We should look at some tokens as loss leaders to simply get those users to see us as a one-stop shop for all their borrowing needs   So I haven’t done a deep dive yet, but when I looked at ZRX back when it was liquidated over the course of many hours, it looked like very few users (I think 2, but don’t quote me) had opened a ZRX vault first. Most of the vault classes being considered for offloading have <25 users. That, of course, does not imply we need to limit experimentation with new collateral. So I would view the discussion about offboarding as independent of onboarding unless someone here has a crystal ball to say which will be profitable. Hope that allays some of your worries! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625757575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/igorbarinov",
                    "index": "#6",
                    "likes": "6",
                    "time": "02/06/2021-08:18:55",
                    "content": "Gnosis are true leaders in the blockchain space, and they have supported Ethereum from its early days. They are bringing constant innovations, Gnosis Safe and their other products are widely used among the whole crypto sphere. We at xDai have been collaborating with Gnosis for a few yeas, and we fully support their proposal to add GNO as collateral on the Maker platform. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.453125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "1",
                    "time": "02/06/2021-11:09:31",
                    "content": "    StefanGeorge:  The GnosisDAO treasury consists of 150k ETH, and 8M GNO Tokens   Does this mean GNO would itself utilize this type of vault, if approved? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "4",
                    "time": "02/06/2021-14:40:31",
                    "content": "    StefanGeorge:  The first live UI is CowSwap   Super cool–I really like the concept behind CowSwap–I hope y’all have some serious success with such. And like @PaperImperium mention above, it would be super cool to know if you folks will open vaults and mint some DAI–use it for something like a  GNO/DAI pair on Balancer and CowSwap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.487373737373737
                },
                {
                    "author_link": "https://forum.makerdao.com/u/StefanGeorge",
                    "index": "#9",
                    "likes": "2",
                    "time": "02/06/2021-16:11:48",
                    "content": "This is a decision GnosisDAO members will have to vote on but I see it as very likely that GnosisDAO is going to use some of its ETH in a MakerDAO CDP to participate in yield farming activities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/StefanGeorge",
                    "index": "#10",
                    "likes": "2",
                    "time": "02/06/2021-16:13:08",
                    "content": "Thank you  I like the idea of creating a DAI/GNO pair on Balancer! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#11",
                    "likes": "3",
                    "time": "03/06/2021-04:34:36",
                    "content": "Considering GNO is smaller cap and also iliquid than other pairs, maybe GnosisDAO members can vote beforehand to see if it’s approved, they are going to use the vault? If they vote for it, might help with the application. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "3",
                    "time": "03/06/2021-10:42:44",
                    "content": "I didn’t mean to imply it’s a positive/negative or a requirement. Just that it would be helpful to know if 1) there’s already a minimum demand for this vault, but that’s counterbalanced by 2) the folks who can mint the token using it as collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/koeppelmann",
                    "index": "#13",
                    "likes": "5",
                    "time": "24/03/2022-18:56:03",
                    "content": "Hey everyone - trying to reactive this discussion. A few points: a) DAI (or xDAI) is the native token on Gnosis Chain. So growth of Gnosis Chain will necessarily lead to more demand for DAI b) GnosisDAO is already on of the biggest vault holders (with ETH and stETH: https://twitter.com/koeppelmann/status/1507026244621283333) I can certainly assure you that there is demand (given a reasonably low stability fee) from GnosisDAO and other GNO whales to take out $50m+ DAI loans on GNO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.324404761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#14",
                    "likes": "1",
                    "time": "24/03/2022-19:10:26",
                    "content": "after gas costs, I think it is essential to push the use of xDAI, it is literally DAI without the need for an extra token like ETH, Matic, Avax or whatever. A relationship as strong as Polygon with maker and now this Gnosis Chain with Maker would be great, I also propose to add other EVM. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.108333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#15",
                    "likes": "0",
                    "time": "25/03/2022-14:08:29",
                    "content": "I support this, truly as a user of the network, I love it and I love that the GNO community is very active with the stake and other products. All are advantages when talking about xDAI  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.877083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tw_tter",
                    "index": "#16",
                    "likes": "3",
                    "time": "18/05/2022-09:46:41",
                    "content": "Hey! Just an update on question 7 that Stefan answered above: Gnosis DAO has recently voted to reduce the total supply of GNO from 10m to 3m. The large unreleased supply of eth has made people in the past uneasy, despite the fact that it was in the DAOs treasury and hence governed by existing GNO holders. Furthermore, Uniswap V3 will be deployed on Gnosis chain, additionally strengthening ties between the two projects. WDYT, can we reactivate the discussion? ",
                    "links": [
                        "https://www.tally.xyz/governance/eip155:1:0x408ED6354d4973f66138C91495F2f2FCbd8724C3/proposal/20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.964285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#17",
                    "likes": "5",
                    "time": "18/05/2022-15:32:00",
                    "content": "Hey @tw_tter ! CES has started posting updates on the Collateral Status Index (CSI). You can see the latest update here:    Collateral Status Index (CSI) Update 2022-05-12 Collateral Onboarding       Hi everyone,  Here is the latest edition of the CSI.  For your reference, the update is divided up into four sections based on the Collateral Onboarding (COB) process:    Collateral Application Status - Lists all collateral application statuses before prioritization as well as any statuses that remove the collateral from the process.  Prioritized Collateral - The “Up Next” status on the new CSI.  Collateral Work In Progress (WIP) - All collateral in the Assessment through Executive Vote executio…      GNO is currently in the “Next up” status, meaning that there’s already some preliminary work on GNO going on from the Growth Core Unit as indicated by the status. You can see the full CSI spreadsheet here: Collateral Status Index - Google Sheets ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.061688311688311
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tw_tter",
                    "index": "#18",
                    "likes": "0",
                    "time": "18/05/2022-15:59:49",
                    "content": "Thank you! What a well structured post with a very comprehensive list. If there is any way we can assist the GRO team let us know, we’re around . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#19",
                    "likes": "3",
                    "time": "18/05/2022-18:01:00",
                    "content": "Because I hold GNO and have been on the xDAI now Gnosis chain ecosystem AND have already posted my comments on this subject in multiple places. A prefix to the questions are links to my posts in both communities on a subject that I don’t believe has received serious consideration. My post to Gnosis regarding what GnosisDAI should do instead of burning 68% of the 10M GNO.    Gnosis – 8 Feb 22    Should we burn 68% of the total GNO Supply? I see the vast majority is in support of this.  I am going to make a point and leave this here about why Gnosis should NOT consider burning the GNO and do something different.  Currently Gnosis focuses liquidity on the GNO:ETH pair to provide trading...      I have repeatedly urged MakerDAO to encourage communities to create DeepLiquidity via building Uniswap v2 Token-DAI liquidity. Decreasing Liquidation Ratios - Proposal - #8 by MakerMan and [Signal Request] Nexo Institutional Vault - #7 by MakerMan All you have to do is search for term “DeepLiquidity” and/or DAOnetworks in these forums to see my ideas. Which leads me to my questions of GnosisDAO and team:  GNO price is down and the DAO holds most of the GNO.    Is the plan to burn 68% of the available GNO which will decrease the GNO Marketcap from currently 2.2B to approximately 600M?   Question is basically where is the GNO going to come from to fund a vault? Given Maker oracles are costing at least 500K/yr/vault oracle can Gnosis commit to either some level of use (and interest) and/or covering Maker oracle cost losses if Maker provides such a vault.  Maker needs a commitment at some minimum level to cover oracle costs. Is there ANY interest by Gnosis to start moving away from GNO/ETH pairings for trading to GNO/DAI and/or build vs GNO/DAI LP (which could also have a vault btw) so that GNO price starts to decouple from ETH and the ETH can be freed up to be paired with staked ETH etc. Since Gnosis Chain uses DAI (or xDAI) as the gas token and DAI is the preferred stablecoin there is there an idea for GnosisDAO to use their vault to back DAI (for borrowing etc.) on Gnosis Chain and therefore improving dramatically DAI liquidity on xDAI? If (4) is not in the cards here what exactly does GnosisDAO expect to use the borrowed DAI for.   I think my point here is that before opening a vault I’d like to know it (1) would be used and (2) curious what it will be used for. While Gnosis has a significant treasury is karpatkey and the DAO prepared should there be a general crash in the markets.  Example if ETH decouples from stETH and GNO all trade 50% lower than current - Will GnosisDAO be prepared with DAI liquidity to manage/close positions?  Thank you in advance for answers to the above questions. Note to the Maker community being also a pretty active member on various DAOs on Gnosis Chain.   I have long advocated a number of community partnerships both with token exchanges and building Token-DAI v2 type liquidity (see DAOnetworks above).  Gnosis Chain having DAI (as xDAI) as the gas token on the native chain I always thought was one community as a natural partnership target for Maker.   So I have been generally supportive of a greater partnership.  I see this proposal as a first step but I also see this specific proposal as one of many MIP6s where a community just wants to be able to borrow against their community token.   Important but this basically ignores a key factor which to me is building Token-DAI v2 liquidity for all these communities as per my DeepLiquidity Thesis.   Gnosis having over what 8M GNO with approximately 2M GNO has a perfect opportunity to build a very deep GNO-DAI liquidity pool for trading and price support.   Such a pool would likely decouple GNO price from ETH to boot. It is my hope that something more comes out of this GnosisDAO proposal than just getting a GNO Maker vault and at a minimum I would like to hear how this is both going to be good for Gnosis and Gnosis chain, DAI and Maker. ",
                    "links": [
                        "https://forum.gnosis.io/t/should-we-burn-68-of-the-total-gno-supply/3442/17",
                        "https://forum.makerdao.com/t/decreasing-liquidation-ratios-proposal/9819/8",
                        "https://forum.makerdao.com/t/signal-request-nexo-institutional-vault/10046/7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541982323232323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/claberus",
                    "index": "#20",
                    "likes": "1",
                    "time": "03/06/2022-17:09:45",
                    "content": "Hi! claberus from KarpatkeyDAO and GnosisDAO here, GNO supply has already been reduced to 3million, GIP-35 was approved and executed. It’s also updated on Coingecko This supply reduction didn’t affect GNO’s liquidity, in fact GNO has one of the deepest liquidity of any DEFI token, promoted by the Gnosisdao’s treasury Regarding your questions:   Yes, that’s the plan. GNO to fund vaults will be coming from the treasury. GIP-46 sent most of GNO to Karpatkey for active treasury management so this should not be an issue.   If necessary, we could commit to a minimum level of use (and interest) or to cover losses, provided Maker provides the vault you describe. We’re open to suggestions.   We’re building GNO pairs with many projects on the Gnosis Chain. GNO is and will remain the token with deepest liquidity on Gnosis Chain which should replace ETH correlation in the future.   That’s happening right now, with our minted DAI migrating to Gnosis Chain to provide liquidity on different pairs. 5.The most important usecase for our minted DAI will be the financing of the Gnosis Chain operation, marketing efforts, devs grants, etc.   We have an emergency protocol in place and we’re only willing to spend less than half of our DAI minted and we currently keep 350% CR for steth and 500% CR for GNO (on other protocols) so we could repay debt at any time. In addition to this, we’re building anti-liquidation bots, currently on testnets for an additional safety net.   ",
                    "links": [
                        "https://www.coingecko.com/en/coins/gnosis",
                        "https://forum.gnosis.io/t/a-week-in-gnosisdao-farms-may-30th-2022/5182",
                        "https://forum.gnosis.io/t/gip-46-should-gno-from-the-gnosisdao-safe-be-transferred-to-the-treasury-management-safe-operated-by-karpatkey/5035"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.512235449735449
                },
                {
                    "author_link": "https://forum.makerdao.com/u/claberus",
                    "index": "#21",
                    "likes": "8",
                    "time": "03/06/2022-17:18:31",
                    "content": "We posted a proposal that is relevant to this topic: GIP-49: Should GnosisDAO do a BFF Partnership with MakerDAO? The proposal tries to find interest within the Gnosisdao community for a partnership with Makerdao  Simple Summary  Propose a token swap GNO-MKR of around $70 million to the Maker community Explore the use of an institutional MakerDAO vault with the GnosisDAO treasury using GNO + stETH and mint 100 million DAI to be used for the development of the Gnosis Chain Explore a GNO grant with MakerDAO growth core unit to expand global adoption and brand awareness of Gnosis Chain Rebranding xDAI to DAI Increase GNO incentives to DAI pairs on Gnosis Chain Periodically buy MKR in the open market using GnosisDAO’s treasury farming rewards  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#22",
                    "likes": "4",
                    "time": "03/06/2022-20:36:42",
                    "content": "If all this you describe comes to fruition, we are talking about the biggest deal ever made in defi and between DAOS in history. We should not have to wait long for this to be a big step for Maker and GNO pay to continue pushing for truly decentralized protocols. Already my vote is YES from the beginning. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#23",
                    "likes": "0",
                    "time": "06/06/2022-16:43:18",
                    "content": "Really interesting, thanks for the update! I joined your Forum and will take a close read through. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/F117",
                    "index": "#24",
                    "likes": "0",
                    "time": "13/06/2022-09:16:43",
                    "content": "Hi @Primoz, would the Risk Core Unit be publishing a GNO Collateral Onboarding Risk Evaluation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zmtong",
                    "index": "#25",
                    "likes": "1",
                    "time": "21/06/2022-21:40:13",
                    "content": "On June 3rd, Gnosis posted on the Forum with an expanded plan. At the June 13th CMON Stakeholder Alignment Meeting, GROWTH CU advised they will negotiate new terms. The teams recommended to close/withdraw this MIP6 application and open a new MIP6 using the latest template and go through Greenlight again. As such, we are proceeding to move the status to “Will Not Do” in the CSI sheet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.551948051948052
                }
            ]
        }
    ],
    "group_index": "3734"
}