{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/add-a-new-system-variable-for-governance-to-control-the-minimum-sf-on-all-vaults/3613",
            "title": "Add a new system variable for governance to control the Minimum SF on all vaults. ",
            "index": 3613,
            "category": [
                "Governance"
            ],
            "tags": [
                "rates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "4",
                    "time": "09/08/2020-17:47:57",
                    "content": "Folks I have been thinking about the idea that the protocol somehow does better if rates are actually 0 vs. something like .1-.5%.   I really don’t like the idea that we don’t have a clean way to set a minimum SF on all vaults across the board that governance can use to manage the ‘bottom’ end rate across all asset classes. I contend that given the reason for the high DAI PEG price is farming returns that changing the bottom SF’s across the board on all assets to something like .1 to even .5% isn’t going to do dink to the PEG and most certainly isn’t going to reduce or increase DAI demand from current levels. What adding something like this would do is to allow governance with a single parameter to set the effective ‘base’ fee across all assets to an easily controlled value that is consistent across the entire class of MCD assets.   Simply use it to lift the fees just a bit off zero when they are zero to still have the protocol generate fees.   We can still set it to zero if we really want to have the protocol generating zero fees (since so many people want to go to negative rates).   But I think even if we go to negative rates we are still going to want an effective knob that sets the bottom end rate to be consistent across all asset classes. So what I am proposing is to add another variable to our rate methodology. MINIMUM_VAULT_RATE that effectively sets the lowest fee rate across all vaults uniformly.  (i.e. if the normal governance mechanics wants to set a rate lower than this - this will override it and set the vault rate to the MINIMUM).   In time depending on how negative rates are implemented I think it would make sense to use this variable to set the negative rate the same across the board.   But then again maybe there will be reasons NOT to do this. I just wanted to toss the idea out for discussion and once that happens to perhaps put up a signalling poll on the idea to see what governance thinks.   In terms of smart contract mechanics it should be rather easy to take the vault rate calculated from the base rate, RP, vault SF and to apply the above as a check and if lower set to the above minimum. ",
                    "links": [],
                    "GPT-summary": "The author proposes adding a new system variable for governance to control the minimum stability fee (SF) on all vaults. The proposal suggests that this would allow governance to set the effective 'base' fee across all assets to an easily controlled value that is consistent across the entire class of MCD assets. The post also invites discussion and feedback on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.551036337399974
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/08/2020-18:21:21",
                    "content": "Time for a governance signalling poll? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/08/2020-18:27:50",
                    "content": "This also reminds me that we will need vaults with a maximum/fixed SF fee as well. With RWA’s coming up, they will need steadier SF’s not at the whim of base rate changes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 0.9999999999999998
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "0",
                    "time": "09/08/2020-18:42:08",
                    "content": "    Aaron_Bartsch:  This also reminds me that we will need vaults with a maximum/fixed SF fee as well. With RWA’s coming up, they will need steadier SF’s not at the whim of base rate changes.   Yeah I was talking with Matthew Rabino about his situation and what rate changes do to him using Maker to provide financing for his CTL company and this is probably his greatest concern.  Realistically here is a guy that if we could onboard something tomorrow would mint and sell 25M DAI into the markets immediately, that if the rate changed by 100-200bps (which it won’t given current situation) would back that out very quickly.   I am not sure we want the guys with these big RWA accounts causing massive PEG price swings just because they are trying to manage what seem to us to be minor rate swings.   50-100bps changes are pretty large to bond type money managers. We may need to think about how to do longer term bounded rate agreements for some RWA players.   This is all going to have to be discussed.   But the RWA players here may have different needs than our crypto backed players.   These asset values are not going to fluctuate as much either.     psychonaut:  Time for a governance signalling poll?   I simply wanted to open this up for discussion.   If we don’t get too much negative discussion and just positive remarks I will add a signalling poll to the initial post.   I really just wanted to vet this a bit before making a poll. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.192099567099567
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#5",
                    "likes": "0",
                    "time": "09/08/2020-18:51:38",
                    "content": "Fixed stability fee vault-types  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/08/2020-18:56:52",
                    "content": "Fees in general!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/08/2020-18:58:17",
                    "content": "Hopefully, a couple months from now we will have a few B-type vaults to help mitigate the growing risk ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#8",
                    "likes": "0",
                    "time": "09/08/2020-19:33:17",
                    "content": "Minimum SF sounds like a cool parameter. Would be interesting to have some 30d fixed sf vaults. As the system matures, the DAO would be more comfortable underwriting 30d fixed loans. And it gives another powerful, monetary policy lever to have a 30d fixed sf lever. And maybe the DAO would be comfortable with longer term maturities. Though, it is more duration risk for the system, (which will be offloaded to users borrowing at the overnight rate). Maybe it’s better to offload duration risk to secondary markets. Yield Dollar is doing some interesting things for longer term fixed DAI loans. Quarterlies all the way to 1.25 years out. And you’ll be able to do some high leverage interest rate hedging since you can mint the ‘yDAI’ with CHAI collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.471875000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#9",
                    "likes": "1",
                    "time": "09/08/2020-22:30:27",
                    "content": "Re: fixed stability fee Vault types. This has been discussed previously. Noting that the Stability Fee for each Vault is currently set using: SF = max(0, BF + RP) Fixed fee Vaults can be created by adding a new parameter (Fixed Parameter) and changing the stability fee structure to be: SF = max(0, BF * FP + RP). FP would be a value set at 0 or 1. All Vaults by default would have FP as 1. Any Vaults that we wished to have a fixed stability fee, the FP would be set at 0. This model would allow us to have decimal values between 0 or 1, or even values above or below 0 or 1 if we wanted as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.2310606060606055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#10",
                    "likes": "1",
                    "time": "10/08/2020-21:48:44",
                    "content": "When poll/mip? I think this is a great idea that should be enacted ASAP! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                }
            ]
        }
    ]
}