{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/where-is-the-makerdao-discord-chatter-happening/15380",
            "title": "Where is the MakerDAO Discord chatter happening? ",
            "index": 15380,
            "category": [
                "Miscellaneous",
                "Site Feedback"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/HospitableOryx",
                    "index": "#1",
                    "likes": "2",
                    "time": "26/05/2022-03:46:19",
                    "content": "Ok, maybe this is a PEBKAC problem, but I cannot figure out where the MakerDAO action on Discord is happening, even though I see occasional references to Discord chatter on the forum. In the MakerDAO official discord (this is in my URL bar: Discord, I use the browser), the only channel I see under the General heading is “Media Inquiries”, and there are a handful of Info channels. It looks like no substantive discussion happens there. Additionally, when I try to click the Discord link in the upper right of the forum, I get redirected to a link to download the desktop app, which I’d like to avoid unless I need to use it. Is there some other Discord presence that I’m missing? I also raise this because if I’m having a hard time maybe someone else is too… ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.15952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/commanderkeen",
                    "index": "#2",
                    "likes": "5",
                    "time": "26/05/2022-06:31:52",
                    "content": "You need to approve rules in #rules channel, and you will get access to all channels ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "1",
                    "time": "26/05/2022-11:20:20",
                    "content": "There is a lot of good info on discord. It looks like you need to make sure you are verified, usually you have to accept the rules, but please be careful as scammers are all over discord. Please be careful what links you click and be hesitant of people trying to DM you. When in doubt, to the extent you can, reach out to a mod (and remain vigilant). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#4",
                    "likes": "1",
                    "time": "26/05/2022-13:21:58",
                    "content": "What @commanderkeen said is correct, after reading the #rules thread and following the instructions there, all the publicly available chats should become visible. If that is not the case - or you need further assistance - please feel free to reach out to me. On Discord I’m prose11#7778 if messaging here is less convenient. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.633333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HospitableOryx",
                    "index": "#5",
                    "likes": "2",
                    "time": "28/05/2022-20:04:58",
                    "content": "Ah, thank you for clarifying. As some unsolicited feedback, I was a bit confused by the user experience. I was prompted to accept the rules  via a modal pop-up, and then when I skimmed the rules post, it seemed redundant so I didn’t read that closely. I also didn’t understand the rules “Community” role, especially because the following sentence encourages you to explore the server, but doesn’t directly indicate you’re basically unable to do anything until you accept the Community role. I thought that might be something more specific than just a general member, and then I promptly forgot to try following the instructions when I couldn’t find another solution. If I can help at all drafting alternate language or directing this feedback to someone, let me know! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.795454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#6",
                    "likes": "0",
                    "time": "28/05/2022-21:46:01",
                    "content": "Security through obscurity ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}