{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/senator-lummis-finishing-crypto-bill/15640",
            "title": "Senator Lummis Finishing Crypto Bill ",
            "index": 15640,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "legal",
                "regulation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "2",
                    "time": "06/06/2022-20:14:12",
                    "content": "However you feel about regulation, this bill will have a far reaching impact in the crypto space. There was a version circulating online but Lummis said any draft circulating would be outdated. I was unable to find it and read it.  They might reveal it tomorrow. In any event, I am not sure what immediate impact, (if any) this will have on the market. I guess we have to wait and see…    POLITICO   https://static.politico.com/20/67/ecf118be4fde9a53e6755d040609/https-delivery.gettyimages.com/downloads/1239844603(image larger than 4 MB) Crypto lobbying hits fever pitch as Bitcoin's favorite senator finishes bill The contents of the bill will likely shed light on who holds sway in the ever-expanding universe of crypto lobbying.      ",
                    "links": [
                        "https://static.politico.com/20/67/ecf118be4fde9a53e6755d040609/https-delivery.gettyimages.com/downloads/1239844603",
                        "https://www.politico.com/news/2022/06/06/lummis-and-gillibrands-crypto-hype-machine-00036712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.90625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#2",
                    "likes": "1",
                    "time": "07/06/2022-11:47:55",
                    "content": "As per the bill, allegedly, crypto & other digital coins won’t be treated like normal securities under SEC scrutiny unless they entitle the holder to the privileges enjoyed by corporate investors like dividends, liquidation rights or a financial interest in the issuer. According to the below cited article, these are some of the main features of what Gillibrand described as a “landmark bill” that “will provide clarity to both industry and regulators, while also maintaining the flexibility to account for the ongoing evolution of the digital assets market”:   It would define the terrain between crypto securities and commodities, allowing token issuers to know beforehand what they’re launching based on the “purpose of the asset and the rights or powers it conveys the consumer.” The market envisioned in the bill is dominated by commodities, including most of the big names in crypto, such as Bitcoin, Ethereum and dozens of the other tokens with significant market share that would fall into a definition as “ancillary assets” overseen by the CFTC.   The lawmakers would give the Commodity Futures Trading Commission authority over the spot markets in crypto commodities, as sought by agency chief Rostin Behnam. That would carve out a key new power for the federal watchdog that doesn’t now have much reach into cash markets.   It also gives “needed legal clarity” in how to handle customer holdings after the recent furor over customers’ tokens getting roped in with an exchange’s assets in the event the company goes bankrupt – a worry that erupted after Coinbase (COIN) suggested it as a possibility in a recent Securities and Exchange Commission filing. The Biden administration has signaled it wants better custody arrangements in any crypto bills moving through Congress.   The Lummis-Gillibrand legislation also adopts language from a bill last year from Rep. Patrick Henry and others that sought to clarify the meaning of a crypto broker, especially hoping to protect wallet providers, software developers and others from being snagged by certain tax reporting requirements.   The bill doesn’t automatically set up the self-regulatory organization (SRO) that many in the industry have lobbied for, but it calls for a study from the SEC and CFTC and a proposal for starting one.   Crypto operations watched by the CFTC would – under this legislation – have to start paying fees to fund the agency, akin to the model that now supports the SEC.   The senators also suggest an industry “sandbox” in which regulators let crypto firms test new products on a limited scale and duration.   In light of the recent, dramatic collapse of TerraUSD (UST), one closely examined aspect of the bill will be its move toward “100% reserve, asset type and detailed disclosure requirements for all payment stablecoin issuers.” There would be a new framework for banks and credit unions to issue stablecoins, but issuers wouldn’t have to become depository institutions. The lawmakers insist that “existing stablecoin issuers and new entrants into the market have an adequate opportunity to compete with existing banks and credit unions.”   The bill also requires certain disclosures to the SEC from companies raising funds through digital asset sales. The approach would ensure “that market participants and our securities regulatory community receive detailed and accurate disclosures about those digital assets that are widely traded, but in a manner that encourages innovation,\" said Lewis Cohen, co-founder of DLx Law.     See Key US Senators Introduce Crypto Bill Outlining Sweeping Plan for Future Rules   ",
                    "links": [
                        "https://www.coindesk.com/policy/2022/05/18/biden-administration-wants-crypto-exchanges-to-separate-customer-and-corporate-funds/",
                        "https://www.coindesk.com/policy/2022/06/07/key-us-senators-introduce-bill-outlining-sweeping-plan-for-future-crypto-rules/",
                        "https://forum.makerdao.com/t/crypto-bill-proposal-how-would-this-affect-dai-and-makerdao/15668/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.504610840548341
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "0",
                    "time": "07/06/2022-16:58:21",
                    "content": "   Scribd    Lummis Bill Draft | PDF | U.S. Securities And Exchange Commission |... Scribd is the world's largest social reading and publishing site.      DAOs are certainly referenced- at least for IRS purposes- ",
                    "links": [
                        "https://www.scribd.com/document/576008331/Lummis-Bill-Draft#from_embed"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.912698412698412
                }
            ]
        }
    ]
}