{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/psm-should-be-completely-disabled-unless-dai-is-above-1/20159",
            "title": "PSM should be completely disabled unless dai is above $1 ",
            "index": 20159,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "psm"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/DaiSeller",
                    "index": "#1",
                    "likes": "0",
                    "time": "13/03/2023-05:25:58",
                    "content": "The PSM should always be disabled unless DAI is significantly above $1. The PSM has literally turned DAI into wrapped USDC in the worst case scenario for USDC. As we saw with the ongoing depeg, the PSM was just used as exit liquidity for USDC pushing the stablecoin collateral behind DAI to levels that are even stupider than they were before (and they were pretty stupid already). Meanwhile while everyone was patting themselves on the back saying “Dai is 150% collateralized!” vault holders for assets that actually overcollateralize dai realized “Oh shit!” I could get my deposit yoinked in a global settlement because the system says that my collateral is worth just as much as the 1:1 dog shit from the PSM. not apologizing for language or grammar because this org (which I tremendously respected in the beginning) has gotten so stupid over the years over-engineering solutions to problems that barely exist, probably for make work reasons and spending eye-watering amounts of money in the process when the original product was actually better than what you have now. Literally the only thing that has improved is the UI. good job retards implement this idea or don’t. Doesn’t matter to me now <3 ",
                    "links": [],
                    "GPT-summary": "The post is a critical analysis of the PSM (Peg Stability Module) and its impact on the stability of DAI. The author argues that the PSM should be disabled unless DAI is significantly above $1, as it has turned DAI into wrapped USDC in the worst-case scenario for USDC. The post is a constructive criticism of the PSM proposal and an audit of its effectiveness in stabilizing DAI.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.782986111111111
                }
            ]
        }
    ]
}