{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govcomms-bi-weekly-update-nov-15-26/11877",
            "title": "GovComms Bi-Weekly Update: Nov 15 - 26 ",
            "index": 11877,
            "category": [
                "Core Units",
                "Governance Communications"
            ],
            "tags": [
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "1",
                    "time": "29/11/2021-16:42:23",
                    "content": " GovComms Bi-Weekly Update Nov 15 - Nov 26, 2021  Administrative Update  Budget Updated with SP40 Our budget modification proposal, SP40, has been accepted. The main changes are:  Travel figures updated; More accurately reflects expenses by assuming one team-wide offsite for three people, and coverage for two people to attend up to three events per year. Salary line item updated; More accurate. Hourly Compensation item updated; More accurate. Operating Expenses item updated; More accurate.  For detailed figures visit the proposal linked above.  One-Time Payment Request Our request was met with full support from those who voted in the signal request. The next step is to get affirmative results in the on-chain Governance Poll before the payment can be put to an Executive Vote.  Work Being Done Check out our public drive. Documentation around all our active projects is growing and improving with project plans/descriptions, metrics tracking, and workflow process docs coming into existence and being iteratively improved upon.  Meetings at Maker, The Calls Calendar As documentation continues to be written and improved on, we are making progress in piloting this initiative. We are beginning to schedule Stakeholder Alignment Meetings on the Calls Calendar. The call coordinator will be listed in the description, so anyone who would like an invite can directly contact that individual on Discord. In addition, an Initiatives, Leads, and Coordination Calls tracker has been created to help align the DAO by maintaining this key information in a single referenceable location.  Emergency PlayBook Progress Further progress has been made on this initiative. Our team has met with members of the new Immunifi Security Core Unit, IS-001, to align on initiative expectations, synergies, and vision. @psychonaut has partnered with us as a contributor to add to and review the existing documentation. Additionally, work on the actual documentation continues to be in progress until the completed first draft.  MakerDAO People List, now called the Stakeholder Database We have nearly solidified a deal with legal counsel that specializes in global tech GDPR compliance. We are tentatively planning to begin our work with them during the second week of December. In the meantime, we are continuing to make improvements to the database itself.  Information Output Audit Thomas has been meeting with Core Unit Facilitators to capture their feedback on the audit findings, methodology, and practice. To finalize this first round of the audit, expectations and timelines are being documented for completing recommended actions.  Issue Discussion Calls The next Issue Discussion Call is being planned for mid-December, with MKR burn being the tentative topic. More details will be posted soon.  Published 11/12/21 - 11/26/21 Maker Relay (Dual effort between MKT-001 & COM-001) #71 Eng | #71 Esp #72 Eng | #72 Esp Forum at a Glance 11/11 - 11/18 11/18 - 11/25  Up Ahead  December 2021  Emergency Playbook V1 Draft Coordinating the next Issue Discussion Call Monthly MakerDAO CUs update November Governance Review   January 2022  Annual Governance Review Maker Relay 2021 refresh COM-001 Mandate Refresh COM-001 MKR Comp Package  ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-one-time-payment-to-com-001-to-cover-missing-dssvest-funds/11685",
                        "https://drive.google.com/drive/folders/1GBAeTx4jmob7wRs7_LK32Bh_Y-pHzPvV?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/18FFp6aG39zW7uLnHcoqBhKNHe2FbK96txRoFFQn7lt0/edit?usp=sharing",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/maker-relay-ep-72/11773/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-72-en-espanol/11799/1",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-11-18/11713/3",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-18-25/11827/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-73-en-espanol/11900",
                        "https://forum.makerdao.com/t/maker-relay-ep-73/11882",
                        "https://forum.makerdao.com/t/under-construction/12274/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.94670733307097
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/02/2022-16:42:29",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}