{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-sybil-resistance-for-recognized-delegates/16810",
            "title": "[Informal Poll] Sybil resistance for Recognized Delegates ",
            "index": 16810,
            "category": [
                "Governance"
            ],
            "tags": [
                "delegation",
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#1",
                    "likes": "5",
                    "time": "25/07/2022-14:47:48",
                    "content": "MakerDAO’s delegate compensation is paid out based on a quadratic formula. Each increasing MKR that is delegated to an individual Recognized Delegate (RD) is worth less when it comes to calculating compensation until 10k MKR is delegated, at which point each additional MKR is valued at zero and the comp maxes out. Due to this math, there is a considerable incentive for individuals or organizations to attempt to game the delegation compensation system by creating multiple Recognized Delegate addresses under pseudonyms. For instance, it is far more lucrative to have 2 Recognized Delegate accounts with 5k MKR delegated to each (comp: 16,970 DAI/mo) as opposed to 1 account with 10k MKR delegated (comp: 12,000 DAI/mo). As political factions grow within the DAO, there is also more opportunity for 1 person, with 1 unique set of principles, to create multiple pseudonymous RD accounts, feigning different sets of DAO-related values to appease various ideologies when it comes to the future of the DAO. Gitcoin has faced a very similar situation over the past few years and created this nice 2-minute explainer of the problem:     To pursue stronger incentive alignment and a more genuine governance system, should the DAO consider putting new and existing RDs through some sort of sybil resistance check (i.e. Gitcoin Passport) to work toward ensuring that each RD is a unique human or organization and that it’s more difficult for a single human/org to benefit from more than 1 RD account?     Yes No Abstain     0 voters     NOTE: Restarted the poll after being live for 10 min because I failed to enable public voting initially. ",
                    "links": [
                        "https://www.youtube.com/watch?v=v1Dm7FI2AdU",
                        "https://passport.gitcoin.co/",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/8",
                        "https://forum.makerdao.com/t/mip78-recognized-delegate-dai-compensation/16906/29",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-21-27-de-julio-del-2022/16941"
                    ],
                    "GPT-summary": "The author of the post is explaining the problem of the compensation system for Recognized Delegates in MakerDAO and proposing a solution to prevent gaming of the system. The post also includes a poll asking whether the DAO should consider implementing a sybil resistance check for RDs. A 3rd party could give constructive criticism by suggesting alternative solutions or asking for more details about the proposed solution.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.302887063916476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#2",
                    "likes": "0",
                    "time": "25/07/2022-15:30:19",
                    "content": "Great idea, I am in support of some type of biometric login (facial recognition, fingerprint) or other method but that allows the user to decide to use their real world name or a virtual identity, that is limited to one account. I would want to respect delegates decision to remain anonymous or separate real identities from the DAO identity without the ability to game the system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4311224489795915
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#3",
                    "likes": "1",
                    "time": "25/07/2022-15:33:53",
                    "content": "I probably should have been a bit clearer in my initial post. This isn’t about doxxing anyone with facial scanning or anything like that. This is about doing our best to ensure that a RD has a pre-existing reputation and is vouched for by others before they become an RD. This shouldn’t prohibit anons from becoming RDs in any way. The Gitcoin model is to give options to have your social reputation vouched for in a way that would allow people like Hasu to easily pass, and keep someone who created an anon identity specifically to only use on the Maker forum out of the RD program. Gitcoin Passport docs are a good place to start learning more about easy ways to implement this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "0",
                    "time": "25/07/2022-16:03:08",
                    "content": "I voted yes because I have known this was an issue even since the start of the delegation compensation initiative.   I felt the simplest way to handle the MKR sybil compensation issue was to both unify MKR compensation (for all governance participants) and to make rewards linear to MKR voting as per my delegate thread post.   Put simply sybil’s only matter when one deviates from rewards being linear to MKR held or capped in some way.     MakerMan delegate platform Delegates       I am putting this into my delegate platform first to solicit for feedback before I even try to poll on this.  I have spent a lot of time thinking about a model for governance compensation that is:   Fair Simple includes compensation for delegates includes a mechanism to encourage delegation of MKR controllable by the DAO has a reasonable cost element rewards directly in proportion to MKR being voted and participation  I believe I have achieved this goal with the following proposal.  Simple gover…     The above suggestion for how to handle compensation handles a number of governance issues but doesn’t address what I consider larger governance issues pointed out in other posts on the subject.     [Informal Poll] Potential Issue with Protocol Paid Delegates Governance   @Spidomo Great question and something I didn’t even think about when considering another post with suggested changes to the delegate process so we could consider fair compensation for delegates.  I am going to have to think about your question a bit and probably do some research before coming back with an answer.  I do think if delegates have sufficient MKR to pass an executive they basically have the power to alter their own pay structures.   This becomes a potential conflict of interest.   I t…      and a thread on the general subject that never went anywhere at the time.    Suggested changes to Maker Delegation system. Governance       I was thinking about the Maker MKR delegate compensation and talking about this with a friend who is a former elected official.  https://forum.makerdao.com/t/delegate-compensation-informal-poll  As a delegate my own conflict of interest on this poll is that I stand to gain some ‘compensation’.  Whether a delegate or not, as a MKR holder I think if a delegate can self elect and then delegate to themselves their own MKR to ‘earn compensation’ this will be a potential system abuse vector.  Governan…     I did not address the sybil issue at all in the above posts because I felt this ultimately would come up with a more general discussion regarding anonymous actors in MakerDAO that hasn’t really happened yet either. ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-potential-issue-with-protocol-paid-delegates/10061/4",
                        "https://forum.makerdao.com/t/suggested-changes-to-maker-delegation-system/10066",
                        "https://forum.makerdao.com/t/delegate-compensation-informal-poll"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.873697916666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#5",
                    "likes": "0",
                    "time": "25/07/2022-22:13:56",
                    "content": "This simplest way to handle this would be to get all the delegates on a call where they can show their voice and face. Delegates should be speaking to people occasionally, so there should be signs if someone is secretly doing two delegate roles. If someone really wants to be full anon and not do that, they could agree to additional private verification. Do you have any specific suspicions that someone is doing this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Llama",
                    "index": "#6",
                    "likes": "2",
                    "time": "25/07/2022-22:18:34",
                    "content": "Hi I voted NO on the Sybil resistance for Recognized Delegates, as I dont think its a problem at the moment with 22 recognized delegates, where each delegate needs to do a video and submit a post about their platform. I think we have enough safeguards in place. But as a core contributor to Gitcoin, I have been very close to the development of this tool, and I think it solves a very important problem in web3 and it might be a great tool for MakerDAO as well, I am just not sure if this is the right time and use case. (PUNCAR) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.296428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#7",
                    "likes": "0",
                    "time": "26/07/2022-15:13:48",
                    "content": "Introducing some centralized control could help to solve this problem. Like, the GitCoin grants require users to login with GitHub, and GitHub provides an identity for voters. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#8",
                    "likes": "1",
                    "time": "27/07/2022-15:42:06",
                    "content": "   threadreaderapp.com    Thread by @chunza2542 on Thread Reader App @chunza2542: A Complete Introduction to Gitcoin Passport 🛂 What is a @gitcoin passport? What problem does it solve? And how will it become an essential building block for a decentralized society? Let's dive in! 🧵👇 1...…      Found a solid thread on Github Passport. It’s more or less a web-of-trust model where your personal score increases by verifying the legitimacy of other participants. It looks like to initially onboard, users have the option of connecting an ENS, Google, or a Proof of Humanity account.  TLDR: “Gitcoin Passport is an identity aggregator that allows users to verify personhood, help defends against the Sybil attack, and encourage DAO to build more on a one-human-one-vote scheme.”  Passport utilizes “Quadratic funding” (QF), which allocates funds based on the sum of an individual or team’s contribution to each project.  image1200×549 71.1 KB  The main benefit of QF is that the number of contributions (to a grant) matter more than the amount funded, pushing protocol power closer to the edges.  Per the thread, the best way to handle Sybil resistance is to increase the cost of the attack - be it time, money, or effort. This can be accomplished in a number of ways.  Identify adversarial patterns that force attackers to place increased effort into the impersonation of legit ID. Increase the transaction or entry fee. ID and personhood verification.  Great post @ChrisBlec, and whether or not Passport is specifically used, I’m in favor of the web of trust model as a future implementation. ",
                    "links": [
                        "https://threadreaderapp.com/thread/1537040041310302208.html"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0859375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#9",
                    "likes": "1",
                    "time": "05/08/2022-17:11:01",
                    "content": "@ChrisBlec, thank you for posting this thread. Community interest is clearly in favour of adopting some form of decentralized ID solution at Maker in this informal poll. GovAlpha will deploy some resources to look into different options and present them to the community in due course. We would probably want to trial any solutions before rolling them out more generally. I would suggest the sourcecred instance is a naturally good fit for this, but we can discuss implementation more once we’ve looked into things in a bit more detail. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#10",
                    "likes": "0",
                    "time": "05/08/2022-17:21:48",
                    "content": "Wouldn’t it be better to use Proof of Humanity? That verifies the identity on the blockchain and that’s it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#11",
                    "likes": "0",
                    "time": "05/08/2022-17:29:13",
                    "content": "Proof of Humanity is incorporated into the Gitcoin Passport, so it would be one of the options available if we adopted that specific tool. My main issue with using Proof of Humanity on its own is that it is not anon-friendly because it requires users to appear on video. I would prefer a solution allowing anons to verify unique humanity if possible as that would be more in keeping with the ethos of a DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.458333333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#12",
                    "likes": "0",
                    "time": "05/08/2022-17:30:06",
                    "content": "PoH costs are pretty high, there are easier ways especially if its only for the 20-30 Recognized delegates. We probably dont even need a sophisticated solution for it.     Patrick_J:  I would prefer a solution allowing anons to verify unique humanity if possible as that would be more in keeping with the ethos of a DAO.   Echo this ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.115625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#13",
                    "likes": "1",
                    "time": "05/08/2022-17:49:59",
                    "content": "    Patrick_J:  My main issue with using Proof of Humanity on its own is that it is not anon-friendly because it requires users to appear on video. I would prefer a solution allowing anons to verify unique humanity if possible as that would be more in keeping with the ethos of a DAO.   I suppose there is a world where you can have shadow delegates shelter the anon-friendly delegates and recognized delegates go through some form of proof of humanity gate. However, I worry that the more we roll out exceptions and complications the harder it will be to manage what is already quite a substantial piece of governance infrastructure. And gating compensation only to doxed delegates is probably not great for incentivizing broader participation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.912037037037036
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#14",
                    "likes": "1",
                    "time": "05/08/2022-17:54:59",
                    "content": "Yes agree with all of this. Ideally any proof of humanity gate would be anon friendly as well. But theoretically if the community wanted you could extend it to voting on Signals or making proposals- but for that we need to ensure it is fair and robust. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "04/11/2022-23:55:53",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}