{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/moderating-suspicious-accounts/14173",
            "title": "Moderating \"Suspicious\" Accounts ",
            "index": 14173,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "moderation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "12",
                    "time": "23/03/2022-16:11:35",
                    "content": "TL;DR: Flags are there for a reason, if you would like comments and accounts examined please flag content you believe to violate our policies.  Forum Management Hello, over the past week GovAlpha has received several inquiries about new accounts on the forum, suspected sock puppet accounts, and general interest in our moderation technique for the forums. While @LongForWisdom and myself are not the only Moderators on the forum, we do tend to process a majority of flagged content.  Philosophy In general, we lean toward taking no action on posts we come across unless something is overtly against policies and expected behaviors. However, anyone on the forum has the ability to “flag” posts (dms and public comments) they feel should be examined as potentially hazardous for the community. When a post is flagged, it forces the moderators of the forum to accept or decline the flag, taking away a decent chunk of our bias toward inaction. In regards to banning accounts (particularly accounts that community members suspect are alt accounts of recognized community members), GovAlpha does not want to be put in the position of determining legitimacy. Instead, we rely on community flags to notice continual behavior against our standards and take escalating action against offenders. If the community would like to see this policy changed, we will need a clear signal from the community that GovAlpha should be stepping in when suspected alternate accounts pop.  Risks to More Aggressive Moderation There are several dangers to walking down that path, and as a protocol designed to be censorship-resistant, we should take policing of who and what can be posted as a very serious topic. However, those concerns must be balanced against the safety and effectiveness of our community, as failure to weed out “bad actors” could result in the forum not being a suitable host for decentralized governance. In order to remain decentralized we need to keep our discourse open and accessible, the more power we give to moderators, the greater the chance that power is abused.  Community Considerations Here are a list of questions we must ask ourselves as moderators and what (I hope) might be helpful framing for anyone that would like to pitch a stronger-handed approach to forum moderation:  Should accounts that make attempts to obscure their speech patterns (using specific vernacular, “broken” English, or other formulaic tools) be treated with greater suspicion? To what extent is it the moderator’s job to “tone police” criticism in an effort to promote healthy dialogue? Should anonymous/pseudononymous authors be treated the same as known members of the community? What is the appropriate escalation of moderation? When should accounts be banned, if ever? Who should have the power to moderate these discussions and how should their work be evaluated? Are there steps/procedures we can implement to limit spam and encourage more discussion on governance proposals?   Feedback and Next Steps What do you think, anon? Is our Moderation philosophy in need of a refresh? We have considered running an informal poll about community feelings toward moderation. Ideally, someone would be interested in crafting policy for moderation across platforms which we would be happy to contribute to, but we first must discuss the ideas and trade-offs before attempting to craft policy. Based on how this post is received we will see what will be the most effective way to get the answers to the questions presented here. ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-3/14549",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-17-23-2022/14191"
                    ],
                    "GPT-summary": "The post discusses the moderation techniques used on a forum and the philosophy behind it. The author explains that they rely on community flags to notice continual behavior against their standards and take escalating action against offenders. They also ask questions about the appropriate escalation of moderation and whether accounts that make attempts to obscure their speech patterns should be treated with greater suspicion. The author is open to feedback and collaboration on crafting policy for moderation.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.745925160697888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "2",
                    "time": "23/03/2022-16:27:46",
                    "content": "It seems strange to me that more than new accounts, they are inactive accounts of long time ago (years or months) that when a controversial topic comes up, they appear. Not if it is suspicious for others, for me it is. Of course we can focus on both cases, but in general the new accounts I have seen are from Latinos and they have behaved up to par for now. I think that this philosophy is good, because this way you don’t feel harassment towards new comments, people who want to be curious. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.004545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/edludlam",
                    "index": "#3",
                    "likes": "14",
                    "time": "23/03/2022-18:04:47",
                    "content": "Mate, the other day I saw a pirate talking to a lawyer. Am I really to believe there’s lawyers in the 21st century? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "2",
                    "time": "23/03/2022-18:26:25",
                    "content": "I generally don’t worry about such accounts so much except when it comes to votings on Forum posts (which sometimes see a surge of new accounts voting). The community does a good job of ensuring votes are not manipulated but probably no perfect way of removing all. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.488636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "1",
                    "time": "23/03/2022-19:10:33",
                    "content": "I think that’s the initial concern, whether they participate and create posts is the least of it, unless they are looking to cultivate creed. I think a number of things can be solved with the leveling system we have. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#6",
                    "likes": "5",
                    "time": "23/03/2022-23:16:04",
                    "content": "Yar har, I do feel seen. I’d reveal meself, exceptin’ me face do be enough to scare a kraken! May as well tie a cannon to me bootstraps and send me down to Davey Jones’ locker  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#8",
                    "likes": "2",
                    "time": "29/03/2022-18:32:39",
                    "content": "The solution could start with this part, a mechanism like “proof of humanity”, but where the verification of an account is not completed by validating it with another existing account, but with an AI that automates the process by validating that the person who creates that account is real and not repeated, so you could rule out 80% that it is not a multi-account, another possibility to simplify the process would be to ally with “proof of humanity”, to enter the Dao first you have to verify your identity there, and that is optional to show your identity in the Dao. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#9",
                    "likes": "0",
                    "time": "29/03/2022-18:38:25",
                    "content": "You are so right, I just saw the same thing you did, I thought I was the only one who thought that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.476190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#10",
                    "likes": "2",
                    "time": "29/03/2022-18:51:36",
                    "content": "I like your idea, but not its execution, a KYC to access a DAO is not very DAO of them. But some way to verify that it is not multi-accounts would be ideal, maybe IP blocking, if it is in Source Cred validate the wallets and see if there are strange movements. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#11",
                    "likes": "0",
                    "time": "29/03/2022-19:36:00",
                    "content": "What do you mean by strange movements?, Dai transfers between SourceCred accounts? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#12",
                    "likes": "4",
                    "time": "29/03/2022-19:47:00",
                    "content": "So I know several groups are working on “Proof of Humanity” type verification systems and don’t want to disparage their efforts, but it is not an easy problem to crack. Especially in a way that ensures contributors and community members who wish to stay psudoanonymous can still do so. That is a greater concern to me, but there are a few minor ones like what about accounts for groups that wish to communicate as a single entity, and what risks we’d be creating around a potential secondary market for verified forum accounts. In general I think it’s better to plan for ways that moderators can take actions currently available to them in a more unified and directed fashion, but if the community feels strongly that mechanisms like Proof of Humanity should be investigated we would probably be the CU to do so, and have the labor force to make that happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.784013605442176
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#13",
                    "likes": "2",
                    "time": "29/03/2022-20:24:12",
                    "content": "I agree, it is complicated, what I said before is easily vulnerable if applied alone, (it is a complement), it has to be a set of mechanisms that composed of different filters can work as one, filters that preferably is better not to mention them publicly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#14",
                    "likes": "0",
                    "time": "29/06/2022-02:25:02",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}