{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collateral-onboarding-call-kleros-fellowship-edition-thursday-october-22nd-17-30-utc/4825",
            "title": "[\\xf0\\x9f\\x93\\x84] Collateral Onboarding Call: Kleros Fellowship Edition - Thursday, October 22nd 17:30 UTC ",
            "index": 4825,
            "category": [
                "Collateral Onboarding",
                "Collateral Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-collateral"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#1",
                    "likes": "2",
                    "time": "21/10/2020-16:37:44",
                    "content": " image1752×984 209 KB  Time in your local-timezone format: 2020-10-22T17:30:00Z  Dial In Details Zoom Call Passcode:  ONBOARD  Intro After the Fellowship announcement from Kleros and the Maker Foundation (Kleros/Maker Fellowship on Collateral Legal Assessment Framework), the DAO has decided to bring to Federico Ast, co-founder and CEO of Kleros, to discuss the project and the fellowship.  Agenda  Intro by  @juanjuan  Kleros Federico Ast co-founder and CEO of Kleros.  Kleros Q&A about Kleros Kleros/Maker Fellowship on Collateral Legal Assessment Framework Q&A about the Fellowship  See you there! attn: @amyjung ",
                    "links": [
                        "https://forum.makerdao.com/t/kleros-maker-fellowship-on-collateral-legal-assessment-framework/4725",
                        "https://forum.makerdao.com/t/kleros-maker-fellowship-on-collateral-legal-assessment-framework/4725",
                        "https://forum.makerdao.com/t/all-your-collateral-calls-are-belong-to-us-2020-recap-upcoming/5718"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/10/2020-17:04:02",
                    "content": "Starting in 30 minutes! : ) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#3",
                    "likes": "2",
                    "time": "22/10/2020-18:12:21",
                    "content": "Community Collateral Onboarding Call (Fellowship Edition) October 22th, 2020 Agenda   00:00: Intro with Juan Guillén  01:04: Kleros with Federico and William  13:27: Q&A and Discussion about Kleros  Video https://www.youtube.com/watch?v=DGU7_ebEDkQ Introduction Juan Guillén Agenda and Preamble 00:00  Welcome to another collateral onboarding call. I consider it a collateral onboarding call since it has to do with the Fellowship that the Maker Foundation and Kleros have announced recently. Today it is my pleasure to have Federico from Kleros, co-founder and CEO. Discussions about collateral happen in the Forum.   Kleros  Kleros/Maker Fellowship on Collateral Legal Assessment Framework  Federico and William Presentation 01:04 Intro1616×907 82 KB The Web3 ecosystem1616×907 90.4 KB Complete contracts1616×907 278 KB Incomplete contracts1616×907 256 KB Smart contracts can&#39;t handle disputes1616×907 129 KB The contract1616×907 93.1 KB Escrow1616×907 226 KB Arbitrator1616×907 63 KB Jurors1616×907 71 KB Jurors interface1616×907 75.3 KB Jurors Vote Independently1616×907 84.6 KB Alice wins1616×907 71 KB PNK1616×907 85.2 KB General Court1616×907 59.2 KB Incentivizing jurors1616×907 88.4 KB Token redistribution1616×907 85.1 KB Users trying to game the system1616×907 74.2 KB Honest users will make money1616×907 62.3 KB A DAO court for all DAOs1616×907 109 KB Securing the DeFI ecosystem1616×907 67 KB Fake tokens on Uniswap...1616×907 129 KB How to decentralize the decision...?1616×907 82.6 KB tokens.kleros.io1616×907 87.4 KB Submit a token1616×907 184 KB Used submits token1616×907 59.2 KB Token accepted1616×907 55.5 KB User submits token1616×907 63.4 KB Challenge1616×907 206 KB Token challenged1616×907 64.4 KB Jury, submitter, challenger1616×907 123 KB Rejected1616×907 66.6 KB Introducing token lists1616×907 197 KB Token lists1616×907 186 KB Badges1616×907 45.8 KB ERC20 standard token badge1616×907 119 KB Stablecoin badge guidelines1920×1080 133 KB The Ethfinex badge1616×907 69.1 KB Comprehensive number of items1920×1080 406 KB Token listing process1616×907 183 KB The Baerchain case1616×907 64 KB Scott Bingley1616×907 135 KB The Grid+ case1616×907 57.1 KB A &quot;third party audit&quot;1616×907 131 KB Decentralized compliance for DeFi1920×1080 93.9 KB Kleros community Telegram1616×907 197 KB How can Kleros contribute...?1616×907 115 KB Make it faster...1920×1080 114 KB MakerDAO badge1920×1080 104 KB Assets looking to be onboarded1616×907 78.3 KB Kleros/Maker Fellow1616×907 69.9 KB 6 months1616×907 59.8 KB Goal1616×907 112 KB 3,000 DAI/month1616×907 94.3 KB Requirements1616×907 135 KB Apply now!1616×907 98.4 KB Requirements1616×907 133 KB Discussion  13:27 - Juan Guillén: What’s the incentive for the person that’s proposing the new token? What’s their incentive to do that? 19:57 - Juan Guillén: You mentioned the name of PNK. Where does the name “Kleros” come from?  21:29 - In one of those slides you showed the possibility of disputing maybe travel or crowdfunding. How do you dispute a travel or some crowdfunding that I participated in? 25:01 - As an American, the last thing I want to do is do jury duty. How do get over that hurdle to incentivize people to participate in a trial? 26:21 - Could you cover a little bit more in detail the listing part of your registering there and how that process actually works? 32:08 - My question was also oriented towards some comparison of other frameworks operating in this space. The Cryptocurrency Rating Council rates cryptocurrencies in terms of their propensity to be like a security or not. Have you done any benchmark of how this works or how this is better or improves existing frameworks for assessment of digital assets to be listed on exchanges? 36:25 - Juan Escallon: I have a question regarding how judges vote. They are incentivized to vote like the majority. That works a bit differently than traditional court. So, judges don’t vote based on their convictions but based on what they think the other think. Am I understanding this correctly? 38:01 - Juan Escallon: But how do you avoid group think? It could happen that the collective misses something or thinks wrongly or unjustly 40:11 - Juan Guillén: Regarding the badges, the way it was phrased originally it looked like it was more like an Oracle. You mentioned a stablecoin. Would that be an Oracle providing that? Is it purely code or is it the same system where there’s jurors? If it is the same system, how stable is a stablecoin? How much margin do you guys accept and is that in the rules or something? 41:56 - DeFiFrog: Do you imagine Maker using a system like Kleros to approve collateral types? 42:45 - DeFiFrog: Does the Kleros solution the capability to easily apply its decision-making process to other protocols? Would you be able to pull a random set of jurors from the Maker community to gauge their responses rather than PNK holders? Because I’d imagine the incentives are aligned more for Maker community members to decide on collateral types rather than Kleros community members 45:04 - Juan Guillén: When there’s a deposit and it’s challenged, does the reward go to the person who challenged or to the jurors? Or is it split? 46:18 - Juan Guillén: I want to know what’s your most popular project? What’s the best use case that you have right now? 47:03 - Juan Guillén: I guess we can move on to the fellowship 53:02 - Amy Jung: It’s not that the final outcome is a Maker Dai badge. Federico is mentioning that could be a possibility 53:39 - DeFiFrog: I read over the fellowship application again and, like you mentioned, it’s specific to how we assess collateral; it doesn’t specify whether or not we need to include the use of Kleros in that application. Could we make sure that’s clear? 55:04 - DeFiFrog: What would prevent someone from creating multiple accounts holding PNK to crowd jury pools? 56:01 - DeFiFrog: So, the number of PNK determines the weight of your vote. Does the reward for each judgment also depend on the weight of your vote or is it based on equal distribution, on number of votes? 57:02 - I guess the ultimate goal of this is to one day have a Maker community compliance department or an officer, where that individual is doing the risk-related duties. Do you agree with that, Amy, or am I completely off? 01:01:56 - Juan Guillén: I read somewhere that there were monthly check-ins required. What are you expecting from those reports? 01:02:47 - When I go on Uniswap I get the Kleros list and it’s bombarded with 40, 50 tokens that I need to add to my Uniswap account. Did Uniswap also do a Fellowship? How did they pick you to do this? 01:04:09 - Juan Guillén: There’s an issue I see with having a Maker badge. Sometimes, when I try to get projects to come to the collateral calls, it’s hard to find someone from the project to come. They do know that they are being considered for Maker, but they don’t participate actively. I see that as a problem if someone had to stake a couple Ether to do that 01:07:32 - Juan Guillén: Where can people find information about this fellowship and about Kleros? 01:08:21 - DeFiFrog: What’s the timeline?  Closing Comment Juan Guillén Outro 01:08:50  Thank you, Federico, thank you, Amy, and everyone else for attending  Credits   @blimpa produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/DGU7_ebEDkQ?t=64",
                        "https://youtu.be/DGU7_ebEDkQ?t=807",
                        "https://www.youtube.com/watch?v=DGU7_ebEDkQ",
                        "https://www.youtube.com/watch?v=DGU7_ebEDkQ&t=0",
                        "https://forum.makerdao.com/c/risk/collateral-meetings/23",
                        "https://forum.makerdao.com/t/kleros-maker-fellowship-on-collateral-legal-assessment-framework/4725",
                        "https://youtu.be/DGU7_ebEDkQ?t=64",
                        "https://youtu.be/DGU7_ebEDkQ?t=807",
                        "https://youtu.be/DGU7_ebEDkQ?t=1197",
                        "https://youtu.be/DGU7_ebEDkQ?t=1289",
                        "https://youtu.be/DGU7_ebEDkQ?t=1501",
                        "https://youtu.be/DGU7_ebEDkQ?t=1581",
                        "https://youtu.be/DGU7_ebEDkQ?t=1928",
                        "https://youtu.be/DGU7_ebEDkQ?t=2185",
                        "https://youtu.be/DGU7_ebEDkQ?t=2281",
                        "https://youtu.be/DGU7_ebEDkQ?t=2411",
                        "https://youtu.be/DGU7_ebEDkQ?t=2516",
                        "https://youtu.be/DGU7_ebEDkQ?t=2565",
                        "https://youtu.be/DGU7_ebEDkQ?t=2704",
                        "https://youtu.be/DGU7_ebEDkQ?t=2778",
                        "https://youtu.be/DGU7_ebEDkQ?t=2823",
                        "https://youtu.be/DGU7_ebEDkQ?t=3182",
                        "https://youtu.be/DGU7_ebEDkQ?t=3219",
                        "https://youtu.be/DGU7_ebEDkQ?t=3304",
                        "https://youtu.be/DGU7_ebEDkQ?t=3361",
                        "https://youtu.be/DGU7_ebEDkQ?t=3421",
                        "https://youtu.be/DGU7_ebEDkQ?t=3716",
                        "https://youtu.be/DGU7_ebEDkQ?t=3767",
                        "https://youtu.be/DGU7_ebEDkQ?t=3849",
                        "https://youtu.be/DGU7_ebEDkQ?t=4052",
                        "https://youtu.be/DGU7_ebEDkQ?t=4101",
                        "https://youtu.be/DGU7_ebEDkQ?t=4130"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.614437008569661
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/01/2021-00:12:23",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}