{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-future-decisions-about-oracles/5328",
            "title": "[Discussion] Future Decisions about Oracles ",
            "index": 5328,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#1",
                    "likes": "1",
                    "time": "25/11/2020-10:21:16",
                    "content": "I have just read this answer of @NikKunkel: link . He suggests that (without any rush nor urgency) the Governance can start talking about the future of Oracles, how to monetise them, how to develop them, etc. Since this is an important topic, I think it deserves its own discussion thread. In particular @NikKunkel suggests the following points to discuss:  Is it important to profit off of the Oracles? Should we prioritise market-share or revenue/profits? How much should we charge customers? Should all customers get charged the same? If not, what metrics should we use for determining price? Should price be dependent on how frequently the customer uses the Oracle? Should price be dependent on how much value the customer derives from the Oracle? Does it matter how many customers are using the same Oracle? Should customers get discounts if they use more than one Oracle? Should Oracles with tighter spreads (more gas fees) cost more? Should customers who are running Light Feeds get a discounted rate? Should customers who switch from a competitor like Chainlink get a discounted rate? For how long? Can customers “fix” a price for an extended period of time? How do we go about changing the price? How long after a price change is decided before it goes into effect? What if gas prices increase to 500 gwei and our gas costs to run the Oracles increase by 10x? Does the price change? How much? Is this fair to customers? Does cost increase if a customer Oracle is especially complex and/or time-consuming (read expensive) to implement? Do customers whose Oracle usage generates significant stability fees for the Maker Protocol get discounted or even free Oracle access?  ",
                    "links": [],
                    "GPT-summary": "The post discusses the future of Oracles and how to monetize them. The author suggests several points to discuss, including whether it is important to profit off of the Oracles, how much to charge customers, and whether customers should get discounts if they use more than one Oracle. The post also invites feedback and questions on the topic.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.8060897435897445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "1",
                    "time": "25/11/2020-10:30:19",
                    "content": "I think all of these questions are very important, and some are even quite technical. But I think it’s fundamental to establish a strategic approach (read: long term) answering the question:     iammeeoh:  Is it important to profit off of the Oracles?   My opinion is: TL&DR: Short term: no charge to customers. Expansion. Aim for market dominance. Long term: we’ll see. Potentially this is going to be a big market/source of revenue in the next few years. So my opinion is that the Oracle service is a strategic (read: having long term value) asset of MakerDAO. For this reason I think it’s important to push it and expand the customers base as much as possible to gain a market dominance on this sector. For this reason I am of the opinion that, for the next year(s) at least, all Oracle services should be given for free (i.e., no charge to customers) and all the expenses covered using the SF incomes of MakerDAO.     iammeeoh:  How do we go about changing the price?   Yes this (together with some other questions) will be a critical point when we decide to move from a free to a paid service. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.13625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/02/2021-16:30:20",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}