{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/light-feeds-and-non-exchange-applications/2855",
            "title": "Light Feeds and Non-Exchange Applications ",
            "index": 2855,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#1",
                    "likes": "5",
                    "time": "16/06/2020-23:27:30",
                    "content": "I have a general question about feed applications that has been spurred on by the recent MIP10c14 proposals. There have been several proposals for companies such as gitcoin, etherscan, and infura to run a light feed. None of these companies run an exchange, so I’m curious how light feeds work for these entities. Specifically, how do these non-exchange companies determine the price of ETH, and how much should I worry about that when voting on these proposals? Is the assumption here that these companies will pull prices from the same set of exchanges that the current omnia program does and then publish that same number to scuttlebutt for redundancy purposes, or are we leaving it up to any given light feed to determine how to price ETH at any given moment. Should this be something that MKR voters should consider when voting on the MIP10c14 proposals? Basically, are there questions we should be evaluating beyond just “do I trust this entity?” ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#2",
                    "likes": "3",
                    "time": "17/06/2020-22:40:14",
                    "content": "Thanks for bringing this up, I appreciate your insightful questions. Just seeing the number of ‘Likes’ this has gathered in such a short period of time lets me know this is a question that many in the community have. So all Feeds are expected to run the Oracle client omnia. For prices omnia utilizes a tool called setzer. The Data Models that Maker Governance ratifies as part of Collater Onboarding and Oracle Onboarding processes are implemented within setzer. So for example, Infura is not just determining the ETH price on its own, it’s utilizing setzer which is embedded with the ratified Data Model for ETHUSD. So you are absolutely correct in saying that the vote is essentially evaluated on “do I trust this entity” (to not provide their own self-serving price). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/06/2020-02:45:35",
                    "content": "Hi @Andy_McCall I would answer that this is not only a light feed question from the outcome we should look for like you say, if you don’t ask question somehow or anyhow in keeping a open mind, here one of the things we need to consider and be aware of is that there will have a spectacular evolution on the blockchain during the on going year, currently in all of these sub-contractor each of his own have some particularities, But Gitcoin to me is by far the greatest in any way. Gitcoin is the like the reserved federal bank, a privileged access to some of the most talented engineer that build “The Things”, Having a sector from a branch that understands the source code, that can take care of the source code, that can modify the source code, is more than just an attribution that most of the exchange doesn’t have. One more things we would need to consider, is the diversification. Gitcoin and his team did build a diversified ecosystem with double encryption variante key, just to mention this, combined with multiple private nodes on the blockchain, that can be either private, and then still be in cooperation with the other nodes, I am talking about the different Network available that many company use now. My point of view is some one or a group of user that is offering a product, is able to fully manage his product from the blueprints to conception and realisation, commercialisation, is better than just a simple exchange. A clear and precise point on your question is, group like Gitcoin or master @owocki , can extract price from the blockchain in Realtime because they build the blockchain, provide a open-source code already from their realisation, witch is a must in a case like this one for transparency references, i think it certainly help. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.40332512315271
                }
            ]
        }
    ]
}