{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-6-makerdao-shop-core-unit/7456",
            "title": "\\xf0\\x9f\\x9a\\x80 Core Unit Launch Pod Sessions ||| Session #6: MakerDAO Shop Core Unit ",
            "index": 7456,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "core-unit",
                "public-call",
                "pubcall-:-cu-launch-pod",
                "maker-shop"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "6",
                    "time": "12/04/2021-17:47:33",
                    "content": "       Core Unit Launch Pod Sessions ||| Session #6: MakerDAO Shop Core Unit Hello, everyone. For the 6th CULPS we’ll be joined by Coulter Mulligan (@coulter) and Mike Porcaro (@MakerMikeP), who’ll be talking about their proposed Core Unit (currently in Formal Submission) MDS-001: MakerDAO Shop. Here’s the relevant forum posts:  MIP39c2-SP6: MakerDAO Shop Core Unit, MDS-001 MIP40c2-SP6: MakerDAO Shop Budget, MDS-001 MIP41c4-SP6: MakerDAO Shop Facilitator Onboarding, MDS-001  @juan will be doing the hosting  Join us! It’s free!  When Time in your local-timezone format: 2021-04-13T15:00:00Z  Where When the time is ripe, follow this Zoom link  Or use this information:  Meeting ID: 829 4277 3725 Passcode: COREUNIT Find your local number: Zoom International Dial-in Numbers - Zoom  attn: @LongForWisdom, @juan, @elihu, @Prose11, @flipflopflapdelegate , @g_dip , @tadeo , @amyjung , @iammeeoh,@Jenn , @MarianoDP, @Matthew_Cooper , @Planet_X x, @mrabino1 ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp6-makerdao-shop-core-unit-mds-001/6827",
                        "https://forum.makerdao.com/t/mip40c2-sp6-makerdao-shop-budget-mds-001/6829",
                        "https://forum.makerdao.com/t/mip41c4-sp6-makerdao-shop-facilitator-onboarding-mds-001/6828",
                        "https://www.youtube.com/watch?v=cd4-UnU8lWY",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-april-9-15-2021/7510"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#3",
                    "likes": "2",
                    "time": "12/04/2021-23:19:50",
                    "content": "Very interested to know why a (de) Central Bank needs a “swap shop” to sell baby clothes and cell phone covers. Does anyone else think that makes us look silly? Swap shops are more for selling makeup or underwear on Instagram, not for directing the marketing of complicated financial services to retail consumers. This whole approach just seems ill-fit for DeFi and a better fit for some lifestyle and wellness channel on YouTube where people sit around drinking kale and buckwheat shots. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.513888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "4",
                    "time": "12/04/2021-23:27:53",
                    "content": "I disagree. Swag shops are great for branding/marketing. Having MKR or DAI users wearing DAI/MKR branded accessories in the real world starts conversations and creates more awareness. This also costs us nothing so there is literally no downside. Most every other protocol has branded accessories so it’s not ill-fitted to DeFi. It’s a great idea. Lot’s of us want Nik’s hat, now we can finally get it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.910714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#5",
                    "likes": "1",
                    "time": "12/04/2021-23:33:52",
                    "content": "Aaron – should the DAO be spending time and money on baby gear and hats? Relying on “awareness” is a false prophet – sure, it was great handing out t-shirts at conferences but what kinda of long term engagement will that get the DAO. And what are we focused on, selling hats with “cool” logos or seeing Maker integrated by Fortune 100 financial institutions world wide? Long-term priorities dictate that we focus on real potential, not selling swag (and barely making any money for it). A waste of time and effort. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#6",
                    "likes": "1",
                    "time": "12/04/2021-23:37:52",
                    "content": "We’re not spending any time on it. It’s a couple guys who are giving 50% of the profits to the DAO for the rights to use branding. Those guys are bringing what value they can to the DAO and probably wouldn’t be onboarding millions to Maker if they weren’t doing that so I’m not sure where you’re getting this “waste of time” thing from. This thing is decentralized and anyone can come along and contribute how they see fit. If MKR holders see it as a “waste of time” then they can vote against it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "1",
                    "time": "13/04/2021-00:46:02",
                    "content": "I doubt it’ll be material to Maker, but I would encourage the Shop folks to contact me about possible collaboration on social media. If they can provide the right angle, I can at least get them some free advertising to start off with. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.419047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#8",
                    "likes": "0",
                    "time": "13/04/2021-08:24:54",
                    "content": "@Tosh9.0 , @Aaron_Bartsch , I agree with you both. I think that these initiatives should happen at some level, but I’m less sure about every single vendor forming a Core Unit. I would prefer that either an existing Core Unit takes over this “agreement”, or a new one is formed so that it can look for more partners, cover different geographical areas, re-negotiate when necessary. I don’t think that the MKR Governance should be examining each single agreement we have. If we’re using @SebVentures Real World Finance to proxy all the agreements with these assets, shouldn’t we do something similar for these things? @Nadia ? @Kathleen ? Any take on this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.513419913419914
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#9",
                    "likes": "1",
                    "time": "13/04/2021-08:52:26",
                    "content": "Swag shop has excellent potentials as it will probably include NFTs, which is becoming popular and can be very profitable in the long run. It would make sense to fall under the Strategic Marcomms. However, it is a unit that @MakerMikeP and @Coulter have put together. I would like to hear what they think about this. If it is a choice between Growth and Strategic Marcomms, it would naturally fall under Strategic Marcomms. Edit: More details are added to reflect my view on this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#10",
                    "likes": "2",
                    "time": "13/04/2021-09:46:13",
                    "content": "    Kathleen:  It would make sense to fall under the Strategic Marcomms.   No please. Unification of Core Units, unless it’s clearly the most efficient and cost-effective way to go by far, is not desirable. Strategic Marcomms (if approved as a Core Unit) will be 100% able to communicate and interact with the MakerDAO Shop Core Unit (if approved), and independently discuss and agree on ideas/strategies.     Aaron_Bartsch:  We’re not spending any time on it. It’s a couple guys who are giving 50% of the profits to the DAO for the rights to use branding. Those guys are bringing what value they can to the DAO   I totally agree with this. We should promote the spawning of these initiatives without forcing them under the umbrella/control/direction of other Core Units.     Tosh9.0:  Does anyone else think that makes us look silly?   If this will eventually make us look silly, we can just stop the Core Unit and halt the activity (related to MakerDAO at least). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8977272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "0",
                    "time": "13/04/2021-09:51:49",
                    "content": "I am not sure if I will be able to attend the call, today (@juan , @blimpa ). If I am not there, could somebody please ask the following question: Question:  Assume the Core Unit is approved and has been successfully running for a while   Further assume that at some point, for whatever reason, MakerDAO decides that is it not appropriate anymore to have this Core Unit run the shop (and use the MakerDAO logos etc).  how would a “stop of activities” work? How many months of notice would you need before closing (assuming you’d agree to halt). Would you agree to stop using the Logos/etc, if that is the case? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#12",
                    "likes": "0",
                    "time": "13/04/2021-12:56:22",
                    "content": "You’re not getting it, Aaron (big surprise /s). MakerDAO’s product is unregulated financial services marketed to “anyone” (apparently, including babies). It doesn’t matter that the time is minimal – selling “swag” for any of this stuff is irresponsible. And yes, as you point out Maker is “decentralized” and “anyone can come along and contribute”. Still, however, that doesn’t mean that every looney tune idea that comes down the pipe should be celebrated and cheered into the rafters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.879960317460317
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#13",
                    "likes": "4",
                    "time": "13/04/2021-14:43:09",
                    "content": "    Tosh9.0:  You’re not getting it, Aaron (big surprise /s).   I thought we were nicely moving towards a convergent point in the discussion. If you alienate @Aaron_Bartsch , he won’t be so open to a conversation anymore. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#14",
                    "likes": "0",
                    "time": "13/04/2021-16:02:31",
                    "content": "Although we could use those products for our partners, running a shop is out of our scope. If the shop is an independent “all-crypto swag store” and we treat it as a partner who integrates Maker’s brand -and you can pay with Dai-, in that case, we could make a formal agreement with them ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#15",
                    "likes": "3",
                    "time": "13/04/2021-16:13:55",
                    "content": "Hey @Tosh9.0, wanted to step in and remind everyone to try to observe the basic rules of Social Decorum. While disagreement and challenging ideas is an important part of the DAO, it’s important that it’s the ideas that are being prodded as personal insults do not encourage debate. I encourage you to continue to engage with this topic, but let’s focus on the merits of the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#16",
                    "likes": "0",
                    "time": "13/04/2021-17:20:56",
                    "content": "Prose – I focused on the merits and have always been respectful in my tone (unfortunately that courtesy has not always been repaid). At some point in time, this community needs to stop being so fragile to criticism — half the time it’s like walking on eggshells with the amount of sensitivity and condescending remarks (like the ones you just gave me). Let’s focus on substance and avoiding subtle forms of censorship (complaining about people’s “tone,” for one) going forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#17",
                    "likes": "1",
                    "time": "13/04/2021-17:23:41",
                    "content": "Relevant to some of this, I brought up my concerns from the call:     MIP40c3-SP6: MakerDAO Shop Budget, MDS-001 Formal Submission   MIP40c3-SP6: MakerDAO Shop Budget, MDS-001  Preamble MIP40c3-SP#: 6 Author(s): Coulter Mulligan & Mike Porcaro Contributors: Status: Request For Comment (RFC) Date Applied: 2021-03-03 Date Ratified:   Specification  Motivation Remuneration for the MakerDAO Shop   Core Unit Name MakerDAO Shop Core Unit   List of Budget Implementations None.  However, there will be a 50/50 split in MakerDAO Shop profits, meaning that the Protocol will be paid from the MakerDAO Shop Core Unit.   Budget Breakdown /…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#18",
                    "likes": "2",
                    "time": "13/04/2021-17:38:54",
                    "content": "Well looks like I missed the mark as I didn’t want any of my comment to seem condescending or even suggest censorship. I felt the comment toward Aaron was sarcastic and merely wanted to reiterate @juan in saying that if you want to convince people of your point of view, attacking the intelligence of someone engaging with you and calling this proposal a “looney tune idea” isn’t the most constructive way to go about that. To your point about the “need” for this type of thing in DeFi, it’s definitely a value judgement. From my end things like Unisocks show the powerful effect some swag plus a bit of marketing can have. That is to say, we wouldn’t be the first DeFi project exploring the use of swag and I think this proposal was made in good faith. You clearly don’t agree with the effectiveness of this and that’s super valuable feedback, but will likely fall on better ears without the personal attacks. I am genuinely curious what place you think marketing should have as we go forward without the Foundation, that insight would probably inform some of the opinions you’ve shared on this thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9226190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#19",
                    "likes": "2",
                    "time": "13/04/2021-18:09:55",
                    "content": "Here’s the replay! Core Unit Launch Pod Sessions - Session #6: MakerDAO Shop Core Unit, April 13, 2021 - YouTube ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#20",
                    "likes": "2",
                    "time": "13/04/2021-18:10:22",
                    "content": "    Tosh9.0:  Prose – I focused on the merits and have always been respectful in my tone (unfortunately that courtesy has not always been repaid). At some point in time, this community needs to stop being so fragile to criticism — half the time it’s like walking on eggshells with the amount of sensitivity and condescending remarks (like the ones you just gave me). Let’s focus on substance and avoiding subtle forms of censorship (complaining about people’s “tone,” for one) going forward.   Did you just complain about condescending remarks while saying that we need to stop being so fragile? Make up your mind so I can decide if I agree with you? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#21",
                    "likes": "2",
                    "time": "13/04/2021-19:25:11",
                    "content": "    prose11:  From my end things like Unisocks show the powerful effect some swag plus a bit of marketing can have.   Totally agree with you here–as an example–on the other side of the Blockchain world–Solana has a protocol called Mango (yup just like the fruit). They recently ran a wanna-be Unisocks NFT thingy–except it’s a baseball caps/hats with a Mango Logo–they got sales up as high as 3,500 DAI at one point:  image372×551 43.5 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#22",
                    "likes": "1",
                    "time": "13/04/2021-19:36:10",
                    "content": "I agree the idea in general has merit. But there needs to be a lot more thought in how to structure this. I would feel far more comfortable if some in-the-weeds concerns were addressed first, since it’s not clear to me what this relationship is supposed to be except the DAO providing a desirable URL and also probably being the proposed CU’s largest customer (for convention swag). I’m worried about the appearance of self-dealing on a couple different fronts, and for no real control over branding since we can’t license MakerDAO’s logo and brand. It just also generally seems like a lot of work to oversee for the minor financial potential compared to our actual core business of becoming the reserve currency of the blockchain. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#23",
                    "likes": "1",
                    "time": "14/04/2021-18:14:19",
                    "content": "  Core Unit Launch Pod Sessions ||| Session #6: MakerDAO Shop Core Unit  Agenda   00:00: Intro with Juan Guillén  00:45: MakerDAO Shop Core Unit with Coulter Mulligan and Mike Porcaro   Video https://www.youtube.com/watch?v=tAYAgxMuiko  Introduction  Juan Guillén  Agenda and Preamble  Hi, everyone. Welcome to the CULPS #06. Today we have the MakerDAO Shop, MDS-001. The two guys proposing this are Coulter Mulligan and Mike Porcaro, and they will be explaining what they are trying to achieve and hopefully answering all our questions. For more episodes of the series, follow this link    Presentation  MakerDAO Shop Core Unit with Coulter Mulligan and Mike Porcaro (00:45)  1920×1080 103 KB   1920×1080 68.3 KB   1920×1080 115 KB   1920×1080 65.7 KB   1920×1080 77.6 KB   1920×1080 76.2 KB   1920×1080 73.2 KB   1920×1080 71 KB   1920×1080 73.9 KB   1920×1080 121 KB   12:07 — Andrew Burban: I like this idea of no funding requiered from the DAO, that it’s all self-funded. I do think you should vest a little bit — maybe a portion of the profits, 5%, 10% goes into vesting back to you   13:27 — Juan Guillén: Let’s say that Nadia’s team is organizing some kind of event in Colombia next year and they need one hundred t-shirts or something. Would that be the retail price or would they have access to a special price or we’ll see it on a case-by-case basis…?   15:06 — Payton Rose: What does it mean to you to be a Core Unit? Further down the line, more ideas for merchandise come… Do you see yourselves trying to incorporate them, staying independent…?   18:04 — Juan Guillén: Guys, I hear that you’re speaking a lot about profit in the proposal. Let’s say a t-shirt costs US$10 to produce. What would be your suggested retail price? How much profit would we be looking at?   20:28 — Juan Guillén: I’ve usually be warned against going into partnerships where you share the profit and not the revenue, because it’s extremely easy to just make up costs. So potentially you could say “Yeah, we need to invest on this, we want to put a store on this, we want to pay ourselves salaries”, and then there’s no more profit to share. So even if you say that instead of 50% of the profit  you’ll share 20% of the revenue, at least it’s a number that can be very easily measured and it’s harder to manipulate   22:49 — LongForWisdom asks a question in the chat about shipping   23:23 — Planet_X: I have a question — or rather a comment about the website shop.makerdao.com. You want this website permanently. Some in the community might not be entirely comfortable with that. You could turn that thing into anything. If it has the MakerDAO.com name on it, I think a lot of people would want to own it. You could have the rights to the site for a number of years, but the name shop.makerdao.com belongs to MakerDAO   24:44 — Planet_X: I have a comment regarding the 50-50 profit sharing. Part of what you’re selling here is that the community doesn’t really have to get involved, but with a profit sharing someone at some point needs to go to your books and look into your numbers. Would it be possible to add a fixed fee…? Let’s say you sell a t-shirt for US$20, and then US$1 or US$2 is just a fixed fee to MakerDAO. Because then you would just have to set up the website…   27:03 — Juan Guillén: There’s some topics that I would like to discuss, especially concerning the exclusivity and potential stop of activities. This brings me to one central point that we may want to touch upon later… While this may sound like a great idea, and maybe it is… I don’t if I am personally in measure of actually evaluating this, and I’m almost sure that most MKR Holders don’t want to. So that’s why I saw this more of as a kind of agreement between some Core Unit that deals with this type of things, and they can discuss with you and potentially other people and say “Hey, this is great. We’re doing the due diligence, we evaluate these guys…” — so it’s more like the same way we are delegating to Séb for Real-world assets…   33:20 — PaperImperium: My questions are: first, where does the MakerDAO logo, swag, artwork, and stuff… where does that IP reside now? And secondly, anything that’s cooked up for this, whether your relationship to the DAO would — should any ties be severed in the future, where would those designs for t-shirts, mugs, whatever, where would they go? Because if it’s classified as a work for hire, it would reside with whatever legal entity is doing business on behalf of MakerDAO, whereas if it’s just a straight-up licensing agreement, it would probably reside with the artists, though of course it would also include intellectual  property that belongs to MakerDAO   38:12 — The one concern that comes up to me is that, if the Maker logo intellectual property is open-source, this doesn’t grant us control of messaging with the brand; but at the same time association with us… the big thing that we are offering you is a competitive advantage, however big or small it may end up being with the use of the URL… Seems like perhaps it might be better for you just to rent the URL from us rather than go through all this and have a more at-arm’s-lenght relationship rather than try to make this a Core Unit, since it doesn’t grant us any additional messaging power if anybody with an etsy shop is free to set up their own swag   39:36 — Payton Rose: I was wondering if you had any numbers of revenue or profit from the time operating under the Foundation   42:16 — Discussion around what should and what should not be a Core Unit ensues   46:15 — LongForWisdom: I think people will be understanding of stuff like this. If you get signed up as a Core Unit now, and later it turns out that it probably falls below the threshold of what makes sense as a Core Unit, I think people will be understanding and you’ll just get shuffled into a different structure but will remain the same   48:27 — iammeeoh: I have one question that I think it’s related to what you were discussing: What if we vote for this Core Unit to be formed and to run but we change our mind in one year or six months? What about your business? Would you accept to stop selling merchandising about Maker or with a logo of Maker…? Basically to stop the business. Would you ask us for a time frame of six months of notice before asking you to stop?   50:11 — Payton Rose: This proposal is kind of unique in that you’re proposing no funds from the DAO, so I guess initially there wouldn’t be that kind of automatic retesting or reevaluation phase. I think that could be some valuable feedback, just say “hey, let’s either put this up for vote or have a community report”, or do something six months out as a retrospective   51:28 — PaperImperium: Maybe we can just come up with a nice fixed rate, make it easier for everybody… I mean, there’s nothing wrong with having an official shop, but it seems like if we can’t grant you an exclusive license, much less enforce one, that also means this is much less of a symbiotic relationship and more of just a straight up licensing deal…   54:23 — iammeeoh: I think the idea of the Core Unit originally was, you know, you have some contributors that do something for MakerDAO and you want to structure this group of contributors in a way that’s scalable, so the people inside this Core Unit work and they are coordinated by this Facilitator who is in charge of communicating with Governance. That’s the general idea. Everybody is free t do whatever they want in the ecosystem of Ethereum, of DeFi, of MakerDAO. It’s not a partnership, basically   56:15 — Andrew Burban: I want to look back around to the idea of the marketing… Is there going to be a maketing Core Unit? I guess there is none right now. This could maybe be like the subsidiary of the marketing team. I do like the idea of this being a Core Unit. Maybe this would be a subdivision of what marketing is rather than looking for a rent relationship…   Outro  Juan Guillén Mike and Coulter, where can people find you if they want to give you feedback or get in touch with you? (58:46). Thank you for coming.   Credits @blimpa produced this summary. Everyone who spoke and presented on the call, listed in the headers. ",
                    "links": [
                        "https://youtu.be/tAYAgxMuiko?t=45",
                        "https://www.youtube.com/watch?v=tAYAgxMuiko",
                        "https://forum.makerdao.com/tag/culps",
                        "https://youtu.be/tAYAgxMuiko?t=45",
                        "https://youtu.be/tAYAgxMuiko?t=727",
                        "https://youtu.be/tAYAgxMuiko?t=817",
                        "https://youtu.be/tAYAgxMuiko?t=906",
                        "https://youtu.be/tAYAgxMuiko?t=1084",
                        "https://youtu.be/tAYAgxMuiko?t=1228",
                        "https://youtu.be/tAYAgxMuiko?t=1369",
                        "https://youtu.be/tAYAgxMuiko?t=1403",
                        "https://youtu.be/tAYAgxMuiko?t=1484",
                        "https://youtu.be/tAYAgxMuiko?t=1623",
                        "https://youtu.be/tAYAgxMuiko?t=2000",
                        "https://youtu.be/tAYAgxMuiko?t=2292",
                        "https://youtu.be/tAYAgxMuiko?t=2376",
                        "https://youtu.be/tAYAgxMuiko?t=2536",
                        "https://youtu.be/tAYAgxMuiko?t=2775",
                        "https://youtu.be/tAYAgxMuiko?t=2907",
                        "https://youtu.be/tAYAgxMuiko?t=3011",
                        "https://youtu.be/tAYAgxMuiko?t=3088",
                        "https://youtu.be/tAYAgxMuiko?t=3263",
                        "https://youtu.be/tAYAgxMuiko?t=3375",
                        "https://youtu.be/tAYAgxMuiko?t=3526"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.992919931685754
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#24",
                    "likes": "1",
                    "time": "15/04/2021-19:18:40",
                    "content": "Real talk! If “Skale” can have a SHOP–why can’t Maker have one?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-12-strategic-marcomms-core-unit-cpm-001/8552",
            "title": "\\xf0\\x9f\\x9a\\x80 Core Unit Launch Pod Sessions ||| Session #12: Strategic MarComms Core Unit CPM-001 ",
            "index": 8552,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "cpm-001",
                "public-call",
                "pubcall-:-cu-launch-pod"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "10",
                    "time": "05/06/2021-22:04:02",
                    "content": " Session #12: Strategic MarComms Core Unit1280×720 84.8 KB    Core Unit Launch Pod Sessions ||| Session #12: Strategic MarComms Core Unit CPM-001 For the 12th session of CULPS we’ll be joined by @Kathleen, who’ll talk about the Strategic MarComms Core Unit CPM-001 and its brand new set of subproposals coming soon!  As usual, anyone can join and ask to their heart’s content. @juan will be doing the hosting   When Time in your local-timezone format: 2021-06-09T14:00:00Z Mark it on your Google Calendar!  Where When the time is ripe, follow this Zoom link  Or use this information:  Meeting ID: 829 4277 3725 Passcode: COREUNIT Find your local number: Zoom International Dial-in Numbers - Zoom  attn: @flipflopflapdelegate, @g_dip, @planet_x, @iammeeoh,  @mrabino1, @ultraschuppi, @wouter, @ejbarraza, @tbone, @GovAlpha-Core-Unit, @Growth-Core-Unit, @Content-Production, @MakerMikeP, @Coulter ",
                    "links": [
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/mip39c2-spx-add-strategic-marcomms-core-unit/8617/2",
                        "https://forum.makerdao.com/t/maker-relay-episode-50/8897",
                        "https://forum.makerdao.com/t/maker-relay-ep-48/8609",
                        "https://forum.makerdao.com/t/maker-relay-ep-49-en-espanol/8795",
                        "https://forum.makerdao.com/t/maker-relay-ep-49/8763",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-144-thursday-june-3-17-00-utc/8459/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-50-en-espanol/8966",
                        "https://forum.makerdao.com/t/maker-relay-ep-48-en-espanol/8636"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.822443181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/06/2021-22:59:38",
                    "content": "to the moon strategic marcomms!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#3",
                    "likes": "3",
                    "time": "07/06/2021-13:08:47",
                    "content": "We want to say thank you to those who have taken the time to meet with us and given us feedback on our updated presentation in the past two weeks. My team looks forward to sharing our new proposal with the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.715909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/06/2021-07:43:41",
                    "content": "We have just published our proposal. We look forward to sharing more in details during the call tomorrow.    MIP39c2-SPX: Add Strategic Marcomms Core Unit RFC   Preamble MIP39c2-SPX Author(s):@Kathleen Contributors: @HBJ, @AdrienDLT, Francesco Alberti, Kaori Sato, @Sahabia, Jose Vicente Status: Request For Comment Date Applied: <2021-06-8> Date Ratified: <yyyy-mm-dd>   Sentence Summary MIP39c2-SPX adds Core Unit CPM-001   Specification As part of our commitment to transparency and accountability, a list of documents related to this proposal are available for viewing and commenting in this public folder.   Motivation MakerDAO has entered its next stage …     ",
                    "links": [
                        "https://drive.google.com/drive/folders/1xCys_FwCEv5oQ-GX3EMzXfdNkB7KTApK?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#6",
                    "likes": "3",
                    "time": "09/06/2021-16:16:37",
                    "content": "     ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp14-add-strategic-marcomms-core-unit/8617/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-13-amazix-marketing-core-unit-amzx-001/8887",
            "title": "\\xf0\\x9f\\x9a\\x80 Core Unit Launch Pod Sessions ||| Session #13: AmaZix Marketing Core Unit AMZX-001 ",
            "index": 8887,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "marketing",
                "public-call",
                "pubcall-:-cu-launch-pod"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "3",
                    "time": "21/06/2021-16:58:59",
                    "content": " image1280×720 199 KB    Core Unit Launch Pod Sessions ||| Session #13: AmaZix Marketing Core Unit AMZ In this session, Mitchell Mahaffey (@Mitchel_AmaZix) and his team will be introducing the AmaZix Marketing Core Unit AMZX-001. Follow these links and peruse its subproposal set!:  MIP39c2-SP15: Adding AmaZix Marketing Core Unit, AMZX-001 MIP40c3-SP20: Adding Budget to AmaZix Marketing Core Unit, AMZX-001 MIP41c4-SP16: Facilitator Onboarding For The AmaZix Marketing Core Unit, AMZX-001  Be reminded that this is an open call. Anyone can join and participate. @juan will be the moderator   When Time in your local-timezone format: 2021-06-30T15:00:00Z Mark it on your Google Calendar!  Where When the time is ripe, follow this Zoom link  Or use this information:  Meeting ID: 829 4277 3725 Passcode: COREUNIT Find your local number: Zoom International Dial-in Numbers - Zoom  attn: @flipflopflapdelegate, @planet_x, @iammeeoh, @ejbarraza, @GovAlpha-Core-Unit, @Growth-Core-Unit, @Content-Production, @SES-Core-Unit, @Kathleen, @MakerMikeP, @Coulter, @g_dip, @AstronautThis, @PaperImperium, @Doo_StableLab ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp20-adding-budget-to-amazix-marketing-core-unit-amzx-001/8649",
                        "https://forum.makerdao.com/t/mip41c4-sp16-facilitator-onboarding-for-the-amazix-marketing-core-unit-amzx-001/8650",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=N2xqZmUxdWppY3U1ZHVpa2dhOHNhcmo2ZmggbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/maker-relay-ep-51-en-espanol/9063",
                        "https://forum.makerdao.com/t/maker-relay-ep-51/9011",
                        "https://forum.makerdao.com/t/maker-relay-ep-50-en-espanol/8966",
                        "https://forum.makerdao.com/t/participate-in-brand-research-support-marketing-efforts-for-makerdao/9341/3",
                        "https://forum.makerdao.com/t/maker-relay-episode-50/8897"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "2",
                    "time": "21/06/2021-17:01:23",
                    "content": "Should this be June 31? It says 13  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#3",
                    "likes": "2",
                    "time": "21/06/2021-17:20:01",
                    "content": "Grrr! Thank you  (It’s Wednesday 23 actually.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#4",
                    "likes": "1",
                    "time": "23/06/2021-15:00:41",
                    "content": "Hi, everyone. Unfortunately some key speakers from AmaZix cannot make it. I’ll follow up and let you know about the new date / time. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.857954545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#5",
                    "likes": "2",
                    "time": "23/06/2021-15:10:51",
                    "content": "New time: 2021-06-30T15:00:00Z attn: @blimpa ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/oldpaul",
                    "index": "#6",
                    "likes": "1",
                    "time": "23/06/2021-18:36:30",
                    "content": "Thanks, Juan, and sorry for not being able to attend today with the complete team. For those of you who haven’t seen it yet, we added two posts today that will be very relevant to the meeting:     MIP39c2-SP15: Adding AmaZix Marketing Core Unit, AMZX-001 RFC       AmaZix has received a lot of feedback regarding our Marketing Core Unit proposal submitted on June 9th. While we have engaged in discussion about some of these items, we have taken all of this feedback seriously and are in the process of making significant modifications to our original proposal. We expect to release that proposal early next week. But we want to take this opportunity to provide a preview of some of the enhancements you will see soon.  Instead of focusing on historic accomplishmen…         MIP39c2-SP15: Adding AmaZix Marketing Core Unit, AMZX-001 RFC       Dear all,  we would like to spend few words regarding AML provisions in a decentralized context.  Who’s writing had the chance to work in DAO and blockchain since 2012. We personally followed THE DAO case and the mayhem originated by “The Attacker” and the ensuing Ethereum hard fork.  As probably already highlighted in this chat and well known, the whole architecture of decentralized organization and cryptocurrencies is intended to remove middle man and make transactions permissionless.  Governm…     Looking forward to next week’s call! Best regards Paolo ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp15-adding-amazix-marketing-core-unit-amzx-001/8647/69"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5680555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#7",
                    "likes": "2",
                    "time": "30/06/2021-02:39:20",
                    "content": "Hey, what is everyone’s opinion about having an editorial style summary posted for these Launch Pod sessions? Do you see that as something people would utilize? Thoughts and ideas, please. Also, if there are other meetings/calls that people would like to have editorial or semi-transcribed posts, let me know. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "1",
                    "time": "30/06/2021-15:56:51",
                    "content": "Yes , please–that would be neat–will be helpful. Lately I missed a few of these as I being doing summer traveling–and I bet others in the community will be doing the same. TY in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#10",
                    "likes": "0",
                    "time": "30/06/2021-16:40:28",
                    "content": "@ElProgreso Would be our pleasure =) I am thinking something like an editorial style; screenshots with short transcriptions accompanying them. And then a more in-depth transcription for any Q&As. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#11",
                    "likes": "2",
                    "time": "30/06/2021-19:31:52",
                    "content": "     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#12",
                    "likes": "0",
                    "time": "01/07/2021-15:37:44",
                    "content": "Update: I am holding off on this for a few days as we started testing some new AI transcription apps and services. We are hoping to improve a workflow that is more budget-friendly and maintains high-quality production. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7272727272727275
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-2-governance-alpha-core-unit/6847",
            "title": "\\xf0\\x9f\\x9a\\x80 Core Unit Launch Pod Sessions ||| Session #2: Governance Alpha Core Unit ",
            "index": 6847,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "core-unit",
                "gov-001",
                "launching-pod",
                "public-call",
                "pubcall-:-cu-launch-pod"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "5",
                    "time": "04/03/2021-15:41:52",
                    "content": "       Core Unit Launch Pod Sessions ||| Session #2: Governance Alpha Core Unit In this session @LongForWisdom will be telling us about Core Unit GOV-001: GovAlpha, its budget, its personnel-to-be (@Prose11, @elihu, and @blimpa will be there too (or we’ll try)), and going as deep on its details as – well, as your questions demand. It’s gonna be a moderated open mic evening and you’re all invited to join us with your inquires. Bring your curiosity!     When Time in your local-timezone format: 2021-03-10T18:00:00Z  Where When the time is ripe, follow this Zoom link  Or use this information:  Meeting ID: 829 4277 3725 Passcode: COREUNIT One tap mobile +13017158592,82942773725#,*46651499# US (Washington DC) +13126266799,82942773725#,*46651499# US (Chicago) Dial by your location +1 301 715 8592 US (Washington DC) +1 312 626 6799 US (Chicago) +1 346 248 7799 US (Houston) +1 646 558 8656 US (New York) +1 669 900 9128 US (San Jose) +1 253 215 8782 US (Tacoma) Meeting ID: 829 4277 3725 Passcode: 46651499 Find your local number: Zoom International Dial-in Numbers - Zoom  attn: @LongForWisdom, @juan, @elihu, @Prose11, @flipflopflapdelegate , @g_dip , @tadeo , @amyjung , @iammeeoh , @Gustav_Arentoft, @Jenn , @MarianoDP, @Matthew_Cooper , @Planet_X ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp3-governance-core-unit-gov-001/6348",
                        "https://forum.makerdao.com/t/mip40c2-sp3-core-unit-budget-gov-001/6349",
                        "https://forum.makerdao.com/t/mip41c4-sp3-core-unit-facilitator-onboarding/6350",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-132-thursday-march-11-17-00-utc/6859/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-36-en-espanol/7053",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-12-18-2021/7089",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-5-11-2021/6978",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-131-thursday-march-4-17-00-utc/6737/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/20",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-131-thursday-march-4-17-00-utc/6737/10",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-1-4-2021/6848",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-133-thursday-march-18-17-00-utc/6982/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.136363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/03/2021-15:42:58",
                    "content": "So pumped  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/03/2021-17:17:08",
                    "content": "I got one for Alpha right away. It is about aligning of compensation for the various Core Units. It is fully OK that they are not the same and so on but I feel we as a community should try to make it not too crazy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.185714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/03/2021-17:26:34",
                    "content": "Very excited for the podcast! I’m sure we’ll have some great discussions! @Planet_X, are you able to elaborate? What stands out to you? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.109375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "0",
                    "time": "10/03/2021-17:58:49",
                    "content": "Starting soon!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#6",
                    "likes": "3",
                    "time": "11/03/2021-09:26:58",
                    "content": "I’d like to thank @juan for organizing this engaging session, @Longforwisdom for a great presentation, and everyone who showed up and participated in the discussion! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#7",
                    "likes": "3",
                    "time": "23/03/2021-14:09:16",
                    "content": "  Core Unit Launch Pod Sessions ||| Session #2: GovAlpha Core Unit Agenda   00:00: Intro with Juan Guillén  00:43: Governance Alpha Core Unit with LongForWisdom (@LongForWisdom)  Video https://www.youtube.com/watch?v=CMf1F8HKYpM Introduction Juan Guillén Agenda and Preamble  Hello, everyone. Today we have the Governance Alpha Core Unit, so we have LongForWisdom with his team and they will be presenting the mandate, what they are planning to achieve, budgets, and personnel-to-be. For more episodes of the series, follow this link   Presentation GovAlpha Core Unit with LongForWisdom (00:43)  GovAlpha Core Unit Introduction1920×1080 67.3 KB   Mandate1920×1080 157 KB   05:30 — Juan Guillén: How do you see neutrality? Is it more like making sure that all the possible points are covered in a discussion, potentially taking sides that you don’t agree with, or is it more like making sure that everyone’s voice being heard?   06:59 — Juan Guillén: How would you think that things would work if there were no governance facilitation?   08:10 — David Utrobin: Do you think that Governance Facilitators have a duty to bring up the things about certain proposals that might be hidden from the author? Should Facilitators try to surface obvious issues in whatever might be overlooked by the community?   09:26 — Amy Jung: You speak a lot about current processes and I’m wondering if there’s an aspect of the mandate that has to do with new processes or even about improving the current governance process, may that be something small or it could be drastically different.   Team Structure1920×1080 138 KB   13:38 — Juan Guillén: When you say Facilitators, potentially that means that the MKR holders will vote them to also be part of this core unit as Facilitators, right?   14:01 — Juan Guillén: How would you try to make sure that the quality is there for a contributor to become a Facilitator? And once that’s done, how do you see them to be ready to be a Facilitator?   15:42 — Juan Guillén: You’re going to be aiming for three Facilitators. It’s probably ideal to have an odd number of Facilitators for agreement reasons. But in the case that there are two or four or something, do you have a formal process for Facilitator decision-making within the Facilitators?   Team Membership1920×1080 118 KB   19:47 — Juan Guillén: Do you potentially see, like, hiring more people or getting more people to contribute, or do you think that this would be a pretty solid team for what you need in the short term?   21:04 — David Utrobin: Do you see a world where you would have the full-time MIP Editor or somebody from the GovAlpha team look over the entire MIPs cannon and make proposals around ways to make things more efficient et cetera? Does your core unit cover those kinds of projects?   Quarterly Focus1920×1080 170 KB   25:23 — Juan Guillén:    26:30 — Tim Black: I’m curious about the operational manual. The forum itself is a bit of an intimidating place to onboard through. Do you envision that being adjacent to the forum or…?   27:47 — Frank Cruz: With regards to SourceCred and incentives to keep people motivated, how do you plan on dealing? Is that a job for you as far as keeping the community members focused and not burnt-out?   30:28 — Juan Guillén: I want to echo what Amy was saying in the chat, that sometimes people have a hard time navigating the governance of Maker, or the community. It’s not very evident since the structure is very flat compared to other hierarchical models.   31:39 — What does your team foresee as far as streamlining the whole governance process? Is that something you are going to push for? Are you going to make a push for automating governance this way?   34:06 — Frank Cruz: And how close have you come to choosing another Governance Facilitator, like your Second-in-command?   Budget Breakdown1920×1080 127 KB   37:12 — Frank Cruz: I think you’re missing the health benefits and the MKR vesting options.   38:38 — Juan Guillén: Potentially you won’t need it in the next three months, but eventually you might need to cover events or offsites or something like that.   39:10 — David Utrobin: For part-time contributors, what’s your approach? Are you giving them a partial salary or are you tracking hours carefully and doing it through an hourly rate?   40:12 — David Utrobin: What kind of expectations should Maker Governance have with regards to self-reporting on progress, blockers, etcetera?   Vote on-chain now!1920×1080 105 KB   41:47 — Payton Rose: Right now it doesn’t seem to be a large need for a legal structure for the GovAlpha team, but is that something you thought about or something you can see in the future needing to take place in terms of having to pay contributors or different entities…?  Outro Juan Guillén Long, where can people find you and ask you questions directly about this? (43:19). Thanks, everyone, for coming.  Credits @blimpa produced this summary. Everyone who spoke and presented on the call, listed in the headers. ",
                    "links": [
                        "https://youtu.be/CMf1F8HKYpM?t=43",
                        "https://www.youtube.com/watch?v=CMf1F8HKYpM",
                        "https://forum.makerdao.com/tag/culps",
                        "https://youtu.be/CMf1F8HKYpM?t=43",
                        "https://youtu.be/CMf1F8HKYpM?t=330",
                        "https://youtu.be/CMf1F8HKYpM?t=419",
                        "https://youtu.be/CMf1F8HKYpM?t=490",
                        "https://youtu.be/CMf1F8HKYpM?t=566",
                        "https://youtu.be/CMf1F8HKYpM?t=818",
                        "https://youtu.be/CMf1F8HKYpM?t=841",
                        "https://youtu.be/CMf1F8HKYpM?t=942",
                        "https://youtu.be/CMf1F8HKYpM?t=1187",
                        "https://youtu.be/CMf1F8HKYpM?t=1264",
                        "https://youtu.be/CMf1F8HKYpM?t=1523",
                        "https://youtu.be/CMf1F8HKYpM?t=1590",
                        "https://youtu.be/CMf1F8HKYpM?t=1667",
                        "https://youtu.be/CMf1F8HKYpM?t=1828",
                        "https://youtu.be/CMf1F8HKYpM?t=1899",
                        "https://youtu.be/CMf1F8HKYpM?t=2046",
                        "https://youtu.be/CMf1F8HKYpM?t=2232",
                        "https://youtu.be/CMf1F8HKYpM?t=2318",
                        "https://youtu.be/CMf1F8HKYpM?t=2350",
                        "https://youtu.be/CMf1F8HKYpM?t=2412",
                        "https://youtu.be/CMf1F8HKYpM?t=2507",
                        "https://youtu.be/CMf1F8HKYpM?t=2599"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.683117275805955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "22/06/2021-20:10:03",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-7-governance-communications-core-unit/7492",
            "title": "\\xf0\\x9f\\x9a\\x80 Core Unit Launch Pod Sessions ||| Session #7: Governance Communications Core Unit ",
            "index": 7492,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "core-unit",
                "com-001",
                "public-call",
                "pubcall-:-cu-launch-pod"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "8",
                    "time": "14/04/2021-15:13:38",
                    "content": "       Core Unit Launch Pod Sessions ||| Session #7: Governance Communications Core Unit For the 7th CULPS  episode we’ll have David Utrobin (@davidutro) presenting the Governance Communications Core Unit, COM-001. You can read more about it here:  MIP39c2-SP8: Governance Communications Core Unit, COM-001 MIP41c4-SP8: Facilitator Onboarding, COM-001 MIP40c3-SP8: Modify Core Unit Budget, COM-001  Please give these subproposals a read and join us with your questions  @juan will be doing the hosting   When Time in your local-timezone format: 2021-04-19T16:00:00Z  Where When the time is ripe, follow this Zoom link  Or use this information:  Meeting ID: 829 4277 3725 Passcode: COREUNIT Find your local number: Zoom International Dial-in Numbers - Zoom  attn: @LongForWisdom, @elihu, @Prose11, @flipflopflapdelegate , @g_dip , @tadeo , @amyjung , @iammeeoh, @Jenn , @swakya, @Planet_X, @mrabino1, @Nadia, @Haiku, @wouter, @seth, @gala ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp8-governance-communications-core-unit-com-001/7009/4",
                        "https://forum.makerdao.com/t/mip41c4-sp8-facilitator-onboarding-com-001/7011/2",
                        "https://forum.makerdao.com/t/mip40c3-sp8-modify-core-unit-budget-com-001/7010",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-april-9-15-2021/7510"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#3",
                    "likes": "2",
                    "time": "21/04/2021-10:33:28",
                    "content": "Watch the replay Core Unit Launch Pod Sessions - Session #7: Governance Communications Core Unit - YouTube ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#4",
                    "likes": "2",
                    "time": "21/04/2021-15:51:12",
                    "content": "  Core Unit Launch Pod Sessions ||| Session #7: Governance Communications Core Unit  Agenda   00:00: Intro with Juan Guillén  00:44: Governance Communications Core Unit with David Utrobin (@davidutro)   Video https://www.youtube.com/watch?v=tAsLQwxKLyE  Introduction  Juan Guillén  Agenda and Preamble  Welcome, everyone. Today we’re hosting another Core Unit Launch Pod, and we are in session #7. My name is Juan and I have the pleasure of having here David Utrobin. He will be telling us everything about the Governance Communications Core Unit and how he plans to bring more… I’m out of words, David, so I need your help on this one. For more episodes of the series, follow this link    Presentation  Governance Communications Core Unit with David Utrobin (00:44)  1920×1080 110 KB   1920×1080 91.9 KB   1920×1080 148 KB   1920×1080 88.8 KB   1920×1080 74.2 KB   1920×1080 112 KB   1920×1080 118 KB   1920×1080 125 KB   1920×1080 105 KB   1920×1080 113 KB   1920×1080 80.3 KB   1920×1080 108 KB   1920×1080 99.4 KB   1920×1080 111 KB   1920×1080 112 KB   1920×1080 130 KB   19:34 — Frank Cruz: I have a question with regards to public communications. Do you envision working with a legal Core Unit or a general counsel Core Unit when it comes to putting out public disclosures? Or is that something that the communication teams can take on their own?   29:40 — Frank Cruz: If regulation comes into fruition one day and, say, your team has to file something similar to what public companies do, which is a 10-K, if you had to file something crazy like that in the future, is that something you would handle or is that something that the legal teams have to handle?   21:58 — Frank Cruz: When it comes to emergency response, how would your team handle something like what happened on Saturday night Eastern Time, early morning in Europe, that big sell-off? Is that something that the emergency portion of your Core Unit would come out and say “Hey, so-and-so number of votes got liquidated, everything looks good…”?   24:15 — Frank Cruz: This is just a small example, what happened this Saturday night. I think the OSM was delayed, it wasn’t changing, and Nick had to tweak it a bit and get it going right because the price wasn’t updating. I guess that’s something you wouldn’t get on Twitter in the middle of the night and say “We are tweaking the OSM. One-hour delay. We’ll let you know when it’s back up and running”. Is that something your team doesn’t do?   26:20 — Juan Guillén: Maybe to follow a little bit on what Frank is doing, obviously this Core Unit is supporting other Core Units, and that’s great. Is there something you would say “This we own and it’s only our Core Unit that will do it in a vacuum”, or pretty much everything is a little bit cross-functional?   28:20 — Elihu: I’m glad to see that you’ve added the voter engagement part into your mandate and I would love to hear more about it, whether you’re planning any specific action on this subject or if it’s still in the planning phase   30:15 — Elihu: In terms of reaching out to a wider base of voters, are you planning on opening any new channels or are you sticking to the existing ones?   31:42 — Juan Guillén: I have a question about the roadmap. I was wondering if you have a very high-level plan that you were thinking about sharing it or you were going more like “Let’s see if we get voted, and if the DAO wants us to do the job we’ll start working on that”   35:40 — Payton Rose: As a Facilitator, David, do you have a particular philosophy? How do you see yourself operating and running this Core Unit in terms of growing it for the future and keeping it on track?   39:09 — Nadia Álvarez: I don’t know if it’s possible, but it would be amazing if you could include information from other DAOs, if other DAOs are talking about Dai, about Maker, if we have to be aware of something, that will be super awesome. I don’t know if you have considered that. The other thing is that last week we had this little issue with Coinbase custody, so the Maker Holders that had MKR in Coinbase custody couldn’t vote. It would be great if your Core Unit could manage these third parties who are involved in the process of voting, because communicating is related to different things, not just telling anyone what’s happening but also anticipating to this kind of events. So if we are close to a date where everyone has to vote, talk to Coinbase custody or other custody solutions to see if their system is working well and if we can help them in some way. That’s my suggestion for your Core Unit   45:46 — Frank Cruz: Following up on Nadia’s point, how do you envision your work with delegators? That’s going to be something that’s going to soon take off, I hope   47:06 — Frank Cruz: I guess one day you see yourself reporting why five delegates went one way and seven went the other way… They can communicate through you and push their narrative to the left or to the right   48:18 — Frank Cruz: I saw that Artem is the full  project manager. Artem, are you going to be doing lunch meetings once the pandemic is over and inviting stakeholders over?   51:31 — Juan Guillén: You mentioned that you’re a proactive person. Can you give examples of situations where you were proactive and you initiated things and made them happen?   53:43 — Juan Escallón: I have a question regarding legal organization. Are you going to incorporate a legal entity? If yes, what are your thoughts and your needs about this?   55:28 — Juan Guillén: Regarding the timelines, do you know when you’re planning on submitting this?   Outro  Juan Guillén Anything else you would like to say before closing the call? (57:29) Thank you, David, and thank you, everyone, for coming   Credits @blimpa produced this summary. Everyone who spoke and presented on the call, listed in the headers. ",
                    "links": [
                        "https://youtu.be/tAsLQwxKLyE?t=44",
                        "https://www.youtube.com/watch?v=tAsLQwxKLyE",
                        "https://forum.makerdao.com/tag/culps",
                        "https://youtu.be/tAsLQwxKLyE?t=44",
                        "https://youtu.be/tAsLQwxKLyE?t=1174",
                        "https://youtu.be/tAsLQwxKLyE?t=1240",
                        "https://youtu.be/tAsLQwxKLyE?t=1318",
                        "https://youtu.be/tAsLQwxKLyE?t=1455",
                        "https://youtu.be/tAsLQwxKLyE?t=1580",
                        "https://youtu.be/tAsLQwxKLyE?t=1700",
                        "https://youtu.be/tAsLQwxKLyE?t=1815",
                        "https://youtu.be/tAsLQwxKLyE?t=1902",
                        "https://youtu.be/tAsLQwxKLyE?t=2140",
                        "https://youtu.be/tAsLQwxKLyE?t=2349",
                        "https://youtu.be/tAsLQwxKLyE?t=2746",
                        "https://youtu.be/tAsLQwxKLyE?t=2826",
                        "https://youtu.be/tAsLQwxKLyE?t=2898",
                        "https://youtu.be/tAsLQwxKLyE?t=3091",
                        "https://youtu.be/tAsLQwxKLyE?t=3223",
                        "https://youtu.be/tAsLQwxKLyE?t=3328",
                        "https://youtu.be/tAsLQwxKLyE?t=3449"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.736385773317592
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#5",
                    "likes": "2",
                    "time": "21/04/2021-16:08:16",
                    "content": "Thank you for these meeting notes! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "0",
                    "time": "22/04/2021-01:22:09",
                    "content": "looks cool Strategic MarComms  jejeje   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-11-oracles-core-unit-ora-001/8415",
            "title": "\\xf0\\x9f\\x9a\\x80 Core Unit Launch Pod Sessions ||| Session #11: Oracles Core Unit ORA-001 ",
            "index": 8415,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "core-unit",
                "public-call",
                "ora-001",
                "pubcall-:-cu-launch-pod"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "4",
                    "time": "28/05/2021-14:02:27",
                    "content": " Core Unit Launch Pod Session #11 - ＮＯＷ ＷＩＴＨ ＭＯＲＥ ＡＥＳＴＨＥＴＩＣ1280×720 79.1 KB    Core Unit Launch Pod Sessions ||| Session #11: Oracles Core Unit ORA-001 For this session @nikkunkel will be presenting the Oracles Core Unit, ORA-001, whose genesic subproposals can be found here:  MIP39c2-SP13: Adding Oracles Core Unit MIP40c3-SP15: Modify Oracles Core Unit Budget MIP41c4-SP13: Facilitator Onboarding, Oracles Core Unit  @juan will be doing the hosting   When Time in your local-timezone format: 2021-06-02T17:00:00Z Save the event.  Where When the time is ripe, follow this Zoom link  Or use this information:  Meeting ID: 829 4277 3725 Passcode: COREUNIT Find your local number: Zoom International Dial-in Numbers - Zoom  attn: @LongForWisdom, @flipflopflapdelegate, @prose11, @davidutro, @g_dip, @iammeeoh, @planet_x, @mrabino1, @sebventures, @derek, @nadia, @primoz, @ultraschuppi, @wouter, @vamsi, @ejbarraza, @iammeeoh, @tbone, @Nadia ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp15-modify-oracles-core-unit-budget/8047",
                        "https://forum.makerdao.com/t/mip41c4-sp13-facilitator-onboarding-oracles-core-unit/8046",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=NjNsaDY1cmRsdWVtcmR2cG5pNmQ5c3A0NmkgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/maker-relay-ep-47-en-espanol/8547",
                        "https://forum.makerdao.com/t/maker-relay-ep-48/8609",
                        "https://forum.makerdao.com/t/maker-relay-ep-48-en-espanol/8636",
                        "https://forum.makerdao.com/t/maker-relay-ep-47/8491"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#3",
                    "likes": "1",
                    "time": "03/06/2021-14:02:13",
                    "content": "     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-9-govalpha-core-unit/8124",
            "title": "\\xf0\\x9f\\x9a\\x80 Core Unit Launch Pod Sessions ||| Session #9: GovAlpha Core Unit ",
            "index": 8124,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "governance",
                "core-unit",
                "gov-001",
                "public-call",
                "pubcall-:-cu-launch-pod"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "6",
                    "time": "17/05/2021-20:24:33",
                    "content": " 1280×721 123 KB  For the 9th CULPS we’ll have full-time GovAlpha contributor Payton Prose (@prose11), who’ll be talking about his candidacy for Governance Facilitator, which in turn implies that he will be talking about pretty much everything. Here’s his Facilitator Onboarding subproposal: https://forum.makerdao.com/t/mip41c4-sp12-govalpha-facilitator-onboarding/7994. Join us! He’ll be elated to have you there asking questions  @juan will be doing the hosting   When Time in your local-timezone format: 2021-05-19T17:00:00Z  Where When the time is ripe, follow this Zoom link  Or use this information:  Meeting ID: 829 4277 3725 Passcode: COREUNIT Find your local number: Zoom International Dial-in Numbers - Zoom  attn: @LongForWisdom, @elihu, @amyjung ,@flipflopflapdelegate, @davidutro, @g_dip, @iammeeoh, @planet_x, @mrabino1, @sebventures, @derek, @nadia, @primoz, @ultraschuppi, @wouter ",
                    "links": [
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/maker-relay-ep-46/8312",
                        "https://forum.makerdao.com/t/operational-support-final-weekly-update-may-20-27-2021/8388",
                        "https://forum.makerdao.com/t/maker-relay-ep-45/8127",
                        "https://forum.makerdao.com/t/maker-relay-ep-46-en-espanol/8358",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-may-14-20-2021/8204"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#3",
                    "likes": "3",
                    "time": "19/05/2021-20:16:20",
                    "content": "     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-1-growth-core-unit/6711",
            "title": "\\xf0\\x9f\\x9a\\x80 Core Unit Launch Pod Sessions ||| Session #1: Growth Core Unit ",
            "index": 6711,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "growth",
                "core-unit",
                "gro-001",
                "public-call",
                "pubcall-:-cu-launch-pod"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#1",
                    "likes": "14",
                    "time": "24/02/2021-18:33:40",
                    "content": " CULPS-011280×720 661 KB  Design: @blimpa  Welcome to Core Unit Launch Pod Sessions! In our first session, @Nadia and the team behind GRO-001, the Growth Core Unit will dive into the details of their proposal, budget, and execution. We’ll also cover the different things that they’ve have done in the past, how all these activities have had a positive impact to promote Dai, and what their plan for world domination is. Word has it that we will be joined by special guests, so don’t miss it.  When 2021-03-03T18:00:00Z  Where  >>> This Zoom Meeting <<< Or by using this: Meeting ID: 829 4277 3725 Passcode: COREUNIT One tap mobile +13017158592,,82942773725#,,,,*46651499# US (Washington DC) +13126266799,,82942773725#,,,,*46651499# US (Chicago)  Meeting ID: 829 4277 3725 Passcode: 46651499 Find your local number: [<https://us02web.zoom.us/u/kdYmK1Gv2D>](<https://us02web.zoom.us/u/kdYmK1Gv2D>)  attn: @MarianoDP , @blimpa , @flipflopflapdelegate , @g_dip , @tadeo , @amyjung , @iammeeoh , @Gustav_Arentoft, @Jenn , @Matthew_Cooper , @Doo       ",
                    "links": [
                        "https://www.youtube.com/watch?v=HDgC84l1o-g",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-feb-22-25-2021/6736",
                        "https://forum.makerdao.com/t/governance-at-a-glance-feb-19-25-2021/6735",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-130-thursday-february-25-17-00-utc/6651/5",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/19",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-february-28th-2021/6830",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-1-4-2021/6848",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-131-thursday-march-4-17-00-utc/6737/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.241341991341991
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "1",
                    "time": "03/03/2021-17:53:16",
                    "content": "Can’t wait to hear about The Growth Core Unit! Starting in a few minutes! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#4",
                    "likes": "4",
                    "time": "13/03/2021-23:48:11",
                    "content": "  Core Unit Launch Pod Sessions ||| Session #1: Growth Core Unit Agenda   00:00: Intro with Juan Guillén  00:35: Growth Core Unit with Nadia (@Nadia), Gustav Arentoft (@Gustav_Arentoft), Mariano DiPietrantonio (@MarianoDP), Doo Wan Nam (@Doo), Jen Senhaji (@Jenn), Matthew Cooper (@Matthew_Cooper), Luis Lozada (@Lozadaluis12)  Video https://www.youtube.com/watch?v=HDgC84l1o-g Introduction Juan Guillén Agenda and Preamble  Hi, everyone. Welcome to the Core Unit Launch Pod Sessions #01. In this case, we have the Growth Core Unit. Nadia and her team are here to talk a little bit more about how they are going to approach this project in general, the budget, and the whole MIP. For more episodes of the series, follow this link   Presentation Growth Core Unit with Nadia (00:35)  1920×1080 160 KB   1920×1080 163 KB   1920×1080 195 KB   1920×1080 172 KB   22:09 — Juan Guillén: I think Gustav mentioned the methodical approach. How do you work to onboard the partners, identify them, see how the process is… What are these tools that you use both individually and as a team? 32:37 — Tim Black: There’s quite an overlap with the Integrations team. Is that correct? Am I understanding right?   34:54 — Gustav Arentoft introduces Georgy Sokolov from Wirex 41:43 — Jen Senhaji introduces Nadia Taiga and Andy Alekhin from Snark.art 48:45 — Mariano DiPietrantonio introduces Henri from Buenbit   55:19 — Frank Cruz: This is going to be a post-Foundation movement. How do you think you’re going to scale Dai compared to the previous 12 months? 01:02:28 — Juan Guillén: How would you recommend MKR holders to judge your performance moving forward? 01:06:02 — Juan Guillén: How do you define when a partner is actually onboarded? Is it when they have Dai in their product or is it when they sign or when they commit…? 01:07:28 — Frank Cruz: Luis, you’re into xDai out in Venezuela. I was just wondering how others are handling the issue with the gas prices? How’s Buenbit dealing with this? And how important is it for the Maker Community to move to a Layer 2 or should we stay on the Layer 1 and let Dai make its way to Layer 2 on its own? 01:11:57 — Juan Guillén: Can you walk us a little bit through the budget? What are you guys thinking in terms of salaries, incentives…? How are you planning on incentivizing the team?  Outro Juan Guillén Thanks again for coming. It was great having you. If you want to know more about this proposal and the team, you can look it up in the forum, where it’s properly tagged. We’ll see you soon.  Credits @blimpa produced this summary. Everyone who spoke and presented on the call, listed in the headers. ",
                    "links": [
                        "https://youtu.be/HDgC84l1o-g?t=35",
                        "https://www.youtube.com/watch?v=HDgC84l1o-g",
                        "https://forum.makerdao.com/tag/culps",
                        "https://youtu.be/HDgC84l1o-g?t=35",
                        "https://youtu.be/HDgC84l1o-g?t=1329",
                        "https://youtu.be/HDgC84l1o-g?t=1957",
                        "https://youtu.be/HDgC84l1o-g?t=2094",
                        "https://youtu.be/HDgC84l1o-g?t=2503",
                        "https://youtu.be/HDgC84l1o-g?t=2925",
                        "https://youtu.be/HDgC84l1o-g?t=3319",
                        "https://youtu.be/HDgC84l1o-g?t=3748",
                        "https://youtu.be/HDgC84l1o-g?t=3962",
                        "https://youtu.be/HDgC84l1o-g?t=4048",
                        "https://youtu.be/HDgC84l1o-g?t=4317",
                        "https://forum.makerdao.com/",
                        "https://forum.makerdao.com/tag/gro-001"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.033521303258146
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "13/06/2021-05:48:24",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-10-collateral-onboarding-core-unit/8268",
            "title": "\\xf0\\x9f\\x9a\\x80 Core Unit Launch Pod Sessions ||| Session #10: Collateral Onboarding Core Unit ",
            "index": 8268,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "core-unit",
                "public-call",
                "ces-001",
                "pubcall-:-cu-launch-pod"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "4",
                    "time": "23/05/2021-16:57:40",
                    "content": " 1279×720 620 KB    Core Unit Launch Pod Sessions ||| Session #10: Collateral Onboarding Core Unit For the 10th episode of CULPS we’ll be joined by @monkey.irish, who’s going to be talking about the Core Unit he’s proposing: Collateral Onboarding Core Unit COB-001. Here’s the subproposals:  MIP39c2-SP12: Adding Collateral Onboarding Core Unit MIP40c3-SP14: Modify Collateral Onboarding Core Unit Budget MIP41c4-SP14: Facilitator Onboarding, Collateral Onboarding Core Unit  As usual, @juan will be doing the hosting. Join us!   When Time in your local-timezone format: 2021-05-26T17:00:00Z  Where When the time is ripe, follow this Zoom link  Or use this information:  Meeting ID: 829 4277 3725 Passcode: COREUNIT One tap mobile +13017158592,82942773725#,*46651499# US (Washington DC) +13126266799,82942773725#,*46651499# US (Chicago) Dial by your location +1 301 715 8592 US (Washington DC) +1 312 626 6799 US (Chicago) +1 346 248 7799 US (Houston) +1 646 558 8656 US (New York) +1 669 900 9128 US (San Jose) +1 253 215 8782 US (Tacoma) Meeting ID: 829 4277 3725 Passcode: 46651499 Find your local number: Zoom International Dial-in Numbers - Zoom  attn: @LongForWisdom, @elihu, @Prose11, @flipflopflapdelegate , @g_dip , @derek, @SebVentures , @tadeo  , @amyjung , @iammeeoh , @Primoz, @MarianoDP, @Planet_X, @Nadia ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp14-modify-collateral-onboarding-core-unit-budget/8038/5",
                        "https://forum.makerdao.com/t/mip41c4-sp14-facilitator-onboarding-collateral-onboarding-core-unit/8039/2",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/maker-relay-ep-46-en-espanol/8358",
                        "https://forum.makerdao.com/t/maker-relay-ep-46/8312",
                        "https://forum.makerdao.com/t/maker-relay-ep-47/8491",
                        "https://forum.makerdao.com/t/maker-relay-ep-47-en-espanol/8547",
                        "https://forum.makerdao.com/t/operational-support-final-weekly-update-may-20-27-2021/8388"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.779829545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TobiasMaximus",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/05/2021-11:42:39",
                    "content": "Is that session open to anybody? I’d be curious to lurk, doubt if I have anything to say. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "1",
                    "time": "24/05/2021-12:44:00",
                    "content": "Yes, these are open to the public, and can actually be found alongside the other public calls on our MakerDAO Events Calendar. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#5",
                    "likes": "2",
                    "time": "27/05/2021-19:58:16",
                    "content": "     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-3-smart-contracts-core-unit/6946",
            "title": "\\xf0\\x9f\\x9a\\x80 Core Unit Launch Pod Sessions ||| Session #3: Smart Contracts Core Unit ",
            "index": 6946,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "core-unit",
                "public-call",
                "pe-001",
                "pubcall-:-cu-launch-pod"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "6",
                    "time": "09/03/2021-20:32:57",
                    "content": "       Core Unit Launch Pod Sessions ||| Session #3: Smart Contracts Core Unit This time @Derek will be talking about MIP39c2-SP7, a subproposal for adding a Smart Contracts Core Unit, and related subproposals MIP40c2-SP7 (Modify Smart Contract Core Unit Budget) and MIP41c2-SP7 (Facilitator Onboarding, Smart Contract Core Unit). Everyone’s invited to join. Bring your questions! As usual, your favorite host @juan will be the moderator.  When Time in your local-timezone format: 2021-03-17T18:00:00Z  Where When the time is ripe, follow this Zoom link  Or use this information:  Meeting ID: 829 4277 3725 Passcode: COREUNIT One tap mobile +13017158592,82942773725#,*46651499# US (Washington DC) +13126266799,82942773725#,*46651499# US (Chicago) Dial by your location +1 301 715 8592 US (Washington DC) +1 312 626 6799 US (Chicago) +1 346 248 7799 US (Houston) +1 646 558 8656 US (New York) +1 669 900 9128 US (San Jose) +1 253 215 8782 US (Tacoma) Meeting ID: 829 4277 3725 Passcode: 46651499 Find your local number: Zoom International Dial-in Numbers - Zoom  attn: @derek, @cmooney, @kurt_barry, @brianmcmichael, @LongForWisdom, @juan, @wil, @elihu, @Prose11, @flipflopflapdelegate , @g_dip , @mrabino1, @psychonaut, @Aaron_Bartsch, @tadeo , @amyjung , @iammeeoh , @MarianoDP, @planet_x, @SebVentures ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp7-adding-smart-contracts-core-unit/6831",
                        "https://forum.makerdao.com/t/mip40c2-sp7-modify-smart-contract-core-unit-budget/6832",
                        "https://forum.makerdao.com/t/mip41c4-sp7-facilitator-onboarding-smart-contract-core-unit/6833",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/maker-relay-ep-36/7039",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/21",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-132-thursday-march-11-17-00-utc/6859/5",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-5-11-2021/6978",
                        "https://forum.makerdao.com/t/governance-at-a-glance-mar-5-mar-11-2021/6977",
                        "https://forum.makerdao.com/t/maker-relay-ep-36-en-espanol/7053",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-12-18-2021/7089",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-133-thursday-march-18-17-00-utc/6982/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.648538961038962
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "1",
                    "time": "09/03/2021-20:46:03",
                    "content": "Nice! I’ll definitely be tuning in for this one! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rojosnow",
                    "index": "#4",
                    "likes": "0",
                    "time": "18/03/2021-15:15:07",
                    "content": "When you get a chance, would you post the link to the recording. I wasn’t able to stay on for the entire call. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#5",
                    "likes": "3",
                    "time": "18/03/2021-17:13:45",
                    "content": "Hi @rojosnow! Here’s the recording: Core Unit Pod Sessions - Session #3: Smart Contracts Core Unit - YouTube ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#6",
                    "likes": "1",
                    "time": "26/03/2021-15:50:28",
                    "content": "  Core Unit Launch Pod Sessions ||| Session #3: Smart Contract Core Unit Agenda   00:00: Intro with Juan Guillén  00:59: Smart Contracts Core Unit with Derek Flossman (@Derek)  Video      Introduction Juan Guillén Agenda and Preamble  Hi, everyone. Welcome to Core Unit Launching Pod Sessions #03. Today we have the Smart Contract Core Unit. Derek is joining us to present their mandate, budget, and himself as Facilitator. The vesting topic was heated up, so today we’ll try to focus mainly on the Smart Contracts Core Unit implementation and not in vesting in general for the Maker community. For more episodes of the series, follow this link   Presentation Smart Contracts Core Unit with Derek (00:59)  Smart Contract Core Unit1920×1080 158 KB   Introducing the Proposed Smart Contract Core Unit1920×1080 180 KB   Team Philosophy and Values1920×1080 186 KB   07:30 — Planet_X: I have a question about the team size. What are you planning to grow to specifically 14 people and not, say, 24 or any other figure?   Ways of Working1920×1080 187 KB   What does the Smart Contract Team do?1920×1080 95.7 KB   Smart Contrat Team work1920×1080 231 KB   Team Mandates1920×1080 203 KB  19:46 — LongForWisdom: I noticed on your Safety side that you mentioned game theory analysis/design and I was curious if you were explicitly planning on hiring an expert in game theory or mechanism design. In my experience, that’s a different skill set to development work. I think I felt that’s potentially missing where we are now compared to where we were or when MCD was designed.  A Backlog of Work...1920×1080 210 KB   In summary...1920×1080 135 KB   26:33 — Planet_X: I have a question regarding the necessary time to train new team members. How long does it take before a new person is able to contribute?   Team Incentivization1920×1080 258 KB   35:29 — Juan Guillén: Does this mean that, if there were 100 developers joining and staying for four years, we would dilute Maker by 10%?   38:06 — LongForWisdom: If it’s 10% over four years, that’s 2.5% per year, which is not really that much assuming that we burn nothing and assuming that we have 100 people that are getting 0.1%. I think the point is that the magnitudes aren’t huge.   39:24 — LongForWisdom: Maybe a little bit off-topic, but from a Governance perspective I’d actually be pretty happy if everyone who was involved got 0.1% over four years because that’s quite good at distributing Governance power.   39:39 — Amy Jung: I have a question about these four years. How did you get to four versus three or five or something?   41:52 — Juan Guillén: Are you thinking about any type of cliff, Derek?   42:35 — LongForWisdom: I think the one-year cliff makes sense. You don’t want people just bailing in less than that time, but I’d maybe consider making these subsequent cliffs more like a continuous scale rather than like cliffs. Because it kind of sucks to be stuck in a job that you don’t like for an extra six months because you’re waiting for some vesting cliff. Or viceversa, if you do decide to leave, it feels bad if you leave after six months and you get none of the vesting […] Free discussion ensues   45:58 — Andrew Burban: We can maybe mint if the minting cannot be unlocked until we’ve burned a certain amount, but in general I’m very anti-mint […] I think having the printer button just there is very tempting and can lead to unintended consequences that I think are dangerous. If we’re going to allow minting, we need to have very strict codified limits […] I’m much more pro taking it from the burn […] Free discussion ensues   56:46 — Juan Guillén: Potentially, using the burning function is going to… You’re incentivizing people to burn a lot, so maybe they will say “Ok, we should not research L2. We should onboard more tokens because that’s more burning. So we’ll receive more MKR compared to potentially growing it more in the long term and suffer from the vesting during those months”. I don’t know if we want that. Free discussion ensues   57:31 — LongForWisdom: Another interesting question is: assuming that the MKR treasury gets burned —which is obviously not guaranteed—, are you then feeling better about minting, Andrew? Free discussion ensues   01:00:56 — Planet_X: This has to do with the coordination. You said on these slides that you coordinated with the other groups. Is this in some way coordinated with the Oracles team? Because after you there will be an Oracles Core Unit, I guess. As a community member, what I really don’t want is for you to get packaged A, B, C, something, and then the Oracles team come out with their proposal, and what they propose tops everything you got. So, is this reasonably coordinated with the Oracles team?   01:02:30 — LongForWisdom: I just want to follow up and say that’s kind of my main concern at this stage as well, that either we’ll get into a situation where Governance is feeling like they have to kind of pay out all these small vesting things because the first one was 0.1% and now they’re all that; or I don’t want to get into a situation where the next Core Unit comes along and says “We want more”, “We want less”, and then when you’re half down the line, someone is feeling dissatisfied with the amount of vesting they’re getting in comparison to some other core team. To some extent that’s going to be unavoidable, but I feel like maybe if we have some sort of more global or system setup that covers multiple teams… Maybe that’s beneficial.   01:08:39 — Frank Cruz: I heard Derek said something about possibly looking at L1s in the near future. I was wondering if your team was well-versed when it comes to working with Rust, Vyper, WASM… How does that look? Is that a 2024 event or is that something that maybe can come a little earlier like 2023?  Outro (01:12:30)  Juan Guillén Thank you, everyone. So, Derek, where can people find you? (01:12:33), Potentially give out your address if they want to go with their pitchforks. Big thanks to the rest of the Smart Contract Team for coming and answering all our questions  Credits @blimpa produced this summary. Everyone who spoke and presented on the call, listed in the headers. ",
                    "links": [
                        "https://youtu.be/_04sO6evht8?t=59",
                        "https://www.youtube.com/watch?v=_04sO6evht8",
                        "https://forum.makerdao.com/tag/culps",
                        "https://youtu.be/_04sO6evht8?t=59",
                        "https://youtu.be/_04sO6evht8?t=450",
                        "https://youtu.be/_04sO6evht8?t=1186",
                        "https://youtu.be/_04sO6evht8?t=1583",
                        "https://youtu.be/_04sO6evht8?t=2129",
                        "https://youtu.be/_04sO6evht8?t=2286",
                        "https://youtu.be/_04sO6evht8?t=2364",
                        "https://youtu.be/_04sO6evht8?t=2379",
                        "https://youtu.be/_04sO6evht8?t=2512",
                        "https://youtu.be/_04sO6evht8?t=2555",
                        "https://youtu.be/_04sO6evht8?t=2758",
                        "https://youtu.be/_04sO6evht8?t=3286",
                        "https://youtu.be/_04sO6evht8?t=3451",
                        "https://youtu.be/_04sO6evht8?t=3656",
                        "https://youtu.be/_04sO6evht8?t=3750",
                        "https://youtu.be/_04sO6evht8?t=4119",
                        "https://youtu.be/_04sO6evht8?t=4350",
                        "https://youtu.be/_04sO6evht8?t=4353"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.726997040207268
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "25/06/2021-21:51:28",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3310"
}