{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip81-implementation-design-legal-review-per-mip81c2/19423",
            "title": "MIP81: Implementation Design & Legal Review [per MIP81c2] ",
            "index": 19423,
            "category": [
                "Governance"
            ],
            "tags": [
                "legal",
                "mip81"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kam",
                    "index": "#1",
                    "likes": "2",
                    "time": "15/01/2023-19:57:44",
                    "content": "This post is under review due to new information. Please have patience, we will revert as soon as possible. Editor’s note: While the original text of this post has been taken down at the author’s request, we have preserved the discourse below, should it be useful to the DAO in future decisions. ",
                    "links": [
                        "https://forum.makerdao.com/t/3-boletin-de-noticias-enero-del-2023/19672"
                    ],
                    "GPT-summary": "The post is an update on the review of MIP81, which has been taken down at the author's request. The editor's note explains that the discourse below has been preserved for future reference by the DAO.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.456755050505051
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#3",
                    "likes": "5",
                    "time": "15/01/2023-20:57:04",
                    "content": "    Kam:  Given the MKR Poll chooses to accept the usage of the James Asset Trust (JAT) structure as holding and transaction vehicle for MIP81   Is there any particular reason this entity was chosen other than speed of onboarding? Monetalis was not named as an arranger for MIP81 at its approval. James Asset Trust is already counterparty for 500,000,000 DAI from MIP65: Monetalis Clydesdale. Adding MIP81 to the same trust brings exposure up to an authorized maximum of 2,100,000,000 DAI (500m from MIP65 + 1,600m from MIP81). MIP88: Monetalis Friesian has also been approved, and could potentially add another 225,000,000 DAI going through James Asset Trust. Even without Friesian, MIPs 65 and 81 would create a single counterparty holding nearly the same amount of exposure as the USDC PSM. Given that the entire purpose of many of these MIPs is to reduce catastrophic single counterparty exposure, James Asset Trust is not a prudent choice of entity. Swapping >2 billion DAI exposure out of a regulated, politically scrutinized entity with its own equity and reputation to protect and into a startup custom built to work with MakerDAO looks like a riskier move. Even if such large exposure to Monetalis is considered acceptable, there should be separate entities used for each deal or line of business so that any unforseen problems with MIP65 are isolated from MIP81 and vice versa. James Asset Trust was meant to be an SPV for MIP65, and a new trust should be created for MIP81 if Monetalis is to oversee it. Also, can you confirm whether you, @Kam, represent Monetalis, James Asset Trust, or another party? You are listed as a member of Viridian Cluster (thank you, @flipflopflapdelegate for the eagle eye), which is structured around Monetalis, the parent for James Asset Trust. There’s nothing wrong with that, but it should be disclosed. Can you also provide confirmation of your legal credentials, such as a CV and submission to KYC, since those are required under MIP81? Thank you in advance. I know the early drafts of the Viridian Cluster SPF intended to include a link to your resume.     Kam:  Use the MIP81 version of the MIP21 contract to - automatically by calling it - mint 500M DAI, Exchange for USDC and deposit to a separate new Coinbase Custody Account under James Asset Trust.   From Coinbase’s perspective, the arranger entity, is the unencumbered legal owner of the USDC? If so, is there a reason why the RWA Foundation (or a copy of it) can’t be the legal owner of the USDC? If not, what is the role of the arranger entity given that this appears much simpler to execute than MIP65?     Kam:  Coinbase retains, with Safebox, the ability, within a 10 hour window, to veto a withdrawal of USDC by Maker governance   This is unacceptable and needs to be renegotiated. Given that Maker governance would require an action that usually takes days to execute, Coinbase should consider communicating an unwillingness to honor withdrawals prior to execution. MIP81 is presented as being idle USDC so there are no liquidity concerns that could crop up over the course of 10 hours after an executive that would not have been present in the multiple days leading up to its execution. Note that this likely violates MIP81c1:  This includes, but is not limited to:  No ability by third parties to access the funds or change the terms of the legal structure. Maker Governance has complete ability to trigger a liquidation with a successful executive vote encoding an instruction to the authorized account users of the legal entity. It should not be possible for a single third party to block the ability of Maker Governance to make decisions or modify the structure.  There must be no apparent weak links or edge cases that allow funds to get misappropriated or stuck.        Kam:   JAL can choose to leave or enter the rewards program by sending notice by email. (Clause 2(a)(ii)) Coinbase can in its sole discretion deem JAL no longer eligible for the rewards program. If Coinbase decides JAL is no longer eligible, JAL’s enrollment in the program will be suspended but JAL will remain entitled to the USDC rewards accrued prior to suspension. (Clause 2(a)(iii))    Please require inclusion of at least two community members or contributors to also be included on all of these emails. Email notification has failed MakerDAO in the past when only one inbox gets the information.     Kam:  The courts of the State of New York will have non-exclusive jurisdiction. (Clause 2©(vi))   Can this be changed to a different jurisdiction? New York is not an ideal choice for assets related to MakerDAO to sit. Ideally the jurisdiction is outside the US. Also, aren’t the actual assets being custodied under an Irish entity?     Kam:  The Agreement has been amended to include various additional protections for JAL.   Have any additional protections for MakerDAO been included? Where can this agreement be located for those wishing to retain a copy for themselves? Also, where can a copy of the proposed agreement with Monetalis/JAT be found, and who is reviewing it on behalf of MakerDAO (rather than the borrower)? Thank you in advance for all answers and replies to suggestions. Please let us know how we can assist with the fixes outlined above. This is a good first draft, but if delays are to be avoided, there need to be quite a few changes. Please include a representative from MakerDAO in these discussions in the future. CC: @CB_Institutional ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP88",
                        "https://makerburn.com/#/collateral/PSM-USDC-A",
                        "https://forum.makerdao.com/t/mip55c3-sp13-special-purpose-fund-for-developing-proof-of-performance-for-viridian-cluster/19077",
                        "https://forum.makerdao.com/t/post-mortem-new-silver-executive-summary-change/8911"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.362527499822582
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#4",
                    "likes": "2",
                    "time": "15/01/2023-21:16:26",
                    "content": "An additional question; Given that this construct carries most of the risks of MIP-65 in addition to a whole host of new risks and the rewards are substantially lower than through MIP-65, what would Maker’s incentive be to pursue this particular MIP? The rather obvious alternative would seem to be to increase the DC of MIP-65 instead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.003030303030304
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "2",
                    "time": "15/01/2023-22:18:52",
                    "content": "@Patrick_J @prose11 Can you please add more clarity to the Title of this post—I believe it should be a MIP81c2 Legal V&O, correct? At first glance—almost thought it was a spoof of the original MIP81. Also, maybe also please identify that this is a Viridian Cluster related MIP81c2–I don’t believe most are aware that the author has a connection to said cluster. Thank you in advance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.234375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#6",
                    "likes": "4",
                    "time": "15/01/2023-23:27:43",
                    "content": "    Kam:  Coinbase retains, with Safebox, the ability, within a 10 hour window, to veto a withdrawal of USDC by Maker governance   This defeats the point of the Safebox. If Coinbase’s consent is needed to withdrawal funds, then there is little difference from having Coinbase custody the funds directly. What is the justification for this veto? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#7",
                    "likes": "1",
                    "time": "16/01/2023-12:04:52",
                    "content": "The veto is needed for Coinbase to follow their custody procedures. They have a duty to protect their customer (like if the account is compromised I guess). Now, if we go to the logical conclusion, in my view, it is obvious that the main reason is to comply with KYC/AML reasons and OFAC sanctions. One could argue that those “issues” are already present in the USDC blacklisting. There could be other cases, like we had with Genesis blocking stuff for random KYC/AML reasons. It is not lost on anybody that MakerDAO is kind of in the custody business as well, and in my view, better than any off-chain custodian could be (but with different tradeoffs). Having to rely on a third custodian is not something we want, it is actually the last thing we want. But it is what it is. In this setup, Coinbase should do an affirmative action to block the funds which is significantly better than having Coinbase to do something to unlock the funds (like traditional custody). Moreover, Coinbase or anyone can’t seize those funds. Up to MKR holder and delegates to weight the pro and cons. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.653645833333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#8",
                    "likes": "0",
                    "time": "16/01/2023-12:05:00",
                    "content": "Hi Frank, @Kam is listed as a member of the Viridian Cluster with legal credentials in the Viridian SPF request thread here. It would be good if @Allan_Pedersen or @Hajive would confirm their satisfaction with these credentials in this thread to assuage any concerns the community/voters might have.     flipflopflapdelegate:  Also, maybe also please identify that this is a Viridian Cluster related MIP81c2   I’m unsure whether this work is being undertaken as “Viridian Cluster” work or as an external party contracted by Monetalis/James Asset Trust/SF at this stage. Perhaps @Kam could clarify this? On another note, @Kam please provide the relevant link for this as soon as practically convenient:     Kam:  The James Asset structure will be instructed with the following instruction set [link to come shortly]   It will be difficult for voters to express their opinions on this implementation without having all of the relevant information to hand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#9",
                    "likes": "3",
                    "time": "16/01/2023-12:36:07",
                    "content": "    SebVentures:  The veto is needed for Coinbase to follow their custody procedures.   From their side, its understanable why Coinbase would ask for this. But it is incompatible with MIP81c1, as outlined earlier in the thread.     GFXlabs:  Note that this likely violates MIP81c1:  This includes, but is not limited to:  No ability by third parties to access the funds or change the terms of the legal structure. Maker Governance has complete ability to trigger a liquidation with a successful executive vote encoding an instruction to the authorized account users of the legal entity. It should not be possible for a single third party to block the ability of Maker Governance to make decisions or modify the structure.  There must be no apparent weak links or edge cases that allow funds to get misappropriated or stuck.      We would like @GovAlpha-Core-Unit to weigh in on whether they share this interpretation prior to a poll to implement. The veto was not present in the technical assessment. Substantive changes mean a new technical assessment is likely required as well: “Should final implementation include the smart contract custodial approach – this technical assessment will need to be updated to reflect the final agreed implementation of the Safebox contract – as the final versions of any contract will require agreement between Coinbase and MakerDao as well as a complete audit and security review of any contract to be implemented.” It would be helpful to know why this has been inserted at the last minute, since it could result in delays. If this was a dealbreaker for Coinbase, surely that has been known for months. And if it’s not, it needs to be removed, since it significantly impairs DAI-USDC liquidity. Given that USDC is a direct competitor of DAI, that power to withhold USDC to maintain the fixed exchange rate for DAI cannot rest with Coinbase, which is a member of the consortium that issues USDC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.327005655634688
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#10",
                    "likes": "5",
                    "time": "16/01/2023-12:43:40",
                    "content": "    Kam:  Coinbase retains, with Safebox, the ability, within a 10 hour window, to veto a withdrawal of USDC by Maker governance   This deal should be halted immediately and returned to the DAO for discussion. During the proposal phase, claims were constantly made that Maker governance would have direct and immediate access to the USDC upon request. This is a material change to everything that was discussed in proposal and voting phase and should kill this entire deal immediately. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kam",
                    "index": "#11",
                    "likes": "0",
                    "time": "16/01/2023-15:31:09",
                    "content": "    GFXlabs:  Is there any particular reason this entity was chosen other than speed of onboarding?   In addition to speed of onboarding, other reasons include that the structure:  Has been used successfully before and accepted by the Maker community and so it is sensible to use a structure that the community is already familiar with unless there is a material reason to change it. The existing relationship with Coinbase follows the same structure and has transacted 500M USDC/USD successfully.      GFXlabs:  Even if such large exposure to Monetalis is considered acceptable, there should be separate entities used for each deal or line of business so that any unforseen problems with MIP65 are isolated from MIP81 and vice versa. James Asset Trust was meant to be an SPV for MIP65, and a new trust should be created for MIP81 if Monetalis is to oversee it.   We recognise the issue of single exposure and are working with Monetalis and external legal advice from Reed Smith to find a solution, for example, holding assets via multiple trust entities and other measures. Updates on this will be reported back to the community as soon as possible and, in any event, before the transaction is concluded.     GFXlabs:  Also, can you confirm whether you, @Kam, represent Monetalis, James Asset Trust, or another party? You are listed as a member of Viridian Cluster (thank you, @ElProgreso for the eagle eye), which is structured around Monetalis, the parent for James Asset Trust. There’s nothing wrong with that, but it should be disclosed. Can you also provide confirmation of your legal credentials, such as a CV and submission to KYC, since those are required under MIP81? Thank you in advance. I know the early drafts of the Viridian Cluster SPF  intended to include a link to your resume.   I have been approached to be a member of the Viridian Cluster to provide legal assessments for various Maker RWA activities such as this, reviewing documents from a Maker perspective. Thank you @Patrick_J for your response and referring to the Viridian SPF; this also includes a short bio about me. Further information about me can be found on my LinkedIn profile. I am an English qualified lawyer who has worked in the tradfi and defi industries and I hold a masters degree specialised in international financial law.     GFXlabs:  From Coinbase’s perspective, the arranger entity, is the unencumbered legal owner of the USDC? If so, is there a reason why the RWA Foundation (or a copy of it) can’t be the legal owner of the USDC? If not, what is the role of the arranger entity given that this appears much simpler to execute than MIP65?   James Asset Trust is an orphan SPV trust designed to hold assets for the benefit of MKR and DAI holders and directed by Maker governance. JAT will be the owner of the USDC from a legal perspective. I have no particular insights into the RWA Foundation. Please see above regarding the reasons for adopting the JAT structure.     GFXlabs:  This is unacceptable and needs to be renegotiated. Given that Maker governance would require an action that usually takes days to execute, Coinbase should consider communicating an unwillingness to honour withdrawals prior to execution. MIP81 is presented as being idle USDC so there are no liquidity concerns that could crop up over the course of 10 hours after an executive that would not have been present in the multiple days leading up to its execution.   We continue to negotiate this point - in particular designing the circumstances under which such potential veto could be exercised legally. [REMOVED] We expect to present the final negotiated position over this week, MKR voters can then decide whether it is adequate.     GFXlabs:  Please require inclusion of at least two community members or contributors to also be included on all of these emails. Email notification has failed MakerDAO in the past  when only one inbox gets the information.   In collaboration with Gov Alpha and SFCU, we will ensure good notification practices are implemented.     GFXlabs:  Can this be changed to a different jurisdiction? New York is not an ideal choice for assets related to MakerDAO to sit. Ideally the jurisdiction is outside the US. Also, aren’t the actual assets being custodied under an Irish entity?   This section is under review due to new information. Please have patience, we will revert as soon as possible.     GFXlabs:  Have any additional protections for MakerDAO been included?   The additional protections being proposed are those set out in the post and restated here for easy reference: This section is under review due to new information. Please have patience, we will revert as soon as possible.     GFXlabs:  Where can this agreement be located for those wishing to retain a copy for themselves?   We are discussing possibilities of disclosure with Coinbase and can revert back to the community once we have further visibility on this.     GFXlabs:  Also, where can a copy of the proposed agreement with Monetalis/JAT be found, and who is reviewing it on behalf of MakerDAO (rather than the borrower)?   The main agreements from MIP65 persist without change and review of the same can be found here. We have deemed the previous legal assessment hereof to be sufficient.     GFXlabs:  Please include a representative from MakerDAO in these discussions in the future. CC: @CB_Institutional   SFCU are aware and kept well informed about the ongoing negotiations. ",
                    "links": [
                        "https://www.linkedin.com/in/kamdylan/",
                        "https://forum.makerdao.com/t/post-mortem-new-silver-executive-summary-change/8911",
                        "https://forum.makerdao.com/t/rwa-007-mip65-monetalis-clydesdale-legal-assessment/17834"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.393665223665224
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hajive",
                    "index": "#12",
                    "likes": "0",
                    "time": "16/01/2023-16:02:08",
                    "content": "    Patrick_J:  It would be good if @Allan_Pedersen or @Hajive would confirm their satisfaction with these credentials in this thread to assuage any concerns the community/voters might have.   I can confirm I have verified the legal credentials for Kam as a UK qualified solicitor. Providing additional background, following the introduction of the Viridian Cluster in October , I started identifying legal and credit talent who could contribute to the RWA journey at MakerDao. For a more informed legal expert opinion, I asked for support from @christiancdpetersen  who spoke with Kam to help technically assess and also to support with orientation of working within the DAO structure as a legal person should the community approve the Viridian Cluster SPF. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip55c3-sp13-special-purpose-fund-for-developing-proof-of-performance-for-viridian-cluster/19077"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#13",
                    "likes": "3",
                    "time": "16/01/2023-16:52:19",
                    "content": "I think there is a misunderstanding that the veto ability means that coinbase can arbitrarily decide if maker can access its collateral or not. Based on my understanding this is not the case, and the ability to veto withdrawals should be considered similar to the ability to blacklist USDC. It is there to fulfill mandatory regulatory requirements that makes it possible for us to access the reward - nothing more and nothing less. There should obviously be strong restrictions in place ensuring that it is impossible for coinbase to frivolously or arbitrarily use it, just as we expect legal protections to exist that prevent abuse of the USDC blacklist ability. It can be compared to the reality that courts, regulators or law enforcement may block the liquidation process of any other offchain collateral. Another feature that may have been overlooked or not discussed is that in practice coinbase is expected to accept all withdrawals within a a few minutes, after running their legally mandated compliance checks, so the 10 hour duration is just a programmed guarantee that we will be able to access the funds if their system should stop working for some reason. In the end, I don’t see any short term alternative to this construction that is scalable, provides a decent reward, and provides instant liquidity. In my opinion this needs to go to a vote as soon as possible, either through the mip process or through the facilitator governance powers of core units with mandates covering RWA. There is too much money being wasted every month by having passive USDC and this is a scalable and safe solution that is available today - longer term we can optimize the solution easily, given the instant, unlimited withdrawal ability. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.390625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#14",
                    "likes": "4",
                    "time": "16/01/2023-18:10:21",
                    "content": "    Kam:  The State of New York is applied to the main prime broker agreement, therefore, is also applied to the addendum as an extension of the main agreement.   LEGAL REPRESENTATION How is @Kam able to advise on and negotiate agreements governed by New York law as an English qualified lawyer? @Hajive The community needs clarity on who/what legal person is being represented and under what terms. Also, we need to know explicitly whether the attorneys acting have other representations that do or could conflict with advocating vigorously for MakerDAO in these negotiations. Since the Viridian Cluster SPF has not been approved, how has @Kam been retained for this work, by whom and what is the source of funds that pay the legal fees? Since MakerDAO is not a legal person, there should be some discussion provided to the community as to why and how the entity that retained the attorneys acting here is a good proxy for representing the overall best interests of MakerDAO as a whole. LEGAL REVIEW The “Custody with Coinbase” section of the Legal Review is unsatisfactory in that it states general observations everyone already knows about what we don’t know and can’t determine. It would be helpful to have some detailed analysis here and specific descriptions of what independent due diligence has been performed regarding the legal entity and regulatory structure at Coinbase, including the agreements that exist among the relevant Coinbase-related entities that are necessary for performing the Coinbase obligations under MIP81. Can you provide a researched opinion on how this structure should work to protect a typical institutional customer’s assets? If a legal entity or arranger with legal person-hood in a known jurisdiction will be the counterparty to the agreement, the analysis should be straight forward. ARRANGER COUNTERPARTY RISK We should also have a discussion as to how MakerDAO is protected vis-a-vis the selected “Real World” proxy, including a description of the events of default, potential events of default, representations & warranties, indemnities, covenants and notice provisions that define that relationship. What is the best governing law and jurisdiction forum for this relationship and why? What thought has been given to jury trial vs arbitration provisions and the proper forum for either? Will there be an assessment provided detailing the capacity Maker Governance has to manage, monitor and manage all risks with respect the arranger relationship where that entity holds legal legal title to the USDC at issue? What are the additional complexities we might encounter regarding the failure or failure to perform of the proxy entity? Is the arranger an entity that is registered or obligated to register with any regulatory authority? Has due diligence been performed to verify that the arranger has all required registrations and internal corporate action to confirm capacity and authority of the entity to act under the implementation terms described here (including incumbency certificates and corporate actions confirming that individuals signing on behalf of the arranger have the legal power to do so and bind the organization)? What are the priorities from the perspective of Coinbase and its U.S. regulators as to what constitutes a suitable legal entity counterparty for Coinbase to face for the performance of MIP81 on behalf of MakerDAO? How might those requirements change in the future? Please specify why you believe that the entity proposed here is well positioned to remain a favorable counterparty in the future. What do we know or can we assess from the current specific enforcement actions and regulatory risks Coinbase is navigating that can help us specify a minimum criteria set for the arranger in this case? In the case of a concurrent insolvency of Coinbase and the arranger, how is a court in the applicable jurisdiction looking to the governing law jurisdictions likely to assess title ownership and requirements for the perfection of any security interests? What is the ideal governing law, legal entity structure and jurisdiction combination so that maximum recovery flows back to Maker core in the best way as may be foreseeable given the gray areas here. Gray areas are no excuse for not playing forward various scenarios with specificity, then working backward with belts and suspenders to manage risk and control outcomes to the greatest extent possible. To that end, are there any additional procedures MakerDAO should complete to further protect its performing-party status with respect any event of default by Coinbase or the arranger? Top of mind of course is the recent ruling in the Celsius Network bankruptcy.  What are the distinguishing facts that provide comfort with respect to the legal structure and laws applicable to the MIP81 relationship with @CB_Institutional?   Reuters – 5 Jan 23    U.S. judge says Celsius Network owns most customer crypto deposits A U.S. bankruptcy judge ruled on Wednesday that Celsius Network owns most of the cryptocurrency that customers deposited into its online platform, meaning most Celsius customers will be last in line for repayment in the crypto lender's bankruptcy.      CONFLICTS OF INTEREST All conflicts of interest should be disclosed and may I suggest the following: (1) any next Poll or vote put before MKR holders include a detailed disclosure of related and intersecting parties involved here, including a detail of the full legal names of which people and their respective roles as CU members, counterparties on other business with MakerDAO, Delegates (if any have been included in the discussions), etc. have been in direct communication with Coinbase regarding the terms that will be put forward to a vote, and (2) the next vote on MIP81 also includes an express written WAIVER of any such described conflicts by MKR holders.     Kam:  SFCU are aware and kept well informed about the ongoing negotiations.   I note that being aware and “informed” is not the same thing as being in the room with direct eyes and ears on the conversation, or having any substantive input in the final results. I think we all want to be clear that mentioning SFCU has been in the loop does not graft on the confidence and trust we have in that team as a group that is a 100% internal actor. To echo concerns raised by others above, there should be significantly more transparency on how MIP81 has been handled to date and will be managed into the future. If all of what I put on the table above is just too much trouble, too hard, too expensive to find out, takes too long, etc… than I would suggest it is not suitable to push 1/3 of DAO assets into the deal. P.S. MAKERDAO IS NOT A CUSTODIAN Unrelated to the above, I wanted to add my two cents here that MakerDAO is NOT a custodian or in the business of custody in any way from my perspective.     SebVentures:  It is not lost on anybody that MakerDAO is kind of in the custody business as well, and in my view, better than any off-chain custodian could be (but with different tradeoffs).   ",
                    "links": [
                        "https://www.reuters.com/business/finance/us-judge-says-celsius-network-owns-most-customer-crypto-deposits-2023-01-05/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.670719696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#15",
                    "likes": "6",
                    "time": "16/01/2023-18:12:03",
                    "content": "    rune:  Based on my understanding this is not the case, and the ability to veto withdrawals should be considered similar to the ability to blacklist USDC.   This is understandable, but begs the question: If Circle can already blacklist the USDC, why does Coinbase need a veto? It adds additional counterparty risk. I’d suggest @CB_Institutional use their long-standing relationship with Circle to ensure compliance where necessary. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#16",
                    "likes": "0",
                    "time": "16/01/2023-18:19:35",
                    "content": "Please include an explanation what kind of technical controls this provision affords @CB_Institutional:  It will store the key to the Maker smart contract in a cold storage hardware wallet located in Ireland. (Clause 4©(iii)  Are the keys to the Owner address stored in Ireland? Or the keys to the deploying address? Please go into more detail here and kindly sum up the technical ramifications. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.821428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#17",
                    "likes": "1",
                    "time": "17/01/2023-16:29:30",
                    "content": "    rune:  Based on my understanding this is not the case   Rune, what is your understanding based on? Have you had any private conversations with Coinbase about this deal? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}