{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/meet-your-delegate-2-wednesday-august-4-6-00-pm-utc/9575",
            "title": "Meet Your Delegate #2 - Wednesday, August 4 6:00 PM UTC ",
            "index": 9575,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "delegation",
                "public-call",
                "pubcall-:-meet-your-delegate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "8",
                    "time": "29/07/2021-15:20:51",
                    "content": " 1280×720 503 KB   Meet Your Delegate #2  Welcome the [announcement for the] second episode of Meet Your Delegate, where MKR holders and the broader community get to know their delegates  For this episode we will have delegate candidates Tim Black (@twblack88) and @Planet_X presenting their platforms and holding an AMA session. @LongForWisdom will be doing the hosting   When 2021-08-04T18:00:00Z Mark it on your Google Calendar!  Where Zoom Join Link  Meeting ID: 867 8830 7759 Passcode: VOTE   One tap mobile +13017158592,86788307759#,*384072# US (Washington DC) +13126266799,86788307759#,*384072# US (Chicago)   Dial by your location +1 301 715 8592 US (Washington DC) +1 312 626 6799 US (Chicago) +1 346 248 7799 US (Houston) +1 646 558 8656 US (New York) +1 669 900 9128 US (San Jose) +1 253 215 8782 US (Tacoma) Meeting ID: 867 8830 7759 Passcode: 384072 Find your local number: Zoom International Dial-in Numbers - Zoom  ",
                    "links": [
                        "https://us02web.zoom.us/j/86788307759?pwd=TUpuQVREcW85ZmFndXl5ZENRVDVSQT09",
                        "https://us02web.zoom.us/u/kcWqYHbl5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-152-thursday-july-29-17-00-utc/9553/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-56/9649",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/45",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-152-thursday-july-29-17-00-utc/9553/5",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-23-29/9583",
                        "https://forum.makerdao.com/t/maker-relay-ep-56-en-espanol/9812",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/2",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2021-08-05/9713"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.60669191919192
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#2",
                    "likes": "1",
                    "time": "31/07/2021-15:42:51",
                    "content": " Meet your Delegate - Episode #02  August 4th, 2021  Agenda   00:00: Intro with LongForWisdom  01:20: Introducing Planet_X and Discussion  30:45: Introducing Tim Black and Discussion  59:12: Outro   Video https://youtu.be/n4eILXWY_28  Introduction  LongForWisdom  Agenda and Preamble 00:00  Welcome to Meet your Delegate #2! The meeting in which we get to speak to people who want to be recognised delegates, ask them questions, and make them feel uncomfortable! I am joined today by two more of our recognised delegates: Tim Black and Planet_X.   Planet_X  Presentation 01:20  Planet_X Pic1435×806 55.1 KB   Discussion 08:22  Frank Cruz: How important is it for MakerDAO to have a marketing Core Unit or do you think that the community along with Content Core Unit can do a good enough job to provide that marketing that we need. I want to get your thought process when it came to campaigning against the recent MarComms Core Unit.  13:05  Jerry G: You mentioned that you are generally always voting, are there any specific examples of when you might abstain from voting?  13:38  Payton Rose: Do you have any philosophy or insight you could share with us as to how you go about balancing that desire to scale versus that measured take on granting Core Unit privileges?  15:05  LongForWisdom: There has been some discussion lately about adding permission Vaults to MakerDAO. Where do you stand in the issue of permission Vaults versus permissionless access to stuff? Do you have strong feelings either way?  17:13  Jerry G: On that same note, there has been a lot of discussion about adding different types of PSM Vault types. Do you have any feelings about one or the other? Would you generally support adding more?  18:21  Seth Goldfarb: Any thoughts on pay for delegates? Do you have any opinion on the development of political parties? Would you support that or not?  20:27  Someone: What is your view on the state of RWA in MakerDAO and where would you like to see that going?  23:25  Juan Guillén: You manage to be the red team and very outspoken which is both a good thing and a bad thing. Some people do not appreciate a lot being told things that straightforwardly. You also managed to write a MIP and then you decided that it generated too much conflict and you took it back. Do you think that would change eventually when you start getting this MKR from different holders and they tell you “hey I would like you to vote for this” or is it more like “This is the way I am going to vote, this is my personality and I will go ahead with my own red team technique”?  27:11  Jerry G: You mentioned that you made a post to encourage people to vote against Marcomms Core Unit. Would you see yourself potentially posting about things that you would support and say yes about?  28:36  LongForWisdom: What do you see as the purpose of MakerDAO?   Tim Black  Presentation 30:45  Tim Black Platform964×539 213 KB   Who I am968×542 168 KB   Journey970×547 212 KB   Opportunities and Values968×545 190 KB   Challenges becoming opportunities962×540 185 KB   Cautious Optimism963×542 233 KB   Long Term Scalability970×540 261 KB   Adaptability966×542 214 KB   Putting values to work965×543 182 KB   Updates and Comm964×543 224 KB   Execution964×538 216 KB   Bias962×537 162 KB   Known Biases and Conflicts962×537 218 KB   Joke971×541 243 KB   Fin965×543 151 KB   Discussion 43:38  Seth Goldfarb: Do you feel that it is necessary for any delegate to publicly state the intention to abstain?  44:50  Payton Rose: In terms of time commitment, between your implication in MakerDAO and your day job, how much extra time do you foresee going into being a delegate?  46:40  Jerry G: Do you have any feelings about what it would look good for a Marketing Core Unit? Do you think that the Marcomms Core Unit would have been positive for the DAO? How important do you think Marketing is for us as a DAO?  49:26  Seth Goldfarb: I have asked everyone else to it is only fair to ask you too: delegate pays and political parties.  51:44  Someone: You mentioned something about re-evaluating the burning mechanisms. Can you talk a little bit more about that? And, in general, what do you think about Maker’s value capture?  53:03  Someone: What are your thoughts on RWA, in particular Centrifuge?  54:11  Payton Rose: What do you see as your role as a delegate in the ecosystem? Are you here to represent the wants of the people who delegate to you? Are you trying to push for things? In your mind, what does the ideal delegate do, and how will you follow that?  55:14  LongForWisdom: As a follow-up, do you see delegates acting in a leadership role for the protocol or less so? Do you think delegates should be proposing direction, proposing new ideas, etc, or taking the lead from what the Core Units propose?  57:25  Jerry B: Do you have opinions on expanding PSMs into further types of collateral?   Closing Comment  LongForWisdom  Outro 59:12  LongForWisdom: We should wrap it up. Are there any last links you want to share?  Tim Black: iamTWB_ on Twitter and Tim.Black on Rocket Chat. Feel free to shoot me a DM if you have any other questions or if you want to hop on a call!   Unlike last week, the Delegate UI is now live. If you liked anything you heard today, you can go and use it to delegate to one of these fine people! Thank everyone for joining us! We have got another one of these calls next week at the same time.   Credits   @gala produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/n4eILXWY_28?t=80",
                        "https://youtu.be/n4eILXWY_28?t=1845",
                        "https://youtu.be/n4eILXWY_28?t=3552",
                        "https://youtu.be/n4eILXWY_28",
                        "https://youtu.be/n4eILXWY_28",
                        "https://youtu.be/n4eILXWY_28?t=80",
                        "https://youtu.be/n4eILXWY_28?t=502",
                        "https://youtu.be/n4eILXWY_28?t=785",
                        "https://youtu.be/n4eILXWY_28?t=818",
                        "https://youtu.be/n4eILXWY_28?t=905",
                        "https://youtu.be/n4eILXWY_28?t=1033",
                        "https://youtu.be/n4eILXWY_28?t=1101",
                        "https://youtu.be/n4eILXWY_28?t=1227",
                        "https://youtu.be/n4eILXWY_28?t=1405",
                        "https://youtu.be/n4eILXWY_28?t=1631",
                        "https://youtu.be/n4eILXWY_28?t=1716",
                        "https://youtu.be/n4eILXWY_28?t=1845",
                        "https://youtu.be/n4eILXWY_28?t=2618",
                        "https://youtu.be/n4eILXWY_28?t=2690",
                        "https://youtu.be/n4eILXWY_28?t=2800",
                        "https://youtu.be/n4eILXWY_28?t=2966",
                        "https://youtu.be/n4eILXWY_28?t=3104",
                        "https://youtu.be/n4eILXWY_28?t=3183",
                        "https://youtu.be/n4eILXWY_28?t=3251",
                        "https://youtu.be/n4eILXWY_28?t=3314",
                        "https://youtu.be/n4eILXWY_28?t=3445",
                        "https://youtu.be/n4eILXWY_28?t=3552"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.827036691542289
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/08/2021-15:18:07",
                    "content": "The full call is now available on the Youtube Channel for review:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#5",
                    "likes": "2",
                    "time": "13/08/2021-19:42:37",
                    "content": " Meet Your Delegate: Episode #02   Agenda   00:00: Introduction  01:21: Planet_X  31:08: Tim Black  59:12: Conclusion   Video https://youtu.be/n4eILXWY_28  General Introduction  LongForWisdom 00:00  Welcome to MakerDAO Meet your Delegate #2, a meeting where we get to speak to people who want to be Recognized Delegates at MakerDAO, ask some questions, and make them feel uncomfortable. I am joined by many people and by two more of our most Recognized Delegates, one Tim Black and one Planet_X. The format of these meetings is that the delegates will take a few minutes to discuss their platform and what they care about within MakerDAO. Then we have 15 to 20 minutes, maybe a little longer for questions. We have two delegates that we are going to fit in within the hour.   Delegate Introductions  Planet_X 01:21  I am Planet_X, a full-time crypto investor from Norway, and I want to delegate. First, a little bit about me. I have been in crypto since 2014, and I have been a Maker investor since 2016, regarding the name Planet_X. I am not really anonymous; I just have a strange-sounding Norwegian name. When I found crypto, I chose to call myself Planet_X, and I had stuck with that since then. In Maker since 2016: why have I held on to this for so long? In crypto, five years is a complete geological epoch. The short explanation for that is: First, I believe Maker, due to the ability to mint a stablecoin, has fantastic growth potential. Second, business-wise, Maker has a natural moat around its business. That is very rare in crypto, and I do not see many other projects that have it. Third, the community itself. I believe the community is large enough, smart enough, and active enough not to be outflanked by developments elsewhere. If something comes in from the blind side, I believe the community can respond quickly enough.  To conclude with why I am involved with Maker, I believe Maker is an evergreen investment and will continue to be so for many years. There are other reasons, such as Maker being among the DAO pioneers, and being able to make this type of organization work is very interesting. In regards to Maker governance, I will simply quote my own delegate profile here. I believe in two things about Maker: Maker has to scale, and Maker has to function. Now, needless to say, it is not going to scale unless it first functions. With functionality, I mean directions or methods of doing things that will not damage Maker in the foreseeable future if you leave it untouched. I am not a perfectionist; I am after a good enough approach. Things that I regard as important are governance overhead and organizational focus. That is something to be worried about. This is also why I believe we need to nurture softer aspects like community spirit and culture. The goal is to build a community capable of continuously attracting talent. Regarding scaling, I am simply - out of the closet - a shameless scaling enthusiast. I do not mean to settle for one or two types of collateral onboarding per month. I want systems capable of handling hundreds and eventually thousands of applications per month. Naturally, this is not doable just by adding people, but you need more than that. This is why I am a big fan and a big believer in things like automation, incentives, scaling. An additional important topic with Maker is making the organization overall as friction-free as possible. That is why I believe in being quite strict with allowing new core units. It is a lot easier to say no before they are onboarded than trying to off-board them later. It is going to be much worse. In my humble opinion, it is better to have a thought filter at the entrance instead of off-boarding core units afterward. Sometimes, I am an idea producer, so I have a whole little collection of articles on the forum. I write most of these articles to bounce ideas around and calibrate my own thinking compared to the community. Suppose you are interested in governance or staking or what separates being a shareholder from being a toker holder. In that case, you can look up Planet_X on the forum and read some articles. What do you get when you delegate to me? You get a full-time crypto enthusiast and an investor in Maker since 2016. The interest alignment is near total: I am just looking after a substantial investment of mine anyway. I also have a very high attendance rate, with a tendency to vote on more or less everything. Conflict of interest: I hold some other crypto, in addition to Maker, but the relevant amounts are quite small. I agree to the delegate code of conduct, and I will hereby open up for questions.   Questions  Marketing  Frank Cruz: Recently, you have put up a post on the forum regarding the marketing Marcomms CU. I wanted to get a take on how important it is or not for MakerDAO to have a marketing CU. Do you think the community itself, along with the content CU, can do a good enough job to provide the marketing we need? Do you think it also has to do with the expenditure of adding another CU that could be quite expensive? I want to get your feeling on that and your thought process when campaigning against the recent Marcomms CU campaign.  For those who are not completely involved in the governance of Maker, in the last couple of months, there has been a proposed CU called Marcomms that first made a proposal that was rejected and then made a revised proposal that was also rejected. I was one of the interested parties or people that advised people to vote no. The reason for that was partially their budget which initially was way too high and not sufficiently well-argued. However, I sincerely believe that they were not professional enough and had an outdated view of developments in crypto. Do you want further details, or is that sufficient for you? Let me say that Maker needs marketing, but preferably not by that proposed CU.   Frank Cruz: When it comes to distribution, I believe that distribution plays a big part in how you should market a product. If on scales from one to ten, ten being a huge necessity for a marketing CU or some type of marketing game plan to put into action in the next six months, do you think DAI and MakerDAO have reached that distribution level or do we need a lot more scaling? I bring this up because I know you are scaling yourself; that is part of your delegate proposal.  My honest response to that is: I do not know. I would prefer to see a much more focused approach. Going back a few years, crypto was all about banking the unbanked or offering payment services to various parts of the world. Still, the way gas fees have developed is totally out of the question. When we look at who has major positions among the Vaults and at Maker, at the moment, Maker is basically serving the one percent. Like it or not, that is a fact of life so would I like the marketing to concentrate or not? I am not going to say yes or no to that. I will simply leave that to the next group that gets voted in.   Jerry Goldfarb: You mentioned that you are generally always voting. Are there specific examples of things you might abstain from voting? Or is it hard to say why?  It is not hard to say. I have forgotten it a few times; that is the truth. If you want to know why I have not voted for things, that is 80% I have forgotten about it.   Payton Rose: I have a question about being a big person for scaling but also showing the restraint in terms of, as you mentioned, with core units being easier to say no at the start than afterward. I was wondering if you had some philosophy or some insight you could share with us as to how you go about balancing that desire to scale versus that more measured take on granting core unit privileges.  I would love to be able to answer that question. The honest answer is that so far is mostly gut feeling. There is also opportunity involved, and presently we really need developers. However, I do not think a single real-world company has ever gone bankrupt or had major problems because they lacked a marketing team. I do not really have a precise answer to your question, I would love to have it, but unfortunately, I do not.   LongForWisdom: There has been some discussion in the forum recently around adding permission Vaults to MakerDAO. I am curious about where you stand on the issue of permission Vaults versus permissionless access to stuff and whether you have strong feelings either way.  With permission, are you talking about kick AML permission.   LongForWisdom: No, I do not know how you would call it; I guess not KYC. There was a proposal in the forum about setting up a vote for the next vote. It was about making deals with specific companies that might mint a lot of DAI to get favorable rates.  Purely from an ideological position, I would be inclined to be slightly against it because we are supposed to be for everybody, but in real life, we are not. With scaling, permission Vaults could help that. It could also be a bit dangerous because we could get into complex negotiations with other groups. In general, I am for this type of deal because the landscape of crypto is evolving, and sometimes we find out that some groups are so important that they need a permission Vault. It will be a cautious yes to your question.   Jerry Goldfarb: On that note, there has also been a lot of discussion about adding different types of PSM Vaults. Do you have any feelings on one or the other or whether you would support generally adding more?  In general, I love the PSM modules. The only stablecoin I am very cautious about is Tether. Regarding the other stablecoins, I am all for expanding the PSM; it is just necessary. Especially if there ever is a central bank-backed cryptocurrency, I want the PSM to deal with that as well. I think that the PSM is here to stay.   Seb Goldfarb: Any thoughts on pay for delegates? Do you have any opinion on the development of political parties? Would you support that, or is that something you think you would avoid?  Alright, the political part is first. That is a development I would really not like to see. If we cannot avoid it, it is quite far off into the future. To have political parties, you first need to have a fixed cake, and then you fight for portions of that cake. MakerDAO is growing so fast, and it will continue to grow so fast for several years so that fixed sum of money to fight for is not going to be a topic for some time yet. Concerning delegate pay, I am for it. Personally, it is not going to be very good because it will involve value-added tax and normal taxes on top of that as well as accounting, so I am not going to profit from this. However, other delegates also need to justify the time that they spend on this, and the only way to justify that is to pay them. So yes, delegates will have to get paid.   Someone: What is your view on the state of RWA in MakerDAO, and where would you like to see that go?  We were just having a meeting about that. There are several issues. Purely from a scaling perspective, it would be fantastic if we could prioritize the ability to onboard US treasury notes. The interest rate will not be very high, but the amount is practically unlimited. Then, there is the overall risk picture. That is different, and eventually, if you are too dependent on any type of collateral, the risk picture could become a bit uncomfortable. Other people say that since the interest of these US treasury notes is so low, it might not be very interesting and that it is better to do project financing. Maker, as an organization, should be very careful about financing projects directly because it is a very steep learning curve, and I am not sure we are supposed to be project financers. Then, there is a question about the time frame. Do we go for 10-year treasury notes or six-month trade finance? There are pluses and minuses to all of these collateral types. I think what we are doing right now is perhaps the best thing: we are doing a little bit of everything, we learn as we go, and basically take it from there. Doing one thing completely from the outset, I am not sure it will help us in the frame of one to three years. I think it is better to start a little bit broad like we are doing now.   Juan Guillén: I wanted to comment on a couple of things. The first one is that you manage to be the “red team” and be very outspoken, which is both good and bad. Some people do not appreciate a lot being told things that straightforwardly. Another thing is that you did manage to write a MIP, and then you decided it was generally too much conflict and took it back. I do not know if this is part of the north’s personality. Do you think that would change eventually when you start getting this MKR from different potential holders? They tell you, “I would like you to vote on this,” or is it more like, “this is the way I am going to vote, this is my personality, and I am going to go ahead with my own red team technique”?  That is a good question. I have partially cheated on the delegate thing already. I have an inbox with fan mail, not-so-fan mail, and various attempts at the vote influencing; what can I say? Of course, if people want to discuss something, I should, in general, be available, but I am not sure how productive that is. Out in the real world, the so-called active ownership role, what you call the red team, sometimes it works, and sometimes it does not work. If you are a decision-maker, sometimes you need to keep a certain distance, which can partially become problematic. I do not have a definitive answer to give you. There was a question about becoming a politician, and I do not feel like becoming a politician. As long as I feel like I can add something by just being myself, I will stick to that, and if not, I will see how it develops.   David Utrobin: Is it possible for the recording to get some definitions of what exactly is red teaming? Because I know that is a bit of a jargony word.  Juan? You mentioned it first. Juan Guillén: I thought David was going to do it.   David Utrobin: You think of it like red team versus blue team. The home team is considered the blue team. The purpose of the red team is to disagree and try to figure out all the bad things that the blue team is doing. Their role is to produce constructive criticism. Sometimes that can affect people’s emotions, and it will produce a better result, assuming the person with the hurt emotions does not quit.  That is my interpretation of it as well. I am sometimes a bit of a contrarian but not all the time.   Jerry Goldfarb: As a follow-up to that, I know you have posted encouragement to vote no on the Marcomms CU. Would you see yourself potentially posting about things that you would support and say yes about?  Yes, absolutely. You are totally correct about that. I would definitely say, please vote yes to this and that. Most of the time, I have looked into the voting at Maker; around 85% of the votes are “click yes.” There is no discussion. The controversial ones are some decisions that are assumed to be a no-brainer. Suddenly, there is quite a lot of discussion about it.   LongForWisdom: I will end with a broad question. What do you see as the purpose of MakerDAO?  It is fantastically hard to forecast the future and practically impossible. If Maker could help lower the cost of capital, that would be a purpose, and I think we are on the right path. I was thinking about some big humanitarian thing, but no. If we can lower the overall cost of capital, that would be very good for many people - good enough for me.     Tim Black 31:08  849×474 223 KB   Hello everybody on this call and out in the metaverse of the internet. I am Tim black presenting my delegate platform here for MakerDAO. I will do a little background on who I am and why I am here and then get into some values and others.   848×478 222 KB   I feel like it is fun to talk about the crypto Journey we all started on. I am old, so I have been in the space adjacently and gradually become more involved since 2013. I had my “aha” moment when I recovered a wallet from Seed in 2016, and I became professionally involved in 2018. You can go to my Linkedin or to my platform, where I put an overview of the places where I have worked and the roles I have had. I have been involved in a variety of companies on the spectrum of decentralization. From a centralized company going from Seed to Series B to working for the Foundation as a grantee. Ten years of chasing being a musician gigging a lot, being a small business owner, and hustling. I love framing this whole thing as a blend of product, operations, and community. Those are all the focuses where I am always trying to continue to think, learn about, and are the lens that I generally take to look at the Universe.   847×476 210 KB   The meat of a delegate’s platform is looking at Maker’s challenges and our own values. I like to phrase challenges as opportunities; perhaps that is optimism.  I see Maker’s largest challenge right now as removing our coordination friction. Diversifying our supply, no real surprise there. I am not presenting anything earth-shattering as a delegate but still worth mentioning. Another challenge that we have had is connecting to the broader Tech ecosphere that we live in and then the Web3 Community within DeFi itself.   851×476 235 KB   My first value is cautious optimism. You could also call this strategic patience, which is essentially I would be voting for things that mock or follow the way that PE goes. They ship well-tested, reliable, and space-grade code, so I would vote for more of that. The mechanics would be delayed for more testing, stressing audits, thinking through what we are shipping, not bundling executives. I liked what happened with the most recent executive. There was a really thoughtful amount of work put into delaying those and making sure that they matter. To be optimistic and patient, mechanics matter the most. I am on the side of all the other delegates that we need some more ilk's in our system, but I like to be conservative to see how fast things fill up. I would also extend that patience into RWA until there are just more of these companies, as a capitalist that loves to see competition. I’m really excited to see what happens there. In a nutshell, cautious optimism is staying mindful of the threats that come. Recognizing that there is competition and celebrating our wins when we can. There will always be another fire to put out; we just have to be thoughtful with each other.   851×479 250 KB   Another value that I put up was long-term scalability. This is broken down into three bullet points: growing DAI Supply, being diverse in our portfolio, and, most importantly, scaling the DAO. You can see these bullet points as sort of pre-alpha; as someone who wants to see us scale the supply, really thinking through how that functions. Investing in our growth is very important. Some of the points on diversifying the portfolio are really important to our long-term growth. Planet_X said it more elegantly than I did. Having hundreds of different types of assets to choose from, and in a few months, there will even be more to choose from. I mentioned RWA, but as long as we continue to take the same approach there with watching these companies come in and develop the innovations, walk and then run, it is going to be really helpful. We will have a longer discussion about those later. Still, there are other technical types of diversity that we can look into. There is an incredible amount of things happening with NFTs right now, with services like Fractional coming online. Inevitably, soon it will be wrappers that set price force and make things easier to discover. I am really excited to see the innovations that come there. Most important to long-term scalability is scaling the DAO itself. There are some ideas here, and I am happy to pursue those with anybody interested.   852×479 226 KB   The final value that summarizes my point of view is adaptability. I am a technologist first-rate. I see there are a lot of easy wins sitting around on the forum. There are a lot of MIP6s that are stuck. It would be wonderful to push those through, diversifying that supply a bit. I also really loved the way Sam took the approach to prioritize scope types. Similar to the G-UNI thing, when you put up the gelato wrapper for the Uniswap positions. Mostly they approach where we would like to prioritize this to free up pressure on USDC exposure, which I thought was really smart. Another adaptability thing, which is a pipe dream, but I figured out at least put it in here, is the discussion about the Surplus Buffer. I am really excited to participate in those discussions. As I said earlier, if we are thinking about our long-term scalability funding groups, it would be really cool to evaluate the mechanics of burning itself by an outside group. Maybe a MIP5 would be perfect with this one.   848×475 223 KB   Values are cool, ideas are great, but we want to be able to put those to work. Should people decide to delegate to me, which I found out today, there is at least one out there; I will try to communicate as best as possible to serve their interests. I tend to be curious, which is a blessing and a curse. I will probably reach out to understand upcoming changes if I do not understand them already. I will abstain if I feel I cannot really provide the right value from the vote. We talked about voting mechanics earlier and participation specifically. We tend to put things up that are really worth voting on, so I’m excited to do some more of that. As always, my DMs on Rocket Chat and Twitter is open. If people want to have a more candid discussion, I am always happy to hop on a call.   852×477 232 KB   I also see putting values to work is just basically execution. To me, delegation is about balancing your delegate and the CUs to find the win-wins where you might disagree. The campaigning is good, not actually my thing, but I would love to improve on that. Mostly I have been professionally working, so that will continue. As delegation grows, we will likely inevitably have some debates, which will be on a call like this. It will be a very fun thing to play a part in. I also think it is important to talk about Maker Relay, which comes out every week. Inevitably as delegates start posting their positions, I will most likely recuse myself from editing those sections. I think it is really important to not have any editorial eyes on that.   849×474 225 KB   I have not seen anybody do, but I felt it was a pretty good idea to talk about bias. We’re all humans; we all have some biases. I figured out to put these three that really matter at the top. First, I am a technologist. I have always been tinkering with technology in different ways. Second, I am an American and soon to be an LLC. Global perspectives get lost on us sometimes, but I will really try to do my best to advocate for a global user base. It is important to remember that Dai is a global protocol with many users in many places, with many use cases, which is partially what makes it so exciting. Still, it is something that we definitely should get better at thinking through. Third, I have some meager holdings in the space.   Questions 43:38  Seth Goldberg: If you feel like you do not know enough about a certain voter, that situation where you said you would abstain, do you feel like it is necessary to publicly state that you intend to abstain, not just for yourself but for any delegate,? Because I imagine that maybe some delegates might want to move their delegation as a result, etc.  I can say it depends, which is not great. The pattern of us posting when we are voting will likely alleviate that and uncovers the best practices as to why one would abstain.   Payton Rose: I have a question in terms of time commitment. You mentioned working on Maker Relay; you do a lot of deep dives into the state of Dai and where things are there. This is super helpful for the community. I am wondering between that and the day job. How much extra time do you foresee going into being a delegate?  So, Maker Relays are a regular commitment on Mondays. I see delegation as this responsibility. I think I put this in my statement that I would aim to be upping my time to participate more. I know we are tracking participation as part of being a good delegate. I will definitely point out that I’m not the most active person on the forums. This was a choice about a year ago, and then it spiraled out of control. It is a long story to get into. Still, I think participating in this weekly assembly of what we have to vote on, why it matters, and what is happening in the community gives us the advantage. If it does not, I will have to dog food it to make it easier to delegate. I would look for anywhere between 10 to 20 hours. The day job definitely does take priority, so I have not been able to attend as many meetings, but it is manageable. The good thing is that I continue to work in Web3. There is a lot of overlap between being a delegate and then learning about that experience through the place where I work the day, which is the rabbit hole.   Jerry Goldfarb: I want to touch on the marketing thing again. Do you have specific feelings as far as what would look good for a Marketing CU? Did you feel this strategic Marcomms CU would have been positive for the DAO and how important do you think marketing is for us?  I will start off with “Does marketing matter for a DAO?”. Yes and no. As a community person, I think emergent community Word of Mouth is far more important than any professionalized campaign. As a technologist and Web2 person,  you have to have some level of marketing spend. Normally in Web2 companies marketing spend equals Vaults open. That brings me into the tricky CU thing. Because some people are either in or out of the Foundation, they are in this weird quantum state of proposing a team where they cannot really talk about what they have done. That handicapped their ability to explain what they would do. I wish there was an interim governance process that would make it simpler for folks to establish what their plans are specifically.  It would be really wonderful to see a fleet of marketing teams. A couple of different ones focused on different things. The low-hanging fruit there is to establish a marketing domain and then just split the work up on different teams. That might be a possible solution. I would say that not having a marketing team may have been helpful. There is this Fortune article where they mention Dai but not MakerDAO. Ultimately that would fall on a marketing team, and it would be nice to have folks running that relationship. I welcomed their revised application. Hopefully, they can work with SES, although I do not know if they are the proper team. Work with the Governance Community to find a model to pay their bills. At the same time, they wait to present themselves sustainably. I feel like that is a little bit of that friction that I mentioned earlier. It is hard to exist in a Quantum State when you have got student loans.   Seth Goldfarb: I have asked everybody else. So it’s only fair to ask you too.  Delegate pay and political parties: do you feel similarly to Planet_X, or do you disagree? It is too early to tell. I joked on Twitter that we are all part of the scaling Dai party, which is more of a concept than an organizational thing. I believe this is the first wave of delegates, and we will start to uncover better ways to work together. I believe Wouter presented parties that might emerge as the supply grows and there is more diversity to approach; that will inevitably happen, although I see more like a public coordination thing than a political party where we are splitting up a pie and fighting. Regarding delegate pay, this stems from some of the work we did with Community Development. Still, everyone should be paid for good work. I do like that the platform is built on participating and tracking what people are up to to be more transparent. I prefer that whatever our pay model happens to be, it ends up being a really long-term incentive. Hypothetically, MKR is the chosen thing to pay in. You are voting in it; you get paid in it. I believe another delegate brought that up. I would want to see a model set up to emphasize participation over the long term, similar to startup runs. That would be reasonable, and I am happy to jump into that conversation when we decide to start having it. But the most important things right now are to know: Does delegation work? Are these things functioning the way we want them to? Are people efficiently getting their voice out there? Are people being hurt, or is it getting too noisy? That will come on time. Someone: I am not that familiar with the discussion, but you mentioned something about re-evaluating the burning mechanisms. Can you talk a bit more about what you think about that and maybe how you overall think about Maker’s value capture?  I would say that Maker’s value capture, and for Maker in general, it has some of the most solid business principles in the entire DeFi space, which I really like. As far as the Surplus Buffer goes and burning specifically,  it would just be really good to fund an independent report of some folks who have the same traditional expertise as Risk does. Just looking at how well Burns has performed for the function they need to do. They published a buyback on Burn piece that I thought was really inspiring, and that is why I was making that point. I think that there is a more elegant function to free up burning from where our expenses are. I might be echoing PaperImperium on this one, but it is really important to try and separate those out in some form of fashion. And that is a longer discussion.   Someone: What is your thought on RWAs, and in particular Centrifuge that is out there making up a big part of what’s currently going on? I am really excited to see what 6S does to bring things online in the RWA companies. But I am a bit of a capitalist. I really want to see healthy competition before we have got too much exposure to RWA. That is just my personal take. I think that Centrifuge has done an incredible amount of work to function with the governance community. I think that these are experiments into a sector of the world economy. Maker needs to have exposure to them. I would like to see more companies come online and take the same approach. Hopefully, we can improve the process for that on transparency and the functionality of it over time. Payton Rose: I am going to ask something about your delegate philosophy. What do you see as your role in the ecosystem? Are you there to represent the wants of your people who delegate to you? Are you trying to push for things? In your mind, what does an ideal delegate do, and how will you follow that?  I think it is a balancing act. It is all about communicating why you are voting, what you think is important to the Protocol. There will be times when you might disagree with the folks who have delegated to you, in which case we have that un-staking mechanism right around locking. I think the ideal delegate communicates what their position is and why with the interested parties.   LongForWisdom: As a follow-up, do you see the delegates is acting in a leadership role to the Protocol - proposing direction, proposing new ideas- or they should be taking the lead from the CUs and approving stuff they propose?  There is a fascinating space between CUs and MKR holders to inhabit what that niche’s guard rails look like. I do not think they are really defined at the moment. I think it will be an experiment to see how exposing your position of being as transparent as possible leads to that type of interaction. I think we should not be depended on to be leaders. I think that might end up in this place where four or five of us are voting with most of the shares, which would be less than ideal. It is a little bit too early to tell, but they should try to be as transparent as possible, and that is what delegation allows us to achieve. Now we have a voice to MKR holders. Whether it is a delegate serving in this in-between state, DMing random firms to make sure that the vote is okay, and then going back to the forums to talk to governance. We will see, but ideally, I think they should be opinionated at least. And then, if they want to work with other CUs, I think it is definitely worthwhile to recuse themselves from compensating conflict interest.   Jerry Goldfarb: I asked the same question of Planet_X. Regarding the PSMs that have been discussed and the one from Paxos that was posted earlier today, do you have opinions on expanding those into further types of collateral?  More collateral is good. I am always down to see how those things go. If you look at stablecoins as a market, DAI represents 7 to 10% of the supply of the total worldwide market. Enabling that functionality is good. I would echo Planet_X to say that Tether has some concerns. It did not seem to be performing well because it is mostly a centralized exchange instrument rather than a decentralized one. I ultimately see that as we bring on other types of assets in the PSM exposure, especially to USDC at the moment, we will gradually go down. PSM may end up being a small part of the pie, like 20%, if there are like four of them. They are dominating, depending on whichever market is most fluid on Curve or something. As long as the code is working and the DC is relatively conservative, if people are using it, that is fine. I see the PSM as this product that we built to alleviate Vault pressure from USDC, but then people like it so much that it is getting used. It is a good problem to have that people want to use this thing. It would be nice to diversify, and I think we will get there.   LongForWisdom: Any links or anything you want to share?  They should be there in my delegate post. I am TWB_ on Twitter, my DMs are open. On RocketChat, it is @tim.black. Feel free to shoot me a DM if you have any other questions or you want to hop on a call. I will be happy to do that.     Conclusion  LongForWisdom  Unlike last week, the delegate UI is now live. If you like anything you heard today, you can go and use the uidomain.makerdao.com to go and delegate to one of these fine people. Thank everyone for joining us. We got another one of these next week same time!   Common Abbreviated Terms DAO: Decentralized Autonomous Organization RWA: Real-World Asset DeFi: Decentralized Finance  Credits  Alejandro Fernandes produced this summary. Andrea Suarez produced this summary. Artem Gordon produced this summary. David Utrobin produced this summary. Gala Guillén produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/n4eILXWY_28?t=81",
                        "https://youtu.be/n4eILXWY_28?t=1816",
                        "https://youtu.be/n4eILXWY_28?t=3552",
                        "https://youtu.be/n4eILXWY_28",
                        "https://youtu.be/n4eILXWY_28",
                        "https://youtu.be/n4eILXWY_28?t=81",
                        "https://youtu.be/n4eILXWY_28?t=1816",
                        "https://youtu.be/n4eILXWY_28",
                        "http://uidomain.makerdao.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.89080184338168
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/09/2021-20:22:23",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}