{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-real-world-asset-fast-tracking/13563",
            "title": "[Signal Request] Real World Asset Fast-Tracking ",
            "index": 13563,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-rejected",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "9",
                    "time": "02/03/2022-19:44:20",
                    "content": " Context GovAlpha has noticed that we have needed to deal directly with RWA originators / issuers over the past year. Due to a number of factors, many of these issuers are frustrated with the opacity and speed of the processes in place at MakerDAO. Dealing with issues surrounding real world assets has become more common recently, likely due to the leadership transition within the Real World Finance Core Unit. In an ideal world, GovAlpha would not be spending so much time dealing with the concerns of RWA issuers. This forum post is meant to both:  Clarify the existing available options to Real World Asset issuers that want to be onboarded at Maker. Determine whether governance supports a temporary fast-track process to ease some of the frustration and backlog across existing issuers.   Existing Options for RWA Onboarding As GovAlpha sees it, the existing options available to RWA issuers are:  Working with the Real World Finance Core Unit to propose using the weekly governance cycle. Propose onboarding via the MIPs framework as a new MIP (not only a MIP6 application.)  GovAlpha strongly recommends working with the Real World Finance Core Unit as a starting point. Note that when pursuing option #2, it is expected that the MIP in question contains the information required for Maker Governance to make an informed decision on the collateral. This includes, but is not limited to:  The desired on-chain parameters for the RWA vault. A full description of the collateral, how it is secured, and what recourse MakerDAO has in the event of issues. A clear description of the terms of the proposed agreement with MakerDAO.   Temporary Fast-Track Process Additionally, GovAlpha would like to determine whether the Maker governance wishes to support a temporary fast-track option for issuers that have worked with Maker in the past. Multiple issuers have spoken to us and expressed concern about the delay between an initial application and concrete decision-making taking place. We feel that this may be a way to mitigate this and help show that Maker is considerate of the demands on issuers and their timelines. Following are what we consider to be the pros and cons of this approach:   Pro - Shows that Maker can be flexible and sensitive to issues facing RWA issuers / arrangers that wish to work with MakerDAO.  Pro - Could allow MakerDAO to onboard RWA faster, leading to more DAI minted, and increased revenues.  Con - Requires Maker Governance to decide whether proposed collateral is safe and benefits Maker without evaluation from core units.  Con - May expose Maker to additional risk as a result of imperfect legal frameworks.  Con - Undermines the mandate of the Real World Finance Core Unit.  Con - Bypasses the monthly governance process.   Fast Track Process Requirements  The issuer / arranger must have been working with Maker for at least 1 month in the past. The outcome of individual fast-track processes will be done via signal request (both off-chain and on-chain parts as usual.) The details of the collateral / structure onboarding must be written up in MIP form and following both the general MIP template and containing the information required for Maker Governance to make an informed decision on the collateral / structure. This MIP will be marked ‘Accepted’ if the signal request is successful. The full details must be made public in MIP form and a signal must begin prior to April 1st, which will mark the end of this temporary fast-track process. The off-chain portion of the signal must last for fourteen days, if successful it will move on-chain on the following Monday. GovAlpha must sign off on the signal to ensure that it meets both the general signal requirements and these fast-track requirements. @Prose11 and @LongForWisdom are the contacts for this.     Should we allow issuers / arrangers that meet the requirements above to attempt to onboard their collateral / structure via a temporary fast-track process for the next 1 month?  Yes No Abstain     0 voters      Next Steps for this poll The off-chain portion of this signal request will last for 1 week, and will conclude on 2022-03-09. If the off-chain portion is successful, this signal will move on-chain on the following Monday (2022-03-14.)  Next Steps for Issuers / Originators For issuers wishing to use this fast-track process as soon as possible we suggest the following:   Propose a signal request as soon as you have met the requirements and in parallel to this general signal.   If this general signal is unsuccessful either off-chain or on-chain, the outcome of any specific signal will be rendered null and void and no fast-tracking process will take place. In this eventuality, we suggest issuers pursue onboarding with the Real World Finance Core Unit or via the full MIPs Process.   ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-180-thursday-march-03-17-00-utc/13622/3",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-03-04/13655",
                        "https://forum.makerdao.com/t/weekly-relay-march-1-7-2022/13731",
                        "https://forum.makerdao.com/t/mip65-project-clydesdale-monetalis-arrangement-i-liquid-bond-strategy-execution/13148/41",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/10",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-2/14201",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-2-9-2022/13804"
                    ],
                    "GPT-summary": "The post is a proposal by GovAlpha to clarify the existing options for Real World Asset issuers to be onboarded at MakerDAO and to determine whether governance supports a temporary fast-track process to ease some of the frustration and backlog across existing issuers. The proposal outlines the existing options available to RWA issuers and the requirements for the temporary fast-track process. The post also includes pros and cons of the fast-track process and a poll for the governance to decide whether to allow issuers/arrangers to attempt to onboard their collateral/structure via a temporary fast-track process for the next 1 month.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.5185080619863225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "5",
                    "time": "02/03/2022-19:52:33",
                    "content": "@williamr @Allan_Pedersen @mrabino1 @spin @rune @luca_pro @SebVentures for visibility if they wish to comment. Also @Recognized-Delegates. I want to make clear that we’ve posted this signal as a way to ensure that governance has visibility and optionality on moving forward more quickly with the onboarding of real world assets. GovAlpha will not vote in this signal, and neither supports or opposes any outcome. However, we felt it was important to make the question public given recent conversations with Maker’s potential RWA partners. We recommend that potential RWA partners work with the Real World Finance team as a first point of call, and to use the MIPs process if they wish to present directly to Maker Governance. We feel this fast-track process is workable, but from a governance standpoint prefer the monthly governance cycle under the MIPs framework due to the requirement for a longer RFC period. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.699404761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#3",
                    "likes": "21",
                    "time": "02/03/2022-21:09:32",
                    "content": "I believe that, in the current status (legal, structuring, credit) of immaturity of the RWF<>DeFi bridge, and due to the quantum of DAI requested by borrowers, a fast-tracked process without professional review constitutes an existential threat to the protocol. I will ABSTAIN only because of my personal involvement in the underwriting and reviewing process. However, I will remind the community that bridging real world and DeFi has never been done before, and is complex. We are seeing finally a significant improvement across the board, and I’m sure that all credible and scalable counterparties will recognise that the connection requires heavy lifting and is inconsistent with a fast tracked process. I am comfortable to assert that no professional and credible counterparts should endorse an unprofessional, and unsubstantiated, application process, as it moves the playing field from one of merit to one of political lobbying. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.617647058823529
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#4",
                    "likes": "18",
                    "time": "02/03/2022-21:28:33",
                    "content": "After the approval of SocGen, RWF and CES have spent months figuring out how to onboard them. Centrifuge hasn’t been an easy one either. How can we Fast-Track a process that’s so new for everyone, from a legal and technical perspective? How can Maker Governance know more about the risk associated with these assets than CUs elected to help the DAO on that? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.974747474747475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#5",
                    "likes": "13",
                    "time": "02/03/2022-23:39:44",
                    "content": "I am usually more of a restrained type. I tend to seek the multiple points of view before making an educated statement on any matter. Also, I am an old-fashioned Kiwi that believes in civility and professional dealing of any matter in the affairs of the RWA, by removing my personal bias or personality from the subject of evaluation. But I’ve also been around for sometime. I truly believe that professionalisation and multi-CU sharing of responsibilities for delivering RWAs is the only path forward for Maker to become a well-regarded player in this market and to create strong basis for decentralisation. I make every humanly possible effort in creating bridges within the DAO between CUs to streamline and professionalise the process. It’s a destination with many steps to get there. But I truly believe that not making those bridges puts us in a worse off position of defiance and lack of mutual trust, internally (i.e. lender side). Guess what, we’re humans. Without mutual trust and professional respect we’ll achieve nothing. At least, nothing together. This SR matter in particular sort of threw me off my normal balance. I am deeply disappointed this conversation was not held prior to a SR with the required professional inputs taken into account before a call to action. Taking professional inputs from borrowers only is certainly not an advisable strategy if you sit on the lender side of the equation. This “fast-track” approach is deeply disturbing. At this stage of the evolution of RWAs, enabling full self-dealing by borrowers in a pure DeFi way without any lender side oversight or due-diligence with a wide variety of possible collateral and structure type considerations is not about giving Delegates and MKR tokenholders an option. It’s about architecting a roadmap for catastrophic borrower behaviour with many implications for credit risk at the core of the protocol i.e. DAI and MKR. While a “fast-track” approach is something that we could one day aim for (maybe), doing this right now is a “kamikaze” approach at best. Every @Recognized-Delegates and token-holder should be informed this is even a path the Community is considering seriously. Why don’t we just hand off DAI for free and press the write-off button simultaneously, then? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.366071428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#6",
                    "likes": "7",
                    "time": "03/03/2022-00:35:24",
                    "content": "No, no, absolutely not. What is going on here? A “fast-track” process makes no sense at all. An ill considered, “temporary” process snatches defeat from the jaws of victory. @williamr is not at all overstating his case. Co-sign. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None"
                    ],
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#7",
                    "likes": "7",
                    "time": "03/03/2022-00:43:01",
                    "content": "This is a strange request.  It appears that the the Borrowers (originators) want to design a less rigorous Loan review process so that they are more likely get a Loan from Maker, and likely at more favorable terms.  This would probably increase the risks in RWA asset portfolio significantly. It also sounds like a good way to turn the DAI into an unstable coin ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.161458333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#8",
                    "likes": "0",
                    "time": "03/03/2022-01:21:25",
                    "content": "Where can I understand the story here? I am guessing there is many subtexts in these comments Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#9",
                    "likes": "9",
                    "time": "03/03/2022-01:57:44",
                    "content": "I believe that it is quite clear. Governance is suggesting a fast-tracked approach to give the ability to them and ultimately token holders to bring up for a vote any real-world collateral borrower: i) without a professional credit review of the collateral proposed ii) without an existing (without even mentioning reviewed by an external legal party) legal contract iii) without a proven technical layer iv) without any disclosure on related party interests v) without any committed monitoring mechanism All this, in an asset class that is deeply immature, hasn’t yet figured out a proper way to do i) to iv), and in a quantum that aims at 100s of MM. I believe we have nothing to add, and I personally feel concerned that such a proposal has been directly submitted by Governance (and unsurprisingly endorsed here by a plethora of potential borrowers) rather than by the potential borrowers themselves. I believe this jeopardises Governance’s position as a neutral arbitrator, contrary to what has been stated in the post. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 5.233333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#10",
                    "likes": "4",
                    "time": "03/03/2022-02:07:49",
                    "content": "    LongForWisdom:  Additionally, GovAlpha would like to determine whether the Maker governance wishes to support a temporary fast-track option for issuers that have worked with Maker in the past.   I appreciate the critic @luca_pro , but do wish to clarify that this is not GovAlpha suggesting this is the direction that should take place. Rather it is an ask to the community, and potentially the MKR voters, if they feel this approach should be considered legitimate for RWA borrowers that have been engaging with the protocol for some period of time. The risks mentioned here should be weighed heavily against the benefits of allowing MKR holders to vote on opportunities quicker. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#11",
                    "likes": "3",
                    "time": "03/03/2022-02:09:29",
                    "content": "Thank you @prose11 - I am not disputing the good faith of Governance, but I believe that an interested borrower would have always had the ability to publish this Signal Request independently and that the message, in that case, would have been more transparent for the community. Thank you for your reply. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#12",
                    "likes": "9",
                    "time": "03/03/2022-02:17:54",
                    "content": "I sympathize with RWA issuers, as the process of onboarding to Maker is complex and time consuming with little assurance of obtaining the requested financing at the end of the process. I’m confident the process will get better over time as legal issues are addressed and Maker gains more experience with underwriting and loan processing. That being said, these issuers are presumably approaching us for a reason - they can’t get as good of a deal with traditional bank or non-bank financing as we might be willing to offer. If they had a traditional lender willing to offer them credit on similar terms, we would not be having this conversation because the issuers would have already moved on. What I take from this is, the issuers coming to Maker are likely to have a worse risk profile than the market at large (at least in the aggregate) and we should not cut corners on credit or legal review to accommodate them. Doing so could lead to further adverse selection. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.55968045112782
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#13",
                    "likes": "4",
                    "time": "03/03/2022-02:22:02",
                    "content": "Thank you for your point @monet-supply. It is relevant but soon hopefully not anymore, as we are seeing high-quality and institutional borrowers approaching the protocol because Maker would still be a useful extra pool of liquidity, and the engagement with DeFi might help their equity story. We cannot share those names yet due to confidentiality, but we have seen a step-change in the level of the counterparts and collateral. There is another point though I would like to stress again. We have seen significantly (sometimes absolutely fatally) flawed legal documentation in some of the reviewed proposals. Our opinion has been corroborated by top-notch international legal firms. We have not shared those with the community since they often refer to proposals that haven’t yet looked for approval on forum and hence might still be improved. By offering a blank-cheque-type of approval through Governance, counterparts will have the ability to see their proposals approved without any legal nor technical review whatsoever. This is outrageous for any traditional lender (would you ever give approval to lend 500m USD without a lawyer reviewing a contract?), and especially so for an asset class that has so many new hurdles like DeFi. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.496411483253588
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#14",
                    "likes": "4",
                    "time": "03/03/2022-02:38:37",
                    "content": "@monet-supply You raise a key question on market comparables. Issuers coming to maker for wholesale financing should as a minimum requirement have at least comparable structures (legal standards) and credit to their peers/competitors in the real-world. Else, everything that is of a very high risk, i.e. un-financeable in the real-world, will come to Maker. That very high risk would be the composition of the maker portfolio itself. Without oversight for either onboarding or risk monitoring over issuers, who will analyse off-market vs customary standards and terms? The borrowers themselves? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.316
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#15",
                    "likes": "6",
                    "time": "03/03/2022-06:18:48",
                    "content": "Hi, all. I appreciate the essence of this request and to address the concern about getting RWAs through the process at a faster pace. There are few that understand this more than CES due to our mandate of focusing on Dai supply. To be clear, I’ve voted NO on this Signal Request. I want to reinforce something that GovAlpha pointed out in the Signal Request. There is a process today for onboarding collateral. It’s the MIP6. Inside of that is the Collateral Application Template. The RWF team added to this template a little while ago to ask for specific detail since crypto_native !== RealWorldAssets. I believe this benefits the entire community and to help us all understand the details behind these assets. I have not been consulted on this Signal Request so I am reading and interpreting it on my own. Overall, I am highly confused on what we are trying to accomplish.   MIP6 - The current MIP6 process does not require anyone to work through RWF…or CES, PE, Oracles, or any Core Unit (CU). That is by design and I fully support it. If you want to propose something, do it then allow the community to provide feedback. I know the process is not perfect, and we’re working on it. It’s pretty quick to a signal when you follow it.  No Core Unit Assessments - I mean, ok, I’m game. I’d also like to ask the community, which of you will be doing the coding and ensuring the solution will actually work and be secure when deployed? I’d love to find a parallel PE/CES team to help with the work. Also, who is doing the Oracle, Risk, and Legal work? Mandates allow all of us to understand the purpose of a CU. A mandate is not literal.  Governance Process - I am supportive of changing and iterating on our processes. I have spend my entire career doing this. I’m not sure I get the urgency of “bypassing” our current processes and why this is SO critical at this moment.  On a personal appeal level, I’d appreciate a level of transparency of what is truly going on here. A “win/lose” mentality will pull this project apart. The pie is huge and I’m sensing a lot of scarcity and fear right now. Is this about money, being “right”, or something else? And last… Disclaimer: I have no financial interests in any of the projects or organizations relating to proposals currently in the RWA deal queue. If I had any conflicts, I would have Abstained my vote. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP6/MIP6c2-Collateral-Application-Template.md",
                        "https://collateral.makerdao.com/introduction-to-collateral-onboarding/high-level-overview-of-the-collateral-onboarding-process"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.271825396825397
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#16",
                    "likes": "5",
                    "time": "03/03/2022-08:46:10",
                    "content": "I am not ready to comment on the entire thread but I did want to answer a statement you made @monet-supply that I strongly disagree with:     monet-supply:  That being said, these issuers are presumably approaching us for a reason - they can’t get as good of a deal with traditional bank or non-bank financing as we might be willing to offer       monet-supply:  What I take from this is, the issuers coming to Maker are likely to have a worse risk profile than the market at large   You are completely discounting three important points:  While a traditional lender (e.g. a bank) might serve their needs right now, we (Maker and everyone working in DeFi) are not the only ones who see how broken and inefficient the system is. And they see that DeFi could be a much better solution in the future. And to have the first mover advantage in this new space they are willing to take on some risk of their own and opt for in many ways a shittier product. “Who would want to use the e-commerce to buy stuff when you can go to a department store and find more products?” Optionality is a huge plus that a lot of issuers see by adopting DeFi. By not being dependent as much on a single bank financing you, gives you a lot of leverage and protects you in case this bank wants to cancel your line of credit. Cost structure: the traditional world has countless intermediaries that take their cut. We can’t get rid of all of them but I would want to believe that Maker cuts out quite a few of them. Maker also currently has a 0% cost of capital (no DSR). This is not true for banks. This means Maker can offer better terms while still making a higher risk-adjusted return than a traditional lender.  If we didn’t believe that we can offer a better product, why would we build Maker? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.7810094997595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "10",
                    "time": "03/03/2022-11:26:59",
                    "content": "    luca_pro:  Thank you @prose11 - I am not disputing the good faith of Governance, but I believe that an interested borrower would have always had the ability to publish this Signal Request independently and that the message, in that case, would have been more transparent for the community.   While it’s true that any individual borrower could have posted something similar, they would likely have posted a signal in a form that was less clear, and benefited them specifically, rather than in a way that we can quality control, and ensure does not show favourable terms / processes to any individual borrower. The benefits of us doing it is that we can call out the pros and cons and present the question from a neutral PoV, rather than a borrower presenting it and potentially failing to call out the negative aspects of taking this approach. Given the lack of familiarity with Maker’s Governance processes among most borrowers, it’s highly likely that we would have needed to have a great deal of input anyway to make it compliant with the signal process.     monkey.irish:  MIP6 - The current MIP6 process does not require anyone to work through RWF…or CES, PE, Oracles, or any Core Unit (CU). That is by design and I fully support it. If you want to propose something, do it then allow the community to provide feedback. I know the process is not perfect, and we’re working on it. It’s pretty quick to a signal when you follow it.   The MIP6 process doesn’t lead anywhere without cooperation of the Core Units. I think we’re generally aware of this as an issue. It allows anyone to get a vote, but the vote doesn’t mean a whole lot in terms of implementation.     monkey.irish:  No Core Unit Assessments - I mean, ok, I’m game. I’d also like to ask the community, which of you will be doing the coding and ensuring the solution will actually work and be secure when deployed?   The assumption here is that any solution would need to use the on-chain contracts and oracle setup that were developed for existing RWA borrowers.     monkey.irish:  Governance Process - I am supportive of changing and iterating on our processes. I have spend my entire career doing this. I’m not sure I get the urgency of “bypassing” our current processes and why this is SO critical at this moment.   I wouldn’t classify this as ‘so critical.’ It isn’t. However, when RWA borrowers come to us and tell us they’re unsatisfied with the current governance process and ask us if there is a way to get things moving, it’s not correct for us to tell them ‘no’. There are ways to get things moving, however, they come with certain risks and so governance would need to sign-off on them.     monkey.irish:  On a personal appeal level, I’d appreciate a level of transparency of what is truly going on here.   What’s truly going on is that semi-regularly RWA borrowers come to GovAlpha to complain about the onboarding process. We’re not going to lie to them and say ‘there is nothing we or you can do’ when in fact there are avenues to speed up the process. If this signal fails to pass, then we will be comfortable telling borrowers that ‘no, I’m afraid a faster process was not supported by governance (see signal here), you’re stuck with what we have.’ If it passes, we can direct them to use this process. The point is we can’t currently tell them that there is no possibility of a faster process, because the question hasn’t been put to governance. Like, this isn’t a trick question, our job is to facilitate governance. In our opinion, governance is facilitated by the DAO providing an answer to this question one way or another, so we can point potential borrowers towards that outcome, and they have clarity on their available options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.389550264550264
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#18",
                    "likes": "5",
                    "time": "03/03/2022-12:10:34",
                    "content": "    LongForWisdom:  What’s truly going on is that semi-regularly RWA borrowers come to GovAlpha to complain about the onboarding process.   I appreciate your commentary @LongForWisdom - although I believe it is a difficult task to be impartial and offer a comprehensive view to the community of such a complex topic. Let me be, however, very clear on the passage I just quoted. The RWF Team and the (currently incubated) Lending Oversight Core Units have had a open door policy with any originator. Many, and I hope they will voice their opinion here, have reached out and are currently working with the team. A team that works 15+ hours a day in order to provide support to any counterparty. Those counterparts include the same that, most probably looking at your tags, have come to Governance to complain. Detailed (and documented) analysis and information have been shared with them, as well as a potential path forward - yet with the caveat that they could still go ahead by engaging the community directly without our consultative support (nor our endorsement). Those analysis haven’t yet been shared with the wider community given that the counterparty was given, with extreme professionalism, ability to respond and remedy. An opportunity often not taken by some counterparts that have gone instead on silent mode. It is now evident that this stalling game has been played. Hence, all analysis will be shared with the community and a process of brutal transparency will be adopted from now on to ensure a levelled playing field. Going bak to @monet-supply point on adverse selection, the community should ask itself why a borrower that might have received a very negative opinion (sometimes corroborated by professional third-party support) might force the hand of governance complaining that there is not a way forward. Using a traditional banking analogy, this would be like a borrower asking several 100s of MM to a bank unsuccessfully following a risk assessment, going to the Board of Directors via personal relationship to ask for a grandfathered way to bypass internal controls. Governance, ahead of taking such a powerful stance, could have at least asked for clarity on process and outstanding duties to the CU - something that has not happened. Therefore, yet again, I question the appropriateness of your action. We would have expected more caution from Governance on this topic. And humility, given that I doubt Governance has the required tools to independently assess the merit of extremely complex transactions that have the potential to threaten the existence of the protocol, taking the right for itself to endorse an application without legal, technical, nor risk support. I have personally approached my role as servant of the DAO with extreme respect for everybody involved, even when as a professional I was judging some claims farcical based on my 15-year experience in banking and investing. It appears that my good manners have been used by others to misrepresent situations. We will amend our communication policy accordingly, in order to provide everybody with the visibility of what we have been doing in the background, while maintaining the same professionalism that we want to infuse in the wider community we interact with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.138968253968254
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#19",
                    "likes": "4",
                    "time": "03/03/2022-13:07:14",
                    "content": "You’re entirely correct that it would have been better had we had informed the RWF team beforehand, I apologize for not doing this. I can come up with lots of valid rationalizations as to why we didn’t consider this a requirement, but the truth is that I was mainly just frustrated about the time we’re having to commit to dealing with RWA-related topics.     luca_pro:  taking the right for itself to endorse an application without legal, technical, nor risk support.   This is not what’s happening. We would not be endorsing anything, we would be doing the same thing we do with MIPs and proposals in general, ensuring that proposers meet the required templates and structure. We would attempt to ensure that proposers included the information required for governance to make an informed decision, but would give no opinion on the validity or legitimacy of a given structure. Totally agree that we’re not in any way qualified to judge how good a RWA structure or borrower is.     luca_pro:  Those counterparts include the same that, most probably looking at your tags, have come to Governance to complain.   Those tags represent an incomplete list of people that may be interested in this signal request that came to mind when I posted it. I’m sure there are others that I missed, and possibly some that are entirely uninterested.     luca_pro:  Hence, all analysis will be shared with the community and a process of brutal transparency will be adopted from now on to ensure a levelled playing field.   We’d spoken a little about this on discord. I’m happy that the process will become more transparent, but I’m not at all suggesting that you should pursue transparency to the destruction of everything else. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.640447845804989
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#20",
                    "likes": "1",
                    "time": "03/03/2022-13:09:14",
                    "content": "Thank you for your kind reply @LongForWisdom - I agree with some of your points, not necessarily with others, but a constructive dialogue is indeed the secret source of continuous improvement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#21",
                    "likes": "1",
                    "time": "03/03/2022-13:58:58",
                    "content": "    LongForWisdom:  What’s truly going on is that semi-regularly RWA borrowers come to GovAlpha to complain about the onboarding process. We’re not going to lie to them and say ‘there is nothing we or you can do’ when in fact there are avenues to speed up the process. If this signal fails to pass, then we will be comfortable telling borrowers that ‘no, I’m afraid a faster process was not supported by governance (see signal here), you’re stuck with what we have.’ If it passes, we can direct them to use this process.   quoting LongForWisdom:  “…What’s truly going on is that semi-regularly RWA borrowers come to GovAlpha to complain about the onboarding process. We’re not going to lie to them and say ‘there is nothing we or you can do’ when in fact there are avenues to speed up the process. If this signal fails to pass, then we will be comfortable telling borrowers that ‘no, I’m afraid a faster process was not supported by governance (see signal here), you’re stuck with what we have.’ If it passes, we can direct them to use this process…” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#22",
                    "likes": "3",
                    "time": "03/03/2022-16:20:23",
                    "content": "    LongForWisdom:  our job is to facilitate governance   I appreciate the job your team (GovAlpha) is doing and I understand the role you’re playing. My comments are not directed towards GovAlpha. They are for the community and to ensure I am clear on why and what is truly being proposed.     LongForWisdom:  I wouldn’t classify this as ‘so critical.’ It isn’t.   Ok maybe “critical” wasn’t the correct word. This signal is proposing that we remove the involvement of the currently ratified CUs and ask the community to make all decisions (business, legal, technical) for onboarding the collateral in question. Please correct me if I am inaccurate on what the signal is proposing.     LongForWisdom:  The assumption here is that any solution would need to use the on-chain contracts and oracle setup that were developed for existing RWA borrowers.   I’m curious to see how this will work in practice. I haven’t yet seen a piece of collateral be onboarded without risk, UI, coding, review, testing, spell making, and bizdev. I’m still curious on who in the community feels they are more qualified than the current CUs. It’s a question that is still outstanding for me. If we want to bypass the current process then we believe there are others that are more qualified to make these decisions?? Ok, PLEASE come forward. Also, are we thinking about collateral management and how to objectively offboard one or more of these collaterals if they don’t work? Part of the RWA questions in the MIP6 will be used to to build some objective measures to effectively assess collateral. Without these, we’ll be right back in this situation and debating the process for collateral management or offboarding (if applicable).     LongForWisdom:  RWA borrowers come to us and tell us they’re unsatisfied with the current governance process   For me, the lack of transparency is concerning. Would this group come forward and share with the community on why this is a better process and what is not happening now? Would someone list which collaterals we would like to use this fast track process on? A lot has been discussed in private and I think the community deserves to understand more of the specifics. I am also willing to change my vote if I can understand who is doing what and how to minimize our risk by fast tracking collateral. After all, once code is deployed/executed and Dai is drawn, the CUs will have to maintain it so it’s not as clear cut as one might believe. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.042091836734694
                },
                {
                    "author_link": "https://forum.makerdao.com/u/francis.street",
                    "index": "#23",
                    "likes": "4",
                    "time": "03/03/2022-17:15:12",
                    "content": "I can sympathize with @LongforWisdom and @Prose11, as being on the receiving end of customer requests/complaints is not fun… However what may start out as a short term solution to appease issuers in good faith may lead to greater risks down the track. Aside from the credit risk, I will add a couple of other thoughts I had upon reading the post. I’m not sure how many individual parties are being considered for this fast-track process, but given RWA are unique and generally highly complex in nature, would that not create quite a lot of work for the protocol anyway given the steps laid out under ‘Fast Track Process Requirements’? I.e. ultimately detracting from the work which RWF is doing on Centrifuge. Furthermore, what is the ‘exact’ framework for how this will be assessed? I personally don’t believe it’s possible to create a low-risk, condensed framework to onboard real world assets, however the post omits crucial details and without these there won’t be any meaningful buy-in from the protocol. I think above all, the goal should be to protect Maker, and not to be reactive and appease clients. A robust framework is therefore required before other real world collateral can be onboarded. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.531432748538013
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#24",
                    "likes": "9",
                    "time": "03/03/2022-18:32:32",
                    "content": "Alright. Moving from Abstain to No. This Signal Request is doing more damage than good. It’s tearing the community at the seams. And as a proponent of scaling the Surplus Buffer I can’t buy into scaling RWAs without the proper parameters in place. Onwards and upward! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#25",
                    "likes": "6",
                    "time": "03/03/2022-18:34:47",
                    "content": "Not sure why this seems so controversial but I’ll give my two cents. I think the pressure here is two-fold: (1) potential RWA collateral providers want movement on their applications, whatever the ultimate result is, and (2) MKR voters want the chance to vote. If CUs think a project has made “farcical” claims, we want to see the reports you write, read them, hear your points of view, question the collateral provider, discuss in the forums and then decide. And if you all think a collateral type or potential partner is trash, great!! That will be helpful when I’m pushing the Yes/No button on the governance poll, for sure. FWIW, I enjoy the review process and have involved myself where I thought it would be helpful for the group (for example, look through my history of commenting on Centrifuge and Deco). Anyway, for Maker to function and truly be a crowd-operated financial tool/primitive for creating liquidity, MKR holders have to be the decision-makers and bear the fruits, be they sweet or bitter, of those efforts. I commend Long and Prose for being sensitive to all the parties involved here, doing so politely and respectfully (as always) and trying to facilitate an avenue that respects MKR holders and prevents their disenfranchisement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#26",
                    "likes": "1",
                    "time": "03/03/2022-18:52:36",
                    "content": "After having discussed the matter with several parties, and made my point clear in the Governance Call, I am now free to change my vote to a rigorous and explicit NO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#27",
                    "likes": "5",
                    "time": "03/03/2022-18:52:40",
                    "content": "    Tosh9.0:  If CUs think a project has made “farcical” claims, we want to see the reports you write, read them, hear your points of view, question the collateral provider, discuss in the forums and then decide.   I agree in principle (although in practice very few MKR holder will be able to digest the material). But still, it is imperative that these procedures and internal discussions are as open and transparent as possible:  to be subject to internal and third parties verification, to make sure that all parties are following the rules and acting in the best interests of MKR holders and DAI holders.      Tosh9.0:  I commend Long and Prose for being sensitive to all the parties involved here, doing so politely and respectfully (as always)   Me too. They do (and have been doing) a fantastic job. Their intellectual honesty is not questionable. If anything, I think the CUs working on RWA should shield GovAlpha from receiving external pressures (aka direct PMs). GovAlpha really needs to remain some kind of super partes CUs, only focussed on smoothing the governance process and enforcing fairness, openness and best practices. It is concerning that big RWA originators can influence them to any extent (even if just for stimulating them to post a SR like this one). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.02051282051282
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#28",
                    "likes": "3",
                    "time": "03/03/2022-19:16:47",
                    "content": "Good points – and I’m glad that we have capable delegates able to lift some of that analytical burden for those MKR holders without the time/background to get in the weeds and understand every potential collateral. Agreed that the discussions should be open and transparent – again, if a CU thinks something is farcical, tell us! We want to know (that’s why we onboard you and approve your budgets!). End of the day, all MKR holders, whether you vote individually or through a delegate, need the CU’s unfiltered opinions and information when deciding how to vote.     iammeeoh:  It is concerning that big RWA originators can influence them to any extent (even if just for stimulating them to post a SR like this one).   Yeah, if that happened here, I get it. I imagine as big institutions consider onboarding to Maker that could become a real issue, but that seems to me more reason to focus on the process and ultimate endpoint here: MKR voters (be they individuals or delegates) evaluate, decide and are the ultimate backstop for the protocol’s function. Thanks for your thoughts! @iammeeoh ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.741666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#29",
                    "likes": "0",
                    "time": "03/03/2022-20:04:00",
                    "content": "    luca_pro:  Using a traditional banking analogy, this would be like a borrower asking several 100s of MM to a bank unsuccessfully following a risk assessment, going to the Board of Directors via personal relationship to ask for a grandfathered way to bypass internal controls.   If this parallel in the real world came to even realise, members of such a Board of Directors would be under serious scrutiny either by their regulator (through auditors) or through the shareholders of such a banking player. This is just to be clear on how off our processes are here when it comes to DAO governance interactions. In summary, with decentralisation and decentralised governance in mind, if we do not create mechanisms to sort of “self regulate” (I say with a strong “”), someone eventually will. We need to be very aware of that, if we want to become “systemically” important as a protocol with RWA exposures. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4017857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#30",
                    "likes": "13",
                    "time": "04/03/2022-07:34:09",
                    "content": "I want to praise GovAlpha for issuing this Signal Request, their job is to facilitate Governance no matter what. I feel we are entering into the managerial revolution which hand is quite visible in this thread. MakerDAO is governed by governance processes which make MKR holders the only decision-maker on MIPs. We should respect those rules or write a MIP to change them. Anyone can propose a MIP or a Signal Request and no one should discourage that no matter their feeling on the proposal. And the discussion should be here in the open and not behind closed doors. That’s the core foundation of a trustless decentralized protocol. MKR holders/delegates can decide what they want and, if they agree on a proposal that didn’t pass CU gating, it’s their right. That’s my understanding of the MIPs. The governance powers of Facilitators are in MIP41c2. There is no decision-making delegation. I say that as having been fired by the main MKR holder on the belief that I would block those same Asset Originators that are complaining of being stonewalled now. I reckon I would not have shut up. I say that as having warned the community about the shortfalls of 6S, getting a lot of shit for it, and being ignored. PS: I won’t comment nor vote on the signal request message itself … because … it’s not the actual discussion we are having right? My point is that I would prefer the behavior of the DAO to match with the MIPs (or the reverse I don’t care). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.319047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#31",
                    "likes": "2",
                    "time": "04/03/2022-10:03:50",
                    "content": "Thank you @SebVentures, your comments are most of the times punctual, informed, and witty. As potential Facilitator of the Lending Oversight CU, I thank you for this message. Although I can firmly attest the good faith and extreme professionalism of RWF CU, it is evident there is room for improvement and we will. I want though, yet again, to affirm that those shortcomings have been on the (crucial) side of communication and not of undelegated power. The CU has worked closely and fairly with every actor, leaving anyone freedom to proceed on the course of action they see fit. With the same actors, the CU has expressed the intention to keep ongoing consultations private, in order to give them the ability to amend and improve, if willing, ahead of a proposal to governance. Such behaviour is customary given the staged approach of any deal. It is now evident that such discretion hasn’t been perceived for what it was by the community, and has been used by some counterparty as a tool. We will promptly improve the communication strategy. Again, I would urge anyone to contact @williamr or myself for any doubt regarding what RWF is doing. We have and always had an open door policy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.923611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#32",
                    "likes": "4",
                    "time": "04/03/2022-11:30:10",
                    "content": "I voted No.While I understand frustration of applicants, examining and solving bottlenecks relevant Core Units are facing is a much more sustainable method to reduce the risk while scale up the protocol. In addition, even if the details are written up in MIP form, I fear that the governance might be swayed in one way or might miss important small details that end up undermining the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/francis.street",
                    "index": "#33",
                    "likes": "2",
                    "time": "04/03/2022-11:41:25",
                    "content": "This is a general question which I raised in the Zoom chat during the Governance call yesterday, but is there a singular contact point from Maker who communicates directly to the RWA issuers? i.e. much like a relationship manager at an institutional bank? Not sure if there is that framework/setup at Maker but might be useful so that messaging/ communication remains consistent between Maker and all clients/RWA issuers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#34",
                    "likes": "0",
                    "time": "04/03/2022-11:43:20",
                    "content": "Thank you @francis.street, We are in a process of restructuring all communication channels to make it easier for people to navigate (forum/ discord/ webpage eventually). While we do this (we are just very few people) I would suggest you to contact directly @williamr as Facilitator of the CU or myself as perspective facilitator of the Lending Oversight CU in case Will is overwhelmed. I hope this helps, Luca ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/francis.street",
                    "index": "#35",
                    "likes": "1",
                    "time": "04/03/2022-11:55:00",
                    "content": "Oh, I’m not an RWA issuer. People had just mentioned yesterday that RWA issuers were getting in contact with them, so I thought it would be a better set up for members of the protocol to direct all client queries to the main point of contact, whose job is to handle these queries. That’s good that the communication process will be streamlined via @williamr ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#36",
                    "likes": "1",
                    "time": "04/03/2022-11:59:17",
                    "content": "Fully agree @francis.street - it is not easy to navigate the DAO, but we need to try to continuously improve it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.9166666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Scarlet_Chen",
                    "index": "#37",
                    "likes": "16",
                    "time": "04/03/2022-22:06:24",
                    "content": "We’re Robinland, an applicant who submitted a MIP6 proposal in Nov 2021 and passed the community greenlight poll on Jan 24. We voted ‘no’ and would like to share our perspectives:   Real World Asset on chain requires a combination of deep legal & crypto expertise and industry specific knowledge and experience. Take the real estate industry as an example, debt vs equity, senior vs junior vs preferred vs common, different geographic locations, etc.etc. are all different. It takes years of experience to be able to source and select the right projects, and structure the deal in a correct manner, and monitor the loan performance using the right metrics, etc. to ensure the stability of the asset. Without a proper due diligence process it’s hard to tell apart those with the expertise and those without. The reason why Robinland is doing this is precisely because we’ve seen lots of other start-ups who attempted to bridge the gap between RWA and DeFi but simply lack the industry expertise and ended up onboarding adversely selected assets. We are hoping to be the first one to set the industry standard for how RWA on-chain should be done, but in order to get there, we need to have lenders (such as Maker) who can tell apart borrowers with and without the expertise   The reason why there are cycles in the traditional financing sector is very much due to changes in regulatory environments. Usually a cycle starts by players in the financial system asking for more lenient regulations to conduct a wider range of financial activities and financial innovations, which plant seeds for systemic risks, which are then fermented over a period of time and eventually they burst into a crisis when a certain triggering event occurs. The 1929 crisis and the 2008 crisis all follow this recipe. The underlying logic of the financial system in DeFi is similar. Regulation is key to circumventing outsized crisis that brings down the whole system. But of course, regulations that are too stringent will limit financial activities and also have adverse effect on adoption. The regulators have to strike a balance by putting forth the right set of guidelines. From an outsider perspective, I think this is precisely what the RWF Core Unit is trying to do - to set up a reasonable set of regulations/guidelines to lay a solid foundation to allow for responsible lending activities to ensure the stability of the ecosystem.   As an applicant we are also frustrated when, after we passed the Greenlight poll, learnt that we need to go through the whole process again under the new framework “Methodology for Review of MIP6 Structured Finance Transactions”, and we’ve been working on revamping our application according to this new set of guideline ever since, and are still working on it. From a pure individual perspective, of course we’d prefer to get the financing as fast as possible. But the reason why we’re voting no is that we’re looking at the big picture and the long haul: if the bar is lowered, then Maker will become the last resort of financing for those who cannot get lending elsewhere. Eventually this will jeopardize the stability of DAI and Maker’s position as supplier of the only decentralized and widely used stablecoin, which will eventually hurt borrowers.   The reason why we started Robinland is because we believe RWA can help stabilize DeFi lenders’ collateral pools by bringing assets that are less volatile than crypto and which presents volatility that’s orthogonal to that of crypto. But this is based on the assumption that the type of asset being bridged in are the high-quality investment-grade ones. In order to ensure this, Maker will need to onboard Arrangers who have the industry expertise and knowhow to distinguish between better and worse types of asset, and have the necessary legal structure and processes to protect Maker’s interest. This is why even though the process is not the most pleasant from an applicant perspective, we’ve decided to vote ‘no’ to this signal request because we believe what the core risk units are doing is for the better of the entire ecosystem, which eventually is to the benefit of both Maker and qualified borrowers in the long run. ",
                    "links": [
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.420863968483016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#38",
                    "likes": "1",
                    "time": "07/03/2022-17:20:59",
                    "content": "My original comments were a bit one sided, and I think you’re 100% right that many of the existing issuers and involved parties are seeking the sources of financing with the best scalability in the long term. However, I’m still concerned that we would attract the wrong sort of counterparties if we accelerate the review and underwriting process too much. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.293367346938775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#40",
                    "likes": "2",
                    "time": "07/03/2022-17:49:16",
                    "content": "I agree @MadShills but I also see this thru the lens of the scientific method. If we fast track an approval process without any significant information on legal, tech, and credit, we pretty much do not have a hypothesis we are testing. Hence, would the test be successful (i.e. we don’t lose money) or not, we wouldn’t retain any useful information from it. Betting on red/black doesn’t carry any useful information, independently on whether it’s red or black. In addition, it is evident how some of the borrowers supporting the fast tracking aren’t interested in a 1m DC test, but in approval requiring c. 500M or more, making the uninformed bet an existential threat for the protocol, with an upside capped at very low level. Balancing prudence and effectiveness is difficult. The new RWF team has been in place for 6 weeks, with me personally supporting on the sideline - although yet not incubated. I would give the team a bit of time before judging whether we are erring on the side of prudence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.936174242424243
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#41",
                    "likes": "5",
                    "time": "07/03/2022-18:05:48",
                    "content": "    luca_pro:  Balancing prudence and effectiveness is difficult. The new RWF team has been in place for 6 weeks, with me personally supporting on the sideline - although yet not incubated. I would give the team a bit of time before judging whether we are erring on the side of prudence.   I think it is rather safe to assume that when it comes to (1) transactions in the 100sM / Billions DAI and (2) counterparties are start-up asset managers with limited track record and (3) the surplus buffer is as low as it is a recommendation for financial prudence to maker tokenholders will most likely be the default position. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.452741702741703
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OasisProTeam",
                    "index": "#42",
                    "likes": "13",
                    "time": "08/03/2022-17:07:58",
                    "content": "Hi All, Wanted to share Oasis Pro’s positive experiences with the Core Units to date.  As background, we are working with all these core units and coming through with two quality deals shortly. We look forward to working through an expeditious and thorough process. Oasis Pro is excited to be working with Maker’s delegates and units and their legal, credit and other facilitators and representatives and we see positive signs in mutually seeking to build long-standing relationships with MakerDAO’s Real World Finance Core Unit, Delegates, Legal, Governance, Growth Core Unit, CES, Protocol Engineering, etc…  Oasis Pro is a strong supporter of Maker’s ecosystem and focus on real world assets. OPI’s interactions with legal, credit (RWF) and other facilitators (such as Monetalis as an arranger/structurer) and representatives from Growth, Delegates, etc. have all been positive in the short time that we have been working together on the first two Oasis Pro opportunities. Maker’s facilitators and representatives have been very helpful and assisted us with understanding the developing RWA process better, structuring viable RWA proposals and understanding the scope of information that Maker requires to review and facilitate RWA transactions. As stretched as they are, Maker’s legal, credit, governance, delegates and other facilitators and representatives have been generous with their time. Oasis Pro team members only have had good things to say about their interactions with Maker’s facilitators and representatives. We continue to be impressed by their professionalism as well as their willingness to collaborate and provide guidance and feedback. Oasis Pro looks forward to continuing its work with all the core units and their legal, credit and other facilitators and representatives. We are confident that we are building a solid foundation for mutually beneficial and long-standing relationships which of course is tied to making the Maker ecosystem very successful in terms of rwa, growth and utilizing our subsidiary, OPM, as a listing venue. Many thanks for reading The Oasis Pro Team ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.155669599217987
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#44",
                    "likes": "2",
                    "time": "08/03/2022-19:19:00",
                    "content": "3F Delegate had the pleasure of meeting the Oasis Pro team while attending EthDenver. Impressive team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#45",
                    "likes": "3",
                    "time": "08/03/2022-20:28:48",
                    "content": "    luca_pro:  Balancing prudence and effectiveness is difficult.   I don’t see it from the point of view of the scientific method at all. But when I put this together:     luca_pro:  the borrowers supporting the fast tracking aren’t interested in a 1m DC test, but in approval requiring c. 500M or more   with this:     LongForWisdom:  Fast Track Process Requirements  The issuer / arranger must have been working with Maker for at least 1 month in the past.    Then I would prefer prudence over efficiency. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#46",
                    "likes": "9",
                    "time": "09/03/2022-12:56:02",
                    "content": "The off-chain poll has now closed. This signal has not successfully passed at the off-chain polling stage, and will not proceed further. Thanks to all who voted and commented. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/edludlam",
                    "index": "#47",
                    "likes": "1",
                    "time": "11/03/2022-15:19:45",
                    "content": "I’m glad to see that it didn’t pass. I think this poll was outside the scope of your mandate. In my opinion the proper action for you to take would have been to outline the existing options for the originators and stop at that. Suggesting a fast track was you getting too involved with governance. No hard feelings but wanted to say this once the poll finished. You’re a good guy but it’s dangerous to the protocol for someone in your role to push the boundaries of the mandate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.653645833333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#48",
                    "likes": "0",
                    "time": "11/04/2022-01:19:58",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}