{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/should-actions-be-taken-to-reduce-var-for-yfi/5203",
            "title": "Should actions be taken to reduce VaR for YFI ",
            "index": 5203,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "yfi"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#1",
                    "likes": "2",
                    "time": "18/11/2020-03:30:25",
                    "content": "Starting a new thread to discuss my comment seen below.    [Signal Request] Increase the YFI Debt Ceiling   I’m a little late to the party here, but… I was looking at @monet-supply risk summary for YFI  earlier today. Based on that IDK how to feel about the idea of the DC going to $20MM. If you look in that sheet his simulations put the VaR for YFI at about 20% ~ 25% of the debt ceiling with the current LR. I don’t have access to his model he used to run the simulation, but at $20MM I think the VaR would a bit higher than the stability buffer which is a slightly worrisome situation. If we want to go this high with the debt ceiling would we also consider raising the liquidation ratio to offset the extra risk there? Update: I updated some of my numbers. I had thought the Liquidation ratio was set to 150% but overall concern still stands for the 175% LR. Situation is not quite as bad though. My napkin math puts the VaR to be approximately a few hundred thousand over the stability buffer. Going to start a separate thread to discuss.   If you review the sheet linked in the original risk analysis for YFI you’ll see that the @Risk-Core-Unit team found that with the current liquidation ratio of 175% the VaR for YFI was around 20~25% of the modeled debt ceiling. With a debt ceiling of 7M their model predicted the VaR to be ~$1.7M. However given the way the recent debt ceiling poll is trending for YFI it looks like we can expect that the protocol will soon increase it’s exposure to YFI to $20MM.  Assuming the 20%~25% ratio that was provided by the risk team we now might expect that the VaR will be around $4MM - $5MM. Given that stability buffer is capped at $4MM this means the protocol and MKR holders might be overexposed to YFI given its current parameters. I didn’t want to start a signaling post yet because it seems that there may be a few methods for dealing with this issue. Some options i can think of:  We could raise the LR to compensate for the additional exposure Just raise the stability buffer to ensure we are covered A little bit of both Do nothing and roll the dice  Given that there are a few options for dealing with this issue I’ll leave this open for discussion but I will add one poll just to gauge sentiment on whether or not some action should be taken.    Should something be done to reduce the VaR of YFI  Yes No Abstain     0 voters     If you are in favor of something being done please add a comment on what you think might be the best strategy to reduce the risk here. Hopefully from that we will be able to determine what our best course of action is and then begin the signalling process to deal with this issue. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1lDJK7BgQFEQD3HkbWHsnj6htNLm5KVMOGDH9SG8CUnk/edit#gid=1405682713",
                        "https://forum.makerdao.com/t/yfi-collateral-onboarding-risk-evaluation/4575?u=andy_mccall",
                        "https://vote.makerdao.com/polling/QmZUdsMC?network=mainnet#vote-breakdown",
                        "https://forum.makerdao.com/t/signal-request-adjust-yfi-a-debt-ceiling/5318"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2845571095571096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/11/2020-03:46:12",
                    "content": "Is there a reason you’re targeting the collateralization ratio, rather than the stability fee? I think the latter is the more logical parameter to change if we think these Vault’s pose an outsized risk to their current reward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/11/2020-03:58:49",
                    "content": "    g_dip:  Is there a reason you’re targeting the collateralization ratio, rather than the stability fee? I think the latter is the more logical parameter to change if we think these Vault’s pose an outsized risk to their current reward.   I believe that the current thinking is that LR is the best tool we have to combat VaR (other than the stability buffer) which from my understanding is mostly derived from the asset’s price risk. See @cyrus comments on the model we used to set these parameters initially here. I THINK that we are currently using the stability fee to offset the average losses from our model which is a bit different than the VaR number. VaR is more of a worst case number. If you look through that sheet you’ll find that the model predicted the average loss to be 3.14% so I suspect that is how we have landed at the 4% SF number we see today. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.441666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#4",
                    "likes": "0",
                    "time": "18/11/2020-04:02:04",
                    "content": "The price of YFI is currently volatile, so it is more appropriate to wait for a period of time to adjust LR ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/11/2020-04:27:08",
                    "content": "I guess I’ll add that I would love to hear from @Risk-Core-Unit on this topic to confirm that their model does indeed project a VaR of ~$5MM given the current parameters on YFI with the $20MM DC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#6",
                    "likes": "3",
                    "time": "18/11/2020-05:57:22",
                    "content": "I think we should be increasing stability buffers, although I think we should be bundling an increase with the weekly executive as dai supply grows rather than in response to a specific collateral. We should prioritize responding to the demand of YFI vault holders, it is an ideal decentralized collateral type for Maker and we should not lag behind on accepting it as collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#7",
                    "likes": "2",
                    "time": "18/11/2020-08:12:04",
                    "content": "The risk analysis is already extremely conservative according to my meager knowledge on the subject. If you take a look at the spreadsheet and go to the tab “LR 175, DC 7”, you will find the inputs to the calculations. The auction efficiency has been lowered to 0.9 (recovering only 0.9 of each DAI auctioned) and cutoff value set to 0.001 (basically total fire sale). This would be the worst black swan event ever. If you want to criticize the risk team for anything the number of Monte Carlo simulations (1000) could be on the low side for simulating something in the 99.9% confidence interval. This is not something I have intimate knowledge of, but to me it looks like the Debt Ceiling of DAI 7 million can be multiplied several times over before we are talking any real risk. Setting it to DAI 20 million is a nice initial upgrade. If the Risk Team is guilty of anything it is playing it too safe, not the other way around. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.630208333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#8",
                    "likes": "0",
                    "time": "18/11/2020-08:17:00",
                    "content": "    Planet_X:  If you want to criticize the risk team for anything the number of Monte Carlo simulations (1000) could be on the low side for simulating something in the 99.9% confidence interval.   I am certainly not trying to criticize the risk team. My only aim to point out that things have changed since the initial analysis was done, and that further changes may need to be made if we wish to remain as conservative as we have been regarding YFI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.892857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#9",
                    "likes": "10",
                    "time": "18/11/2020-09:14:34",
                    "content": "Very happy to see someone is looking at our models! First, I think this is a good time when I can reveal that we are simplifying the General Model as it is highly complex and not well suited for new collaterals that lack price data, vault behaviour data and slippage data. For instance, at the time of analysis YFI used only 15 days of USD pair price volatility data (Coinbase) and combined with volume metrics we decided to use a very conservative slippage function and high severity of price jumps which in large part determined high losses for VaR 99.9%. Also to be clear, when onboarding a new asset we always start very conservatively, because it doesn’t make sense to onboard an asset having high DC if it doesn’t get utilized. Especially for an asset like YFI where price increased so severely at the time that we just had to stress test for high severity of jumps (at one stress test scenario we even used 65% daily drop). We were aware of this issues and therefore decided to simplify General Model for new assets due to various reasons:  For tokens just listed this model is a bit inappropriate as it requires many inputs (most important being user behaviour, auction slippage, price crashes), that are impossible to determine on one or two months of trading data. For instance, how can we determine collateral ratio distribution if vaults are not even live? New external analysts were having hard time using General Model being highly complex The slippage function of the General Model included DAI slippage, which we can now safely say is much lower due to low LR on stablecoins  The plan is to still use General Model, but mostly for assets such as ETH, where we want to spend more time on inputs which we can safely determine, because it has a long enough data on price crashes, volumes and vault users behaviour and their collateralization ratios. But for tokens that are being onboarded we started to test the new simplified approach that is also well suited for MIP27 (DC IAM). We currently tested it for majority of assets in Maker’s portfolio and the plan is to start producing maximum debt ceiling, risk premiums and liquidation ratios for each asset on a continuous basis. If we are able to implement MIP27 in December, we will propose these numbers and also showcase this new model that every analyst could use when onboarding an asset and proposing risk parameters. Another reason we need a more flexible model for risk parameters is the fact that we need to start refreshing risk premiums on a more continuous basis so that Rates Working Group can decide easier for proposed SF changes. With the General Model we spent few days alone on analyzing one asset and it would take too much time to have risk premiums and debt ceilings updated regularly by having tens of assets in the portfolio. Especially in this environment where volume metrics determining auction slippage tend to change so quickly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7443924719348445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#10",
                    "likes": "0",
                    "time": "18/11/2020-19:27:53",
                    "content": "Wanted to take a minute to address people’s concerns around the model input parameters and the magnitude of the risk. All of magnitude numbers are regressed from the original standard model runs so I’ll try and tackle peoples concerns around it potentially being too conservative first. Basically here are my thoughts.     Planet_X:  The auction efficiency has been lowered to 0.9 (recovering only 0.9 of each DAI auctioned)   This number doesn’t seem that off to me honestly. Probably the number I take least issue with. For instance ETH-A auction 134 recently sold for 440.25 dai/eth. Compare that to the OSM price at the time (468 dai/eth) and the 10% discount the model assumes and you’ll notice the percentages there aren’t far off. Granted I’m cherry picking an example here and do i think the average discount is a bit lower than this, but i don’t think this is an unreasonable estimate.     Primoz:  Especially for an asset like YFI where price increased so severely at the time that we just had to stress test for high severity of jumps (at one stress test scenario we even used 65% daily drop).   Looking at the daily candles we have seen so far i don’t particularly take issue with the severity of the jumps used in the model. The probabilities on the other hand might be off. I would have loved to see some more experimentation with those input variables. For context, the model  has a few high severity jumps that it tests to determine average loss and VaR. Looks like for the 175% LR @ 7MM DC we used 15% drops, 30% drop, and 60% drop. Well we have already seen a single day drop of 15% for YFI on Oct 29.  The 30% drop is yet unprecedented but we have seen multiple 24%+ gains for YFI so assuming that there are equal magnitude losses ahead does not seem that odd to me. 60% seems feasible but idk that i buy there is a ~28% chance of that happening in the next year, so admittedly i would say the model is being a bit conservative there.     hongbiao_li:  The price of YFI is currently volatile, so it is more appropriate to wait for a period of time to adjust LR   The model that the risk team used tries to take this into account and project losses. The number they use here is potentially a bit questionable though. I believe that should be accounted for by the sigma parameter in the sheet i linked above. That is probably the standard deviation that they used to generate the random walk of YFI’s price. My issue is that i can’t make any sense of the value 2.2 that they used. Is that dollars change? Is it percent change? Would love more context here. I guess what i want people to take away from this is that although there are some questionable inputs to our original risk estimate most of the inputs in there seem within the realm of possibility, and as such is probably the best framework we have for understanding how much extra risk the protocol is taking on with this debt ceiling increase.     Planet_X:  This is not something I have intimate knowledge of, but to me it looks like the Debt Ceiling of DAI 7 million can be multiplied several times over before we are talking any real risk. Setting it to DAI 20 million is a nice initial upgrade.   Ok so getting to magnitude here. I put together a little linear regression model to make a bit more sense of the numbers that our risk model spit out and potentially project what our VaR is going to be. There are only 4 data points though so the f significance (22%) here is lower than you would typically hope for, but i think it is useful to gain a bit of insight on what we are talking about in terms of magnitude of our VaR and what we would need to set the LR to in order to make the VaR work with the current stability buffer ceiling. Based on that regression am seeing i think my original estimate of a VaR of $5MM might be a bit of a low ball estimate. From my regression model i think we may be talking about more like $8MM VaR @ $20MM DC. Just solving for LR i think we need to change the LR to be > 299%, so that is probably not doable bc it would liquidate peoples vaults. Based on that, I think what i would recommend is increasing the LR about 2500 bps (would need to look into the vaults more to see how feasible that would be) AND increase the stability buffer by around $3M. If you look at what @Primoz was saying here about heuristics concerning stability buffer and volatile debt he states that ideally we would have at least 1% of the volatile debt in the stability buffer. $7M would put us pretty close to that at 1.3%, and @ a 200% LR it would be enough to cover what I’m projecting the VaR to be. Here is a link to my numbers in case anyone wants to review: https://docs.google.com/spreadsheets/d/1zIG04XgY05djH3B9vV6MKwmXaDXsZVv6q2F5BxnsPPw/edit?usp=sharing ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1zIG04XgY05djH3B9vV6MKwmXaDXsZVv6q2F5BxnsPPw/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.68614960909737
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#11",
                    "likes": "1",
                    "time": "18/11/2020-22:14:16",
                    "content": "    Andy_McCall:  60% seems feasible but idk that i buy there is a ~28% chance of that happening in the next year, so admittedly i would say the model is being a bit conservative there.   We actually took 0.28% probability, which means once per year. 60% daily drop might perhaps be possible (I still think this might be too conservative though), but this means that every vault having CR of less than 437.5% would get liquidated on that day. But in reality I suspect large part of the vaults will probably unwind before liquidated since YFI vault users tend be very “farm focused” and should be able to withdraw DAI when needed. Not saying they are some kind of superior users, but they would definitely be more aware of such situation and would probably react quicker than regular vault retail users. A 60% daily drop may mean few 10-20% drops on hourly OSM update and there is plenty of time to react. In reality it is really hard or impossible to measure liquidation risks and outcome. For instance, YFI has three vaults representing 6m out of 7m total debt exposure. When it comes to risks, it is really mostly up to them how sophisticated they are and what kind of alerting system and automized unwinding techniques they use to protect against liquidation. So it becomes really hard to estimate probabilities of outcome here. Their weighted average CR is 362% and they are protected against 52% drop before liquidated. When we did initial calculations we predicted lower CRs as this vault wasn’t live at the time. We’ll see how high average CRs will be for YFI vault users and then use a number that we think will be maintained in equilibrium going forward. What I want to say is that risk profile changes every time CR distribution changes, let alone volumes, volatility… But in general I do agree with your statement about surplus buffer, we are definitely at the very low levels having only 0.4% DAI in surplus to protects against 1bn debt exposure. I’ve talked about that in the past but based on community signals people have mixed opinions about increased surplus further. In general we have MKR dilution to protect, which is of course worse than using surplus funds, but in reality it is up to MKR holders how they wish to hedge their potential loss. I am also having a look at your model and will reach out to you. Looks interesting, still trying to understand how you regressed VaR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.322685335497836
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#12",
                    "likes": "1",
                    "time": "19/11/2020-00:31:27",
                    "content": "    Primoz:  I am also having a look at your model and will reach out to you. Looks interesting, still trying to understand how you regressed VaR.    well i took the four data points from your simulation run and ran it through a linear regression plugin for excel. V sophisticated i know, but the r2 seemed to be with a range that i felt comfortable talking about what i was seeing. Once I had the regression coefficients i just did a little algebra to solve for the number i was looking for.     Primoz:  We actually took 0.28% probability, which means once per year. 60% daily drop might perhaps be possible (I still think this might be too conservative though)   That makes a lot more sense thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#13",
                    "likes": "0",
                    "time": "23/11/2020-16:28:24",
                    "content": "Probably going to close the poll on this tomorrow. Based on the polling results / thread discussions it seems that people are against the idea of increasing the LR and I think the discussions floating around changes to the stability buffer have been inconclusive. Baring some large swing in the polling results over the next 24 hours I probably will let sleeping dogs lie regarding this issue. Thank you to everyone who voted / provided your thoughts on the topic! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#14",
                    "likes": "2",
                    "time": "23/11/2020-16:34:15",
                    "content": "I just wanted to say thanks for running the poll. I know it can be frustrating when they result inconclusively or not with the intention of the original post, but it’s really important to run them anyway so that the community can feel its way around governance. The takeaway for me from this post, is that we should increase the stability fee on these vaults. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#16",
                    "likes": "0",
                    "time": "25/02/2021-09:50:20",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}