{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/content-production-bi-weekly-update-may-13-may-26-2021/8386",
            "title": "Content Production Bi-Weekly Update: May 13 - May 26, 2021 ",
            "index": 8386,
            "category": [
                "Core Units",
                "Core Unit Archive"
            ],
            "tags": [
                "core-unit",
                "cu-update",
                "archive-mkt-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#1",
                    "likes": "7",
                    "time": "27/05/2021-16:39:49",
                    "content": "Greetings from the Content Production Core Unit! Here’s what we’ve accomplished the last two weeks:   Published Maker Relay Ep 45 and Ep 46 in collaboration with GovComms.   Announced our inaugural AMA featuring William Remor of Real-World Finance.   Published a poll to gauge support for a mascot and a follow-up poll to narrow down the choices. (Shoutout to @Saludiego_201 for spearheading a campaign for the Chiguire/Capybara/Carpincho!)   Onboarded a part-time designer - check out her work at https://www.aethermilk.com/.   Updated our Transparency Dashboard at content.makerdao.network.   Completed incorporation.    Looking Ahead In the coming weeks, we’ll be:   Hosting an AMA with William Remor of the Real-World Finance Core Unit.   Transferring and updating content from community.makerdao.com to a new domain.   Hiring a Social Media/Community Manager and Editor.   Publishing our budget proposal for the next quarter.   You can always check out our Transparency Dashboard to see what we’re working on and please join us for our weekly Office Hours on Tuesdays at 16:00 UTC. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-46/",
                        "https://forum.makerdao.com/t/ama-william-remor-of-the-real-world-finance-core-unit/8203",
                        "https://forum.makerdao.com/t/informal-poll-does-makerdao-want-a-mascot/8083",
                        "https://forum.makerdao.com/t/informal-poll-following-up-makerdao-mascot/8305",
                        "https://forum.makerdao.com/t/campaigning-vote-for-chuguire-capybara-carpincho-to-be-the-mascot-of-the-makerdao-protocol/8307",
                        "https://www.aethermilk.com/",
                        "http://content.makerdao.network",
                        "https://forum.makerdao.com/t/ama-william-remor-of-the-real-world-finance-core-unit/8203",
                        "http://community.makerdao.com",
                        "https://content.makerdao.network/Content-Production-Core-Unit-b428b35984b7423893f5402618fae798",
                        "https://content.makerdao.network/Office-Hours-3c03ea25fec7455f960da297eca113b9",
                        "https://forum.makerdao.com/t/maker-relay-ep-47-en-espanol/8547",
                        "https://forum.makerdao.com/t/maker-relay-ep-47/8491",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/33",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.982323232323233
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "5",
                    "time": "27/05/2021-16:48:00",
                    "content": "    seth:  (Shoutout to @Saludiego_201 for spearheading a campaign for the Chiguire/Capybara/Carpincho!)   Vote for Capybara!!!    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 0.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#3",
                    "likes": "1",
                    "time": "27/05/2021-17:15:19",
                    "content": "Go go Chiguire/Capybara wins!!!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.9296875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/milan",
                    "index": "#4",
                    "likes": "7",
                    "time": "31/05/2021-15:28:33",
                    "content": "First of all, it’s great to see that the Content Production Unit is working hard to grow Maker’s audience and expand its business. The pro-activity and passion are among the key factors why I believe in Maker/Dai, not only as a cryptocurrency, but also a community of like-minded people with a common goal. Secondly, during the past couple of days, I thought a bit about how Maker is currently marketed which, of course, has a direct impact on its brand image, performance, etc. Here is one point which kelp coming up to my mind (please take it only as an observation/suggestion of someone who is not directly involved in the development, but is passionate about the project): It seems to me that some of the marketing/content production activities are not fully aligned with the project’s overall strategy/mission. To my understanding, Maker/Dao is “a stable, decentralized currency that does not discriminate. Any individual or business can realize the advantages of digital money”. Additionally, it “can be used by anyone, anywhere, anytime.”. These statements (which are on the project’s main landing page) indicate that Maker is not only for blockchain professionals/tech-savvy people, but rather anyone who might be interested in an alternative financial system. However, the current marketing activities do not adequately showcase this in my opinion. For example, most of the published content seems very complicated and technical to me - which may create an image that Maker is only for people who understand the technology behind it - which in result may limit the project’s potential. Maybe creating some less technical content would help. For instance, “how to” & “tutorial” videos are the best performing category on YouTube - also the category with the biggest potential. I did a small analysis and basic “how to” blockchain videos attract large audiences + have a great engagement rate. Same goes for this type of content on other social media. Next, centering some of the content around crypto in general rather than Maker/Dai might also be a great way to grow. To illustrate, instead of publishing an article about Maker’s technical details, an article about how DeFi/Crypto is going to transform the financial systems could be released (of course Maker would be mentioned in the article but it wouldn’t be the central point of focus of it). By doing this, you can target and promote Maker to people who are interested in crypto but are not familiar with Maker. That’s it for my small analysis. Please, let me know what you think! Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.231049562682216
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#5",
                    "likes": "5",
                    "time": "02/06/2021-15:33:55",
                    "content": "I certainly agree with what you say, because I as ambassador of Makerdao for Venezuela together with my colleagues during the period of the DAG, we tried to translate the technical content to something more digestible for all people. Maker is not something simple if you think about its structure as a pawnshop in general, but DAI is perfect and serves as a spearhead to arouse the curiosity of any individual. With the section you comment on “a stable, decentralized currency that does not discriminate. Any individual or business can realize the advantages of digital money”. Additionally, it “can be used by anyone, anywhere, anytime.” Currently this premise is not fulfilled, I always comment positively that maker should stop thinking only in L1, not only because of the gas issue, we are lagging in terms of crosschain possibilities, I know that being in multiple chains has its risks, but I would like in the near future to understand that a stable coin if it wants to be successful must dominate the market and unfortunately the market is no longer only the Ethereum network are all networks that reach a large audience and boom as bsc or Polygon (which indirectly we are there).  No doubt I agree with you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6561533704390845
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#6",
                    "likes": "3",
                    "time": "03/06/2021-00:12:02",
                    "content": "Thanks for the feedback! I hear your concerns about the lack of non-technical content and I agree that we as a DAO can improve on some of our messaging. Our Core Unit is currently onboarding team members and establishing operations so this is a great time to weigh in on what type of content would be valuable for the DAO. If you have more specific ideas, we welcome suggestions and you’re always welcome to join our weekly Office Hours. We’ve gotten requests for “how-to” and “tutorial” videos from several others as well and are currently looking for someone to help us produce this type of content. If you know of any good candidates or have examples of videos you find particularly effective, please send them our way! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.090909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/milan",
                    "index": "#7",
                    "likes": "3",
                    "time": "03/06/2021-08:28:13",
                    "content": "Thanks for the feedback! Completely agree with your points! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/milan",
                    "index": "#8",
                    "likes": "5",
                    "time": "03/06/2021-14:44:47",
                    "content": "Thank you for your reply, Seth! Happy to hear that the Content Production Core Unit is growing! Regarding the content itself, I recently read 2 interesting articles which might help you set the proper content strategy and guide you in the content production process. Please let me know if you can’t access them - I’ll send you PDFs.   Online content match-making in B2B markets: Application of neural content modeling -  this article is focused mainly on the content strategy and provides a great insight into how a digital content strategy should be developed - even though it is centered around B2B markets, most points can be applied to B2C as well.   Millennial and generation Z digital marketing communication and advertising effectiveness: A qualitative exploration - this one, on other hand, discusses the content itself, e.g. what type of content should be used, how it should be optimized, etc.   I believe these articles could be a great starting point! Perhaps the most intriguing conclusion from the papers is that the content which majority of companies produce is not aligned with their customers’/potential customers’ interests as orgs usually create and target their content based on demographics rather than interests (image below perfectly illustrates this issue).  image1320×711 113 KB  I’ll look at blockchain/crypto-related content production - what works, what doesn’t work, and mainly why, in more detail - I’ll post the results here once I’m done. I’ll also try to stop by at your weekly meeting. Please let me know if I can be of further assistance. I’m more than happy to help with anything related to content/marketing/business development. Lastly, good luck with finding new people for the unit - I’ll try to see if I have anyone in my network who might be interested and qualified. Have a nice day, Milan ",
                    "links": [
                        "https://www.tandfonline.com/doi/full/10.1080/21639159.2020.1808812?scroll=top&needAccess=true"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.656425364758698
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "03/07/2021-14:45:07",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}