{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-forget-about-whales/4995",
            "title": "Governance - forget about whales ",
            "index": 4995,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "29",
                    "time": "04/11/2020-13:09:43",
                    "content": "Experience has shown us that participation in Maker governance is less than ideal. Forum participation is more or less the same 30 persons discussing all the topics. Onchain polling is even worse with relatively important decisions attracting between 14 and 31 votes the last three weeks. Total MKR involved is 5-6%. Needless to say this is suboptimal and there is reason to analyze why this is the case. Theory of rational self interest1280×720 57.5 KB A superficial application of the theory of rational self interest on Maker governance implies that an individual will be more incentivized to participate in Maker governance the more MKR this individual owns. After all, the more MKR, the more is at stake and the more likely this person will seek to protect and nurture the investment. This application of the theory has however proved to be highly insufficient when it comes to describing Maker’s governance situation. maker voting groups1280×720 59.8 KB First and foremost it is important to realize that it is not the amount of MKR that matter, it is the amount of MKR relative to other assets. It matters little if a person own a thousand MKR if the same person owns two oilfields and a chunk of Tesla on top of that. Due to the relatively low share of MKR compared to total wealth, participation in Maker governance is not going to come high on the agenda for this individual. At the opposite end of the scale there is obvious little incentive to participate if you are not able to influence either through onchain voting or forum participation. Already there are multiple examples of topics being agreed upon in the forum and then failing when put up for a vote. While discussions can become ecco chambers, it is most likely depressing for new stakeholders to see their hopes dashed. In between these two groups however, is a large Goldilocks zone where there is sufficient MKR to feel involved but not sufficient to be distracted by capital management. If this is combined with both personal interest and mental ability the community possibly has a contributing and long lasting member. There is also no denying participation in Maker governance comes at a cost. At present I estimate that it takes between 5 and 10 hours each week with relatively high mental intensity and no small ability to stay on top of things and being able to cast reasonably informed votes. With the participation cost being measured in time it forces the topic of prioritization as each of us, however poor or wealthy, only has 24 hours in a day. It is simply not for everyone to be able to spend this amount of time on Maker. The superficial application of rational self interest falls especially flat when introduced to the concept of leveraged time versus non-leveraged time. Leveraged time is here defined as time spent making decisions and then multiplying the value of that decision using capital. Leverage vs non leverage1280×720 126 KB The keen observer will have noticed that while the leveraged activities are far riskier, they are also financially a lot more rewarding. As an individual’s crypto wealth increases, so does the gains achieved from leveraged activities as steadily greater amounts of capital can be used to leverage each decision. Eventually the monetary gains from leveraged activities completely dwarfs the gains from non-leveraged activities. At this point it makes little or no sense for a whale to participate in Maker governance, as the time spent cannot be justified from a financial viewpoint. This can to a large extent explain why so little of total MKR can be mobilized for voting, especially when founders and long term investors that have stuck around since the Bitshares days are discounted. Implications From the viewpoint of building the Maker community into a group that can be functional in a long term perspective there are several implications that can be drawn from the above analysis.   There is no point whatsoever in selling MKR to venture capital funds. Like none. It is probably even detrimental as sardines and tunas feel their input can be wiped with a click.   The Maker community would likely benefit from engaging in a wider search into a variety of online groups just to get inspiration. Does not have to be crypto related. Things to look for are community size, vigor, longevity, turnover and how they attract new members. Right now we do not even know what functioning in a 10-20 year perspective looks like.   Initiatives such as SourceCred should be maintained, expanded or even forked to cover activities that goes beyond the forum. Maker badges are gold, hopefully one day people will be able to put them on their CV to prove consistency and commitment to potential employers.   The present voting system is not the only system that can be used to make decisions. Crypto in general still closely follows real world traditions. Maker’s onchain polls strongly resemble an annual shareholders meeting, although at much higher frequency. Other systems are fully possible.   Every possible method that automates decisions, reduces voting or enables scaling with minimum human involvement should be applauded. It will be most interesting to see what the concept of Instant Access Modules can bring.   Feedback appreciated. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-20-en-espanol/5084",
                        "https://forum.makerdao.com/t/maker-relay-ep-20/5078",
                        "https://forum.makerdao.com/t/week-23-dai-distributions-sourcecred-funding-mip13c3-sp6/5117",
                        "https://forum.makerdao.com/t/planet-x-delegate-platform/9422",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-118-thursday-november-12-16-00-utc/5008/2"
                    ],
                    "GPT-summary": "The author discusses the low participation in Maker governance and analyzes the theory of rational self-interest in relation to it. The author suggests that the amount of MKR relative to other assets is what matters, and that there is a Goldilocks zone where there is sufficient MKR to feel involved but not sufficient to be distracted by capital management. The author also discusses the cost of participation and the concept of leveraged time versus non-leveraged time. The author suggests several implications for building the Maker community, including engaging in a wider search for inspiration, maintaining initiatives such as SourceCred, and exploring other decision-making systems. The author asks for feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.552304558186911
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "5",
                    "time": "04/11/2020-13:53:14",
                    "content": "@Planet_X , thanks for this post, this is pure gold imho. Just some comments here and there.     Planet_X:  There is no point whatsoever in selling MKR to venture capital funds.   I personally agree. But I am aware of many people in the community that disagree. What is sure is that these venture capital funds have not participated in the governance over the last 2 years. So, with respect the topic under discussion, you are objectively correct.     Planet_X:  The Maker community would likely benefit from engaging in a wider search into a variety of online groups just to get inspiration.   Totally agree. Let’s be honest: the active community members (~30 people as you said, maybe 100 including non–active ones) are all MKR-holders hoping to make some money eventually. Basic question to answer is: why isn’t Maker attracting talents (coders, economists, social experts, etc) willing to contribute out of interest/passion/curiosity/curriculum-building/etc, rather than for profit? They do in some many other opensource projects (too many to list). One example i love and use is https://lichess.org/ . Completely free, community driven, it has quickly become the N1 website to play chess in the world.     Planet_X:  Initiatives such as SourceCred should be maintained, expanded or even forked to cover activities that goes beyond the forum.   Totally agree! I was skeptical about SourceCred but I changed my mind. I am personally finding very rewarding to get a few 100s USD/month. It psychologically ‘‘binds’’ me to the project. But again, this is a purely financial incentive. And not big enough to attract talents, anyways.     Planet_X:  Every possible method that automates decisions, reduces voting or enables scaling with minimum human involvement should be applauded.   Again: totally agree. I believe there is a need for Governance (I don’t yet trust fully automated stablecoins platforms). But we should make it as lightweight as possible. I believe this is what the Market/cryptospace wants anyway and, eventually, will get. Less talk, more code. For example, Vitalik also expressed his opinion in this direction about 1 month ago. Let me also add that: it’s obviously very difficult to run a DAO. But for being a startup, MakerDAO administration is very bulky and slow-reacting. Just one example: after posting some questions here: (thread) I had to wait about 2 weeks to get some answers. And I got them only because I started pinging people in MakerChat. Not efficient! Also, several of the questions are still not answered. What should I do? Keep pinging? The main issue here (after discussion with @LongForWisdom) is that ‘people (at the Foundation) are not paid to answer in the forum, it’s not their job’.        Planet_X:  The present voting system is not the only system that can be used to make decisions. Crypto in general still closely follows real world traditions. Maker’s onchain polls strongly resemble an annual shareholders meeting, although at much higher frequency. Other systems are fully possible.   Again, 100% agree. But concretely, what are you proposing? In some other threads, people are discussing rewards systems for onchain voters… that might be good. But what else can be done? ",
                    "links": [
                        "https://forum.makerdao.com/t/transparency-makerdao-validator-of-xdai-blockchain/4659/6"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.527317176870748
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "3",
                    "time": "04/11/2020-14:13:49",
                    "content": "    iammeeoh:  Again, 100% agree. But concretely, what are you proposing?   I am not proposing anything. I am trying to slowly reach consensus on the as-is situation. Thanks for the extensive feedback btw. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/11/2020-14:21:17",
                    "content": "    Planet_X:  I am not proposing anything. I am trying to slowly reach consensus on the as-is situation.   Right. Of course I was not trying to ‘push you’. I was just  jumping ahead. You are right, it’s important to first reach widespread consensus. Appropriate actions will then follow.     Planet_X:  Thanks for the extensive feedback btw.   Thank you again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.013392857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#5",
                    "likes": "4",
                    "time": "04/11/2020-14:39:09",
                    "content": "First of all this is a spot on post, congrats, find below some comments     Planet_X:  There is no point whatsoever in selling MKR to venture capital funds. Like none. It is probably even detrimental as sardines and tunas feel their input can be wiped with a click.   Agree, however we do not know what they have been doing behind the scenes, if they can disclose it would be great to know.     Planet_X:  The Maker community would likely benefit from engaging in a wider search into a variety of online groups just to get inspiration. Does not have to be crypto related. Things to look for are community size, vigor, longevity, turnover and how they attract new members. Right now we do not even know what functioning in a 10-20 year perspective looks like   From personal experience I´ve tried to reach economists and people with financial background to join and there is still a skeptic view from what maker can do in the long run, that´s my experience at least for trying to onboard non crypto crowd.     Planet_X:  Initiatives such as SourceCred should be maintained, expanded or even forked to cover activities that goes beyond the forum. Maker badges are gold, hopefully one day people will be able to put them on their CV to prove consistency and commitment to potential employers.   Agree, as the incentives grow more people will probably dive in although the knowledge curve is quite significant so probably mostly crypto related crowds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.788704716336294
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#6",
                    "likes": "3",
                    "time": "04/11/2020-15:03:40",
                    "content": "    Planet_X:  There is no point whatsoever in selling MKR to venture capital funds.   Only one reason. They have cash. Today, the DAO is almost out of the woods and should almost be self-sustaining.     Planet_X:  There is also no denying participation in Maker governance comes at a cost. At present I estimate that it takes between 5 and 10 hours each week with relatively high mental intensity and no small ability to stay on top of things and being able to cast reasonably informed votes.   This challenge is only going to become more acute with more collateral types that are coming. Part of the benefit for a Real World Assets lender structure, is that governance can offload much of that cognitive load onto a fiduciary that will be held accountable to his / her investors.     Planet_X:  Initiatives such as SourceCred should be maintained, expanded or even forked to cover activities that goes beyond the forum.   Agreed 100%     Planet_X:  The present voting system is not the only system that can be used to make decisions. Crypto in general still closely follows real world traditions. Maker’s onchain polls strongly resemble an annual shareholders meeting, although at much higher frequency. Other systems are fully possible.   I have the impression that vote delegation will be more powerful that we all realize. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.998666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "6",
                    "time": "04/11/2020-16:03:29",
                    "content": "This is an excellent post @Planet_X thank you for taking timeout to write it. At the end of the day, in my opinion ALL VCs that hold MKR would like to participate in Governance, but the lack of Regulatory oversite/guidance by Regulators does not allow them to take on more Risk, and make governance decisions that could lead to Litigation. But, I am almost 100% certain that VCs like A16Z advise, or have advised the Maker Foundation–and are a phone call away, when needed. For this I am grateful because some of these VCs have some of the smartest minds in the world, IMO. I also believe that the money that was generated by selling MKR to these VCs is the reason why the Maker Foundation is able to bootstrap community programs, keep talent around, marketing of DAI, etc. Yes, in a perfect it would be nice to have more talent and a gigantic community that is eager to Vote every week. The reality is most Finance Folks would be confused if you told them that the Woe exceeded the Joy, or that the Litter is less than the Dust limit. And the average Jane and Joe have no interest in talking about finance.  But give them a DAO about Fashion, Sports, or Gossip–they’ll eat all day and night. Finance just isn’t attractive for most. IMO–what we the small Maker Community need to do is focus on incentivizing Voter participation and figure out what is the game theory behind such incentives. We can start by making recommendations/voicing our opinion of what these incentives should look like, and the economic theory of such. Or, we can sit around and let the Maker Foundation make the decision for us (hopefully we can make it happen).  Either way–something has to happen/change. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.336904761904761
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#8",
                    "likes": "3",
                    "time": "04/11/2020-16:08:09",
                    "content": "A fantastic post. Thank you. What is your take on this: for investors with a large absolute stake in MKR, why aren’t they hiring an agent to participate in governance for them? While the value of their time might be too high, I would have expected fixed compensation to an agent to yield a good ROI. It seems to not be the case. Does that reason extend to delegation?  I think selling to funds was a good idea in the past for cash reasons, as mentioned by @mrabino1,  and also the expected service in return was much higher than it turned out to be. 2/3. SourceCred and badges are probably great. I recently dismissed financial incentives to voting but maybe I’m to quick to dismiss common behavioral reactions. Trickles of reward in the form of status or relatively symbolic money amounts may well drive behavior. On top of delegation, maybe free voting will also increase participation more than we’d expect. Some holders may be stopped by the perspective of regularly losing small amounts just to have their say (however irrational that might be). Agreed, and anything that pushes the DAO towards a stronger executive team is also good.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.077743271221532
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#9",
                    "likes": "5",
                    "time": "04/11/2020-16:17:47",
                    "content": "    swakya:  why aren’t they hiring an agent to participate in governance for them?   No doubt this is a regulatory constraint. Almost certainly they cannot be seen to be “controlling” or influencing the direction of the protocol (my sense).     swakya:  I recently dismissed financial incentives to voting but maybe I’m to quick to dismiss common behavioral reactions. Trickles of reward in the form of status or relatively symbolic money amounts may well drive behavior.   Same here.     swakya:  On top of delegation, maybe free voting will also increase participation more than we’d expect. Some holders may be stopped by the perspective of regularly losing small amounts just to have their say (however irrational that might be).   Delegation or layer 2, etc… but at the end of the day, when small players either work together (which is especially challenging in an DAO) or with vote delegation where one person can have the voting power of 10,000 people, I believe we will see a huge change in the voting influence. Maybe not the # of voters… but most certainly in the MKR that votes… at least that is my sense of things. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.822751322751323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#10",
                    "likes": "1",
                    "time": "04/11/2020-16:29:52",
                    "content": "    swakya:  for investors with a large absolute stake in MKR, why aren’t they hiring an agent to participate in governance for them?   It could be regulations, as already pointed out. My take on it is that it is just technically too difficult. If a VC is able to find an individual smart and knowledgeable enough to be trusted with MKR voting, then this individual is actually better employed looking for the next DeFi wonder. Maker governance participation does not scale, putting money in the next DeFi coin does scale. The above post applies as much to employees as it does to VC firms it is just a different scale. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.442857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "2",
                    "time": "04/11/2020-17:02:41",
                    "content": "    mrabino1:  No doubt this is a regulatory constraint.   There is doubt, actually. Why, if this was indeed the case, they don’t just come here and state clearly: “we have invested in MKR but we cannot participate to governance” ? I don’t really think this would be considered bad wrt any possible regulation.     Planet_X:  My take on it is that it is just technically too difficult.   I am also inclined towards this viewpoint. They are most likely just betting their money on several crypto projects, and waiting for gains. Not developing the projects they are invested with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#12",
                    "likes": "2",
                    "time": "04/11/2020-17:07:39",
                    "content": "    iammeeoh:  There is doubt, actually. Why, if this was indeed the case, they don’t just come here and state clearly: “we have invested in MKR but we cannot participate to governance” ? I don’t really think this would be considered bad wrt any possible regulation.   fair point ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "8",
                    "time": "04/11/2020-22:49:12",
                    "content": "Maker is in the business of building a shadow bank, from scratch, on an immature technology and in a legally uncharted area. That being not enough, it also work like a DAO, which really no one knows how to work with neither (and we are not there yet). And still, it’s a $500M business generating millions in revenues and the #1 DeFi project. That’s impressive. We have no leadership (as both the Foundation or VC are limited by legal) and the Governance Facilitators are expressively expected to be neutral and not propose much. Some people are anonymous. That remind me a excerpt from the book The Lombard Street  In theory, nothing can be worse than this government for a bank a shifting executive; a board of directors chosen too young for it to be known whether they are able; a committee of management, in which seniority is the necessary qualification, and old age the common result; and no trained bankers anywhere.  Now this bank is the Bank of England, 150 years after it’s charter of incorporation. Let’s hope we learn faster.     iammeeoh:  Basic question to answer is: why isn’t Maker attracting talents (coders, economists, social experts, etc) willing to contribute out of interest/passion/curiosity/curriculum-building/etc, rather than for profit?   If we want more coders (at the operational level), we should pay for that. To pay for that we need a structure. We are getting there. Being on the board of some startup, I must say this governance is working quite right. A bit lost in the operational level. By focusing too much on the operational level, we lose the strategic level and the time pressure. What are our business target for next year? How are we performing compared to our competitors? What is our business? Who are our customers? Obviously when you have to deal with the peg and flash loan governance attacks you are not thinking at this level. You just try to shut down one fire after the next. You take the nearest one. But sometimes you need someone remote to tell you a bigger fire is burning elsewhere and no one from the inside is seeing it. Maybe the VCs can play the role of asking those questions? Not sure they will. But it’s basically asking us once a quarter what we are doing to make their LP rich. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.440547052154195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "4",
                    "time": "05/11/2020-12:56:11",
                    "content": "Hey @Planet_X, I want to echo what others have already said. I think this is a valuable post, and I’m glad you took the time to write and share it. I’m not sure I entirely agree with the normal distribution curves you’re sharing, but there is definitely food for thought there. I’m not sure it is rational for larger holders to take an active role in the governance process as things stand, given the other factors affecting their actions (lack of regulatory certainty, diffusion of responsibility, not wanting to be seen to control a decentralized system.) I don’t think this can be boiled down to ‘too rich, no time’ though.     Planet_X:  First and foremost it is important to realize that it is not the amount of MKR that matter, it is the amount of MKR relative to other assets.   I think this is a valuable observation. Once again, I’m not sure it necessarily holds true universally (possibly not even generally.) But it’s definitely not something I’d explicitly considered before. My view of participation is that often it isn’t based on rational self-interest at all, at least not monetary interest. I think intrinsic interest in Maker, the protocol and the potential it has to affect the world plays into a large part of the motivation for many of those actively engaged.     Planet_X:  It is simply not for everyone to be able to spend this amount of time on Maker.   Definitely true. Delegation is often pointed to as the solution for this, but we’ve yet to see how well that will work in practice for this community.     Planet_X:  There is no point whatsoever in selling MKR to venture capital funds. Like none. It is probably even detrimental as sardines and tunas feel their input can be wiped with a click.   I think this is probably more correct than not at this point in time. It’s worth noting that this was not always the case though. As others have mentioned, the Maker Foundation needed funds to bootstrap the protocol. VC funds helped provide that capital earlier in the project’s life cycle.     Planet_X:  The Maker community would likely benefit from engaging in a wider search into a variety of online groups just to get inspiration.   This is probably worthwhile, if anyone knows of any likely communities, please consider making posts about them and how they have operated consistently over longer time periods.     Planet_X:  Initiatives such as SourceCred should be maintained, expanded or even forked to cover activities that goes beyond the forum.   Glad to see that SourceCred is still appreciated. Hopefully MKR holders feel similarly about it’s value and confirm the declaration of intent that’s going into the November governance cycle.     Planet_X:  The present voting system is not the only system that can be used to make decisions. Crypto in general still closely follows real world traditions. Maker’s onchain polls strongly resemble an annual shareholders meeting, although at much higher frequency. Other systems are fully possible.   Definitely agree with this. I think we’re starting to see a shift towards delegation of responsibility in some areas (rates group, Maker Representatives, more domain teams, etc.) But there are definitely more interesting solutions that can be trialled. I think the way forward here is for someone to put some time and research into the area and come back with a post discussing some possibilities.     Planet_X:  Every possible method that automates decisions, reduces voting or enables scaling with minimum human involvement should be applauded. It will be most interesting to see what the concept of Instant Access Modules can bring.   Yep, also agree. Again, I think we’re moving in that direction slowly. As you say, the debt ceiling instant access modules should hopefully allow us to stop have such frequent debt ceiling signals. Once again, if people have further ideas of how to implement this, please write something up. I know you wrote up a series a little while ago regarding Staking MKR, @Planet_X, and I still refer people to it when the topic comes up.  I’m seeing a lot of agreement with your points generally, and I would like to encourage people to focus on making actionable proposals to move Maker Governance in the desired direction. Incremental improvements are the way to go here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.562529613835584
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#15",
                    "likes": "1",
                    "time": "08/11/2020-18:24:32",
                    "content": "Good post @Planet_X and a lot of high quality reponses. Rather than pick and quote and respond that way I will just construct my own reply. I am with @LongForWisdom in that I disagree with the reasonsing behind the bell curve.   Frankly it would be nice to look at the actual curve of voters because I don’t think this has the bell curve you suggest.  Or to put it a better way we still have serious whales driving the votes, and smaller fish finding it basically too expensive to vote on-chain.  (basically it just isn’t worth the hassle and their vote won’t sway anything, where as the whales dictate everything).  IMO without actual data I I dispute the idea the governance participation curve is bell like What I think generally is that ease of access to post vs. ease of coding up a solution (i.e. not just to do a DOI or make a formal MIP proposal) but also writing the code changes is not just daunting but pretty much impossible for most. If the goal is more coders then perhaps we need to focus on incentivizing code production.   If the goal is penalize discussion well just don’t reward it.  Personally I think if the goal is to incentivize code then just put higher SourceCred on github activity.   I don’t think we want to decrease discussion but at some point with 1000 users in the forums the whole rewards for forum participation will probably become a thorny issue by itself, and the cognative communication overhead to become extreme. I come back to some basic questions:  What is the general goal with a discussion (what is the problem being addressed)?  We have revisted this whole voter partipation thing many times now without much real traction.  Though a lot of changes have occurred.  DSSChief rework in progress, voting portals improved, and I think our reports are all improving but we have a long way to go. If there is a goal, can we define a measurement model that will give us data we can use to measure success, failure (or even a change).  I still have not seen even a first shot data analysis on voter participation, much less how this analysis data evolves over time.  Like a weekly governance report with a bin histogram of voters, a bin of the GP (governance participation) of voters, new governance voters entering, leaving, a general governance participation number (votes/voters*ThingsToVoteOn) as a kind of community GP (or CGP) metric.   https://mkrgov.science has come a long ways and pieces of this data are there I still feel like we are missing key data components with respect to governance participation from a size of holder, how much they vote perspective.  If we are going to even try to address this governance participation issue lets try to get some metrics together as I to this day still don’t have a clean handle on what the actual MKR holder distribution is against what is in DSSChief and participation. There is another issue I see across the entire space of governance/financial tokens btw.  There is an inherent conflict between governance tokens having value and the desire to earn return on these in liquidity contracts (or as collateral to borrow against) vs. them being locked in governance.   Someone may find it far better to put MKR into a liquidity contract to earn farming returns than to lock it in governance and earn 0 return.   These are features left out of the above analysis and as far as I can tell there has been little discussion much less a practical answer on how governance tokens CAN both participate in providing liquidity to markets AND governace at the same time. To my mind when it comes to governance analysis I come back to some basic analysis questions.  What are the holder stats of MKR holders in DSSChief and what is their governance participation?  Using this data create a generalized Community Governance Participation number/metric to be used when discussing the success or failure of any changes to the system. What are all the other MKR holders doing with their MKR if they are not in DSSChief? What is the real MKR holder distribution? What is the theoretical maximum governance participation? How is all of the above changing over time?  I agree that I think the following are, or will be, helpful.   Delegation should help somewhat with governance participation. But this will NOT overcome competition for token value in DeFI as LP provider/ala farming or just plain as collateral to borrow against.   Rewards for participation in the system generally are helpful (i.e. SourceCred, forum badges and connecting MKR voting wallets to users in forums)   New DSSChief where multiple votes can be agglomerated into a single on-chain tx (reducing voting cost).   New voting portal.   A weekly governance participation report would be helpful as well as some well defined governance participation metrics.   Addressing questions like:  Does the whole MKR deflationary burn model skew voting to same old players and exclude new participants. Does MKR having monetary value and ability to generate returns via borrowing or in farming keep MKR from participating in governance. Are there real barriers to governance access that are stopping people. Do we really want/need more participation?  I consider to be key in any discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.440564401352073
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BlueCat",
                    "index": "#16",
                    "likes": "7",
                    "time": "10/11/2020-19:07:24",
                    "content": "Unless there is no economic inventive, most people won’t vote. And I mean direct one. Like some return when you vote. The downside is that some people will vote just for the ROI and won’t put much thought in the outcome. In my case I don’t vote because all my MKR is tied up as liqudity on uniswap earning a sweet APY. It has to be super important decision, that will affect my long term profit potential and be a close tie for me to pull liquidity (suffer IL maybe), spend on fees, vote, return liquidity. Also would help to have newsletter that announces the votes. For example I’m having hard time keeping up with all the project I’m involved with and I’m missing the discussions on most because I don’t get notified for them. Just recently I setup this forum to send me weekly updates with important threads (not sure how it decides which are important though) and hence I’m here writing this  And I’m pretty sure most people haven’t done this. I haven’t received makerdao newsletter since I can remember, and I signed-up for the project when it started…so communication is key. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.847537878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#17",
                    "likes": "2",
                    "time": "10/11/2020-21:58:42",
                    "content": "Hi @BlueCat, @twblack88 uploads a maker relay every monday which includes the pools and updates of the maker ecosystem and I upload them to the maker dao reddit channel & pin it for the week  (still I get your point that you don’t receive it by mail) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#18",
                    "likes": "5",
                    "time": "10/11/2020-22:28:35",
                    "content": "The system should be designed to achieve the desired governance participation in the same way DAI is designed to keep the peg. We can get away with such low participation only for so long. We’ve seen some problems resulting from the low participation and there are probably others to come. Delegation is great, but it’s only a tiny improvement if not accompanied with other incentives. Simply - it should be more profitable for MKR holders to vote (in a meaningful way) than not to vote. The profitability should not be dependant on the MKR price appreciation. I’ve received complaints that I just talk negative about the project and not offer any solutions. The solution is to design v3 DAI. Are we too tired to start developing after just 2 major versions? Both DAI and MKR (governance) are not designed to work in the current environment of  LP incentives high onchain fees L2s stablecoins as a dominant collateral almost infinite demand for DAI limited interest in borrowing at 0% insurance MKR price increase lagging the ETH price increase and pretty much all DeFi flash loans crypto hedge funds (a few other events that could be anticipated but they are not here yet)  You cannot patch everything forever. Of course the system should be maintained and improved to survive another year or so until the next version is available. We cannot afford to develop v3 much longer than 1 year I think. Why do we let others do it when we have so much head start in reputation, experience etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.370568783068784
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TeodorC",
                    "index": "#19",
                    "likes": "2",
                    "time": "11/11/2020-01:17:42",
                    "content": "    BlueCat:  which   My 0,02$ go with @BlueCat, the biggest challenge with getting people involved is the difficulty to keep track of all on-going projects/discussions even if shared on a regular basis. Going beyond Maker, for users/people with stake in projects this only gets more difficult with an increasing number of projects which are also interconnected. Notifications & calls to action are essentials and they IMO, Maker team has done an awesome job so far at keeping the community up to date btw🙌. Quoting @LongForWisdom, the economic incentive might not be the biggest factor that motivates people to get involved in decision making, but rather the direct impact a decision will have on their self or community. Of course, $DAI incentive for good decision making and involvement is an awesome add-on, but it’s worth considering the counter which is that people will vote for financial gains rather that driving value. Looking at the ecosystem, projects that use DAI or rely on Maker’s platform will be the most impacted by Maker’s decision making process, and they should have priority over investors from my POV, thus their org’s or representatives/agents/delegates should have the biggest incentive to get involved in governance. Not sure if they are limited by legislation as are VC’s @Planet_X made a great point that getting involved in governance takes a good amount of time and research to make worthwhile votes/proposals. @swakya’s idea is brilliant IMO, for organizations with a bigger stake it would make a lot of sense to have a delegate/agent to coordinate comms and voting. Curious if there are ways around current legislation limitations, maybe delegates could act as a separate entity, similar to an oracle system🤷‍♂️ While it’s great to have people contributing to a project out of passion, I think it is a bit unrealistic to expect people that have reached a certain level in their careers to contribute constantly out of pure interest @iammeeoh. This won’t be due to lack of altruism, but maybe due to the workload that most people have. This might be a different case for people that are just starting out and will look at contributions as internships or methods of building skills/reputation. My POV is that each contribution should be rewarded, if a foundation grows or generates revenue, everyone that has contributed to its success should be compensated for their work. From what I saw, the Maker team is already debating ideas on how to compensate contributors from the DAO, thus people being employed directly by the DAO and not the foundation. Think that an ideal solution is to have team leads or Project Leads to cast proposals and the proposals should be included in the decision making process. This is already common practice from what I know, but not sure of any challenges/limitations of this model. Did anyone explore it in more detail? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.088392857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#20",
                    "likes": "3",
                    "time": "11/11/2020-02:56:23",
                    "content": "Great to hear the positive comments about SourceCred (DISCLAIMER: from SourceCred and running trial ). We’re definitely pleased with how the trial has gone, and hope to deepen our engagement should the SourceCred Funding Declaration (MIP13c3-SP6) pass. If you’re a sardine or tuna  (or any sized marine creature) and a fan of SourceCred, don’t forget to vote!     Planet_X:  Initiatives such as SourceCred should be maintained, expanded or even forked to cover activities that goes beyond the forum.       MakerMan:  Personally I think if the goal is to incentivize code then just put higher SourceCred on github activity. I don’t think we want to decrease discussion but at some point with 1000 users in the forums the whole rewards for forum participation will probably become a thorny issue by itself, and the cognative communication overhead to become extreme.   In our survey covering the 1st phase of the trial, we asked contributors for their thoughts on this. From the final report:   How would you feel about expanding the use of SourceCred within Maker to other platforms such as Github and Maker Chat? 1 = “terrible idea” and 10 = “great idea”  RESPONSE:  (16 responses) 6.2/10, General vibe is quite polarized for and against, Github raises the most questions and possibilities, some view chat as a valuable addition but some view it as more socializing that shouldn’t be rewarded, a reference was made to directly rewarding MIPS  While concerns about expanding to GitHub or chat are valid, I think it could be done responsibly.  Since the forum trial began some five months ago, the GitHub and Discord plugins have matured and been tested in more communities. We recently supported a community using all three plugins whose token mooned (1Hive), attracting considerable gaming. This forced us to develop countermeasures, which have worked and hardened the protocol. With this experience under our belt, and considering Maker is a much more stable environment than 1Hive, I’m confident that a similar setup for Maker could work with continued active support from SourceCred. We are also currently developing a new plugin, the Creditor, that can value arbitrary contributions, not just those captured by specific platforms. This could open up some interesting possibilities as well. ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmYfYpqF?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/sourcecred-trial-final-report/4569"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.734726295210166
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BlueCat",
                    "index": "#21",
                    "likes": "1",
                    "time": "11/11/2020-11:47:16",
                    "content": "People are busy, unless you push it right in front of their faces without them needing any action the reach will suffer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.809523809523808
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#22",
                    "likes": "0",
                    "time": "10/02/2021-17:47:19",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}