{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-initiative-collateral-on-boarding-process/1344",
            "title": "Governance Initiative: Collateral On-Boarding Process ",
            "index": 1344,
            "category": [
                "Governance"
            ],
            "tags": [
                "collateral-onboard",
                "gov-initiative"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "7",
                    "time": "24/02/2020-02:06:23",
                    "content": "This group has now ceased meeting due to the completion of the onboarding process document and the initiation of public collateral discussion meetings that seem likely to continue in the future.  What is happening? Over the past several months a working group of several people (both in Foundation and out) have been working on a new and more comprehensive version of the Collateral On-boarding Process. This has now been posted to the forum! Why is it happening? Some issues were identified with the current process.  No one was defined as responsible for any of the actions defined within it. The actions themselves weren’t very well defined in some cases. Collateral Applications were (and are) stacking up in this forum with no action being taken.  Who is involved? @LongForWisdom @Mitote @Planet_X have been involved since the inception. LongForWisdom initiated the working group and reached out to Mitote and Planet_X as they had been responding in the collateral application threads more consistently than anyone else on the forum. @rich.brown encouraged the working group and   @Cyrus join us a few weeks after it began. Several members of the Foundation and the governance community have offered feedback on a review version of the document over the last few weeks. When should we expect results? Previously  Looks like this is getting moved into the MIPs process as expected. Hopefully this will begin soon under the MIPs framework.  The document has now been posted to the forum. The planned work has been completed. Future work may take place with regards to integrating the Collateral Onboarding Process into the MIPs process.  The document is largely complete, the core working group is working on integrating the feedback offered by both the Foundation and prominent governance community members. We are hoping to present the document on the forums within the next few weeks, in likelihood, it will also be discussed on the governance and risk call. When the document is presented on the forum, we will seek further feedback and include a timeline for the next steps towards putting the process into practice. ",
                    "links": [
                        "https://forum.makerdao.com/t/collateral-onboarding-process-v1/1412",
                        "https://forum.makerdao.com/t/mip0c12-sp2-subproposal-for-core-personnel-onboarding-governance-facilitator/2351",
                        "https://forum.makerdao.com/t/governance-initiatives/1347"
                    ],
                    "GPT-summary": "The post explains the completion of the Collateral On-boarding Process document and the initiation of public collateral discussion meetings. The author explains the issues with the current process and the involvement of various people in the working group. The post also mentions the integration of feedback and seeking further feedback on the document.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.2102925809822365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/05/2020-17:00:02",
                    "content": "This topic was automatically closed after 6 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        }
    ]
}