{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-poll-transparency/2829",
            "title": "Maker Poll Transparency ",
            "index": 2829,
            "category": [
                "Miscellaneous",
                "Site Feedback"
            ],
            "tags": [
                "governance-poll",
                "vote-participation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMouse",
                    "index": "#1",
                    "likes": "6",
                    "time": "14/06/2020-07:46:55",
                    "content": "A warm hello to the Maker Community. I recently added my MKR to the governance portal so that I could participate in voting, though I have been watching for quite some time. One aspect that I find quite disheartening with respect to polling - thought I fully admit I may simply not know where to look - is that I am unable to deduce a breakdown of voters across each of the polling options. A clear example of this is: https://vote.makerdao.com/polling-proposal/qmyyuvc3fphgt9bqotkedijxt5mpnjfktz3je9c2cspfae With votes as close as this has been, I feel it would be beneficial to the community to understand the contributions of each address under each of the ‘vote breakdown’ options. My request/proposal would be to ask: Is it possible to please make each vote option a rollover or clickable link that displays the address and the associated MKR contributions. (I have attached a mockup to illustrate the idea) Voter Breakdown UI Proposal1239×1600 288 KB This would allow a clearer understanding with respect to how our polls are being navigated. Ie. Are polls forcibly directed by whales or is there actually a greater alignment from the wider community? ",
                    "links": [
                        "https://forum.makerdao.com/t/week-2-dai-distributions-sourcecred-trial/2846"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/06/2020-12:13:43",
                    "content": "Hello @MakerMouse, welcome to the community! With regards to vote breakdown, I can direct you to mkrgov.science, which calculates and displays these metrics for each vote. The site can be a little unreliable though, so it’s always good to verify what you are seeing against the official dashboard (as far as possible.) It’s also worth highlighting that mkrgov.science does not support IRV (ranked voting) that has been introduced recently. Some metrics for those types of votes will be incorrect. Address participation should still work though. Here is a link to the June 8th poll: https://mkrgov.science/poll/185 (the description incorrectly points to the previous poll, check the start date.) And a screenshot of the relevant graphs: image1280×737 43 KB Additionally, there is also https://catflip.co/voting, but this only shows data for executive votes. For a curated list of tools like this, see: https://community-development.makerdao.com/governance/governance-tools @Derek is in charge of the official voting frontend. Perhaps he can comment on the feasibility of your suggested change. ",
                    "links": [
                        "https://mkrgov.science/poll/185",
                        "https://catflip.co/voting",
                        "https://community-development.makerdao.com/governance/governance-tools"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.020833333333333
                }
            ]
        }
    ]
}