{
    "poll_list": [
        {
            "title": "Adjust wstETH-A System Parameters - December 06, 2021",
            "index": "11934",
            "option": "Yes",
            "supporting_mkr": "76,442",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/wsteth-a-parameters-adjustment-dec-1st-2021/11934",
            "title": "wstETH-A Parameters Adjustment - Dec 1st 2021 ",
            "index": 11934,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "debt-ceiling",
                "steth",
                "wsteth"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "11",
                    "time": "01/12/2021-21:12:55",
                    "content": "Hey all, Together with PE and Oracle Core Unit we decided to propose a change to a few wstETH-A parameters allowing for larger debt exposure. The keeper infrastructure has now been improved and enables keepers to sell collateral on Curve where majority of stETH liquidity is. Liquidity between stETH and ETH has significantly improved over the last few months. One can exchange $1bn stETH to ETH by incurring only about 1% slippage right now, while 1% slippage between ETH and DAI is made when selling $75m of ETH. This means ETH/DAI liquidity is a much more limiting factor when determining stETH max debt ceiling from a liquidity perspective.  1312×1322 198 KB  Yet, the stETH slippage is more important not to occur as it breaks the peg between stETH and ETH, lowering the confidence about stETH 1:1 redeemability and potentially triggering cascading redemptions from Curve pool. Also, by enabling stETH holders another use case (to leverage their stETH collateral and make yield by DAI liquidity mining), we might potentially cause current stETH/ETH LP providers to pull part of liquidity out of Curve, which worsens liquidity metric. This is why we believe the debt ceiling of stETH should still be more conservative than what slippage numbers might justify. Although we believe the 500m debt ceiling should be achievable in mid term, and higher than this amount in the long term, we are currently proposing an increase to 200m. Note that the current debt utilization is only 27m. We were also able to identify only two larger lending protocols that currently enable leverage on stETH: Abracadabra (ycrvstETH as collateral) and Anchor protocol (Terra based). Market borrow size is probably between $300m and $400m (we don’t have exact figures but assuming 200%+ CR and knowing $900m of collateral deposited). Finally, note that we still treat wstETH as riskier collateral technically speaking, while oracle is relying on only two on-chain sources: Curve and Balancer. This are the main reasons a more cautious sequential increase in debt ceiling is advised. We are also proposing changes to 1) both DC-IAM gap and ttl parameters, allowing for faster debt growth and 2) auction parameters, which allows for faster settlement time of liquidated collateral now that keeper infrastructure is more robust. Proposed parameters for wstETH-A: Debt Ceiling line = 200m DC-IAM debt growth gap = 20m DC-IAM debt growth reset time ttl = 6h Auction starting price multiplier buf= 1.2 Auctioned debt capacity ilk.hole = 15m If there are no larger community objections, the changes will be included into on-chain poll next week. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-december-2021/12436",
                        "https://forum.makerdao.com/t/maker-relay-ep-75-en-espanol/12214",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/30",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/15",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-25-december-2/11967",
                        "https://forum.makerdao.com/t/maker-governance-review-2021/12478"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6290266106442575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "03/03/2022-03:13:46",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "394"
}