{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/multichain-strategy-community-call/12976",
            "title": "Multichain Strategy Community Call ",
            "index": 12976,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "wormhole",
                "layer-2",
                "public-call",
                "pe-001",
                "multichain",
                "teleport"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bartek",
                    "index": "#1",
                    "likes": "12",
                    "time": "01/02/2022-19:07:12",
                    "content": "Hi everyone, In advance of Wednesday’s L2 Risk Considerations Discussion at 4pm UTC, Protocol Engineering would like to share a deck we will be walking through on the call. This is to give people an opportunity to review the concepts that will be presented. Note, the call will be recorded and added to this post. Meeting purpose To present Protocol Engineering’s current thinking about how Maker should be deployed on different Domains. This will include risk considerations for Layer 2 rollups, L1s as well as sidechains considering an MCD deployment. Agenda The discussion will present a common framework for how DAI should be bridged, transferred and minted across different domains. As a result we will highlight the risks and  explore how these may be mitigated. Likewise, we will surface the worst case consequences in the event anything goes wrong and the impacts upon DAI and/or MKR holders. Why is this important This presentation is important for MKR holders and should be considered the basis for how aggressive or conservative Maker wants to be in a multichain environment. This is not too dissimilar to how MKR holders manage risks for different collaterals such as RWAs and the D3M. This meeting will be an opportunity for MKR holders to engage in discussion regarding the MultiChain strategy as we move towards minting DIA on new domains. Suggested preliminary reading PE is engaged right now in the development of custom bridge for Arbitrum, Optimism and StarkNet as well as development of smart contract framework for wormholing (teleporting) DAI between different domains. You can read more about these efforts here:  Fast Withdrawal Bridge Maker Wormhole MultiChain strategy  Document for preview https://docs.google.com/presentation/d/1snU0wsxMDAOFguyOTzYCorJFtmBRrAYDtR74ZCAjDDQ/edit#slide=id.p Community Call recording https://viridian-dirigible-595.notion.site/L2-Risk-Considerations-Community-Call-f3f26ed3741949229fa1bb3b307bf74b ",
                    "links": [
                        "https://forum.makerdao.com/t/introducing-maker-wormhole/11550",
                        "https://forum.makerdao.com/t/a-multichain-strategy-and-roadmap-for-maker/8380",
                        "https://docs.google.com/presentation/d/1snU0wsxMDAOFguyOTzYCorJFtmBRrAYDtR74ZCAjDDQ/edit#slide=id.p",
                        "https://viridian-dirigible-595.notion.site/L2-Risk-Considerations-Community-Call-f3f26ed3741949229fa1bb3b307bf74b",
                        "https://forum.makerdao.com/t/pecu-month-in-review-february-2022/14492",
                        "https://forum.makerdao.com/t/protocol-engineering-month-in-review-january-2022/13202"
                    ],
                    "GPT-summary": "The post is an announcement for a community call to discuss Protocol Engineering's current thinking about how Maker should be deployed on different domains. The call will present a common framework for how DAI should be bridged, transferred, and minted across different domains, and highlight the risks and explore how these may be mitigated. The post also provides a link to a document for preview and a recording of the community call.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.141148325358852
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/02/2022-21:05:32",
                    "content": "Is it true that for layer-2 optimistic rollups the data availability problem is significantly greater than ZK-Rollups because if there’s a Dispute, settling transactions from layer 2 back down to layer 1 (Ethereum)  includes revisiting All transactions (data) that took place in order to resolve the dispute? And unfortunately data can be lost in blockchains–its possible, right? If true, does the Maker Wormhole solve this issue in OR? And with regards to Centralized Exchanges eventually accepting Layer 2 tokens directly from say Arbitrum–how does that work with regards to canonical DAI–will it stay out of circulation on L1 (locked)? I’m imagining transferring canonical DAI to Gemini and exchanging for USD. Same goes for another Layer 1–recently Coinbase started to accept SPL tokens from Solana–if they decided to accept wrappedDAI directly from Solana–since you mention that wrappedDAI is not fungible. Does the same occur for USDC (not fungible) which is now migrating to other chains like FLOW and Algorand. And last but not least–this  is super funny  – but I think the face of Andrzej Duda is more realistic   image710×326 25.3 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5986552028218695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bartek",
                    "index": "#3",
                    "likes": "3",
                    "time": "02/02/2022-12:45:02",
                    "content": "Data availability problem is equally important to both Optimistic and zkRollups. With zkRollups, if data is hidden, L2 operator can effectively freeze user’s funds as this data is required to trustlessly release funds from L1 escrow. Take a simple example of dYdX - it holds almost 1B of USDC in one L1 contract  (0xD54f502e184B6B739d7D27a6410a67dc462D69c8). If data was not available, these funds would be frozen forever if dYdX operator suddenly disappeared. Maker Wormhole does not solve the problem of data availability, quite in contrary -  it assumes that it is guaranteed that funds are retrievable from L2. If they are not, then possibly MKR holders (and DAI holders) will take a loss. As for direct deposits/withdrawals to L2 from Centralised Exchange, my understanding is that the exchange will simply use an L2 wallet to facilitate that, same as it is using today with L1, so it will act in a way as a liquidity provider for the end user who could withdraw from L1 to CEX and deposit from CEX to L2. But to enable that, CEX needs to first move funds from L1 to L2 using “standard” deposit/withdrawal (or Wormhole) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.446969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "5",
                    "time": "02/02/2022-21:39:26",
                    "content": "Right on cue, wormhole exploit:  twitter.com    Wormhole🌪 @wormholecrypto  ‼️ The wormhole network is down for maintenance as we look into a potential exploit.  📢 We will provide updates here as soon as we have them.  🙏 Thank you for your patience.   8:42 PM - 2 Feb 2022           390                100            ",
                    "links": [
                        "https://twitter.com/wormholecrypto/status/1488976115750383626?s=21",
                        "https://twitter.com/wormholecrypto/status/1488976115750383626?s=21",
                        "https://twitter.com/wormholecrypto/status/1488976115750383626?s=21"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.216931216931217
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/05/2022-21:39:32",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}