{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-burn-baby-burn-burn-the-mkr-treasury/11617",
            "title": "[Signal Request] Burn Baby Burn! [Burn The MKR Treasury] ",
            "index": 11617,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-rejected",
                "makerburn",
                "vesting",
                "surplus-buffer"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#1",
                    "likes": "7",
                    "time": "12/11/2021-21:02:04",
                    "content": " TLDR  Some of us want to raise the surplus buffer to fund xyz Some of us want to divert revenue towards burning MKR We don’t use the 84k MKR in our treasury  Let’s burn the MKR in the treasury!  Burn half Use the remainder to vest core units   Bump surplus buffer to 130M Big burn makes everyone happy!      Overview There’s been a lot of back and forth about whether or not we should raise the Surplus Buffer or focus on restarting the MKR burn. Personally, I see both sides. We need a higher Surplus Buffer to fund development, operations, etc., and to cover (a sliver of) any black swans that may come up. On the other hand, we should be burning, especially while MKR is dirt cheap, and the burn can be more effective. The debate about all of this, though, has gotten to be pretty heated, but it’s silly and unnecessarily divisive. We can have the best of both worlds… today!   The Signal Request Let’s burn the MKR in the treasury! There’s about 84k MKR in the treasury, generously given to us by the foundation. We’ve used zero of it. We should burn half and use the remainder to vest core units. At the same time, we can bump the Surplus Buffer to 130M!  Pros & Cons  Cons  By burning MKR from the treasury, we’re not actually burning revenue and taking MKR off the market. Since we can mint MKR at will, it’s technically a net-neutral action.  The reality is, though, we’ll likely never mint MKR to fund anything, but we may spend the MKR in the treasury to fund things. Burning that MKR ensures we’ll never spend it and the true supply is reduced.     Pros  Have our cake and eat it too! Reduce the supply of MKR   Our supply on Coinmarketcap, Coingecko, etc., will update too!   We can still raise the Surplus Buffer Make everyone happy!     Burn Baby Burn!      Burn the MKR in the treasury? (Select all that apply)  Burn Half (42k MKR) Burn a Quarter (21k MKR) Burn (Some other amount) No (Why would you even propose this? ) Abstain     0 voters        Re-Run @ultraschuppi’s Surplus Buffer Signal Request?  Yes!   No Abstain     0 voters      Next Steps This poll will close on Friday, November 26. If the majority wants to burn some of the MKR in the treasury, we should settle on how much exactly to burn. Also, it would make sense to re-run @ultraschuppi’s Signal Request to increase the Surplus Buffer with this new idea in mind. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-increasing-the-surplus-buffer-2021-11/11448",
                        "https://forum.makerdao.com/t/signal-request-should-we-mint-new-mkr-for-protocol-expenses-or-fund-them-with-mkr-from-the-makerdao-treasury/11629",
                        "https://forum.makerdao.com/t/maker-relay-ep-72/11773",
                        "https://forum.makerdao.com/t/maker-relay-ep-72-en-espanol/11799",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-11-18/11713",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-18-25/11827",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/signal-request-should-we-mint-new-mkr-for-protocol-expenses-or-fund-them-with-mkr-from-the-makerdao-treasury/11629/2"
                    ],
                    "GPT-summary": "The author proposes to burn half of the 84k MKR in the treasury and use the remainder to vest core units, while also bumping the Surplus Buffer to 130M. The proposal is explained in detail, including pros and cons. The author also suggests re-running a previous Signal Request to increase the Surplus Buffer with this new idea in mind. Some 3rd parties give constructive criticism and ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.546019672531769
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "2",
                    "time": "12/11/2021-21:04:45",
                    "content": "Let’s just burn everything. If we need it later we can mint with a better price. No matter what the outcome of my signal request is. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#3",
                    "likes": "2",
                    "time": "12/11/2021-21:07:14",
                    "content": "For technical/ecosystem reasons, I still think we need to keep a small burn from flaps.  I think we could have some very undesirable results otherwise. I personally think we should burn the treasury, but there are some compelling legal points made about not calling mkr.mint() for anything other than debt auctions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.270833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tbone",
                    "index": "#4",
                    "likes": "4",
                    "time": "12/11/2021-21:10:56",
                    "content": "Small correction, MKR from the pause proxy has been used for vesting via DssVestTransferrable see here ",
                    "links": [
                        "https://etherscan.io/tx/0xe806c38e7c886973c486c9edbdd93c61ee26f759567adbcafe1a99ba6159554d"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#5",
                    "likes": "4",
                    "time": "12/11/2021-21:48:56",
                    "content": "We already had a signal request about whether to burn the 84k MKR in the protocol treasury. The result was NO, do not burn. Has anything fundamentally changed since then? Seems to me that fears of “need to get rid of it to avoid the temptation to spending it” have not materialized. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/11/2021-03:47:38",
                    "content": "I know it was voted No last time, but I believe it was for the full amount. (Don’t quote me.) Given the debate about burning or raising SB, I thought maybe burning a portion would be appealing. I’m not married to one result or another. We’ll see how the vote turns out I suppose. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.90625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#7",
                    "likes": "3",
                    "time": "13/11/2021-05:54:30",
                    "content": "@spidomo I think the reason behind Burban’s timely suggestion is two-fold. First, we are not doing much with the treasury, aside from allocating a small amount for CU MKR vesting, and have no foreseeable plans to do so. Second, with the debate about buy/burn and increasing the SB, why not burn a portion of the MKR already in the till gathering dust? Burning half or a quarter of the treasury will permanently remove that amount from circulation, thereby lowering the “circulating supply” (note: CMC and other trackers will change the circulating supply for MKR). We underestimate the positive psychological impact on the market of seeing the MKR supply go down by 42,000 or even 21,000. Given the debate on burning v increasing the SB, why not burn part of the treasury, get the SB to a more comfortable amount (130mm, perhaps) and wait for the next burn to occur with flaps at some point in the not-too-distant future? I see no downside in a “Burban Burn,” notwithstanding Mooney’s statement about legal/reg concerns, and only regulatory positives from having a larger SB. As a counterpoint – having the DAO mint and sell MKR on the market strikes me as more concerning behavior from a legal/regulatory perspective than a relatively small one-off burn of the treasury. Tosh ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.202791806958473
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#8",
                    "likes": "2",
                    "time": "13/11/2021-07:50:20",
                    "content": "The MKR in the treasury is already out of the circulation, because the supply in the market will remain the same after burning the treasury, I am not assuming strong price fluctuations.To do it just for PR reasons, it can backfire extremely. Burning MKR from with excessive income when the SB is full, I think it is much more effective because it takes away the actual supply in the market.for that, the burner has to burn for as long as possible Actually you have a really good point it doesnt make much sense when we are sitting on 84k MKR and increase the SB way over 100M to prevent a “black swan” event. Because we have this security against failure, I would just raise the SB a little or keep it short term at 60M and let the Bruner do the work for the current price! I would continue to use those MKR for CU MKR vesting, or put them into “work”. I liked the Idea for “yield farming” in the SE from Rune maybe we will have a similar concept in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.613541666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/krzkaczor",
                    "index": "#9",
                    "likes": "5",
                    "time": "13/11/2021-12:04:36",
                    "content": "Good to see the discussion about MKR Treasury reignite again. I believe that we should burn only the same number of MKR that is being minted for CU vesting (essentially making vesting neutral from accounting POV). Here are some of the ideas what to do with the rest:  selling some MKR for other DeFi bluechips – diversify treasury for AAVE, UNI, COMP so MKR governance can have a say in the governance process of other protocols, selling some MKR for DAI and increasing SB – this gives us safety net for future experiments and will help us survive the next bear market, keep rest of MKR for future vesting etc  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#10",
                    "likes": "2",
                    "time": "13/11/2021-13:18:02",
                    "content": "    krzkaczor:  Good to see the discussion about MKR Treasury reignite again. I believe that we should burn only the same number of MKR that is being minted for CU vesting (essentially making vesting neutral from accounting POV).   Agreed. Also the Treasury could be used to make some initial experiments in the direction of Sagittarius Engine (i.e., MKR rewards to some kind of users). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#11",
                    "likes": "3",
                    "time": "13/11/2021-13:18:53",
                    "content": "    krzkaczor:  selling some MKR for other DeFi bluechips – diversify treasury for AAVE, UNI, COMP so MKR governance can have a say in the governance process of other protocols,   I dont like the idea that we are dumping on the MKR holders to buy other Tokens than MKR I interpret that the protocol has a low confidence in itself, I would rather see strategic partnership with other DeFi Blue Chips for approaching regulation or marketing (or other areas where we have a similar goal) which could be founded partly from the treasury. In general I would use the treasury to set up more CU that we can scale on all fronts.     krzkaczor:  selling some MKR for DAI and increasing SB – this gives us safety net for future experiments and will help us survive the next bear market,   So we would sell for a lower price fill up the SB and burn for probably for a higher price, the causality makes no sense to me, particularly when we are now net profit and self sustaining, we could fill up the SB with regular income. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.094907407407407
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#12",
                    "likes": "5",
                    "time": "13/11/2021-14:15:10",
                    "content": "I like to think of the 84k MKR as a kind of surplus buffer in its own right. If we have another BT like event, this could be burned to “neutralize” any newly minted MKR from an accounting point of view. It’s great PR if the treasury fund allow us to prevent net minting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.018398268398268
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#13",
                    "likes": "1",
                    "time": "13/11/2021-14:21:52",
                    "content": "All of the above are good points – so perhaps the compromise is a limited burn of the treasury (21k, say), and keep the remainder as potential MKR for CU vesting + farming for the SE + treasury diversification (exchanging MKR for other stables and perhaps ETH). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.503571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/krzkaczor",
                    "index": "#14",
                    "likes": "1",
                    "time": "13/11/2021-16:55:38",
                    "content": "    makercaesar:  I dont like the idea that we are dumping on the MKR holders to buy other Tokens than MKR I interpret that the protocol has a low confidence in itself, I would rather see strategic partnership with other DeFi Blue Chips for approaching regulation or marketing (or other areas where we have a similar goal) which could be founded partly from the treasury.   What if we did OTC trade on the DAO level ie. exchange MKR for AAVE. This should align both parties together long term.     makercaesar:  So we would sell for a lower price fill up the SB and burn for probably for a higher price, the causality makes no sense to me, particularly when we are now net profit and self sustaining, we could fill up the SB with regular income.   TBH I am pretty sold on the idea of stopping the burn and replacing it with a better version of the Sagittarius engine. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.2648809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#15",
                    "likes": "1",
                    "time": "13/11/2021-17:20:17",
                    "content": "Lots of interesting things we can do DAO-to-DAO. Perhaps @Growth-Core-Unit can let us know where some of those opportunities are and maybe even with some DeFi 2.0 protocols  like Tokemak (tokemak.xyz). Disclosure: I’m a TOKE holder. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#16",
                    "likes": "2",
                    "time": "13/11/2021-18:15:27",
                    "content": "Relevant Signal Request. Please note these two signal requests are not mutually exclusive and Governance could elect to burn a portion of the Treasury MKR while still preserving some for use to fund expenses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#17",
                    "likes": "4",
                    "time": "13/11/2021-19:05:11",
                    "content": "A relevant piece written by Hasu and @monet-supply: A New Mental Model for Defi Treasuries. This is just a breakdown of some relevant snippets. The full article has all the meat and charts. Hasu argues that padding a DAO Treasury with a native token like MKR, UNI, and COMP is superficial and often disingenuous. While they may be financial resources, it’s stressed that counting them as assets on their balance sheets does more harm than good. While there’s no 1:1 comparison with any Tradfi vehicle, there are some primitive guidelines.  \" The float (all shares available for public trading) and restricted shares (employee shares that are currently vesting) together make up a company’s outstanding shares.\".   “These outstanding shares are a subset of authorized shares – a self-imposed soft cap on total issuance. Crucially, shares that have been authorized but not issued are not counted to the company’s balance sheet.”  The article then breaks down five treasuries (Maker, Lido, Aave, Compound, Sushiswap, and Uniswap) into three categories:  stablecoins blue chip crypto assets and other non-stable crypto assets  When viewed through this lens, Uniswap has ~0 assets in its treasury, and only Maker and Lido have a total greater than $50mil. The Black Thursday event is used as an example of the need to reevaluate the handling of DAO treasuries. The end result for Maker was $6 mil in credit losses, erasing three years - or $10mil - in accumulated earnings. The article argues that the losses could have been mitigated or avoided entirely if more of the treasury was composed of stable assets like Dai. The 500,000 MKR held in the treasury that day represented only a .35% capital buffer covering $140 mil in loans, whereas most traditional financial institutes maintain at least a 3-4% risk capital buffer. It then proposes six rules to better manage large Defi treasuries, but I think I’ve probably already bored everyone enough. The full article is definitely worth a read. @krzkaczor Accidentally direct replied rather than post to the Ether - but fully agree with your proposed options. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.778253767837102
                },
                {
                    "author_link": "https://forum.makerdao.com/u/myh",
                    "index": "#18",
                    "likes": "0",
                    "time": "13/11/2021-20:33:19",
                    "content": "hi everyone, Why are we not just take the 84k mkr and fund the expenses and the expansion of maker. Like it was mention half for the expenses half for the SB. and let the fees burn mkr. this way the mkr in the treasure and SB will worth more. The best outcome for it all. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.466666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/myh",
                    "index": "#19",
                    "likes": "0",
                    "time": "13/11/2021-20:36:54",
                    "content": "thats the best idea. 50% for SB and 50 % for expenses and development. best outcome where the team gets funding the SB gets more funds and the community get a burn. We could even redirect 20% of the collected fee to SB.  monthly and burn the 80% . this way when the core team funds run out they can tap the SB , which will also keep growing. We might as well also include MKR to the SB. since we have burn on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.166666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#20",
                    "likes": "1",
                    "time": "14/11/2021-10:25:29",
                    "content": " having MKR in treasury is imo useless (unless to avoid minting new ones to avoid legal/tax issues). This is the reason i am against a large/complete MKR treasury burn buying ‘blue chip crypto assets’ is a bad idea. For now, they are ‘worthless’, and we would speculate on the future of DeFi protocols. Too early. I would only have 3 things on the balance sheet at this point: eth,wbtc,dai.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.196969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sirverik",
                    "index": "#21",
                    "likes": "7",
                    "time": "14/11/2021-22:28:42",
                    "content": "This is more or less a gimmick.  Unless DAI is used to purchase MKR in the open market to burn, this does not deliver any value back to holders. Maker can mint tokens at any time, so burining tokens in the treausry is only symbolic. If we want to preserve maker’s reputation as having disciplined governance, then MKR in the treasury should not be burned but also should not be vested or spent unless absolutely neccesary. Simply put: Don’t touch it! Is playing around with the treasury really worth it just to manipulate the numbers displayed on coingecko? Sound to me like a very bad idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.101515151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#22",
                    "likes": "1",
                    "time": "15/11/2021-08:06:58",
                    "content": "84K MKR could fund so many projects and initiatives… In my view is better invested in creating software. But i’m not against burning a part of it. I also like the idea of increasing the surplus buffer to have more DAI ready in case something happens. (Pls note that i’m not totally informed about any of this) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mkrminer",
                    "index": "#23",
                    "likes": "2",
                    "time": "15/11/2021-16:51:36",
                    "content": "Money and tokens are fungible.  There is no reason to treat the treasury MKR as special.  Just burn it, and if any should be re-minted for employees, let that minting (aka inflation) stand out and be explicit. (Since the treasury MKR is not in circulation, spending it is inflation too.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#24",
                    "likes": "0",
                    "time": "16/12/2021-02:51:44",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}