{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - CSC (Curio Stablecoin) - October 18, 2021",
            "index": "10495",
            "option": "No (Defer)",
            "supporting_mkr": "28,617",
            "highest_fraction": 0.51
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/csc-mip6-application-curiodao-s-stablecoin-backed-by-tokenized-physical-real-world-assets/10495",
            "title": "[CSC] MIP6 Application: CurioDAO\\xe2\\x80\\x99s Stablecoin Backed by Tokenized Physical Real-World Assets ",
            "index": 10495,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-onboard",
                "mips",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#1",
                    "likes": "3",
                    "time": "24/09/2021-12:29:02",
                    "content": "This is a MIP6 Proposal for the addition of Curio Stablecoin (CSC) by the CurioDAO Association to Multi-Collateral DAI (MCD). CSC is backed by tokenized physical real-world assets, initially launching with hard assets such as collectible cars. This application reflects feedback and discussion following an initial collaboration with the Maker Foundation to include DAI across our ecosystem as a payment method to purchase and payout tokenized physical real-world assets. Integration phase One: Completed Please see a live demo video below for reference.      Figure 1: Schema of how Curio Stablecoin (CSC) is minted and maintained.  figure 11050×572 51 KB  Integration Phase Two: Inclusion in Multi Collateral DAI (MCD) Debt Ceiling: Initially 5 million DAI and increased to 25 million DAI once 75% of the debt ceiling is attained.** Requested Initial Stability Fee: 3% Integration Phase Three: Become part of the Peg Stabilization Module (PSM) in the near future term. 25 million DAI debt ceiling 0.10% – Fee in 0.00% – Fee out CurioDAO’s initial target is to secure a 5 million DAI facility from MakerDAO, a figure based on a suggestion by a MakerDAO team member. This is to accelerate real-world asset tokenization whilst offering specialized tokenized assets through physical real-world asset categories. The goal is to use the MakerDAO facility as a line of credit against CSC, which is backed by tokenized real-world assets (the collateral) from the collectible industry. It can be projected that strong demand for collectibles from our client base will allow for plans to add significantly more assets into the pool within the next six months. Therefore, we aim to start with a 5 million DAI debt ceiling and to increase it to 25 million DAI once 75% of the debt ceiling is attained.  Who is the interested party for this collateral application? CurioDAO Association, the asset originator, is represented by its co-founders Vladimir Kislinskii and Fernando Verboonen, crypto enthusiasts who have been spearheading the adoption of blockchain across real-world physical assets out of the EU and Switzerland since 2018. CurioDAO Association is a decentralized autonomous association, based in Switzerland, whose main purpose is to streamline the tokenization of physical real-world assets.  Provide a brief high-level overview of the project, with a focus on the applying collateral token TLTR: We propose a novel approach to bringing real-world assets into DeFi, one which also decreases risks. Diversifying MakerDAO collaterals could benefit it as it taps into liquid assets such as stablecoins . Physical real-world assets can be tokenized as Non-Fungible Tokens (NFTs) or fractional NFTs, depending on their total value. This MIP6 application proposes for MakerDAO to implement the use of CSC as collateral. This will result in further improving the diversification of collaterals via real-world physical assets. CurioDAO is also suggesting for the inclusion of the collateral in MCD. CurioDAO represents a cross-chain platform with a focus on the tokenization of physical real-world assets. Our system lets users use their asset-backed tokens as collateral, with our CurioInvest application enabling individual investors to access to single assets . CurioDAO’s stablecoin ensures reduced volatility and greater security for its users. CSC is a liquid token and an initiative to bring liquidity to real-world assets is outlined below. Curio (English) A rare and interesting object which invokes curiosity. Curio (Italian and Spanish) Curiosity. We will start with a summary of CurioDAO, the asset originator. We then provide information on the CurioDAO protocol, the technology on which the CurioInvest and RollApp applications have been built and which determines how they interact with Maker. We conclude with a brief introduction to collectibles as an asset class. CurioDAO is a community-driven investing platform that empowers individuals and asset managers to raise and invest in real-world asset NFTs. Initially, we have focused on limited edition supercars. However, our mission is to make every real-world asset tradable. Compared to a traditional crowdfunding platform, we are unique in how our community-driven infrastructure scales the curation of real-world assets as well as liquidity. CurioDAO is a pioneer and tech leader in tokenized alternative investments. Thanks to a grant by NEAR, an integration with Chainlink, and collaboration with MakerDAO, we are also now streamlining fractionalized NFTs backed by real-world assets out of Switzerland’s Crypto Valley. We believe CurioDAO’s suite of applications is the most efficient way to gain exposure to next-generation real-world asset tokenization in the blockchain industry. We were the first to use blockchain offerings to democratize investments in one-of-a-kind assets for as low as 1 USD per token, allowing anyone to own a piece of some of the rarest and unique collectibles such as a Ferrari F12tdf. With five categories now available on RollApp and CurioInvest, and with most of these added in the last quarter alone, the platform has only scratched the surface of alternative assets historically limited to the wealthy. We envision a more open, free, and fair society thanks to the tokenization of real-world assets and believe including CSC within the MakerDAO collateral can directly help us accelerate our effort to tokenize every real-world asset. Our solution proposes a novel approach towards bringing real-world assets into Decentralized Finance (DeFi) whilst decreasing risks to MakerDAO. We are of the opinion that MakerDAO could benefit significantly from diversifying the collaterals it accepts while tapping into a liquid asset such as our stablecoin . Hence, CurioDAO proposes that MakerDAO implement CSC as collateral and thus further improve its diversification of collaterals via real-world physical assets. Thanks to CurioDAO’s cross-chain platform and regulatory stack, physical real-world assets can be tokenized both as  NFTs and fractional NFTs.  Such asset-backed tokens, representing hard assets, show an order of magnitude less volatility than digital assets because their price has historically remained stable. Unlike existing collateral type assets within MakerDAO, the collateral CurioDAO is proposing for inclusion in MCD is pegged to USD and backed by tokenized real-world assets. These assets are screened via an industry expert group together with our community. Through CurioDAO’s platform, real-world assets are also fractionalized under the latest regulatory setup out of Liechtenstein and Switzerland, something which could further decrease the risks linked to MakerDAO regarding such fractionalized tokens when considered as securities. In line with this, CurioDAO will be using MCD directly as a line of credit to streamline the tokenization of real-world physical assets by 1) purchasing some of these assets and 2) adding liquidity pairs to enable its distribution via CurioDAO’s Automated Marker Maker (AMM), a trading venue that facilitates the swapping of a token for another automatically by way of a smart contract. The result: Such collaboration will allow CurioDAO to leverage a leading liquidity protocol and drive additional liquidity to the CurioDAO ecosystem. Assets on CapitalDEX will enjoy a greater price discovery with the inclusion of such pairs. DeFi users will be able to conveniently acquire and trade private and exotic assets with DAI through the collaboration between CurioDAO and MakerDAO. We believe that the initial credit line together with its stability fee rates could support CurioInvest, our fractional tokenization module. In the future, this could also be expanded to include RollApp, our Physical Real-World Asset Non-Fungible Token (p-RWA -NFT) platform, to accelerate the adoption of assets. This approach, in turn, will decrease marketing costs as well as the time associated with crowdfunding individual assets. About tokenized real-world assets In this section, we look at the tokenizing of real-world assets, which creates tokens that are similar to traditional stock market stocks, and the opportunities, this opens up. Tokenization itself is a way to convert your ownership rights of a particular asset into a digital blockchain-based token. It is now possible to buy a real-world asset and split it up into digital shares which can be acquired from almost anywhere worldwide. Tokenizing assets can open up investment opportunities to larger pools of people than ever before. Such tokenization is also emerging as a novel way for investors to diversify their financial assets. According to experts, 10% of global GDP will be tokenized by 2027. They expect the market to go from 4 to over 24 trillion USD in only 5 years, growing roughly 40%. The chart below shows equity, investment funds, and bonds making up a large chunk of the market. However, we also see a new class emerging called “other tokenizable assets.” This includes collectibles such as rare cars, fine watches, and fine art. Figure 2: Projected tokenized market volume until 2027. Source: The era of tokenization — market outlook on a $24trn business opportunity | by Finoa | Finoa’s Perspectives | Medium  figure 21015×641 209 KB  But why would people tokenize investments or collectibles? Tokenization makes trading and exchange more efficient by bringing liquidity to your assets. That is precisely why the Nasdaq and many banks are now exploring and investing in crypto projects to make investment a whole lot easier – especially when it comes to rare collectibles, or nonfungible assets. The frustrations for potential investors in collectibles start with how to find them, how to value them, where to store them, and, typically, how to invest in them in a standardized manner that scales. When a trading opportunity has many more upsides than downsides , it is a very asymmetric trade. As a result, it can attract many enthusiasts, potentially millions, despite the complex trading involved. CurioInvest changes the existing situation by creating compliant asset-backed tokens, similar to shares, and by doing the necessary work for handling the real-world assets. This has the potential to form a massively disruptive market and the upsides are much greater than the downsides. The other attribute that makes CurioInvest’s application for this market is extraordinary is that it is entirely digital. Users can pick a specific asset and invest via their mobile devices in a straightforward manner and without complicated paperwork. Whether the asset is a Lancia or a rare watch, you simply invest in a token backed by the real-world asset. By selling asset tokens to investors on the platform, we crowdfund the purchase price of the asset. We also gain an insight into whether the asset has a community and if it is of interest to them. By purchasing asset tokens, you gain the right to share in the profits from the resale of the corresponding item. In addition, you can diversify your portfolio by purchasing tokens in multiple cars, wine, and watches. In this way, you can invest in a diversified portfolio, backed by tangible real-world assets. This means that smaller investors can now benefit from a market that was previously only accessible to very few. In our pioneering work, we are supported by the expertise of leaders in wealth management and the collectible car industry as well as blockchain regulatory technology. For instance, our industry experts include the CEO of one Germany’s most renowned private luxury car garages , an executive director at a fast-growing neobank, and legal advisors known for making the impossible possible when it comes to blockchain regulation. We are also working with several other partners on the operational side and on regulatory legal and compliance matters. CurioInvest is looking into enabling exposure to all facets of the emerging tokenized real-world assets market and access to crypto-financial service offerings powered by tokenized real-world assets. Everyone can now create an online video and stream it to millions globally. Soon, many assets which were not accessible will suddenly become tradable and accessible by everyone. The advantages or working with CurioInvest’s derive from five key areas: 1) its unique deal flow, including several rare assets from Switzerland; 2) its platform, which has access to over 16 best-in-class partners, which enables the provision of end-to-end investing; 3) the first framework for tokenized real-world assets resulting from new blockchain law; 4) its access to tech talent from leading universities; and 5) an innovative fee structure that come from royalties from the secondary market rather than traditional standards, such as setting a fee for assets under management. Once a digital token with a unique identification number is created for an asset, the owner of this token can hold the digital key in any crypto wallet that they choose or place this with a custodian. The owner can also transfer the token to other users, for a specific period, or sell tokens in a peer-to-peer fashion using exchanges. These tokens can then be used as collateral or even allocated in investment funds, as when the car is tokenized, it is stored in a safe bonded warehouse and does not need to be moved. We believe the tokenization of real-world assets could potentially create a whole new asset class for investors all over the world. Imagine creating indices for, say, Ferraris or even Picassos. According to Nasdaq, tokenization makes investing in real-world assets much easier. Our growing community of investors shares this opinion. Since its launch, CurioInvest has been able to leverage the related positive, strong, and organic marketing, worth several million, because of the extent of the excitement among the public about the collectible assets we bring to the platform. According to UBS, high-net-worth individuals already invest in collectibles twice as much as they do in startups. This is understandable as collectibles are a passion asset and are more exciting. Our focus on the collectibles market should allow us to gain rapid market adoption. We saw this firsthand when we tokenized a Ferrari F12tdf, receiving interest from around the globe. And we believe the time is now. In fact, Bloomberg recently asked investment experts where they personally would place 100,000 USD. Most recommended alternatives such as art and collectibles. The good news is that we are ready to scale. We have access to hundreds of rare assets in our pipeline. We also have the partnerships required to transport, store, insure, and distribute both real-world assets and the tokens that represent them. CurioInvest is also institutional-grade ready. We have developed our tech closely with a stock exchange to make this a compelling offering. For this to be fully compliant, we file the tokens with Liechtenstein’s Financial Market Authority (FMA). We also run anti-money laundering (AML) policies and we work with fully regulated custody providers, so investors do not have to take care of their tokens themselves. Moreover, a key feature of our structuring is that our real-world asset tokens are bankruptcy protected via a Special Purpose Vehicle (SPV) in Liechtenstein. Once a real-world asset is tokenized, we can provide additional services. Imagine lending or even creating indices. In fact, we see these services as an additional benefit. Once tokens are stored within our ecosystem, we have access to financial data that enables us to provide a fair loan to value ratio in a matter of a few clicks. This feature alone is becoming a very powerful way for us to onboard asset managers who have plenty of clients who may want to tokenize their assets to get better valuation and liquidity. We are wrapping up an extremely strong summer. We also received grants, including one from NEAR, which is a leading blockchain protocol backed by Andreessen Horowitz. The upside potential is clear. European stock exchanges are very interested in the blockchain industry, and we are in discussion with some of them. Further, the demand in emerging markets for blockchain seems to be peaking. For example, many in Asia, Africa, and Latin America dream of Ferraris and Rolexes. As a consequence, we feel CurioInvest may well help crypto overall become more mainstream. With tokenization, the trade of real-world assets, especially collectibles, may ultimately rise because a greater number of people will have access to them. In turn, the market value of such assets may rise by a significant percentage. Further, the investors who may want to add collectibles to their portfolios are not limited to cars or other collectible enthusiasts. If an individual does not want to invest in, say, a whole collectible car, tokenization will allow them to acquire a stake in a fraction of one along with others – making such investment more convenient than ever. How it works TLTR: If a user wants a loan, he/she can tokenize their car through the CurioInvest platform. This process allows the user to add their vehicle to CurioDAO’s ecosystem, allowing them to make their vehicle available on the real-world tokenized asset market and receive CSC. Comparable to MakerDAO, our system enables users to use their asset-backed tokens as collateral, thus generating CSC. Contrary to Centrifuge, CurioDAO’s applications CurioInvest and RollApp focus on physical real-world assets. Moreover, we take a vertical approach in which assets are tokenized via our own in-house tech under the Blockchain Act, a novel regulatory framework in Liechtenstein, and in Switzerland’s Crypto Valley. CurioInvest’s approach also enables individual investor access to single assets, which is an enhancement when compared to a managed fund approach. This creates a distinct positioning based on tokenization and blockchain, which we leverage well. CSC was created in an ecosystem whose purpose is to streamline the tokenization of physical real-world assets and enable its users to access further services to collect, swap, earn, or stake their collateral. Ultimately, our team plans to accelerate the tokenization of real-world physical assets as well as enable the CurioDAO community to make protocol decisions or govern the utility of the ecosystem. We are of the opinion that CurioDAO’s stablecoin is an ideal choice for diversification of the MakerDAO collateral portfolio, with the aim of reducing its volatility. Thanks to the historically stable price of real-world assets such as collectible cars, the value of CSC is likely to stay the same over time. Token scalability while offloading risk The quality of collateral is important, but so is the likely amount of collateral. A single McLaren F1 was recently auctioned for 20 million USD. Moreover, the top 100 collectors hold over 10 billion USD in assets. This means just 10 collectors could turn CSC into a coin with a 1 billion USD market cap. With an increasing number of categories joining the CurioDAO platform in the near future, CSC could rapidly scale into a multi-billion USD market cap. This diminishes any initial risks or obstacles such as costs to implement and maintain CSC as collateral. In other words, there is a reason beyond profits to accept CSC as a type of collateral . In the case of CSC, that reason is scalability and diversification as the collateral in the form of the stablecoin would be used to generate enough DAI to provide payment for risks and expenses incurred by Maker. For this reason, we believe that the MakerDAO vaults will gain more exposure from a diverse number of audiences, ones which are also more mainstream, ultimately leading it to be used more extensively while offloading much of the regulatory risk. This would enable MakerDAO to focus on making more DAI while the CurioDAO community focuses on selecting the right real-world assets. Token liquidity CSC is a liquid token on CapitalDEX and will possibly be on Uniswap. An effort to list on CEX will also be sought. As expected, there will be incentives for staking and farming CSC, and in general, it will appear like a “normal” DeFi asset. This makes an oracle function less of an issue as the crypto side of their approach is relatively standard. On the real-world side, the oracle mentioned here is a way to automate the valuation of real-world assets, a function that is important but very distinct from the Maker vault as the Chainlink oracle feeds data from various sources. In other real-world asset-based deals, our understanding from previous public comments made on the forum was that Maker evaluates, for example, the real estate underlying a loan portfolio as there is plenty of publicly available or third-party data to enable this. The CurioInvest and RollApp marketplace model offers an enhancement on this, as appraisals or assessments will happen regularly, which is not the case in normal mortgage underwriting. Regardless, the CurioInvest and Maker risk team would continuously model and monitor asset values, despite and in addition to any automation by CurioInvest. Each asset is addressed on its own merits, and its risk model steers clear of “black holes.” The following describes an example initiative to bring liquidity to real-world assets: Since mid-2021, CurioInvest has been leveraging Chainlink to aggregate multiple data feeds into a single trusted valuation, bringing price transparency to each rare or collectible asset available on our platform. The benefits are tangible as traders can invest in any of CurioInvest’s asset tokens and trade against a reliable benchmark. Having a reliable benchmark increases market liquidity and decreases slippage, all with the comfort of knowing that originality and provenance for such assets are being sourced by a pool of trusted independent sources. By combining a Chainlink-enabled benchmark with independent valuations across secondary sources, CurioInvest brings real-time access to the valuations of collectible cars. This was a world first, and a major step towards CurioInvest’s goal of bringing liquidity to non-bankable assets. Moreover, this integration supports our effort for greater decentralization of the CurioInvest platform. Future planned features include a distributed collateral pool of digital assets backed by collectibles, which may collateralize stablecoins and even DeFi products such as insurance protection. Such products would significantly rely on various Chainlink price feeds to maintain stability and full collateralization. Use case In this hypothetical scenario, a car collector in Europe is planning to tokenize his personal collection worth 10 million EUR based on third-party research analysis as well as significant data points gathered from secondary sources screened by CurioInvest. The collection is based in the DACH region of Germany, Austria, and Switzerland, and over the course of the subsequent months, the collector becomes willing to tokenize his assets. The car collector engages with RollApp, where he mints a p-RWA-NFT backed by a physical asset. By tokenizing a curated real-world asset, the collector can pledge such tokens within the CurioDAO vault and get a loan in the form of CSC. Hence, he can use digital deeds to collectible items such as a rare cars, fine artwork, watches, or rare sneakers. Those deeds can be used to earn yield within the burgeoning DeFi realm via CSC. Provided the collector wants to sell his asset, he can enable the sale of the NFT via an auction process. CurioInvest also can fractionalize his NFT, enabling users to invest in it in amounts starting from 1 USD via car tokens backed by the underlying asset. CurioDAO can then proceed by creating a liquidity pool across its AMM CapitalDEX so that the collector is able to gain additional liquidity by selling his tokens in the “primary market” or by simply swapping his tokens once the secondary market is available. Due to the nature of security tokens vs. utility tokens, such listing builds upon an innovative “wrapper token” which confers ownership to token holders subject to completing a KYC (Know Your Customer) .  Provide a brief history of the project. TLTR: CurioDAO, the asset originator, aims to help those working in the crypto space. It created a decentralized ecosystem and it is backed by a set of validators, nominators, and other key participants. It was built on open-source blockchain networks, handled by people who possess the Curio Governance Token (CGT). Since 2018, CurioInvest has become one of the first actors to use blockchain-based offerings to democratize investments for a low rate. CurioInvest has continued to grow its investor base since launching with collector cars. New types of assets have been introduced which accelerated the expansion of CurioDAO into new categories. The team is supported by an advisory board and has expertise in various fields. About CurioDAO Founded in 2018, CurioInvest and CurioDAO Association represent a cross-chain platform that focuses on the tokenization of real-world physical assets and the democratization of investments in them. We combine unique cross-chain solutions in a compliant manner which allows consumers to invest in tokenized cars or earn on DeFi token CGT and become a part of the Curio community. We also introduced the first AMM to make private real-world assets interchangeable in the DeFi space by fractionalizing them, wrapping them, and using a single easy-to-use interface and composable with other DeFi protocols powered by the second layer SKALE. CurioDAO envisions bringing liquidity to physical real-world assets starting with valuable and collectible assets — including vintage cars, wines, and jewelry, among other items — which continue to maintain or increase their value . Vintage cars, for instance, returned more than 330% in the 10 years through 2017 according to a report from Knight Frank. The cars, of which a 1.1 million USD Ferrari was among the first on the slate to be tokenized, are stored and maintained in a vault in Germany. To achieve its aims, CurioDAO created a decentralized ecosystem, backed by a strong community of validators, nominators, and other key participants which can streamline the tokenization of collectible physical real-world assets. The project was built on the Ethereum and Polkadot open-sourced blockchain networks. It is handled by people from all around the globe who are in possession of the CGT token, which users need to borrow and pay back loans. The governance token provides automatic recapitalization of the system using deficit and surplus auctions to keep CSC as stable as possible. Figure 3: Bloomberg coverage - Turning supercars into digital coins  figure 3748×780 66.5 KB  Since launching with collector cars in 2018, CurioInvest has continued to grow its investor base. As noted above, there are now five categories on CurioInvest (Fractionalized p-RWA-NFT Launchpad) and RollApp (p-RWA-NFT Marketplace). CurioInvest’s new facility is enabling CurioDAO to accelerate its expansion into new categories, including cash-flow producing assets like intellectual property, royalties, real estate, and more. This makes CurioInvest the most complete platform for investing in and trading alternative assets. Curio’s team has expertise in a wide array of fields, including data and technology. We are supported by an advisory board whose members include CEOs and finance and legal experts. Further, our growing ecosystem of top-tier partners and suppliers from the sectors such as sourcing (e.g., Mechatronik, RABAG), blockchain, finance, and banking (e.g., Crypto Valley, Bity, MERJ, AXA, Bank Frick ), and law (Niedermüller ) is enabling us to provide an end-to-end solution. Figure 4: World’s first tokenized collectible Ferrari F12tdf by CurioInvest  figure 4951×1099 96.5 KB   Link the whitepaper, Documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. Figure 5: CurioDAO structure  figure 51258×725 96.9 KB    Linktree    CurioDAO | Linktree The DeFi Hub of Real-World Assets NFTs      https://capitaldex.exchange/#/kusama-slot   drive.google.com    Learn Staking on Curio Parachain.pdf Google Drive file.        drive.google.com    Staking on Curio Parachain.pdf Google Drive file.      Technical documentation: We hosted a community call where we invited the Maker Community for a detailed walkthrough of the CurioInvest smart contracts, Recording:  Link any available audits of the project. Both procedural and smart contract focused audits. CurioInvest has conducted several audits of its technology stack, including its car tokens. CurioDAO has also conducted an audit on its CSC token system. Links to additional audits will be added promptly. CapitalDEX Fractional Asset-Backed Tokens GitHub: Curio · GitHub  Link to any active communities relating to your project.    Telegram    CurioInvest Community Forum Discuss, ask, share your opinion, no fudding, no spaming. \t\tCurioInvest Services and Token (CGT,CUR) are not available in the United States or other prohibited jurisdiction\t\tAnnouncement channel: https://t.me/curiocarQA      https://twitter.com/curio_invest  How is the applying collateral type currently used? TLTR: Investors who have car tokens can lock them in CurioDAO’s stablecoin application and can claim liquidity. The investors can do this by depositing their digital assets as collateral into the Creator Vault feature of the Curio Creator Protocol . CSC can be purchased through various other exchange markets alternatively. CSC can also be used in a similar way to other crypto coins. A user can generate new stablecoins by using security assets. Users who already have car tokens issued by CurioInvest can lock these tokens on CurioDAO’s stablecoin application. They can get the tokens liquidated by depositing their digital assets as collateral into the Creator Vault inside the Creator Protocol (CurioInvest), which is a smart contract. CSC is available in various exchange markets for purchase. CSC can be used in the same way as any other crypto coin. Investors can send it to others, pay for purchasing goods and services or make savings. All CSC stablecoins currently in circulation are guarded by surplus security, which has greater worth than the debt of the stablecoin. For transparency, every transaction using stablecoin is made public on the blockchain. If a user wants to generate new Curio Stablecoins, they can use security assets through the use of Creator Vault, which is a smart contract. After the deposit is made, the value of the security is decided with the use of Curio Chainlink Oracles. Depending on the information received about a given asset token, the stablecoin is issued by CurioDAO’s smart contract. If the collateral price falls below the liquidation price for a particular vault, it can be liquidated through an auction. The liquidation mechanism functions in the same way as MakerDAO’s Maker Protocol Auctions. The same is applicable to the Curio Creator Protocol, which works as follows: If the collateral (i.e., CT1 tokens) of a token holder decreases in value, the token holder needs to deposit further collateral on the protocol to maintain the position on CSC. If the token holder does not deposit the necessary additional collateral, the protocol executes an automated auction (Collateral Auction). The CT1 valuation and pricing are linked to decentralized oracles provided by Chainlink. As with MakerDAO, if the price of collateral drops to the point where a vault no longer sustains the required collateralization ratio, the system automatically liquidates the vault and sells off the collateral until the outstanding debt in the vault (and a liquidation penalty) is covered.  Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? TLTR: CurioDAO Association has incorporated one of the first Decentralized Autonomous Organizations in Switzerland. CurioInvest has incorporated an SPV in order to tokenize physical real-world items to finance its assets. The SPV is also a method to protect against bankruptcy. CurioInvest has incorporated Curio LLC, a Vaduz (Liechtenstein) limited liability company that is an SPV. This SPV has been set up to function under the Blockchain Act, formally known as the Token and Trusted Technology Service Provider Act (TVTG), to pioneer the tokenization of physical real-world items to finance CurioInvest’s assets. The SPV creates a bankruptcy shield to sell assets in the case of financial, operational, or legal bankruptcy via pledge agreements with third parties, i.e., trustees, to protect token holders.  CurioInvest Investments This section brings an introduction on frequently asked questions by asset token holders respectively asset coins, used as collateral for CSC. How does CurioInvest choose which fine assets to purchase? CurioInvest typically acquires “blue-chip” fine cars from major established garages, with acquisitions focused on assets representative of top brands that it is able to acquire at an attractive cost relative to value based on estimated appreciation rates and established track records. Our growth strategy is to purchase blue-chip cars that will naturally appreciate in value, identify undervalued cars with the potential to make significant gains, and enhance the value of select vehicles through restoration. The value of the cars in the collection can also benefit from our efforts regarding detailed and community-led research, manufacturer certification, maintenance, and promotion through AR/VR applications. What is the investment case? The fact that collectible cars have had a good run over the last decade, the increase in number and lower average age of high-net-worth individuals across the globe, the diminishing supply of classic cars, and the emerging classic car markets. Figure 6: Proprietary due diligence process and the CurioInvest asset How are CurioInvest investments structured more specifically? CurioInvest created a Liechtenstein LLC issuer which can file an offering for a bond with a performance-linked note with the local regulator (FMA) where the underlying value represents the real-world asset. We use proceeds from the offering to acquire a single asset and the title to the asset will be contributed to the SPV. The issuer is administered by CurioInvest pursuant to an administrative services agreement that provides that CurioInvest pays all ordinary and necessary fees, costs, and expenses in exchange for membership interests in the issuer. What happens when an asset is sold? Following a sale of the asset and the payment of all of such taxes and expenses, the SPV remaining net proceeds linked to the asset, if there are any, will be distributed to the then holders of record of our tokens in accordance with the priorities set forth in our operating agreement. How do users exit car token investments? Capital appreciation or depreciation is realized when users exit their investments. There are three principal ways to exit: 1. Investments can be offered for sale via peer-to-peer or exchanges. A user can do this at any point and chooses the sale price. The investment is listed as a resale opportunity for other investors. CurioInvest provides an estimated valuation of the investment (which is updated through an oracle fed by an algorithm. 2. Exit before five years If a buyer wants to buy the entire asset, CurioInvest may commence proceedings to sell the underlying asset if a bid exceeds the initial price by at least  125% during the first 2 years or 120% during the subsequent 3 years.  3. Exit after five years at market value On each fifth anniversary of the completion of the transaction on the platform, each investor in the asset has an opportunity to sell their holdings at fair market value. This process is outlined as follows: The asset is inspected and valued by an independent party with reference to factors such as recent transactions and the condition of the asset, adjusted for any potential liabilities that the issuance may have, such as costs or taxation. This is then divided by the number of shares the issuance has issued to create a per-token market value. Investors that would like to exit at this point will be aggregated into a block which will be relisted on the CurioInvest platform at the per-token market value for up to four weeks. This process is similar to the initial crowdfunding of a new listing. If this process is unsuccessful for whatever reason, CurioInvest will commence proceedings to sell the underlying asset. The asset will be advertised for sale on the open market at the valuation determined by the independent party. CurioInvest will administer this process and is obliged to act in the interests of investors to maximize financial return. On completion of a sale, all investors in that asset will be exited and net proceeds will be distributed to investors. Third party costs, such as legal fees, reduce the proceeds available for distribution to investors, but CurioInvest charges a fee only when there is investor profit and it does not make any profit margin on the third-party costs. How are running costs managed? An estimated yearly custody allowance of an estimated budget per asset is allocated on average for the five-year tenure. Any unexpected expense is compensated from the proceeds after the asset is sold to a third party to cover the entirety of custody third-party fees mentioned below.  Storage and technical management Asset insurance Allowance for possible issues Maintenance allowance Corporation tax   Where does exchange for the asset occur? The enabling of a credit line by MakerDAO, the transfer of funds to CurioDAO, and the pledging of CSC as collateral will occur simultaneously on the settlement date. Curio plans to communicate tokenized curated assets to MakerDAO on a monthly basis. Capital Flow  MKR mints new DAI and deposits it with CurioDAO Escrow CurioDAO Escrow is used to pre-finance and purchase physical rare world assets per instruction provided by CurioInvest and/or RollApp on a monthly basis. Up to 60 days is required for the asset to be fully onboarded via CurioInvest or RollApp. Optional: A monthly report with shortlisted assets by our community and industry expert team could be provided to MakerDAO for transparency when needed. CurioDAO Escrow sends DAI to the CurioInvest/RollApp asset originators. The asset originators lock assets in the CurioDAO vault to mint CSC. MakerDAO Escrow receives newly minted CSC. Simultaneously, CurioInvest/RollApp secures the purchase/loan with the asset originator and delivers documents to the CurioDAO vault (represented as NFTs).  How CSC is minted CSC can be minted via CurioInvest. In the future, CSC will also be minted via the RollApp application. Each application satisfies two specific purposes. CurioInvest focuses on fractionalized assets, targeting high-priced ticket items. RollApp enables a peer-to-peer RWA-NFT marketplace, targeting community-curated real-world assets. For the purpose of this application, only CurioInvest, with its focus on high-end collectibles, is relevant at this time. Via CurioInvest, the SPV enters into a subscription agreement with the investors who are receiving fractionalized asset-backed tokens, e.g., car tokens. The car tokens can be redeemed against the profits of the underlying collateral directly from the SPV by any car token holder once the asset is sold. As noted above, car tokens can be used as collateral by locking them in a CurioDAO vault to receive CSC. Car tokens can be redeemed upon the closing of the lending position, with the paying back of the stablecoins granted. In the future via RollApp, users or CurioDAO will be able to purchase various goods such as wines, shoes, and other consumer goods. These goods will not require special permission for their distribution and will be stored in a bonded warehouse. CurioDAO will create individual CurioDAO NFTs for each good. CurioDAO NFTs are unique, non-fungible, Ethereum based ERC-721 compliant tokens. Each token represents ownership rights to individual goods. Wrapping token module: CurioDAO subsequently does the wrapping for the created NFTs via a decentralized smart contract. CurioDAO will then list wrapped NFTs on its marketplace. CurioDAO NFTs can be purchased for CGT as the means of exchange on the marketplace. CurioDAO NFTs do not have the features of any financial instrument according to Swiss law, the provisions of MiFID II or European Union Directive 2015/2366, thus they cannot be qualified as such. CurioDAO NFTs are redeemable. Upon the token holder’s instruction and transfer of the CurioDAO NFT, he or she will obtain the corresponding physical goods. Costs related to the transfer of the token will be borne by the token recipient.  (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. Supportive Legal Note opinions 0.- CurioDAO Legal Wrapper  1.- Curio Stablecoin “CSC” Legal Note 2.- NFT Tokens Legal Terms 3.- Fractional Car token CT1 Legal Note (original in German) 4.- Wrapping Token Legal Note  (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. Yes. As one of the first compliant car tokens, the offering is registered under the Liechtenstein finance regulator, following the latest best practices proposed by the Blockchain Act.   fma-li.li    18-07-2019-curio-prospekt-signed-mw-rfv.pdf 810.07 KB       (Optional) List any possible oracle data sources for the proposed Collateral type. The determination of the correct price of a real-world asset behaves in a different way to pricing Ethereum native collateral tokens. For instance, to adequately price a rare car, several factors must be considered. To be able to perform a diligent risk analysis, CurioInvest directly integrates Chainlink oracles, which are fed via APIs by independent data providers who gather sources from historical valuations and inputs from industry experts. These streams can be audited and fed into oracles to be brought on chain. As CSC is generated, an overcollateralized position is formed, one backed by tokenized real-world assets. CurioInvest’s granular approach represents an unprecedented level of transparency as each car token represents each asset individually. This means each car token, e.g., CT1, is pegged to the value of a specific asset. CurioInvest is implementing a dashboard connected to smart contracts that can aggregate this data based on individual pricing in real time linked to the NFT price . MCD can use the pricing oracles that Chainlink provides to assess the collateral value of the CSC token. CurioInvest will be providing more material on the oracles in the coming weeks as we work with the oracle domain team.  (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. CurioDAO rebalancing algorithm The manner in which the CSC is utilized differs from how standard vaults are opened: CSC tokens are pegged to USD via an algorithm backed by asset tokens, and any little vacillations in the advance portfolio execution ought to be covered by the rebalancing given by CGT. This implies that under normal circumstances, the asset originator would not see a liquidation of their vault. In CSC were to be sold on a massive scale, the CurioDAO contracts authorize a rebalancing of the pool to take the stablecoin back to its necessary collateralization proportion and will not permit the provision of any new credits backed by car tokens . As the project matures, CurioInvest will seek to expand its capabilities to onboard companies that purchase distressed car token portfolios that can be onboarded as keepers for CurioDAO. If accomplished, the addition of such companies would be an ideal complement to CurioInvest’s current members.  Does your team have any suggestions on how auctions should be differently structured to handle this security collateral? Given that the CSC token is pegged to USD, the liquidation method shall be executed similar to any other digital asset. ",
                    "links": [
                        "https://linktr.ee/CurioDAO",
                        "https://linktr.ee/CurioDAO",
                        "https://linktr.ee/CurioDAO",
                        "https://rollapp.store/",
                        "http://curioinvest.com/",
                        "https://capitaldex.exchange/",
                        "https://medium.com/finoa-banking/market-outlook-on-tokenized-assets-a-usd24trn-opportunity-9bac0c4dfefb",
                        "https://youtu.be/I5K6Sh3AtJM",
                        "https://linktr.ee/CurioDAO",
                        "https://linktr.ee/CurioDAO",
                        "https://capitaldex.exchange/#/kusama-slot",
                        "https://drive.google.com/file/d/1CP9E8nZRnsqYhGIn-CoVI7LfIsVtV_ls/view",
                        "https://drive.google.com/file/d/1CP9E8nZRnsqYhGIn-CoVI7LfIsVtV_ls/view",
                        "https://drive.google.com/file/d/1KIi4g3nmm3-rkEwt4qJ5zPQsnYnq73dV/view",
                        "https://drive.google.com/file/d/1KIi4g3nmm3-rkEwt4qJ5zPQsnYnq73dV/view",
                        "https://drive.google.com/file/d/1n6aFR9BdozpCtFzpR-SIW-xdbKfjkUs0/view?usp=sharing",
                        "https://drive.google.com/file/d/1nYaO9Zz6IJS2JWDxKGyL6H1Y7x35Y1P_/view?usp=sharing",
                        "https://github.com/CurioTeam/",
                        "https://t.me/CurioInvestCommunity",
                        "https://t.me/CurioInvestCommunity",
                        "https://twitter.com/curio_invest",
                        "https://curioinvest.com/curio-stablecoin",
                        "https://drive.google.com/file/d/1OmRACQQOgDKpbEeLuHI3qOI_WMP6gkxW/view?usp=sharing",
                        "https://drive.google.com/file/d/1Bhnq-TGD0X9ePeShz5vg4T6A5Jf7wgIj/view?usp=sharing",
                        "https://drive.google.com/file/d/1qlfToyRf_Fgq-qbu243zOapIZVKONjpk/view?usp=sharing",
                        "https://drive.google.com/file/d/1UKWAT--1F7fH31wMsRbjjb1kocpvmKdB/view?usp=sharing",
                        "https://drive.google.com/file/d/1VD-dQDk9GOvUFhHsudSCeoOp34pL7deE/view?usp=sharing",
                        "https://drive.google.com/file/d/16-IsXXlms_3n41gOa_7XHbq4THdtu27x/view?usp=sharing",
                        "https://www.fma-li.li/files/wp/18-07-2019-curio-prospekt-signed-mw-rfv.pdf",
                        "https://www.fma-li.li/files/wp/18-07-2019-curio-prospekt-signed-mw-rfv.pdf",
                        "https://www.fma-li.li/files/wp/18-07-2019-curio-prospekt-signed-mw-rfv.pdf",
                        "https://forum.makerdao.com/t/security-tokens-refinancing-mip6-application-for-ofh-tokens/10605/38",
                        "https://forum.makerdao.com/t/real-world-asset-legal-structures-a-comparison/9877/18",
                        "https://forum.makerdao.com/t/ama-collateral-onboarding-csc-from-curioinvest/10977",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/28",
                        "https://forum.makerdao.com/t/maker-relay-ep-68/11182",
                        "https://forum.makerdao.com/t/maker-relay-ep-68-en-espanol/11250"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.530089238247133
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "24/09/2021-14:17:06",
                    "content": "    Fernando_Verboonen:  CSC is a liquid token on CapitalDEX and will possibly be on Uniswap.   Personally I would like to see more blockchain related collateral types that will make the World a better place–but if the Uniswap community deters away from allowing a CSC listing because of certain real-world events that are developing w/regulators, what is your plan B? Speaking of communities, can you please provide more details of your DAO members–do you maintain a Discourse, TG, Discord, etc., how large is your community?     Fernando_Verboonen:  RollApp   Not sure I understand the RollApp–is this a dApp based in NEAR protocol that allows collectors to mint an NFT? Is it similar to an IDO platform? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.808441558441558
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#3",
                    "likes": "2",
                    "time": "25/09/2021-15:36:46",
                    "content": "Please remember: The fastest route is not always the straight line  Though the CurioDAO community launched https://capitaldex.exchange/ which got scouted by SKALE, see link below, in addition to uniswap, we envision listing CSC also across CEXes as well as to enhance its utility across our applications such as rollapp. Together across our venue, we have over 2.5k onboarded accounts as of September, about 20k enthusiasts across our social media. https://skale.network/blog/applications-go-live-on-the-skale-network-highlighted-by-6-strategic-use-cases-which-will-bring-millions-of-users-to-the-skale-network. Everyone interesting in joining the CurioDAO please be so kind to come in here, Telegram: Contact @CurioInvestCommunity We have to be able to think outside the box to find the optimal solution. Millions of people may lose their job during this pandemic, but we believe they many may well want to tokenized some of their assets to get liquidity and perhaps earn some yield across our ecosystem. On rollapp, anyone can sign up, complete a user onboarding process, proceed to mint NFTs backed by real world assets, and set an auction process for them to be sold globally, or in the future, use them as collateral to get liquidity. RWA NFT + Yield = the beginning of mainstream adoption. Let’s do whatever we can to support each other. I genuinely believe we can make a difference together! so on behalf of the Curio team we would genuinely thankful if you could join the discussion, share your feedback, comment it as well as invite others. Many thanks ",
                    "links": [
                        "https://skale.network/blog/applications-go-live-on-the-skale-network-highlighted-by-6-strategic-use-cases-which-will-bring-millions-of-users-to-the-skale-network",
                        "https://t.me/CurioInvestCommunity"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#4",
                    "likes": "3",
                    "time": "21/10/2021-09:16:42",
                    "content": "Exciting AMA taking place this week - don’t miss it! but if you cannot join, we will be uploading the contact afterwards for your convenience:    [AMA] Collateral Onboarding CSC from CurioInvest Content Production   [curioinvest-2]  Join us on Zoom 2021-10-22T16:00:00Z (UTC) to learn about the Curio Stablecoin (CSC) currently being proposed as a new collateral type.  We will discuss the flow of tokens backing CSC and why it would be a helpful addition to MakerDAO’s collateral portfolio.  Attendees: Vladimir Kislinskii CTO and @Fernando_Verboonen CEO  Can’t make the call? No problem! Keep your eyes out for the recordings and transcripts on the following channels:   Youtube Podcast Transcripts  Leave your qu…     ",
                    "links": [
                        "https://us02web.zoom.us/j/82408435282",
                        "https://forum.makerdao.com/t/csc-mip6-application-curiodao-s-stablecoin-backed-by-tokenized-physical-real-world-assets/10495",
                        "https://www.youtube.com/c/MakerDAO",
                        "https://anchor.fm/voicesofmkr/",
                        "https://content.makerdao.network/398200729b034baaafffd9ca750c9ddb?v=90742d7d58424293885eaae34750afa3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.795454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#5",
                    "likes": "2",
                    "time": "25/10/2021-10:42:41",
                    "content": "This week the CurioDAO team conducted an AMA with the MakerDAO foundation to provide additional insights into the mechanism proposed for both DAOs to collaborate on a single mission: to streamline the adoption of real-world assets into DeFi.  picture2675×1557 214 KB       ",
                    "links": [
                        "https://forum.makerdao.com/t/how-delegates-vote-scientific-governance/11146/8"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#6",
                    "likes": "3",
                    "time": "27/10/2021-16:19:20",
                    "content": "2021 Oct 27 Update: We received confirmation from a Swiss bank willing to support Curio in regards to DAI <> Fiat as an official Exchange Agent partner. This means they could help us facilitate converting DAI to other currencies needed when we have to purchase an asset across the world with various FX currencies. Best regards, ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.40625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#7",
                    "likes": "1",
                    "time": "30/10/2021-11:33:03",
                    "content": "2021 Oct 29 Update: Curio onboards Grant Thornton AG and Audit team, Swiss /Liechtenstein, to supervise the User /  Process Onboarding for real-world assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Harlock",
                    "index": "#8",
                    "likes": "1",
                    "time": "25/04/2022-06:18:44",
                    "content": "What is the latest development in this matter? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#9",
                    "likes": "0",
                    "time": "25/04/2022-10:09:00",
                    "content": "Dear @flipflopflapdelegate, Adding to my previous answer, please find enclosed the following complementary information: Since our last discussion, the CurioDAO community has developed its own peer-to-peer DEX AMM, with backing from SKALE Labs, NODE foundation and others. More about it here CapitalDEX.exchange. Additionally, at the moment OTC discussions are taking place to enable real-world players such as asset originators and dealers to accept directly CSC. Last, an increasingly infrastructure for STO listings may well supplement listing venues. Such is the example for the listing of the Ferrari token as shown here: https://twitter.com/IxSwap/status/1518357966990282753?s=20&t=DWhTQ-CxkhGmKXRBajaX-w 2.- Here you find a link to our community: Telegram: Contact @CurioInvestCommunity 3.- Here is how RollApp and CurioDAO work together. Rollapp is a multichain dapp, with grants by NEAR, SKALE, Aurora and Harmony. Similar to a NFT marketplace, it provides a venue for users to mint NFTs. Contrary to others, it leverages a Swiss / Liechntestein reg framework to mint NFTs backed on real world assets instead. Here is “how it works”   User consigns physical asset by submitting asset data to Rollapp platform. Once approved:   User submits real assets to Rollapp vault partners i.e. Freeports located within Europe.   Or user conducts proof of existence via Kleros protocol.   In both cases, the physical asset is insured   1. [Guaranteed by Insurance * up to 95% of the value covered by insurance]    User mints NFT under Swiss Law available for sale at Rollapp or any other venues i.e. Open Sea.   Provided user is seeking a loan, user fractionalizes NFT via CurioInvest STO framework i.e. CT2 CT3, CTn under Liechtenstein law.   Once fractionalized, User request a loan in the form of Curio Stablecoin by locking CTn into Curio DeFi vault via Curio Stablecoin Module becoming eligible for collateralization.   Curio’s oracle partners fix valuation available based on market data from various input sources   User accepts valuation and defines loan to ration.   Once user locked the NFT in the CurioDAO Stable coin protocol, user may obtain up to 60% of oracle suggested value in Curio Stable coins   User may now leverage his/her stablecoin allocation within CapitalDEX.exchange to earn passive income via liquidity mining and via farming LP tokens.   Note: A additional insurance covers smart contract risks for both stablecoin and AMM DEX services. ",
                    "links": [
                        "https://t.me/CurioInvestCommunity",
                        "https://rollapp.store/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.646221532091097
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#10",
                    "likes": "0",
                    "time": "25/04/2022-18:30:25",
                    "content": "Dear @Harlock, GM MakerDAO community, many thanks for checking in. Ever since the MarkerDAO response, our team has been working around the clock to meet both MakerDAO requirements as well as asset originators. Given the initial feedback from MarketDAO, our worked has focus across the following the main takeaway:   Increasing Curio stablecoin volume At the moment $25M worth in assets are lined up with the intention to increase them to $100M by end of 2022. These assets represent high-quality collectible rare cars as well other unique RWA that include unique provenance, inspection assessment and comply with CurioInvest / Rollapp requirements.   Increasing Curio stablecoin security As proposed by the asset originators, we are planning a tender to insure the smart contract risks related to a) stablecoin contracts and b) AMM DEX smart contracts. At the moment our team has approach, Nexus Mutual, Etherisc and Risk Harbor (saw Risk harbor had a collab with MakerDAO, any intros appreciated @flipflopflapdelegate @Harlock ), as well as “traditional insurances”. AXA already insures our RWA.   What next? We estimate to approach back the MakerDAO team by resubmitting the application provided we received the smart contract insurance offer in place and have increase the volume of the CSC to meet 8-digits. This we plan to do so by mid summer 2022. Until then, any intros deemed relevant particularly in the smart contract insurance would be appreciated. Best regards, Fernando ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.883095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/asgerd",
                    "index": "#11",
                    "likes": "0",
                    "time": "16/08/2022-09:52:49",
                    "content": "(post deleted by author) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/asgerd",
                    "index": "#12",
                    "likes": "0",
                    "time": "18/09/2022-16:54:38",
                    "content": "What an awesome project ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/asgerd",
                    "index": "#13",
                    "likes": "0",
                    "time": "20/09/2022-06:31:59",
                    "content": "Wen is liquidity and volume coming ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#14",
                    "likes": "0",
                    "time": "21/09/2022-18:45:13",
                    "content": "thanks for your warnings, this process was completely ignored, it looked bad from the beginning and did not have much solidity. MakerDAO have a sentiment to look for decentralized assets and maybe assets backed by “physical” things is not a very good idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6089743589743595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/asgerd",
                    "index": "#15",
                    "likes": "1",
                    "time": "24/09/2022-08:44:34",
                    "content": "Yeah CurioDao is hugely hugely huge project, only problem is liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#16",
                    "likes": "1",
                    "time": "28/09/2022-13:29:32",
                    "content": "While I respect the desire to share opinions on this project and do not wish to censor them, I think it’s prudent to close this thread out as the collateral has been deferred by the MKR voters. If new information or a new application comes to light I will consider unlocking this thread. Please DM me here on the forum if you have a request to do so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.121212121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#17",
                    "likes": "0",
                    "time": "28/09/2022-13:29:48",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "132"
}