{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - bIBTA (Backed Finance Short-Term Bond ETF) - July 18, 2022",
            "index": "16185",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "72,522",
            "highest_fraction": 0.78
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip-6-declaration-of-intent-invest-in-short-term-bonds-proposal-for-implementation/16185",
            "title": "MIP-6 Declaration of Intent \\xe2\\x80\\x93 Invest in short-term bonds \\xe2\\x80\\x93 Proposal for implementation ",
            "index": 16185,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "mips",
                "real-world-finance",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/backed-finance",
                    "index": "#1",
                    "likes": "33",
                    "time": "29/06/2022-13:05:10",
                    "content": "MIP-6 Declaration of Intent – Invest in short-term bonds – Proposal for implementation Submitted by: Backed Finance AG.  Sentence Summary MIP6 Collateral Onboarding application for tokenized short-term bonds in line with the requirements of MIP13c3-SP12  Paragraph Summary MIP6 Collateral Onboarding application for Swiss-law tokenized short-term bonds in line with the requirements of MIP13c3-SP12. Backed Finance will create on-chain, permissionless securities backed 1:1 with an underlying short-term bond ETF held at a secure custodian in Switzerland. Market participants will be able to sell tokens (tokenized ETFs) to MakerDAO for Dai up to a limit defined by Governance. A preliminary idea is to utilize a modified PSM implementation that incentivizes users to sell tokenized ETFs to MakerDAO in return for newly minted Dai, but the exact implementation is to be determined in the assessment phase. All trading will be liquid, passive and permissionless, requiring no active management and no KYC on the part of the protocol. MakerDAO should incentivize market participants by providing a small buying spread when it wants to increase exposure and a small selling spread when it wants to decrease exposure. Exposure could also be modulated through changes to the Debt Ceiling.  Context:  The MakerDAO Community recently approved the MIP13c3-SP12 proposal. In it, the DAO asked providers to put forward proposals towards designing and executing an asset allocation strategy to gain exposure to short-term bonds, taking into account the particular characteristics of the protocol.  Backed Finance AG (BF) is a Swiss company, which has developed a fully compliant solution for issuing tokenized versions of tradable securities, including short-term bond ETFs. This is implemented via its fully owned SPV, Backed Assets GmbH (BA). Switzerland has long been at the forefront of developing innovation-friendly regulations to foster the growth of an ecosystem with a strong and well-understood rule of law. Most recently, in July 2021, the Digital Ledger Technology Law (DLT) came into effect, allowing the existence and transfer of digital asset securities on permissionless venues. BF’s solution is based on the issuance of openly transferable tokenized structured products under Swiss law, fully-backed by the underlying bond ETFs in a dedicated collateralized account, that would allow MakerDAO to gain exposure to short-term bonds without having to off-ramp crypto to fiat or leverage any real-world structures. In our view, this should be Maker’s endpoint for asset-liability management: token markets in permissionless collateralized exposure to asset classes outside pure crypto. BA has filed for a Prospectus with the Liechtenstein FMA, for both professional and retail investors within the EU/CH. The prospectus was recently approved. The project has been in the works for approx. 18 months. The project, which is sponsored by reputable investors, is state-of-the-art for TradFi infrastructure and is based in a friendly jurisdiction.   bIBTA Collateral Application Template | Short-Term Bonds (bIBTA) Preliminary disclaimer The securities have not been and will not be registered under the U.S. Securities Act of 1933, as amended or with any securities regulatory authority of any State or other jurisdiction of the United States and (i) may not be offered, sold or delivered within the United States to, or for the account or benefit of U.S. Persons, and (ii) may be offered, sold or otherwise delivered at any time only to transferees that are Non-United States Persons (as defined by the U.S. Commodities Futures Trading Commission). The following information may not be distributed outside of jurisdictions where prospectus will be approved and/or passported, in particular not in the United States or any other restricted jurisdiction.The offering or sale of the securities in certain jurisdictions may be restricted by law including because of the underlying(s). For a description of certain restrictions on offers and sales of the securities and on the distribution of this refer to the product documentation.The information does not constitute, and may not be used in connection with, an offer or solicitation in any place where offers or solicitations are not permitted by law. If the laws or regulation of a jurisdiction require that an offering of securities described herein be made by a licensed bank, securities firm or insurance company or any of its affiliates, the offering shall be deemed to be made by such other party or such affiliate on behalf of the Issuer or holders of the applicable securities in such jurisdiction. Some of the information published contains forward-looking statements. Users are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, and that actual results may differ materially from those in the forward-looking statements as a result of various factors. Backed Assets GmbH undertakes no obligation to publicly update or revise any information or opinions published. Backed Assets GmbH reserves the right to amend the information at any time without prior notice. Past performance is not an indication or guarantee of future performance of a Backed product or underlying asset. The value of any investment may be subject to high fluctuations and, in some circumstances, investors may not recover the original amount invested. The information contained may not be considered as being a substitute for economic, legal, tax or other advice and users are cautioned to base investment decisions or other decisions solely on the content delivered herein. An investment decision with respect to Backed equities must only be made on the basis of the official documents published in accordance with applicable securities laws. Users should consult their investment advisers or other advisers prior to making any decisions.  Background Information  Who is the interested party for this collateral application?  Backed Finance AG, a Swiss company incorporated in Zug. We are responding to Maker’s MIP13c3-SP12 with the below MIP6 application.  Provide a brief high-level overview of the project, with a focus on the applying collateral token.  Backed Finance, via Backed Assets, will create and issue tokenized IBTA (short-term bond ETFs) securities on the ETH blockchain, with a view for the Maker protocol to allocate a portion of its assets to short-term bonds in a fully permissionless way. BA’s tokenized IBTA securities will represent 1 for 1 units of the underlying asset. They will be sold to market participants, which will pass full KYC and AML, and will have the ability to mint and redeem token securities for the underlying. These market participants could then deposit the IBTA tokens in a specialized Maker vault. Every time a token is either issued or redeemed, the corresponding security will be purchased or sold respectively preserving the fully backed by underlying status.  How long has the project been live in production?  The project has been in development since December 2020. The legal entities were incorporated in May and July 2021. The prospectus was approved on May 9th, 2022, and launch is planned in early July 2022.  Provide a brief history of the project.  In December of 2020, we developed the concept of bringing to market the equivalent of USDT/USDC for securities to allow the streamiling of traditional security assets and on-chain infrastructure. Some initial prerequisites were defined: (a) a freely transferable, ERC20 token (b) a product that would be fully backed by the underlying (c) a fully compliant product. The combination of these prerequisites complicated matters. Many jurisdictions were investigated, and were found to be incompatible. Eventually Swiss law seemed the most adequate, especially due to the 2021 DLT law, which defined ownership through distributed ledger technology as equivalent to that of other legacy forms of ownership such as bank entries. Upon obtaining a legal feasibility study that confirmed all aspects of the product’s properties, a company (Backed Finance AG) was incorporated in May 2021, and Seed round raised. Gnosis served as the anchor investor in the Seed round, among additional seed investors. Work on a prospectus started in July 2021, and a Swiss subsidiary (Backed Assets GmbH), to serve as the issuer (SPV) was also incorporated. In parallel, AML compliance was also required, so a Swiss SRO membership was applied for. By December 2021 the first version of the prospectus was filed. Accounts with financial service providers were also negotiated and opened. During Q1 of 2022, a pre-round A CLA was raised, and prospectus was brought to final versions. Final approval was obtained on May 9th, 2022.  Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  The proposed assets are fully compliant, approved financial products, thus all legal information is public, and can be found at: www.backedassets.fi The specific asset discussed in this proposal is: Name of token: Backed iShares $ Treasury Bond 1-3yr UCITS ETF (Accumulating) Contract Address (Ethereum) is: 0x9ABB4E7f4ee96cA58F156338640aEd031188E5E1 Product follows, and is fully backed by the following underlying:    BlackRock   iShares $ Treasury Bond 1-3yr UCITS ETF | IBTA The Fund seeks to track the performance of an index composed of US Dollar denominated government bonds issued by the US Treasury.      Underlying Ticker (LSE): IBTA  What type of asset is it? (e.g. store of value, currency, commodity, capital asset, governance token etc.)  The proposed asset is a fully-backed (1:1) structured product, sold in the form of an ERC20 token. The value driver of the structured product is identical to the value of the underlying assets, which is a short-term fixed income ETF, holding a series of 50 T-Notes issued by the US treasury. In essence, this is a “store of value” type of financial exposure, with the added benefit of interest being accumulated.  How is the asset used and does it give any rights to holders? (e.g. financial claims, dividends, governance rights)  The asset is ERC20, hence fully transferable. It also entitles holders the right to redeem it for cash via the issuer at any time (during market hours), provided that the redeeming party has cleared KYC procedures with the issuer. ERC-20 transfers do not require addresses to be KYCed. The product does not distribute dividends by definition, however the underlying was chosen so it is an accumulating ETF, so the value of the paid interest is automatically added to the value of the underlying, and reflected in its tradable price.  What is the market cap for the asset?  This is a new issuance, created with MakerDAO in mind but available to the broad public, so starting with 0 on-chain. The ETF market cap is over 9 Billion USD but the market cap for the underlying treasuries is much larger, over 1 Trillion USD.  Where does exchange for the asset occur?  Currently no circulation, so no exchange data available. The asset is ERC20 so it is freely tradable OTC, centralized and decentralized exchanges. 9.a Provide exchange data on market liquidity, volume and order book depth.  Is the asset settled on chain (trustless) or off chain (trusted)?  The asset in this proposal is ERC20, thus settled on-chain. The underlying, which drives the value is a tradable security, and is settled in regulated exchanges such as the LSE or SIX, and is thus trusted.  If offchain (trusted) settlement: describe what are the involved entities, process and estimated time.  The underlying, which is a conventional security and therefore based on a trusted system, is purchased using a Broker, and placed in a custody account by a regulated Custodian. Moreover, the custody account is supervised by an unrelated 3rd party (the “Security Agent”), which has the authority to block the account and dispose of the assets to pay token holders the value of their investment. The Custodian is: ISP Securities AG, Zurich, Switzerland (additional Custodians might be further included) The Security Agent is: Security Agent Services AG, Baarerstrasse 75, 6300 Zug, Switzerland (Security Agent may be replaced)  List any possible oracle data sources for the proposed collateral type.  The price of the underlying ETF on which the collateral token is based, appears in the following link:    londonstockexchange.com   Stock Search stock, chart, recent trades, company information, trading information, company news, fundamentals      In addition, given the fact that the underlying assets are trusted, and that a dependency on the legacy financial infrastructure is unavoidable, Backed Assets would be interested in maximizing the level of transparency of the “reserve”, namely the collateralized custody account. For that purpose, it suggests using a “proof of reserve” type oracle, for instance, and is willing to collaborate with the MakerDAO Oracles CU to develop the appropriate solution.  List any parties interested in taking part in liquidations for the proposed collateral type.  Given the ample liquidity of the underlying products, there will likely be many market participants interested in arbitraging for e.g. a liquidation event and increase (Issuance) and decrease (redemption) of units.  Business Questions  What is/are the expected use case(s) of the Dai generated by the vault?  The Dai generated by the vault should go to market participants depositing tokens into the vault at a slight spread. Following oracle price updates, the change in price or accumulation effect should mint new Dai directly into the surplus buffer. Drawdowns in price or value should remove Dai from the surplus buffer to cover for liquidations.  What is the amount of Dai expected to be generated against the collateral and what is the timeline? Is there a commitment on a minimum amount of Dai to be generated?  The debt ceiling should be calculated as a portion of Maker’s stablecoin holdings to allow volume to shift to the ETF token. Initially, we propose setting a 50m ceiling to test. Over time, assuming all the tests are successful, the debt ceiling could move to a substantial portion of total stablecoin holdings with a cap to be defined by the Maker ALM team, to allow for rapid liquidation in the event of a run on the protocol.  What are the strategic benefits for MakerDAO in onboarding the collateral?  MakerDAO has expressed its desire [link to growth post] to move to a fully on-chain investment strategy for its stablecoin assets. We believe Backed Finance is the first such solution that also offers the benefit of a solid regulatory framework, issued in a crypto-friendly jurisdiction.  Legal Questions  What are the legal risks associated with the tokens?  There are a series of listed risks in the prospectus. What we consider to be the primary risks are divided between the inherent risks of the value, and the risks associated with the form the products have been designed and brought to market. The inherent risks of T-bonds are the risk of default by the US government. This is considered an extremely low risk, and is, to an extent equivalent to the risk of the US dollar. The risks related to the form the product has been designed and brought to market are, essentially, the following:   Counterparty risk: the underlying is an ETF issued by Blackrock, a huge asset manager. In case Blackrock is not able to meet its obligations, the issuance and redemption of new ETF units might be halted, and liquidity become limited. Nevertheless, as the ETF physically holds the assets it follows (the T-bonds), the ETF unit holder will be mostly secured from default by the ETF issuer.   The Custodian - the ETF units are held by a licensed custodian. In case the custodian defaults, a legal procedure for releasing the assets would be required. Nevertheless, the assets under custody are legally separated from the balance sheet of the custodian, and would only be attributed to the account owner (Backed Assets) and its customers (the token holders)   The issuer of the token - Here again, the issuer as a legal entity might default due to unforeseen circumstances. Nevertheless, as the underlying assets are held in a collateralized account, the Security Agent would intervene and seize control over the account, paying the token holders their corresponding value.   Enforcement by regulators: the issuer has done every effort to ensure that the issued tokens are fully compliant. Nevertheless, some authorities, and especially the SEC, might decide to exert their jurisdiction over the products, despite the fact that these products are not marketed or offered to US persons. In addition, regulations in other territories might change, making the product non-compliant any longer. In such cases, the issuer would probably end the life of the product, notifying all token holders that they may redeem the tokens and be entitled to their corresponding funds. At the moment, our tokens do not have the ability to blacklist addresses though.   (Optional) Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?   The issuer of the token (BA) is the owner of the collateral account, and therefore fully responsible for it. The organization is incorporated in Switzerland (Zug), and operates under Swiss law. In addition, the security agent has full authority to ensure that the collateral (meaning the collateral on which the token is based, the ETF) reaches the token holders in case of default.  (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  The project did obtain legal opinions from several legal advisors. The principle one relates to the whole structuring of the products and their sale, and relates to the application of Swiss law to this structure. Also, some legal analysis with regard to EU regulations was obtained, further providing comfort that the products are fully compliant. Additional legal advice and memos were also obtained for additional jurisdictions. Unfortunately, these documents are not available to the public, and can be shared only with individuals committing to strict non-disclosure agreements.  (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.  The tokens are issued based on an approved European prospectus. The extensive documentation involved can be found at: www.backedassets.fi  Is issuance of the asset decentralized (trustless) or centralized (trusted)?  The issuance is managed by Backed Assets, and thus is controlled by the signatories of the token contract, which have been defined by the company, thus the issuance is centralized. 21.a. If centralized/trusted: by which legal entity, type of entity and jurisdiction? The legal entity is Backed Assets GmbH, a company incorporated in Zug (Switzerland).  Technical Questions  Link any available audits of the project. Both procedural and smart contract focused audits.    github.com    Omega-Audit-Report-May-2022.pdf       Has the token (and/or supporting protocol) been formally verified?  No. We did not go through formal verification but intend to do so in the near future.  Does the asset follow a token standard? (E.g. ERC20, ERC721, ERC1400)  Yes, ERC20  Is the asset, or asset balances, controlled by a central actor, or group of actors (e.g. through a multisig, or DAO)?  Minting of new tokens is controlled by a multisig (Gnosis safe), controlled by Backed Finance AG.  Does the token have whitelist or blacklist functions? If so, what is the process for utilization and what stakeholders are involved?  The tokens have no whitelists or blacklists. Direct issuance and redemption, as well as holding the associated ERC-20 token, is formally prohibited for US persons as well as other sanctioned jurisdictions. However, the ERC-20 token does not face any technical restrictions on transferability.  Can the token implementation be upgraded/changed? If so, what is the process and what stakeholders are involved?  Yes, the smart contract is upgradable, mostly for addressing unforeseen security issues, and for unforeseen regulatory requirements. The public prospectus denotes the considerations of such upgradability and possible future functions that might be added. Detailed information about this matter can be found in the Terms and Conditions, in the Security Note, section 4(II) of the public prospectus.  Does the token contain rebasing logic?  No ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084",
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084",
                        "https://backed.fi",
                        "https://www.backedassets.fi/",
                        "https://www.admin.ch/gov/en/start/documentation/media-releases/media-releases-federal-council.msg-id-84035.html",
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084",
                        "http://www.backedassets.fi",
                        "https://www.blackrock.com/ch/individual/en/products/287340/ishares-treasury-bond-1-3yr-ucits-etf",
                        "https://www.blackrock.com/ch/individual/en/products/287340/ishares-treasury-bond-1-3yr-ucits-etf",
                        "https://www.londonstockexchange.com/stock/IBTA/ishares/company-page",
                        "https://www.londonstockexchange.com/stock/IBTA/ishares/company-page",
                        "http://www.backedassets.fi",
                        "https://github.com/backed-fi/audits/blob/main/Omega-Audit-Report-May-2022.pdf",
                        "https://github.com/backed-fi/audits/blob/main/Omega-Audit-Report-May-2022.pdf",
                        "https://github.com/backed-fi/audits/blob/main/Omega-Audit-Report-May-2022.pdf",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/8",
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084/23",
                        "https://forum.makerdao.com/t/reseach-paper-the-crypto-banking-system/16862",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/89",
                        "https://forum.makerdao.com/t/governance-and-risk-199-thursday-july-14-at-17-00-utc/16575/2",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-18-de-julio-del-2022/16713",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-45-backed-finance/16420/2",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-9/16355",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-45-backed-finance/16420",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-9-traduccion/16383",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/26",
                        "https://forum.makerdao.com/t/thoughts-of-next-steps-for-alm-and-rwa/19899",
                        "https://forum.makerdao.com/t/weekly-mips-update-102/17511",
                        "https://forum.makerdao.com/t/weekly-mips-update-103/17674",
                        "https://forum.makerdao.com/t/mip55c3-sp6-legal-domain-work-on-greenlit-collateral-bibta-special-purpose-fund/17166/2",
                        "https://forum.makerdao.com/t/relay-semanal-02-08-de-agosto-del-2022/17223",
                        "https://forum.makerdao.com/t/blockchain-columbia-delegate-platform/15202/15",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/9",
                        "https://forum.makerdao.com/t/unblocking-the-stalled-short-term-bonds-revenues-generating-initiatives/17073",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-may-june-and-july-2022/17037",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/92",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7",
                        "https://forum.makerdao.com/t/makerdao-alm-forecast/16881/4",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/37",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/54"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.408599672685038
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "25",
                    "time": "29/06/2022-13:54:12",
                    "content": "This is game changing for DeFi. In a previous post I said:  Step 1: Off-chain ETF managed by a Foundation/Trust under the control of MakerDAO Step 2: On-chain tokenized ETF Step 3: On-chain tokenized ETF that we can use as collateral on repo-markets (Aave) to get liquidity if needed Step 4: On-chain tokenized ETF that we use for market-marking (UNniswap LP, additional revenues) and that can use as collateral on repo-markets to get liquidity if needed. Step 5: The US Gov issue bond in a permissionless tokenized form because the market is so efficient that it’s cheaper than tradfi. We are the primary dealer.  Monetalis MIP65 is pushing (almost done!) from step 0 to step 1. This is the start of step 2 to 4. The underlying ETF, IBTA is one of those that are currently being selected by MIP65. It is obiously the first of, I hope, many to allow MKR holder to allocate their balance sheet easily as they see fit. I really believe this is strategic for MakerDAO and DeFi. ",
                    "links": [
                        "https://www.ishares.com/uk/individual/en/products/287340/ishares-treasury-bond-1-3yr-ucits-etf",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.953703703703703
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#3",
                    "likes": "3",
                    "time": "29/06/2022-14:52:58",
                    "content": "A few questions that came up when a delegate and I were chatting privately about this:   Is there yield associated with the underlying? It seems like it just rolls proceeds.   If there is yield, how is that handled on-chain?   It looks like the portfolio is almost entirely 2 and 3 year treasuries. We should expect the NAV of this underlying to sink in a rate environment that is both rising and beginning from a very low level. This is consistent with what we have seen this year with the underlying ETF returning -3.7% over the last 12 months   Are there any fees associated with the rehypothecation such as transfer, issuance, or redemption fees? How does Backed Assets monetize this issuance?   Thanks for the proposal and I’m sure we’ll all have lots more questions! Very exciting. Hat tip to Paper Imperium for posing questions in an effort to inspire some critical thinking  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.735416666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#4",
                    "likes": "3",
                    "time": "29/06/2022-17:17:33",
                    "content": "This is game changer, hopefully we support it and are able to execute. Had one question: Would buying/selling of the tokenized ETFs schedule follow standard equity market trading hours? If so which schedule? Thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/backed-finance",
                    "index": "#5",
                    "likes": "2",
                    "time": "29/06/2022-17:34:19",
                    "content": "Hi @Ippy, thank you for your reply.   The underlying ETF (IBTA) is accumulating the profits from the T bonds. Namely it buys more bonds with the profits.   As there is no distribution of profits, there is nothing to handle on chain.   This is a good question on the choice of product. The choice was made according to what we thought MakerDAO is looking for. Which I think is good assuming that from the time Maker will get the products interest will stop going up. But it is important to mention that Backed can create any product, and we are a financial infrastructure, not a financial advisor.   Backed Assets is charging issuance and redemption fees. There are no transfer fees.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/backed-finance",
                    "index": "#6",
                    "likes": "2",
                    "time": "29/06/2022-17:37:26",
                    "content": "Hi @TRUEMAKER. Thank you for your kind words. Backed Assets can only issue and redeem during market hours. As it must always keep the 1-to-1 collateral. For each product that will probably be according to the most liquid market of the underlying. Here I guess it will be the London stock exchange. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SamForman",
                    "index": "#7",
                    "likes": "4",
                    "time": "29/06/2022-21:27:12",
                    "content": "Super cool proposal, I had a question about the point below.     backed-finance:  Enforcement by regulators: the issuer has done every effort to ensure that the issued tokens are fully compliant. Nevertheless, some authorities, and especially the SEC, might decide to exert their jurisdiction over the products, despite the fact that these products are not marketed or offered to US persons.   I was interested in building a similar project at one point and talked with four U.S. securities lawyers about pretty much this exact idea. They all took the view that tokenizing a security would definitively make the token a security, and that enabling it to be traded permissionlessly would likely result in enforcement actions from the SEC. Have you consulted with U.S. lawyers who have advised you on whether or not the token would be considered a security, and if so, the likelihood of enforcement? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.651515151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#8",
                    "likes": "4",
                    "time": "29/06/2022-22:34:03",
                    "content": "    SamForman:  They all took the view that tokenizing a security would definitively make the token a security, and that enabling it to be traded permissionlessly would likely result in enforcement actions from the SEC. Have you consulted with U.S. lawyers who have advised you on whether or not the token would be considered a security, and if so, the likelihood of enforcement?   I concur with this view (not legal advice). I’m definitely interested in the answer. Have not reviewed the proposal in detail yet, but from the DAO perspective what would regulatory enforcement look like from the SEC if it were determined that any ERC20 collateral is a security and MakerDAO is an unregistered broker-dealer or other? MakerDAO is not a legal person/entity, so who would they go after and why? I feel a responsibility to warm the community that people telling you we are decentralized (sprinkle magic dust) and not a financial institution (more magic pills) so ALL GOOD doesn’t tell you (person reading this) a single thing about your personal or firm risk relative to the influence/control you have in the operations and governance (*cough) of this DAO. Now would be a great time to rewatch this presentation or check it out for the first time ICYMI! Why is the topic of legal frameworks for DAOs a thing? I’m not advocating wrapping MakerDAO in a legal entity - not at all. But what I am saying is please be informed as to what issues each of us must understand for our particular situation and geography.      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.893804112554113
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#9",
                    "likes": "1",
                    "time": "30/06/2022-07:03:31",
                    "content": "It is worth mentioning that being ERC20 tokens, these can be traded in secondary markets 24/7. The limitation of capital market hours relates only to issuance and redemption versus the issuer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#10",
                    "likes": "1",
                    "time": "30/06/2022-07:48:39",
                    "content": "This sounds absolutely great! I have a legal-ish question, which is surely naive since I am not a lawyer:     backed-finance:  BA’s tokenized IBTA securities will represent 1 for 1 units of the underlying asset. They will be sold to market participants, which will pass full KYC and AML, and will have the ability to mint and redeem token securities for the underlying. These market participants could then deposit the IBTA tokens in a specialized Maker vault. Every time a token is either issued or redeemed, the corresponding security will be purchased or sold respectively preserving the fully backed by underlying status.   The path (back and forth) is: IBTA ETFs ← → Backed Finance ← →  tokenised ETF ← →  KYC/AML market participants ← →  Defi (including Maker) what worries me in this path is that it essentially circumvents the point of the KYC/AML step and allows random people to hold the IBTS ETFs. One could say that since the redemption must go through the KYC participants, this is acceptable. But effectively having MakerDAO emitting DAIs for these tokens, allows for (effectively) an on-chain redemption. In other words, MakerDAO is basically allowing to launder these ETFs. QUESTION: Can you pleas explain, at a high-level (again, I am not a lawyer) how this has a chance of being legal (not just in the US). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.829545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#11",
                    "likes": "1",
                    "time": "30/06/2022-08:39:35",
                    "content": "    Ippy:  It looks like the portfolio is almost entirely 2 and 3 year treasuries. We should expect the NAV of this underlying to sink in a rate environment that is both rising and beginning from a very low level. This is consistent with what we have seen this year with the underlying ETF returning -3.7% over the last 12 months   If we would to launch at scale today, I would probably prefer to start with IB01 (same thing but with a duration of 0.33 instead of 1.82). But the original declaration of intent is more on the 2-yr side (because it made sense when it was written) and we are not launching tomorrow which mean short-term yield can fall and make this product bad (meaning cost > expected return) when we we would launch. If we help to bootstrap a ultra-short term bonds/t-bill token (let’s say IB01), we should also understand that we would create a competitor of DAI at the same time and be ready to get an answer. PS: Btw, you can’t say that “the portfolio is almost entirely 2 and 3 year treasuries” when average maturity is 1.89. The existing raising yield curve is already priced in, I’m not smart enough to predict the unexpected fluctuations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.016281512605042
                },
                {
                    "author_link": "https://forum.makerdao.com/u/backed-finance",
                    "index": "#12",
                    "likes": "1",
                    "time": "30/06/2022-17:34:29",
                    "content": "Hi @SamForman, Backed Finance AG is a Swiss project, and the securities it intends to issue are MIFID financial products, authorized for sale in Switzerland and in the EU. US persons are prohibited from purchasing or redeeming the products. For that purpose the company has established countless measures to ensure it does not offer or sell these securities to US persons, and included such warnings in various ways. US advisors were indeed consulted during the process, and Backed believes the specifics of the chosen product design and regulatory path allow this product to be issued as described in its prospectus. Although these products are freely transferable, and after the primary sale, the company has no ability to control their circulation, the company expects all token holders to follow the rules and restrictions defined in the prospectus and also described in the contract code. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.928571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/backed-finance",
                    "index": "#13",
                    "likes": "2",
                    "time": "30/06/2022-17:35:53",
                    "content": "Hi @ACREinvest, When the company designed its method of operation and products it did all in its power not to bypass regulation but to work under existing regulation (when and where such regulation exists). This is why Switzerland was chosen as a base jurisdiction for the issuer and that’s also why tremendous time and resources were spent on filing an EU prospectus. Backed Finance AG and its subsidiary, Backed Assets GmbH,  will do everything in their power to avoid violating laws and regulations anywhere. If it comes to a point where regulation changes or where  enforcement obligates the project to stop operations, it will terminate the products, namely “call” all tokens and allow holders of tokens to redeem them in an orderly manner. Since the company always holds the underlying as collateral 1:1 there should never be an issue to conduct full redemption. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.783333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/backed-finance",
                    "index": "#14",
                    "likes": "2",
                    "time": "30/06/2022-17:37:57",
                    "content": "Hi @iammeeoh, AML and securities laws are two different sets of rules. As per AML, sale of a financial asset that is ERC20 by performing KYC and AML monitoring at the issuance and redemption points is identical to that of Tether and Circle. There is little significance to what the financial product being sold is. AML compliance is determined according to the platform that buys/sells the products and not the products itself. Since Backed Assets is a Swiss company, the issuer is regulated in Switzerland in that respect by being a member of an SRO organization. From a securities point of view, there are requirements for issuing, and additional requirements for offering. The issuer has registered in a competent EU authority, and the security has been fully described and disclosed. Therefore the issuance of these securities is allowed, and the fact the ownership takes place using a cryptographic token has little impact. The products are even defined at a relatively low risk category of “structured products”, which means that the product is fully backed by a collateralized underlying. As far as offering goes, these tokens are approved for sale in the EU and Switzerland. They will not be sold nor offered in any sanctioned country, and not in the US. The company has spent considerable efforts and resources in making sure it’s compliant with every aspect of the KYC/Issuance/Offering regulations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.329545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SamForman",
                    "index": "#15",
                    "likes": "1",
                    "time": "30/06/2022-18:00:14",
                    "content": "    backed-finance:  Although these products are freely transferable, and after the primary sale, the company has no ability to control their circulation, the company expects all token holders to follow the rules and restrictions defined in the prospectus and also described in the contract code.   I’m not a lawyer, but the lawyers I spoke to were pretty explicit in saying that the SEC would not tolerate freely transferable tokenized U.S. securities regardless of which jurisdiction they’re issued in. I guess the point that really matters is this one:     backed-finance:  If it comes to a point where regulation changes or where enforcement obligates the project to stop operations, it will terminate the products, namely “call” all tokens and allow holders of tokens to redeem them in an orderly manner. Since the company always holds the underlying as collateral 1:1 there should never be an issue to conduct full redemption.   If this is true (that enforcement will not impede redemptions), then I think the risk is much lower for the DAO. Is there some way to guarantee this will happen? Or in other words, is there a risk that regulators could prevent the custodian (or yourselves) from allowing redemptions? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#16",
                    "likes": "2",
                    "time": "30/06/2022-19:45:08",
                    "content": "    SamForman:  I’m not a lawyer, but the lawyers I spoke to were pretty explicit in saying that the SEC would not tolerate freely transferable tokenized U.S. securities regardless of which jurisdiction they’re issued in. I guess the point that really matters is this one:   IIRC the ETF is issued in Ireland. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#17",
                    "likes": "1",
                    "time": "30/06/2022-20:25:14",
                    "content": "Thank you for the clarification. Will be interesting the see how trading activity develops during non-capital market hours but could also see it not being any material differences since the underlying securities are pretty stable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#18",
                    "likes": "2",
                    "time": "02/07/2022-13:32:30",
                    "content": " Screenshot_20220702-092732_Outlook1080×1112 187 KB  More broadly this was the point of my question.  Since there is a discrepancy in trading hours and trading activity, is there a mechanism that would attempt to control for close price alignmnent between onchain and offchain? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.40625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#19",
                    "likes": "1",
                    "time": "03/07/2022-11:26:36",
                    "content": "To be able to purchase and sell via the issuer, the investor needs to pass full KYC in accordance to Swiss and EU regulations. This entails identification of the UBO, and as DAOs usually have no such attribute, the DAO cannot be a customer of Backed, but rather incorporate the Backed products as collateral. Backed clients would issue and redeem based on purely economic incentives. Other than that limitation, in essence, the owners of tokens are entitled economically to the value collateralized in the securities account, so even if further operation is made to stop, the value, 1:1, is there and will be repaid. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#20",
                    "likes": "1",
                    "time": "03/07/2022-11:43:53",
                    "content": "The example of the GBTC/BTC arbitrage, intriguing as it might be (and indeed it is astonishing), results from the fact that they both trade independently, however the “crossover” is limited. A quote from morningstar : “Grayscale Bitcoin Trust and all other closed-end funds lack this flexibility. The only entity able to create and remove shares from the market is Grayscale. It does so through private placements and redemptions, which are only available to accredited investors on a periodic basis at the firm’s discretion. This process isn’t as seamless as ETFs’ creation/redemption mechanism and can lead to periods where there are too many/too few shares available to the market. When this occurs, the share price will trade at a discount/premium to the value that the share represents.” As the Backed products would be issued and redeemed almost continuously, there should be a much lower arbitrage between the NAV and the trading price, otherwise someone will intervene and take the profit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.601190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#21",
                    "likes": "0",
                    "time": "03/07/2022-12:12:01",
                    "content": "Yea but there is a push from the feds emphasizing cooperation with foreign jurisdictions. Not that this MIP would be implicated but things are going to change in time (imo). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#22",
                    "likes": "2",
                    "time": "03/07/2022-13:07:48",
                    "content": "    backed-finance:  Yes, the smart contract is upgradable, mostly for addressing unforeseen security issues, and for unforeseen regulatory requirements.   Great proposal - and really interesting (speaking and asking these questions in a personal capacity)  - don’t know whether I missed it but but was looking for the token contract git repo - referred to in the token audit (https;//github.com/backed-fi/backed-token-contract  - would you have the correct link as the code reviewed for the audit is not accessible. Also where can I see the sample tokens deployed on ethereum testnets - referred to in the audit (contract address)?. I would suggest that without access to the code referred to in the audit - the audit is of limited use and is incomplete. Also - would it be possible to get more information on the shareholders of backed finance as well as the management of these 2 companies - I note that the prospectus points out the potential for conflicts of interest between the various companies involved in the issuance of tokens? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.025162337662337
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#23",
                    "likes": "0",
                    "time": "03/07/2022-13:44:44",
                    "content": "Hi @dbkcan, Thanks for your input. Maybe I’ve missed something in your question, however the contract is already deployed in the mainnet, with address: 0x9ABB4E7f4ee96cA58F156338640aEd031188E5E1 (this address is mentioned in the proposal). There are no “dummy” tokens there, as this is the real deal, each token in that contract legally represents a financial asset. The code of that contract can thus be reviewed and compared to the audit. Does this answer your question? As per the ownership and management: Backed Assets is a fully owned subsidiary of Backed Finance, so not much to elaborate there. Backed Finance has 3 controlling shareholder, owning the majority of the company: Adam Levi, Yehonatan Goldman and me (Roberto Klein). The rest of the equity is owned by our seed investors, who’s privacy we should respect. As per management, please refer to the Backed.fi Website, it is all mentioned there. The potential conflict of interest you mention is derived from the fact that the parent company, Backed Finance, also provides tokenization services to the subsidiary, and gets paid for that. Therefore, how to price the service is a good question, and there exists a risk of conflict of interests. I think this is mostly a “transfer pricing” issue related to tax, and nothing to do with security and safeguarding of the assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#24",
                    "likes": "0",
                    "time": "03/07/2022-14:13:42",
                    "content": "Could you please provide a link to the contract code that was audited as referenced in the audit as indicated the link provided in the audit is either not accessible or the contract code has been removed - https://github.com/backed-fi/backed-token-contract - the deployed code doesn’t allow a comparison to the audit as it refers to specific commits - which are unavailable from the deployed code on mainnet. What is the reason that you have not made the deployed code repository publicly available - is it closed source? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.140625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/backed-finance",
                    "index": "#25",
                    "likes": "2",
                    "time": "03/07/2022-20:00:22",
                    "content": "Hi @dbkcan. Repo should be open now. The deployed code should be identical to the audit commit, up to comments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JasonS",
                    "index": "#26",
                    "likes": "0",
                    "time": "04/07/2022-22:06:50",
                    "content": "If I understand the structure correctly, this is the relation between the onchain tokens and the actual assets (securities): While the erc-20 token represents on-chain ownership of the token, the custodian is the actual owner of the underlying asset in the records of Switzerland’s central securities depository, and further the custodian holds the underlying asset in the name of either Backed Assets or the clients of Backed Assets on whose behalf these tokens are issued. In case there are any liquidation of Maker vaults having these assets, how will the custodian effect the transfer of ownership of the assets from the vault owner to the new erc-20 token holder? In case the Security Agent is required to dispose the asset, does the Security Agent act independently or on behalf of/or as a vendor of Backed Assets under any agreement, or on behalf of Maker DAO? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.113636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#27",
                    "likes": "2",
                    "time": "05/07/2022-10:38:02",
                    "content": "Hi @JasonS, Sorry for the long answer, it is for the purpose of clarity. The missing part in the flow you described is that the actual real owner of the securities is not the Custodian, but rather the Issuer, namely Backed Assets. The Custodian merely holds the securities that act as collateral in a securities account bearing the Issuer’s name. As long as the Issuer is operational, regardless of crypto market conditions, any fully KYCed client of Backed Assets (the Issuer) would be able to redeem tokens into cash/stablecoin without interacting with either the Custodian nor the Security Agent. As long as there is sufficient liquidity of the underlying asset in the principle trading venue of that underlying, such redemption could be executed even in very large volumes. Payouts for redemptions would be done directly by the Issuer. The Security Agent enters into play only if the Issuer, for some reason, stops serving its clients and keeping its commitments. In such case, the Security Agent assumes control over the securities account, sells the assets and distributes the cash to token holders. BTW, the erc-20 is not only an on-chain ownership. According to Swiss DLT law, this is also a real proof of ownership accepted by Swiss courts, so owners of a Backed token are legally entitled to the value derived from the financial instrument it represents. Now, as per vault liquidations: Please note that the proposal, as defined above, includes the following suggestion: “A preliminary idea is to utilize a modified PSM implementation that incentivizes users to sell tokenized ETFs to MakerDAO in return for newly minted Dai” How do you see vault liquidation becoming relevant in such scenario? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.232278138528138
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#28",
                    "likes": "2",
                    "time": "05/07/2022-10:49:45",
                    "content": "    Roberto:  “A preliminary idea is to utilize a modified PSM implementation that incentivizes users to sell tokenized ETFs to MakerDAO in return for newly minted Dai”   To build further on this - the thinking is that rather than having a vault where individual users can collateralize bIBTA in exchange for DAI, an open and permissionless PSM-style vault is used where traders can exchange their bIBTA for DAI. The chief difference will be the requirement to update the mark-to-market price through an oracle (perhaps once a day, depending on the cost/benefit). The change in value would be reflected in the surplus buffer as an accounting difference, rather than trigger a liquidation of a vault. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.170454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/litocoen",
                    "index": "#29",
                    "likes": "3",
                    "time": "06/07/2022-14:18:01",
                    "content": "love this proposal! this will be prime collateral for loans, nothing matches the liquidity of bonds/ETFs. especially with US-treasury yields going up, I can imagine the demand on-chain for these to become huge. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.708333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#30",
                    "likes": "2",
                    "time": "12/07/2022-14:52:08",
                    "content": "From a securities and legal perspective, based on my knowledge of Swiss law an sro which is the lowest level of self regulatory organization in Switzerland and,very easy to get as just an application,that what is being proposed will be viewed as neither legal nor regulatory compliant.who is representing Backed in Switzerland and can we see an opinion.based on my experience this is not on the edge but crosses the line of regulation completely.Maker needs to be careful with a 3 person group claiming they are regulatory forward in Switzerland.please share your law firm and legal opinions.thank you kindly ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9523809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#31",
                    "likes": "2",
                    "time": "12/07/2022-15:26:55",
                    "content": "Through my own volition I downloaded the  Securities Note Prospectus First Supplement  from the Backed Finance website to upload here for the broader community. ",
                    "links": [
                        "https://drive.google.com/file/d/14ssgNJBHuT9c4WwDr4nAPowj4ib-Q2gM/view?usp=sharing",
                        "https://drive.google.com/file/d/14uyYhbGySBfMDvc28jr7GNYgaQW4DADv/view?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#32",
                    "likes": "1",
                    "time": "12/07/2022-15:39:02",
                    "content": "Hi @LegalG , The public prospectus, that was approved by an EU competent authority, took almost 1 year to finalize, and was extremely non trivial. It is the first of its kind, and I am sure others will follow. This actually makes the token a MIFID financial instrument that are also freely transferable. As per our legal firm, we work in Switzerland with MLL, a Tier 1 Swiss law firm. We are, unfortunately, not able to share the legal opinion. That is one of the only documents that are really proprietary, and is basically intended to protect us by defining that what we do is completely legal. Having the public prospectus, I do not see much reason why this would be required by the token holders. As per SRO, it is the requirement to comply with KYC/AML regulation. It requires, BTW, regular audits making sure our AML is compliant. The SRO has nothing to do with issuance of financial products. For doing that, Backed Assets is not required to be regulated given it issues Structured Products, however it is regulated by the fact it filed a prospectus. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.676136363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#33",
                    "likes": "0",
                    "time": "12/07/2022-16:40:29",
                    "content": "I have spoken to Swiss colleagues and my initial assessment was confirmed.I will review further.since dealing with securities need to be clear.MLL who I am familiar with, would allow for disclosure re capabilities of backed within regulatory regime.your comment is not accurate but thankyou for response as clients often don’tshare legal opinion ifon the margins.I will continue my diligence but, based on my legal understanding and your response reMLL,I do not feel comfortable that Backed with securities as listed can conduct the business purported.I would encourage others with legal background to dive in here.if this is possible,great,but on the surface this could be a major blow to ecosystem if regulators get involved as this is not a tier1 license.i will continueto do my work but am verynervous about this and will vote NO emphatically (if i am wrong upon confirmatory diligence I will share) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.409722222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/abcb",
                    "index": "#34",
                    "likes": "1",
                    "time": "12/07/2022-17:27:15",
                    "content": "Hi @Roberto, Thanks for the context. Can you please elaborate on how you have addressed the obligations of BackedFinance to track the changes in ownership of the token and its transferability from a legal perspective? My understanding is that if this MIP passes, MakerDAO will onboard with BackedFinance, deposit X amount USD (DAI) and invest with this in a portfolio of fixed-income ETFs, that will later have a 1:1 representation on-chain as an ERC20 token. Then MakerDAO will have the ability to transfer these tokens out of BackedFinance’s platform to any address of their choice, potentially for example a market-maker to participate in AMMs or simply convert these into other assets. How would you in this case trace the ownership of the token? MakerDAO would still have a securities account with BackedFinance holding the underlying ETFs and hence would be taxed/reported on their holdings (for example, capital gains) while the instrument (token) is in reality held by another party? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.553571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#35",
                    "likes": "2",
                    "time": "12/07/2022-17:28:06",
                    "content": "    abcb:  MakerDAO will onboard with BackedFinance   Maker will not be onboarding with Backed Finance if this MIP passes. Maker would be opening a permissionless vault for the ERC-20 tokens bIBTA. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#36",
                    "likes": "0",
                    "time": "12/07/2022-19:18:23",
                    "content": "Hi Again, In what respect did you find the answer not accurate? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.9999999999999996
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#37",
                    "likes": "3",
                    "time": "12/07/2022-19:28:15",
                    "content": "Hi @abcb , Backed does not keep track on changes is ownership, very much as Circle does not keep track on changes of ownership of USDC. Backed is limited as to who it can sell to (only professional investors) and redeem from (most investors except those from non-serviced countries). The reason this can be so, is that the type of financial product Backed issues is a “Structured Product”, which, in essence, is a debt security, and therefore freely transferable, and requires no tracking of ownership. The proof of ownership is embedded in the control of the token by the private key, which is inline with Swiss DLT law. As correctly answered by @adcv , Backed does not onboard the DAO as a client, as only entities with a defined UBO can legally become clients. The professional clients that will onboard Backed will choose if and when to interact with the DAO based on the financial incentives the DAO will incorporate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.572527472527472
                },
                {
                    "author_link": "https://forum.makerdao.com/u/abcb",
                    "index": "#38",
                    "likes": "2",
                    "time": "12/07/2022-19:59:44",
                    "content": "Thanks for the feedback @adcv @Roberto. I really like the model but in this case, I find of special importance to brainstorm and include as part of the proposal a better definition or suggestion of the incentives for market participants to engage in the sale of these tokenized debt securities to MakerDAO. Fixed-income instruments despite having recovered, still show a rather limited yield (the iShares $ Treasury Bond 1-3yr UCITS ETF taken as reference product has a current Weighted Avg YTM of  3.10%) which discounting the cost of the custodian (ISP), issuer (BackedFinance), and incentives to be paid to sellers paid by MakerDAO might end up reducing significantly the final yield for the treasury. Do you have any view on the cost structure? Further to this, I am also concerned about the liquidity risk as there might be an scenario where MakerDAO might want/need to liquidate/rotate its exposure to this specific ETF but not find any buyer in the market hence would be forced to significantly increase the spread to incentivize market participants, which can end up draining the cumulated performance and yield. Compared to this, although a more centralized setup, I believe MIP65 would give MakerDAO direct access to traditional securities markets to buy/sell the exposure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.745238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#39",
                    "likes": "1",
                    "time": "12/07/2022-21:01:50",
                    "content": "Thanks for this @abcb. Incentive design for rate setting will be exclusively in Maker’s purview. This collateral application is just about opening a vault in the Maker system for bIBTA tokens. MIP65 is a good step in the right direction but we need to diversify our risk as much as we can from a jurisdiction and arranger point of view in order to avoid centralization risks of exclusively managing our balance sheet through MIP65. It also helps that the model from Maker’s point of view is permissionless and removes a layer of intermediation. Concerning liquidation risk - both MIP65 and bIBTA face the same subset of liquidity available to the total UST universe as they are an ETF rather than direct treasury exposure. In both instances, there is sufficient and deep liquidity to manage an investment rotation. I don’t believe there is any more or less liquidity risk from MIP65 moving off-chain assets to meet on-chain redemptions than there is slippage risk on-chain for a tokenized PSM allocation to instruments that are 1:1 redeemable by authorized participants. In both instances this risk is as yet still only theoretical. I encourage you not to think about MIP65 and this application in a zero-sum perspective. Should both do their job well and bring in much needed ROA to the Maker balance sheet, we may be able to consider opening up new strategies to serve Dai holders such as increasing the DSR and expanding the balance sheet further for even greater exposure. In that instance, MIP65 would face the possibility of managing an even greater allocation, as would any other onboarded arrangers. I would be surprised if token holders would allow one or two single arrangers to manage this exposure, which would net reduce the ROA we are able to generate for the system as a whole and keep the pie quite small. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.816478274811608
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#40",
                    "likes": "0",
                    "time": "12/07/2022-21:03:48",
                    "content": "Regarding confidentiality of MLL legal opinion or approach.This is Backed’s choice not MLL in my experience.I am sure MLL would provide comfort if requested with opinion that could be shared with Maker supporting the structure and proposal that Backed has provided.Also describing structured products as bearer instruments is a stretch and incorporating uniswap and the unknown of the issue of USparticipants is concerning. Lastly are you guaranteeing UNISWAP will make/have a market?Cant there be arbitrage opportunities if the price diverges from their oracle?I think this is really interesting but don’t think this is thought through for a mip and Wouldnt it be better to pull this mip and think through these unknowns? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#41",
                    "likes": "2",
                    "time": "12/07/2022-21:06:29",
                    "content": "Thanks @LegalG nobody can guarantee that there will be a market, however redeemability 1:1 is a very strong incentive for market participants to arb the difference and seed on-chain liquidity. As I mentioned to @abcb above, would encourage you not to think about the PSM as zero-sum where only one arranger can help Maker allocate its assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9541666666666675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#42",
                    "likes": "0",
                    "time": "13/07/2022-00:18:01",
                    "content": "Curious how you plan to manage this exposure how often and how will payments be made to say the surplus buffer? Or will the yield just increase our exposure to the underlying ETF ? Who will be responsible for creating any oracles required to manage the position? Also interested to know what on chain tech changes will be needed to manage our exposure or will every change to the investment strategy you have in mind require a governance vote … I know this hasn’t been greenlit yet but it would be good to know what you have in mind here and what effort may be expected of CUs to accommodate these changes. Asking this because todays presentation seemed to imply that backed just provides the tokenization/security agent service ( the USDC for equities) and Maker will be responsible for all other aspects of the integration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.732142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#43",
                    "likes": "2",
                    "time": "13/07/2022-05:31:54",
                    "content": "Thanks @dbkcan let me go through what I believe our ideal endpoint should be and then the shortcuts we will have to take on the way to get there:  Fully permissionless PSM vault with main change being the price oracle is not hardcoded DC setting modified parametrically based on the size of the USD PSM to produce an allocation key that can match DAI maturity also permissionlessly  tin and tout rates set also parametrically to modulate the inflows and outflows of bIBTA when required  The above vision requires 0 humans to function. To get there we may have to scaffold a few settings first but the infrastructure should allow us to, over time, automate the allocation.     dbkcan:  Curious how you plan to manage this exposure how often and how will payments be made to say the surplus buffer? Or will the yield just increase our exposure to the underlying ETF ?   We will manage maximum exposure through setting the DC. The surplus buffer will just reflect as an accounting difference between the change in value from NAV or price. This ETF is accumulating so the NAV should drift upwards over time. Losses in value would reflect as a deduction of course. It makes me really happy to be able to write that you could say we are yield farming this ETF.     dbkcan:  Who will be responsible for creating any oracles required to manage the position?   Our oracles team. I don’t expect or personally desire Maker to begin relying on external oracles for a number of reasons.     dbkcan:  Also interested to know what on chain tech changes will be needed to manage our exposure or will every change to the investment strategy you have in mind require a governance vote   In practice will probably be executed by the MOMC as policy changes though open to other suggestions of course.     dbkcan:  I know this hasn’t been greenlit yet but it would be good to know what you have in mind here and what effort may be expected of CUs to accommodate these changes.   Same effort as every piece of domain team work on any ERC-20 submission I suppose.     dbkcan:  Asking this because todays presentation seemed to imply that backed just provides the tokenization/security agent service ( the USDC for equities) and Maker will be responsible for all other aspects of the integration.   I think that is exactly right yes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.864177489177489
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#44",
                    "likes": "1",
                    "time": "13/07/2022-06:38:51",
                    "content": "Hi @LegalG , Perhaps I got misunderstood about the legal opinion. It is not MLL who forbit us to share it. For the time being, we do not share it because it is the core advantage Backed has developed, and sharing it is not commercially sensible. In addition, it is not “The legal opinion”. there are multiple legal opinions and memos we have received, as they depend on geography. We have legal opinions and advice for Switzerland, the EU, advice for the US, and in process for a few more big markets. Never have I seen any issuer share a legal opinion before, as essentially the legal opinion says “If you do things this way, you are not committing a criminal offence”. Regarding price signaling and secondary markets: Obviously we have no ability to guarantee anything in UNISWAP or any other DEX, nor do we intend to control secondary market. That is the beauty of well aligned economic incentives. If you think of any better price setting mechanism, we are very open to hear, however this has been thought through very carefully, and we believe the best solution for market pricing is by allowing market participants to capture arbitrage if such appears. It is the most decentralized price setting mechanism, and the Backed team has made a huge efforts to streamline the products to be as permissionless as possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.545370370370371
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#45",
                    "likes": "1",
                    "time": "13/07/2022-07:12:28",
                    "content": "Hi @abcb , The interaction between MakerDAO and market participants is not controlled by Backed in any way. The proposed mechanism seems the most efficient one, suggested by individuals with profound knowledge of the MakerDAO, as it requires very little to 0 centralized control after implementation, however if you can think of a better mechanism, please feel free to bring any suggestion you think is relevant. As per the choice of asset and costs: Actually, custodian costs would apply no matter which method of holding the RWA is chosen. In our case, we do not charge that to the owners of tokens (No AUM commission), so the holders of tokens do not pay the custody fees. Please also bear in mind that MakerDAO will not be the only holder of these tokens. Billions of individuals around the world have no access to RWA with such properties as IBTA or others, and for such individuals, the ability to buy onchain such exposure is worth paying a positive arbitrage, whish is how our business model works, as Backed only charges issuance and redemption fees. Lastly, about liquidity - Backed will buy and sell IBTA units from the principal market makers of the IBTA product (as defined by the iShares legal documents), which basically mean these units will be created/destroyed by the market maker on the spot. Consequently, issuance and redemption of bIBTA (the token) will not depend on our ability to buy and sell the underlying in the capital market, but rather in the liquidity level of the bonds that construct the IBTA ETF itself. Being US treasuries, these are the most liquid bond markets in the world. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.70954335016835
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#46",
                    "likes": "1",
                    "time": "13/07/2022-09:31:18",
                    "content": "    adcv:  We will manage maximum exposure through setting the DC. The surplus buffer will just reflect as an accounting difference between the change in value from NAV or price. This ETF is accumulating so the NAV should drift upwards over time.   I believe @dbkcan was referring to the Vault SF  — how will the ilk call Jug.drip(ilk) for the bIBTA vault? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#47",
                    "likes": "2",
                    "time": "13/07/2022-10:34:42",
                    "content": "For the bIBTA PSM, I guess there will be a permissionless function updateGemValue() that will act kind like the Jug.drip() but based on the bIBTA oracle price. I’m no Solidity developer but it should be around that. The system always borrow/repay up to the collateral value.     function updateGemValue() external {         uint256 price = priceFeed.peek(); // Price of IBTA         uint256 gemValue = mul(price, gemAmount);          int256 deltaValue = int256(gemValue) - int256(lastGemValue);          if(deltaValue > 0) {             vat.frob(ilk, address(this), address(this), address(this), 0, deltaValue);             // If we made a mark-to-market profit it is send to the SB             vat.move(address(this), vow, deltaValue);         }         else if(deltaValue < 0) {             int256 loss = -deltaValue;             // If we made a mark-to-market loss it is taken from the SB             vat.suck(vow, address(this), loss);             vat.frob(ilk, address(this), address(this), address(this), 0, deltaValue);         }          lastGemValue = gemValue     }  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#48",
                    "likes": "0",
                    "time": "13/07/2022-11:45:21",
                    "content": "Thanks for your response.You have basically confirmed my arguments and reservations.Backed is playing in my opinion not on the edge but beyond the edge of legalities in Switzerland and potentially other jurisdictions.as mentioned earlier I have confirmed this with others in Switzerland in legal circles.comments about the backed prospectus as the shield have no bearing from a legal standpoint because that only refers to the issuance by backed which could be as little as 1 Swiss franc.the issue is securities and the contemplated interaction with Makerdao that I am concerned.this could lead to many problems regulation-wise and risk-wise with the regulators for Makerdao.i understand your point on legal opinion but your argument fails in that by not sharing the legal opinion backed is confirming that this is not a typical issuance under Swiss law but rather an opinion to conduct this type of business with a defi platform by a law firm.I believe this should be pulled and more work done.I believe this is opaque in the areas that Makerdao needs confirmation.I have spent more time than I expected on this but will definitely vote against. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.62390350877193
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#49",
                    "likes": "1",
                    "time": "13/07/2022-13:00:19",
                    "content": "Thank you @LegalG , surprised to see you repeating your earlier points but happy to continue engaging if it will help clarify. Once again MakerDAO will not be interacting directly with the Backed Finance. Agree to disagree on the rest of your opinion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#50",
                    "likes": "1",
                    "time": "13/07/2022-13:55:36",
                    "content": "Dear @LegalG , It seems futile to go on with this back and forth discussion. As for the issuance by Backed, neither MLL nor us would risk our reputation by operating “beyond the edges”, and not even near them. As for MakerDAO allowing interaction with security tokens, that is something MakerDAO needs to evaluate separately. Basically almost all RWA are either securities or commodities. Whatever you decide to vote, we thank you for spending time reviewing the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#51",
                    "likes": "3",
                    "time": "18/07/2022-15:47:13",
                    "content": "These are my personal views and not those of CES.     backed-finance:  MIP6 Collateral Onboarding application for tokenized short-term bonds in line with the requirements of MIP13c3-SP12    I think we are losing the purpose of the original intent of MIP13c3-SP12  and this proposal is now turning into MakerDao essentially acting as a market maker for bIBTA. Specifically, from the backed-finance collateral onboarding call ( Collateral Onboarding Call #45 | Backed-Finance ) it is clear that backed-finance wants no involvement in onboarding this collateral - through say a MIP21 structure and wants ideally the bIBTA to be treated like a stablecoin such as USDC - with a planned exploration of using the PSM for this. From the perspective of incorporating this in the PSM as has been suggested by @strat-fin-core-unit - I think this is a non starter for the following reasons:   The PSM is used for providing a permissionless swap capability between stablecoins - by offering an bIBTA permissionlessly in the PSM we would be getting away from the initial intent of MIP13c3-SP12 - which is to reduce our USDC exposure and generating short term bond income. By pursuing the route suggested by @strat-fin-core-unit we are violating this original intent and by opening up a permissionless 2 way swap market - risk making no income from these biBTA’s.   The PSM is used for swapping stablecoins - where typically there is no issue with respect to oracles related to the underlying asset as these tend to be pegged to the US$. The underlying asset for the bIBTAs only trades during stock market hours - and will definitely need an Oracle - the issue that would be of concern using the PSM is that arbitrage opportunities are potentially created when stock markets are closed and we are providing a market closing price for this opportunity - the only way of mitigating this would be through the PSM parameters or by “closing” access to the PSM when stock markets are closed which would not be practical.   By making this token available within the PSM - we are implicitly - allowing Maker users to trade a token whose underlying asset may not be redeemable - especially if the bIBTA is owned by a US investor .  Given this, I don’t think it would be appropriate for Maker to make the bIBTA tokens available for permissionless trading - and would argue that by making it available on a permissionless basis - without disclosure of the restrictions on redemption of the underlying asset - we would be exposing Maker to potential legal and regulatory liability. You can argue that it is up to the buyer to beware - but if Maker users are to trade this without disclosure - they will have unnecessarily incurred gas and other transaction fees for ultimately an asset they cant redeem.   Given that backed finance has stated that they have no interest in completing a MIP21 - and that it will be incumbent on MakerDao to be responsible for all aspects of integrating the bIBTA into the protocol including oracles etc… For these reasons I personally don’t believe we should be green-lighting this proposal. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-45-backed-finance/16420"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.524739583333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#52",
                    "likes": "4",
                    "time": "18/07/2022-16:53:13",
                    "content": "Thanks @dbkcan. Taking the liberty to build on some of your concerns and hopefully address:     dbkcan:  The PSM is used for providing a permissionless swap capability between stablecoins - by offering an bIBTA permissionlessly in the PSM we would be getting away from the initial intent of MIP13c3-SP12 - which is to reduce our USDC exposure and generating short term bond income. By pursuing the route suggested by @strat-fin-core-unit we are violating this original intent and by opening up a permissionless 2 way swap market - risk making no income from these biBTA’s.   The PSM as proposed would exactly achieve the objective of MIP13c3-SP12 by allowing the reallocation of USDC volume to bIBTA, short-term bond ETFs. I am not sure how you imagine this does not achieve the original intent of the DoI. Maker can decide, through policy rate parameters, effectively how much DC to accumulate in bIBTA. It is a stretch to argue that it would act as market maker - it is no more making markets in bIBTA than it is in ETH through liquidations or USDC through the PSM.     dbkcan:  The PSM is used for swapping stablecoins - where typically there is no issue with respect to oracles related to the underlying asset as these tend to be pegged to the US$. The underlying asset for the bIBTAs only trades during stock market hours - and will definitely need an Oracle - the issue that would be of concern using the PSM is that arbitrage opportunities are potentially created when stock markets are closed and we are providing a market closing price for this opportunity - the only way of mitigating this would be through the PSM parameters or by “closing” access to the PSM when stock markets are closed which would not be practical.   Arbitrage opportunities are precisely the way to incentivize market participants to constantly reach the desired DC in a permissionless way. Maker can effectively determine the availability of these opportunities through the MOMC rate setting process and does not have to pay attention to ETF trading hours. Arbitrage outside market hours is pursued at the risk of the PSM user, who may so desire.     dbkcan:  By making this token available within the PSM - we are implicitly - allowing Maker users to trade a token whose underlying asset may not be redeemable   We incur this risk already with WBTC and USDC. This is no different and does not expose Maker to any more or any less legal or regulatory risk than either of these two tokens that are a mainstay of the protocol. We can choose to disallow collateral that embodies this risk, as some have argued, or accept the compromise that with PSM fees we can effectively regulate the potential risk these tokens represent. This would be an improvement to regulatory capture risk over our USDC-PSM vault, where we charge no fees. My own view is that:  MKR holders (today) effectively already accept holding on-chain centralized crypto vaults (Category 2 in Chris’ framework below) MOMC will effectively regulate the % exposure to optimize ALM for DAI maturity (as well as Category 3 exposure to short-term bonds, which can and should exist contiguously to this collateral type) The permissionless design aims to minimize human interaction and make it possible to reduce potential liability and hypothetical regulatory scrutiny in the same way  Then, within Category 2 types of collateral, it is actually a meaningful improvement in resilience over USDC and WBTC in a more favorable jurisdiction:  No blacklisting or whitelisting functions in the smart contract Jurisdiction of choice is among the most forward thinking for crypto in the whole world with very strong property rights Bankruptcy-remote custodian structure safeguards collateral in the event of the tokenizer ceasing business     MIP6: Pando Investment Grade Climate Assets Collateral Onboarding   The key categories are:  On-chain decentralized crypto vaults (i.e. ETH) On-chain centralized crypto vaults (i.e. USDC, WBTC) Off-chain vaults (all RWA, bonds, etc)    EDIT: Will add,     dbkcan:  For these reasons I personally don’t believe we should be green-lighting this proposal.   At greenlight stage this discussion is premature. The collateral type answers a need MKR holders have expressed and does it in a permissionless and on-chain way that minimizes risk to the protocol. Should any of your concerns materialize in practice, I could agree with you to halt domain work or reject onboarding polls. My view is that at this stage, token holders should approve the greenlight to explore further, which is what the poll is asking for. ",
                    "links": [
                        "https://forum.makerdao.com/t/summary-of-usdc-protocol-risk/",
                        "https://forum.makerdao.com/t/mip6-pando-investment-grade-climate-assets-collateral-onboarding/16394/12"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.863509316770186
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#53",
                    "likes": "4",
                    "time": "18/07/2022-17:47:00",
                    "content": "    adcv:  The PSM as proposed would exactly achieve the objective of MIP13c3-SP12 by allowing the reallocation of USDC volume to bIBTA, short-term bond ETFs   Sure it allows the reallocation of exposure I don’t dispute that - but what about the generation of income from that reallocated exposure - in a psm you are effectively making a market on both sides - so that income could disappear quickly if the psm parameters are mispriced for the market ? It seems like you are suggesting here - that MOMC will set the rates to ensure that it is effectively a 1 sided market so we can be sure that we are earning an income? Perhaps you can clarify ? Maybe a better approach is to create a collateral vault like for WBTC and get the oracles for liquidation etc working appropriately first before trying to make markets for this in the PSM ? It would be interesting to get @Risk-Core-Unit 's view on how they would treat this collateral or would you expect @Real-World-Finance to complete this risk assessment … In fact - this begs the question if we are not willing to complete a regular collateral vault for this asset - does it make sense until that is done to even offer it through the psm ?     adcv:  We incur this risk already with WBTC and USDC. This is no different   How can you say no difference - Do WBTC and USDC - have any stated ownership restrictions for the underlying asset ? Correct me if I am wrong but for bIBTA the underlying token has clear upfront restrictions - backed will not issue to US based investors and stated that they will not redeem the tokens for any US investor and/or someone they have not KYCd. So trying to compare this tokenized security with USDC and WBTC, I believe is not a meaningful comparison.     adcv:  Then, within Category 2 types of collateral, it is actually a meaningful improvement in resilience over USDC and WBTC in a more favorable jurisdiction:   Conveniently, you keeping choosing to ignore the key point point that Issuance and Redemption of tokens and the underlying assets is restricted to US investors … (not the same as USDC/WBTC)     adcv:  My view is that at this stage, token holders should approve the greenlight to explore further, which is what the poll is asking for.   My main concern is that what you want to spend time exploring - potentially requiring resources from other core units - is the most complex possible solution and probably the riskiest solution. To minimize work and effort from other core units - I think if green-lighted - the focus should be on an Oracles Assessment and risk parameters -  before deciding on the best implementation - which if MIP21 is not an option would be a regular collateral vault, psm, or some custom technology. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.87109375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#54",
                    "likes": "3",
                    "time": "18/07/2022-18:18:16",
                    "content": "    dbkcan:  It seems like you are suggesting here - that MOMC will set the rates to ensure that it is effectively a 1 sided market so we can be sure that we are earning an income? Perhaps you can clarify ?   To be explicit: high tout rates should effectively price for risk and close arbitrage opportunities outside of the price + tout range. Getting a @Real-World-Finance view as well as @Risk-Core-Unit on this would be super interesting imo to understand the legal context properly, but open to suggestions.     dbkcan:  How can you say no difference - Do WBTC and USDC - have any stated ownership restrictions for the underlying asset ?   USDC has an active blacklist that bricks the token. If an EOA is in the US it theoretically cannot actually be stopped from holding bIBTA and trading it to a liquid buyer who is able to KYC. They might not be able to redeem bIBTA, but neither could someone if they failed to clear regulatory processes in the US to onboard at Circle or BitGo. So it’s really just a difference of degree - in which bIBTA has theoretically fewer restrictions of degrees of freedom as it can trade fully permissionlessly.     dbkcan:  I think if green-lighted - the focus should be on an Oracles Assessment and risk parameters - before deciding on the best implementation   I would ultimately agree with the approach where domain work is the only way to really find out the risks and implications of a proposed solution. We can disagree with the complexity and risk and will only find out with domain work, hence the greenlight poll. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.991666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#55",
                    "likes": "3",
                    "time": "19/07/2022-11:16:20",
                    "content": "    dbkcan:  In fact - this begs the question if we are not willing to complete a regular collateral vault for this asset - does it make sense until that is done to even offer it through the psm ?   There is no certain market for such a product and it would be less profitable for us. On the other side, we have an urgent need to invest our excess liquidity in some yielding and safe opportunities.     dbkcan:  My main concern is that what you want to spend time exploring - potentially requiring resources from other core units - is the most complex possible solution and probably the riskiest solution.   I would actually say it is the easiest and safest RWA solution. Modification to be made to the PSM are not that complex. The proposition of a PSM is really just to get the understanding, it is mainly a was to passively buy and sell assets (opposite of DSSKiln). Such a tool is key to MakerDAO no matter what. The MIP6 explicitly says “the exact implementation is to be determined in the assessment phase”). It doesn’t need a legal structure which is complex by definition. All legal structure are complex to work with governance (complex as humans in the mix). Here, governance just have to set parameters. Very easy. A legal review will be needed, but that’s the same thing for any RWA. Except this one unlock all public markets. The key part of the work is indeed on the oracle side. I guess there is significant work there, but also significant opportunity. @NikKunkel can provide guidance here if he wants. Notice we can also start with a degraded version without oracles (DSValue managed by governance, same as all others RWA). I encourage you to provide alternatives. I’ve spent considerable amount of time finding better solutions but couldn’t (yet I will continue to look for them). To go back to profitability, in my view, MIP65 and this MIP6 are key. Nothing a $40M/year workforce can’t handle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.286324041811846
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#56",
                    "likes": "1",
                    "time": "19/07/2022-12:41:27",
                    "content": "Hi As I look at this and have commented and shared the securities related obvious problems with this not great opportunity and,oddly,the overwhelming bias support from Strategic Finance core unit, I must ask a direct question.Upon research of love proposal,I observed similar bias for love proposal from strategic finance core unit.bit gobsmacked by this Does strategic finance CU or any member of strategic finance CU have a financial interest in Backed or upside or other arrangement on a personal basis with Backed or its principals This is not an accusation but this question should be answered and would be helpful thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.488636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#57",
                    "likes": "8",
                    "time": "19/07/2022-12:58:28",
                    "content": "    LegalG:  Does strategic finance CU or any member of strategic finance CU have a financial interest in Backed or upside or other arrangement on a personal basis with Backed or its principals   Happy to oblige @LegalG. Nobody in Strategic Finance has any economic link with Backed Finance AG or any of its related parties and do not stand to gain personally from this deal in any way you could possibly imagine. Call me naive but of course there is always the potential for MKR token value appreciation should this collateral type eventually be onboarded, which we are ultimately incentivized by and believe this is the point. Similarly, Backed Finance does not own, to our knowledge, any meaningful amount of MKR tokens and is therefore unable to influence voting outcomes, which comes as a refreshing change. We are passionate about this proposal because of the promise that it holds for our ability to manage our PSM exposure in a permissionless way with minimal human interaction. However, ultimately, it is up to MKR token holders to decide. edit: added bold type for dramatic effect ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.119318181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#58",
                    "likes": "3",
                    "time": "19/07/2022-13:36:06",
                    "content": "Dear @LegalG , I confirm the reply by @adcv . No member of the strategic finance CU at MakerDAO has any financial interest or upside in Backed or its principles, its shareholder, or any other direct or indirect manner, neither in a monetary form of Fiat, tokens or any other way. BTW, in essence, such form of incentive is forbidden by Swiss law, and as said in previous posts, to the best advice we have received, Backed is fully compliance with the Swiss CO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.488095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#59",
                    "likes": "8",
                    "time": "19/07/2022-14:03:19",
                    "content": "    LegalG:  Does strategic finance CU or any member of strategic finance CU have a financial interest in Backed or upside or other arrangement on a personal basis with Backed or its principals   No. You will also see that I support Monetalis/MIP65 which can be seen as a competitor of Backed. My goal is for DeFi to replace TradFi. I have a strong bias towards scientific governance and getting things done. Your point on securities laws is quite broad and undocumented. Feel free to provide an actual evidence that will help us, I have no issue spending time on understanding it. But, I mean, a new account using securities laws lingo and pointing to possible private entanglement by CU members is tragically business as usual in MakerDAO politics so it’s super hard to distinguish what is a serious concern from FUD. We will look at it (it is obviously the main point), but to have lawyers look at it we need the greenlight. If it was me, we would already have top-notch lawyers working on that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.338804713804714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#60",
                    "likes": "0",
                    "time": "19/07/2022-16:24:32",
                    "content": "thank you.Good news.on your question, please check with a reputable Swiss law firm.the designation backed has is an application any entity in switzerland can apply to and receive as very easy and is self reporting.It is NOT a true regulated compliant entity.the documents provided are solely regarding an issuance and not regarding distribution of securities which this would be.Hence the issues of oversight and regulated entity ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.480555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#61",
                    "likes": "0",
                    "time": "19/07/2022-16:24:49",
                    "content": "thank you for replying ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#62",
                    "likes": "0",
                    "time": "19/07/2022-16:25:49",
                    "content": "thank you and good news.i just had to check because of the passion I observed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#63",
                    "likes": "5",
                    "time": "19/07/2022-16:41:40",
                    "content": "Keep in mind Maker has over 5B in DAI on its balance sheet earning 0.000% interest Some folks are quite passionate about improving this situation! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#64",
                    "likes": "0",
                    "time": "19/07/2022-16:45:55",
                    "content": "Understood and agree but not the issue.There seems to be more quality firms getting involved and one poor choice could be damaging.This is imo has too many questions and is a risk as I have shared. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#65",
                    "likes": "3",
                    "time": "19/07/2022-16:46:03",
                    "content": "Totally! The growth domino effect from this initiative that we should all be passionate about ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#66",
                    "likes": "5",
                    "time": "19/07/2022-17:17:29",
                    "content": "    LegalG:  Does strategic finance CU or any member of strategic finance CU have a financial interest in Backed or upside or other arrangement on a personal basis with Backed or its principals   I will include LTS in your request. The answer is No. I think your conflict of interest point is a great one and is one which @Real-World-Finance has similarly asked of Real World Finance vault applicants. There has been push back from some sectors. To ensure full transparency, we should probably ask applicants to confirm that no member of any core unit receives any direct or indirect benefit from the successful execution of a transaction and that the applicant has not offered any such benefit (orally, in writing or otherwise). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.943181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#67",
                    "likes": "1",
                    "time": "19/07/2022-17:19:12",
                    "content": "    LegalG:  This is imo has too many questions and is a risk as I have shared.   Echo Seb’s comment that it could be helpful to see these questions or understand your criteria for quality firms. Otherwise it just seems like you have a specific passion about preventing domain teams exploring this further for some reason, independently of the actual benefits and risks (which are anyway not materialized at the domain work stage), and are trying to cover by handwaving about ‘the questions’. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#68",
                    "likes": "0",
                    "time": "19/07/2022-17:22:45",
                    "content": "Which more quality firms do you have in mind? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#69",
                    "likes": "2",
                    "time": "19/07/2022-17:57:33",
                    "content": "This is actually not precise. For becoming an SRO member, a company must offer at least one service for which AML regulation is mandatory, and be audited regularly for the AML activity it performs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#70",
                    "likes": "1",
                    "time": "19/07/2022-21:41:56",
                    "content": "Actually an audit is simple in this case.AML reg is tied to fincen in the states for example and other jurisdictions request reports that are similar.its a stretch to suggest that an aml audit is strong regulation.i am concerned Backed is mischaracterizing what an sro represents beyond an application and and aml audit.I didn’t mention it because its not full regulation.Regulation is many tiers above that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.452380952380952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#71",
                    "likes": "2",
                    "time": "19/07/2022-21:49:51",
                    "content": "Quality firms means credible firms with track records,strong accomplished teams to be reviewed as part of diligence process.Backed is a 2 or 3 person entity today I saw sygnum bank in a proposal today, that is quality in Switzerland as an example and truly and heavily regulated in regards to securities and so many more items, and easily investigated.This is basic and if a member of real world finance and strategic finance need clarity,then I have significantly more concerns re experience of those particular members.This is not a big ask and with the quality of maker ecosystem built over many years, then quality firms like sygnum bank,which popped up today,should be the focus.imo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#72",
                    "likes": "2",
                    "time": "20/07/2022-04:46:49",
                    "content": "Thank you - a bit more helpful, all concerns which warrant further legal investigation on part of domain team work. None of which can take place without a greenlight though, which this poll is asking for, for a proposal that objectively answers a demand MKR holders have made through MIP13c3-SP12. Edit: will add, am and will continue to deliberately look past the ‘see what sticks’ strategy of casting aspersions on proposal submitters or individual contributors’ competence or integrity, with no evidence or substantive arguments. It’s the sort of hand-waving abstract demagoguery that makes it difficult to discriminate between a good faith question or concern, as others have expressed in this thread, from a potentially economically motivated FUD campaign by someone who is intent on making sure domain teams do not investigate a proposal further. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.659090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#73",
                    "likes": "1",
                    "time": "20/07/2022-05:53:48",
                    "content": "    backed-finance:   What is the market cap for the asset?  This is a new issuance, created with MakerDAO in mind but available to the broad public, so starting with 0 on-chain. The ETF market cap is over 9 Billion USD but the market cap for the underlying treasuries is much larger, over 1 Trillion USD.  Where does exchange for the asset occur?  Currently no circulation, so no exchange data available. The asset is ERC20 so it is freely tradable OTC, centralized and decentralized exchanges.   Are there any market makers you’ve engaged with to generate liquidity for this asset, if so, who are they and what level of liquidity are we taking about? Have you had discussions with exchanges to list this asset so we can have new price feeds sources? Do you have plans to launch this asset still in case token holders decide not to pursue this onboarding? If so, can you share some info on how the plan looks like and which timelines? Thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.788739669421488
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#74",
                    "likes": "3",
                    "time": "20/07/2022-06:15:52",
                    "content": "Dear @LegalG , Will try to address both of your last posts.  The regulatory strategy Backed has adopted, since the project’s inception, was to be fully compliant with the minimal amount of regulatory burden, as more (unnecessary) licenses generate costs, and that, eventually, is paid by the market. We do not avoid regulation in any way, but have no desire to overdo it. I don’t know where you got the 2-3 people input, which is really far from the truth. As this point is beyond the legal/professional issue, it generates a strong sense of a hidden agenda in your position, and I am not sure this serves either the discussion or the MakerDAO community. If there is any new input or concern, we would be happy to address those, but as far as the above mentioned topics, I don’t see much substance any longer.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520396270396271
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#75",
                    "likes": "1",
                    "time": "20/07/2022-07:33:59",
                    "content": "Hello @M_C , Backed is preparing to launch its product. We are currently onboarding the first MM (from a compliance standpoint). Once the MM is onboarded, we will ask for their permission to share their info (some MM prefer not to be publicly known). As per exchanges, we are having ongoing discussions with a few. CEXs are in a much more sensitive position, as they “own” the retail clients, and by selling them securities, they might be considered as making an offering (not always, but the risk exists). It seems that in Europe CEXs still have some work to do before they can list securities, but outside Europe (and obviously the US) discussions are progressing nicely. We do not want to create false expectations, so forgive me for not namedropping, but we are talking basically with major exchanges, and many smaller ones as well. As per your last question about our plans - we cannot launch without at least one onboarded MM, which is now in process. Once this is done, we will be ready, and will launch, probably in a gradual manner, first in smaller issuance series and once convinced all works as planned, we will be ready to issue larger values. In principle, all this should be complete before MakerDAO has a change to finalize the onchain voting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.355113636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#76",
                    "likes": "1",
                    "time": "20/07/2022-10:42:50",
                    "content": "This is a very interesting proposal, because the use of the PSM seems like a simple way to onboard this asset, and Swiss-based tokens mean further diversifying regulatory risk. However: The PSM contains USD-based stablecoins only. Your product is an ETF and not USD-based, I believe. How will these two volatility risks be addressed in that context? It really seems like a vault would be the way to go.     backed-finance:  and (i) may not be offered, sold, or delivered within the United States to, or for the account or benefit of U.S. Persons   I’m not a lawyer, but this seems to expose Maker to non-trivial legal issues. Then there’s the question of liquidity:     Roberto:  We are currently onboarding the first MM (from a compliance standpoint).   There’s a chicken and egg problem here, but I don’t feel strongly about Maker solving that by creating a market. We’ll debate on our team and might come back to you with more questions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.508012820512821
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#77",
                    "likes": "3",
                    "time": "20/07/2022-11:02:36",
                    "content": "    rspa:  The PSM contains USD based stablecoins only. Your product is an ETF and not USD-based, I believe, who will these two volatility risks be addressed in that context? It really seems like a vault would be the way to go.   I plead guilty of speaking of a PSM as it seems to confuse people. Just think about issuing buying and selling orders controlled by MakerDAO governance. As said earlier, this MIP6 is about MakerDAO investing in short-term bonds which will solve our revenues issue, not MakerDAO providing a credit facility against short-term bonds. The demand for the latter is probably next to null at least initially.     rspa:  There’s a chicken and egg problem here, but I don’t feel strongly about Maker solving that by creating a market. We’ll debate on our team an might come back to you with more questions.   You can safely assume that there will be no market (or none significant). The previously mentioned buy and sell orders by MakerDAO will create a risk-free arbitrage that the MM will exploit (or any non-US KYC person when selling). I know that I’m advocating for additional yield and DAI utility to MakerDAO by providing a market but that would be in a second step. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.247549019607844
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#78",
                    "likes": "0",
                    "time": "20/07/2022-11:09:00",
                    "content": "Thanks, Seb, very insightful.     SebVentures:  Just think about issuing buying and selling orders controlled by MakerDAO governance.   This especially. But it ties in with my liquidity concerns. If Maker is the only/largest holder of these tokens, what do we do in an event when we need to liquidate the collateral in the shortest possible order? I do understand that Maker might need to accept additional risk in return for yield and diversification from UDSC exposure. However, it seems that this asset will take weeks to liquidate well because we’d have to ask Backed Finance to sell the tokens for the underlying ETF, sell the ETF for DAI, and hand over the DAI. Would they even do that? Otherwise, we’d have to find a buyer of last resort and quickly, and I think we both know how these deals look when forged under fire. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#79",
                    "likes": "1",
                    "time": "20/07/2022-12:39:35",
                    "content": "    rspa:  But it ties in with my liquidity concerns. If Maker is the only/largest holder of these tokens, what do we do in an event when we need to liquidate the collateral in the shortest possible order?   So far this MIP6 is considered slow to liquidate mainly because even if we invest at scale (500M) we would still have plenty of USDC in the traditional PSM. The limitation is the balance sheet capacity of the MM (and other KYCed actors) and the speed to create a loop. We had/have the same issue with WBTC in which most of the liquidity is in BTC (it was a concern at the beginning where MakerDAO hold most of the WBTC). Contrary to a crypto-vault, liquidation speed is not a big issue here. It is not really liquidation but selling. This MIP6 provide foundation to move to the very short maturity in a second step. For which IBTA is probably not a good match anyway. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.139880952380952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#80",
                    "likes": "0",
                    "time": "20/07/2022-13:13:26",
                    "content": "Sorry about 2-3 people, my misunderstanding that is is 5-7 You are correct,I indeed have an agenda which is that the Maker ecosystem doesn’t put itself out as a target for regulators with inadequate structures.This mip is not clear per my earlier comments and a token representing securities is a security.Simple.My comments are simply about the ecosystem and securities law jurisdictionally on a basic level.It imo is not prudent for the ecosystem to take a risk on this without clear indication of regulatory and legal review.A tbd regarding important questions such as securities law and utilizing uniswap for securities pooling is inadequate. IMO a mip proposal needs to be thoroughly presented.Other proposals have been made to the ecosystem with a strong regulatory and legal framework.Unfortunately Backed MIP does not.That is my agenda. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.356060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#81",
                    "likes": "4",
                    "time": "20/07/2022-13:42:12",
                    "content": "    LegalG:  Sorry about 2-3 people, my misunderstanding that is is 5-7   Also not true, but you’ll get there eventually ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#82",
                    "likes": "0",
                    "time": "20/07/2022-13:44:09",
                    "content": "    SebVentures:  We had/have the same issue with WBTC in which most of the liquidity is in BTC (it was a concern at the beginning where MakerDAO hold most of the WBTC).   Always learning more. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#83",
                    "likes": "3",
                    "time": "25/07/2022-14:25:45",
                    "content": "    backed-finance:   List any possible oracle data sources for the proposed collateral type.  The price of the underlying ETF on which the collateral token is based, appears in the following link: ISHARES IBTA Stock | London Stock Exchange   I can’t imagine supporting this greenlight without a better understanding of how the price feed can be trust-minimized. Can anyone suggest ideas on how this can possibly occur? If there is consensus that the DAO must trust the technical expertise of TradFi orgs like London Stock Exchange for the safety of the vault, then I can’t see a path forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#84",
                    "likes": "3",
                    "time": "25/07/2022-15:06:35",
                    "content": "    ChrisBlec:  If there is consensus that the DAO must trust the technical expertise of TradFi orgs like London Stock Exchange for the safety of the vault, then I can’t see a path forward.   IBTA has multiple listings outside of the LSE. Concur with your view that price redundancy is necessary. Hopefully a decentralized bIBTA/DAI market will emerge on Uniswap to provide a robust and independent source as well. I’d be excited to see what @Oracles-Core-Unit believe is possible as an example of a decentralized and trust-resistant price feed for a traditional financial instrument. Our Oracle team is one of Maker’s key strengths and will be important for the ecosystem as a whole if we can show the way forward with a robust and decentralized solution to bringing price feeds for these types of instruments on-chain. Of course, we would have to evaluate based on feedback from the Oracles team and on the outcome of the domain team work. However, imo, it is worth investigating further. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.455357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#85",
                    "likes": "0",
                    "time": "26/07/2022-14:50:44",
                    "content": "What ongoing management fees will be charged for this product? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#86",
                    "likes": "2",
                    "time": "26/07/2022-15:05:18",
                    "content": "Non by Backed. (iShares currently charge 0.07% p.a, we have no control over that). Backed only charges issuance and redemption fees ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#87",
                    "likes": "0",
                    "time": "26/07/2022-15:28:35",
                    "content": "So the custodian isn’t charging anything either? It’s just the iShare fee? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#88",
                    "likes": "3",
                    "time": "26/07/2022-15:31:05",
                    "content": "The Custodian is charging us a yearly fee. We don’t pass on this fee, and don’t charge a AUM management fee, but only issuance and redemption fees, which should be enough for us to cover the Custody fee. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#89",
                    "likes": "0",
                    "time": "27/07/2022-15:29:26",
                    "content": "Recently, Invictus changed its Crypto20 (tokenized mutual funds) project from requiring KYC only on mint/redeem to requiring KYC simply to own. (article) It also forced its users to comply with KYC to mandatorily migrate from Ethereum mainnet to Polygon. Those who weren’t able to KYC were out of luck after the snapshot occurred. All of these TradFi projects have ultimate control over the tokens and can change the rules whenever they want to, need to or are forced to. Ownership of these tokens will be illusory, at best, since they can be invalidated or taken from you at any time for any reason. This type of uncertainty, combined with the inevitability of centralized price feeds, should be enough to disqualify the tokens as Maker collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/superTricycle",
                    "index": "#90",
                    "likes": "3",
                    "time": "28/07/2022-14:31:58",
                    "content": "Based on @teej’s RWA podcast with Chainlinkgod and his RWA article, there’s a clear opportunity to collab with Chainlink on RWA oracles. They also talked about CL’s Proof of Reserve, which Backed mentioned in the OP. Since oracles are usually difficult and CL already has that feature available, those could be a powerful ways to add robustness. ",
                    "links": [
                        "https://forum.makerdao.com/t/charting-a-path-for-rwas-part-2-the-maker-standard/16725"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#91",
                    "likes": "1",
                    "time": "31/07/2022-15:00:40",
                    "content": "   Fluid Finance SA – 26 Sep 21    Introducing DigitalDollar (DUSD) Learn more about Fluid’s Stablecoin 2.0: DUSD. Fully 1:1 backed by real dollars, verifiable on-chain 24/7. In and out of DeFi in minutes, cheaply.       Fluid Finance already uses Chainlink proof of reserves to mint DUSD which is backed 1:1 with USD in CurrencyCloud. “DUSD, as well as other tokenized real-world assets in the future (more on this later), will run via the Defi Bridge DAO. And the same tech (and DAO) that’s used to prove USD reserves on-chain to create DUSD, can be used to tokenize stocks or even commodities, as well as be open-sourced for 3rd party banks to join us with DUSD. We’re considering adding a DEUR, DGBP and DCHF as well, but there isn’t much of a market for them (yet!). However, innovation comes from experimentation, and there are many interesting ideas for us to pursue. All we need is time, and volume.” ",
                    "links": [
                        "https://fluid.ch/introducing-digitaldollar/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.830357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#92",
                    "likes": "0",
                    "time": "01/08/2022-07:12:17",
                    "content": "Hi @ChrisBlec , Sorry for the delayed answer. Obviously, your concern is valid. Probably any structure or system with a centralized element is prone to enforcement risk, or arbitrary/wrong decisions. This applies to security tokens very much as it does to Fiat-backed stablecoins and commodity tokens (such as Gold-pegged), for which a centralized element cannot really be avoided. There is, however, an important (and very much studied, for instance here) stabilizing effect in diversification of risks, thus RWA might also offer volatility protection, and improve the overall utility of the reserve. In addition, the RWA market is significantly larger than the intrinsic crypto market, and injection of RWA could generate growth of the DeFi ecosystem to much bigger scale. In that sense, I believe a portfolio-based approach would improve the resilience of the MakerDAO reserve, even if that means exposing it to some centralized risk. BTW, I think this answer addresses the RWA issue in general, and not this proposal in particular. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.348611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/backed-finance",
                    "index": "#94",
                    "likes": "7",
                    "time": "21/02/2023-10:50:32",
                    "content": "Dear Maker community, An update on our developments is long overdue. Throughout the past months, Backed team members have remained in full build mode, and below is a quick peek into our main challenges and accomplishments. Following our initial post in this forum, we faced some headwinds, including financial service provisions in Switzerland and taxation uncertainties for fixed-income products, both of which delayed our time to market. We are excited to announce that we have managed to resolve the logistical hurdles and get clarity on taxation and are now free to issue Backed tokens that track almost any tradable security. In the past months, we have also onboarded our first primary customers, including five professional crypto trading firms, with a few more currently going through the process. Backed has recently achieved an important milestone with the launch of its first product, bCSPX. bCSPX is our ERC-20 tokenized tracker of the popular iShares Core S&P 500 UCITS ETF and can be viewed on Etherscan. We are now preparing to issue our first fixed-income tokenized trackers, bIB01 & bIBTA. We will issue the fixed-income products for a trial period of 1 year. We are thus happy to proceed to the DD phase on the project and products in light of MakerDAO’s continued interest in RWAs. ",
                    "links": [
                        "https://etherscan.io/token/0x1e2c4fb7ede391d116e6b41cd0608260e8801d59"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.005208333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#95",
                    "likes": "0",
                    "time": "21/02/2023-12:21:02",
                    "content": "Thanks for the update. While the Maker governance is moving to focus on US treasury bonds and Money Market Funds so S&P 500 category seems out of Maker’s focus, but maybe as the Endgame evolves, might be other rooms for Maker to benefit from. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/backed-finance",
                    "index": "#96",
                    "likes": "0",
                    "time": "21/02/2023-13:25:59",
                    "content": "Hi Doo  Maybe I misread you. But just to make things clear. bCSPX was only mentioned as a proof-of-concept for tokenization already done by Backed. We are proposing to to the Maker community bIBTA and bIB01. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#97",
                    "likes": "1",
                    "time": "21/02/2023-13:58:02",
                    "content": "this is in response to this:     backed-finance:  Backed has recently achieved an important milestone with the launch of its first product, bCSPX. bCSPX is our ERC-20 tokenized tracker of the popular iShares Core S&P 500 UCITS ETF  and can be viewed on Etherscan.   ",
                    "links": [
                        "https://etherscan.io/token/0x1e2c4fb7ede391d116e6b41cd0608260e8801d59"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#98",
                    "likes": "2",
                    "time": "08/03/2023-18:22:17",
                    "content": "@backed-finance Will there be legal due diligence for this project? As mention by the others, it does not appear to be compatible with Swiss law. The terms call this a structured produkte. But according to art. 70 FinSA  Finanzdienstleistungsgesetz, structured products may only be issued by licensed financial intermediaries or special purpose entities guaranteed by them. The Backed products don’t seem to have such a guarantee. Can someone explain please?  Screenshot 2023-03-08 at 7.15.23 PM1574×518 92.8 KB   Screenshot 2023-03-08 at 7.20.13 PM1740×934 112 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3601190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#99",
                    "likes": "0",
                    "time": "08/03/2023-20:06:54",
                    "content": "DD is currently being conducted by a team from Maker and external legal advisors. As per the legality of issuing the products: Our legal advice indicates unequivocally that the issuance of the products does not require a banking or a broker-dealer license. The offering of the products by such issuer is allowed only to professional investors, again, as long as no broker dealer license exists. Nevertheless, the products are eligible for retail clients that can purchase them in secondary markets, not directly by the issuer. Lastly, redemption of the products by retail investors is allowed, as long as they pass full KYC with the issuer. The team conducting DD will have visibility of all aspects of this matter, to the extent needed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.153846153846153
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#100",
                    "likes": "0",
                    "time": "08/03/2023-20:58:51",
                    "content": "From the top of the document, it very much looks like this product is being offered to retail investors. Will the legal advice and DD report be provided to this community? Many here question the legality of this product.  Screenshot 2023-03-08 at 9.57.08 PM1526×384 57.4 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#101",
                    "likes": "0",
                    "time": "09/03/2023-13:48:47",
                    "content": "We have secured that the Swiss related legal memo, at least, will be public. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#102",
                    "likes": "2",
                    "time": "10/03/2023-18:42:35",
                    "content": "    Roberto:  Our legal advice indicates unequivocally that the issuance of the products does not require a banking or a broker-dealer license. The offering of the products by such issuer is allowed only to professional investors, again, as long as no broker dealer license exists. Nevertheless, the products are eligible for retail clients that can purchase them in secondary markets, not directly by the issuer. Lastly, redemption of the products by retail investors is allowed, as long as they pass full KYC with the issuer.   This is incredibly hard to believe. Perhaps you are not a native English writer so we are not perceiving the correct meaning from these sentences. Also, we only have access to U.S. counsel to advise us on our Governance services at MakerDAO, so look forward to obtaining further information about the name of the law firm and attorneys involved, who retained them (what legal entity is the client) and what was the instruction letter and/or set of facts presented to the firm in order to arrive at such conclusions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.918981481481481
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#103",
                    "likes": "0",
                    "time": "13/03/2023-15:54:14",
                    "content": "    SebVentures:  We have secured that the Swiss related legal memo, at least, will be public.   @SebVentures Thank you. At what time will we see the Swiss related legal memo? If this will be public, can it be delivered to the DAO now? These questions will remain about this project without seeing this memo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#104",
                    "likes": "0",
                    "time": "13/03/2023-16:02:55",
                    "content": "    Roberto:  The offering of the products by such issuer is allowed only to professional investors, again, as long as no broker dealer license exists. Nevertheless, the products are eligible for retail clients that can purchase them in secondary markets, not directly by the issuer.   @Roberto Can you say please what the secondary market is for this produkt? How does MakerDAO buy it? Who will sell the produkte to MakerDAO? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#105",
                    "likes": "0",
                    "time": "13/03/2023-16:36:53",
                    "content": "    HuldrychZ:  If this will be public, can it be delivered to the DAO now?   It is not possible to deliver something that don’t exist yet, we are on it (or more precisely a law firm in Switzerland). Which is why, as you can see, we are not onboarding bIB01 for now, a lot of work ahead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#106",
                    "likes": "0",
                    "time": "13/03/2023-17:49:55",
                    "content": "    SebVentures:  It is not possible to deliver something that don’t exist yet, we are on it (or more precisely a law firm in Switzerland).       Roberto:  Our legal advice indicates unequivocally that the issuance of the products does not require a banking or a broker-dealer license.   Which is the legal advise please then this refers to? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#107",
                    "likes": "0",
                    "time": "13/03/2023-17:58:48",
                    "content": "The mechanism envisioned for these products is that MakerDAO would define, through a smart contract, at which price (Defined through its own oracle) and which total value it would transact to purchase these products in return for newly minted DAI. As the price of selling to MakerDAO would represent a small but defined profit for a party that can purchase directly from us, the economic incentive would be the real mechanism here. In regards to interested parties to do so, we do have several customers that expressed interest of doing so, however the mechanism here is a market mechanism, and would only reveal it’s attractiveness to potential intermediaries once it is in place. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.604437229437229
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#108",
                    "likes": "0",
                    "time": "13/03/2023-18:01:21",
                    "content": "I referred to our own legal opinion, which was done for mitigating our own risk as entrepreneurs and officers of the issuer. The RWA team at the MakerDAO, justifiably so, decided to have an independent legal review done, which would not be “biased” to the advantage of the issuer. That would probably be shared. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#109",
                    "likes": "0",
                    "time": "17/03/2023-13:33:46",
                    "content": "@Roberto We see now that the bIB01 product is trading on Uniswap. Do you still say this is not for retail? Do you say that a Swiss financial with FINMA license has put this on Uniswap with no AML? I do not believe that. Can you explain how this come to Uniswap please?  Screenshot 2023-03-17 at 2.28.42 PM2296×1312 423 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#110",
                    "likes": "0",
                    "time": "18/03/2023-21:05:55",
                    "content": "Dear @HuldrychZ , Where did you see me, or anyone else on behalf of Backed, mentioning that the tokens are not eligible for retail? Retail customers from the EU are fully eligible to own the tokens, which is the reason considerable efforts and resources have been put to filing a Prospectus that was authorized for these products. You can find the legal documentation in Backed’s website. I did say, however, that Backed itself cannot sell directly to retail investors, therefore such retail investors have to buy the products from financial intermediaries, and not directly from Backed. Backed can, and does, only sell to professional customers passing full AML. The tokens are freely transferable, therefore the professional investors that buy from Backed may transfer them freely. I assume someone that bought the tokens, directly or indirectly, might had placed tokens in a pool. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.857142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#111",
                    "likes": "0",
                    "time": "19/03/2023-14:26:21",
                    "content": "    Roberto:  therefore such retail investors have to buy the products from financial intermediaries       Roberto:  professional investors that buy from Backed may transfer them freely   @Roberto These statements appear not consistent, Under Swiss law, Professional Investors are not Financial Intermediaries. Can retail purchase tokens from Professional Investor? The prospectus seems to say not.  Screenshot 2023-03-19 at 3.18.14 PM1408×154 33 KB  Was selling on Uniswap done by Authorized Participant? If not, will Backed tell whoever has done this to stop as it is not authorised? Is it violation of prospectus here?  Screenshot 2023-03-19 at 3.23.53 PM1338×172 59.1 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.359375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#112",
                    "likes": "2",
                    "time": "19/03/2023-19:11:19",
                    "content": "Just chiming in to say, I remember seeing super-well-informed random accounts popping up in other RWA threads (can’t recall which). Every time the account is just asking questions, wants what’s best for Maker etc, but somehow is only interested in the topic at hand, and is being very aggressive. @HuldrychZ just so you know, my impression of anything you say is lowered by the fact that I’m seeing someone with a clear stake in whatever is going, hidden behind an anon account, not explaining how they fit in the overall picture, going hard against people who are open about their incentives and most of the time their real world identities. I don’t know who you are and who the anons were in the other threads – I’m guessing competitors? Anyway what you’re doing here is probably having the opposite of the intended effect, which is too bad if you happen to be raising real issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.185416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#113",
                    "likes": "0",
                    "time": "19/03/2023-20:57:03",
                    "content": "Today I am on the verge of losing confidence in Swiss Law if it turns out as reported that laws can and will be changed in an instant. Property rights become meaningless as Credit Suisse shareholders shall not be permitted to vote on the “acquisition” by UBS? Are there no protections or appeals to courts or…? It is chilling that such a thing is even POSSIBLE and would welcome comments here from others with an expertise in Swiss law and political structures. Whatever counsel has been engaged and legal analysis performed, it very much will need to take account of this current situation and resolution in the days to come:    CNN – 19 Mar 23    UBS is buying Credit Suisse in bid to halt banking crisis | CNN Business Switzerland's biggest bank, UBS, has agreed to buy its ailing rival Credit Suisse in an emergency rescue deal aimed at stemming financial market panic unleashed by the failure of two American banks earlier this month.      “Extraordinarily, the deal will not need the approval of shareholders after the Swiss government agreed to change the law to remove any uncertainty about the deal.” Can anyone share a source (and English translation) for the official government action that took place to remove uncertainty, if the CNN reporting is accurate? ",
                    "links": [
                        "https://www.cnn.com/2023/03/19/business/credit-suisse-ubs-rescue/index.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.215740740740741
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#114",
                    "likes": "0",
                    "time": "19/03/2023-21:25:22",
                    "content": "How is this different than the US’s handling of Signature Bank? Signature Bank shareholders didn’t get a say in the takeover either and the government is actively seeking a buyer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#115",
                    "likes": "1",
                    "time": "19/03/2023-21:44:38",
                    "content": "@DaveringtonPLLC , IMHO, knowing to a certain extent the Swiss mentality, there is probably information the public does not know at this time. The Swiss are profoundly rational, so such move could only be explained by the understanding that there is a tangible possibility of a financial institution, critical to the country’s economic stability, on the verge of collapse. I do, however, share your concern that the government is willing to make an ad-hoc legal change for this matter, instead of sacrificing public funds, which is what is done in the US. Let’s wait this one out, truth usually comes up eventually. BTW, if I were a UBS shareholder, I would have objected to this deal… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.290674603174603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#116",
                    "likes": "0",
                    "time": "20/03/2023-00:40:49",
                    "content": "Off topic. Do you have anything constructive and accurate to share about the questions I asked?  These kinds of defensive, reflexive deflections when serious issues are raised do MakerDAO SUCH a harm, and lower the incentive for people to engage in quality discourse so all may learn. We are talking about Swiss law and risk here on the thread about potentially onboarding Swiss law governed collateral and issuer obligations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#117",
                    "likes": "0",
                    "time": "20/03/2023-05:53:07",
                    "content": "Enticing as it may may to blurb about the banking sector situation, it is off topic. As per the Swiss question, the UBS-CS move is surprising, and possibly disappointing. Having said that, the Swiss legal system is infinitively clearer and more predictable than most other jurisdictions, and moreover when crypto is concerned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.696428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#118",
                    "likes": "0",
                    "time": "20/03/2023-12:07:19",
                    "content": "The topic I raise is not the banking sector. I raise the topic of the reliability of laws. MakerDAO is a decentralized project currently highly reliant on real world actors, assessment of legal structures, and risks posed by the enforcement of laws. If participants are meant to gain comfort from legal opinions, it is worthwhile to discuss the current environment where our understanding of how regulatory bodies, monetary authorities and governments are authorized to act is being challenged in real-time. Personally, I am rather aware of how this may occur in the U.S., which is why I am known on other threads to consistently caution and raise questions about risks posed by various entanglements with U.S. regulated entities and RWA. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.743181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#119",
                    "likes": "1",
                    "time": "20/03/2023-12:08:48",
                    "content": "Hi @swakya I am a Swiss lawyer concerned about the abuse of our legal system. That is my stake. It is my job. I am not well-informed. I read what is on Backed website and what I see on Twitter. That is all. Maker should do the same also. As a lawyer, I hope my questions can help Maker. Maybe some think so. If you do not please ignore. There is no obligation to answer questions here. Excuse me please. I do not intend any aggression to anyone for sure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roberto",
                    "index": "#120",
                    "likes": "0",
                    "time": "20/03/2023-14:52:56",
                    "content": "    DaveringtonPLLC:  MakerDAO is a decentralized project currently highly reliant on real world actors, assessment of legal structures, and risks posed by the enforcement of laws.   That is true, and particularly, it seems a large proportion of MakerDAO’s RWA are custodied with Swiss banks already. There is no way of owning RWA without a real world custodian somewhere along the way. Even after what happened yesterday, I believe that the Swiss legal system is probably healthier than most others. Not perfect, but neither are others. Comparing this to “regulation through enforcement” as displayed by the US, or an indecisive FCA which allows no regulatory certainty in the UK, the Swiss rule of law is probably still preferable. Possibly, when the MICA regulation becomes effective in the EU we might explore if that is viable option as well, given that regulation is constantly shifting, and projects need to be nimble to stay on top of that moving target. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.996768707482993
                }
            ]
        }
    ],
    "group_index": "1338"
}