{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-weekly-update-nov-26-dec-3/11996",
            "title": "Growth CU weekly update: Nov 26 - Dec 3 ",
            "index": 11996,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "4",
                    "time": "03/12/2021-19:15:59",
                    "content": " General Updates  D3M on the Aave Arc market @zxMori posted a proposal in the Aave community to propose whitelisting the D3M and DAI in their Arc Market. Next, we have to discuss with Fireblocks how to whitelist the contract (given that they whitelist institutions) and wait for the proposal to be voted.  DAI liquidity on our Multichain strategy Recently we had an alarming situation with various projects that want to integrate DAI on Arbitrum but can’t because of its low liquidity. They have to choose between USDC, USDT or MIM, because they can’t wait for their users to bring DAI liquidity to Arbitrum and pay for the gas fees of that transaction.  image1242×470 24.7 KB  Currently, Arbitrum is the L2 with the largest market share (40%) and under Maker’s multichain strategy. DAI is on Balancer in a stablecoin pool, but it’s not on SushiSwap, nor in Curve, which represents a problem for the dApps that need deep stablecoin markets. Talking with other Mandated Actors, we suppose the problem was the delay in including DAI on Arbitrum, which we decided for security reasons. Because of it, we think it is best to start thinking about strategies that help us increase DAI liquidity in the Networks that we consider strategic (because we may have this problem again in the future). We are working with other Mandated Actors to find alternative solutions to this problem. Possible solutions are renting DAI liquidity to Market Makers, incentivizing DAI liquidity through rewards, or adding something in the protocol that allows us to deploy DAI liquidity.   Star of the week   Creaticles, is a NFT platform for requesting custom NFTs and for submitting your NFT creation to a request. It also allows to mint in the blockchain the final piece that artists deliver. We’ve opened a NFT contest where any talented artist can participate and win a 1,000 Dai prize pool for the best NFT that represents the case of clean money.  image1920×980 155 KB   Tweet of the week   twitter.com    MakerDAO Growth @MakerGrowth    🤝 This is how we see the Dai and Mai collaboration, because that's the spirit of Dai and MakerDAO, a collaborative one.  Rather than being rivals, do we team up to align our incentives? Let's go 🚀 https://t.co/BuFJQY5MjN   4:42 PM - 29 Nov 2021           14                2            ",
                    "links": [
                        "https://app.creaticles.com/",
                        "https://twitter.com/MakerGrowth/status/1465360652722225163",
                        "https://twitter.com/MakerGrowth/status/1465360652722225163",
                        "https://twitter.com/MakerGrowth/status/1465360652722225163",
                        "https://t.co/BuFJQY5MjN",
                        "https://twitter.com/MakerGrowth/status/1465360652722225163",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035",
                        "https://forum.makerdao.com/t/under-construction/12274/8",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9907407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "03/12/2021-19:50:54",
                    "content": "    Nadia:  Recently we had an alarming situation with various projects that want to integrate DAI on Arbitrum but can’t because of its low liquidity. They have to choose between USDC, USDT or MIM, because they can’t wait for their users to bring DAI liquidity to Arbitrum   Yup–this has been an ongoing concern–even on Arbi’s Uniswap, swapping 10 ETH for DAI has an 11% slippage (approx. 5K DAI) and new Options platform Premia is showcasing DAI as its asset for Put options, and they’re having a hard time getting 5M DAI of liquidity ( so far only 1.3M) – its rough for DAI users in Arbi-land. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.858164983164983
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "2",
                    "time": "04/12/2021-19:49:16",
                    "content": " image1304×669 93.1 KB  I think you could recommend the “https://xpollinate.io/” bridge. It allows you to pass DAI from and between various networks, such as AVAX, MoonRiver, Fantom, Polygon, xDAI, BSC, Optimistic and even ETH. It also has an option to transfer even ETH from the mentioned networks to Arbitrum or between them. They can recommend that one to those interested. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/03/2022-19:49:32",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-weekly-update-nov-12-19/11735",
            "title": "Growth CU weekly update: Nov 12-19 ",
            "index": 11735,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "4",
                    "time": "19/11/2021-14:45:33",
                    "content": " General Updates  Multichain strategy Following PECU’s efforts to have DAI in other chains (Optimism, Arbitrum, and Starknet for now), the Growth team is working with those L2 to engage with their ecosystem lead to understand the existing landscape and identify where the focus areas should be. The three of them are focused on developing their community, attracting projects to build on them, and increasing liquidity.  Real-world Assets We are seeing more TradFi companies interested in understanding how the Maker Protocol work. With the help of RWF CU we are creating an onboarding process for these companies to understand Maker and find the way to integrate with the protocol.  Offsite Growth+guests After our experience working with other groups in Lisbon, we want to try a new format of offsite and open it to the community. We will discuss our priorities with the team during our offsite and define a plan to achieve our objectives as a core unit. We would also like to open this discussion and invite others to create the 1T growth vision. The offsite will be from February 7th to the 11th in Mexico. The following week some of us will stay in Mexico for then go to Eth-Denver. We need to know how many of you want to join us to make the reservation and start planing the offsite. If you are interested, please send me a DM on discord or the forum.   Star of the week   Stormx app, a browser plugin that allows you to shop at 800+ online retailers and receive crypto cashback on purchases ( dai one of a few rewards), will do a promo with us to drive awareness to their 2mil users that dai is a good “stable” asset to choose for rewards. They will promote via email and in-app and us in Twitter and forum.  Tweet of the Week   twitter.com    MakerDAO Growth @MakerGrowth    🪙 Dai is a multi-chain currency, we all know.  🧐 But, does it have a strategy for dominating that paradigm?  🌐 It's time to talk about the Maker Multichain Strategy, the path to bring Dai towards DeFi growth.  1/14 https://t.co/NX9SNIrvAv   3:43 PM - 16 Nov 2021           38                7            ",
                    "links": [
                        "https://twitter.com/MakerGrowth/status/1460634652830580744",
                        "https://twitter.com/MakerGrowth/status/1460634652830580744",
                        "https://twitter.com/MakerGrowth/status/1460634652830580744",
                        "https://t.co/NX9SNIrvAv",
                        "https://twitter.com/MakerGrowth/status/1460634652830580744",
                        "https://forum.makerdao.com/t/growth-core-unit-offsite/13364/8",
                        "https://forum.makerdao.com/t/under-construction/12274/8",
                        "https://forum.makerdao.com/t/maker-relay-ep-72-en-espanol/11799",
                        "https://forum.makerdao.com/t/maker-relay-ep-72/11773"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.691558441558442
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/02/2022-14:45:45",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-weekly-update-nov-19-26/11840",
            "title": "Growth CU weekly update: Nov 19-26 ",
            "index": 11840,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "12",
                    "time": "26/11/2021-12:07:13",
                    "content": " General Updates  D3M Together with @Protocol-Engineering  and @Risk-Core-Unit , we started conversations with Aave to integrate D3M in the Aave Arc and AMM markets. We will begin with Arc, and for that, before proceeding with the signaling and the proposals, we have to define with Fireblocks the way to whitelist D3M in that market. Also, we started working with Compound. They will be putting up a signal request in the Maker forums to confirm that governance wants to proceed.  Institutional interest in Maker Recently @Hajive participated in the Digital Assets Workgroup, organized by the London Stock Exchange, explaining Maker and how TradFi companies can work together with the DeFi ecosystem. Although we know these processes take a while, we want to be prepared for it, and so, we created a workgroup between GRO, @Real-World-Finance , @collateral-core-unit , @SES-Core-Unit , and @gov-comms-core-unit  to improve the onboarding process of these institutional assets.   Star of the week   CoinDCX - an Indian unicorn exchange will list DAI by mid-December. They will run a few marketing campaigns promoting DAI between their users  Tweet of the Week   twitter.com    MakerDAO Growth @MakerGrowth    😎 This is one of the coolest vaults in MakerDAO: GUNIV3DAIUSDC1-A from @gelatonetwork  It has a very long name with a bit (very) complicated explanation, but don't panic, we are here to explain it to you  Why is GUNIV3DAIUSDC1-A so important and how does it work? 🧵👇  1/16 https://t.co/Rqc5OCQlFG   5:11 PM - 23 Nov 2021           67                20            ",
                    "links": [
                        "https://twitter.com/MakerGrowth/status/1463193388564504580",
                        "https://twitter.com/MakerGrowth/status/1463193388564504580",
                        "https://twitter.com/MakerGrowth/status/1463193388564504580",
                        "https://twitter.com/gelatonetwork",
                        "https://t.co/Rqc5OCQlFG",
                        "https://twitter.com/MakerGrowth/status/1463193388564504580",
                        "https://forum.makerdao.com/t/maker-relay-ep-73-en-espanol/11900",
                        "https://forum.makerdao.com/t/maker-relay-ep-73/11882",
                        "https://forum.makerdao.com/t/under-construction/12274/8"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8343750000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/02/2022-12:08:15",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-weekly-update-dec-3-10/12144",
            "title": "Growth CU weekly update: Dec 3-10 ",
            "index": 12144,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "3",
                    "time": "10/12/2021-13:42:04",
                    "content": " General Updates  Institutions and DeFi Fact: more institutions are looking for crypto/DeFi. As mentioned in previous updates, this interest comes with a considerable challenge from both sides: For the institutions to learn about decentralized organizations and for DAOs to find a way to close agreements with institutions. Those challenges have been the trigger for new services of companies that can act as a bridge to work with both worlds. In Growth, we are helping those bridge companies to understand the power of Maker vaults and DAI. One example is Nexo, which recently announced its partnership with Fidelity to Offer Products for Institutional Investors. But we also are working with other companies like Valk, a token issuance platform servicing ~ working with 80 institutional clients - which will be integrating Maker vaults in Jan as part of their DeFi access product.  Collaterals (PSM) as Partners - The Gemini case. Attention NFT lovers: Nifty Gateway has added a payment option to use your Gemini exchange account balance to purchase nfts on Nifty Gateway. Dai, USD and GUSD are the first tokens enabled to use toward your nft purchases (they are then converted to eth or usd for settlement on Nifty Gateway).  twitter.com    MakerDAO Growth @MakerGrowth    ⚡ It's time to buy more stuff with Dai ⚡  🔵 It's time to talk about @Gemini Pay, @niftygateway and Dai 🔵  👇 How to buy your preferred NFT on @niftygateway with a gasless and fast Dai payment 👇 https://t.co/FhlsgH58Cc   12:18 PM - 10 Dec 2021           5                1             Multichain strategy on LatAm Before our L2 strategy and with the craziness of gas fees, we decided to work on a solution for our partners in Latam, where DAI, as you know, is used as a savings asset and also for micropayments. With the appearance of USDT-TRON or BUSD-BSC we had to do something to help our community to keep using DAI. And that’s why we started working with exchanges and wallets in the region on the DAI-multichain and started teaching them about Polygon. With the Maker multichain strategy, we are planning to push our L2 initiative there, making this part of the Maker plan.  Soon. Usually, I don’t post about what’s work in progress, but I have seen people asking about it:  Messari just launched a new tool/feature called “Governor” that aggregates Dao discourse and mainly proposals with sentiment tracker on current proposals. They said Maker will be added q1. Coinbase Custody said they will prioritize adding Vote Delegation in Q1.    Star-s of the week   Flexa, a crypto payments app that partners with Gemini have a new integration with Regal Movie theaters, a large movie theater chain in the US, which allows for movie purchases with Dai and all their supported tokens. Swarm Markets : Now live with their permissioned & regulated ( by Germany BaFin ) DEX. DAI features extensively in their initial pools.  Tweet of the Week   twitter.com    MakerDAO Growth @MakerGrowth    🌟 The State of the Dai 🌟 Dec 07 2021  📈📉 No matter the color of the market, Dai and MakerDAO got it great in the last couple weeks.  👇 Let's see what we are talking about:  1/13 https://t.co/jDk5Tm5vRe   4:46 PM - 7 Dec 2021           29                9            ",
                    "links": [
                        "https://valktech.io/",
                        "https://twitter.com/MakerGrowth/status/1469280391852875777?s=20",
                        "https://twitter.com/MakerGrowth/status/1469280391852875777?s=20",
                        "https://twitter.com/MakerGrowth/status/1469280391852875777?s=20",
                        "https://twitter.com/Gemini",
                        "https://twitter.com/niftygateway",
                        "https://twitter.com/niftygateway",
                        "https://t.co/FhlsgH58Cc",
                        "https://twitter.com/MakerGrowth/status/1469280391852875777?s=20",
                        "https://flexa.network/",
                        "https://swarm.markets/",
                        "https://twitter.com/MakerGrowth/status/1468260746010058755",
                        "https://twitter.com/MakerGrowth/status/1468260746010058755",
                        "https://twitter.com/MakerGrowth/status/1468260746010058755",
                        "https://t.co/jDk5Tm5vRe",
                        "https://twitter.com/MakerGrowth/status/1468260746010058755",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-december-2021/12692"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.663033395176252
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/03/2022-13:42:41",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "348"
}