{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-maker-brand-some-strategic-thoughts/14725",
            "title": "The Maker Brand - Some strategic thoughts ",
            "index": 14725,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "discussion",
                "gro-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#1",
                    "likes": "16",
                    "time": "21/04/2022-13:48:54",
                    "content": "Adding to @MarianoDP’s brand post I would like to share some thoughts.  TL;DR  Crypto market is still developing We don’t have first mover advantage  It is in the tech first stage   We must re-build the Maker brand Crypto market is driven by tech savvy investors of a certain demographic To progress, the crypto market needs to overcome fear and lack of understanding  Jargons and new terminology are causing lack of understanding People don’t trust because of lack of insurance   Whilst there’s a lot of information out there about crypto not a lot is out there about defi Maker is the leader in owned Stablecoin lending but there is a huge lack of awareness around crypto borrowing and lending  We have to onboard entrepreneurs in the right markets within the growth audience and do this by owning the “borrow crypto” space.  We do this by  Creating lots of content Remove barriers from joining the ecosystem Create partnership Become socially responsible  Promote diversity Champion entrepreneurship Serve the underserved     To further develop and deliver on this strategy we need research, lots and lots of research Determine the role of channels and content Define measurement framework   A very important point Mariano made in his post,  We benefited from the first moving advantage in Defi, which helped us develop a reputation. However, our reputation has been fading over time, leaving room for the competition to take more space in the various media channels and leaving very limited visibility for MakerDao, although it is the oldest DAO in the whole crypto industry.  Building from this point, in 2005 Harvard Business School published The Combined Effects of Market and Technological Change, looking at how relationship between market and technology can impact first mover advantage.   Maker falls in the “The Technology Leads” category. With this in mind, we must start by looking at what drives the larger Crypto market.  Context “The technology leads” situation means we are still in the early market. If we layer on top the Diffusion of Innovation curve, it becomes quite clear where we are in our journey.  904×504 69.8 KB  Each of the five groups represent a unique psychographic profile i.e. a combination of psychological and demographic traits. Hence, marketing to these groups requires completely different strategies from those of other groups. By better understanding the differences among the groups, we can better target all these consumers with the right marcomms approach. So, what is stopping the bridge forming over the chasm? The Early Majority are pragmatists, they share some of the Early Adopters’ ability to relate to technology. However, they are driven by a strong sense of practicality. They know that many inventions end up as passing fads. Consequently, they are content to wait and see how other customers are faring with the technology before investing in it themselves. They want to see well-established references before investing substantially. Because there are so many people in this segment (roughly 34%), winning these people over is fundamental for substantial growth. As such, Lack of understanding and fear is holding people from dipping their toes in decentralised finance.  Fear and greed index by Crypto Dashboard - Alternative.me measures current sentiment index as “fear”.   Graphical user interface, application Description automatically generated1572×730 160 KB   In research of the UK population, 20% said “it is too complicated to understand” and 31% said “it is too risky”.   Chart, bar chart Description automatically generated1600×792 151 KB   31% or people in the US said they don’t want to invest in cryptocurrency because of worries around hacking and fraud Close to $2.5bn were stolen from DeFi protocols in 2021  If the above is true as per the statistics, we must ask and answer 1. Why is there lack of understanding? Too many jargons, too technical, not knowing where to start? 2. What is the cause of the fear? Initial ICO fraud for those who tried, lack of insurance, no real example of success stories? Fear is driven by the unknown. If we look at crypto. com and coinbase as an example, even though coinbase has been around longer, crypto.com is taking up more market share. Crypto. com only recently began operating in the U.S. but already has volumes on par with Coinbase. The group has splashed out on a significant marketing campaign that has included Super Bowl ads and buying the naming rights for the L.A. Lakers’ home stadium, previously the Staples Center and now the Crypto.com Arena. Quite clear that crypto.com is trying to reach more people by creating associations with known names out in the real world. Whilst the efforts by crypto.com is paying off to a degree, there are some obvious problems with their approach. If you head over to crypto.com homepage you will see a familiar face. What’s interesting is if you read through the comments section on YouTube, it is filled with negative comments! It is quite easy to unpack an ad like this, get a likeable celebrity to speak with the masses. The obvious issue with this ad is, there isn’t a clear message, the ad isn’t targeted and is speaking to the mainstream market that isn’t ready and won’t be for a long time. This lack of focus in comms is dangerous. The comments suggest that this ad is causing the chasm to widen instead of being closed. So, who are the right people we need to reach out to and how do we speak to them?  Audience I have linked some more researches at the bottom that gives interesting stats on the current and the crypto-curious audience, but here’s a snapshot of some key stats  86% of Americans know at least a little about crypto as of September 2021 The average crypto investor earns around $111,000 per year In the US the average age of current investors is 38 with 26% female and 74% male. 52% live in urban areas and 26% in small town and rural areas In the US the average of crypto-curious is 44 with 53% female and 47% male. 46% live in urban areas and 35% in small town and rural areas India is currently the biggest market by ownership for cryptocurrency, followed by the US The most common reason to invest in crypto is for long-term returns. Coinbase is the most popular trading app for cryptocurrencies among consumers, but Binance is more likely to attract institutional investors. In the UK cryptocurrency users had increased by 600% since 2018, when just 3% of the world’s population owned Cryptocurrency  Nigeria has the biggest volume of Google search volume regarding “Cryptocurrency”.   Strategic context Taking the above into consideration let’s look at the DeFi space in the context of lending to understand the challenge and opportunity. DeFi pulse ranks Maker as the dominant lender in the market when it comes to owned stablecoin.  Graphical user interface, application Description automatically generated1600×432 74.6 KB  Unfortunately, being the dominant leader doesn’t mean guaranteed success if there isn’t enough awareness of what Maker can offer people. A quick look at the number of Google results shows the lack of DeFi content. Number of sites on Google is a good indicator of how much interest there is in the market, close to 10bn pages about general cryptocurrency compared to 1m pages about cryptocurrency borrowing.  Chart, bar chart Description automatically generated1600×846 88.6 KB  The lack of information available is both a challenge and an opportunity for Maker. Through high quality content MakerDAO can own the “borrow cryptocurrency” space.  What is the Job to be done If I can be brave, I would say it Get tech savvy investors from investing in TradFi and early-stage crypto investment to seriously consider Maker as a long-term investment and start-up vehicle by removing fear and uncertainty through hand holding that will generate confidence To deliver on the GFTB, we can consider the below strategy as a though point.  Strategy Onboard entrepreneurs in the growth markets within the growth audience and do this by owning the “borrow crypto” space.  Tasks So, what are our tasks: as an example, if the job to be done is to clean the house, then tasks are to identify which areas need cleaning first, clean the floor, tidy up the bedroom, do the dishes etc. In our context, what are these? Off the top of my head,  research digging deep into the target audience and fully understand their traits create more educational content based on the audience’s needs, attitude and motivation de-mystify DeFi terminologies by comparing to their traditional finance counterpart terminologies create an onboarding plan for the growth audiences, where should they start, who should they speak with create sense of belonging by have a voice in global issues that matter to people  Diversity and inclusion Represent the underrepresented Serve the underserved    AND DO ALL THESE WHILST NEVER FORGETTING THE ESSENCE OF A DAO. Going from here we need to focus on the research, lots of and lots of it. And develop an activation plan. This is a general framework which can be adapted for Maker’s marcomms purposes. For anyone interested here’s the workbook.  904×978 84.9 KB  These are just some starting thoughts and @MarianoDP’s proposal to build a brand team shows the need for a clear strategy to succeed. The real challenge will be working out how we deliver on the marcomms promise that serves well not just the Maker brand, but rallies the community to embrace a different way of communicating with the market. Whilst the big focus for marcomms will be on bringing clarity and providing assurances, trust and sense of safety to those who will become Maker’s end users, we need to create a strategy that runs in tangent which is internally focused (perhaps a topic for another post). It’ll be great to hear everyone’s thoughts. With that, quick thanks to @M_C @Retro @wouter and @Lenkla for the warm welcome to the MakerDAO community. Resources:  https://www.statista.com/statistics/655511/leading-virtual-currencies-globally-by-purchase-volume/ bitcoin news binance institutional - Brave Search US Consumer Crypto Survey: Almost 50% Invested in Cryptocurrencies This Year – Featured Bitcoin News 15 Alarming Cyber Security Facts and Stats | Cybint Cryptocurrency Market Size, Share and Analysis | Forecast - 2030 16% of Americans say they have invested in, traded or used cryptocurrency | Pew Research Center https://triple-a.io/crypto-ownership/ Global Crypto User Index - 2021 | Binance Research Bitcoin Price Analysis: Recapping a Record-Setting February for Crypto • Number of crypto coins 2013-2022 | Statista  Cryptocurrency App Revenue and Usage Statistics (2022) - Business of Apps*  ",
                    "links": [
                        "https://hbr.org/2005/04/the-half-truth-of-first-mover-advantage",
                        "https://alternative.me/crypto/",
                        "https://piplsay.com/the-growing-crypto-universe-how-interested-are-americans/",
                        "https://blog.chainalysis.com/reports/2022-crypto-crime-report-introduction/",
                        "https://www.barrons.com/articles/coinbase-coin-market-share-trading-volumes-51649779978",
                        "http://Crypto.com",
                        "http://crypto.com",
                        "http://crypto.com",
                        "http://crypto.com",
                        "https://crypto.com",
                        "https://crypto.com",
                        "https://www.youtube.com/watch?v=9hBC5TVdYT8",
                        "https://www.gemini.com/state-of-us-crypto",
                        "https://www.gemini.com/state-of-us-crypto",
                        "https://www.gemini.com/state-of-us-crypto",
                        "https://www.gemini.com/state-of-us-crypto",
                        "https://triple-a.io/crypto-ownership/",
                        "https://www.businessofapps.com/data/cryptocurrency-app-market/",
                        "https://www.finder.com/uk/cryptocurrency-statistics#how-many-people-in-the-uk-own-cryptocurrency",
                        "https://trends.google.com/trends/explore?q=Cryptocurrency",
                        "https://www.defipulse.com/",
                        "https://docs.google.com/spreadsheets/d/1ezcbJXzSVTOkQBGBgQwUnaHBEod3mwlf/edit?usp=sharing&ouid=115005301951370477203&rtpof=true&sd=true",
                        "https://forum.makerdao.com/t/makerdao-intangibles-for-a-better-dao/14860",
                        "https://www.statista.com/statistics/655511/leading-virtual-currencies-globally-by-purchase-volume/",
                        "https://search.brave.com/search?q=bitcoin%20news%20binance%20institutional",
                        "https://news.bitcoin.com/us-consumer-crypto-survey-almost-50-invested-cryptocurrencies/",
                        "https://www.cybintsolutions.com/cyber-security-facts-stats/",
                        "https://www.alliedmarketresearch.com/crypto-currency-market",
                        "https://www.pewresearch.org/fact-tank/2021/11/11/16-of-americans-say-they-have-ever-invested-in-traded-or-used-cryptocurrency/",
                        "https://triple-a.io/crypto-ownership/",
                        "https://research.binance.com/en/analysis/global-crypto-user-index-2021",
                        "https://markets.businessinsider.com/currencies/news/bitcoin-price-analysis-february-recap-record-setting-cryptocurrency-2021-2-1030131679",
                        "https://www.statista.com/statistics/863917/number-crypto-coins-tokens/",
                        "https://www.businessofapps.com/data/cryptocurrency-app-market/",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-4/14770",
                        "https://forum.makerdao.com/t/weekly-relay-april-26-may-2-2022/14939",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-abril-02-de-mayo-de-2022/14970",
                        "https://forum.makerdao.com/t/makerdao-intangibles-for-a-better-dao/14860",
                        "https://forum.makerdao.com/t/informal-poll-fund-a-professional-media-production-company-as-a-core-unit-that-will-produce-content-for-the-benefit-of-makerdao-e-g-content-marketing-to-grow-dai-supply-and-expand-makerdao-s-fanbase/14641/40"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.785060229625447
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#2",
                    "likes": "11",
                    "time": "21/04/2022-19:09:27",
                    "content": "Thanks for this Mamun! I pretty much agrees with everything you wrote. In fact, we are working on some of these things as we speak and we are testing our waters on how we can spread messages and updates about MakerDAO, for example recently we use a PR Agency to communicate about the Starknet Bridge, and it was a success! We are just getting started  Imagine what we can do once we have a Brand position and a clearly defined Job to be done. Please drop me a private message with your telegram handle, I want to continue this discussion with you.  Decrypt - Ethereum’s MakerDAO to Launch on StarkNet, Promises 10x Lower Gas Costs  CoinDesk - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain  The Block - MakerDAO to integrate StarkNet to cut DAI transaction costs  CoinNews - MakerDAO to integrate StarkNet to cut DAI transaction costs  Yahoo Finance - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain  CoinTelegraph - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin  Markets Insider - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   LatestCryptoNews.com - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin   Bitcoin.com - Makerdao Plans to Integrate Ethereum L2 Solution Starknet to Lower DAI Transaction Costs  CryptoBriefing - MakerDAO’s DAI Heads to Ethereum Layer 2 StarkNet   Investing.com - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin  CoinTelegraph Espanol - MakerDAO se implementa en la red de capa 2 StarkNet para mejorar las funciones de la moneda estable DAI  BitcoinEthereumNews - Makerdao Plans to Integrate Ethereum L2 Solution Starknet to Lower DAI Transaction Costs – Technology Bitcoin News  Technical Ripon - MakerDAO Deploys StarkNet on Layer-2 Network to Enhance DAI Stablecoin Features  InvestoSignals - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin  Coinolik - MakerDAO, İşlem Maliyetlerini Azaltmak İçin StarkNet’i Entegre Edecek  BusinessFast - Makerdao Plans to Integrate Ethereum L2 Solution Starknet to Lower DAI Transaction Costs  Coinphony - DAI di MakerDAO si dirige verso Ethereum Layer 2 StarkNet  LatestCrytpoNews - DeFi OG Protocol MakerDAO Announces April 28 StarkNet Integration For Cheaper DAI Transactions  Yahoo Finanzas - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain  Yahoo Finaças - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain  The Defiant - MakerDAO Steps Up Multichain Strategy With StarkNet Rollout  Coindesk - Market Wrap: Bitcoin Fades From $42K, Alts Still Ahead as ApeCoin Pumps  Coindesk | The Hash - MakerDAO Moves Toward Multi-Chain With StarkNet Bridge  CoinTelegraph Brazil - MakerDAO implanta na rede de camada 2 StarkNet para aprimorar as funções da stablecoin DAI  Blockchain Reporter - MakerDAO To Integrate Ethereum L2 Solution Starknet  Coin68 - MakerDAO integrates StarkNet to cut DAI transaction fees, ambition to go multichain   Micky.com - Ethereum’s MakerDAO to deploy on StarkNet, guarantees 10x lower fees  BlackCryptoNews - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain  BlackCryptoNews - ETHEREUMMakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin   Investing.com Turkey - Kripto para sektöründe günün öne çıkan haberleri  AIThority - MakerDAO Accelerates Multichain Strategy with StarkNet Integration  Portal Do Bitcoin - Integração do MakerDAO a camada do Ethereum promete taxas dez vezes menores  Crypto Noticias - Podrás usar DAI con menos comisiones en Ethereum gracias a esta integración de MakerDAO   Ihodl.com - MakerDAO Integrates StarkNet’s L2 Solution   ",
                    "links": [
                        "https://www.coindesk.com/tech/2022/04/20/ethereum-defi-staple-makerdao-adds-starknet-bridge-in-first-step-toward-multi-chain/",
                        "https://www.theblockcrypto.com/post/142641/makerdao-starknet-integration-ethereum-layer-2",
                        "https://thecoin.news/articles/makerdao-integrate-starknet-cut-dai-transaction-costs-1650450861805",
                        "https://fr.finance.yahoo.com/news/ethereum-defi-staple-makerdao-adds-103000478.html",
                        "https://cointelegraph.com/news/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin",
                        "https://markets.businessinsider.com/news/currencies/ethereum-defi-staple-makerdao-adds-starknet-bridge-in-first-step-toward-multi-chain-1031367427",
                        "http://LatestCryptoNews.com",
                        "https://latestcrypto.news/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin/",
                        "http://Bitcoin.com",
                        "https://news.bitcoin.com/makerdao-plans-to-integrate-ethereum-l2-solution-starknet-to-lower-dai-transaction-costs/",
                        "https://cryptobriefing.com/makerdaos-dai-heads-to-ethereum-layer-2-starknet/",
                        "http://Investing.com",
                        "https://www.investing.com/news/cryptocurrency-news/makerdao-deploys-on-layer2-network-starknet-to-enhance-functions-of-dai-stablecoin-2806947",
                        "https://es.cointelegraph.com/news/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin",
                        "https://bitcoinethereumnews.com/bitcoin/makerdao-plans-to-integrate-ethereum-l2-solution-starknet-to-lower-dai-transaction-costs-technology-bitcoin-news/",
                        "https://www.technicalripon.com/makerdao-deploys-starknet-on-layer-2-network-to-enhance-dai-stablecoin-features/",
                        "https://investosignals.com/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin-2/",
                        "https://www.coinkolik.com/makerdao-dai-islem-maliyetlerini-azaltmak-icin-starkneti-entegre-edecek/",
                        "https://www.businessfast.co.uk/makerdao-plans-to-integrate-ethereum-l2-solution-starknet-to-lower-dai-transaction-costs/",
                        "https://coinphony.com/it/dai-di-makerdao-si-dirige-verso-ethereum-layer-2-starknet-32757/",
                        "https://latestcrypto.news/defi-og-protocol-makerdao-announces-april-28-starknet-integration-for-cheaper-dai-transactions/",
                        "https://es.finance.yahoo.com/news/ethereum-defi-staple-makerdao-adds-103000478.html",
                        "https://br.financas.yahoo.com/news/ethereum-defi-staple-makerdao-adds-103000478.html",
                        "https://thedefiant.io/makerdao-l2-starknet/",
                        "https://www.coindesk.com/markets/2022/04/20/market-wrap-bitcoin-fades-from-42k-alts-still-ahead-as-apecoin-pumps/",
                        "https://www.coindesk.com/video/the-hash-on-cdtv-clips/makerdao-moves-toward-multi-chain-with-starknet-bridge/",
                        "https://cointelegraph.com.br/news/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin",
                        "https://blockchainreporter.net/makerdao-to-integrate-ethereum-l2-solution-starknet/",
                        "https://coin68.com/makerdao-tich-hop-starknet-de-cat-giam-phi-giao-dich-dai/",
                        "http://Micky.com",
                        "https://micky.com.au/ethereums-makerdao-to-deploy-on-starknet-guarantees-10x-lower-fees/",
                        "https://blackcryptonews.com/2022/04/20/ethereum-defi-staple-makerdao-adds-starknet-bridge-in-first-step-toward-multi-chain/",
                        "https://blackcryptonews.com/2022/04/20/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin/",
                        "http://Investing.com",
                        "https://tr.investing.com/news/cryptocurrency-news/kripto-para-sektorunde-gunun-one-ckan-haberleri-2293887",
                        "https://aithority.com/technology/blockchain/makerdao-accelerates-multichain-strategy-with-starknet-integration/",
                        "https://portaldobitcoin.uol.com.br/integracao-do-makerdao-a-camada-do-ethereum-promete-taxas-dez-vezes-menores/",
                        "https://www.criptonoticias.com/tecnologia/podras-usar-dai-menos-comisiones-ethereum-gracias-integracion-makerdao/",
                        "http://Ihodl.com",
                        "https://es.ihodl.com/technologies/2022-04-21/makerdao-integra-solucion-l2-starknet/",
                        "https://forum.makerdao.com/t/informal-poll-fund-a-professional-media-production-company-as-a-core-unit-that-will-produce-content-for-the-benefit-of-makerdao-e-g-content-marketing-to-grow-dai-supply-and-expand-makerdao-s-fanbase/14641/36",
                        "https://forum.makerdao.com/t/mip40c3-sp70-modify-growth-core-unit-budget-gro-001/15102/8"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.891666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#3",
                    "likes": "4",
                    "time": "21/04/2022-20:25:00",
                    "content": "Well, then let’s hit it hard with smart marketing and Maker content creation for the inexperienced masses  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.704365079365079
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "3",
                    "time": "21/04/2022-20:35:47",
                    "content": "let’s go, the people need to know what’s going on! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#6",
                    "likes": "1",
                    "time": "22/04/2022-12:51:02",
                    "content": " We are just getting started  Imagine what we can do once we have a Brand position and a clearly defined Job to be done.   DM sent. This is fantastic work! And good to see this is already in motion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#7",
                    "likes": "2",
                    "time": "22/04/2022-18:25:18",
                    "content": "Excellent the information extension, without a doubt it is necessary the understanding of these topics to be something mainstream and of consumption. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#8",
                    "likes": "1",
                    "time": "22/04/2022-20:08:49",
                    "content": "    Alefcripto:  the understanding of these topics to be something mainstream and of consumption.   One hundred percent this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rozotadi",
                    "index": "#9",
                    "likes": "3",
                    "time": "26/04/2022-19:23:30",
                    "content": "This is exactly what I want to contribute and grow with Maker on! Let’s get a move on!!! Diving deeper on the workbook and references! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.814697265625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#10",
                    "likes": "1",
                    "time": "26/04/2022-20:00:25",
                    "content": "I love the enthusiasm ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#11",
                    "likes": "2",
                    "time": "26/04/2022-20:11:37",
                    "content": "Wow, something strong is brewing in the background.  Just what we need. I think it’s going to be huge. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#12",
                    "likes": "0",
                    "time": "25/07/2022-20:11:54",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}