{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/follow-up-on-governance-call-mip-discussion-alternative-perspective-on-domain-teams/2005",
            "title": "Follow up on Governance Call MIP Discussion - alternative perspective on domain teams ",
            "index": 2005,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#1",
                    "likes": "1",
                    "time": "17/04/2020-04:03:37",
                    "content": "I am moving towards a perspective which views the various domains of Maker as networks rather than specific teams. What/Why? My purpose in doing so is for continued domain autonomy (autonomy as in resilience and ability to independently adjust) in task completion/coordination/incentivisation as well as limiting mkr voter exhaustion by keeping votes down to the critical aspects of domain work (budget and performance). In this perspective, MKR governance elects “Domain Facilitators” rather than “domain teams and/or EPCs” who will be responsible for communicating goals/expectations, negotiating budgets, publicizing reports/updates and organizing workers within their domain. I hypothesize that striving towards those patterns will increase the bandwidth of each group thus Maker collectively. Over time that role would naturally evolve into groups of facilitators or other alternatives to handle increased complexity. Each domain requires different sorts of expertise, which implies that different modes of compensation and coordination will be better utilized than one overarching paradigm. Those interested in employing their expertise might be turned off by the additional friction of formally applying to MKR governance and would likely rather coordinate personally. In this facilitator paradigm all the interested worker would need to do is coordinate with the domain facilitator (or someone else within the network connected to the facilitator) to nail down compensation and task details/scope. As domains develop they will need to create their own governance paradigms to withstand increasing task/resource volume. How to deal with that issue should be up to them (think unions). This is an obvious consequence of creating a Decentralized Autonomous Organization with global ambitions. The various subsystems develop their own complexities and structures; nethertheless they will continue to be influenced by and interact with MKR governance.  “Coordination is not a given in policy networks, but rather, as Bevir has put it, ‘both a driving force of governance and one of its goals’ (2009: 56). This is a matter of what we make of network interaction. Simply put, the more the participants in policy networks are believed to be able to coordinate their own interactions the less we need to worry about coordination as a condition for interaction, and the less we need to worry about ‘network management’, or ‘metagovernance’, and whether and how such practices might involve the state.” (Bevir, The Sage Handbook of Governance)  In my view the MIPs process is hyper focused on metagovernance without engaging with the real difficult questions like how do we compensate/judge work done for the protocol and how do we handle budgets (relates to the recent discussions on how to handle the surplus buffer). Here I just wanted to focus on domains, but I can give my thoughts concerning governance process in Maker in other posts. How Could this Happen? This part is easier to adjust and other variations could be more ideal, but basically we could have a Signaling nomination thread where anyone can nominate a Facilitator for each domain. In those signaling threads negotiations would take place, where nominated domain facilitators (who accept and want to fulfill this role) present their perspectives, goals and estimated budgets. The community (anyone who’s interested) could criticize and question these aspects. This might also be a decent mechanism to lure out MKR holders to participate in these negotiations. Right now the foundation pays these expenses, and currently the protocol does not have a big surplus. Even if the foundation pays the budgets for the immediate future, having public negotiations and awareness of budget is a huge step. This isn’t a proposal just another way of looking at the situation. Implicit in all this is an understanding of communication/coordination in complex self organizing systems. Parts of this paper are fascinating in that regard: https://www.researchgate.net/publication/264440930_Leadership_for_self-organisation_complexity_theory_and_communicative_action … Side comment: I have been thinking about Rune’s analogy of MKR holders as the political class with voting power (senate, house of reps) and domain workers as the “civil servants” who actually do the work outlined in BIlls and whatnot. This view does not map well to the Maker system as far as I have analyzed it. Senators are suppose to be public servants, and not have a financial stake in the government (when they do we call it corruption…). MKR holders profit from the protocols growth and have an large financial stake. Lets not delude ourselves of that reality. We should be discussing what is a “fair” distribution of that value between those who commit capital and those who build/maintain/grow the protocol. And why should MKR holders have complete control of the value generated by the protocol? These more fundamental or philosophical question are directly relevant to long term sustainability of the system. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666435185185186
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/04/2020-06:47:58",
                    "content": "Great post @MItote This whole concept that Maker has networks/positions to fill and should seek as many different ‘bidders’ as possible falls into your network idea above. My point is that we don’t want just 1 entity carrying out a function but honestly want at least 1 redunant backup/check on each function as well.   I maintain a decentralized system will likely have a higher operational cost structure because of this. I have also posted elsewhere that I believe the model to access Maker operations should be one where MKR in governance ‘acts’ by staking, and bonding to get access to these controls in exchange for ‘payment’/‘reward’ for performing them in accordance with the wishes of governance. The idea of having MKR pledge by stake/bond etc. in effect is taking one step into governance directly since the MKR put up in the system as ‘pledge’ for MKR operational processing then gets queued in for punishment/reward and then release driving an addition reason for people not just to hold MKR but for MKR to be needed and used to drive the system and be rewarded for doing so. The idea of adding in additional MKR token classes to assist in achieving domain operations and enabling Domain Facilitators (Chiefs in their own rights) to actually be able to assume and carry out functions should have MKR and MKR token classes support them. I think one thing is distinctly different about MakerDAO and MKR as a combined finance/governance token is that it is precisely forcing the use of MKR to carry out the critical functions of MakerDAO IS required - simply because governance demands it.   What it appears people are unwilling to do is to kind of marry MKR to those actually performing important system functions.   Why?   Because they are the ones to be directly impacted by those operations. Personally when it comes to full community representation I honestly feel like vault and DAI holders need to be included in this.   If it is by encouraging them to purchase MKR - so be it - I personally would like vault owners to be given a NFT that represents the DAI minted, and DAI holders via DAI to participate within governance in some way.  (to be determined). I think there are serious implications to the whole MKR financial construct against governance.  It is like saying 1 USD = 1 VOTE and we know what kinds of implications to governance a financial basis has, but literally in corporations depending on the charter often times a single individual holds enough stock to basically drive the company.   Our issue here isn’t just that one single person could hold enough Maker to control the HAT, but that we probably won’t know who they are.   In a private company anonymity can legally be maintained, most certainly not in a public one.  And here we honestly don’t know much about our large MKR holders, much less how this composition is changing over time. Literally we have no direct connection between MKR financial/governance and those carrying out the work here and given governance at this point is totally driven by MKR financial it pretty much determines the system.   Now changing that - a whole other much longer topic. I appreciate the thinking on this and opening up a very important discussion topic. This whole point of functions being driven my networks - and how this is approached to create robust - redundant networks performing these functions is quite important especially given the fact that at some point all of the key and important Maker functions are being done by the Foundation will need to be shopped out to some function providing markets. Given where we are I believe those markets need to (1) Own MKR in something more than token quantity (2) Participate in governance with those MKR (3) Only MKR in governance and those backed by it can access the functions from a network perspective. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.838869047619047
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "1",
                    "time": "18/04/2020-15:39:26",
                    "content": "    MakerMan:  The idea of adding in additional MKR token classes to assist in achieving domain operations and enabling Domain Facilitators (Chiefs in their own rights) to actually be able to assume and carry out functions should have MKR and MKR token classes support them.   I’m not really sure what you mean exactly. Are you saying that, for example, the Oracle team should hold a different token OracleMKR instead of MKR? I’m not sure that this is a good idea. In my mind, the reason that the whole ecosystem holds the same token is to align economic interests. If we hold different tokens then economic interests could get misaligned, no? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.706730769230769
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#4",
                    "likes": "0",
                    "time": "18/04/2020-19:03:14",
                    "content": "    MakerMan:  My point is that we don’t want just 1 entity carrying out a function but honestly want at least 1 redunant backup/check on each function as well. I maintain a decentralized system will likely have a higher operational cost structure because of this.   Love it, degeneracy important in complex, evolving systems. (https://www.ncbi.nlm.nih.gov/pmc/articles/PMC61115/)     MakerMan:  I have also posted elsewhere that I believe the model to access Maker operations should be one where MKR in governance ‘acts’ by staking, and bonding to get access to these controls in exchange for ‘payment’/‘reward’ for performing them in accordance with the wishes of governance.   lets see if I can restate this and ask a couple specific questions because I am not entirely sure if I understand correctly. By “these controls” do you mean the various status or authorities we will presumably give domain workers? In this case someone would bond/stake MKR in support of a specific GF (thus minting them a GovernanceFaccilitator_MKR token) or would a GF would need to bond/stake MKR in order to access the controls and receive payouts/punishments?     MakerMan:  as ‘pledge’ for MKR operational processing then gets queued in for punishment/reward and then release driving an addition reason for people not just to hold MKR but for MKR to be needed and used to drive the system and be rewarded for doing so.   I guess at what point would bonded MKR be released? Once the worker moves on from MakerDAO? or after the completion of specific tasks, since much of the work is ongoing/subjective, completion seems murky.     MakerMan:  What it appears people are unwilling to do is to kind of marry MKR to those actually performing important system functions.   Yes! Everyone should be talking about this, how should MKR really operate in the system, nothing holds anyone to previous conceptual frameworks.     MakerMan:  Personally when it comes to full community representation I honestly feel like vault and DAI holders need to be included in this. If it is by encouraging them to purchase MKR - so be it - I personally would like vault owners to be given a NFT that represents the DAI minted, and DAI holders via DAI to participate within governance in some way. (to be determined).   Yes! They are massive stakeholders who contribute capital to the system just like MKR holders. Why is their contribution of capital not worthy of a voice in a so called decentralized governance (a voice which could be delegated just like mkr). I am also guessing the free rider issue is less prevalent, since they do not profit the same way as MKR holders, large vault and DAI owners have huge incentive to look out for themselves through securing their perception system stability. This may also help the voting power distribution problem since we could expand power beyound just MKR holders. One complication however is the likelihood that large MKR holders may also hold large vaults + DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.621930803571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/04/2020-21:50:00",
                    "content": "Yes.  I am saying dual token roles can add to base MKR governance functionality.   But not that it should dominate.   BTW  These other tokens probably would be NFTs that like the CONTRIB in /r/ethtrader simply are not transferrable and only earned by participating in the system in the various key roles. It is a way to measure work and build reputation effectively.   When coupled with MKR as I have posted elsewhere given the way governance works around MKR, I envision system actions being activated by actual MKR deposited into contracts (ideally from MKR in governance that if anywhere else in the system can still partiipate and vote in governance). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.319444444444445
                }
            ]
        }
    ]
}