{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rwa-resena-de-los-ultimos-dos-meses-actualizaciones-y-lo-que-viene/5272",
            "title": "RWA - Rese\\xc3\\xb1a de los \\xc3\\xbaltimos dos meses, actualizaciones y lo que viene ",
            "index": 5272,
            "category": [
                "Latin America"
            ],
            "tags": [
                "update",
                "real-world-finance",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "4",
                    "time": "22/11/2020-02:47:51",
                    "content": "Siguiendo la perspectiva de @mrabino1, la actualización del grupo de trabajo autónomo y del equipo de SC, se me ocurrió que sería una buena idea ofrecer una revisión sobre qué ha pasado en Maker con relación a los RWA (Activos del Mundo Real, Real-World Assets). El tono podría ser subjetivo. Estoy trabajando en RWA desde el 12 de septiembre (hace dos meses). Comenzó así:  Tengo tiempo para hacerme cargo de un proyecto, pero no estoy seguro de cuál es la mejor manera de colaborar. No creo que pueda hacer mucho con respecto a fundos de reservas estratégicas (MIP13 en progreso). ¿Hay algo que pueda hacer para avanzar los Activos del Mundo Real o eso se trabaja en la Fundación?  El plan era bastante sencillo, pensé: producir un contenido como lo había hecho para la evaluación de los smart contracts de EURS o de HUSD. Tomé una plantilla de evaluación de riesgo y… bueno… las cosas se complicaron más de lo previsto. Cuando se trata de criptoactivos, los temas principales son la liquidez y la volatilidad. Buena suerte conjugándolos con RWA. Mencionaré solo algunos elementos:   Asuntos legales 1: Los RWA usan contratos y la DAO no puede firmarlos. ¿Cómo deberíamos proceder? ¿Qué es riesgoso y qué no lo es? Procesos: Supongamos que haces un trato. ¿Cómo lo monitoreas? Cuando se trata de criptoactivos, esperas que el mercado haga el monitoreo y que el precio lo refleje. Esto no funciona con RWA. Centrifuge tiene muchísimos datos en la blockchain, pero no tenemos la infraestructura necesaria para monitorearlos. La construiremos en algún momento, pero por ahora tendremos que apañárnoslas con Google Sheets. NDA (Acuerdos de confidencialidad, non-disclosure agreements): Podría ser necesario que los evaluadores de riesgo firmen NDA. Ahora bien, ¿cómo rindes informes a la comunidad sobre algo que no puedes revelar? ¿Cómo trabajas en equipo en un colateral sin poder compartir documentos? La semana pasada nos dimos cuenta de que necesitamos una plantilla para NDA. Los NDA son firmados por los evaluadores de riesgo y en ellos recae la responsabilidad legal. Organización: Ahora que somos una especie de equipo con @williamr, @Philinje y @Primoz, necesitamos algunas herramientas (un Google Drive compartido, Trello) y necesitamos establecer reuniones de coordinación. Relaciones con la comunidad/gobernanza: Comunicarse y leer/analizar todos el contenido del foro relacionado con RWA (contenido que está multiplicándose rápidamente).  Por todo esto, @Philinje y yo estamos trabajando a tiempo parcial en subsidios para la incorporación de colateral; @williamr ha comenzado a dedicarse al asunto hace poco tiempo. Nos ayuda un grupo de trabajo cada vez más numeroso y también el facilitador de dominio de riesgo @Primoz. Queremos tener evaluaciones de riesgo de New Silver (@Philinje), ConsolFreight (@williamr) y 6S (yo) para fines de noviembre, principios de diciembre. Ya tenemos PaperChain en preparación. Tenemos charlas con OST-1 y con Blocksquare que ofrecen una visión alternativa sobre RWA. Aunque hacer crecer la lista de activos incorporados será la parte más visible, la más importante de todas será construir la infraestructura necesaria para monitorear esas inversiones, definir los procesos y redactar la documentación (y las MIPs). Como se dijo aquí, los RWA son pensados actualmente como relaciones B2B (tratamos con el originador del activo, un único prestatario por vault, con importante supervisión); por su parte los vaults de criptos son B2C (todo el mundo puede obtener un préstamo a partir del colateral). Los RWA se definen como ilíquidos y los criptoactivos como líquidos, fáciles de liquidar en el mercado. Los RWA son usualmente gestionados por un tercero (el originador del activo) mediante un SPV, de modo que podemos tener escala, diversificación y bajo riesgo (debido a la parte de equidad que absorbe las primeras pérdidas). Todavía queda muchísimo trabajo por hacer, quedan muchísimos desconocidos desconocidos; pero espero que podamos lograr algo de lo que enorgullecernos y, por ejemplo, tarifas de estabilidad anualizadas de 10M para finales del año que viene.  Esto es una traducción libre del artículo original en inglés por @SebVentures . Gracias a @blimpa y @Lozadaluis12 por la traducción. ",
                    "links": [
                        "https://forum.makerdao.com/u/mrabino1",
                        "https://forum.makerdao.com/t/working-group-autonomous-makerdao-update/5197",
                        "https://forum.makerdao.com/t/2020-year-end-schedule/5218",
                        "https://forum.makerdao.com/t/eurs-erc20-token-smart-contract-domain-community-assessment/3769",
                        "https://forum.makerdao.com/t/husd-erc20-token-smart-contract-domain-community-assessment/3770",
                        "https://forum.makerdao.com/t/discussion-legal-structures-of-makerdao/4390",
                        "https://forum.makerdao.com/t/poll-rwa-working-group-covenant-structure/4836",
                        "https://forum.makerdao.com/t/poll-rwa-working-group-risk-team-nda-and-governance/4880/6",
                        "https://forum.makerdao.com/u/williamr",
                        "https://forum.makerdao.com/u/philinje",
                        "https://forum.makerdao.com/u/primoz",
                        "https://forum.makerdao.com/u/philinje",
                        "https://forum.makerdao.com/t/collateral-onboarding-grants/4252",
                        "https://forum.makerdao.com/u/williamr",
                        "https://forum.makerdao.com/t/working-group-rwa-onboarding/4167",
                        "https://forum.makerdao.com/u/primoz",
                        "https://forum.makerdao.com/t/ns-drop-mip6-application-new-silver-drop-real-estate-backed-loans/3477",
                        "https://forum.makerdao.com/u/philinje",
                        "https://forum.makerdao.com/t/cf-drop-mip6-application-consolfreight-drop-tokenized-freight-shipping-invoices/2214",
                        "https://forum.makerdao.com/u/williamr",
                        "https://forum.makerdao.com/t/mip13c3-sp4-declaration-of-intent-commercial-points-off-chain-asset-backed-lender-to-onboard-real-world-assets-as-collateral-for-a-dai-loan/3914",
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215",
                        "https://forum.makerdao.com/t/ost-mip6-collateral-onboarding-application-by-uprets-real-estate-backed-digital-security/4438",
                        "https://forum.makerdao.com/t/real-estate-tokenization-protocol-a-pre-mip-discussion/5169",
                        "https://forum.makerdao.com/t/real-estate-tokenization-protocol-a-pre-mip-discussion/5169/15",
                        "https://forum.makerdao.com/t/rwa-last-2-months-review-updates-and-looking-forward/5225"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.104707792207792
                }
            ]
        }
    ]
}