{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-tools-04-otonomos-otoco-io-march-31st-16-00-utc/7174",
            "title": "Core Unit Tools #04: Otonomos + OtoCo.io - March 31st, 16:00 UTC ",
            "index": 7174,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "core-unit",
                "core-unit-tools",
                "pubcall-:-cu-tools",
                "entity-creation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "6",
                    "time": "24/03/2021-11:34:34",
                    "content": "     Time in your local-timezone format: 2021-03-31T16:00:00Z  Core Unit Tools #04 through   Otonomos + OtoCo.io  For the 4th episode of Core Unit Tools we’ll be having Daan and Han from Otonomos presenting OtoCo.io, which allows you to create legally valid Delaware or Wyoming LLCs by sending DAI to a company assembly smart contract. Otonomos “helps doers and investors in the crypto and blockchain community around the world form, fund and govern their legal entities, both offchain and onchain.” Are you setting up a Core Unit? This episode just might be of interest to you  As usual, @juan will be doing the hosting   Dial-in Details Zoom call Passcode: COREUNIT Alternatively, use this:  Meeting ID: 829 4277 3725 Passcode: COREUNIT One tap mobile +13017158592,82942773725#,*46651499# US (Washington DC) +13126266799,82942773725#,*46651499# US (Chicago) Dial by your location +1 301 715 8592 US (Washington DC) +1 312 626 6799 US (Chicago) +1 346 248 7799 US (Houston) +1 646 558 8656 US (New York) +1 669 900 9128 US (San Jose) +1 253 215 8782 US (Tacoma) Meeting ID: 829 4277 3725 Passcode: 46651499 Find your local number: Zoom International Dial-in Numbers - Zoom  Attn : @amyjung, @flipflopflapdelegate, @g_dip, @Planet_X, @Doo, @nadia, @layerzero, @SebVentures, @davidutro, @Kathleen_Chu, @lollike, @JerryAG , @seth, @derek ",
                    "links": [
                        "http://OtoCo.io",
                        "http://OtoCo.io",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-22-24-2021/7192",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-134-thursday-march-25-17-00-utc/7095/2",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-25-30-2021/7275",
                        "https://forum.makerdao.com/t/governance-and-general-partnership-liability/8863/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357606679035251
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#6",
                    "likes": "0",
                    "time": "01/04/2021-15:27:06",
                    "content": "Watch the replay: Core Unit Tools #04 *through: Otonomos + OtoCo.io - March 31st, 2021 - YouTube ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#7",
                    "likes": "1",
                    "time": "22/04/2021-16:26:15",
                    "content": " Core Unit Tools #04: Otonomos + OtoCo.io  March 31st, 2021  Agenda   00:00: Introduction with Juan Guillén  00:38: Otonomos + OtoCo.io with Dan and Haan   Video https://www.youtube.com/watch?v=y01e2ClZSiI  Introduction  Juan Guillén  Agenda and Preamble 00:00  Hi, everyone. Welcome to another session of Core Unit Tools. This one is number 4. Today I’m happily joined by a bunch of Maker people, and we have Otonomos and OtoCo, Han and Daan, that have joined us. Hopefully we can go through what they do, how they can help Core Units, and the important questions that anyone may have. For other episodes of Core Unit Tools, please check the forum.   Presentation (00:38)   Han, Daan, and  1920×1080 79.2 KB   09:31 — Juan Guillén: You just mentioned Wyoming and Delaware, but on your website it seems that you cover many more jurisdictions. I was wondering why. And the second questions that I have is, let’s say any US citizen wants to start providing services for the DAO. How would that work?   17:12 — Juan Guillén: Maybe you can cover a general example. Let’s say Frank wants to start a Core Unit in the US and wants to hire two more people, one in the US and one in Germany. What would he need to get this running?   19:47 — Juan Guillén: I guess that anything that has to do with dealing with the administration and the legal and the paperwork, he would have to take care of that — it’s not something that you…   23:05 — Nadia Álvarez: We have been talking with Opolis; they are a payroll system and they are able to pay others in crypto. One of their suggestions was that, even if you’re a contractor, you should create your own LLC. So, I was wondering: maybe these instruments of creating an LLC through you it’s not just for the Core Units but it also could be for every contractor that will provide services to that Core Unit, right?   25:44 — David Utrobin: My questions was about the breadth of services that your organization offers. I know you mentioned payroll, I know you mentioned the creation of the entity and presumably the destruction of the entity if it’s needed… I’m curious if you also offer things like accounting, creation of bank accounts, that kind of management — and just generally I’m curious about what else I might have missed   27:53 — David Utrobin: I’m just trying to wrap my head around how I would use your service, but then also… Because as a person who is proposing a Core Unit, I am cognizant of the fact that there’s going to… you know, probably be a need to set up some accounting, there’s going to be a need to set up payroll in some cases, maybe not in all cases…   1920×1080 91.9 KB   1920×1080 65.7 KB   1920×1080 55 KB   1920×1080 66.7 KB   1920×1080 66.2 KB   1920×1080 181 KB   1920×1080 75.4 KB   42:17 — Juan Guillén: Can you import a Gnosis wallet that’s been already created?   1920×1080 68.7 KB   45:16 — Frank Cruz: With regards to the operating agreement, when you’re creating an LLC, is there an opportunity for you… Say you have a partner and you’re going 50-50, or three partners and it’s 33-33-33. Is there a chance to put that in the operating agreement or no, you have to do it with the token deployment?   47:39 — Kim: When you were going through your example there, the part where everybody got a chance to see that PDF, are those PDFs available for people to review before we actually go through the process?   Closing Comment  Juan Guillén  Outro  If people have more questions or they are interested in starting something or doing a follow-up session with you, what’s the best way of reaching out? (50:35) Thank you for joining us. You’ll probably be hearing from some of us soon   Credits   @blimpa produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://www.youtube.com/watch?v=y01e2ClZSiI?t=0",
                        "https://youtu.be/y01e2ClZSiI?t=38",
                        "http://OtoCo.io",
                        "https://www.youtube.com/watch?v=y01e2ClZSiI",
                        "https://www.youtube.com/watch?v=y01e2ClZSiI?t=0",
                        "https://forum.makerdao.com/tag/core-unit",
                        "https://youtu.be/y01e2ClZSiI?t=37",
                        "https://youtu.be/y01e2ClZSiI?t=571",
                        "https://youtu.be/y01e2ClZSiI?t=1032",
                        "https://youtu.be/y01e2ClZSiI?t=1187",
                        "https://youtu.be/y01e2ClZSiI?t=1385",
                        "https://youtu.be/y01e2ClZSiI?t=1544",
                        "https://youtu.be/y01e2ClZSiI?t=1673",
                        "https://youtu.be/y01e2ClZSiI?t=2537",
                        "https://youtu.be/y01e2ClZSiI?t=2716",
                        "https://youtu.be/y01e2ClZSiI?t=2859",
                        "https://youtu.be/y01e2ClZSiI?t=3035"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5885989010989015
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "22/07/2021-22:27:08",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}