{
    "poll_list": [
        {
            "title": "Prioritising the onboarding of Real World Asset collateral in the short term - September 21, 2020",
            "index": "4075",
            "option": "Yes",
            "supporting_mkr": "32,801",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-should-real-world-asset-collateral-onboarding-be-prioritised-in-the-short-term/4075",
            "title": "[Signal Request] Should Real World Asset collateral onboarding be prioritised in the short term? ",
            "index": 4075,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#1",
                    "likes": "9",
                    "time": "10/09/2020-18:17:40",
                    "content": "Summary of the situation: The Maker community continues to search for quality collateral assets which can be added to stimulate DAI supply, ease pressure on the DAI peg, and generate liquidity and revenue for the protocol. Some of the new collateral types added since Black Thursday have been successful at this (e.g. USDC-A, WBTC-A which have 40mm and 46mm DAI outstanding against them, respectively), while others were underwhelming (e.g. KNC, ZRX, and MANA which collectively issue just over 500k DAI). As discussed on today’s governance call, even though a number of collateral types have already been greenlit by the community in governance polls, the domain teams have limited resources and a choice of prioritisation must be made about which collateral types to onboard first. To date, the domain teams have focused on liquid cryptoasset collateral types, since those are the most straightforward to onboard and at this stage the process for onboarding them has been well practiced. However, by aiming only for the “lowest hanging fruit”, we risk getting stuck working through an ever-growing list of ERC20 tokens, which while relatively easy to onboard, might not lead to substantial breakthroughs in scaling DAI supply. For a long time it has been broadly accepted in the Maker community that Real World Asset collateral is crucial to the long-term scaling of DAI, and that the ability to issue large amounts of DAI against Real World Asset collateral would address some of the main problems faced by MakerDAO today, such as the inability to quickly scale the supply side to ensure DAI stability. See e.g. the past forum discussions: [1], [2], [3]. There are currently a number of active MIPs, submitted recently, which propose to lay the foundations for adding novel Real World Asset collateral, which serve as starting point: [4], [5], [6], [7] Prioritising Real World Asset collateral: Perhaps it is the time to focus the community’s and the domain teams’ attention towards onboarding Real World Asset collateral. Assessment of Real World Asset collateral would likely require the full focus of the domain teams and would divert resources away from onboarding other collateral types, which is a trade-off that needs to be considered. The community may need to step up to assist the domain teams with the onboarding, due to the complexity involved and the limited resources of the nascent domain teams. Should MakerDAO domain teams prioritise the onboarding of Real World Asset collateral in the short term?     MakerDAO domain teams SHOULD prioritise the onboarding of Real World Asset collateral in the short term. MakerDAO domain teams SHOULD NOT prioritise the onboarding of Real World Asset collateral in the short term. Abstain     0 voters     Next steps: The poll will run for 1 week from the time that it is posted, i.e. the poll will end on 2020-09-17T18:00:00Z. If the outcome is that RWA collateral SHOULD be prioritised, the question will go to an on-chain governance poll. (note that the poll was initially scheduled to run for 2 weeks but was reduced to 1 week on 2020-09-11T11:20:00Z). [1] - Economics behind Real World Assets (\"RWA\") - Part 1 [2] - Initial Thoughts and Questions for Including Real World Assets in the Maker Protocol [3] - Adding Real World Assets (“RWA”) as DAI collateral is a critical step for Maker to stabilize the peg... and in doing so, we change the world [4] - MIP21: Real World Assets - Off-Chain Asset Backed Lender [5] - MIP13c3-SP4 Declaration of Intent & Commercial Points - Off-Chain Asset Backed Lender to onboard Real World Assets as Collateral for a DAI loan [6] - MIP13c3-SP5: Declaration of Intent: Maker to commence onboarding work of Centrifuge based Collateral [7] - MIP22: Centrifuge Direct Liquidation Module ",
                    "links": [
                        "https://forum.makerdao.com/t/initial-thoughts-and-questions-for-including-real-world-assets-in-the-maker-protocol/3511",
                        "https://forum.makerdao.com/t/adding-real-world-assets-rwa-as-dai-collateral-is-a-critical-step-for-maker-to-stabilize-the-peg-and-in-doing-so-we-change-the-world/3653",
                        "https://forum.makerdao.com/t/mip21-real-world-assets-off-chain-asset-backed-lender/3917",
                        "https://forum.makerdao.com/t/mip13c3-sp4-declaration-of-intent-commercial-points-off-chain-asset-backed-lender-to-onboard-real-world-assets-as-collateral-for-a-dai-loan/3914",
                        "https://forum.makerdao.com/t/mip13c3-sp5-declaration-of-intent-maker-to-commence-onboarding-work-of-centrifuge-based-collateral/4059",
                        "https://forum.makerdao.com/t/mip22-centrifuge-direct-liquidation-module/3930",
                        "https://forum.makerdao.com/t/signal-request-dai-is-at-1-04-going-towards-1-05-should-we-fix-the-peg-with-an-emergency-vote-to-lower-stablecoin-lr-and-increase-stablecoin-dc/4088/3",
                        "https://forum.makerdao.com/t/on-the-priority-of-real-world-assets-where-do-we-stand/5424/18",
                        "https://forum.makerdao.com/t/on-the-priority-of-real-world-assets-where-do-we-stand/5424",
                        "https://forum.makerdao.com/t/signal-request-approve-maker-representatives-as-an-oversight-role-for-real-world-assets-october-2020/4656",
                        "https://forum.makerdao.com/t/discussion-unwinding-stablecoin-exposure/4364/10",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-110-thursday-september-17-16-00-utc/4074/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-pt-br-portugues/4328",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313",
                        "https://forum.makerdao.com/t/maker-relay-ep-13/4310",
                        "https://forum.makerdao.com/t/working-group-rwa-onboarding/4167",
                        "https://forum.makerdao.com/t/week-15-dai-distributions-sourcecred-trial/4158",
                        "https://forum.makerdao.com/t/maker-relay-ep-12/4153",
                        "https://forum.makerdao.com/t/take-aways-from-the-september-10-governance-and-risk-meeting/4087/2",
                        "https://forum.makerdao.com/t/minimality-kiss-principle/14579",
                        "https://forum.makerdao.com/t/ukraine-vault-loan-war-bond-purchase-proposal/13529/16",
                        "https://forum.makerdao.com/t/mip41c5-sp1-facilitator-offboarding-rwf-001/11306/2",
                        "https://forum.makerdao.com/t/real-world-assets-strategy-for-2021/7570",
                        "https://forum.makerdao.com/t/guide-navigating-feedback-from-governance-and-the-greater-makerdao-community/8303"
                    ],
                    "GPT-summary": "The post is a proposal by the Maker community to prioritize the onboarding of Real World Asset collateral to scale DAI supply. The post provides background information on the current situation and the need for Real World Asset collateral. The post also includes links to past forum discussions and active MIPs related to the proposal. The post ends with a poll asking whether MakerDAO domain teams should prioritize the onboarding of Real World Asset collateral in the short term.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.309528556239083
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#2",
                    "likes": "8",
                    "time": "10/09/2020-18:37:14",
                    "content": "In addition to real world assets, I also think that DeFi yield assets are incredibly important to prioritize, compared to “traditional crypto”. yyCRV cUSDC with yield farming cDAI with yield farming USDC/DAI Curve pool with yield farming aUSDC aDAI crUSDC Some of these assets could instantly drive 100s of millions of Dai generated with high stability fees. yyCRV in particular could have a debt ceiling of 200 million, a stability fee of 40% and would instantly be generating 80 million USD in protocol income per year!!! IMO mixing real world assets and defi yield assets is the solution we need to fix the peg quickly in the short run ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.811111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "2",
                    "time": "10/09/2020-18:44:07",
                    "content": "This is maybe slightly off-topic for this signal, but raises good points. It could be worth starting a similar signal focused in this direction rather than RWA Though prioritising multiple things is obviously not quite so ideal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "1",
                    "time": "10/09/2020-19:03:43",
                    "content": "Thank you for putting this together Lev! Perhaps the problem with the DAI Peg is not onboarding MORE Tokens (ETH-B, COMP, etc.) or playing around with the parameters (USDT lower SF, etc.), but onboarding Real-World Assets (RWA) and also, more DAI Users? We will not know unless we innovate. On today’s Governance & Risk Call (September 10, 2020) Community Member Primoz brought up the possibility of having ETH-B.  The way I look at it—if the Ethereum Community has no interest of using Maker to generate DAI via Eth-A (utilization 65%), or even via the infamous USDT (utilization 0%), we are either: |A.|Not providing a service that the Customer needs, or crave |B.|There is User exhaustion, and it’s the “same faces, different places” scenario |C.|Not analyzing Customer Behaviour correctly |D.|Where’s the product segmentation?  xUSD, yUSD, tUSD, vUSD, rUSD, etc., etc., they All sound the same to me. I do not know how accurate my opinion is—but. At the end of the day—we need to ask ourselves, what job should a desperate customer HIRE our Product to do? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "4",
                    "time": "10/09/2020-19:04:14",
                    "content": "    Replenish2030:  Some of these assets could instantly drive 100s of millions of Dai generated with high stability fees.   Those assets are huge opportunities, but onboarding RWA is not just about generating DAI, it’s about innovation and prestige too! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#6",
                    "likes": "5",
                    "time": "10/09/2020-19:17:17",
                    "content": "Totally agree, but that’s why i think it should be a mix of both. RWAs dont provide scale right now, but they set the ground work for billions of scale a year from now. DeFi yield assets provide 100s of millions in scale today, so the two go hand in hand. The only thing that isn’t really that interesting at this point are vanilla crypto assets, because we already have BTC, ETH, LINK and COMP, and there’s probably not that many others that are interesting at all ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.418367346938776
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#8",
                    "likes": "4",
                    "time": "10/09/2020-19:59:01",
                    "content": "I think I disagree here. The legacy credit markets are tremendous. If the protocol was willing to do it, I’m sure even the existing RWA applicants could fill out 100s of millions in debt ceiling. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.805555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#9",
                    "likes": "1",
                    "time": "10/09/2020-20:06:58",
                    "content": "There hasn’t been a collateral application yet but yyCRV/yUSD (same thing) would be a very strong collateral type. We could see 100s of millions from it. And you’d be able to charge a higher stability fee than RWA. Here’s my hierarchy. yyCR/yUSD >>>>>>>>>>>> aDAI, cDAI, yCRV >>> USDC, USDT, PAX, TUSD, TCAD, TEUR ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.641666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#10",
                    "likes": "4",
                    "time": "10/09/2020-20:44:53",
                    "content": "This is an excellent topic, usually calls in maker happen during my working hours so it´s quite difficult to assist so sorry if I´m saying something that was discussed there, in order to decide though one constrain is the lack of knowledge of an ETA on RWA. For example, if RWA take one year to implement I would probably be more favorable to yield farming tokens, acrrue revenue, expand domain teams and scale RWA implementations. Having said that, I can´t help but like the idea to be the first in the RWA race, as @psychonaut said it´s about prestige & innovation too ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#11",
                    "likes": "4",
                    "time": "10/09/2020-22:14:39",
                    "content": "From what I wrote in RocketChat.  Real World Asset on-boarding truly is a line in the sand moment for Maker. Crypto had to go first, but RWAs are what will propel Maker…and increase the DAI supply by orders of magnitude…  it has to be done in a manner that the community understands and prices the risk… and mitigates losses.  The community has scarce resources to onboard assets (of any kind). Painfully we have seen that with crypto (less WBTC), “build it and they will come…” doesn’t always play out. With RWAs, significant capital expenditure goes into just getting aligned and setup to be considered (technical and legal). The only reason why an off-chain lender would consider doing that is because they want to make money. They do that by having a pipeline of deals to utilize the debt ceiling granted. Deployment of capital off-chain won’t (and shouldn’t) happen instantly. The peg won’t be fixed in a day. However, the underlying economic incentives are there. RWA teams are investing (their own money) in making this a reality for Maker as a whole. I am voting in favor of the signal as I would like the community to invest time and energy to learn both the benefits and also what risks are there and how they are being mitigated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.663690476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/freiza",
                    "index": "#12",
                    "likes": "4",
                    "time": "11/09/2020-04:46:03",
                    "content": "I agree with the sentiment of prioritizing collateral that’s been voted in; ideally with rough timelines and owners.  Even if the timelines aren’t met completely, having some semblance of a schedule would greatly increase confidence, the current situation is too opaque. Re: RWA’s, I recently read MIP13c3-SP5, ([6] in your original post), isn’t Centrifuge currently working on the majority of the smart contracts/audits/on boarding work for their RWA’s (which are the majority of RWA’s voted in)?  Not sure if signaling the Foundation to shift in that direction would be needed given that Centrifuge may be working in parallel, someone correct me if I’m wrong here. Re: yyCRV and yield assets yyCRV is a great idea, would make a great MIP application if someone who has a more thorough understanding can submit it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.213095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#13",
                    "likes": "1",
                    "time": "11/09/2020-05:01:49",
                    "content": "No because it’s too early for that. RWA are not tested in the wild, the legal stuff is unknown, there is much uncertainty and unknown demand regarding RWA. I think there are many ways to fix the peg in the short term (various proposals on this forum). RWA should be on agenda in a year or two. I expect to see DAI kicked out of some stablecoin indexes and liquidity pools due to being way off the peg (+3.5% now). It might also lose its base pair status at some exchanges. All rational users should be selling DAI for a nice profit these days. Those who stay are not in the stablecoin business - they are speculators/farmers/whales who might cause wild swings in the DAI supply/demand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.259615384615385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#14",
                    "likes": "3",
                    "time": "11/09/2020-07:40:23",
                    "content": "@bit Please let me shine some light on this.     bit:  RWA are not tested in the wild, the legal stuff is unknown   The legal implementation is known.  The legal enforceability is battle-tested and has been for several decades. What has not yet been done before is to allow MKR governance to control the economic levers of an off-chain lender using an existing structure.     bit:  unknown demand regarding RWA   As outlined in the MIP13, the initially requested debt ceiling for my proposal is 15MM. This is being lowered to the minimal level that we reasonably believe a Trustee will be willing to sign on. These structures are designed for scale well into the billions. If authorized and subject to meeting all of the required covenants in the credit agreement, 6s would utilize all of the debt ceiling within a couple months. 6s has approx. 40MM in projects in the pipeline in Q1 alone. Is there demand. Resoundingly, yes.     bit:  they are speculators/farmers/whales who might cause wild swings in the DAI supply/demand   The very reason to implement RWAs is to dampen those swings. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.494791666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#15",
                    "likes": "6",
                    "time": "11/09/2020-08:54:33",
                    "content": "    freiza:  Re: RWA’s, I recently read MIP13c3-SP5, ([6] in your original post), isn’t Centrifuge currently working on the majority of the smart contracts/audits/on boarding work for their RWA’s (which are the majority of RWA’s voted in)? Not sure if signaling the Foundation to shift in that direction would be needed given that Centrifuge may be working in parallel, someone correct me if I’m wrong here.   Indeed this was the strategy Centrifuge was (and still is) following. We believe that of course RWA in Maker are extremely impactful and need to get attention by the entire community including the foundation. But asking to drop everything else to work on this could be risky (we obviously still need to do short term fixes for the peg and react to the market as it develops). I did vote yes that RWA should be prioritized over other collateral to be added just because it’s been shown that even “large-cap crypto assets” (similar to BAT, KNC, ZRX and MANA) won’t add any significant supply in DAI and adding even two dozen of them would probably not solve our DAI supply issues. Adding those assets of course is easy and can be done by following a fairly established framework but even that takes time and once all those assets are in, they need to be monitored for things like token upgrades, changes in market dynamics etc. Centrifuge is therefore happy in doing a lot of the coordination and preparation work necessary for the community to onboard and we will be working with the domain teams as they have capacity to support us in this. The process we will follow is outlined in the declaration of intent which we hope the community approves to signal its alignment on this plan. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.474404761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#16",
                    "likes": "9",
                    "time": "11/09/2020-11:17:47",
                    "content": "Due to the high turnout early on in the poll, the relatively uncontentious nature of the results so far, and the fact that the Signal Request is concerning a question of short-term priorities, I’ve decided to reduce the poll duration to 1 week (from 2 weeks). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.234999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#17",
                    "likes": "0",
                    "time": "11/09/2020-17:35:04",
                    "content": "Hey @equivrel uploaded the poll to the maker dao reddit channel! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#18",
                    "likes": "5",
                    "time": "12/09/2020-16:00:45",
                    "content": "I have said in the past (months now) in rocket chat a focus on adding collateral that has opportunity to:  Diversify the portfolio into non crypto correlated assets (or even anti correlated if possible) That can drive significant DAI adoptions More liquidity has potential to ease PEG management.  I was very interested in getting USDC and other stablecoins (first to be used to short the PEG mostly as the BT emergency go to coin to create DAI) then wBTC or its variants renBTC etc after that all I see is RWA in terms of being able to really grow DAI outstanding.   A lot of people were interested in things like MANA, ZRX, etc. but these things simply have too low of caps to drive substantial DAI generation imo. so I was uninterested in onboarding these as they just create more work for little protocol reward. A combination of taking on the USDC at 1.01 or higher in a large USDC facility and targetting RWA adoption seems like a perfect fit for getting to 1-2B DAI or higher now. I think a real question is what does the community see the portfolio looking like in 6 months? Personally I see 1/3 crypto (dominated by ETH/BTC), 1/3 USDC stablecoins, and 1/3 RWA and growing. BTW:  An idea I have not written into a proposal - perhaps this will inspire someone. I think if we really want to drive growth and money flow the community should consider rewarding ‘borrowers’ of DAI with a MKR farming reward.    Example say I deposit ETH and earn something like 1% in MKR on the DAI I borrowed.  I am paid to borrow DAI.    Then we can raise the SF to bring DAI into the surplus to buy the MKR we are paying out in farming and use the MKR farming payout rate against the SF charged to adjust effective DAI borrowing rates below 0. Someone else like Lev, Primoz etc. can run numbers on this but I think we could do a nice balancing act causing DAI borrow generation and paying users MKR as a farming reward while working the 2% SF into everything.   The balancing act will be the MKR reward against the DAI SF on vaults but I think this is a much more interesting way to add some monetary knobs to encourage Maker use/minting borrowing DAI.   It has the addeded benefit of even more robust MKR/DAI liquidity markets which we are going to possibly need in the future (everyone will get less scared of having to raise DAI liquidity by selling MKR because the markets will already be there to absorb this).   The added benefit of doing this is that one can create a ‘negative’ rate environment by simply paying out more MKR for less DAI return in the SF and hence create a farming environment that incentivizes DAI borrowing with MKR reward being the negative rate lever. THe bonus in the end may be more MKR holders (i.e. vault holders) participating in governance. A better way to manage and track data on farming use might be to create a new MKR-R reward token that can be exchanged for MKR or used as a secondary governance token with a weight value that governance can change (i.e. MKR-R that is weighted 1:10 or 1:100) and use token scarcity initially like all other projects to drive value to the farming token.  This token doesn’t have to participate in governance immediately but simply carry an exchange value to MKR and hence a dilution component (whether people can exchange a MKR-R for MKR or DAI in the protocol all up for discussion if we choose this route, or we can just use MKR, either way it works) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.046719132316958
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#19",
                    "likes": "4",
                    "time": "12/09/2020-16:14:26",
                    "content": "I just thought I’d say that RWA moving on-chain is already moving ahead. Things like PAXG and REALT (if I remember this one right) are already there.   Expect more RWA’s to hit Ethereum in the coming months.   I am expecting more PMs and more real estate tokens and possibly stock tokens though these probably will take a while due to regulatory hurdles.   I am sure they all are being worked on.  Eventually we will get bonds on chain and then we will have seen these markets fully mature. I think it makes sense for Maker to focus on the big financial dogs.  I do have real concerns over timelines which is why even attempting to accellerate any of these is important.    While the RWA applications are complex once we hurdle even one of these the others should be pretty easy.  Also we already know the RWA applicants we have on the plate are targetting 100M or above of borrow within probably 12month time frame if this compresses.   200-250M within 12 months after that.  I know of no other application that could generate 50-100M.   If there is one please pull it forward into the prioritized list. Based on other discussion and the looming RWA coming on-line I don’t see why the protocol doesn’t start growing USDC assets to satisfy the DAI-USD conversion demands from some of these larger borrowers with a growing USDC facility to deal with the PEG.    From my point of view growing USDC while we priortize RWA is a win-win long term both for the PEG and DAI growth/adoption. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.793225623582766
                },
                {
                    "author_link": "https://forum.makerdao.com/u/consciousentity",
                    "index": "#21",
                    "likes": "4",
                    "time": "15/09/2020-22:51:55",
                    "content": "Why shouldn’t MakerDAO prioritize harnessing defi assets as best as possible before real world assets? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#22",
                    "likes": "11",
                    "time": "15/09/2020-22:59:19",
                    "content": "This is a good question. While I can’t speak for the community or all of the MKR holders, I think of it this way:  DeFi tokens are currently built entirely around speculation. They represent governance and a stake in protocols that are hoping to be useful in the future. In order for these protocols to be useful, they cannot be permanently based on speculation about themselves (this is circular)  AMMs need real assets for people to trade Lending markets need productive investments to allocate capital to Even ETH needs real use cases beyond decentralized speculation to be valuable in the long term   Therefore, the only way DeFi expands beyond a speculative bubble is to actually onboard assets that aren’t based on circular speculation and impact the “real” economy - “real world assets.”  With this logic, on-boarding real world assets isn’t ignoring DeFi tokens, its taking the speculative liquidity they have provided and putting it to good use - ultimately giving them the value they seek to have. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.910714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/consciousentity",
                    "index": "#23",
                    "likes": "2",
                    "time": "16/09/2020-14:22:33",
                    "content": "Thanks for this analysis. However, I do not see where you have explained what the down side is for the Maker system to harness defi assets and take advantage of speculation.  Of course, it needs be done in a safe way where excesses and failures do not pose any threat to the Maker system. It still seems to me that the Maker system should be trying to capture speculative energy in the ecosystem as long as it poses no systemic threat to the system, and it certainly seems possible to me do so since the system puts collateral risk on the CDP holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.590608465608465
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#24",
                    "likes": "6",
                    "time": "16/09/2020-14:25:19",
                    "content": "There’s no downside, you asked about our opinions on priorities. I personally think real world assets are the most innovative and impactful thing the DAO can focus on, but at the end of the day it’s up to the community and the MKR holders  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/consciousentity",
                    "index": "#25",
                    "likes": "3",
                    "time": "16/09/2020-14:36:16",
                    "content": "I don’t like this false dichotomy where we can either focus on RWAs …OR… we can focus on harnessing defi assets (as described in comments in this thread). Developing RWAs seems like a ongoing project that will presumably last for years. Why would we say everything else has to be halted why we focus on RWAs? The description makes it clear that onboarding digital assets is ‘straightforward’. Why would we put a halt to this for potentially years while we explore RWAs? Let’s do both. I see no fundamental reason why we can’t multitask as our needs arise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#26",
                    "likes": "4",
                    "time": "16/09/2020-14:43:34",
                    "content": "    consciousentity:  Why would we say everything else has to be halted why we focus on RWAs?   I don’t think everything else should “stop”, but we are dealing with scarcity of resources (human in this case).     consciousentity:  Why would we put a halt to this for potentially years while we explore RWAs?   Onboard RWA won’t take years. I believe the reason for the push is centered around some on-chain collateral that was added that never resulted in the minting of material quantities of DAI. Right now, more than ever, the DAI ecosystem needs more DAI minted. RWA today presents the the most plausible path to that objective. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#27",
                    "likes": "9",
                    "time": "17/09/2020-18:23:30",
                    "content": "The poll has been closed. The results were: Yes - 62 votes No - 9 votes Abstain - 15 votes The outcome is that RWA collateral should be prioritised, and the signal request should proceed to an on-chain governance poll next week (poll wording PR here). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#28",
                    "likes": "2",
                    "time": "18/09/2020-18:04:56",
                    "content": "The simplest answer is that defi assets in general are all cross-correlated where as RWA should NOT be as strongly correlated and hence from a loan portfolio standpoint are a good diversification strategy. RWA balances risk better and also should (we may take you up on the 1B RWA @mrabino1 and other RWA players) be able to back significant DAI liquidity generation which will have the bonus of helping the PEG.   RWA players are NOT going to be keeping their DAI or depositing it for farming but swapping it for USD. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#29",
                    "likes": "0",
                    "time": "17/12/2020-18:04:58",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2689"
}