{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
            "title": "Weekly Relay: March 15 - 21, 2022 ",
            "index": 14119,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "5",
                    "time": "21/03/2022-21:24:16",
                    "content": " 1640×357 260 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop-shop for MakerDAO updates.  The public PDF version is available here.   Current Events  This Week in Governance  Community Deep Dai-ve  Mark your Calendar  Useful Links  Have Feedback?   Current Events  stkMKR: Maker Staking and Tokenomics Revision  As part of an ongoing discussion on improving Maker’s token economics, @monet-supply of the Risk Core Unit team proposes staking functionality to the MKR token through stkMKR, a token with economics mechanism inspired by a combination of Cosmos governance and stkAAVE and xSUSHI token economics. This mechanism attempts to preserve the key benefits of the existing buy and burn mechanism—gas efficiency and tax efficiency—while also addressing its drawbacks:    stkMKR: Maker Staking and Tokenomics Revision     Lack of targeted incentives - token economics can incentivize positive behavior within a protocol, but buyback and burn returns capital to all MKR holders equally and doesn’t target incentives towards those token holders providing excess value  Weak crypto narrative - buy and burn is out of favor, and an update could stoke greater interest in the Maker protocol; while in my opinion, tokenomics should not be focused on price impacts, positive narrative shifts benefit the protocol by making MKR issuance for hiring, capital raising, and user incentivization more efficient  Limited deterrence against governance attacks - Currently, it is possible for MKR owners to vote on a malicious proposal and then immediately withdraw funds and interact with DeFi protocols, which makes it nearly impossible to burn an attacker’s stake (they could be commingled with lending or AMM exchange pools and contaminate funds held by other users)    In this proposed mechanism, a new non-transferable token, stkMKR, will replace MKR as the core governance token of the Maker ecosystem. Staked token holders will receive a share of MKR tokens purchased via surplus auctions, so the amount of MKR backing stkMKR will increase and automatically compound over time. Withdrawing the staked token will require waiting through an unbonding period, boosting protocol resilience and governance security. The fees will come from the DAI, which users must pay back as interest for borrowing on Maker. Currently, these fees are used to buy back MKR, which is then (usually) burned. However, a portion of purchased MKR will return to stkMKR holders under the new proposal. Here is a high-level overview of how the system works:  Staked stkMKR is held in voting contracts and can be freely delegated without delay and unbonding (a period that users would have to wait if they wish to withdraw their stkMKR and collect their fees). A portion of MKR received through surplus auctions is reserved for stkMKR holders rather than burned. Governance could also choose to top up this store manually. Those who stake MKR will be able to vote using stkMKR, and introduction of additional fees could also incentivize increased governance participation.  Withdrawing staked stkMKR is a straightforward process.  Ultimately, this mechanism is designed to achieve the following points:    stkMKR: Maker Staking and Tokenomics Revision     Incentivize governance participation: while the mechanism doesn’t directly incentivize voting or other actions, staking rewards may help improve participation and delegation rates.  Improve value accrual narrative for MKR token: concrete APR figures and supply restriction may help improve market sentiment.  Increase governance security: staking yield makes token lending less attractive, while unbonding periods may help deter governance attacks and make them more costly to execute. Unbonding also disincentivizes participation through centralized exchanges or other pooled staking services, which could compromise MakerDAO decentralization.  Increase resilience to credit losses: unbonding periods keep a share of MKR tokens off the market during market crashes and recapitalization events. This prevents staked MKR holders from front-running debt auctions.    Several components will need to be updated or introduced to fully implement the stkMKR tokenomics mechanism. A splitter contract will need to be written to route some of the MKR from surplus auctions into backing the stkMKR token. Several changes will need to be made to the Maker governance system, including migration to core governance, voting, delegation contracts, an adjustment to the way governance polls are evaluated, and a disaster recovery mechanism. Both Cointelegraph and The Defiant published summaries about the proposal.  Anti-inflationary proposal  While the stkMKR mechanism outlined above can support both deflationary (via buyback) and inflationary (via governance token minting) funding approaches, @cryptenthusiastic’s proposal is strictly deflationary and has less of a focus on incentivizing governance participation. @cryptenthusiastic wants to decouple the value of Dai from the inflation factor of fiat currency in such a way that:    Anti-inflationary proposal    If the Dollar decreases, Dai would remain stable If the Fed succeeds in making the Dollar rise in value (which is difficult to maintain in the long run), Dai would rise along with the Dollar    Potential risks and disadvantages include:    Anti-inflationary proposal    Mild impermanent loss in Dai pairs with other stable currencies. Will probably slow down the adoption process in the short and medium-term; borrowers will be a bit less motivated to open a vault because of rising interest rates. It would be less attractive for users borrowing Dai to buy and increase their position in different cryptos (the solution to this may be option B below).    @cryptenthusiastic believes that this decoupling of Dai from fiat currency’s inflation factor would make it the stablecoin of choice for investors taking profits during bull markets and making it attractive to institutions and businesses. As usual, with new tokenomics proposals, there is a lot of discussion under both the stkMKR proposal and this anti-inflationary proposal on the forum. There will also be a stkMKR call this Wednesday if this is a topic you’re particularly interested in: Focus On #8: stkMKR: Staking & Tokenomics Revision     Focus On #8: stkMKR: Staking & Tokenomics Revision   The 8th episode of Focus On will host @monet-supply, Risk Core Unit, and a Recognized Delegate to discuss proposed revisions to MKR Staking & Tokenomics. Addressing Maker’s criticisms of having weak tokenomics, stkMKR attempts to fix the project’s challenges by introducing incentives to governance participation while increasing governance security and resiliency to credit losses.   @juan and @retro will host the event this Wednesday, March 23rd, at 4 PM UTC. Mark it on your Google Calendar! Crowdcast call   This Week in Governance  Maker Improvement Proposals (MIPs) Weekly MIPs Update #79  1034×590 25.6 KB   RFC and FS Dates for reference and existing proposals can be seen on this new proposal tracker (WIP)!  If you have any questions about the voting process at MakerDAO, the Practical Guide to Voting will be useful.  We have nine proposals that have been formally submitted for the March Governance Cycle are now entering their second-week on-chain as Ratification Polls. Additionally, we have a Signal Request to promote amendments to MIP62 to an on-chain three-day poll, as per MIP4c3. This Signal Request will run until March 23.  There are 17 recent/active proposals with RFC status, most of which are eligible to enter the April Governance Cycle. Some, however, still need further definition and adjustments before they can be formally submitted; others will have to wait until the May Governance Cycle; and yet others will enter the Weekly Cycle instead.   Pre-MIP Discussions:  Anti-inflationary Proposal Auction-backed DAI IAM for Surplus Buffer Proposal Ideas on the Forum [Pre-MIP] Using Gyroscope to cut through Dai’s Gordian knot: its USDC dependency An RWA style solution to replace the PSM   Executive Vote There was no executive vote last week, March 18, 2022. Polls will be bundled into the next executive vote on March 25, 2022.  Active Governance Polls     Poll Name Discussion     Ratification Poll for Declaration of Intent - Invest in Short-Term Bonds Discussion   Ratification Poll for Facilitators Offboarding (MDS-001) Discussion   Ratification Poll for GovAlpha Budget 2022-23 Discussion   Ratification Poll for Modify Core Unit Budget - Real-World Finance (RWF-001) Discussion   Ratification Poll for Modify GovAlpha Core Unit MKR Budget Discussion   Ratification Poll for Onboard-Amend Keeper Network - Gelato Network Discussion   Ratification Poll for Onboard-Amend Keeper Network - Keep3r Network Discussion   Ratification Poll for Rapid Payment for Small Bug Bounties Discussion   Ratification Poll for Recognized Delegate Compensation Discussion    Check out March 14th’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls There were no active community greenlight polls for the week of March 15 - 21, 2022. Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests Promote “MIP4c3-SP2: MIP62 Amendments” to an on-chain poll @Patrick_J posted a Signal Request seeking to gauge support for whether MIP4c3-SP2, which contains some amendments to existing MIPs in response to the offboarding of the Content Production Core Unit, should proceed to an on-chain poll. This Signal Request will run until March 23rd, 2022, at 8:30 PM. Promote “MIP4c3-SP1: Amend MIP64 to clarify critical web bounty amount” to on-chain poll Psychonaut submitted a very straightforward Signal Requesting. At issue: Amend MIP64 to clarify critical web bounty amount 6 Considerations (not pros and cons):  Increase the payout for critical severity web bugs from 5k-50k to a single amount of 50k. Reduce negotiation around the critical severity bounty amount. Increase incentive for whitehat hackers to pursue Critical potential severity web bugs.  Onboard D3M For Notional Finance Recognized Delegate GFX Labs is signaling to onboard a D3M (DAI Direct Deposit Module) for Notional Finance’s 3-month-maturity DAI lending pool 1, with an initial debt ceiling of 10 million DAI (unless recommended otherwise by Risk Core Unit).    [Signal Request] Onboard D3M For Notional Finance   Pros:  Increased revenues. The 3-month rate on Notional is north of 7%, on a base of around 85m DAI. For example, even a trial 10m DAI DC would firmly put a Notional D3M in the top 10 ilks by revenue. (10m DAI is currently estimated to suppress rates only to 6% as of writing)   For reference, estimated yearly revenue from other top ilks are below:   Increased control over the front end of the yield curve. Strategically, Maker’s use of D3Ms across multiple lending venues will exert control over more of the total market, dampening effects of fragmented liquidity for DAI and volatility during market downturns. Being fairly insensitive to gas costs, Maker’s D3M for Aave has allowed steady DAI rates even in intense volatility. That stabilization can also be applied to the very shortest portion of the yield curve. Diversification of counterparties. Maker currently faces existential risk from various counterparties: Circle, Lido, Bitgo, Paxos, and occasionally Aave. By growing DAI supply and increasing the rate by which the Surplus Buffer grows, a program of diverse D3Ms advances the goal of reducing excess reliance on individual counterparties. Familiar credit risks and technological risks. The risks represented by exposure to Notional’s overcollateralized lending platform (listed under Cons) are risks that Maker has deep expertise in evaluating and monitoring through Collateral Engineering Services, Risk, and Protocol Engineering Core Units. Reduced reliance upon stablecoin collateral. The DAI supply is 68% backed by stable collateral, the bulk of which is 5,300,000,000 USDC and nearly 500,000,000 USDP. D3Ms can scale quickly and are limited only by the depth of their deployed markets, allowing them to grow as demand for DAI on the lending platform grows. This increases DAI supply, but it should also lower the demand for the PSMs, as there are alternative methods of obtaining DAI.   Cons:  Smart contract risk. There is always smart contract risk with any protocol-to-protocol interaction. Steps to mitigate this for Notional include an audit by ABDK, a $1,000,000 bug bounty program on Immunefi, analysis via Code4rena, formal verification via Certora, and a pending diligence report by Consensys. Multisig risk. Notional’s governance mechanisms are still in the early stages of decentralizing. At the moment, key portions of the protocol are governed by a 3 of 5 multisig. There is no firm timeline, but the multi-sig’s admin powers will be phased out over time. A possible mitigant of risk to Maker is that one of its delegates (GFX Labs) is one of the signatories, and all signatories are fully doxxed 1. Note that other underlying collaterals already in Maker’s portfolio also include governances with multisigs, so this is not a novel form of risk. Illiquidity risk. If the amount of DAI in the liquidity pool drops due to LPs withdrawing their capital, there may be insufficient liquidity for Maker to withdraw 100% of its capital before maturity. It should be noted that Maker will always be able to withdraw its capital upon maturity regardless of the liquidity in the pool. This illiquidity risk only refers to withdrawals before maturity. A gradual scaling of maximum exposure can keep in mind to mitigate this. Capital loss risk. If liquidations do not perform properly, capital loss is risk. Notional has built a robust liquidation infrastructure 1 and currently utilizes conservative parameters. Being an overcollateralized lending platform, the risk of bad debt stemming from default is, in principle, low. While probably unnecessary for Maker, there is also coverage available for Notional under Nexus Mutual. Oracle risk. Notional utilizes Chainlink oracles for the four listed assets. Maker is already exposed to Chainlink oracles via Aave and (soon) Compound.    Onboard PAXG Another Signal Request for new collateral onboarding was posted by the Strategic Finance Core unit, this time for onboarding PAXG (PAX Gold).    [Signal Request] Onboard PAXG   Pros  Gold might be an important building block for DeFi. When we onboarded WBTC, it was small and unproven in DeFi; since then, it has been an important piece, thanks to MakerDAO. The same thing can happen with PAXG. DeFi can provide yield for gold and attract TradFi people This onboarding might increase our relationship with Paxos. US Dollar dominance is under attack (especially after the weaponization of the dollar), and strong inflation is on the menu. Both are good for gold.  Cons  Gold can fall into oblivion soon. The current rates increase are bad for gold. PAXG is centralized by Paxos Demand can be lacking, and we would incur a loss and a defocus (Oracle costs)      Community Deep Dai-ve  Tweet of the Week   twitter.com    emiliano.eth @emilianobonassi  almost 2 years ago we had the BlackThursday and the community did a strong call to action to support @MakerDAO   look where we are now, we must celebrate how much we did so far 🥰  only up! twitter.com/brendan_opense…   Brendan from OpenSea @brendan_opensea  The #BackstopSyndicate is ready to participate in the @MakerDAO MKR auctions to repay the Multi-Collateral Dai system's debt.   We already have 350k Dai ready to bid if the price falls to 100 Dai / MKR.   Join us! Stand with #DeFi! Protect Dai!  https://t.co/R6wu0OtG0o https://t.co/mj9q30XVsX    10:49 AM - 20 Mar 2022           11                1             Forum Insight A RWA DeFi ecosystem: more than just onboarding collateral @roollie from Centrifuge gave us an overview of the RWA Market on Aave after seeing many questions from the Maker community about it. In case you’re unfamiliar, Aave allows for creating markets where people can borrow tokens by depositing collateral. Interest rates increase and decrease depending on market utilization. The RWA market launched on December 28th of last year and represented the first diversified real-world asset market on Aave. Initially, the market launched with seven pools and allowed liquidity providers to deposit USDC. Four of the pools are integrated Maker vaults. It currently has a market size of US$19.1M, with 10.8M USDC deposited. With this market, when a pool wants to increase its capital, issuers can deposit pool tokens in the Aave protocol and borrow directly from any RWA Market investor.  This additional funding source provides stability and longevity, giving issuers peace of mind that “there are reliable sources of income across multiple fronts, similar to multiple banking relationships that a traditional company might have.” Also, check out the latest Forum at a Glance post for additional forum insights.  Articles   A Radical Proposal to Revive MakerDAO Roils Community  “Hexonaut, a protocol engineer at MakerDAO, joined forces with colleagues and submitted a new governance proposal called “Aggressive Growth Strategy.” It’s urging Maker’s membership to consider a bevy of radical moves to rejuvenate the popular DeFi project, including tapping real world assets to shore up its surplus fund. The authors estimate that move will generate an additional $20M to $40M in annual revenues.”      Meetings and Events  Last Week’s Call Recordings  Governance and Risk Call Ep. 182:   Video | Forum    Focus On #06 | Data Insights Core Unit:   Video | Forum    Collateral Onboarding Call #39: D3M for Notional Finance:   Video | Forum      Upcoming Calls  Focus On #7: RWA Lending Principles  | Tuesday, March 22, 2022, 4:00 PM UTC   Join Link | Forum    Focus On #8: stkMKR: Staking & Tokenomics Revision | Wednesday, March 23, 2022, 4:00 PM UTC   Join Link | Forum      Governance & Risk   Join Link | Agenda - Thursdays at 17:00 UTC   Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Real World Finance - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC    Useful Links Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auctions data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @Artem_Gordon @nothsa ",
                    "links": [
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890",
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890/1",
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890/1",
                        "https://cointelegraph.com/news/makerdao-community-proposal-to-replace-mkr-governance-token",
                        "https://thedefiant.io/makerdao-proposal-dai-shake-up-tokenomics",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928/1",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928/1",
                        "https://forum.makerdao.com/t/focus-on-8-stkmkr-staking-tokenomics-revision/14001",
                        "https://forum.makerdao.com/t/focus-on-8-stkmkr-staking-tokenomics-revision/14001/1",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=N3Nzam90NTJ0cjdwMGI0bWtuZ3Z0ZG8ycjcgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://www.crowdcast.io/e/focus-on-8",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp2-mip62-amendments-to-an-on-chain-poll/13972",
                        "https://forum.makerdao.com/t/mip4c3-sp2-mip62-amendments/13779",
                        "https://mips.makerdao.com/mips/details/MIP4#MIP4c3",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106#things-to-come-crystal_ball-4",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928",
                        "https://forum.makerdao.com/t/auction-backed-dai/13011/11",
                        "https://forum.makerdao.com/t/premip-iam-for-surplus-buffer/11584",
                        "https://forum.makerdao.com/c/mips/proposal-ideas/21?order=activity",
                        "https://forum.makerdao.com/t/pre-mip-using-gyroscope-to-cut-through-dai-s-gordian-knot-its-usdc-dependency/8865",
                        "https://forum.makerdao.com/t/an-rwa-style-solution-to-replace-the-psm/8705",
                        "https://forum.makerdao.com/t/no-planned-executive-2022-03-18/13923",
                        "https://vote.makerdao.com/polling/QmR6QMt6?network=mainnet",
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084",
                        "https://vote.makerdao.com/polling/QmV3Lem7?network=mainnet",
                        "https://forum.makerdao.com/t/mip41c5-sp5-facilitator-offboarding/13005",
                        "https://vote.makerdao.com/polling/QmSBytmr?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp59-govalpha-budget-2022-23/13144",
                        "https://vote.makerdao.com/polling/QmXDh7RR?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152",
                        "https://vote.makerdao.com/polling/QmefuvKL?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp60-modify-govalpha-core-unit-mkr-budget/13145",
                        "https://vote.makerdao.com/polling/QmTnVxAL?network=mainnet",
                        "https://forum.makerdao.com/t/mip63c4-sp2-onboard-amend-keeper-network-keep3r-network/12748",
                        "https://vote.makerdao.com/polling/QmaEfChz?network=mainnet",
                        "https://forum.makerdao.com/t/mip63c4-sp2-onboard-amend-keeper-network-keep3r-network/12748/1",
                        "https://vote.makerdao.com/polling/QmRdVByP?network=mainnet",
                        "https://forum.makerdao.com/t/mip4c3-sp1-rapid-payment-for-small-bug-bounties-mip64-mip40c3-sp42-amendment/12869",
                        "https://vote.makerdao.com/polling/QmTvzCjL?network=mainnet",
                        "https://forum.makerdao.com/t/mip61-delegate-compensation/10640",
                        "https://forum.makerdao.com/t/weekly-relay-march-8-14-2022/13906",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp2-mip62-amendments-to-an-on-chain-poll/13972",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp2-mip62-amendments-to-an-on-chain-poll/13972",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount-to-on-chain-poll/13649",
                        "https://forum.makerdao.com/t/mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount/13439",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782/1",
                        "https://github.com/notional-finance/contracts-v2/blob/master/audits/ABDK%20-%20Notional%20V2%2C%20Sept%201%202021.pdf",
                        "https://code4rena.com/reports/2021-08-notional/",
                        "https://github.com/notional-finance/contracts-v2/blob/master/audits/Certora%20-%20Formal%20Verfication%20Report%2C%20Nov%201%202021.pdf",
                        "https://etherscan.io/address/0x22341fB5D92D3d801144aA5A925F401A91418A05#readProxyContract",
                        "https://blog.notional.finance/understanding-liquidations/",
                        "https://forum.makerdao.com/t/d3m-risk-assessment/9353",
                        "https://forum.makerdao.com/t/compound-d3m-risk-assessment/12580",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768/1",
                        "https://twitter.com/emilianobonassi/status/1505496762022248450",
                        "https://twitter.com/emilianobonassi/status/1505496762022248450",
                        "https://twitter.com/emilianobonassi/status/1505496762022248450",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/brendan_opensea/status/1240655909468033027",
                        "https://twitter.com/brendan_opensea/status/1240655909468033027",
                        "https://twitter.com/emilianobonassi/status/1505496762022248450",
                        "https://forum.makerdao.com/t/a-rwa-defi-ecosystem-more-than-just-onboarding-collateral/14079",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://thedefiant.io/makerdao-real-world-assets-proposal/",
                        "https://youtu.be/cMLUkPq7RNo",
                        "https://forum.makerdao.com/t/governance-and-risk-182-thursday-march-17-17-00-utc/13965",
                        "https://youtu.be/Kn_FT2EjdwQ",
                        "https://forum.makerdao.com/t/focus-on-6-data-insights-core-unit/13827",
                        "https://youtu.be/ccvPMQ4gm1A",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-39-d3m-for-notional-finance-signal-request-discussion/13828",
                        "https://www.crowdcast.io/e/focus-on-7",
                        "https://forum.makerdao.com/t/focus-on-7-rwa-lending-principles/14000",
                        "https://www.crowdcast.io/e/focus-on-8",
                        "https://forum.makerdao.com/t/focus-on-8-stkmkr-staking-tokenomics-revision/14001",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-marzo-de-2022/14181",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-mar-14-mar-25/14263",
                        "https://forum.makerdao.com/t/weekly-relay-march-22-28-2022/14300",
                        "https://forum.makerdao.com/t/relay-semanal-22-28-de-marzo-de-2022/14333"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.511124716114062
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#2",
                    "likes": "4",
                    "time": "21/03/2022-21:42:22",
                    "content": "Thanks, me laddie! Stay useful and it might be sparing ye from meetin’ the rope’s end! Now if only I’d could see straight enough to read it after a rum drinking’ contest with me mutinous parrot…  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "5",
                    "time": "21/03/2022-21:44:21",
                    "content": " ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/04/2022-21:44:44",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-february-15-21-2022/13348",
            "title": "Weekly Relay: February 15 - 21, 2022 ",
            "index": 13348,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "6",
                    "time": "21/02/2022-23:34:19",
                    "content": " 1078×208 98.1 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop shop for MakerDAO updates.  The public PDF version is available here.   Current Events  This Week in Governance  Community Deep Dai-ve  Mark your Calendar  Useful Links  Have Feedback?   Current Events  New Delegate Candidate Publishes Platform Long-time MakerDAO contributor Doo Wan Nam has thrown his hat in the ring as a delegate candidate. Doo’s platform is focused on connecting the Eastern and Western MakerDAO communities, fostering a diversity of ideas and communities, and taking a pragmatic approach to solving problems. With his MakerDAO experience as Korea Lead, in business development, and most recently as a member of the growth team, Doo is well-equipped to deliver on these initiatives. We will be hosting a live Meet Your Delegate Zoom session with Doo on March 22nd. Check out the forum post for details.  Representing MakerDAO at ETHDenver We had a great time representing ETHDenver at this year’s event! In case you missed it, catch Growth Core Unit Facilitator, Nadia Alvarez’s, talk on Growing as a DAO and the learning experiences we’ve taken from that journey, and check out Retro’s State of the DAO address to catch up on what we’ve been up to lately and how we think we’re doing.   This Week in Governance  Maker Improvement Proposals (MIPs) Weekly MIPs Update #75  We are entering the second week of Ratification Polls. Make sure to review currently submitted proposals and vote by Monday, February 28th. If you have any questions about the voting process at MakerDAO, this manual might be useful. Things to come:  If you want your proposal to enter March’s Governance Cycle, the last day for modifications is March 02nd, 2022! The next Formal Submission Window will be open from Monday, March 07th through Wednesday, March 09th. Are you planning to submit a new proposal? Remember to post on the forum before March 09th to be eligible to enter April’s Governance Cycle!   Executive Vote Recognized Delegate Compensation, Raise the Emergency Shutdown Threshold, MOMC Parameter Changes, Core Unit DAI Budget Stream Corrections - February 04th, 2022 This executive proposal passed, and the following changes were made to the Maker Protocol:  Recognized Delegate Compensation Payments - January 2022 As per these successful governance polls (1, 2) and the ongoing trial of delegate compensation, a total of 54,752 DAI was distributed to eight Recognized Delegates:     DAI AMOUNT Delegate     12,000 FlipFlopFlap Delegate LLC   12,000 schuppi   12,000 Feedblack Loops LLC   8,620 MakerMan   4,807 monetsupply   3,795 ACREinvest   889 JustinCase   641 GFX Labs    Details on the breakdown of delegate compensation for January can be found on the MakerDAO forum here.  Emergency Shutdown Module Threshold Increase Raise the threshold to trigger the Emergency Shutdown Module by 25,000 MKR from 75,000 MKR to 100,000 MKR. For further information, please see the initial Signal Request on the MakerDAO forum here. Further details about the changes being made to the Emergency Shutdown Module have been posted by the Protocol Engineering Core Unit on the MakerDAO forum here.  MOMC Parameter Changes As per this governance poll on the latest MakerDAO Open Market Committee proposal, the following parameter changes were made in the Maker Protocol:     Parameter Vault Change Previous New     Stability Fee ETH-A -0.25% 2.5% 2.25%   Stability Fee ETH-B -2.5% 6.5% 4.0%   Stability Fee WSTETH-A -0.5% 6.5% 4.0%   Stability Fee WBTC-A -0.25% 4.0% 3.75%   Stability Fee WBTC-B -2.0% 7.0% 5.0%   Stability Fee WBTC-C -0.75% 1.5% 0.75%   Stability Fee UNIV2DAIETH-A -1% 2% 1%   Stability Fee UNIV2WBTCETH-A -1% 3% 2%   Stability Fee UNIV2USDCETH-A -1.0% 2.5% 1.5%   Stability Fee GUNIV3DAIUSDC2-A -0.25% 0.5% 0.25%   Stability Fee TUSD-A -1% 1% 0%   Target Borrow Rate DIRECT-AAVEV2-DAI -0.25% 3.75% 3.5%   Maximum Debt Ceiling GUNIV3DAIUSDC1-A -400 million DAI 500 million DAI 100 million DAI   Maximum Debt Ceiling GUNIV3DAIUSDC2-A 250 million DAI 500 million DAI 750 million DAI   Target Available Debt GUNIV3DAIUSDC2-A 40 million DAI 10 million DAI 50 million DAI     Correction of Core Unit Budget Streams The previous Executive Vote contained errors relating to the DAI budget Streams for the StarkNet Engineering and Strategic Finance Core Units. The error has been detailed by the Protocol Engineering team on the MakerDAO forum here. In order to correct this error, the following changes were made:   The currently configured DAI budget streams for the StarkNet Engineering and Strategic Finance Core Units will be canceled. In order to retain access to the first month’s funds during the stream update, we are transferring 42,917 DAI to the StarkNet Engineering Core Unit at 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1. The transfer amount of 42,917 DAI is equivalent to one month of funding under their most recent budget proposal and will be made by claiming the funds from the canceled stream plus a transfer of the difference between 42,917 DAI and the amount claimed.  214,583 DAI will be streamed to the StarkNet Engineering Core Unit at 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1 starting on 2022-03-01 and ending on 2022-07-31 as a result of their most recent budget proposal. In order to retain access to the first month’s funds during the stream update, we are transferring 82,417 DAI to the Strategic Finance Core Unit at 0xf737C76D2B358619f7ef696cf3F94548fEcec379. The transfer amount of 82,417 DAI is equivalent to one month of funding under their most recent budget proposal and will be made by claiming the funds from the canceled stream plus a transfer of the difference between 82,417 DAI and the amount claimed.  412,085 DAI will be streamed to the Strategic Finance Core Unit at 0xf737C76D2B358619f7ef696cf3F94548fEcec379 starting on 2022-03-01 and ending on 2022-07-31 as a result of their most recent budget proposal.    Active Governance Polls     Poll Name Vote Discussion     MakerMan Retroactive Delegate Compensation Vote Discussion   Ratification Poll for Facilitator Onboarding to DUX-001 - 0xdeniz (MIP41c4-SP32) Vote Discussion   Ratification Poll for Modify Core Unit Budget, RISK-001 (MIP40c3-SP56) Vote Discussion   Ratification Poll for Modify Core Unit Budget - Collateral Engineering Services, CES-001 (MIP40c3-SP57) Vote Discussion   Ratification Poll for MIP55 Amendments (MIP4c2-SP16) Vote Discussion   Ratification Poll for Modify Core Unit Budget, Immunefi Security (IS-001) (MIP40c3-SP58) Vote Discussion   Ratification Poll for Onboard/Amend Keeper Network - Tech-Ops (MIP63c4-SP1) Vote Discussion   Ratification Poll for Onboarding the Maker Talent Core Unit (MT-001) Vote Discussion   Ratification Poll for Intangible Asset Assignment (MIP60) Vote Discussion    Check out February 14th’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls     Collateral MIP9 Poll MIP6 Application     PUNK (NTFX CryptoPunk) Ends 3/07 4PM UTC Application    Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests Implement Governance Mining Trial Signal Request Ends March 02nd In recent months, a decline in governance participation has been brought to light. Unfortunately, attracting engaged, informed voters is a problem that has largely gone unsolved. @GFXlabs believes it is time to take an actionable approach through a governance mining trial to help improve voting participation to compare polls treated with potential payments vs. polls before and after the treatment and the difference between treated/untreated and governance participation one year earlier. The initial trial is aimed at polls, with more straightforward metrics to monitor. The design of this trial includes an assurance payment of .1 MKR provided to any address that contributes ≥ 1 MKR in a non-abstain vote on at least one low-turnout poll. A maximum of .1 MKR may be awarded to any address for any individual closing date of this trial. All MKR rewards will be sourced from the MakerDAO treasury. A budget of 8 MKR will be reserved for this trial. This trial will be in effect until the MKR budget is exhausted or after six weeks, whichever occurs first. This design offers the potential for payouts without guaranteeing that MakerDAO will incur expenses and provide a meaningful reward to smallholders willing to provide a public good at their own expense. @GFXlabs agrees to take management of the reporting and administration of this trial. They will track and provide public updates on which addresses (if any) are eligible for assurance payments following the close of each trial date. @GFXlabs will provide a written report (via forum post) and oral report (if desired) on a Governance & Risk call after the close of the trial.  Pros:  Potentially increases governance participation, particularly among smaller holders Offers payments only when marginal increases in participation are needed Allows experimentation with a novel mechanism without committing to large or ongoing payments Trial will be administered by GFX Labs to avoid adding to the governance burden of core units    Cons:  Could incur a maximum expense of 8 MKR and 1000 DAI May not generate conclusive results If chosen to be extended or made permanent, this program would likely require an increased workload to administer on an ongoing basis Will require some measure of marketing/communication to make MKR holders aware of the trial program If the assurance payment amount of .1 MKR is too low to attract voters to polls, then rewards would accrue to those already voting rather than the marginal voter   @GFXlabs is asking the community whether MakerDAO should implement the Governance Mining Trial. Fund Ambassadors Program Pilot Signal Request Ends February 25th The Ambassador Program, which provides non-English-speaking communities with resources and educational materials, had its funding disrupted by the offboarding of MKT-001. @Kat took the initiative to spearhead the Program without the attachment of a Core Unit and is seeking 25,000 DAI to complete the pilot and associated projects over the next three months. She is asking the community whether MakerDAO should fund the Ambassador Pilot Program. Allocate 20M to Protocol-Owned Uniswap V2 MKR/DAI LP Signal Request Ends March 03rd In response to a recent discussion, @psychonaut believes the simplest method for improving MKR liquidity is to add protocol-owned Dai/MKR LP shares to UniV2. He asks the community whether Maker should allocate 20M to a protocol-owned UniV2 MKR/Dai LP and presents his argument that the pros outweigh the cons:  Pros:  Simple No need to wait on sweeping tokenomic redesigns that have had difficulty finding consensus (e.g. Sagittarius Engine, gbMKR, etc.) Mostly orthogonal to MKR flap auctions  Helps identify a minimum and maximum MKR price for both flap and flop auctions Automatically buys low, sells high and captures the spread Obtains some return on otherwise idle capital sitting in the surplus buffer Extremely gas efficient (i.e., set it up and forget about it)  Cons:  Potentially interferes with the ability to raise large amounts of DAI from MKR sales Trading strategy is nearly the opposite of flop auctions    Bring Back the MKR Burn Part II Signal Request Ends March 04th @ultraschuppi states that the recent executive vote to temporarily disable Surplus Auctions and MKR burn had intentions to return to the original lerp mechanic. However, an on-chain poll added the Rate Limiter to the Flapper Module. In response, Schuppi asks the community whether the protocol should return to the previous partial burning configuration as agreed in November, but with the following conditions:  The Rate Limiter has been installed on mainnet; this will take a couple of weeks. An initial configuration for the Rate Limiter has been set.    Community Deep Dai-ve  Tweet of the Week     twitter.com    definikola.eth @definikola  Protocol #4 - @MakerDAO  Maker is an OG lending protocol that makes it possible to generate so far the most adopted decentralized stablecoin - $DAI  Anyone trying to get into DeFi, especially lending, should learn about the core principles of Maker and over-collateralization.   3:49 PM - 21 Feb 2022           49                12             Forum Insight: Market Liquidity for DAI and MKR GovAlpha core unit contributor @LongForWisdom has published the second part of his series to facilitate discussion about how and why to increase the market liquidity of DAI and MKR. While Part One discussed Decision 1: How does MakerDAO fund its liquidity strategy?, Part Two focuses on Decision 2: What is our liquidity strategy aiming to achieve, and how? Part Two focuses primarily on objectives: What does MakerDAO stand to gain by implementing a market liquidity strategy? Part Three will bring the focus to practical methods for achieving these objectives. The post outlines three potential goals a liquidity strategy may seek to achieve and what makes them desirable.  Increasing adoption of DAI on L2s, sidechains, and other L1 chains Increasing DAI adoption on other chains will increase the demand for DAI directly and indirectly, ultimately “convert[ing] directly into revenue and profits” for MakerDAO.  Attempting to add DAI to the ranks of USDC and ETH as a default routing token for on-chain liquidity Securing a place alongside ETH and USDC as a default routing token will dramatically increase demand for DAI and encourage further adoption.  Dampening MKR price movements and increasing ease of entry into and exit from the token Improving MKR liquidity across the market will help reduce MKR volatility, bolstering MakerDAO’s resiliency. It will also make it easier for MKR holders and potential holders to enter and exit positions. Read the full post for a detailed breakdown of these objectives, their potential risks and benefits, and a discussion of how we can achieve them. Also, check out the latest Forum at a Glance post for additional forum insights.  Articles MakerDAO On Its Decentralization Process to Dissolve the Foundation DeFi protocol MakerDAO plans to complete its roadmap to decentralize governance with the dissolution of its foundation. Nadia Alvarez, head of growth at MakerDAO, joined “All About ETH” live at ETHDenver 2022 to discuss its decentralized journey and key lessons learned. Nadia also talks about whether the move toward DAO-ifying is just a trend or a long-term revolution.   Meetings and Events  Last Week’s Call Recordings There were no call recordings last week due to ETHDenver.  Upcoming Calls  Focus On #5: AMA with the Centrifuge Team | 2022-02-23T17:00:00Z   Forum | Join Link Passcode: COREUNIT      Governance & Risk   Join Link | Agenda - Thursdays at 16:00 UTC   Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC    Useful Links Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auctions data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only. ",
                    "links": [
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246",
                        "https://forum.makerdao.com/t/meet-your-delegate-10-doo/13248",
                        "https://www.youtube.com/watch?v=B2rSkv1Xk3o",
                        "https://www.youtube.com/watch?v=z9JBTlfXas4",
                        "https://forum.makerdao.com/t/weekly-mips-update-75/13330",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://vote.makerdao.com/executive/template-executive-vote-recognized-delegate-compensation-raise-the-emergency-shutdown-threshold-momc-parameter-changes-core-unit-dai-budget-stream-corrections-february-04-2022?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/polling/QmPCbBu3?network=mainnet",
                        "https://vote.makerdao.com/polling/QmbvuhYH?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/recognized-delegate-compensation-breakdown-january-2022/13001",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://forum.makerdao.com/t/signal-request-raise-threshold-for-emergency-shutdown-module/12208",
                        "https://forum.makerdao.com/t/moving-the-esm-threshold-increase-to-next-week/12895",
                        "https://vote.makerdao.com/polling/QmWReBMh",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2022-01-27/12883",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-transfers-and-streams-january-28-2022?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/correction-to-last-weeks-executive/13022",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP47",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP47",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP27",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP46",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP27",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP46",
                        "https://vote.makerdao.com/polling/QmR2DX4L?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-makerman-retroactive-delegate-comp/13051",
                        "https://vote.makerdao.com/polling/QmR3DeK2?network=mainnet",
                        "https://forum.makerdao.com/t/mip41c4-sp32-facilitator-onboarding-to-dux-001-0xdeniz/12559",
                        "https://vote.makerdao.com/polling/Qmb6o8ua?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp56-modify-core-unit-budget-risk-001/12587",
                        "https://vote.makerdao.com/polling/Qmb6o8ua?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp57-modify-core-unit-budget-collateral-engineering-services-ces-001/12578",
                        "https://vote.makerdao.com/polling/QmTRMFXz?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp57-modify-core-unit-budget-collateral-engineering-services-ces-001/12578",
                        "https://vote.makerdao.com/polling/QmaBYzea?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp58-modify-core-unit-budget-immunefi-security-core-unit-budget-is-001/12598",
                        "https://vote.makerdao.com/polling/QmbsvbsA?network=mainnet",
                        "https://forum.makerdao.com/t/mip63c4-sp1-onboard-amend-keeper-network-tech-ops/12739",
                        "https://vote.makerdao.com/polling/QmTKSjCM?network=mainnet",
                        "https://forum.makerdao.com/t/mip39c2-sp28-adding-maker-talent-core-unit-mt-001/12075",
                        "https://vote.makerdao.com/polling/QmWDna6r?network=mainnet",
                        "https://forum.makerdao.com/t/mip60-intangible-asset-assignment/10319",
                        "https://hackmd.io/fwwIZgwIQmeRradrZ2tsRw",
                        "https://vote.makerdao.com/polling/QmWT8dH6?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/punk-collateral-onboarding-application/12992",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-implement-governance-mining-trial/13271",
                        "https://forum.makerdao.com/t/improving-governance-participation-rate-at-makerdao/11706",
                        "https://forum.makerdao.com/t/signal-request-fund-ambassadors-program-pilot/13199",
                        "https://vote.makerdao.com/polling/QmYk1XN5?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-allocate-20m-to-protocol-owned-uniswap-v2-mkr-dai-lp/13150",
                        "https://forum.makerdao.com/t/sagittarius-engine/10852",
                        "https://forum.makerdao.com/t/signal-request-gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756",
                        "https://manual.makerdao.com/parameter-index/surplus-auction",
                        "https://manual.makerdao.com/parameter-index/debt-auction",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn-part-ii/13146",
                        "https://vote.makerdao.com/polling/QmUqfZRv?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056#next-step-setting-lid-3",
                        "https://twitter.com/definikola/status/1495787723814281217",
                        "https://twitter.com/definikola/status/1495787723814281217",
                        "https://twitter.com/definikola/status/1495787723814281217",
                        "https://twitter.com/search?q=%234",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/definikola/status/1495787723814281217",
                        "https://forum.makerdao.com/t/framing-the-debate-on-market-liquidity-part-one-funding/13096",
                        "https://forum.makerdao.com/t/framing-the-debate-on-market-liquidity-part-two-strategic-goals/13334",
                        "https://forum.makerdao.com/t/framing-the-debate-on-market-liquidity-part-two-strategic-goals/13334",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://youtu.be/w9HQ-eayMqE",
                        "https://forum.makerdao.com/t/focus-on-5-ama-with-the-centrifuge-team/13230",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-febrero-del-2022/13404",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-14-feb-25/13462",
                        "https://forum.makerdao.com/t/weekly-relay-february-22-28-2022/13499",
                        "https://forum.makerdao.com/t/relay-semana-22-28-de-febrero-del-2022/13587"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.610231720334459
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/02/2022-21:32:18",
                    "content": "    Artem_Gordon:  In case you missed it, catch Growth Core Unit Facilitator, Nadia Alvarez’s, talk on Growing as a DAO and the learning experiences we’ve taken from that journey, and check out Retro’s State of the DAO address to catch up on what we’ve been up to lately and how we think we’re doing.   Very good representation by MakerDAO at the event, congratulations to all who attended. Good summary Artem   ",
                    "links": [
                        "https://www.youtube.com/watch?v=z9JBTlfXas4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.183333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/03/2022-21:32:50",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "714"
}