{
    "poll_list": [
        {
            "title": "Prioritize DAI Direct Deposit Module (D3M) for Maple Finance - January 10, 2022",
            "index": "12349",
            "option": "Yes",
            "supporting_mkr": "71,926",
            "highest_fraction": 0.84
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-maker-accessing-pools-of-institutional-loans-through-maple-finance/12349",
            "title": "[Signal Request] Maker Accessing Pools of Institutional Loans Through Maple Finance ",
            "index": 12349,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "collateral-app",
                "sig-status-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/lucas-manuel",
                    "index": "#1",
                    "likes": "14",
                    "time": "23/12/2021-01:32:00",
                    "content": " Overview MakerDAO has implemented the DAI Direct Deposit Module (D3M) which has the ability to distribute DAI loans to crypto and real world institutional borrowers through the Maple protocol. Utilizing D3M, DAI lending capital would be deposited into a newly created Maple DAI pool that limits lending participation to MakerDAO only. A reputable Pool Delegate would oversee the pool and would select borrowers based on a prescribed mandate from the MakerDAO community.  Signal Request Maple protocol in consultation with @Growth-Core-Unit and @Real-World-Finance is signalling to onboard a D3M for the creation of a Maple DAI pool.  Pros  Single onboarding procedure that can scale both the amount of capital used and the number of institutional borrowers over time Broad potential distribution of DAI to institutions around the world KYC and AML procedures in place with on-chain whitelisting of approved borrowers Higher risk adjusted yields across a diversified set of institutional borrowers Maker selects the Pool Delegate to use, allowing for an actor that is highly aligned with Maker’s vision of funding sustainability initiatives POC build completed by Maple proving technical feasibility (GitHub - maple-labs/dss-direct-deposit) Maple will develop and maintain the D3M integration in line with the CES enablement strategy Governance has direct control over DAI supply that is added to Maple through the Debt Ceiling   Cons  Smart contract risk Credit risk with under-collateralized or unsecured loans   Risk Mitigation  The whitelisting of addresses with deposit functionality reduces exploit risk (Maker would be the only liquidity provider) Credit Risk assessment of borrowers is performed by an approved Pool Delegate with banking, fixed income and financial services experience. Borrowers provide the Pool Delegate with up to date financial information, operational overviews and risk practices to assess the health of the business and their capacity to repay loans.   Effect In the event this signal is successful, Maple will prioritize the implementation of a DAI Maple pool D3M, and will consult with the Maker team regularly. After this, with all details fleshed out, the proposal will move to a Maker community vote. This poll will close on January 7th, 2022.    Should Maker Onboard a Maple Finance D3M?  Yes No Abstain     0 voters     ",
                    "links": [
                        "https://github.com/maple-labs/dss-direct-deposit",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-10-de-enero-de-2022/12561",
                        "https://forum.makerdao.com/t/weekly-relay-dec-14-2021-jan-3-2022/12463",
                        "https://forum.makerdao.com/t/forum-at-a-glance-january-7th-13th-2022/12614",
                        "https://forum.makerdao.com/t/maple-protocol-erc20-token-assessment-d3m-signal-request/15885",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782/43",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782",
                        "https://forum.makerdao.com/t/relay-semanal-4-10-de-enero-de-2022/12593",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/20",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/11",
                        "https://forum.makerdao.com/t/weekly-relay-january-4-10-2022/12544",
                        "https://forum.makerdao.com/t/relay-semanal-14-de-diciembre-de-2021-3-de-enero-de-2022/12531",
                        "https://forum.makerdao.com/t/forum-at-a-glance-dec-16-2021-jan-6-2022/12507"
                    ],
                    "GPT-summary": "The post explains a proposal for MakerDAO to implement the DAI Direct Deposit Module (D3M) to distribute DAI loans to institutional borrowers through the Maple protocol. The post lists pros and cons of the proposal and includes a signal request for MakerDAO to onboard a D3M for the creation of a Maple DAI pool. The post also includes a poll for MakerDAO community members to vote on whether or not to onboard the proposal. Some third parties provide constructive criticism and ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Smart contract updates"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.437930194805195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#2",
                    "likes": "7",
                    "time": "23/12/2021-02:35:50",
                    "content": "Thank you for your application @lucas-manuel, As always, the devil is in the detail, which in this case means finding the appropriate set-up that ensures:  Overall compliance with Maker’s mission and clean money community drive Seniority and expected loss levels as describer by @Eumenes Signal request Compliance with the legal requirements outlined by our counsel Compliance with the technical requirements outlined by @monkey.irish and the CES team.  I am looking forward for the teams to connect and work closely on those topics, as I believe the Signal request is compatible with Maker’s vision of becoming the indirect senior lender of the wider DeFi ecosystem. Given the role of a Compliance CU that I am recommending through the Real World Sandbox, I will abstain from voting. Regards, Luca ",
                    "links": [
                        "https://forum.makerdao.com/t/real-world-sandbox-final-deliverable-for-consultation-round/11915"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.010416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "5",
                    "time": "23/12/2021-14:16:07",
                    "content": "Polled for “Yes” but I have a few questions here.   Can you please provide some colour on why your TVL recedes during pull-back periods, such as the summer of 2021 and recently. Is it because trading desks (users) don’t have an appetite for unsecured loans during timid times? Or do you believe folks are now borrowing from other players within the DeFi realm and the OG platforms are lacking something?   Can you please provide an example of the current Borrow Rates for some of the approved Institutions–I was not allowed access to the Borrower page, I got a message saying: \"Approved Maple borrowers can login to access their dashboard.\"   What legal recourse will MakerDAO have in recouping funds if an off-chain trading desk goes bankrupt tomorrow morning?   Will MakerDAO earn MPL tokens?   And last but not least, a question for @luca_pro and @williamr with regards to the Pool Delegate, will the “delegates” for each pool consist of teammates within your Core Units, or will you outsource the responsibilities? Also, do you see an opportunity here where off-chain loans can also be constructed? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.015625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lucas-manuel",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/12/2021-15:25:40",
                    "content": "Hi @flipflopflapdelegate! Good questions - I will do my best to answer below:   Maple TVL can be found here: Dune Analytics. In terms of liquidity provided to the platform, we have been steadily increasing since our launch in May, from $17m to $512m currently. We haven’t actually had any notable pullbacks in liquidity. If you are referring to our Maple Loans by Month metric, that is because we funded our initial round of loans that were on longer terms (90 and 180 days), and no new loans were spun up in June since we were in our initial growth phase of our first pool. We expect that with the right borrowers, loan demand will not be market dependent. We have prioritized lending to market-neutral borrowers for this reason.   You can find all loan information for each pool on the Loan Details page of a given pool (e.g., Maple Finance). Our lending rates are typically between 7.5 and 15% APR.   @Joe_Flanagan is a founder at Maple and can provide more information with regards to the second two questions. ",
                    "links": [
                        "https://app.maple.finance/#/earn/pool/0xfebd6f15df3b73dc4307b1d7e65d46413e710c27"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.9891774891774885
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#5",
                    "likes": "4",
                    "time": "23/12/2021-20:01:21",
                    "content": "    flipflopflapdelegate:  And last but not least, a question for @luca_pro and @williamr with regards to the Pool Delegate, will the “delegates” for each pool consist of teammates within your Core Units, or will you outsource the responsibilities?   @flipflopflapdelegate thanks for your questions. In the case of Maple the delegates are credit underwriters of the underlying institutional collateral. These delegates are third party originators that engage Maple. MakerDAO CUs will most likely assess the underwriter, in a somewhat similar fashion to how we are assessing the arrangers like Monetalis that will underwrite the credit for the DAO. And therefore only whitelist delegates and pools that provide minimum underwriting standards in alignment with risk appetite (see risk collateral level post). There is still a significant amount of work to be done on the best operating model. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.1125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#6",
                    "likes": "4",
                    "time": "23/12/2021-21:25:34",
                    "content": "Following up on @williamr and @luca_pro 's points, here is a summary list that Maker addresses with potential underwriters/borrowers/arrangers of real world investments:  An Originator/Sponsor operational review evaluating the qualities of the parties that originate the collateral in the transaction; A Servicer/Sponsor operational review evaluating the qualities of the parties that service or may provide backup servicing for the collateral in the transaction; An assessment of the collateral performance history of the Originator/Sponsor and transaction level characteristics, estimating base and stressed collateral performance; An assessment of the overall transaction financial structure and the specific tranche, including credit enhancement, priority of payments, transaction performance thresholds and triggers, asset eligibility criteria, financial covenants and revolving credit transaction terms such as concentration limits; An assessment of the transaction legal structure reviewing primary as well as secondary documents and all relevant legal opinions, including the bankruptcy-remote SPV and the receivables transfer; A cash flow analysis determining whether the transaction cash flow and structure are adequate to make contractual payments to the investment at Investment Grade stress levels; and An assessment of the Sponsor’s reporting and portfolio management capabilities, including the ability to provide timely and accurate transaction information and manage both day to day and material events for the transaction.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.322916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#7",
                    "likes": "5",
                    "time": "24/12/2021-00:32:43",
                    "content": "As a side note, making a D3M pool available through Maple should deepen the DAO’s relationship with the largest,  most sophisticated OTC desks,  like Alameda Research. Presuming the risk parameters are well-set,  it’s our chance to integrate with a fast growing and institution-focused protocol (Maple) while supporting the larger Maker alumni network (Lucas was a Foundation SC engineer). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joe_Flanagan",
                    "index": "#8",
                    "likes": "4",
                    "time": "24/12/2021-07:33:12",
                    "content": "In response yo your 3rd and 4th bullet points @flipflopflapdelegate :  Maple has gone through an extensive legal process to set up a strong recourse framework. Every borrower on Maple signs a Master Loan Agreement that enables enforcement on any defaults. Enforcement would be initiated by a foundation linked to the Maple DAO and funded through the Maple Treasury. Legal recourse is available in the state of New York and can be pursued through arbitration and the courts. New York is the most common choice of law for international debt agreements and is upheld in the countries in which Maple’s borrowers operate.  Moreover, Maple has a General Counsel commencing in the late January 2022 and several external legal service providers in the US and Singapore.  It doesn’t seem necessary for MPL rewards to be provided for this pool. Maple is providing infrastructure for Maker to scale, for which Maker will pay a small fee. The yield earned by Maker will far exceed the stability fee expected for a product such as this. Adding in rewards will also create more integration complexity with further smart contract work required.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.441738816738817
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#9",
                    "likes": "3",
                    "time": "24/12/2021-11:25:17",
                    "content": "Thanks for your comments @flipflopflapdelegate and to the Maple team, The various groups that aim at supporting the DAO have already engaged with the Maple team and are trying to answer the questions posed by @Eumenes and others. We are aiming, starting from now, to implement the key principles we have outlined in the Sandbox Report and that the RWF CU has been extending through the Signal request on collateral quality. The process we are envisaging works, at a high level, as follows:  The Maple team will engage with RWF, our Legal supporting professionals, and CES to make sure that the construct satisfies commercial (read risk), legal, and technological requirements - a deal captain will be appointed to help coordination among teams and improve speed of process In principle the Maple team is free to submit a MIP in any shape they want, but we assume that the Maple team and the teams that work in support of the Maker CU will find an agreement on terms The official MIP application that will follow will be reviewed by those teams and a comprehensive analysis including commercial/ legal/ tech points will be published for the community An additional compliance report (i.e. a review of the review) will then be published for the community The MKR holders will have the benefit of receiving a MIP together with comprehensive report that outlines all the fine details of the application (the devil is in the detail) together with a monitoring plan and a proposed course of action  We are experimenting as we progress, but as a professional I hope that the counterparts, delegates, token holders, and broader community will appreciate the structure of checks and balances we are trying to put together. Without any delegation of power away from MKR holders we are trying to improve coordination and transparency while stepping up professionalism and institutionalisation. Having collaborated intensely with the community for the last few months, I must say that everybody within the community has been enthusiastic in stepping up the quality and intensity of the work to onboard real-world, or more generally structured, collaterals for a sustainable evolution of the DAI. Have a wonderful Christmas everyone! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.119696969696969
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#10",
                    "likes": "5",
                    "time": "28/12/2021-02:38:23",
                    "content": "Just want to add one additional technical risk consideration–one of the most sensitive aspects here is the Pool Delegate’s private key management. If their keys are compromised, DAI can be stolen for good. Due diligence on the Maker side should include ensuring they are using best practices/industry standard tools (e.g. Gnosis multisig or similar). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#11",
                    "likes": "10",
                    "time": "28/12/2021-20:22:12",
                    "content": "This looks like a great opportunity for Maker, but like all the other great and exciting opportunities we are considering I think it’s important we know what we are getting into and approach it in a way that is best set up for long term scale and success. As I understand it this is a proposed RWA onboarding, where the collateral ultimately consists of legal claims that exist in the real world and are enforced in the real world. As such, for this to properly scale, I don’t think it is appropriate to use a DDM, and instead the arranger model should be used - at least in the long run. Maple say they have a strong recourse framework that allows Maple to recover funds from the counterparties - this is very important and definitely something we need legal experts to look through before risking a material amount of funds. But we also need to consider what recourse Maker has to recover funds from Maple. The only way to do this safely and scalably is to ensure best practices are used to hold the legal claims in a trust connected to Maker Governance, with a legitimate trustee (and enforceability opinion), that is set up by an approved arranger with skin in the game through an equity risk buffer to ensure incentives are aligned. I do think it would be fine to do a trial run at smaller scale with an experimental structure such as a DDM, as long as there is a clear commitment and path to move towards a solid, scalable structure for the long run. This would be similar to what we are currently doing with the centrifuge deals. By having a clear path towards how we safely scale the relationship everyone will be better off. The relationship with Maple could be handled either by one of the existing arrangers, or a completely new arranger could be created to interact with Maple and other similar projects.  It doesn’t seem necessary for MPL rewards to be provided for this pool. Maple is providing infrastructure for Maker to scale, for which Maker will pay a small fee. The yield earned by Maker will far exceed the stability fee expected for a product such as this. Adding in rewards will also create more integration complexity with further smart contract work required.  I think being included in the yield farming rewards is a very important factor for us, at least assuming this is a typical yield farming program where all other users are eligible. If we aren’t included we are basically setting the precedent that Maker should be selectively excluded from any yield farming in general, and I just don’t understand the perspective of not treating Maker as equal with other users. Keep in mind we aren’t selling our AAVE rewards that we have farmed from the existing Aave D3M on the same terms as any other user, so that should be a good argument to include Maker in yield farming since we actually act as good long term community members that will be incentivized to increase usage of protocols we participate in over time. Another thing we need to consider is how to reconcile this with the clean money initiative. We don’t necessarily have to worry about ESG screening or negative externalities initially, as we can consider this a bootstrapping experiment at first - but once we start scaling we have to ensure that it doesn’t break the community of Dai being clean money that is backed entirely by verifiably sustainable collateral, and since this is ultimately RWA collateral I think we have to equally apply whatever frameworks we apply elsewhere. I’m very happy we got this exciting and unique proposal that opens for a horizon of new RWA/crypto hybrid collateral, and I think this provides another important example of why we need to standardize RWA through a MIP that makes it impossible at the process level to onboard RWA collateral without following a standardized approach that ensures best practice legal structure and recourse is in place for Maker. Right now all the different balls we have in the air with RWAs still seem manageable, and it doesn’t seem that complicated to make an exception and run some experiments with e.g. Maple. But we should keep in mind that soon we will be scaling our RWA facilities to 100’s of millions and even billions and by then we will need a high level capability to have rigorously enforced standardization across the board, or something will eventually give. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.774866310160428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#12",
                    "likes": "3",
                    "time": "28/12/2021-23:55:09",
                    "content": "I agree @rune, it is indeed an interesting opportunity but one that has to be analysed in detail for risk, legal, and technical considerations.     rune:  Maple say they have a strong recourse framework that allows Maple to recover funds from the counterparties - this is very important and definitely something we need legal experts to look through before risking a material amount of funds. But we also need to consider what recourse Maker has to recover funds from Maple. The only way to do this safely and scalably is to ensure best practices are used to hold the legal claims in a trust connected to Maker Governance, with a legitimate trustee (and enforceability opinion), that is set up by an approved arranger with skin in the game through an equity risk buffer to ensure incentives are aligned.   As I mentioned in my text above, the RWF team(s) have approached these conversations in the spirit that has been outlined by both the Arranger Model and the Real-World Sandbox, in order to scale the opportunity efficiently. All legal requirements will have to be put in place to ensure bankruptcy remoteness of the vehicles, appropriate asset segregation, skin in the game by underwriters, and access to collateral in case of unsatisfactory performance. All these aspects will constitute the core pillars of the assessment. In the future, we could think of this assessment as a Comprehensive Assessment that is rubberstamped by Real-World Compliance and includes i) risk, ii) legal, iii) technological considerations. In an ideal world, those teams will have engaged with the proposing party during the drafting of the proposal so that the MIP and the Comprehensive Assessment are aligned for the MKR token holders to vote on. This is what the groups have been working on and what we aim at providing in the context of this Maple application.     rune:  The relationship with Maple could be handled either by one of the existing arrangers, or a completely new arranger could be created to interact with Maple and other similar projects.   Personally, at least based on my initial understanding, I do not believe that a construct like Maple should necessarily go through an additional intermediary to access the Maker set up. They could, if they would think this needed, but given that the platform offers an infrastructure to source, aggregate, underwrite, tranche, and package loans, I would expect that such construct would be directly accessible by Maker. Subject, obviously, to Maple complying with Maker’s requirements. Arrangers are specialised parties that, thanks to their knowledge of Maker’s requirements, can facilitate capital to access the financing window - it is my belief that those shouldn’t though act as gate keepers for those counterparts that feel they have internally already the requirements to submit a proposal with a good success prospect.     rune:  Another thing we need to consider is how to reconcile this with the clean money initiative. We don’t necessarily have to worry about ESG screening or negative externalities initially, as we can consider this a bootstrapping experiment at first - but once we start scaling we have to ensure that it doesn’t break the community of Dai being clean money that is backed entirely by verifiably sustainable collateral, and since this is ultimately RWA collateral I think we have to equally apply whatever frameworks we apply elsewhere.   Based on my understanding, this could be one of the key concerns, given that most of Maple’s underlying borrowers are represented by trading and mining companies. Even if the bootstrapping phase could be less stringent, I still believe we would need to make the underlying collateral as aligned as possible to the Clean Money mandate.     rune:  Right now all the different balls we have in the air with RWAs still seem manageable, and it doesn’t seem that complicated to make an exception and run some experiments with e.g. Maple. But we should keep in mind that soon we will be scaling our RWA facilities to 100’s of millions and even billions and by then we will need a high level capability to have rigorously enforced standardization across the board, or something will eventually give.   I couldn’t agree more. The RWF teams are trying at the same time to push business forward and standardise the process. Given that such process shouldn’t be only theoretical, @williamr, myself, and the rest of the teams involved firmly believe that the next collateral application should be the blueprint of standardisation for the many to come. It is indeed exciting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.672301469022781
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Philinje",
                    "index": "#13",
                    "likes": "5",
                    "time": "06/01/2022-10:00:36",
                    "content": "I agree with several points made already, and have two basic comments/questions: 1) what is the real benefit of limiting a pool to Maker only, which seems to have some potential downsides? 2) In your under-collateralized borrowing model, what are the guidelines for the collateral? I am not seeing anything in your documentation about point 2). In the overall big picture, having a pool delegate act as an asset manager/quasi-arranger should overall reduce risk for Maker. But all of the elements of the package need to work together toward that aim. RWA are remote for Maker in the sense that the DAO is not a legal entity and in general require a high degree of specialized knowledge in order to manage risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#14",
                    "likes": "1",
                    "time": "08/01/2022-17:56:10",
                    "content": "This Signal Request has now finished. As the majority of non-abstain votes were in favour, it will move to an on-chain poll on Monday, January 10. Thank you to everyone who participated in this Signal Request. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#15",
                    "likes": "1",
                    "time": "13/01/2022-04:30:35",
                    "content": "A rather basic question but given that the loans are undercollateralized, what happens in case of emergency shutdown? Do DAI holders take a haircut in this case? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "2",
                    "time": "28/01/2022-21:11:05",
                    "content": "Any thoughts on this: https://twitter.com/cryptocatvc/status/1487151736326340608?s=21 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#17",
                    "likes": "0",
                    "time": "31/01/2022-15:43:36",
                    "content": "Concerning ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#18",
                    "likes": "0",
                    "time": "03/03/2022-01:44:33",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "488"
}