{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-schuppi-and-elpro-delegate-happy-hour-featuring-raphael-of-flipside-crypto/17023",
            "title": "The Schuppi and ElPro Delegate Happy Hour Featuring Raphael of Flipside Crypto ",
            "index": 17023,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "schuppi-elpro",
                "happy-hour"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "11",
                    "time": "04/08/2022-22:49:08",
                    "content": " The Delegate Happy Hour With Our First Ever Featured Guest! It’s none other than @rspa a.k.a Raphael of FLIPSIDE Crypto! NO INVESTMENT ADVICE This Content is for entertainment and informational purposes only, you should not construe any such information or other material as legal, tax, investment, financial, or other advice. Nothing contained on the FlipFlopFlap YouTube Channel constitutes a solicitation, recommendation, endorsement, or offer by @ultraschuppi @ElProgreso @rspa Flip Flop Flap Delegate LLC, Flipside Crypto or any third party service provider to buy or sell any cryptocurrencies, securities, or other financial instruments. Nothing in this YouTube Video constitutes professional and/or financial advice.  LFGGGGGGGGGGGGGGGG     @ultraschuppi and I had the pleasure of hosting Community Member Raphael of Flipside Crypto’s Delegate Platform. Lots of good MakerDAO topics in this recording. Please take a look and let us know what you think: 01:40 who in the world is Flipside Crypto? 02:15  @fig Medium article on his personal experience of EthCC, Paris: “The French Dispatch” 03:35 Raphael’s failed attempted at Bitcoin mining kek 04:20 Raphael’s 2017 attempt at creating a “Sh*tCoin” top kek 06:30 The tastings  Raphael: Tegernseer Pils, Bavaria   RATING: 5- Beer per Raph!! 08:55 Aperol Spritz  made by Kawau Drania, Poland  – philistine tasting by @ElProgreso – shout out to @NikKunkel  for putting me on to this lovely summer spritzer! Rating: 4- 10:25 Tasting by Shuppi of Rothaus Brewery, Baden-Württemberg, Germany  Rating: 3.8- 12:20 Review of POLLS ending August 04, 2022 – starting with the Proposal for “Tactical Re-allocation Process for Budget Adjustments” 18:50 Talking KPIs 20:30 Talking Bridges: Nomad and the first ever Metaverse “crowd-looting”, and Maker Teleport 25:30 The Merge, ETHPoW, Mining BTC w/solar energy , Geth, and getting slashed 29:10 Will ETH, or DAI become the dominant currency of the world? 32:30 Early thoughts on RWF splitting into two (2) Core Units 35:50 Future Governance Mining goals for Flipside Crypto 39:50 Merchants accepting Crypto as payment rails–Schuppi doubts Germans will ever adopt kek 42:45 MakerDAO Predictions for the next 5-months–will ETHDAI (EndGame) get implemented by December 31st?      ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmRLsRRA#vote-breakdown",
                        "https://www.youtube.com/watch?v=nX2jYbL7Kkw",
                        "https://forum.makerdao.com/t/relay-semanal-02-08-de-agosto-del-2022/17223",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/9"
                    ],
                    "GPT-summary": "The post is a recording of a delegate happy hour featuring Raphael of Flipside Crypto. The content includes discussions on various topics such as MakerDAO, beer tasting, and cryptocurrency predictions. However, there is no request for feedback, explanation of a proposal, or any other topic listed in the given list.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.699519230769231
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#2",
                    "likes": "2",
                    "time": "05/08/2022-07:41:32",
                    "content": "That was great! Thanks for having me! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#3",
                    "likes": "2",
                    "time": "05/08/2022-13:38:00",
                    "content": "Loved this @flipflopflapdelegate and @ultraschuppi - thanks for the kind shoutout. (And for dealing with Raph!) Lots of mutual respect for this crew. Thanks for adding much-needed levity to Maker with this series. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "• 3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.3125
                }
            ]
        }
    ]
}