{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ethereum-l1-gas-issue-for-little-dai-holders-investors-es-en-pt/4547",
            "title": "Ethereum L1 Gas Issue for little Dai holders/investors (ES/EN/PT) ",
            "index": 4547,
            "category": [
                "Latin America"
            ],
            "tags": [
                "feedback",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#1",
                    "likes": "6",
                    "time": "05/10/2020-14:05:53",
                    "content": "Español Saludos, soy Luis Lozada, actualmente miembro del programa piloto de grupos de acción en Latinoamérica, específicamente miembro del equipo dedicado a Venezuela. Hace algunos días expresé mi preocupación sobre los recientes precios del Gas en la red de Ethereum en el rocket chat, con una respuesta que me indicaba solo “tener paciencia”. Actualmente la comunidad de Latinoamérica ha encontrado en Dai un refugio seguro para sus ahorros, incluso en la emergente comunidad de África donde Sahabia ha hecho un gran trabajo, pero dados los recientes costos de realizar transacciones en la red de ETH se ha vuelto totalmente inviable recomendar a las comunidades el uso de Dai, claro como afecta a Dai afecta por igual a USDT y USDC (stablecoins famosas por igual), con la diferencia de que Dai es mucho más atractiva cuando entra a los distintos protocolos DeFi que ofrecen oportunidades de ahorro y de ingresos mayores, muy por encima de las otras dos stablecoins ya mencionadas, además de Dai ser descentralizada claro está. En países como Argentina, Brasil o Venezuela, donde los salarios mínimos llegan a bajas cantidades en dólares (especialmente en los países mencionados donde no llegan ni ha 300 USD) en Venezuela (mi país) por ejemplo, se requieren de al menos 300 USD para poder subsistir o mantenerse “bien” económicamente y por primera vez el salario llegó a estar por debajo de $1, necesitando entonces de 300 salarios aproximadamente (o 300 DAI para traducir) y así poder vivir con una buena calidad de vida. En los países latinos la gran mayoría de las personas que buscan a las criptomonedas no son traders o personas que quieran adentrarse profundamente en el ecosistema, simplemente son personas que buscan una manera para ahorrar y que el esfuerzo de su trabajo no sea en vano. Aquí entra en juego el Gas, resulta casi imposible intentar convencer a una persona de adentrarse en el mundo de las DeFi o que simplemente use Dai para ahorrar en dólares cuando al momento de comentar que cualquier envío de Dai o interacción con una plataforma como por ejemplo MakerDAO cuesta más de 2$ (y esto con el Gas por debajo de los 60 Gwei al precio actual de ETH). Esto como he mencionado, ha dificultado enormemente la tarea de difusión para la adopción de Dai. Sin embargo, opciones como la wallet de Dharma han surgido para presentar una alternativa, aunque esta al no tener una interfaz tan amigable y estar enteramente en inglés complica su uso para el individuo promedio. Los altos costos del gas incluso han impedido que los exchanges de Cripto a FIAT puedan ofrecer de una manera óptima su servicio a las personas, incurriendo en la desactivación total de Tokens ERC20 o unos precios de Compra-Venta inaccesibles, incluso los intercambios p2p se ven afectados por tales costos. Siguiendo el principio de Maker “servir al desatendido”, mi pedido es un llamado a la comunidad para saber si poseen algún conocimiento o herramienta que pueda ser utilizado en el corto-mediano plazo para solventar este problema que enfrentamos las personas de la región latina. Ya conocemos de las herramientas que empiezan a posicionarse en la L2 de Ethereum como ciertas alternativas pero no terminan por ser muy conocidas, al igual que el uso de xDai, si bien posee comisiones bajas, su uso no es tan amplio como el de Dai y el bridge de L2 a L1 se torna complicado. Incluso me gustaría saber si es posible ofrecer las herramientas de Maker (Oasis Save, Borrow y Trade) en L2, o con el mismo uso de xDai de alguna forma, incluso la creación de alguna wallet (escuché sobre una Oasis Pay pero no recuerdo bien) que pueda hacer de bridge y que las personas manejen sus Dai de alguna forma en L2 para disminuir los costos del Gas y hacer que Dai pueda volverse viable en las regiones de economías emergentes o que han sufrido mucho por la devaluación de sus monedas respecto al dólar. Sin más, agradezco su tiempo. ENGLISH Greetings, I am Luis Lozada, member of the pilot program of action groups in Latin America, specifically a member of the team dedicated to Venezuela. This post was written in Spanish and translated into English and Portuguese for greater inclusion, a few days ago I expressed my concern about the recent Gas prices in the Ethereum network in the rocket chat, with a response that told me only “be patient” . Currently the Latin American community has found in Dai a safe haven for their savings, even in the emerging African community where Sahabia has done a great job, but given the recent costs of transacting on the Ethereum network it has become totally unfeasible to recommend to the communities the use of Dai, of course it affects Dai equally affects USDT and USDC (famous stablecoins alike), with the difference that Dai is much more attractive when it connect with different DeFi protocols that offer opportunities for savings and higher income, above the other two stablecoins already mentioned, in addition to Dai being decentralized of course. In latam countries countries such as Argentina, Brazil or Venezuela, where minimum wages reach low amounts in dollars (especially in the countries mentioned where they do not even reach 300 USD), in Venezuela (my country) for example, at least 300 USD is required to to be able to subsist or stay “well” economically and for the first time the salary came to be below $ 1, thus needing approximately 300 salaries (or 300 DAI to translate) and thus being able to live with a good quality of life. In Latin countries, the vast majority of people who are looking for cryptocurrencies are not traders or people who want to go deep into the ecosystem, they are simply people who are looking for a way to save money, and that the effort of their work is not in vain. Gas comes into play here, it is almost impossible to try to convince a person to enter the world of DeFi or to simply use Dai to save dollars when commenting that any Dai shipment or interaction with a platform such as MakerDAO costs more than $ 2 (and this with Gas below 60 Gwei at current ETH price). This as I have mentioned, has made the diffusion task for the adoption of Dai enormously difficult. However, options such as the Dharma wallet have emerged to present an alternative, although not having such a friendly interface and being entirely in English complicates its use for the average individual. High gas costs have even prevented Crypto-to-FIAT exchanges from being able to optimally offer their service to people, incurring the total deactivation of ERC20 Tokens or inaccessible Buy-Sell prices, even p2p exchanges are seen affected by such costs. Following one of MakerDAO principles “serve the underserved”, my request is a call to the community to know if they have any knowledge or tools that can be used in the short-medium term to solve this problem that the people of the Latin region face. We already know of the tools that are beginning to position themselves in Ethereum’s L2 as certain alternatives but they do not end up being well known, like the use of xDai, although it has low commissions, its use is not as wide as that of Dai and the bridge from L2 to L1 becomes complicated. I would even like to know if it is possible to offer the Maker tools (Oasis Save, Borrow and Trade) in L2, or with the same use of xDai in some way, even the creation of a wallet (heard about something like Oais pay, don’t know very well) that can act as a bridge and that people manage their Dai in some way in L2 to lower Gas costs and make Dai viable in regions of emerging economies or that have suffered a lot from the devaluation of their currencies against the dollar. Without further ado, I appreciate your time. PORTUGESE Saudações, sou Luis Lozada, membro do programa piloto de grupos de ação na América Latina, especificamente membro da equipe dedicada à Venezuela. Este post foi escrito em espanhol e traduzido para inglês e português para maior inclusão, há poucos dias expressei minha preocupação com os preços recentes do gás na rede Ethereum no rocket chat, com uma resposta que me dizia apenas “seja paciente”. Atualmente a comunidade latino-americana encontrou em Dai um refúgio seguro para suas economias, mesmo na comunidade africana emergente onde Sahabia fez um ótimo trabalho, mas dados os custos recentes de transação na rede Ethereum, tornou-se totalmente inviável recomendar ao comunidades o uso do Dai, é claro que afeta o Dai, afeta igualmente o USDT e o USDC (famosos stablecoins), com a diferença de que o Dai é muito mais atraente quando se conecta com diferentes protocolos DeFi que oferecem oportunidades de economia e maior renda, acima do outro duas stablecoins já mencionadas, além da Dai ser descentralizada, é claro. Em países da América Latina, países como Argentina, Brasil ou Venezuela, onde os salários mínimos chegam a valores baixos em dólares (principalmente nos países mencionados onde não chegam nem a 300 USD por mês), na Venezuela (meu país) por exemplo, pelo menos 300 USD é necessário para ser capaz de subsistir ou ficar “bem” economicamente e pela primeira vez o salário ficou abaixo de $ 1, necessitando de aproximadamente 300 salários (ou 300 DAI para traduzir) e, portanto, ser capaz de viver com uma boa qualidade de vida. Nos países latinos, a grande maioria das pessoas que procuram criptomoedas não são comerciantes ou pessoas que querem se aprofundar no ecossistema, são simplesmente pessoas que procuram uma maneira de economizar dinheiro, e que o esforço de seu trabalho não é em vão. O GAS entra em jogo aqui, é quase impossível tentar convencer uma pessoa a entrar no mundo do DeFi ou simplesmente usar o Dai para economizar dólares ao comentar que qualquer remessa Dai ou interação com uma plataforma como a MakerDAO custa mais de $ 2 ( e isso com o gás abaixo de 60 Gwei ao preço atual da ETH). Isso, como mencionei, tornou a tarefa de difusão para a adoção de Dai muito difícil. No entanto, opções como a carteira Dharma surgiram para apresentar uma alternativa, embora não tendo uma interface tão amigável e sendo inteiramente em inglês complique seu uso para o indivíduo médio. Os altos custos do gás impediram até que as trocas Crypto-to-FIAT pudessem oferecer seus serviços de maneira otimizada as pessoas, incorrendo na interrupção total de negociação e transaferencias dos Tokens ERC20 ou preços inacessíveis de compra e venda, mesmo as trocas p2p são vistas e afetadas por tais custos. Seguindo um dos princípios da MakerDAO “servir aos carentes”, meu pedido é um apelo à comunidade para saber se eles têm algum conhecimento ou ferramentas que possam ser usadas a curto e médio prazo para resolver este problema que os povos da região latina enfrentam . Já conhecemos as ferramentas que começam a se posicionar no L2 da Ethereum como certas alternativas mas acabam não sendo muito conhecidas, como o uso do xDai, embora tenha baixas comissões, seu uso não é tão amplo quanto o do Dai e a ponte de L2 para L1 torna-se complicada. Gostaria até de saber se é possível oferecer as ferramentas Maker (Oasis Save, Borrow and Trade) em L2, ou com o mesmo uso do xDai de alguma forma, até mesmo a criação de uma carteira (ouvi falar de algo como Oais pay , não sei muito bem) que pode funcionar como uma ponte e que as pessoas administram seu Dai de alguma forma em L2 para reduzir os custos do gás e tornar o Dai viável em regiões de economias emergentes ou que sofreram muito com a desvalorização de suas moedas em relação ao dólar. Sem mais delongas, agradeço seu tempo. ",
                    "links": [
                        "https://www.lanacion.com.ar/el-mundo/derrumbe-primera-vez-salario-minimo-es-menor-nid2461947",
                        "https://elpitazo.net/economia/claves-el-salario-minimo-venezolano-en-comparacion-con-otros-de-latinoamerica/#:~:text=Brasil%3A%20hubo%20un%20reajuste%20de,al%20previsto%20en%20el%20presupuesto.",
                        "https://www.lanacion.com.ar/el-mundo/derrumbe-primera-vez-salario-minimo-es-menor-nid2461947",
                        "https://forum.makerdao.com/t/community-call-lets-talk-about-layer-2-apr-13-16-00-utc/7454",
                        "https://forum.makerdao.com/t/brainstorm-2021-mission-and-objectives/5809"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.392939903234021
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "05/10/2020-14:48:11",
                    "content": "Thank you for voicing and posting your concerns @Lozadaluis12 this is something that I and others have ask in the past. I previously had ask the question to the community if DAI should run simultaneously on another chain:  Should MakerDAO/DAI run Simultaneously on another Chain? You’re absolutely right–the average Jane and Joe cannot take advantage of using DAI. And the promise of Eth 2.0 is years (with an “s”) away. Which perhaps means that the people of South America won’t have access to DAI, unless there’s a user-friendly Rollup developed within the next 6-months IMO. But, where there’s a will, there is a way. Let’s see what develops in the next few months going into 2021. This post here will give you an idea of what Vitalik B. is visualizing: https://ethereum-magicians.org/t/a-rollup-centric-ethereum-roadmap/4698 BTW–the First Comment to Vitalik’s post by souptacular is super interesting. ",
                    "links": [
                        "https://ethereum-magicians.org/t/a-rollup-centric-ethereum-roadmap/4698",
                        "https://ethereum-magicians.org/u/souptacular"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.280303030303031
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Velasquez",
                    "index": "#3",
                    "likes": "2",
                    "time": "05/10/2020-15:05:28",
                    "content": "Saludos desde Argentina Luis, por acá David de RemesWorld. Nosotros hemos estado pensando en Loopring Pay Cómo una alternativa altamente viable para solventar el tema de micropagos. El tema está en crear una pasarela para pasar de L1 a L2 de manera más sencilla. Andamos ideando algunas cosas, pero al mediano plazo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#4",
                    "likes": "2",
                    "time": "05/10/2020-15:28:26",
                    "content": "Thanks for the reply @flipflopflapdelegate, i’m hoping may come in the near future real solutions for our region and the people with no much money. I’m seeing lot of protocols joining to the L2 solutions, let’s see what’s next! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "0",
                    "time": "21/05/2021-23:36:52",
                    "content": "Desearía saber que avances lograron y como siguen operando con DAI con los problemas actuales del gas. ¿Tienen pensado usar una sidechain? ¿U otra L2 como Matic? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}