{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-january-18-24-2022/12829",
            "title": "Weekly Relay: January 18 - 24, 2022 ",
            "index": 12829,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "7",
                    "time": "25/01/2022-01:35:55",
                    "content": " 2278×1100 64 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop-shop for MakerDAO updates.  PDF version available here for download.   Current Events  This Week in Governance  Community Deep Dai-ve  Mark your Calendar  Useful Links  Have Feedback?   Current Events  Flappy Friday Friday was one for the history books, another stress test of the liquidation system, not dissimilar to the COVID market meltdown of March 2020. The protocol performed quite well, processing $134MM of liquidations through the improved Liquidations 2.0 system without any major issue. This liquidation event was the largest in MakerDAO’s history. As a result, approximately 15.5MM in penalty fees were collected and sent to the Surplus Buffer. During this time, a few Core Units took the opportunity to claim their budgets while the rest of the excess surplus was sent to buy and burn MKR through Surplus Auctions. The RISK Core Unit put out a timely analysis on the performance of the Collateral and Surplus auctions showing:  …that collateral auctions performance was good in terms of outcome for Maker as all penalty fees got collected, but less efficient when looking at the amount of collateral received back by certain larger vault owners that got liquidated. As for FLAPs(surplus auctions), the slippage or the auction inefficiency was much lower than initially expected, thanks to community bidding through Flap UI and helping protocol avoid 0 bids.  The report covers many specific details of Friday’s auctions, including specific coverage of the largest concern early in the day regarding the 7-siblings vault owner that had 632m debt at risk, as well as the eventual Flap Auction performance that incurred larger-than-acceptable slippage.  the (surplus auction) bids were not as efficient as they normally are (on average, about 3-4% slippage measured historically). The effective slippage of these auctions was 19.55% which means protocol overspent about 2.5m DAI for MKR collected. Assuming regular slippage of 3-4%, the inefficiency cost of this event measures about 2.1m.  Follow-up governance actions are pending. Recognized Delegate, @Ultraschuppi posted an Urgent Signal Request to temporarily deactivate MKR burn by setting the Surplus Buffer to 250MM. This is intended as a short-term action to buy the DAO time for determining the wisest next steps. Some options include; rate-limiting surplus auctions, converting them to the dutch auction mechanism(Liquidations 2.0), and longer-term solutions like reconsidering the tokenomics of the burn mechanism itself.  MKT-001 Offboarding This morning the final votes went through on several Ratification Polls, which involved the offboarding of the Facilitator and Budget of MKT-001, the Content Production Core Unit effectively off-boarding the entire team. Follow-up steps for the complete transition are being coordinated. Originally ratified nine months ago in late April of 2021, the Core Unit focused on content marketing–hoping to spur more engagement and improve educational resources at MakerDAO. Offboarding proposals for their facilitator and team budget were posted in early December by Deimos, a pseudonymous member of the community. The proposal set came after some shared opinions regarding the underperformance of their team. The controversial proposal set sparked a broader discussion about the offboarding process for Core Units and Facilitators, its issues, and ways in which it could be improved.  Governance and Risk Format Change The Governance and Risk call continues to evolve, this time to better suit stakeholder information needs with the addition of an Initiative Updates segment. A new Initiative Tracking and Stakeholder Alignment Framework enables the segment to pull milestones and statuses for major initiatives from their coordination calls. This week we will be covering Layer 2, On-Chain, & Off-Chain Collateral Management initiatives. This segment will focus on select initiatives at first, expanding to others as their milestones are more clearly defined and tracked.   This Week in Governance  MIPs Weekly MIPs Update #71  1121×747 34.1 KB  RFC and FS Dates for reference and existing proposals can be seen here.  The beginning of week four marks the closure of the Ratification Polls for January, which went live two weeks ago on Monday, January 10th. All the proposals passed.  Coming Up:  Next formal submission window will open on Monday, February 7th! If you are planning to formally submit your proposal on February’s Governance cycle, remember that February 2nd is the last day for modifications.   Executive Vote MOMC Parameter Changes, Decrease the GUNIV3DAIUSDC2-A Liquidation Ratio - January 21st, 2022  MOMC Parameter Changes As per this governance poll on the latest MakerDAO Open Market Committee proposal, the following parameter changes were made in the Maker Protocol:     Vault Type Parameter Previous New Change     ETH-A Stability Fee 2.75% 2.5% -0.25%   WSTETH-A Stability Fee 4.0% 3.0% -1.0%   LINK-A Maximum Debt Ceiling 140M DAI 100M DAI -40M DAI   YFI-A Maximum Debt Ceiling 130M DAI 50M DAI -80M DAI   UNI-A Maximum Debt Ceiling 50M DAI 25M DAI -25M DAI   UNIV2UNIETH-A Maximum Debt Ceiling 20M DAI 5M DAI -15M DAI   GUSD-A Maximum Debt Ceiling 5M DAI 0 DAI -5M DAI   AAVE D3M Target Borrow Rate 3.9% 3.75% -0.15%   AAVE D3M Target Available Debt 25M DAI 50M DAI 25M DAI   AAVE D3M Maximum Debt Ceiling 100M DAI 220M DAI 120M DAI   GUNIV3DAIUSDC2-A Maximum Debt Ceiling 10M DAI 500M DAI 490M DAI   GUNIV3DAIUSDC2-A Stability Fee 1.0% 0.5% -0.5%   GUNIV3DAIUSDC2-A Liquidation Ratio 105% 102% -3%     For more information on the GUNIV3DAIUSDC2-A Liquidation Ratio Reduction, see this thread on the MakerDAO Forum.   Active Governance Polls  There are currently no active governance polls. Last week contained 13 governance polls that have all passed.  Check out last week’s issue of Weekly Relay for more information.  Community Greenlight Polls     Collateral MIP9 Poll MIP6 Application     STABLE-TBILL Ends 02/07 4PM UTC Application   STABLE-NOTE Ends 02/07 4PM UTC Application    Check out an ‘at-a-glance’ view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests [Urgent Signal Request] Stop MKR burning Signal Request Ends January 25th Market movements during 2022-01-22 resulted in a significant amount of vault liquidations that led to a massive spike of flap auctions. We do not have a Liq 2.0 equivalent for the MKR-burn. Therefore, a lot of the added income by the penalty fees of the liquidations have been sold in multiple parallel MKR-auctions (`flap’s), resulting in a huge slippage. In response, @ultraschuppi suggests to:  Deactivate the currently configured lerp of 1MM/week for the Surplus Buffer and instead set the Surplus Buffer to 250 MM to help buy us some time to implement a viable solution to this problem.  Offloading TUSD-A Signal Request Ends February 4th A discussion and signal-request submitted over a year ago passed and set the Debt Ceiling of TUSD-A to 0 DAI. Today, there is still about ~26MM DAI of outstanding debt, and the increase of the Stability Fee to 1% has not changed anything. In response, @ultraschuppi offers three options as potential changes to TUSD-A and asks the community whether they want to:  Offload to a new TUSD-PSM with a DC of 0. Activate liquidations on TUSD-A keepers. Keep as is and do nothing.  Extend the Delegate Compensation Trial Signal Request Ends January 31st The initial Signal Request that approved the Delegate Compensation Trial implemented a three-month trial period. We recognized that initial parameter requirements were too harsh and subsequently introduced the Performance Modifier via Signal Request, which has been added to MIP61. As things stand, MIP61 has not been formally submitted, as there are still a few changes being discussed. Consequently, January 2022 is the final month currently covered by the trial, and compensation for Recognized Delegates would cease after this month. In response to these events, @Patrick_J asks whether we should extend the Delegate Compensation Trial by a maximum of 6-months and end it when MIP61 is ratified.   Community Deep Dai-ve  Tweet of the Week     twitter.com    Jonathan Mann @songadaymann  the ballad of seven siblings https://t.co/nNTXKuch8W         3:07 AM - 22 Jan 2022           1.4K                290             Forum Insight Maker Academy: New Incubating Core Unit Sustainable Ecosystem Scaling presents a new Core Unit, Maker Academy, which aims to assemble and facilitate the production of educational content for MakerDAO by working with various Core Units and teams to help guide creators, encourage knowledge sharing, and promote potential new hires! Check out the post for additional information about the facilitator and their next steps. Returning excess budget from RWF in DAI or MKR?  A significant amount of liquidation triggered slippage on flap auction during December 4th, 2021. In response, mandated actors were suggested to withdraw funds to avoid more “bad flap.” Real-World Finance used their funds to buy approximately 100 MKR, which converted those DAI at a much better rate than all-around flap auctions. @SebVentures now asks the community whether they should convert the MKR back to DAI and send them to the Surplus Buffer, which would incur a 5% slippage when burned, or send them to the DSPauseProxy for future use (or burn) by the DAO. Check out the latest Forum at a Glance.   Meetings and Events  Last Week’s Call Recordings   Governance and Risk Call #175   Video | Snippet     Core Unit Launch Pod Sessions | Session #23: Maker Talent Core Unit   Video | Editorial Summary      This Week’s Calls  Governance & Risk   Join Link | Agenda - Thursdays at 16:00 UTC   Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Content Production - Wednesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC    Useful Links Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for Stakeholders; Protocol analytics, Dai analytics, collateral & liquidation metrics, governance history, and auctions data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs Dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is purely for information and communication purposes only. ",
                    "links": [
                        "https://forum.makerdao.com/t/flappy-friday-clip-and-flap-analysis/12790",
                        "https://forum.makerdao.com/t/flappy-friday-clip-and-flap-analysis/12790#h-7-siblings-vault-owner-2",
                        "https://forum.makerdao.com/t/flappy-friday-clip-and-flap-analysis/12790#flaps-surplus-auctions-3",
                        "https://forum.makerdao.com/t/urgent-signal-request-stop-mkr-burning/12806",
                        "https://mips.makerdao.com/mips/list?&search=mkt-001&orderDirection=ASC",
                        "https://forum.makerdao.com/t/mip41c5-sp3-facilitator-offboarding-mkt-001/12058",
                        "https://forum.makerdao.com/t/mip40c3-sp49-modify-core-unit-budget-mkt-001/12059",
                        "https://youtu.be/R8Tk6Ie1ko4?t=826",
                        "https://docs.google.com/spreadsheets/d/18FFp6aG39zW7uLnHcoqBhKNHe2FbK96txRoFFQn7lt0/edit#gid=24314937",
                        "https://forum.makerdao.com/t/weekly-mips-update-71/12826",
                        "https://docs.google.com/spreadsheets/d/10qxaRjm9T5LCgnYwwYqPqEjKu9yl2F1YHqdDD5SktJc/edit?usp=sharing",
                        "https://vote.makerdao.com/executive/template-executive-vote-momc-parameter-changes-decrease-the-guniv3daiusdc2-a-liquidation-ratio-january-21-2022?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2022-01-07/12522",
                        "https://forum.makerdao.com/t/request-to-lower-the-collateralization-ratio-for-guniv3daiusdc2-a/12615",
                        "https://forum.makerdao.com/t/weekly-relay-january-11-17-2022/12699",
                        "https://vote.makerdao.com/polling/Qmdf2bbL?network=mainnet",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-stable-us-treasury-securities-up-to-12-months-duration/12503",
                        "https://vote.makerdao.com/polling/QmUXDkKr?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-stable-us-treasury-securities-between-2-and-10-years-duration/12505",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/urgent-signal-request-stop-mkr-burning/12806",
                        "https://forum.makerdao.com/t/signal-request-offloading-tusd-a/12814",
                        "https://forum.makerdao.com/t/tusd-is-undergoing-a-material-change-to-its-ownership-structure-is-there-a-process-for-reducing-exposure-in-the-event-of-a-material-change/5691",
                        "https://forum.makerdao.com/t/signal-request-manage-tusd-exposure-due-to-ownership-change/5821",
                        "https://forum.makerdao.com/t/signal-request-extend-the-delegate-compensation-trial/12686",
                        "https://forum.makerdao.com/t/signal-request-should-we-introduce-a-performance-modifier-to-the-delegate-compensation-trial/11850",
                        "https://twitter.com/songadaymann/status/1484724418421088259",
                        "https://twitter.com/songadaymann/status/1484724418421088259",
                        "https://twitter.com/songadaymann/status/1484724418421088259",
                        "https://t.co/nNTXKuch8W",
                        "https://twitter.com/songadaymann/status/1484724418421088259",
                        "https://forum.makerdao.com/t/maker-academy-new-incubating-core-unit/12761",
                        "https://forum.makerdao.com/t/returning-excess-budget-from-rwf-in-dai-or-in-mkr/12643",
                        "https://etherscan.io/tx/0xce661169e1fb4e52e6dfed3bc09d8e96b8f41dc93f927c4caaec803db9e95501",
                        "https://forum.makerdao.com/u/sebventures",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://www.youtube.com/watch?v=R8Tk6Ie1ko4",
                        "https://forum.makerdao.com/t/governance-and-risk-175-thursday-january-20-17-00-utc/12747/2",
                        "https://www.youtube.com/watch?v=E3K3DhsNugM",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-23-maker-talent-core-unit/12596/2",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://us02web.zoom.us/j/7091120339?pwd=ek9XQWV0c0FJSCt2MHcwWmpWYkd3UT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-18-24-de-enero-de-2022/12876",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-jan-17-28/12926"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.604555897319056
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "26/01/2022-16:52:45",
                    "content": "Excellent summary Artem, I loved Maker’s song.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "1",
                    "time": "26/01/2022-17:15:15",
                    "content": "Thanks! Yes, the song is very fitting and timely, haha ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "09/02/2022-17:15:31",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}