{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ses-weekly-status-update-incubation-program-tracks-core-unit-ideas/13433",
            "title": "SES Weekly Status Update: Incubation Program Tracks & Core Unit Ideas ",
            "index": 13433,
            "category": [
                "Core Units",
                "Sustainable Ecosystem Scaling"
            ],
            "tags": [
                "ses-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "7",
                    "time": "24/02/2022-18:55:59",
                    "content": " 960×540 272 KB   This Week’s Topic: Incubation Program Tracks & Core Unit Ideas  Join us here! on 2021-02-25T15:30:00Z  This Friday, we will introduce 3 proposed tracks for v2 of the MakerDAO SES Incubator and a list of core unit ideas that could form from those tracks. The MakerDAO SES team has been working to compile a list of potential Core Units to incubate during the remainder of 2022. This list has been built by MakerDAO SES in collaboration with other Core Units and stakeholders in preparation of the Q2 launch of the restructured SES Incubator aiming to increase the throughput and quality of facilitator candidates. MakerDAO SES is calling for the community to engage in thoroughly reviewing the list, provide questions, comments, and additional Core Unit ideas to consider. Joins us Friday to jumpstart the conversation, and explore the potential future for our incubator. Add the SES Status Update Call to your calendar  Other Updates  960×540 55.9 KB   Incubator News  960×540 53.3 KB    MakerTalent has 3 days remaining on their vote to be ratified as a core unit. The Real-world Asset Portfolio Incubator core unit has been renamed to the Lending Incubator (LINC).   With the Community!  960×540 89 KB  Focus On #5: Centrifuge AMA Recording Live! Buidl Sustainably! Decentralized Workforce Intel Recording Live! State of the DAO Recording Live!  Contacts  960×540 56.3 KB   Links  Discord Drive Notion   @ses-core-unit ",
                    "links": [
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=NnYzMnYxZG9jOWwwY3FlcWduODdxcmNqZDRfMjAyMjAyMjVUMTUzMDAwWiBtYWtlcmRhby5jb21fM2VmaG0yZ2hpcGtzZWdsMDA5a3RuaW9tZGtAZw&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://vote.makerdao.com/polling/QmTKSjCM?network=mainnet#vote-breakdown",
                        "https://youtu.be/AWFKI4SRIrI",
                        "https://www.twitch.tv/videos/1302091637?t=02h47m42s",
                        "https://www.youtube.com/watch?time_continue=1&v=z9JBTlfXas4&feature=emb_logo",
                        "https://discord.gg/h64CXspejc",
                        "https://drive.google.com/drive/u/1/folders/0AFnWIfR4at7jUk9PVA",
                        "https://ses.makerdao.network/",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-february-2022/13726"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.170454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "1",
                    "time": "26/02/2022-17:21:27",
                    "content": "Just watched the replay. Great presentation ! Love the legal core unit talk ! I can see a lot of thought has been put into this. I look forward to being able to contribute on the legal front. As was highlighted well in the presentation, new legal issues are emerging on a regular basis and require continued vigilance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.741477272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#4",
                    "likes": "2",
                    "time": "04/03/2022-14:51:44",
                    "content": "Cross posting for visibility:   Here is our list of Core Unit ideas for possible incubation during v2 of the SES Incubator. We want the community’s input! Weight in on the pros and cons of these potential core units, and suggest your own ideas for discussion.  Here is a video recording of the 25-February SES Status Update discussing the tracks and Core Unit ideas approach.  SES is asking for the community’s thoughts and ideas to help shape the future of Core Units at the DAO, and the SES Incubator v2. Help us confirm our research or explore new ideas today. ",
                    "links": [
                        "https://youtu.be/NbQ2xrnRN8U",
                        "https://forum.makerdao.com/t/list-of-core-units-ideas-request-for-feedback/13594"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.613636363636364
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#5",
                    "likes": "0",
                    "time": "04/03/2022-15:00:18",
                    "content": "I am very impressed with what I have read so far, especially the legal resiliency track, which is where I think I can help the most. In addition to the self insurance core unit, which is extremely important, I think the legal network coordination is going to be significant as we need to make sure whatever law firms are used are well-qualified and properly vetted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.637500000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "02/06/2022-15:01:10",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}