{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-october/18584",
            "title": "Immunefi Security CU Update for October ",
            "index": 18584,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "2",
                    "time": "30/10/2022-13:26:09",
                    "content": " Immunefi Security CU Update for October  computer motherboard, electronic components, printed circuit boards, ribbon cables :: tiny spiders walking :: photorealistic, octane render --no blur --chaos 5 --aspect 3:21536×1024 312 KB  Credit: Midjourney  This month 20 bugs (IDs 11855–12911) were submitted through the bug bounty program.    Out-of-scope bugs 10853 & 10860 (both reported by the same whitehat) Snowflake Credentials Leak resulted in a bounty payout of 2000 DAI   Bug 11789 from last month is still under consideration. DUX provided proof that two bugs from last month (11314 & 11424) were already known weaknesses. These bugs were closed with no payout. Bug 11644 was deemed incomplete and invalid. Out-of-scope bug 12019 resulted in a doc fix and payout of 250 DAI   Bug 12767 is open, waiting for additional clarification from the whitehat reporter.   Given the DAO’s flat power structure, Core Units cannot compel other Core Units to do anything. However, we would be derelict if we kept silent while critical infrastructure remained unprotected.  Nik from Oracles and I had a meeting at the end of 2021. I recall letting him know that he could join whenever he wanted. That was pretty much the last time that I heard from him. I followed up on the #oracles-public Discord channel in Feb and Jul 2022. No response. I followed up in a DM in Sep. No response. During the Oct 25 Mandated Actors meeting, where Nik was in attendence, I briefly reviewed the bug bounty program and asked when Oracles would join. No response. There are legitimate reasons not to prioritize joining a bug bounty program. However, not being willing to communicate those reasons seems unprofessional. Since ISCU is powerless, but cannot remain silent indefinitely, we ask MKR holders and their delegates to decide what to do about the situation. @Recognized-Delegates    In a step toward decentralized front-end hosting, ISCU posted a link to the PSM front-end hosted on Swarm. The MCD Pause Proxy is added as beneficiary for our operational wallet.^  Office hours are Mon 11pm UTC alternating with Wed at 3pm UTC. Security Stakeholder Alignment calls are monthly on the third Wednesday starting 2022-08-17T15:30:00Z    Budget transparency reporting    Link to the previous month’s progress report     Anticipated soon   Budget renewal and mandate refresh will be up for vote We continue to work with GovComms on the Emergency PlayBook  ",
                    "links": [
                        "https://etherscan.io/tx/0x257ff5ef30ef754212f905d68260d9760d32c5f83df2932a53fe3d1f85acb928",
                        "https://github.com/makerdao/mcd-docs-content/pull/4",
                        "https://etherscan.io/tx/0xb852f77a110df5df066dffc65f91d052e6b233b83393aa07f8ac6f9adff46af4",
                        "https://forum.makerdao.com/t/toward-decentralized-front-end-hosting/18265",
                        "https://etherscan.io/tx/0x22bf0c078c9f8d365927b60457aa7f56939ab9b73ec261e5d60d1d8d275b4bfd",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-september/18170",
                        "https://forum.makerdao.com/t/mip40c3-sp83-modify-immunefi-security-core-unit-budget-is-001/18209",
                        "https://forum.makerdao.com/t/mip39c2-sp38-modify-immunefi-security-core-unit-mandate-is-001/18208",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-october-2022/18650",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-november/19006"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.945833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/11/2022-16:07:29",
                    "content": "I had posted in our status update (above) that months had elapsed since we had received any communication from Nik of Oracles. We were relieved to finally get an update:  image843×206 42.9 KB  Thank you @Doo_StableLab and @NikKunkel  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "1",
                    "time": "22/11/2022-16:45:16",
                    "content": "While you probably meant it in good faith, StableNode doesn’t encourage sharing DM to public without asking relevant parties first. I believe the recent RWF case shed light on such point as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "20/02/2023-16:45:24",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-march/14322",
            "title": "Immunefi Security CU Update for March ",
            "index": 14322,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "2",
                    "time": "30/03/2022-17:20:50",
                    "content": " Recent Progress  During March, 25 bugs were submitted through the bug bounty program.  However, all of them were found invalid by Immunefi Services Triaging.   We have introduced a bug bounty amendment to allow more flexibility in scope.   Our amendment to enable Rapid Payment for Small Bug Bounties passed To facilitate different escalation protocols, smart contract and website vulnerabilities will be separated into two separate bug bounty programs.   Tips for working with the bug bounty program  Always use the Immunefi Dashboard for communications. Respond within 48 hours for Critical and High severity bug reports. A simple confirmation that someone is looking at the report will suffice.   Try to close medium/low severity in 7 days and high/critical severity in 14 days. If you know that you will need more time, ask for it. Hackers are generally understanding, but appreciate advanced notice. Don’t try to negotiate severity or bounty amount with the hacker. Coordinate with ISCU.   If anything needs to be changed with the bug bounty program, let us know. Provide feedback. We’re here to make the process work.     Ongoing  Operational security audits of Protocol Engineering and TechOps   DeFi Safety delivered a draft report on critical infrastructure. We will be sharing this soon. Office hours Mon 11pm UTC alternating with Wed at 3pm UTC. We will add more time zone coverage soon.   Security Stakeholder Alignment calls every Wednesday, started 2022-01-26T15:30:00Z    Budget transparency reporting    Link to the previous month’s progress report     Anticipated soon  Expect the first fire drill sometime, someday in April.   In collaboration with GovComms, an Emergency PlayBook   Delayed  Educational content   Backups for critical monitoring infrastructure    ",
                    "links": [
                        "https://forum.makerdao.com/t/mip4c3sp3-amend-mip64-to-allow-more-flexibility-in-scope/14200",
                        "https://vote.makerdao.com/polling/QmRdVByP#poll-detail",
                        "https://bugs.immunefi.com",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-february/13488",
                        "https://forum.makerdao.com/t/fire-drill-request-for-discussion-informal-polls/13799",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-april/14846",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.70812324929972
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/04/2022-20:39:08",
                    "content": "    psychonaut:  To facilitate different escalation protocols, smart contract and website vulnerabilities will be separated into two separate bug bounty programs.   Minor correction: After further deliberation, we found that the bug bounty program can remain un-split. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.205357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/06/2022-20:39:47",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-fe-january/12975",
            "title": "Immunefi Security CU Update for Fe--January ",
            "index": 12975,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "1",
                    "time": "01/02/2022-18:07:32",
                    "content": "Due to delays, the fee to Immunefi Services for December 2021 and January 2022 is reduced to USD 7500/month instead of USD 10000/month.  Recent Progress   Bug bounty MIP approved   A MIP to fund Operational Audits, MIP40c3-SP58, posted to the forum for feedback    @psychonaut found minor problems in the Executive Audit page of the manual. This suggests that people outside of Core Units are not auditing executive spells.   Work continues on the identification of critical infrastructure and the setup of inventory tracking in collaboration with DeFi Safety   Office hours every other Monday starting 2022-01-25T00:00:00Z. We will add more time zone coverage soon.   Began formal coordination with GovComms with regards to incident response procedures and kicked off the Security Stakeholder Alignment calls every Wednesday starting 2022-01-26T15:30:00Z.   Anticipated soon  Begin publishing educational content (delayed)     Anticipated Feb 2022  Backups for critical monitoring infrastructure, though there is a potential for delay due to increased workload scope for identification of critical infrastructure Fire drill planning and execution (discovery-focused fire drill)   Bug bounty program is live Begin operational security audits  ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmWkPoVv?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/mip40c3-sp58-modify-core-unit-budget-immunefi-security-core-unit-budget-is-001",
                        "https://github.com/makerdao/governance-manual/pull/52",
                        "https://manual.makerdao.com/governance/verification/executive-audit",
                        "http://defisafety.com/",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-february/13488"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.153787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "02/02/2022-00:34:50",
                    "content": "Any updates on the legal expenses you are budgeting for? Is that a Q1, Q2 event, or the second half of 2022?     psychonaut:  Fire drill planning and execution (discovery-focused fire drill)   With regards to the fire dills, do you expect to deploy such and report back to the community an attack assessments for real vulnerabilities? And how are you thinking about which vulnerabilities the assessment should cover—such as CU personnel, CU business systems, perhaps supply chains?? Will you deliver evaluation results and the actual security requirements that will need to be incurred? Trying to get an idea what type of “assessment”  the community should expect your team to deliver. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "1",
                    "time": "02/02/2022-00:41:00",
                    "content": "    flipflopflapdelegate:  Any updates on the legal expenses you are budgeting for? Is that a Q1, Q2 event, or the second half of 2022?   My understanding is that “legal expenses” are related to the company setup (forecast of 2200 DAI). There were delays, but @TravinImmunefi mentioned today in private chat that the company will be set up this week, and under budget. Hope I was allowed to share that. Stay tuned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.194444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TravinImmunefi",
                    "index": "#4",
                    "likes": "0",
                    "time": "02/02/2022-11:36:10",
                    "content": "Yep the legal expenses are meant to cover a year. However, there were delays with company set up due to problematic service providers. This has been resolved but unfortunately company creation took a bit longer due to lack of resources from the government processing side which made them take weeks instead of days to process the registration. It’s the root cause of multiple gates unfortunately, such as the payment to the Core Unit participants including myself and Immunefi Services. For the fire drills, we’ll get back to you soon with a combined response together with DeFi Safety whom we’ve been collaborating with so far and will continue to work with in this area. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/05/2022-11:36:16",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-august/17622",
            "title": "Immunefi Security CU Update for August ",
            "index": 17622,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "0",
                    "time": "02/09/2022-13:57:14",
                    "content": " Epic medieval battle between the forces of good and evil768×512 614 KB  Credit: Midjourney  This month 13 bugs (IDs 9360–10351) were submitted through the bug bounty program. For better or worse, the quality of the reports seems to have hit a new high.   A Critical severity Denial Of Service attack on http://chainlog.makerdao.com/ was reported (bug 9372).  Expect a postmortem soon.   Two separate hackers (bugs 9888 & 10227) reported similar vulnerabilities for https://vote.makerdao.com/. Fortunately, DUX was already aware of this attack vector; the bugs were closed. A Denial Of Service attack was reported for https://vote.makerdao.com/ (bug 9845). Fortunately, DUX presented proof that this vulnerability was already known; the bug was reduced to Medium severity.   Last month, we promised to return 90,199 DAI back to Maker by sending this amount to the auditor wallet. Since the transaction happened in August not July, the amount was corrected to 82,173 DAI. The diference, 8,026 DAI, reflects my compensation and a software subscription.    Office hours are Mon 11pm UTC alternating with Wed at 3pm UTC. Security Stakeholder Alignment calls are monthly on the third Wednesday starting 2022-08-17T15:30:00Z    Budget transparency reporting    Link to the previous month’s progress report     Anticipated soon  We continue to work with GovComms on the Emergency PlayBook  ",
                    "links": [
                        "http://chainlog.makerdao.com/",
                        "https://vote.makerdao.com/",
                        "https://vote.makerdao.com/",
                        "https://etherscan.io/tx/0x12d60e0b237fadb40f112231bde7836a9182e16f97ec7eddffb597444296f566",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-july/16987",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-august-2022/16955",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-september/18170"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.549915824915825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/12/2022-13:58:02",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-february-2023/20039",
            "title": "Immunefi Security CU Update for February 2023 ",
            "index": 20039,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "0",
                    "time": "02/03/2023-18:06:45",
                    "content": " monster insect hiding under the bed, young girl trying to sleep in bed, cartoon style --aspect 3:2 --v 41536×1024 231 KB  Credit: Midjourney  This month 53 bugs (IDs 16463–17427) were submitted through the bug bounty program.    No bounties were paid this month.    Budget transparency reporting    Link to the previous month’s progress report    CC: @TravinImmunefi ",
                    "links": [
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-january/19627"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-june/16275",
            "title": "Immunefi Security CU Update for June ",
            "index": 16275,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "3",
                    "time": "02/07/2022-05:06:12",
                    "content": " Immunefi Security CU Update for June   @TravinImmunefi attended DAIvinity Amsterdam and is preparing a report on discovered physical security issues (75% done)  @Psychonaut participated as a panelist on Stablecoin Design: Yeti Finance, Hubble Protocol, MakerDAO, Prime Protocol  In coordination with GovAlpha, @Psychonaut posted an informal poll on the GSM Delay  This month 24 bugs were submitted through the bug bounty program.  All of them were found invalid.   We paid two bounties for bugs discovered in Feb 2022.  Payout for bug 5570 was 50k Payout for bug 5700 was 25k.    @Psychonaut took over from Immunefi Services Triaging on June 22. @TravinImmunefi will cover when @Psychonaut is on vacation. Office hours Mon 11pm UTC alternating with Wed at 3pm UTC. We will add more time zone coverage soon.   Security Stakeholder Alignment calls are rescheduled back to every Wednesday starting 2022-06-29T15:30:00Z    Budget transparency reporting    Link to the previous month’s progress report     Anticipated soon  In the Security Stakeholder Alignment meeting on Jun 29, we discussed how to lower the cost of ISCU motivated by voter comments and bear market concerns. Expect a Signal Request to invite MKR holders to confirm the changes. Tentative changes are:  Change Immunefi monthly payment from 10k toward 0.  Cease use of Immunefi Services Triaging (partially done as of Jun 22) after consulting with steward core units Cease retainer for war-room/emergency response service Cease expectation of educational content. No longer request postmortems for high severity bugs.   Complete already started operational audit for PE and TechOps, but do not automatically continue with other Core Units. This work will be billed hourly. Although we are not currently paying DeFi Safety or ChaosLabs, we may reconsider these partnerships.   Look to July for the first fire drill.   A MIP proposal to on-board @Psychonaut as a co-facilitator failed. We continue to work with GovComms on the Emergency PlayBook Initial operational security audits   Delayed  Educational content     Extra Our partner Forta announced their FORT token. If you have contributed to any of the following Maker-related projects then you are eligible for the airdrop,  GitHub - makerdao/auction-keeper: Maker Keeper Framework: Keeper to participate in `flip`, `flop` and `flap` auctions in multicollateral Dai. GitHub - makerdao/awesome-makerdao: A collection of tools, documents, articles, blog posts, interviews, and videos related to MakerDAO and the Dai stablecoin. GitHub - makerdao/community: A collection of documents and resources relating to initiatives from the Community Development group at MakerDAO. GitHub - makerdao/developerguides: Developer guides to integrate with MakerDAO's smart contracts, SDKs, APIs, products, and partners GitHub - makerdao/dss: Dai Stablecoin System GitHub - makerdao/market-maker-keeper: Maker Keeper Framework: Market maker keepers for OasisDEX, EtherDelta, 0x (RadarRelay, ERCdEX), Paradex, DDEX, IDEX, Bibox, Ethfinex, GoPax, HitBTC, TheOcean, OKEX and Gate.io. GitHub - makerdao/multicall: Multicall: Aggregate multiple constant function call results into one GitHub - makerdao/multicall.js: Multicall.js: A JavaScript blockchain state management library for dapps GitHub - makerdao/pymaker: Python API for Maker contracts GitHub - makerdao/sai: Single Collateral Dai Also glance at the full repo list here.  ",
                    "links": [
                        "https://www.youtube.com/watch?v=-72I2R3Q8Gw",
                        "https://forum.makerdao.com/t/governance-security-module-gsm-adjustment-informal-poll/16205",
                        "https://immunefi.com/bounty/makerdao/",
                        "https://medium.com/@joshua_24955/makerdao-authentication-vulnerability-bugfix-review-e9cf42c7402f",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-may/15516",
                        "https://www.youtube.com/watch?v=rmnt1RnNR70",
                        "https://vote.makerdao.com/polling/QmaR6q4L#vote-breakdown",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP58#immunefi-https-immunefi-com",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP58#changes-compared-to-mip40c3-sp42-",
                        "https://vote.makerdao.com/polling/QmaR6q4L#vote-breakdown",
                        "https://airdrop.forta.network/",
                        "https://github.com/makerdao/auction-keeper",
                        "https://github.com/makerdao/awesome-makerdao",
                        "https://github.com/makerdao/community",
                        "https://github.com/makerdao/developerguides",
                        "https://github.com/makerdao/dss",
                        "https://github.com/makerdao/market-maker-keeper",
                        "https://github.com/makerdao/multicall",
                        "https://github.com/makerdao/multicall.js",
                        "https://github.com/makerdao/pymaker",
                        "https://github.com/makerdao/sai",
                        "https://docs.google.com/spreadsheets/d/1VgLQIiceycJf0i6gofPTWi05UCfJJ4PURBEvkSCLG-E/edit#gid=0",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/19",
                        "https://forum.makerdao.com/t/delegate-office-hours-includes-poll-for-discussion-topic/16571/4",
                        "https://forum.makerdao.com/t/mip41c4-spxx-immunefi-security-core-unit-facilitator-onboarding-is-001/16348/6",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-july/16987",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/5",
                        "https://forum.makerdao.com/t/relay-semanal-12-18-de-julio-del-2022/16789"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.24156314699793
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "3",
                    "time": "02/07/2022-07:17:08",
                    "content": "    psychonaut:  ur partner Forta announced their FORT token . If you have contributed to any of the following Maker-related projects then you are eligible for the airdrop,   I actually didn’t realize I qualify till you shared this. Thank you for sharing  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "1",
                    "time": "02/07/2022-20:22:02",
                    "content": "    psychonaut:  after consulting with steward core units   In interests of carefully building consensus before make changes in sensitive procedures, I invite @0xdeniz and @Derek to post a brief perspective on suspending Immunefi Services Triaging. Immunefi Services Triaging was helping to determine whether bugs were valid or invalid. Without Immunefi’s help, it is likely that somewhat more bugs will be escalated to participating Core Units for evaluation. My take is that few bugs were escalated and an increase in bugs to evaluate will not be too much of a burden. Please weigh in on this question. If the number of bugs becomes unmanageable then we can contract with Immunefi Services Triaging to resume. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#4",
                    "likes": "3",
                    "time": "04/07/2022-14:11:01",
                    "content": "    psychonaut:  I invite @0xdeniz and @Derek to post a brief perspective on suspending Immunefi Services Triaging.   From experience I can tell that handling inbound vulnerability reports can be time-consuming and frustrating, because of the following reasons:  The time-sensitive nature of such reports require direct response, which disrupts my own working process. Involved direct communications with external actors that are financially motivated to have their requests classified as high as possible, which tends to lead to unreasonably long (and frankly; frustrating) discussions Handling the vulnerability reports and performing triaging myself requires a deep understanding of the Immunefi x MakerDAO bug bounty program, as well as specific technical knowledge which I personally lack and requires involvement of the engineers in my team (of which the capacity is already too low in my opinion)  I would personally hate to see the frequency of inbound reports rise because of reduced involvement of IS-CU, as it will directly impact my productivity overall. Then again, I’m fully aware of the need to reduce spend in the DAO and would be happy to comply with the suggested changes.     psychonaut:  If the number of bugs becomes unmanageable then we can contract with Immunefi Services Triaging to resume.   I will do my part by raising my flag in case this situation occurs and I feel it would be appropriate to revisit this decision. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#5",
                    "likes": "3",
                    "time": "04/07/2022-16:19:57",
                    "content": "I would second these points. Arguably it would impact security of the system if the triaging process becomes dependent on the timely reaction of CU members. Is it possible to reduce the fee in order to maintain only the triaging service? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TravinImmunefi",
                    "index": "#6",
                    "likes": "1",
                    "time": "04/07/2022-17:31:51",
                    "content": "    Payout for bug 5700 was 25k.     Hi everyone, I’d like to share a bit more information here about 5700. First, this wasn’t a critical or high bug according to MIP64 and thus will not be getting a full postmortem as per the services of Immunefi Services. However, payment was encouraged because a fix was done, as well as improvements to the overall bug reporting process and coordination with the steward core units. The payment amount was reached after mediation from Immunefi, which took into consideration similar accepted bug reports across other projects, both within and outside of Immunefi. This was a web/app bug and I’d like to thank both DUX and GovAlpha for their time and patience on the matter as well as the feedback provided to further improve the process, as well as the whitehat who submitted the bug report. Due to the circumstances around the bug report and its improvement on the process, Immunefi has decided not to charge its fees (10% of the reward amount) for this bug report. Additionally, though it was not mentioned in the Medium article, 5570 will not have the Immunefi fee charged in addition to the IS-001 Facilitator relinquishing some of the compensation of their salary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.459090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TravinImmunefi",
                    "index": "#7",
                    "likes": "2",
                    "time": "04/07/2022-21:09:55",
                    "content": " From experience I can tell that handling inbound vulnerability reports can be time-consuming and frustrating, because of the following reasons:  The time-sensitive nature of such reports require direct response, which disrupts my own working process. Involved direct communications with external actors that are financially motivated to have their requests classified as high as possible, which tends to lead to unreasonably long (and frankly; frustrating) discussions Handling the vulnerability reports and performing triaging myself requires a deep understanding of the Immunefi x MakerDAO bug bounty program, as well as specific technical knowledge which I personally lack and requires involvement of the engineers in my team (of which the capacity is already too low in my opinion)  I would personally hate to see the frequency of inbound reports rise because of reduced involvement of IS-CU, as it will directly impact my productivity overall. Then again, I’m fully aware of the need to reduce spend in the DAO and would be happy to comply with the suggested changes.  Thanks @0xdeniz for the feedback here. To clarify though, IS-001 will still be doing the initial filtering. On top of that Immunefi has developed an improved automated spam filtering system so spam issues will be reduced overall. It is still likely that overall bug reports will be escalated a bit more than normal, but overall it shouldn’t increase to as if there was no filtering whatsoever. I can also share that Immunefi Services is looking into managed triaging for web and I’ll try to get this to be rolled out ASAP. Unfortunately though, this will be a time-restricted service. However, I will seek feedback before implementing this once we get the costs worked out.  I will do my part by raising my flag in case this situation occurs and I feel it would be appropriate to revisit this decision.  Thank you.  I would second these points. Arguably it would impact security of the system if the triaging process becomes dependent on the timely reaction of CU members. Is it possible to reduce the fee in order to maintain only the triaging service?  I should be able to get a final quote from the managed web service by tomorrow. However, the managed smart contract triaging won’t be provided. One additional piece of information that was shared during the call last week was that Immunefi Services was actually operating this so far at a loss. We had hoped that this would not be the case, but unfortunately this is what ended up happening due to scaling issues as well as resource forecasting mistakes. Simply put, running a 24/7 premium triaging service with smart contract and web/app triaging was not economical at these rates. However, with further restrictions to just web and perhaps a certain time restriction on that, we can likely keep it still to the point of overall reduction on the costs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.22864010989011
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "02/10/2022-21:10:47",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-july/16987",
            "title": "Immunefi Security CU Update for July ",
            "index": 16987,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "3",
                    "time": "03/08/2022-23:30:37",
                    "content": " We seem to have arrived at an agreement with MKR holders to reduce our minimum spend to 8k per month and reduce services.  Immunefi Services has indicated to ISCU that it will be ceasing its service with regards to the operational audit due to resource constraints. As such, this service will no longer be provided by ISCU. Immunefi Services however has indicated that no charge will be levied given that no value was provided. We will return 90,199 DAI back to Maker by sending this amount to the auditor wallet.      @TravinImmunefi attended DAIvinity Amsterdam and reported his findings to the Events CU. This work, however, was incorrectly executed with a mistake; Travin informed Sam MacPherson (@hexonaut) about his intention to audit the event under the mistaken impression that Sam was a member of the Events CU. Hexonaut did not misrepresent himself. Travin just failed to make the proper checks to ensure that he was communicating with the right person. Other missteps were also done by Travin during the documentation phase. We apologize to @PonJerry and @Leggevents. Reimbursement for the trip will not be provided by ISCU to Immunefi Services due to no to little value being provided. This month 14 bugs were submitted through the bug bounty program.   A whitehat reported a low severity vulnerability that was verified by @tadeo. Since bug 8826 was outside the scope of the bug bounty program, ISCU declined to pay a bounty. However, Data Insights CU decided to pay a small bounty to encourage whitehats to report such findings.      The first fire drill was finally conducted.  Gas used to participate was refunded.  We are currently running two follow-up polls:  What is a good frequency for fire drills? (Quarterly is leading) Should we incorporate fire drill participation into the Recognized Delegate compensation performance modifier? (Yes is leading)   The winning choice was no change in the poll to change the GSM Delay. No further action will be taken as this time. This seems reasonably justified considering the prompt action demonstrated by Recognized Delegates in a recent emergency and the first fire drill. DeFi Safety is exploring how to pitch a new security offering. We hosted a  brief presentation that was not recorded. Rex promised to refine his proposal and continue the discussion in the forum. There was a recent informal poll that asked whether to disable the Emergency Shutdown Module. We think that it is a serious concern that anybody would even consider this course of action. In reaction, we have prepared a new page for the manual that summarizes the material covered in the forum thread. Your comments and feedback are welcome.   Office hours are Mon 11pm UTC alternating with Wed at 3pm UTC. Security Stakeholder Alignment calls are monthly on the third Wednesday starting 2022-08-17T15:30:00Z    Budget transparency reporting    Link to the previous month’s progress report     Anticipated soon  We continue to work with GovComms on the Emergency PlayBook  ",
                    "links": [
                        "https://twitter.com/Daivinity/status/1513511924633329671",
                        "https://immunefi.com/bounty/makerdao/",
                        "https://forum.makerdao.com/t/fire-drill-postmortem-informal-poll/16677",
                        "https://Etherscan.io/tx/0x90886c62c32a97482782a04f2f3e86ef14fcb43e53cc8e496da7f486e5903a91",
                        "https://forum.makerdao.com/t/governance-security-module-gsm-adjustment-informal-poll/16205",
                        "https://forum.makerdao.com/t/fire-drill-request-for-discussion-informal-polls/13799/5",
                        "https://forum.makerdao.com/t/defi-safety-to-present-a-security-framework-for-defi-protocols/16590",
                        "https://forum.makerdao.com/t/informal-poll-disable-the-emergency-shutdown-module/16292",
                        "https://github.com/makerdao/governance-manual/pull/114",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-june/16275",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-july-2022/16954",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-august/17622"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2861678762414055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/11/2022-23:31:29",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-september/18170",
            "title": "Immunefi Security CU Update for September ",
            "index": 18170,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "1",
                    "time": "01/10/2022-05:13:16",
                    "content": " cluttered biology lab in university, camera focused on live bug in glass enclosure, steampunk style1536×1024 286 KB  Credit: Midjourney  This month 22 bugs (IDs 10853–11789) were submitted through the bug bounty program.    Two bugs 10853 & 10860, although out-of-scope, were judged valid and valuable. We are discussing internally how much to pay the whitehat for these reports. Another set of bugs (11314, 11424, 11644, & 11789) are Escalated and under investigation. I will update on the outcome of these bugs next month.   Office hours are Mon 11pm UTC alternating with Wed at 3pm UTC. Security Stakeholder Alignment calls are monthly on the third Wednesday starting 2022-08-17T15:30:00Z    Budget transparency reporting    Link to the previous month’s progress report     Anticipated soon  Postmortem for critical bug 9372 We continue to work with GovComms on the Emergency PlayBook  ",
                    "links": [
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-august/17622",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-october/18584",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-september-2022/18288"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.106060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/10/2022-23:16:19",
                    "content": "The unfortunate postmortem for critical bug 9372 is published.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/commanderkeen",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/10/2022-09:08:14",
                    "content": "50k for easy ddos attack? cmon how can this be “such an important bug” and be reported as critical? Its normal ddos attack you can do on any page. How can Maker be damaged with this attack? If hacker would attack us, someone would noticed and fix it. ",
                    "links": [
                        "https://forum.makerdao.com/t/resumen-del-mes-de-la-core-unit-de-riesgos-octubre-de-2022-traduccion/18654"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.983333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "1",
                    "time": "22/10/2022-15:09:31",
                    "content": " How can Maker be damaged with this attack?  Can’t. That’s why it was an error to place denial of service attack on this website in-scope.  how can this be “such an important bug”  Our bug bounty program states that denial of service is classified as a critical vuln.  Its normal ddos attack you can do on any page.  Distributed DoS attacks are out-of-scope. This was a DoS attack that could be easily conducted with a single attacking computer.  50k for easy  I know.  Believe me, I wracked my brain for a way to wiggle out of this one without causing our bug bounty program to lose credibility.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.960884353741497
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "0",
                    "time": "22/10/2022-18:27:57",
                    "content": "There was actually a similar series of DoS bugs reported against the governance website. Fortunately, DUX had some proof that they were already aware of the architectural weakness. The situation with chainlog was more like the left and right hand not communicating with each other. Nobody bother to document that the chainlog website could be DoS’d because it was obvious and by design. Yet somehow we messed up by making the DoS attack in-scope.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.819196428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "20/01/2023-18:28:38",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-may/15516",
            "title": "Immunefi Security CU Update for May ",
            "index": 15516,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "1",
                    "time": "31/05/2022-23:01:47",
                    "content": " Immunefi Security CU Update for May  Lázaro Raúl of Nethermind is working on Forta monitoring agents to act as backups of critical monitoring infrastructure for L2 deployments, and eventually, Maker Teleport   This month 6 bugs were submitted through the bug bounty program.  All of them were found invalid by Immunefi Services Triaging.   Office hours Mon 11pm UTC alternating with Wed at 3pm UTC. We will add more time zone coverage soon.   Security Stakeholder Alignment calls are rescheduled to every Wednesday starting 2022-05-26T20:00:00Z    @TravinImmunefi presented “Scaling and Securing Blockchains and Crypto” on May 23 at BlockChain Central Davos. Unfortunately, his talk was not recorded.  Budget transparency reporting    Link to the previous month’s progress report     Anticipated soon  Look to June for the first fire drill.    On-board @Psychonaut as a co-facilitator   We continue to work with GovComms on the Emergency PlayBook Initial operational security audits   Delayed  Educational content    @Psychonaut met with Ben O’Neill of ChaosLabs. Ben and team are eager to collaborate, but still need another 2-3 months of development.  ",
                    "links": [
                        "https://immunefi.com/bounty/makerdao/",
                        "https://gbbcouncil.org/event/gbbcs-blockchain-central-davos/",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-april/14846",
                        "https://forum.makerdao.com/t/mip41c4-sp34-immunefi-security-core-unit-facilitator-onboarding-is-001/14610",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-june/16275",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.185185185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/08/2022-23:01:51",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-april/14846",
            "title": "Immunefi Security CU Update for April ",
            "index": 14846,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "3",
                    "time": "28/04/2022-17:05:41",
                    "content": " Backups for critical monitoring infrastructure is finally under way. Lázaro Raúl of Nethermind, funded by Forta, put together a suite of monitoring agents for MakerDAO to promote their new Forta platform. @Psychonaut forked their code and started debugging and adding new capabilities. We hope to collaborate with MakerDAO engineering teams to increase monitoring coverage.   This month, only 6 bugs were submitted through the bug bounty program.  All of them were found invalid by Immunefi Services Triaging.   Our amendment to allow more flexibility in scope passed in an on-chain poll. Thank you for voting.   Tips for working with the bug bounty program are now part of the MakerDAO manual.   Office hours Mon 11pm UTC alternating with Wed at 3pm UTC. We will add more time zone coverage soon.   Security Stakeholder Alignment calls every Wednesday, started 2022-01-26T15:30:00Z    Budget transparency reporting    Link to the previous month’s progress report     Anticipated soon  Instead of a fire drill, during April we experienced an actual fire. Impressively, Recognized Delegates (and other voters) passed the emergency spell in less than two hours after the spell was created. We anticipate that response times in a fire drill would exhibit more variability because GovAlpha would not feel responsible to assist with coordination. Look to May or June for the first fire drill.  Proposal to on-board @Psychonaut as a co-facilitator   We continue to work with GovComms on the Emergency PlayBook   Delayed  Operational security audits were just getting started when Tudor Costica encountered personal issues that restricted his ability from finishing the job. Hopefully we will have an update to share soon on the future of operational security audits.   Educational content   Collaboration with ChaosLabs  ",
                    "links": [
                        "https://github.com/NethermindEth/Forta-Agents/tree/main/Maker-Agents",
                        "https://github.com/makerdao-is/Forta-Agents",
                        "https://immunefi.com/bounty/makerdao/",
                        "https://vote.makerdao.com/polling/Qmad6Lo8#poll-detail",
                        "https://manual.makerdao.com/makerdao/overview/bug-bounty",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-march/14322",
                        "https://forum.makerdao.com/t/14th-april-emergency-executive/14642",
                        "https://forum.makerdao.com/t/fire-drill-request-for-discussion-informal-polls/13799/9",
                        "https://forum.makerdao.com/t/mip41c4-sp34-immunefi-security-core-unit-facilitator-onboarding-is-001/14610",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-may/15516"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.003787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TravinImmunefi",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/05/2022-15:19:48",
                    "content": " Operational security audits were just getting started when Tudor Costica encountered personal issues that restricted his ability from finishing the job. Hopefully we will have an update to share soon on the future of operational security audits.   Hey everyone, Good news. We worked things out internally and figured out how Tudor can continue to work and do the Operational Audits so we’ll be moving forward with that.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/08/2022-15:20:39",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-january/19627",
            "title": "Immunefi Security CU Update for January ",
            "index": 19627,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "0",
                    "time": "01/02/2023-16:03:30",
                    "content": " Immunefi Security CU Update for January  fireproof insect crawling over hot metal --aspect 3:2 --v 41536×1024 323 KB  Credit: Midjourney Our bridge funding proposal was approved with practically all 94,160 MKR voting in favor. Thank you for your support. Reading the tea leaves, we interpret the recent votes as instructing us to work heads down and keep quiet.  This month 37 bugs (IDs 15296–16412) were submitted through the bug bounty program.    No bounties were paid this month.    Budget transparency reporting    Link to the previous month’s progress report    CC: @TravinImmunefi ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmbHM3fr#vote-breakdown",
                        "https://immunefi.com/bounty/makerdao/",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-december/19277",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-february-2023/20039"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.927777777777777
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-february/13488",
            "title": "Immunefi Security CU Update for February ",
            "index": 13488,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "5",
                    "time": "28/02/2022-16:48:55",
                    "content": " Recent Progress   Bug bounty program is live. As of Feb 28, we received 8 bug submissions.   Three reports were alleged smart contract vulnerabilities. Immunefi Services Triaging determined that two of these reports were invalid. One was escalated to ChainSecurity, which determined that the report was invalid. No bugs were escalated to Protocol Engineering.   Five reports were alleged website vulnerabilities. Two bugs, of Critical and Medium severity, were verified and fixed. One report is still in discussion and the rest were found invalid by the Immunefi Services Triaging team.   Oops, @psychonaut incorrectly invited ChainSecurity to evaluate Immunefi bug 5700, a website vulnerability. ChainSecurity is only expected to evaluate smart contract vulnerabilities. This bug should have been escalated directly to the responsible Maker Core Unit.     Our amendment to enable Rapid Payment for Small Bug Bounties was switched from the weekly MIP4c3 process to the monthly MIP4c2 process. GovAlpha felt that this amendment looked close enough to a budget change that additional caution was warranted despite the strong support witnessed in the forum Signal Request.   We have introduced an amendment to clarify the bounty amount for critical severity web vulnerabilities.  ChaosLabs reported on their progress toward a whitehat testing environment     Ongoing  Office hours every other Monday, started 2022-01-25T00:00:00Z. We will add more time zone coverage soon.   Security Stakeholder Alignment calls every Wednesday, started 2022-01-26T15:30:00Z    Budget transparency reporting    Link to the previous month’s progress report     Anticipated soon   Yes was leading by about 70k MKR in the Core Unit budget amendment to fund operational audits. This on-chain poll has now passed.   Operational security audits of Protocol Engineering and TechOps     Delayed  Educational content   Identification of critical infrastructure and setup of inventory tracking in collaboration with DeFi Safety   Backups for critical monitoring infrastructure   Discovery-focused fire drill planning and execution    ",
                    "links": [
                        "https://forum.makerdao.com/t/mip4c2-sp17-rapid-payment-for-small-bug-bounties-mip64-mip40c3-sp42-amendment/12869",
                        "https://mips.makerdao.com/mips/details/MIP4#MIP4c3",
                        "https://mips.makerdao.com/mips/details/MIP4#MIP4c2",
                        "https://forum.makerdao.com/t/signal-request-advance-rapid-payment-for-small-bug-bounties-to-on-chain-poll/13017",
                        "https://forum.makerdao.com/t/mip4c3-amend-mip64-to-clarify-critical-web-bounty-amount/13439",
                        "https://www.youtube.com/watch?v=wx_VGBrQBx8",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-fe-january/12975",
                        "https://vote.makerdao.com/polling/QmaBYzea?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-february-2022/13726",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-march/14322",
                        "https://forum.makerdao.com/t/fire-drill-request-for-discussion-informal-polls/13799",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-2-9-2022/13804"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.296954939000393
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/02/2022-19:42:24",
                    "content": "    psychonaut:  Discovery-focused fire drill planning and execution    Can you please expand more on how your team will work w/ChaosLabs—will the fire drills consist of scenarios/back testing from the environments Chaos/sidestream/PECU and others alike have tested/have yet to test—trying to get an idea of what the PoC of the fire drills will be and what Role both teams (if any) immunefi CU and ChaosLabs will play. Also, out of the 8 bug submissions—sounds like most were invalid—have any qualified for a reward? Thanks in advanced! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "1",
                    "time": "28/02/2022-19:57:21",
                    "content": "    flipflopflapdelegate:  will the fire drills consist of   Let me explain why the fire drills were delayed. There was a misunderstanding about how MakerDAO smart contracts are secured. Rex from DeFi Safely had worked out some procedures to verify the set-up of multisig wallets. Rex’s use of the term fire drill referred to the rapid exercise of a multisig wallet. It was believed that some critical smart contracts were secured by multisig wallets. However, the reality is that all critical smart contracts are secured by the MKR voting system.     flipflopflapdelegate:  Can you please expand more on how your team will work w/ChaosLabs   My understanding is that ChaosLabs will make it easy to spin up a MakerDAO system in a test environment. This should lower the barrier to entry for whitehat hackers.     flipflopflapdelegate:  Also, out of the 8 bug submissions—sounds like most were invalid—have any qualified for a reward?   Yes, expect 2-3 payouts and the associated postmortems. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.431216931216931
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "0",
                    "time": "28/02/2022-22:26:21",
                    "content": "Got it. Thanks for the reply. As far as establishing Bounties for the incoming Layer 2 projects like StarkNet — how large of a white hacker community is it — hearing that their aren’t many humans in the world that can audit Cairo, or even by using the transpiler, Warp — not much interest— how do you folks at Immunefi CU see that playing out? Will it be difficult to deploy bug bounties? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.295918367346939
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#5",
                    "likes": "4",
                    "time": "01/03/2022-01:47:36",
                    "content": "What’s the rationale for escalating to ChainSecurity (which costs money) before running it past the PE team? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "1",
                    "time": "01/03/2022-04:57:33",
                    "content": "@psychonaut   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#7",
                    "likes": "1",
                    "time": "02/03/2022-00:45:35",
                    "content": "    Derek:  What’s the rationale for escalating to ChainSecurity (which costs money) before running it past the PE team?   Our goal was to shield PE from the tedium of triaging.  This should not be a surprise because we wrote in our budget that, “[ChainSecurity] will provide final triaging services for smart contract bug reports.” We budgeted up to $10k per month for ChainSecurity. Our activity will not affect PE’s auditing budget. Now, nothing is set in stone. Maybe PE can do this job less expensively or maybe it’s a useful activity for training new engineers or maybe PE wants to own triaging for some other reason. If there is consensus then we can change the process.  In terms of cost, the budget for PE seems to suggest that the base salary for engineers is around $400k. This works out to about $200 per hour. I don’t happen to know offhand what ChainSecurity charges; I bet they are not cheap, but PE time isn’t cheap either.  ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP40c3SP7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.926531801531802
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#8",
                    "likes": "2",
                    "time": "02/03/2022-02:34:36",
                    "content": "Cost (which isn’t as high as you indicate) is only one aspect, the more pertinent concern which I should have indicated is the potential for revealing a vulnerability to a greater number of external eyes than may be absolutely necessary when billions are at stake. I agree that the tedium of triage and the time it takes away from day-to-day tasks is a valid point of optimisation, it just feels strange to hand this over the fence to an outside group, who are undoubtedly talented engineers, but are unlikely to know the system as well as engineers working in the protocol on a daily basis. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.545833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#9",
                    "likes": "0",
                    "time": "02/03/2022-02:37:34",
                    "content": "    Derek:  revealing a vulnerability to a greater number of external eyes   Well, that’s currently the decision. Do you recommend we do a Signal Request or similar to put it to vote? Or do you feel strongly enough to recommend that we change the process without consulting governance? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#10",
                    "likes": "2",
                    "time": "02/03/2022-02:58:38",
                    "content": "In the first instance let’s jump on a call to make sure I’m not misunderstanding anything - perhaps your next office hours would be a good time for us to walk through the existing process? My initial thought is that as a bare minimum a technical representative from PE should have eyes on any submitted smart contract bug. The degree to which external people/teams are brought into your triage process is probably a broader topic we could discuss as it does introduce risk especially as we bring on more L2 bridges with mint capabilities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0064935064935066
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TravinImmunefi",
                    "index": "#11",
                    "likes": "2",
                    "time": "03/03/2022-12:31:59",
                    "content": "Hey @Derek, Thanks for the feedback here. As stated by Joshua, the MIPs indicated the process of having ChainSecurity looking at the bug reports for smart contracts before escalating to the steward core units, which in most cases would be PE unless there’s another core unit coming up in the future with their own smart contracts that IS-001 determines as critical infrastructure to the MakerDAO ecosystem. Since we didn’t get any feedback about this process other than requests for clarification during the MIPs for the creation of the core unit or MIP64 itself, we thought that it was okay. I also mentioned this during one call with ChainSecurity where someone from PE was present, though this was a few months ago so I understand if that was forgotten, especially since it was also not the main topic of the call. We were very much willing to hear feedback and modify the process proposed back then and as Joshua mentioned, we are also very much willing to change the process now, so I’m more than happy to get on a call to discuss further. A few other comments though:   The “Up to USD 10 000” budget is just the maximum IS-001 can pay, though there’s also the contingency on top of that. We don’t assume this will be exhausted every month, but we have it in place as Immunefi’s experience is that bug reports come in waves. Additionally, this budget covers Incidence Response assistance if their help is deemed necessary. If 0 ChainSecurity hours are used, then IS-001 pays USD 0.   The current process for smart contract bug reports of which PE is a steward core unit is Bug Report Submission → Immunefi Services Triaging → ChainSecurity → PE. We can also discuss on the call if the removal of Immunefi Services Triaging is warranted. I should mention that there were a few bug reports submitted as well that Immunefi Services Triaging rejected. I can go over them more on a call and I can even add you to those reports if you’d like to review if you’d like that filtering service or not. Let me know and I can add you to those before the call.   I’m OOO for the next few days but we can have a call early next week. We’ll reach out to you directly on Discord to set up a time. Our next office hours is scheduled for a time suitable for those in and around PST so we’ll need to set up another time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.672789115646259
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#12",
                    "likes": "1",
                    "time": "03/03/2022-17:44:26",
                    "content": "@TravinImmunefi @Derek could you please add me to the call? That would be much appreciated and would probably be more time efficient for @TravinImmunefi ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "01/06/2022-17:45:23",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-november/19006",
            "title": "Immunefi Security CU Update for November ",
            "index": 19006,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "2",
                    "time": "01/12/2022-02:18:43",
                    "content": " Immunefi Security CU Update for November  swarm of insects fly through a garden, camera behind one of the insects --aspect 3:2 --v 41536×1024 380 KB  Credit: Midjourney First a comment on the Nov monthly governance cycle. Some Core Units, such as Sidestream and TechOps, will likely continue to operate on remaining funds despite their Nov budget rejection. However, we do not think the same approach is suitable for Immunefi Security because our modest mandate update was also rejected. The bulk of our remaining funds are earmarked for rapid bounty payouts; in deference to MKR holders and with an abundance of caution, we are eager to return all excess funds to the protocol to preempt any speculation that funds might be misused, EtherScan. We think it is prudent to require an affirmative vote by MKR holders to continue operations. For us, the most disturbing aspect of our budget rejection was, during the RFC period, the lack of feedback on the forum. We did receive some guidance in vote justifications. It is clear that ISCU needs to evolve into an Ecosystem Actor. Although @psychonaut has admittedly expressed intense skepticism about some aspects of the EndGame plan, this is not a hill that we need to die on. We are ready to evolve and become EndGame compliant. Since it is not clear how to become an Ecosystem Actor, we plan a MIP55 SPF to provide six months of bridge funding to keep the lights on while the EndGame plan is fleshed out. Since 24k MKR voted for Approve reduced budget - BearMarket, we will probably request 6600(6 months)(1.1 contingency) = 43560 DAI. If voters regard this post as a pre-RFC and provide feedback, that would be welcome. To build the case for approval of our request, we will contact our internal customers and solicit recommendations.  This month 19 bugs (IDs 12928–13984) were submitted through the bug bounty program.    Bugs 11789 and 12767 from last month were found invalid. Bugs 13858 and 13984 from this month are still open for investigation. No bounties were paid this month.   Office hours are cancelled due to our budget being rejected. Security Stakeholder Alignment calls are monthly on the third Wednesday starting 2022-08-17T15:30:00Z    Budget transparency reporting    Link to the previous month’s progress report     Anticipated soon  Collaboration with GovComms on the Emergency PlayBook. MIP55 SPF to attempt to provide funds to continue operations.  CC: @TravinImmunefi ",
                    "links": [
                        "https://etherscan.io/tx/0x20e21b73f30b57e74ab63e88cb4bcb5c7546a724c600311143aa09e2b2a1853a",
                        "https://vote.makerdao.com/polling/QmeYD9nA",
                        "https://immunefi.com/bounty/makerdao/",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-october/18584",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-november-2022/19023",
                        "https://forum.makerdao.com/t/mip14c2-sp2-subproposal-for-protocol-dai-transfer-to-fund-iscu-from-dec-2022-to-may-2023/19025",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-december/19277",
                        "https://forum.makerdao.com/t/mip14c2-sp2-subproposal-for-protocol-dai-transfer-to-fund-iscu-from-dec-2022-to-may-2023/19025/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.621376811594203
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/12/2022-11:49:02",
                    "content": "    psychonaut:  Since it is not clear how to become an Ecosystem Actor, we plan a MIP55 SPF to provide six months of bridge funding to keep the lights on while the EndGame plan is fleshed out   As discussed on the MA call on Tuesday, an SPF may not be the appropriate vehicle for this funding request. Please review the restrictions in the Motivation section of MIP55 - link. Please reach out to GovAlpha if you need further advice or clarification. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/03/2023-11:49:20",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/immunefi-security-cu-update-for-december/19277",
            "title": "Immunefi Security CU Update for December ",
            "index": 19277,
            "category": [
                "Core Units",
                "Immunefi Security"
            ],
            "tags": [
                "cu-update",
                "is-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "0",
                    "time": "29/12/2022-19:29:51",
                    "content": " Immunefi Security CU Update for December  scorpion insect crawling on human baby --aspect 3:2 --v 41536×1024 232 KB  Credit: Midjourney We continue operations through Jan 2023 waiting to learn the disposition of our bridge funding proposal.  This month 38 bugs (IDs 14044–15095) were submitted through the bug bounty program.    Bug 13858 from last month was closed as invalid. Bug 13984 from last month was out-of-scope (affecting mips.makerdao.com), but GovAlpha chose to pay a 2500 DAI bounty! No other bounties were paid this month.   Security Stakeholder Alignment calls are cancelled.  Budget transparency reporting    Link to the previous month’s progress report    CC: @TravinImmunefi ",
                    "links": [
                        "https://immunefi.com/bounty/makerdao/",
                        "http://mips.makerdao.com",
                        "https://etherscan.io/tx/0xb41f698bab282c03d421d9198b2e22f341bbb411b33fdaad0fed33f1229d4ba5",
                        "https://github.com/makerdao-is/transparency-reporting/",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-november/19006",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-january/19627"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.829861111111111
                }
            ]
        }
    ],
    "group_index": "622"
}