{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/harbor-update-november-2021/12177",
            "title": "Harbor Update November 2021 ",
            "index": 12177,
            "category": [
                "Updates"
            ],
            "tags": [
                "htc-drop",
                "rwa-004",
                "harbor-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/nystateofmlnd1",
                    "index": "#1",
                    "likes": "1",
                    "time": "13/12/2021-17:53:05",
                    "content": " November News   Harbor chooses Codat as integration partner to access real time users data for risk monitoring and transaction approval on the HarborTrade platform. These integrations will improve our operational efficiency and workflow to provide users with a more seamless experience on our system by interacting with client accounting and ERP systems.   Harbor has executed the world’s largest trade finance transaction funded with a stablecoin to provide working capital for a global commodities trader. The over $2 million transaction is the first and largest trade finance program of its kind.   HTC2 was open for last month but was quickly oversubscribed. Currently there is capacity for roughly 900,000 DAI to invest in DROP. We are also accepting investors to subscribe to the TIN tranche.   Origination continues to be strong during the month of November as corporates evaluate their working capital strategy for 2022.   Pool Status Pool Value: 4,142,278 DAI Debt Ceiling Utilization: 2,034,867 DAI ",
                    "links": [
                        "https://www.codat.io/us/case-study/harbor/",
                        "https://harbor-trade.us3.list-manage.com/track/click?u=e426b0104fa2ee032ff645f98&id=e12baf422a&e=fdbcc22a75"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.965277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/03/2022-17:53:47",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/harbor-update-october-2021/11365",
            "title": "Harbor Update October 2021 ",
            "index": 11365,
            "category": [
                "Updates"
            ],
            "tags": [
                "htc-drop",
                "rwa-004",
                "harbor-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/nystateofmlnd1",
                    "index": "#1",
                    "likes": "3",
                    "time": "02/11/2021-17:36:52",
                    "content": " Harbor integrates with Circle to provide faster payments to global buyers and suppliers By integrating the HarborTrade platform with Circle’s Payments and Payout API’s, Harbor uses USDC to efficiently exchange digital assets and fiat. This enables Harbor to provide faster payments to global buyers and suppliers as well as manage the fund’s treasury. We’ve already realized cost and operational efficiency with 50 percent of our transactions. Most importantly, Circle’s API-first approach and their seamless integration with blockchains will help Harbor achieve our growth targets as our transaction volume is expected to reach an annual run rate of $300 million by the end of 2022. New Website New website is live.    harbortrade.com    Harbor - The New Way to Finance Trade Harbor is making trade finance more accessible, user-friendly, and efficient for businesses that trade both domestically and internationally. Our programs provide end to end solutions covering the entire cash conversion cycle.      Harbor Pool Updates During the month of September and October we have underwritten and structured several new programs which are set to close in November and December. New origination is projected at an additional 3.5 million DAI for the month of November, this deployment is subject to client’s procurement/sales schedules and the ongoing supply chain disruptions which continue to cause shipping delays. Portfolio Allocation Portfolio allocation will be available to investors on a regular basis which will include information on the underlying obligors in the pool. This will be included on the Tinlake UI. Harbor will periodically distribute press releases, company news and portfolio updates to registered investors on Tinlake. You can also sign up here: Newsletter Thank you for your support and investing in Harbor. If there are any questions or comments, please do not hesitate to contact us. HTC2 will be open to TIN and DROP investors in the next few days We will send a notification once the pool is open for new and existing subscribers Harbor on Tinlake ",
                    "links": [
                        "https://harbortrade.com",
                        "http://eepurl.com/hw9GyP",
                        "https://tinlake.centrifuge.io/pool/0x4ca805ce8ece2e63ffc1f9f8f2731d3f48df89df/harbor-trade-2",
                        "https://forum.makerdao.com/t/maker-relay-ep-72/11773",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-28th-november-4th/11441",
                        "https://forum.makerdao.com/t/maker-relay-ep-72-en-espanol/11799"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.531322843822844
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nystateofmlnd1",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/11/2021-21:40:00",
                    "content": "Update Client Profiles section is live on the Tinlake UI and can also be found here: https://cdn.harbortrade.com/static/assets/investors/resources/client-profiles.pdf ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nystateofmlnd1",
                    "index": "#3",
                    "likes": "6",
                    "time": "16/11/2021-20:36:17",
                    "content": "Related to our update above, Harbor plans to utilize the Maker credit line in the next two days. The initial utilization of the line will be roughly 2mm DAI. We will provide further updates on utilization and pipeline in our November monthly update. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "14/02/2022-20:36:44",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/harbor-update-september-2021/10487",
            "title": "Harbor Update September 2021 ",
            "index": 10487,
            "category": [
                "Updates"
            ],
            "tags": [
                "htc-drop",
                "rwa",
                "harbor-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/nystateofmlnd1",
                    "index": "#1",
                    "likes": "5",
                    "time": "23/09/2021-20:55:50",
                    "content": " 20b05fbf-3701-f258-f57c-160ec93be823792×198 136 KB  Harbor Brings on Head of Portfolio Management  Harbor Welcomes New Team Member Michael Gilhuley, Head of Portfolio Management With a foundation in credit, both structured and corporate, combined with experience originating and structuring complex structured finance transactions, Mike Gilhuley will oversee Harbor’s trade finance portfolio. Mike’s background includes originating and providing structured trade solutions to Citibank clients globally, primarily in the channel finance sector. Prior to this he was active in the securitization market originating asset-based loans for the NY branch of WestLB. Most recently, Mike served as the Managing Director of Greensill, leading the Americas and driving business from $100 million in assets to over $4 billion during his tenure. Mike holds a Bachelor of Arts from Ohio Wesleyan University. Harbor Pool Updates Harbor recently closed on a supply chain finance program for an injection molding facility in Mexico. Harbor’s program will allow the business to procure goods from their international suppliers on credit to better manage their working capital. Working capital management is currently of heightened concern for businesses that trade internationally as slow shipping speeds due to Covid-related container shortages and port closures have caused major delays to production schedules and sales. Soaring freight costs are also to blame for the current hostile global trade environment. In addition, production capacity is down due to Covid-related restrictions in petrochemical hubs like China and Thailand. Recent inclement weather in Louisiana and Texas is another cause for supply shortages and rising prices. With Harbor’s supply chain finance program in place, suppliers are paid at shipment and the buyer is given extended terms, injecting liquidity into the supply chain. Injection Molding Facility Gets Working Capital Injection From Harbor | Secured Finance Network HTC2 is open for investors looking to allocate funds towards the TIN tranche (junior). This will be reserved for investments of 100,000 DAI or more. Please contact [email protected] to inquire about investing in TIN. Portfolio allocation will be available to investors on a regular basis which will include information on the underlying obligors in the pool. This will be included on the Tinlake UI. Harbor will periodically distribute press releases, company news and portfolio updates to registered investors on Tinklake. Thank you for your support and investing in Harbor. If there are any questions or comments, please do not hesitate to contact us. Harbor on Tinlake ",
                    "links": [
                        "https://tinlake.centrifuge.io/pool/0x4ca805ce8ece2e63ffc1f9f8f2731d3f48df89df/harbor-trade-2",
                        "https://forum.makerdao.com/t/maker-relay-ep-64/10540",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-24th-30th/10595",
                        "https://forum.makerdao.com/t/maker-relay-ep-64-en-espanol/10548"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.262494739057239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/09/2021-22:42:49",
                    "content": "Thank you for providing the community with an update. Question? With regards to the slow shipping needs because of the container shortages, does it also include issues with domestic freight, a.k.a the trucking industry? And when do you think this shipping bottleneck will come to an end? Or, better yet how does it get unwound? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nystateofmlnd1",
                    "index": "#3",
                    "likes": "2",
                    "time": "24/09/2021-01:22:20",
                    "content": "Hi @flipflopflapdelegate, I can’t say I am a domain expert in logistics but I will say that trucking in the U.S. seems to be at near capacity. This is certainly driven by the increase demand due to change in consumer behaviors as a result of Covid and the aging population of truck drivers (supply/demand). Although, it seems “last mile” is not so much the issue but rather “long haul”, cross country. Internationally freight bottlenecks seem to be driven by a few factors: unexpected consumer demand, worker shortage and containers on the wrong continent. We’ve been getting signals from clients that tell us this won’t be resolved this year. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8814935064935066
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "2",
                    "time": "27/09/2021-09:33:04",
                    "content": "    nystateofmlnd1:  Soaring freight costs are also to blame for the current hostile global trade environment.   Good read: Cargo piles up as California ports jostle over how to resolve delays | Fox Business ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "26/12/2021-09:33:51",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "130"
}