{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-voting-incentive-campaign/17158",
            "title": "Governance Voting Incentive Campaign ",
            "index": 17158,
            "category": [
                "Discontinued Categories",
                "Events"
            ],
            "tags": [
                "voting",
                "vote-participation",
                "governance",
                "contest",
                "archive-events-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#1",
                    "likes": "11",
                    "time": "10/08/2022-18:56:35",
                    "content": " Problem: Currently, there is no incentive for small MKR holders to actively participate in governance voting.  There are no rewards to encourage MKR holders to either actively vote or delegate so their tokens become active in voting.  In reality, if a smallholder is to participate it costs them money via gas fees to vote.  Campaign Solution: The events team has decided to create a voting incentive campaign by means of using tickets to DAIvinity events as a reward mechanism.  Demand for DAIvinity tickets has been extremely high for the last few events and this trend is expected to continue.  By leveraging this demand, we believe we can attract small MKR holders to engage in governance voting by offering a ticket to a DAIvinity event as a reward for this participation.  How are tickets currently allocated? Over the past few events, tickets have been distributed about 25% via public twitter release, 60% via CU members and 15% by direct requests.  CU members generally distribute to business partners, VCs, media or other ETH protocols.  The direct request are generally protocols, VCs & Delegates. The portion of tickets we release via Twitter is what we will use to give priority access to active voting MKR holders.  The Twitter-distributed tickets are quite hard to get and often get consumed in a matter of minutes during public releases.  Desired Outcomes: The goal of this campaign is to address the problem of voting incentives and attract existing and new MKR holders to vote; Here is a general list of outcomes;  Increase of <50 MKR holder participation Promotion for people to procure MKR and start participation in governance voting Increase social media chatter regarding MKR voting Draw social media attention to Maker in general Have greater representation of MKR holders at DAIvinity events.   Parameters: The campaign’s goal is to target small MKR holders and encourage them to vote in governance.  Larger MKR holders are generally known and are already able to access tickets via contacting our team.  We have set the following eligibility parameters so that the proper group is targeted.  Maximum MKR per vote participation:  50 MKR We have selected this threshold as this is what we are considering a small MRK holder for the sake of this campaign.  Minimum # of unique voting polls:   TBD This number has been derived by backtesting to ensure there is a good balance of poll participation and ticket availability.  Maximum Tickets Allocated: 100 Tickets 100 of our tickets will be allocated to anyone who qualifies to receive a ticket.  In the case of more qualifying voters than tickets then a ranked list will be created with the following ranking criteria: 1st: Number of polls voted 2nd: Time final vote cast from the start of the poll.  Ineligible Addresses; Recognized Delegates (& Delegators):  Delegates can already get tickets and are expected to hold high governance participation.  Delegators of recognized delegates are also ineligible as the campains goal is active voter participation, people who delegate are passive. Address with >50 MKR voting:  Per above does not qualify a small MKR holder for this campaign. Shadow Delegates:  Delegator addresses of shadow delegates are also disqualified  Implementation: This voter incentive campaign will run from Aug 17 to Oct 1.  On Oct 2 the voter data will be analyzed and ranked per the above parameters. Tickets will be distributed by contacting eligible ETH addresses on Oct 2 via etherscan messaging.  Tickets must be claimed by Oct 7th or they will be forfeited.  Campaign Pro & Cons  Pros  Direct incentives for small MKR holders to vote Encourage new voters and holders (People may buy MKR to participate) Growth of governance voter participation Ideally see a growth of active users on the MKR forum   Cons;  Voters could be voting just for rewards without considering actually what the vote is about This could cause some un-delegation as people whom delegate don’t qualify   Some notes about the cons: While the campaign does present the issue of voters not actually reading or caring about their vote this downside would be a no different result with any other type of incentive.  The MKR that could be voting blind is not expected to change the overall direction of the vote as eligibility above limits the voting MKR.   We expect a range of MKR influx to be not more than 1000 MKR based on our best guess. The un-delegation issue is also limited to anyone holding 50 MKR due to eligibility.  Not enough to change any delegated compensation or weight to an impactful extent.  Campaign Schedule Aug 10-17: Forum RFC period,  any feedback or suggestions welcome Aug 17:  Contest Announcement via Twitter Aug 17-Oct 1: Voter data collection Oct 2: Tickets sent through etherscan to qualifying addresses ",
                    "links": [
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-11-17-de-agosto-del-2022/17376",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/11",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/10",
                        "https://forum.makerdao.com/t/relay-semanal-09-15-de-agosto-del-2022/17353",
                        "https://forum.makerdao.com/t/events-001-cu-update-may-july-2022/17474"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1415148284551275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/08/2022-19:15:16",
                    "content": "—Reserved— ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/08/2022-19:39:45",
                    "content": "This is interesting - hoping to be back with some data and analysis. I am glad to see this push to incentive lower-stakes voters, driving participation and a feeling of ownership among these small token-holders. At a glance, it seems like users are paying for the tickets. An easy assumption could be: tickets = votes cast * average gas cost per vote. Don’t have the numbers now but feels like it would float around ~$200? Is this a fair value for the tickets? It seems to ignore the cost of travel, lodging, etc which is required to attend most DAIvinity events - what do you do if you earn the tickets but can’t travel? Please correct me if I am wrong in my estimates here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.962962962962964
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#4",
                    "likes": "1",
                    "time": "10/08/2022-20:08:19",
                    "content": "On the data front, yes we plan on doing some data analysis.  Mostly comparing current smallholders’ participation to participation at the end of the campaign to determine if this way of incentivizing voters had an impact.  Our BFFs at Dat Insights have provided us with the complete voter history to use in determining the benchmark.     fig:  At a glance, it seems like users are paying for the tickets. An easy assumption could be: tickets = votes cast * average gas cost per vote. Don’t have the numbers now but feels like it would float around ~$200?   This comment isn’t clear to me.  I guess you can assume the cost to someone is the gas fee to vote but I don’t think will cost $200 of gas to vote.  From what I can tell it cost a smallholder ~$0.2 to $0.5 worth of eth to vote currently.  I’m not the best at interpreting on-chain data…  We still need to set the minimum vote # participation for this but my guess it will be around 4 or 5 votes to qualify.  So a couple of dollars of gas to qualify.     fig:  It seems to ignore the cost of travel, lodging, etc which is required to attend most DAIvinity events - what do you do if you earn the tickets but can’t travel?   Correct it does not take into account the travel.  So yes this can be viewed as limiting just to people who are already planning on attending the conference.  There are a couple of ideas we have to address this but that is all I can say right now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.395021645021645
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#5",
                    "likes": "0",
                    "time": "10/08/2022-20:29:28",
                    "content": "Agh - embarrassing, haven’t processed an on-chain vote in a while.     PonJerry:  . I guess you can assume the cost to someone is the gas fee to vote but I don’t think will cost $200 of gas to vote. From what I can tell it cost a smallholder ~$0.2 to $0.5 worth of eth to vote currently. I’m not the best at interpreting on-chain data… We still need to set the minimum vote # participation for this but my guess it will be around 4 or 5 votes to qualify. So a couple of dollars of gas to qualify.   Wrote this with the understanding it would be spread across a year - but see the limited time frame now, leading to a more reasonable expense. Yes, seems to be a much lower cost - but still psychologically preventing folks (especially when they think it’s higher like myself!) from jumping in. How do we fix this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.220535714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#6",
                    "likes": "1",
                    "time": "10/08/2022-20:40:29",
                    "content": "    fig:  Yes, seems to be a much lower cost - but still psychologically preventing folks (especially when they think it’s higher like myself!) from jumping in. How do we fix this?   haha, every time I do an ETH transfer these days I get excited about how low gas is. The gas fee psychology is a great point.  Maybe we can address this in our public content rules/post on Twitter.  Add a line in there which shows the average gas price of voting these days so people know it’s not so bad (assuming my price range above is correct…Help I need a Dev) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.432291666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#7",
                    "likes": "2",
                    "time": "11/08/2022-01:49:43",
                    "content": "    PonJerry:  Delegators of reconized delegates are also ineligible as the campains goal is avtive voter participation, people who delegate are passive.   Passive participation for small holders makes a lot more sense than active participation though, due to the gas costs of voting. We should encourage passive participation through delegation as much as we can. Most active participation that this campaign would cause would likely be short-lived due to the gas and time costs of actively voting. Just doesn’t make sense for smaller holders. Edit: even if the gas costs are low right now, this won’t be true forever. And the ongoing time commitment is still a major cost (vs essentially a one-time cost when selecting a delegate, with occasional checkup) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.29359243697479
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#8",
                    "likes": "1",
                    "time": "11/08/2022-02:07:15",
                    "content": "    lyt:  We should encourage passive participation through delegation as much as we can.   I don’t disagree with encouraging delegation, this is also good.  But do people still stay engaged if they delegate?  In this specific case we are looking for interest and engagement with the protocol and governance.  Though maybe we can include new delegators who delegate and remain delegated during and through this campaign timeline to qualify.  I would have to have a look into this.  A great point to bring up.     lyt:  Most active participation that this campaign would cause would likely be short-lived due to the gas and time costs of actively voting. Just doesn’t make sense for smaller holders. Edit: even if the gas costs are low right now, this won’t be true forever. And the ongoing time commitment is still a major cost (vs essentially a one-time cost when selecting a delegate, with occasional checkup)   True,  but this campaign is currently 1.5 months.  I don’t expect gas prices to go crazy like the height of the bull run.  Long term, yes rising gas prices is a blocking point for smallholders.  I do know there are efforts underway to implement gasless voting which would be amazing.  Not sure of the timeline but would hope this is before we need to start worrying about sky-high gas prices again. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5854154903067945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#9",
                    "likes": "1",
                    "time": "11/08/2022-03:17:39",
                    "content": "    PonJerry:  Correct it does not take into account the travel. So yes this can be viewed as limiting just to people who are already planning on attending the conference.   If you win a ticket and are not able to go, would you be able to sell it? Otherwise it would limit the impact of this incentive.     PonJerry:  True, but this campaign is currently 1.5 months   The campaign is great, at a minimum it will create more awareness to the event but also hopefully bring new voters (myself included).     PonJerry:  I do know there are efforts underway to implement gasless voting which would be amazing.   Gamechanger right here! psychologically paying to vote is very tough, its like downloading free apps vs 0.99 apps. Its literally a $1 but it feels very different. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.329316979316979
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#10",
                    "likes": "0",
                    "time": "11/08/2022-12:57:52",
                    "content": "    TRUEMAKER:  If you win a ticket and are not able to go, would you be able to sell it? Otherwise it would limit the impact of this incentive.   So in the case they can not attend, we have discussed the ticket still being valid for redemption for a future event.  Perhaps through issuing an NFT.  We don’t want people selling them and creating a secondary marketplace for DAIvinity tickets. Another option is perhaps for people who can not attend they can instead receive a t-shirt or other piece of swag.  Would have to talk to @aburban90 about this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#11",
                    "likes": "3",
                    "time": "11/08/2022-13:39:57",
                    "content": "We shall coordinate  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#12",
                    "likes": "4",
                    "time": "11/08/2022-14:25:36",
                    "content": "The option between the DaIvinity ticket or MKR swag would be  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#13",
                    "likes": "1",
                    "time": "30/08/2022-04:05:10",
                    "content": "Sorry if it was announced previously and I missed it but did this go live? I couldnt find the tweet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.116161616161616
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#14",
                    "likes": "0",
                    "time": "30/08/2022-08:55:13",
                    "content": "We are a bit behind in launching.  Had to sort some technical details.  Mentioned the delay in our CU update.  Plan to go live in the next few days. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.536363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "28/11/2022-08:55:58",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}