{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-fund-a-professional-media-production-company-as-a-core-unit-that-will-produce-content-for-the-benefit-of-makerdao-e-g-content-marketing-to-grow-dai-supply-and-expand-makerdao-s-fanbase/14641",
            "title": "INFORMAL POLL: Fund a professional media production company as a core unit that will produce content for the benefit of MakerDAO (e.g. content-marketing to grow Dai supply and expand MakerDAO\\xe2\\x80\\x99s fanbase)? ",
            "index": 14641,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll",
                "core-unit"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Fetterguy",
                    "index": "#1",
                    "likes": "5",
                    "time": "14/04/2022-21:54:52",
                    "content": " Glass Entertainment Group (“GEG”) is:        Website: https://www.glassentertainmentgroup.com/  About Glass Entertainment Group:  We are production leaders dedicated to great storytelling. From our humble beginnings in Philadelphia over 20 years ago, we’ve grown into one of the most successful independent production companies in the United States. Founded in 2000 by six-time Emmy-winning journalist and producer Nancy Glass, we have been named to the Global 100 list of top production companies in the world each of the past four years. Glass Entertainment Group has a team of 200+ full-time staff across a group of businesses owned by Nancy. In the group are four video production companies (writing, selling, and producing), a podcast production company, a post-production company (editing, animation, color correction, sound design, and graphics), a gear/equipment company, a music rights business, a casting company, a partnership that owns the intellectual property for the game show Let’s Make A Deal (#2 on CBS daytime), and a back-office (accounting, legal, and business affairs) that supports all GEG businesses. Glass Entertainment has produced thousands of hours of content and is currently producing programming for Netflix, Discovery, Roku, CNN, CNN+, Hulu, Paramount+, Paramount+, Disney+, Snapchat, Nat Geo, Animal Planet, Oxygen, ID, Food Network, HGTV, TLC, A&E, Discovery+, and more.  New Content Production Core Unit proposed: “Let’sMakerDAO” (“LMKR”)  Glass Entertainment Group proposes establishing a new production company, the content production core unit “Let’sMakerDAO”. Nancy Glass will be the Core Unit Facilitator. This core unit’s proposed mandate is to package MakerDAO’s stories for mass consumption, market Dai to a larger audience, grow MakerDAO’s community, and elevate MakerDAO’s legitimacy. LMKR will work closely with the proposed Maker Brand Core Unit, Maker Growth Core Unit, and other core units to support their needs and objectives with professional audio and video.  The Stages of Commercial Content Production:  Commercial content production financed by GEG’s corporate and television network clients happens in stages with the initial development stage often funded by the client (this is a Signal Request for a development budget). Overall, the work in content production is front-loaded into development and pre-production stages, which is why there must be up-front investment before yielding recurring high-quality content.  The Development Stage:  GEG develops a production budget with a corresponding overall production plan inclusive of creative treatments for all concepts proposed. Creative treatments include a creative description and concept overview, an episodic breakdown, a description of the tone, and a style guide (the “look” of the content. E.g. Fonts & colors). Creative treatments bring the idea to life on paper. For some ideas, a “sizzle reel” is created to accompany a treatment. A sizzle reel is an audio-visual proof of concept, typically 90 seconds to 2 minutes. If the client approves the production budget and plan, then the project is green-lit and the production process begins.  The Production stages:  Pre-production: Four to six weeks of planning, casting, logistics, and scheduling the shoot days. Production: Three to six months (depending on the type of content) of cameras rolling with the production team on set. Post-productions: Story Producers and editors work with the raw footage to turn it into the final, air-able product. A production budget is typically 25-30x the development budget.  Developing a Strategy Proposal for Twelve Months of MakerDAO Content  This Signal Request asks if GEG should apply for funding to develop a Proposal for twelve months of MakerDAO content that includes a slate of shows (for each, LMKR will produce a production budget and treatment). If this Signal Request is successful, GEG will create a more formal proposal to acquire the necessary budget and onboard as a core unit. This Proposal will wrap a handful of show treatments/budgets/sizzles into an overall content-marketing strategy package that considers YouTube, all podcast platforms, Twitter, Instagram, TikTok, Facebook, and MakerDAO’s website. The Strategy Proposal will optimize for getting LMKR content picked-up by the DeFi news outlets and mainstream media: network, cable, and print (e.g. CBS, CNN, CNBC, The Wall Street Journal, etc.). The content strategy will include a mix of evergreen educational and docu-series, interviews, timely news reporting, potentially even cartoons or comedy. It may consider non-English-speaking audiences. The requested development budget (details below) will be $124,053.60 of Dai, with a three month deadline to deliver:  Development Budget and Team for Three Months:      Budget Item Weekly Salary ($) Term (Weeks) Total ($)     Development Producer (creative leader) $3,000.00 12 $36,000.00   Associate Producer $1,650.00 12 $19,800.00   Researcher (crypto native) $1,500.00 10 $15,000.00   Research Assistant (crypto native) $1,250.00 10 $12,500.00   Audio-Video Editor (for sizzle reels) $5,000.00 1 $5,000.00   Edit Bay (equipment rental) $2,000.00 1 $2,000.00   Graphic Designer (for the style guide) $2,500.00 1 $2,500.00   Personnel Fringe (payroll taxes, workers compensation, health benefits, etc.)   $19,976.00   Subtotal Production Budget   $112,776.00   Production Company Fee to GEG (10%)   $11,277.60   Total Budget   $124,053.60     Cons   GEG is new to producing content about crypto, DeFi, TradFi, global macro, and central bank monetary policy GEG is not crypto native. Not yet…   Pros   GEG has a track record of success in new domains because of a unique ability to listen and learn. (GEG plans to engage with core units, MKR Delegates, MKR holders, global macro investors, central bank wonks, and other experts during the development phase.) GEG will recruit the best content production talent in the world (as it does for every project) and MakerDAO will have its own content production core unit of full-time professionals under the expert management of GEG   NON-BINDING STRAW POLL QUESTION:     Should GEG apply for $124,053 of development funding for a new core unit, Let’s MakerDAO, to develop a content marketing strategy (to be delivered in three months) for one year of MakerDAO content?  Yes No Abstain     0 voters      Next Steps:  This signal will last two weeks, concluding on April 26th, 2022. LMKR will submit a Content Development MIP with the above development budget. If the Content Development MIP passes, the Strategy Proposal will be developed, and LMKR will submit a subsequent MIP to fund one year of MakerDAO content marketing. As the world order continues to change and Crypto emerges dominant, we want to help MakerDAO lead the narrative.      ",
                    "links": [
                        "https://www.glassentertainmentgroup.com/",
                        "https://www.cbs.com/shows/lets_make_a_deal/",
                        "https://forum.makerdao.com/t/the-maker-brand-team/14442",
                        "https://www.youtube.com/watch?v=pgYkUSgpa_w",
                        "https://forum.makerdao.com/t/weekly-relay-april-12-18-2022/14691",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-14-20-2022/14727",
                        "https://forum.makerdao.com/t/governance-and-risk-187-thursday-april-21-17-00-utc/14708/2",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-4/14770",
                        "https://forum.makerdao.com/t/governance-and-risk-194-thursday-june-09-at-17-00-utc/15664/2",
                        "https://forum.makerdao.com/t/relay-semanal-12-18-de-abril-de-2022/14724"
                    ],
                    "GPT-summary": "Glass Entertainment Group proposes establishing a new production company, the content production core unit “Let’sMakerDAO”. The proposed mandate is to package MakerDAO’s stories for mass consumption, market Dai to a larger audience, grow MakerDAO’s community, and elevate MakerDAO’s legitimacy. The post explains the stages of commercial content production and proposes a strategy for twelve months of MakerDAO content. The proposal includes a development budget and team for three months. The post also includes a non-binding straw poll question asking if GEG should apply for $124,053 of development funding for a new core unit, Let’s MakerDAO, to develop a content marketing strategy for one year of MakerDAO content.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.7821898047307885
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "2",
                    "time": "14/04/2022-22:34:40",
                    "content": "Thank you for applying. Just curious, what does the team mean exactly by “one year of MakerDAO content”? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.729166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "1",
                    "time": "14/04/2022-23:12:08",
                    "content": "Good question! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "6",
                    "time": "14/04/2022-23:48:14",
                    "content": "I feel that the majority of these fail because they come in immediately wanting to get the money from the DAO. They don’t get involved, they don’t see the direct shortcomings, they don’t seek direct feedback from the community… This I think is the 5th attempt of its kind. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#5",
                    "likes": "1",
                    "time": "15/04/2022-00:08:57",
                    "content": "Is this money only to develop a plan? Or to produce marketing? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/04/2022-10:41:50",
                    "content": "Just clarifying that this is being treated as informal poll rather than a signal request. Rides the line between both a little, but given that the poll is non-binding and won’t lead to an on-chain vote directly, I think this makes more sense. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tylermeanswell",
                    "index": "#7",
                    "likes": "0",
                    "time": "15/04/2022-12:32:55",
                    "content": "Just gonna say my only experience in another DOA where we tried to hire a professional media company went this way-- let them go after a quarter and had nothing to show for it but less cash on hand. But the solution to that just lies in finding the right company that’s going to be committed to their roll, we shouldn’t just pick the first company that comes up if this become more than just a temperature poll ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.807539682539683
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#8",
                    "likes": "5",
                    "time": "15/04/2022-19:00:34",
                    "content": "I wanted to stop by to put in a good word for this poll, and explain why I’ve voted yes. So for those of you that haven’t made the connection, this is @maxglass 's mom’s company . Without this prior connection I doubt we could have sourced an application of this quality, so thank you Max for putting in the hard work to educate the GEG team on MakerDAO. My reasoning for thinking this is a good idea is simple - this is a professional company with hundreds of employees that does this for much bigger brands than MakerDAO and has an incredible track record. I mean seriously, what else do you want? And of course they are asking for money to scope out this project, they are a business and don’t work for free. You get what you pay for. Really I think the question comes down to this - do you want to onboard a group that has been active in the MakerDAO community but has little real world experience in media to build out Maker’s marketing and content strategy? Or do you want to hire a group of professionals with a proven track record that will work closely with the community to get this done right? If it’s the latter, why are you voting no? It’s really not easy to get these kind of high quality applications up in the forums, so at the very least you owe GEG an answer to that question. Also @LongForWisdom why is this an informal poll? It’s nice to see community sentiment, but I think GEG is really shooting for the MKR holder’s opinion given that they’ll be laying out the cash. How can GEG petition the MKR holders and not just the community? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.630241402116402
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#9",
                    "likes": "3",
                    "time": "15/04/2022-19:10:22",
                    "content": "Avast! Seems ta be cheaper’n putting an entire CU devoted to putting’ free grog in the bellies of conference swabbies. Why not?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "3",
                    "time": "15/04/2022-19:12:55",
                    "content": "    g_dip:  Also @LongForWisdom why is this an informal poll? It’s nice to see community sentiment, but I think GEG is really shooting for the MKR holder’s opinion given that they’ll be laying out the cash. How can GEG petition the MKR holders and not just the community?   I suppose that would be a signal, but it would have to be phrased and presented differently. Like, we can’t put up an on-chain poll saying something like: “Fund a professional media production company as a core unit that will produce content for the benefit of MakerDAO (e.g. content-marketing to grow Dai supply and expand MakerDAO’s fanbase)?” … because it implies that if voted yes, then we’d be onboarding GEG as a core unit, which would not be the case, because we only onboard Core Units using the relevant subproposals as part of the MIPs Process. Could put it up as something like: “Sentiment - Media Production Core Unit (GEG)”…  I tend to try to figure out what the author was going for when something ambiguous like this gets posted. If a new author posts something, and calls it a signal request but in the content implies that they’re presenting a non-binding straw poll, and that the next steps will not be an on-chain poll, but proceeding with putting up a MIP, that fits better as an informal poll than as a signal request. @Fetterguy is more than welcome to clarify, but I didn’t get the understanding from the presentation that they were seeking an on-chain poll prior to the MIP Proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.348484848484849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#11",
                    "likes": "7",
                    "time": "18/04/2022-14:14:43",
                    "content": "This is very interesting and definitively something to consider in the future. However, I voted No because I believe we first need to define the Brand program and Comms strategy before producing any type of content like this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#12",
                    "likes": "1",
                    "time": "18/04/2022-15:36:59",
                    "content": "    Fetterguy:  A production budget is typically 25-30x the development budget.   I voted no because of this line.  I appreciate the up front transparency but that means production  is 3-3.7 million.  I think there are better ways to spend or invest that money for now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#13",
                    "likes": "2",
                    "time": "18/04/2022-20:57:45",
                    "content": "I voted yes – in accord with Greg’s points – because the DAO lacks (and always has lacked) a professional sheen to its marketing and communications. The shame and the opportunity here is that with  a professional experienced team like this, we can do a test run without having to onboard another expensive core unit. We constantly see complaints about the lack of marcomms, so here’s a chance to see what the DAO can do with some real professional help (as opposed to what the protocol has paid through the nose for in the past).** And yes, as Greg said, it would be great to get this to an MKR vote, as opposed to permitting forum participants to gate keep on whether this is brought up for a decision. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#14",
                    "likes": "2",
                    "time": "18/04/2022-22:51:07",
                    "content": "I appreciate this proposal but have voted no. It’s true that the DAO has historically lacked the kind of professional sheen that I’m sure this media production company could provide, but Maker has more fundamental marketing/brand problems to resolve first. It seems like this proposal is to mostly to produce a lot of content (“sizzle reels”, documentary episodes/shows, interviews) - but to what end? We need a long-term strategic plan for what we are trying to achieve with Maker/Dai’s brand, and that doesn’t seem like a sensible thing to outsource (because it’s a difficult balancing act of different values/principles/aims within the DAO). After we have that in place, then perhaps we can issue a RFP to source content from professional agencies like GEG. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#15",
                    "likes": "0",
                    "time": "18/04/2022-22:54:34",
                    "content": "The proposal is interesting, but I vote No, I think that more than Okrs or objectives are promises, and we need to see actions. Sorry guys ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#16",
                    "likes": "1",
                    "time": "21/04/2022-03:12:26",
                    "content": "    Traster_Tray:  that means production is 3-3.7 million. I think there are better ways to spend or invest that money for now.   @Traster_Tray this is a phenomenal comment and we should concentrate our discussion on answering the question: Can MakerDAO earn a 10X return on a $3.5M investment in an abundance of high quality content? If we don’t think MakerDAO can earn a 10X on this investment, we shouldn’t move forward to fund any content development. I believe funding a core unit to produce an abundance of high quality content is a 10X opportunity because this content will drive user growth and increase customer lifetime value. MakerDAO has big initiatives nearing production/scale (like L2 deployment, institutional vaults, and real asset lending). MakerDAO is the lowest cost of capital anywhere and that story (among other compelling stories) is not being told loudly enough to a wide enough audience. Content production has economies of scale, and network effects (we can recirculate viewers inside a growing library of MakerDAO content). If MakerDAO is going to fund any content production, I think the budget should be large enough to benefit from those economies of scale and to maximize network effects from an ever growing library of high quality content. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.7033163265306115
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#17",
                    "likes": "2",
                    "time": "21/04/2022-03:40:10",
                    "content": "The poll just asks if they should apply… why would anyone vote “no” on that? Voting “yes” only means it’s worth further consideration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#18",
                    "likes": "1",
                    "time": "21/04/2022-04:22:27",
                    "content": "It seems like GEG wanted to test the waters with the community before spending (I assume) a lot of time and effort putting together a formal proposal. It’s a little ambiguous like @LongForWisdom has noted, but their original poll seems aimed to gauge interest in whether they should go to that effort. GEG can still make a formal application no matter how the poll plays out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#19",
                    "likes": "2",
                    "time": "21/04/2022-05:33:22",
                    "content": "I would become an ardent supporter of any content production project that could convince me they could get 10X returns. 10x of 3.5 mil is 35 mil which is equivalent to 700 million dollars of collateral giving 5% returns.  I am admittedly not experienced in this realm but come from a position of skepticism. I think MKR still needs some time to work on its product and processes.  There’s plenty that the CES and PE teams are working on and even if a flood of demand came in, I’m not sure the protocol could quickly scale to handle it.  Before we spend the big bucks, I want there to be an even better story to tell.  With branding and marketing in the works elsewhere, I’d prefer to see how that goes and table this discussion for another time. Also note that the 3.5 mil production timeline is 3-6 months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.183333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#20",
                    "likes": "6",
                    "time": "21/04/2022-06:22:59",
                    "content": "My problem with this isn’t just the high pricetag but the lack of any deliverables and a coherent Marketing plan. What I personally want to see is a coherent plan that co-ordinates and puts into one roof the following Strategic Happiness Branding Marketing Events etc. with a real budget and some idea of what the goals and performance metrics are for such a co-ordinated effort.  Honestly if 80% (or more) of Maker revenues come from a handful of whale partners exactly why again are we going through all this effort on marketing when the vast majority of people we are paying to engage simply can’t use, or are priced out of Maker due to dust limits? Let’s be real here.   A can of Pepsi or coke only costs $1 and the entire world can buy this.   At at dust level of $20K - I don’t know anyone other than myself that can afford to open and use a vault much less who that has > $20K would have any sufficient assets in crypto to use Maker.  In the US one of the richest nations in the world 80% of the people don’t even have $500 cash for emergency expenses? Put this in the hopper for the quarterly expansion requests with all the rest. Literally Maker has work to do and while I am very happy to see requests like this I want them formally to be put into an ‘expansion’/‘growth’ hopper for a quarterly review to assess interest, prioritization and then put against funding we may or may not allocate. I can think of about 6 things off the top of my head that has significantly more ROI, for less expense that Maker needs to work on and/or is working on.  Many of these (for example Maker instances on L2s or cheaper sidechains) need to come on-line first before we should even think about marketing to the masses. L2 funding/wormhole D3M compound, Maple, etc. RWA (take your pick of project) Finding more institutional vaults Taking Maker to the next level (Maker3.0, Aggressive growth, SPV, etc.) Maker instances on L2s and/or sidechains ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.120833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#21",
                    "likes": "2",
                    "time": "21/04/2022-14:46:10",
                    "content": "I voted no, because of this     MarianoDP:  we first need to define the Brand program and Comms strategy   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#22",
                    "likes": "3",
                    "time": "21/04/2022-14:55:20",
                    "content": "Echoing @MakerMan my concern here is just that we may not be ready for a high quality media campaign (which I have no doubt the proposed Core Unit could produce… the sample video is great). I don’t know how such a campaign will influence people to open vaults.  Once we are fully deployed on StarkNet there will be a much wider audience. On the other hand, if it influences people to prefer using Dai over other stablecoins driving demand, I suppose the supply will catch up one way or another. Or maybe it could be useful to shape perceptions of MakerDAO to regulators and related entities.  Spreading the message that Dai is safe, etc. The open question seems to be whether this is the right time for a high quality media campaign and if so what exactly does it aim to do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.868571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#23",
                    "likes": "2",
                    "time": "21/04/2022-16:41:09",
                    "content": "    Traster_Tray:  10x of 3.5 mil is 35 mil which is equivalent to 700 million dollars of collateral giving 5% returns.   I think you mean that a lift of $35M of revenue requires $700M of additional borrowing (at least $1.05B of collateral) yielding 5% (not considering Dai savings rate expenses). An increase in yielding Dai supply of $700M is conservatively a 23% increase on the current $3.08B of yield bearing Dai (“Volatile Dai”). Year-over-year the Volatile Dai supply grew 26.3% in a crab market with nearly no marketing and high L1 gas fees. I am confident that we can achieve greater than 23% increase in the year of The Merge, L2 launch, and RWA scaling up. I think it’s time to throw fuel on the fire with investments in growth. This content production budget would be $125K for the next three months of learning and development then twelve months of content production for around $3.5M.     Traster_Tray:  not sure the protocol could quickly scale to handle it.   Sure it can! MakerDAO is software that’s built to scale. Borrowers could draw $700M additional in Dai tomorrow with zero fuss.     Traster_Tray:  production timeline is 3-6 months   Timeline is 3 months of development and 12 months of production. With content publishing starting in month 4 of production (at least 6 months from now) @Fetterguy? MakerDAO has great stories to tell right now and in 6 months it will have even better stories. As the great Wayne Gretsky says, “skate to where the puck is going.” MakerDAO is in a highly competitive market, stablecoins, that is a multi-trillion dollar opportunity. Investing to build a continual flow of high quality content will give MakerDAO a competitive boost. And Maker can afford this because it has $68M+ in the surplus buffer with about $50M revenue run rate. That $3.5M or so of a production budget would be $300K or so monthly and, frankly, could be cut at any time by offboarding the core unit for underperformance. I see low risk and a lot of upside here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.902886904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#24",
                    "likes": "2",
                    "time": "21/04/2022-16:46:25",
                    "content": "@Fetterguy According to your budget, you want to create 4 full-time and 2 part-time jobs in crypto. You hire internally and externally. If the ultimate production is fully funded, around how many full time jobs in crypto could it be? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#25",
                    "likes": "0",
                    "time": "21/04/2022-17:17:48",
                    "content": "Yes, thanks for the corrections.  It helps me understand where you’re coming from.  I don’t disagree with anything you said.  My perspective was one of growth through onboarding real world assets.  I think I see that you are focusing on growth in supported crypto assets.  I think it’s a little optimistic but if you get the timing right, I could see it working out.  It’s hard for me to measure what is naturally occurring demand and what might be generated from content production but to your point, we did mint billions upon billions of DAI last year.  I see MKR as already well known to large players in the defi world so I’m more interested in marketing toward RWA opportunities currently without much in terms of crypto influence.  This is where my comment about scaling comes from. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.612847222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#26",
                    "likes": "1",
                    "time": "21/04/2022-18:27:54",
                    "content": "    Traster_Tray:  I see MKR as already well known to large players in the defi world so I’m more interested in marketing toward RWA opportunities   I actually think that a small percentage of crypto users understand what MakerDAO does and how to borrow Dai (and why it’s better to borrow Dai from MakerDAO vs. any other lender). This content production core unit will tell stories about each of the core units, each product, and each internal initiative at MakerDAO. The audience will be retail borrowers who are crypto-native, those who are new to crypto, and institutional borrowers. GEG is an expert at content for the lowest common denominator, a lay audience, as it produces for cable television, and, as such, it can produce content for individuals wherever they are on their crypto learning journey. As I am personally on the front line of onboarding RWA, I see that scale-up as a pound-the-pavement, door-to-door business development process. I believe content is best suited for onboarding the retail borrowers who can self-serve via Oasis or DeFi saver. I also believe it can help core units recruit high quality contributors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.744874768089053
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#27",
                    "likes": "0",
                    "time": "21/04/2022-18:36:51",
                    "content": "    Spidomo:  Once we are fully deployed on StarkNet there will be a much wider audience.   That deployment will happen over the next 6 months and it will take a similar timeframe for any content production to reach deployment.     Spidomo:  maybe it could be useful to shape perceptions of MakerDAO to regulators and related entities   100% yes! We intend to take the regulators on a learning journey too. Crypto is a big opportunity for the USA. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#28",
                    "likes": "0",
                    "time": "21/04/2022-18:47:04",
                    "content": "    MakerMan:  why again are we going through all this effort on marketing when the vast majority of people we are paying to engage simply can’t use, or are priced out of Maker due to dust limits?   In 6 months, L2 will be deployed. Dust limits should be low. Should we have the foresight to setup content production that will be deployed on the same timeline?     MakerMan:  lack of any deliverables and a coherent Marketing plan.   That’s the purpose of the paid development period, to standup a full time creative team of professional producers under management of GEG to coordinate with core units and propose a plan that includes the deliverables, budget, and timeline. It will be a lot of work to develop this plan. Maybe there will be a production company that will develop one for free but for $125K MakerDAO can hire GEG, which has a team of 200 and 22 years of experience producing for institutional clients like Netflix, CNN, A&E, and Discovery Channel. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.862500000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fetterguy",
                    "index": "#29",
                    "likes": "1",
                    "time": "22/04/2022-01:58:55",
                    "content": "Thank you to all those who have read this, voted and/or replied. The best way to reach GEG (LMKR) privately is by email or through this forum. If you reach out to me directly on the Forum, I can share the emails for my team. A few of us are on Discord and can be reached there. I am under the same handle, @Fetterguy.  Additionally, we want to set up dedicated time to meet all of you and discuss what is possible here. Announcing LMKR’s weekly Q&A starting 5PM EST on Monday, April 25th, 2022.  Please join us here: https://meet.google.com/mwn-nrqp-qqq. This is an opportunity to answer more questions and begin to meet members of the MakerDAO community! We want to address every comment directly, as the feedback we’ve received is all valid and worth discussing further. I am addressing some of the initial comments we received here:     Traster_Tray:  I voted no because of this line. I appreciate the up front transparency but that means production is 3-3.7 million. I think there are better ways to spend or invest that money for now.   @Traster_Tray, I completely understand that feeling. The intention of including this in our post was exactly that, we wanted to be transparent. No one likes to make a small initial investment and then have the rug pulled out from under them when they want to expand the relationship. If MakerDAO has a goal on the amount they want to invest in content for FY 22-23, we are happy to tailor our proposal toward a specific budget, if it makes sense for everyone. This was in an effort to be clear about what is customary in the marketplace for the type of proposal we plan to build out for MakerDAO.     Saludiego_201:  they don’t seek direct feedback from the community…   This IS a solicitation for direct feedback!  please share your opinion publicly or privately and vote. The intention of the development phase is to address this very concern. It allows our team to create a foundation for content creation and avoid this type of previous failure. We will do the legwork to get direct feedback and collaboration from delegates, MKR Holders, and core unit teams so that the content plan aligns perfectly with MakerDAO’s goals.     Doo_StableLab:  what does the team mean exactly by “one year of MakerDAO content”?   The goal of getting a development budget is to fund a top notch team to answer that very question! During this development phase we are proposing, we’ll define a roadmap and an entire slate of content that could include: a daily news show, memes, gifs, short-form content, mini documentaries, interview series, explainer videos, animations, podcast(s), product commercials to name a subset of the ideas we’ve brainstormed.     Puzzler:  Is this money only to develop a plan? Or to produce marketing?   @Puzzler, thank you for the question. To answer it directly, the money is only to develop a plan. We will not be producing content during the initial three month development phase. Traditionally, in the content market, an initial budget is provided to scope and develop a proposal on paper. In television, this is typically a treatment and production budget. Because we are generating an entire content strategy, building a production team, and developing a slate of programming, the deliverable at the end of the development phase will include multiple treatments, a production plan, a team structure, and a budget that will be included in a Core Unit onboarding MIP.     MarianoDP:  This is very interesting and definitively something to consider in the future. However, I voted No because I believe we first need to define the Brand program and Comms strategy before producing any type of content like this.   @MarianoDP, I completely agree with your sentiment and intend for this development stage to be a collaboration with your team on a branding and comms strategy.  GEG brings audio-video production expertise that will be beneficial to defining those strategies. This development phase is an opportunity for MakerDAO to fund a professional team of creatives to get clear on the type of content marketing and programming that will grow MakerDAO. If MakerDAO decides that GEG isn’t the right group after working together and reviewing the final proposal, there is no further commitment and MakerDAO can continue to iterate on the proposal itself or with any production group.     Matt_NZ:  I appreciate this proposal but have voted no. It’s true that the DAO has historically lacked the kind of professional sheen that I’m sure this media production company could provide, but Maker has more fundamental marketing/brand problems to resolve first. It seems like this proposal is to mostly to produce a lot of content (“sizzle reels”, documentary episodes/shows, interviews) - but to what end? We need a long-term strategic plan for what we are trying to achieve with Maker/Dai’s brand, and that doesn’t seem like a sensible thing to outsource (because it’s a difficult balancing act of different values/principles/aims within the DAO). After we have that in place, then perhaps we can issue a RFP to source content from professional agencies like GEG.   @Matt_NZ, this feedback seems consistent with what @MarianoDP  shared above. I do feel like LMKR and Glass Entertainment can facilitate conversations in our process to better define the fundamental marketing/brand goals MakerDAO is looking to achieve. During our development phase, our intention is to meet with as many of the delegates, MKR Holders and Core Unit teams to understand the different values, principles and aims within the DAO to define a content strategy. We’d love the opportunity to move right from the development phase to executing on that content strategy, but if after the three months the sentiment is to digest our findings and eventually issue an RFP, we’d completely understand and would be first in line to submit our proposal to MakerDAO at the time of the RFP issuance.     Alefcripto:  The proposal is interesting, but I vote No, I think that more than Okrs or objectives are promises, and we need to see actions. Sorry guys   Thank you for your response, @Alefcripto. This is in fact the entire idea of the development stage. We want to have a scope of work with defined Okrs, KPIs and objectives so that we are held accountable to those benchmarks. Without that, you are correct, there are only “promises’’. The intention is that once a clear strategy and plan is ratified and approved, the action will start. Respectfully, as Greg_DP said above, we are a business. To take action, we need a commitment to perform that action.     tylermeanswell:  Just gonna say my only experience in another DOA where we tried to hire a professional media company went this way-- let them go after a quarter and had nothing to show for it but less cash on hand. But the solution to that just lies in finding the right company that’s going to be committed to their roll, we shouldn’t just pick the first company that comes up if this become more than just a temperature poll   @Tylermeanswell, we completely understand your experience and it seems to be a consistent sentiment throughout the comments here. In reviewing the forum, it seems like the last content team that was on-boarded provided very similar results to what you’ve outlined above. And sadly, we hear about these type of experiences outside of the DAO community as well. We’ve been brought in by major networks and studios to finish a job that another production company couldn’t complete (all talk, no execution). We’re considered a best-in-class, reliable production company throughout the entertainment and corporate space. That is why we’ve been named to the list of Global 100 Production Companies for the last four years. And our client list, which continues to grow, speaks for itself: CURRENT CLIENTS: CABLE: Discovery Channel History Channel CNN HLN HGTV Food Network TLC National Geographic NatGeo Wild A&E Oxygen MTV MTV International CORPORATE: OxeFit- A FitTech startup PAST CLIENTS: Cable: Animal Planet WEtv ID Travel Channel DIGITAL: SnapChat Upworthy AOL Discovery DIGITAL CORPORATE: CapitalOne Chevrolet Walgreens L’Oreal Clorox P&G The Martin Agency Carmax Dole VisitPhiladelphia University of Pennsylvania APP DEVELOPMENT Discovery Channel Animal Planet Your concern is the very reason we proposed this initial step of development for three months. This will allow us to better understand MakerDAO’s needs and goals. We aren’t going to come in and dictate how things are going to go. That isn’t how we work. We also aren’t going to spin our wheels and waste everyone’s money. The goal coming out of this development phase is to establish a clear plan for a year of content creation with defined deliverables and a budget necessary to execute it. We execute and deliver a high quality product to all our partners. That is why the client list above is so long and we’ve continued to work with those partners project after project, for over 20 years. Our reputation in the market exists because of that. We wouldn’t jeopardize our reputation by taking on this job and leaving MakerDAO with “nothing to show for it but less cash on hand”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.58890873015873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#30",
                    "likes": "0",
                    "time": "22/04/2022-11:03:24",
                    "content": "    Fetterguy:  The goal of getting a development budget is to fund a top notch team to answer that very question! During this development phase we are proposing, we’ll define a roadmap and an entire slate of content that could include: a daily news show, memes, gifs, short-form content, mini documentaries, interview series, explainer videos, animations, podcast(s), product commercials to name a subset of the ideas we’ve brainstormed.   Thanks for this post providing feedback to the questions. I see in the original post it refers to a strategy proposal for 12 months of MakerDao content and there is a small summary of some possible options. Are you seeking the funding to create a proposal for 12 months of content or to execute the proposal (stick around to make sure things run smoothly) ? Or is it both ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#31",
                    "likes": "1",
                    "time": "22/04/2022-13:50:14",
                    "content": "    Fetterguy:  During our development phase, our intention is to meet with as many of the delegates, MKR Holders and Core Unit teams to understand the different values, principles and aims within the DAO to define a content strategy.   You’re right in this, defining a content strategy is key. But the issue is there are steps before this, which is Maker’s internal task. That is to say, defining who should the content be aimed at. Content without a targeted growth audience is not very useful. That’s a little bit of a cart before horse situation.  Screenshot_2022-04-06_at_11.18.511920×1463 354 KB  It’s very top-line, but steps 1 and 2 in my illustration are yet to be fleshed out, content production doesn’t really come until step 3.     Fetterguy:  GEG brings audio-video production expertise that will be beneficial to defining those strategies.   Also, looking at the impressive list of clients and showreel I’m sure there’s no doubt about GEG’s expertise. But, the expertise needed now at this stage is more of a brand/comms strategist’s role as opposed to audio-visual. It’ll be difficult to write a production brief for GEG without knowing what we need to ask for. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8510105965463115
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#32",
                    "likes": "1",
                    "time": "22/04/2022-15:23:20",
                    "content": "    MFeinberg:  funding to create a proposal for 12 months of content   This poll asks if GEG should post a MIP requesting $125K to setup a team to develop a 12 month content production plan, as described herein. GEG is hired by major television networks as a creative shop to develop content and to produce it. The development stage is a period before production and MakerDAO has the opportunity to have four full time creatives work in the MakerDAO community for a three month period, and to get a useful deliverable, a plan for 12 months of content. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.515625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#33",
                    "likes": "0",
                    "time": "22/04/2022-15:30:28",
                    "content": "    Mamun:  Maker’s internal task. That is to say, defining who should the content be aimed at. Content without a targeted growth audience is not very useful.   Why wouldn’t MakerDAO employ an “all of the above” strategy?  Crypto-native, retail borrowers Crypto owners who’ve never used a self-hosted wallet Those new to crypto Institutions, both DeFi and TradFi Regulators and legislators  Each is an important audience and, with sufficient resources, content can be created for all. One goal is to package content for redistribution through other channels like Bankless, The Defiant, Blockworks, and RealVision. We want to get those phenomenal channels playing clips of MakerDAO content and discussing MakerDAO’s stories more often. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.925699300699301
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#34",
                    "likes": "0",
                    "time": "22/04/2022-15:30:54",
                    "content": "Thanks but that doesn’t directly answer my question. After the three months where this 12 month plan is created, what (if any) role will GEG have in making sure that plan is adhered to so as to assure proper execution ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#35",
                    "likes": "1",
                    "time": "22/04/2022-15:34:57",
                    "content": "At the end of the 3 month development period, GEG will submit the plan and a MIP seeking funding to produce the content in accordance with the plan. MakerDAO will have the option to run an RFP process with the plan, if it wants, and GEG can compete for the job. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#36",
                    "likes": "2",
                    "time": "22/04/2022-15:56:54",
                    "content": "Thanks Max for all the answers. It is very difficult for me to understand why this initiative needs to be a separate core unit with all the things we are talking around responsible budgeting and new CU. Ideally, these types of actions should be under the command of a core unit that develops and coordinates everything related to the MakerDAO Brand where GEG can be a provider, this makes it more efficient (Goals & Objectives) while being cost-effective for the protocol. On the other hand, if we already know that the development of this type content is +2M Dai, my opinion is that in the current state of the protocol, that money could be used for other initiatives that grant a much higher ROI, especially when we are still putting together the communication plans and product message, which we are seeing an incredible success. I believe that the community must align on how to develop the most important verticals of the protocol following a structure or tacit agreement where there cannot be many core units working on the same thing. Some say that “Task overlapping” is good due to inefficiencies inherent of a DAO, but as I mentioned before, I think that actions like these should be under a core unit that brings together a Marketing/Branding plan that has all the components aligned in search for a specific goal, if not we are just making disperse efforts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0139462809917354
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#37",
                    "likes": "0",
                    "time": "22/04/2022-16:13:19",
                    "content": "    MarianoDP:  these types of actions should be under the command of a core unit that develops and coordinates everything related to the MakerDAO Brand where GEG can be a provider   I look forward to meeting with you about your proposed Brand Core Unit. I understand that you have a long history with and deep knowledge of MakerDAO. Also, that Brand CU is currently incubating inside Growth CU. I am working on growthy things too, RWA. Sales and business development is my expertise, so this idea for a content production core unit came out of my aspirations to help MakerDAO compete and grow. I believe that there can be a sophisticated content production core unit (or several) that take direction from Brand and work with numerous core units. I see it as an independent core unit that helps other core units by curating stories from them, curating any content they publish, helping each of the core units write and publish high production value content, and making sure everything published is on brand. As for curation, one idea is to have a Huffington Post style landing page that curates the best content from across MakerDAO (forum posts, blog posts, Dai stats, video, and so on). A front page for MakerDAO content.     MarianoDP:  my opinion is that in the current state of the protocol, that money could be used for other initiatives that grant a much higher ROI   Do you see MakerDAO as financially constrained right now? I see sufficient cash on hand, strong recurring revenue, and massive tailwinds. I don’t see an either-or situation for funding good initiatives. I believe MakerDAO should fund every single high quality initiative or core unit opportunity that arises because each is a potential 10X driver at this early stage. The biggest mistakes of MakerDAO at this stage will be failing to fund big opportunities and the opportunity cost. Much like venture capital investing, the worst choices are the deals that are a huge success that the investor failed to fund. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.519603174603175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#38",
                    "likes": "0",
                    "time": "22/04/2022-16:20:46",
                    "content": "Got it. Thanks for the info! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fetterguy",
                    "index": "#39",
                    "likes": "0",
                    "time": "25/04/2022-20:38:05",
                    "content": "    Fetterguy:  https://meet.google.com/mwn-nrqp-qqq   Hi all - just a reminder that Glass Entertainment is holding a Q&A at 5 PM ET to discuss any questions or feedback about this Informal Poll. Please join at this link:    meet.google.com   Google Meet (formerly Hangouts Meet) - Free Video Meetings Use Google Meet (formerly Hangouts Meet) video conferencing solutions from your browser or mobile app. Get started with a secure, HD video today.      ",
                    "links": [
                        "https://meet.google.com/mwn-nrqp-qqq",
                        "https://meet.google.com/mwn-nrqp-qqq"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#40",
                    "likes": "1",
                    "time": "27/04/2022-01:25:08",
                    "content": "After reading the thread too many times and missing a call, voted yes in the hopes that GEG could be a provider for the brand team. As @MakerMan  noted, part of the plan they present should definitely support/unite teams and messaging. In addition, coming to poll before asking for a budget seems like a better approach for content initiatives.     MarianoDP:  coordinates everything related to the MakerDAO Brand where GEG can be a provider   It seems like the quality of content, partnerships, and overlap would be a good thing. Regardless of outcome, this thread has gotten so many responses I think we’ve aligned a majority of the moving pieces underlying a coherent brand vision. Thanks, @Mamun for articulating some of those here and in your thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#41",
                    "likes": "8",
                    "time": "27/04/2022-03:16:50",
                    "content": "Great proposal thank you! Having done a quick review of your work - whilst wearing my user/consumer hat, it is evident that you can deliver quality work and that you know how to provide high end material for a world class product. There is however one prerequisite that I feel we, as an organisation need to align on first, which is defining our organisational strategy, before we tackle our content strategy. For example, where does the DAO prioritise/position the e.g. organisation’s regulatory framing image relative to the aggressive growth debt raising strategy, L2 expansion or partner integration. Similarly, what is the future that the DAO envisions for itself - is it a revamped tokenomics model where metaDAOs step forward, or is it something else. Many of these are not mutually exclusive and will steer development in a particular direction that needs to be understood first. All that said, I have voted yes on the assumption that this is to continue discussions and potential scope of involvement, because we absolutely need quality, however I am hesitant on the timing due to the above which in my eyes needs alignment first (a separate topic) before a high quality production company becomes involved. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.998529411764705
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#42",
                    "likes": "0",
                    "time": "27/04/2022-22:49:26",
                    "content": "Thank you to all who commented and voted. The best reply by far was     Piratical:  Avast! Seems ta be cheaper’n putting an entire CU devoted to putting’ free grog in the bellies of conference swabbies. Why not?   And I agree wholeheartedly. This content production core unit is already in action with reporting from Sloane Glass (see today’s Newsnation broadcast to a national audience on the topic of Fort Worth, TX now mining Bitcoin):     And @g_dip with the cameo  Glass Entertainment and I plan to be on the Scientific Governance and Risk call today 4/28 to discussed the future development budget proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rob",
                    "index": "#43",
                    "likes": "0",
                    "time": "28/04/2022-02:33:29",
                    "content": "So… what happens now? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#44",
                    "likes": "2",
                    "time": "28/04/2022-05:31:38",
                    "content": "I just watched that video…looks good. Just imagine Tracy Morgan promoting Dai.It ain’t quite Gisele and Tom Brady but it’s better than nothing (which is what we have now).      ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#45",
                    "likes": "3",
                    "time": "28/04/2022-08:01:23",
                    "content": "We’ll attend the governance call tomorrow @prose11 and take it from there ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#46",
                    "likes": "1",
                    "time": "28/04/2022-10:47:29",
                    "content": "Tracy Morgan is one funny dude. I would love to see him promoting Dai!   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#47",
                    "likes": "0",
                    "time": "28/04/2022-11:05:09",
                    "content": "He mentions the bill passed in the NYS assembly banning mining but from what I know it has not been passed in the state senate yet nor has it been signed into law by the governor. I could be wrong but it seems Gov. Hochul has been very hush hush about this issue. Facing the election later this year and a primary within her own party, I sense she is wary of what this could do to her support. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jenn",
                    "index": "#48",
                    "likes": "3",
                    "time": "28/04/2022-13:42:01",
                    "content": "I’m abstaining for the time being but want to share my thoughts on the different perspectives surfacing in the comments. I think there is great value in hiring a high quality, experienced agency like GEG even if they don’t currently specialize in the “web3” vertical (yet). They can be beneficial in helping bring in the mainstream, i.e. an audience that doesn’t know too much about our space. Sometimes having domain experts, while the target audience is novice, creates a disconnect. So I would be open to bringing on a new team with no prior professional experience in our space, but it ultimately depends on the audience and goal of the content. If the idea is to create content to help open the aperture and make Maker seem/feel more accessible, perhaps an agency with some experience doing that in the realm of DeFi is worth exploring and then comparing/contrasting the outcomes to the expectations. That being said, imo, on-boarding a new Core unit like GEG that will be entirely dependent for the development phase on Growth and the proposed Brand team, seems like a kind of unintentionally “forced” relationship/responsibility on those existing Core units. It would be like the community on-boarding a new Core unit that is entirely dependent on PE but PE didn’t proactively seek that unit out for their current needs. I think the issue here isn’t the high quality potential GEG can bring, but simply the timing of where and how to leverage their talents. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.91751893939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#49",
                    "likes": "2",
                    "time": "28/04/2022-14:40:44",
                    "content": "Thank you for weighing in, @Jenn     Jenn:  while the target audience is novice   The target audience includes novice, crypto-native, and institutional (DeFi and TradFi).     Jenn:  I would be open to bringing on a new team with no prior professional experience in our space   While GEG is not crypto native. I am helping stand up this core unit and I am in crypto full time.     Jenn:  a new Core unit like GEG   GEG would incubate the new core unit as a stand-alone production company, the tenth company in Glass Entertainment Group. GEG offers the back-office, development, and post-production expertise PLUS a history of standing up new content production operations from scratch in new domains.     Jenn:  That being said, imo, on-boarding a new Core unit like GEG that will be entirely dependent for the development phase on Growth and the proposed Brand team, seems like a kind of unintentionally “forced”   This is not so. @g_dip and I will be teaching the ropes so that work is not foisted on Growth CU. I’m sorry if I haven’t communicated this clearly enough. I think now is the time to develop a network of high quality content so that it can go to production in the next six month alongside MakerDAO’s biggest growth initiatives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.478877005347593
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jenn",
                    "index": "#50",
                    "likes": "3",
                    "time": "28/04/2022-16:11:54",
                    "content": "Thanks for the responses Max. I was hired and taught most of what I know about crypto by @g_dip back some years ago, so I have full confidence in his aiding this process  That aside, what is the difference in being hired as our content agency via a Core unit (like Brand) in the near future vs on-boarding as a CU? If your team acquires the same budget from the DAO and delivers the same high quality content as a hired agency, why does being a Core unit matter so much? I ask the community members in favor of the creation of this CU, why they think this model is preferable to a hired agency model if we are supplying the same budget to them and getting the same results but without the extra overhead of another CU, MKR vest (perhaps in the future)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.539285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#51",
                    "likes": "3",
                    "time": "28/04/2022-16:45:20",
                    "content": "Saw I got tagged a couple of times… thank you for the compliments  I think you’re raising a bigger (and relevant) question, Jen. Where does the DAO draw the line on functions that should have a dedicated core unit? How does it achieve consensus around this? For example, why is CES not a hired agency of PE? Why is GovComm not a hired agency of GovAlpha? I’m not saying they should be, but it seems like there should be a consistent approach to this. Not only would a framework around this help to guide prospective contractors in the right direction, it could help us save costs by pushing some current and future CUs down to contractors of other CUs (which presumably have better negotiating skills than the mass of MKR holders). This would come at the notable expense of decentralization, which is why a clear and objective framework is needed IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.67506105006105
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#52",
                    "likes": "0",
                    "time": "28/04/2022-17:21:53",
                    "content": "    Jenn:  MKR vest (perhaps in the future)?   The short term goal is to be natively imbedded into MakerDAO as a true participant within and servant of the community. The long term goal is to earn MKR. I think GEG would only request MKR after having produced content for many months with demonstrated success. GEG is a low margin business (primarily serving a dying industry, cable television). If you look at the proposed budget, out of $125K of funding only 10% will be retained as the production fee, $12.5k. All of the rest of the funding shows up on screen. As a core unit, we would seek to be worthy of an MKR grant and for the vast majority of profit after expenses to be in that long term compensation which aligns the core unit’s interests with the MKR holders’. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.685897435897436
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#53",
                    "likes": "3",
                    "time": "29/04/2022-04:03:21",
                    "content": "Sir what are the odds you can outperform CMS Intern?   twitter.com    CMS intern @cmsintern  ELON BUYS TWITTER  initiate first crypto meme remix  Crypto Pump (vol. 2) https://t.co/ULAaSp2TGO         7:48 PM - 25 Apr 2022           1.8K                370            CMS is a LEGEND Eats, sleeps, dreams, talks, and drinks Crypto–all-day, everyday. Yet, he/she/they are just an “intern”   image1180×1390 160 KB   image1172×1118 137 KB    twitter.com    CMS intern @cmsintern  Bls sir every like boosts chances of getting a full time offer $BTC $TSLA https://t.co/yerXObhNPK         4:23 PM - 8 Feb 2021           2.8K                760            ",
                    "links": [
                        "https://twitter.com/cmsintern/status/1518678324352102401?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet",
                        "https://twitter.com/cmsintern/status/1518678324352102401?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet",
                        "https://t.co/ULAaSp2TGO",
                        "https://twitter.com/cmsintern/status/1518678324352102401?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet",
                        "https://twitter.com/cmsintern/status/1358813740737642500",
                        "https://twitter.com/cmsintern/status/1358813740737642500",
                        "https://twitter.com/cmsintern/status/1358813740737642500",
                        "https://t.co/yerXObhNPK",
                        "https://twitter.com/cmsintern/status/1358813740737642500"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#54",
                    "likes": "1",
                    "time": "29/04/2022-10:25:13",
                    "content": "These videos are something else. The ET one is the best. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#55",
                    "likes": "2",
                    "time": "29/04/2022-11:35:46",
                    "content": "Can you provide examples of the most typical metrics other customers of GEG uses to measure the value GEG provides? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.347222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#56",
                    "likes": "1",
                    "time": "29/04/2022-14:43:56",
                    "content": "Really good content haha. The FTX guy is very lucky  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#57",
                    "likes": "0",
                    "time": "19/05/2022-03:18:41",
                    "content": "@Fetterguy @GlassHalfFull how is Glass Entertainment measured? @sorenpeter I think the answer is that Glass Entertainment is measured by the television ratings. The better the ratings, the better job they are assessed to have done. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GlassHalfFull",
                    "index": "#58",
                    "likes": "0",
                    "time": "19/05/2022-12:38:08",
                    "content": "Our Snapchat show got 10 million views which is a different kind of rating and, for them, a huge success story, ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#59",
                    "likes": "0",
                    "time": "18/06/2022-22:39:02",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}