{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/call-to-arms-trading-pairs/7501",
            "title": "Call to arms - trading pairs ",
            "index": 7501,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "10",
                    "time": "15/04/2021-07:51:46",
                    "content": "As the foundation winds down we in the community need to take a more proactive role in creating critical elements of success. We all want tons of DAI in circulation and MKR to be highly valued but this is not going to happen by itself, the value is going to have to be built partially by being where the action is - trading pairs.  Why this now? Because I believe the old model with pairs of DAI/ETH or MKR/ETH on some centralized exchange is in fast decline. Reported volumes are already comparable, while in my experience real liquidity on Uniswap for MKR is way better than either Coinbase or Binance. Other defi tokens (UNI, Link, Aave++) are not that far behind and I am not sure I trust those Coinmarketcap volume figures anyway. On top of this we have cross-chain bridges in the form of wrapped BTC, renBTC and a whole host of other bridge startups, all trying to bring the value and wealth of other platforms into Ethereum defi.  Uniswap liquidity profit727×273 54.7 KB  And as if that Molotov cocktail was not spiked enough we have Ethereum L2 solutions coming in like a herd of wildebeests. L2 could lower transaction fees by a lot and further amp up crypto to further heights. Defi summer of 2020 could lead to the 2021 L2 event. In the background the printing presses at the central banks are working nightshifts to increase the money supply. Together the combined effects of the transition from centralized exchanges to defi, increased bridging and L2 solutions have the potential for tons of action. Out of this fray I want DAI and MKR to emerge as winners, but that is not going to happen by itself. From the above research it is immediately obvious that volume matters, concentration matters and the more liquidity the better. This is a call to arms I believe that if we are going to profit from this emerging situation we need as a minimum to have functional trading pairs where it matters. Right now this is not the case. The path BTC->ETH->DAI/MKR works on Binance but for Uniswap it is more BTC->WBTC-USDC->DAI->MKR. This is the defi equivalent of visiting an outhouse in Mongolia. We need to get our tokens closer to the action and the way we can do this is through effective trading pairs. Deus vult we spend a week or two discussing what pairs are important, what pairs can be won and then we all, whales and sardines, chip in to make it happen, preferably before Uniswap V3 launches and most certainly before L2 trading starts. Pledge your allegiance in the comments! ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-41-en-espanol/7614"
                    ],
                    "GPT-summary": "The author is proposing that the community takes a more proactive role in creating trading pairs to increase liquidity and volume for DAI and MKR. The author argues that the old model of centralized exchanges is in decline and that Uniswap and other DeFi tokens are becoming more popular. The author calls for a discussion on what trading pairs are important and how to make them happen. A 3rd party could give constructive criticism, extend to the proposal, or ask questions about it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.7406966490299824
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/04/2021-08:34:37",
                    "content": "Is this another case for a smart treasury? Stop Burning Tokens – Buyback and Make Instead — Placeholder I see lots of applications to this, including the Stability Buffer/burn discussion, depositing profits from initiatives like the Maker store, and helping create more direct/efficient markets. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "5",
                    "time": "15/04/2021-09:07:52",
                    "content": "The MakerDAO Open Market Committee is taking that in account by giving lower stability fees to DAI-related pairs and trying to bootstrap WBTC-DAI (with limited success yet, that’s why we are moving to 0% SF). We are still far to see some balance sheet manipulations to use our capital to provide liquidity. I think @alexis has one MIP to provide a DAI USDC LP as well. What matters is DAI but not sure what DAI liquidity is missing. The missing piece to me is a nice on/off ramp USD <-> DAI using USDC and the PSM to reduce slippage/fees. ",
                    "links": [
                        "https://forum.makerdao.com/t/balance-sheet-manipulation-how-to-yield-farm-safely-on-uniswap/5722"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.174107142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#4",
                    "likes": "3",
                    "time": "15/04/2021-09:52:34",
                    "content": "IMHO promoting DAI-LP-pairs is a mighty tool to get DAI into the position of the de-facto stablecoin for trades. Looking at the USDC-pairs it appears to me that it just about to win the battle with USDC against the ETH-pair and then Domino kicks in. This is also one of the reasons why I would like to see an even higher SF on UniV2USDCETH-A compared to UniV2DAIETH-A MKR-DAI-pair: I am pretty happy that we do not have MKR as collateral (though i know Compound and Aave follow another approach), so I would try to avoid that ",
                    "links": [
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2USDCETH-A",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2DAIETH-A"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/04/2021-11:21:19",
                    "content": "@ultraschuppi I am not trying to suggest we add any MKR to our collateral. This has to do with what token pairs we in the community would like to see succeed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/04/2021-13:33:27",
                    "content": "all DAI ones I believe  just guessing, but I think the main target should be to bring DAI into the mix as a real alternative to other USD-based stablecoins (USDC, USDT). so lets look at the pairs they are covering and promote similar DAI-pairs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.302083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "1",
                    "time": "15/04/2021-15:42:46",
                    "content": "    ultraschuppi:  IMHO promoting DAI-LP-pairs is a mighty tool to get DAI into the position of the de-facto stablecoin for trades. Looking at the USDC-pairs it appears to me that it just about to win the battle with USDC against the ETH-pair and then Domino kicks in. This is also one of the reasons why I would like to see an even higher SF on UniV2USDCETH-A compared to UniV2DAIETH-A   Honestly given the current situation regarding stablecoins and the DAI PEG I think a healthier attitude would be to be welcoming to all clients.   The point here is that just because someone has their capital in a particular pair is no reason to slight them for borrowing DAI.   SFs are a risk premium.  If you want to use it to drive users to preferentially select your service or product one does this with potential long term PR as well as business hazard. In general over the decades I have found an exclusive attitude to be a turn off and potentially to stifle business growth (or worse encourage competitors) where as an all business welcomed and equally served here to be better for long term success. Hence I would suggest a change in language regarding this to be more positive of DAI and less dismissive or punishing of alternatives from a PR and business perspective and try to restrain the temptation to punish alternative stablecoin users via SF. As to MKR-DAI pairs etc.    I have pointed out in the past the inherent contradictory nature of providing liquidity (to earn return) against locking liquidity in governance with respect to securing the system.   This is compounded with MKR being a deflationary coin.   It leads to significant concerns about market breadth and depth should a dilution event occur again.   Which shouldn’t be necessary if one adopts a DSR-L/B model to back the system surplus with effectively a longer term DSR deposit facility that earns a fixed rate over term to fill DAI system losses until the surplus can recapitalize.   This is a much cheaper, less risky, and probably significantly less expensive and generally better approach to managing capital needs when the system is stressed. I am both a DAI and USDC user for many reasons.  I have about a 50:50 mix on these in the protocol at this point but if Maker continues to punish people for no real reason other than a preference from a business interest.   I will over time seek to find more friendly alternatives and move away from Maker and DAI generally. I expect many people who are in the ETH vault that got a SF bump  (because it is felt that they can take it) while the wBTC SF drops to zero pretty much are feeling the same way here. Keep in mind there are people at the ends of these decisions.  I expect those people completely understand and appreciate changes to the system from a risk management perspective, but will look more and more unfavorably if this becomes a kind of coin phobia or system greed that increases rates for no legitimate systemic reasons. My point here is sure you can make changes that way, but it is rather bad form to diss on the competition to pump your product.  Make your product and service the best and there will be no need to act or speak in adversarial manner about any other product. ",
                    "links": [
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2USDCETH-A",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2DAIETH-A"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.851799242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#9",
                    "likes": "3",
                    "time": "15/04/2021-19:33:33",
                    "content": "    MakerMan:  My point here is sure you can make changes that way, but it is rather bad form to diss on the competition to pump your product. Make your product and service the best and there will be no need to act or speak in adversarial manner about any other product.   I am not at all for pushing usdc-pairs out of the game by having unreasonably high SFs. But I also don’t see a reason not to advertise/subsidize DAI pairs for our own growth interest. Especially given this high APYs right now. I also think we should rather have lower SFs (especially for Eth-A) to boost dai-growth. I hope this is achievable with liq2.0 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.673051948051948
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#10",
                    "likes": "0",
                    "time": "15/04/2021-23:40:24",
                    "content": "Some projects provide rewards to incentivize liquidity providers in certain pairs, but you haven’t suggested that. I’m not clear on what this call to arms meant to achieve in practice. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.410714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#11",
                    "likes": "0",
                    "time": "16/04/2021-04:50:19",
                    "content": "Hi @Spidomo, I am trying to establish community sentiment with regards to which trading pairs will be the most important once L2 trading launches. Is it possible for DAI to capture some of these by decisive first moves? Will any bridged BTC be of importance or is it ETH only ? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.15
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#12",
                    "likes": "3",
                    "time": "16/04/2021-06:16:36",
                    "content": "By the way, this is related enough that I can mention it here. L2 trading exists on Loopring and they have MKR-ETH, DAI-ETH and DAI-WBTC trading pairs. In a month or so, they expect to go out of beta and overhaul their DEX - from what I’ve seen so far, it looks like it will be quite a good user experience and substantially improve on what you can now see at exchange.loopring.io. Loopring’s current problem is liquidity. Low liquidity means low volumes and low volumes mean low profits for LPs and hence low liquidity. If this is worth doing, Maker can fund liquidity mining incentives on Loopring (over and above their own liquidity mining plans) and boost liquidity on any of the MKR-ETH, DAI-ETH and DAI-WBTC trading pairs. In particular, it would be great to see DAI become the defacto stablecoin on Loopring over Tether and USDC. I am involved in the Loopring community as well and can help bring the two projects together, if there is funding available for this initiative. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.810049019607844
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#13",
                    "likes": "6",
                    "time": "16/04/2021-13:01:08",
                    "content": "This is DAI on Polygon (Aave market), and it does nothing but grows since the last weeks.  image1146×62 5.77 KB  Just imagine opening Vaults on Polygon so people mint more and more DAI and use it on Aave or any of the new DeFi tools on Polygon, like liquidity mining with DAI-ETH, DAI-MATIC or amDAI-MATIC, we are (since a very long time) missing lot of opportunities waiting for … (i don’t know what). L2’s are rising and very attractive markets, and till ETH 2.0 doesn’t arrives this will keep growing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.336688311688312
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#14",
                    "likes": "1",
                    "time": "16/04/2021-13:59:20",
                    "content": "So, I think Vaults on Polygon(Formerly known as Matic) might and mos def will not be as safe as Ethereum Layer Uno. A good breakdown(s) of such has been posted by @bartek  twitter.com    Bartek Kiepuszewski (bkiepuszewski)  0/ Here's what you should ask yourself (or the community) before putting millions of $$$ into an Ethereum Rollup: 👇  4:34 PM - 14 Apr 2021     61          13            ",
                    "links": [
                        "https://twitter.com/bkiepuszewski/status/1382371606736027649",
                        "https://twitter.com/bkiepuszewski/status/1382371606736027649"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#15",
                    "likes": "3",
                    "time": "16/04/2021-14:06:06",
                    "content": "Yeah i saw it, but with that in mind, non L2 is as safe as L1, same happens with BSC and xDai right? Maybe just Optimism (but it never comes to mainnet T_T) Another idea is maybe Maker coming to whatever L2 and minting their xyzDAI? Can also solve that trust problem … ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.309523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bartek",
                    "index": "#16",
                    "likes": "7",
                    "time": "16/04/2021-15:43:11",
                    "content": "L2 is an overused term these days - I normally use it as a Layer2 “built” on top of “Layer1” for scalability and/or privacy (or both), but assets on L2 should tap into the security of L1. Hence L2 is primarily Rollups today, formerly it was also Plasma, Channels, etc… all mostly considered these days to be dead end designs due to their limitations. Having said that, a lot of people, including Ethereum Foundation here Layer 2 scaling | ethereum.org use Layer 2 as a “collective term for solutions designed to help scale your app”, and that would include side chains. This is wrong IMO, as tokens bridged to side chains (say xDAI, BSC, SKALE, Polygon) do not differ much from tokens bridged to other L1 chains (like Avalanche, Solana, etc…). They are all “wrapped” tokens and their security is a lesser of the security of the wrapped token implementation, security of the bridge and the side chain itself. If you compare it to “true” Rollup L2, the security of L2-DAI (say on Optimism or Starkware zkRollup) is pretty much the same as L1 DAI. Long-term there is no doubt in my mind which solution would I personally choose (or advise big fund mgr to choose) to securely store and trade their DAI. That’s not to say that there is no value from trading, say maticDAI on maticSUSHI or borrowing/depositing maticDAI on maticAAVE, but this is not that much different that trading on any incentivised centralised (i.e. not decentralised) exchange. Yet another consideration is to tap into the value locked in the native L1 assets (AVAX, FTM, SOL, hey, even DOGE, why not). These could either be brought into Ethereum (like BTC-WBTC) or we could imagine having Maker on these L1s minting DAI directly on, say, Avalanche/Fantom chains. But that’s the topic for another discussion I guess ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4605263157894735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#17",
                    "likes": "2",
                    "time": "16/04/2021-16:27:01",
                    "content": "    bartek:  Having said that, a lot of people, including Ethereum Foundation here Layer 2 scaling | ethereum.org use Layer 2 as a “collective term for solutions designed to help scale your app”, and that would include side chains. This is wrong IMO, as tokens bridged to side chains (say xDAI, BSC, SKALE, Polygon) do not differ much from tokens bridged to other L1 chains (like Avalanche, Solana, etc…). They are all “wrapped” tokens and their security is a lesser of the security of the wrapped token implementation, security of the bridge and the side chain itself.   This  right here–they had me thinking that Matic and xDAI was a Layer 2 App. And soon we can add to the list Compound Chain. Nothing against all of these platforms–but is it fair to say that these “sidechains” should only be used for pocket change? In other words, you don’t want to carry $100,000 in a sidechain, maybe $1,000 for a dinner date?  $70 for lunch, etc. But hey–nothing wrong w/centralization until it kicks you were it hurts  And I keep wondering if that $331M locked in these sidechains will need to come back to Ethereum Layer 1…  All in all I look forward to using Zk Money and Optimism in the near future ",
                    "links": [
                        "https://www.l2beat.com/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0148809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bartek",
                    "index": "#18",
                    "likes": "2",
                    "time": "16/04/2021-16:42:55",
                    "content": "I see sidechains as a temporary relief until Rollups and ETH2 are ready. So in that sense they are super useful but long term it is hard to see their future unless they will re-implement themselves as Rollups. See https://twitter.com/bkiepuszewski/status/1380404149888675840?s=20 for a critical example of Matic - one address could have rug-pulled all Matic DAI. And if you think this is an absurd thought, that is exactly what Meerkat hack was - upgrade to the contract followed by a rug pull: Rekt - Meerkat Finance - BSC - REKT ",
                    "links": [
                        "https://rekt.news/meerkat-finance-bsc-rekt/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1342592592592595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#19",
                    "likes": "0",
                    "time": "16/04/2021-18:04:00",
                    "content": " This is mind boggling  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "0",
                    "time": "16/04/2021-19:04:43",
                    "content": "@bartek BTW have you seen this 36-hour debate on CT about ShapeShift and their new “decentralized” bridge for BTC to ETH?   twitter.com    John Adler (jadler0)  > This is non-custodial > A trade sends ETH into a pool controlled by threshold signature array.  > And the BTC is sent to you from another pool.  Those pools sound pretty fucking custodial to me. Custodied by the \"threshold signature array.\" twitter.com/ErikVoorhees/s… Erik Voorhees @ErikVoorhees@MrPlanN @Mindfulmanchild @ShapeShift_io @THORChain It's not wrapped, I promise. But you don't need to trust me...   Open ShapeShift app, deposit LTC, BTC, or ETH. This is non-custodial, only u control keys.  A trade sends ETH into a pool controlled by threshold signature array.   And the BTC is sent to you from another pool.    10:21 PM - 15 Apr 2021     46          3            ",
                    "links": [
                        "https://twitter.com/jadler0/status/1382821452412547072",
                        "https://twitter.com/ErikVoorhees/status/1382479603348873219",
                        "https://twitter.com/ErikVoorhees/status/1382479603348873219",
                        "https://twitter.com/jadler0/status/1382821452412547072"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.15530303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#21",
                    "likes": "1",
                    "time": "16/04/2021-19:38:16",
                    "content": "    bartek:  I see sidechains as a temporary relief until Rollups and ETH2 are ready. So in that sense they are super useful but long term it is hard to see their future unless they will re-implement themselves as Rollups.   Agree with whole discussion here regarding terminology.  FYI:  Already discussion and preliminary work to fold xDAI into a Rollup. Biggest issue here with the sidechains and interoperability is starting to show up.  4 versions of DAI and having to have bridged liquidity and overall liquidity fragmentation. I have a real issue with putting MKR on any of these to provide liquidity with respect to degrading L1 Maker security (taking MKR out of L1).   I really think the focus should be on L2’s as properly described by @bartek… (thank you for posting that as I was already starting to come to this in my head - but your post cleared the terminology in my thinking nicely). I think a real discussion of incentivizing MKR liquidity for system backstop liquidity against L1 MKR for security purposes is in order here as I can easily see MKR making its way into bridges which may open up unexpected attack vectors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.673611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#22",
                    "likes": "1",
                    "time": "16/04/2021-20:52:26",
                    "content": "I believe it’s a 2/3 multisig so not really secure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#23",
                    "likes": "0",
                    "time": "17/07/2021-02:52:31",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}