{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/leveraging-social-media-charity-drive-to-raise-profile-of-dai/7435",
            "title": "Leveraging Social Media + Charity Drive To Raise Profile of DAI ",
            "index": 7435,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "charity",
                "social-media"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "4",
                    "time": "10/04/2021-17:18:04",
                    "content": "As has been discussed, I have several significant US-UK-Canada populated groups on FB. I was thinking about how to possibly utilize them in a way that would be helpful to Maker, and I would be interested in trying to push some kind of “donate DAI to charity” setup. I know a few charities already accept DAI (like Save The Children). Because the IRS rules crypto as property, this means it would be a tax deductible donation for Americans, just like with dollars. I’m still thinking through the details, but figure there could be two objectives: one is make DAI something more people in N Am and UK have heard of. The other is demonstrating a charitable, tax-deductible use case for DAI that doesn’t require bullish holders of crypto assets to sell. Thoughts? Do we have any materials for this? What CU would I want to organize this with? Do we already have any charitable partners who emphasize DAI? Thanks! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.295454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "1",
                    "time": "16/09/2021-19:54:42",
                    "content": "From UNICEF to Red Cross Argentina, all the major Dai donation initiative have been led by Maker’s business team so Growth Core Unit might be a natural fit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/09/2021-02:18:50",
                    "content": "Let them use DAI directly as @Doo_StableLab  says so far it is Unicef from Argentina. It could be massive, yes. If there was an organization that receives BitPay technically we are there, as well as coinbase. I think I know of one, as soon as I find it I’ll leave the link. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "0",
                    "time": "18/09/2021-13:05:02",
                    "content": "Maybe Mariano can help with this, it is not at all far-fetched. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}