{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-mkr-holder-confessional/15164",
            "title": "The MKR holder Confessional ",
            "index": 15164,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "mkr-forum"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#1",
                    "likes": "14",
                    "time": "13/05/2022-07:57:48",
                    "content": "This thread is titled The MKR holder Confessional. It is intended to be a forum space to go in parallel with the voter committee meetings run by Rune on Tuesday (5pm Paris subject to change) and Thuesday’s (5pm Paris subject to change). See link This thread can be used to write down some thoughts and ideas so that they can processed/read/considered by those not attending the meetings (verba volant, scripta manent). More infos on these meetings will appear elsewhere but, generally speaking, show up in Discord at the right time and you’ll get the link to the call. Every MKR holder is welcome to participate in this thread and/or the meetings. This includes: MKR whales, MKR shrimps, CU-members, random reddit users (with MKR), etc. ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-12-18-2022/15280",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-6/15313"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.359347442680776
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "23",
                    "time": "13/05/2022-08:04:30",
                    "content": "Rune organised DAO Singularity meetings in the last month of two, trying to “fix” some problems that he considers serious for the long term success of MakerDAO. Very reasonably, several CU members, in several places, have asked: QUESTION posed by CUs: but what is/are exactly the problem(s)? This post is an attempt to describe what I personally, as a MKR holder and community member since 2018, feel is one problem with the current way CUs are run.   Premise: before starting, in short, I seriously appreciate the work of all CUs so far. It has been great, considering where we were 1 year ago. It’s not my dream to see anybody fired, to the contrary I think we need to grow. And growth means more human talent, more rewards to successful teams, etc. This said, I don’t want to sound unnecessarily apologetic. I have been an active member of the community for 4 years. I have one of the top “cred score” (for what is worth) in the community. So, hopefully, I can express (politely and constructively) some concerns without being labeled as a troll, or as somebody complainning because “numbers don’t go up”.  Disclaimer I am out of the back-door politics of MakerDAO (and I don’t want to enter). I almost exclusively interact via the forum or the public chat. I am from time to time chatting with: @juan @rune @reuptaken @MakerMan @PaperImperium @flipflopflapdelegate @dawson @aburban90. These people know how limited our private discussions are. I say this to let people understand how my perception/vision of MakerDAO is formed, as opposed to that of somebody more “inside things”.  The problem The problem I am going to describe, of course, is perceived in the context of a general market downturn. However I honestly feel it way more strongly now than, e.g., ~1year ago (MKR hit 1900usd in June 2021), when things were evolving rapidly from Foundation to CUs system. So, what I am describing below, has nothing to do with MKR price.  Symptoms 1 ) In the last few months we witnessed a big growth of CUs and their budgets. The CU ecosystem now counts more than 100 people.  → CU growth was fast! 2 ) MKR voter apathy has never been fixed. In yesterday’s G&R meeting [12 May 2022] it was reported that 75% of the voting MKR belong to Rune and 15% to A16z. Two entities have 90% of the active voting power.  → MKR voters growth was none. 3 ) In the G&R calls we mostly see people from CU. This has to be expected, since these meetings are technical and very time consuming. However the same happens in the forum (again, expected) and to a large extend also in the chat.  → It feels+ like the community is made more of CUs than regular MKR holders. ( +) I do not have numbers, hence why the ‘feel’. Still, a feeling is a feeling. 4 ) As we know, MKR burning has been stopped. The money is going to the SB. At the same time CUs budget have been growing.  → Money is flowing to CUs but not to MKR holders in the short term. 5 ) Some Delegates (most notably @paperimperium) have explictly said that they have no incentives to challenge CU budget proposals (or other ‘deals’) because they do not want to make enemies.  → Growing sentiment of back-door politics running the show. Back-door meaning run by CUs and innaccessible by MKR holders. 6 ) Some recent proposals give the feeling that the some CU people want to cut down on the governance bureaucracy. Examples (that I can recall) include: -) Asking at the last minute to approve 50k for the party in Amsterdam, saying that otherwise it would be funded anyway somehow using CUs budgets. -) Recent “task force” proposal, basically asking for “freedom to use money” to maximise efficiency.  → Tendency to cut bureacracy means cutting the only way MKR holders have to look at what’s going on. (although it’s clearly more efficient) 7 ) Sometimes when people come and point at problems and/or ideas, a common reaction is: “yeah, if you want to contribute join us at this meeting etc”.  → There is a clear tendency to embark talent to the CUs structure. At the same time, I feel that’s the only way people can interact with the DAO at the moment. Worse, I think CUs often think “if you really care about Maker, come and contribute”. But not everybody wants to join a CU. As in ordinary investing, MKR holders want their money to work for them. They didn’t buy MKR to get a 2nd job.  Analysis of the Symptoms The above 7 symptoms point at a problem that it easy to state: The vast majority of MKR holders feels disenfranchised from MakerDAO. Their bag of MKR does not bring any of:  ) Money: burning is off, and MKR price has declined steadly since the inception of the CU model. (lost about 75% vs ETH in one year) ) Excitement: the MKR holders do not group up as a ‘proud tribe’. The MakerDao Reddit is most often than not just full of criticisms and negativity. Go to other reddits (even of tokens who have dropped in price a lot like MONERO). There a lot of people are proud to challenge the system and be their own private bank, etc. ) Sense of Empowermment: MKR holders do not feel in control. They have no incentives to vote. Actually they need to pay GAS to vote. And their vote (like with 4 MKR) is felt as irrelevant. And if they visit the Forum, the complexity is such that it’s virtually impossible for anybody to join without spending 3 months studying previous posts.  at the same time, most of CUs seem to think that the above are just “lacking vision” or, worse “cryptoboys trying to get rich quick”, because:  ) Money: on a personal level, CU people get objectively good salaries which makes them satisfied on this front. At the MKR level, they think strategically and long term (rightfully so, I would add). ) Excitement: most CUs people (all?) are very excited about their job, and to it with evident enthusiasm! ) Sense of Empowermment: CU people have/feel a lot of power in the DAO probably unlikely what they would have in a company. They can act directly on many things, and the number (~100) allows for a storng sense of community bewtween CU members.  Again, there is a complete opposition of view/feelings/sentiment between MKR holders and CUs.  Problem description The problem is therefore a total lack of unity between CUs and MKR holders, even if CUs themselves are often MKR holders. This problem has to be:  clearly identified, recognised as possibly the most important problem MakerDAO currently has addressed and fixed ASAP.   How to Fix the Problem. Yeah of course that’s the 1million DAIs question. My uneducated (this is not anymore amateur time) guess is that we need to bring masses of (or all?!) MKR holders to the governance contract via incentives. But the most important thing is, I believe and repeat:  clearly identify, recognise, start addressing   Once again, all my appreciation for the work done by the CUs in the last 12 months. As I mentioned at the top, some of CU members are my (virtual) friends and I regularly express these concerns to them without any negativity or anything. I have took my time to write this post in the hope it can help point out explicitly at a problem (see point (1) just above). Please keep up the great work you have been doing, while also trying to develop some of the improvements that might be suggested from the environment! Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.730217581382836
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#3",
                    "likes": "3",
                    "time": "13/05/2022-08:58:11",
                    "content": "A lot of what’s said here resonates w/ me.     iammeeoh:  MKR voter apathy has never been fixed.   I really wish we could find a way to contact larger holders and see where there can be alignment/engagement.     iammeeoh:  Money is flowing to CUs but not to MKR holders in the short term.   The result of this was seen since January. Though, I have a feeling we have already shed many of those that were not content with the narrative shift. I’d like to believe the holders that remain are here to stay now.     iammeeoh:  In the G&R calls we mostly see people from CU. This has to be expected, since these meetings are technical and very time consuming.   Yes, the gov calls are definitely very technical and specific to what’s actively going on. When I bring in new people, it’s a bit overwhelming. Especially for new people. I do wish we could bring back the community call? Though, we need something for MKR holder alignment. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.59982174688057
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#4",
                    "likes": "5",
                    "time": "13/05/2022-09:11:18",
                    "content": "    iammeeoh:  2 ) MKR voter apathy has never been fixed. In yesterday’s G&R meeting [12 May 2022] it was reported that 75% of the voting MKR belong to Rune and 15% to A16z. Two entities have 90% of the active voting power.    image1920×1005 54 KB  To try and inform the discussion, less than 18-20% of all outstanding maker is delegated/engaged, source. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#5",
                    "likes": "29",
                    "time": "13/05/2022-10:42:58",
                    "content": "Why I sold my MKR After thinking long and hard I sold my stack of MKR several months ago. This post came as a good opportunity to explain why. The initial design As most of you know MakerDAO is one of the very first DAOs, with a initial design dating back to the start of Ethereum. Having such ancient DNA does however come with a cost - all the functions that since DeFi summer started can be found in other protocols had to be designed into Maker from the start. This naturally led to a very broad scope of work. Trying too much At its core Maker was designed to have several core functions.  It is a crypto central bank, tasked with currency peg and interest rates. It is a crypto investment bank, analysing and acting on the risk concerning a range of other crypto assets. It is a defi lego brick, used on other platforms and combined with other protocols. It is a pioneer in bringing real world assets into crypto.  These are just the core pieces. You could easily add in the oracles, multichain bridging efforts and the auctions as separate or parallel activities. Not to mention saving the world from climate change. Now let us try to calculate the realism of governing above construction. Out in the real world the core activities that make up Maker are even whole separate industries. Central bankers are highly valued bureaucrats with skill sets, insights and experiences that are very different from even traditional investment banking, let alone those of degenerative financing. Having the mental framework for the legal situation and the multinational experience necessary for real world finance is again something very different. Not to mention the coding skills and the mathematical dexterity needed for defi lego building. All of these skill sets needs to be coordinated by governance that does more than just guessing. In the beginning of the life of a protocol this will not matter much as the choices are fairly self evident, but as time progresses both the number of choices that can be made goes up, and most notably the complexity of each issue at hand. As complexity grows, people simply start loosing the ability to understand what the people on the other side of the table are talking about. For an organization like Maker, that from the outset is designed with multiple moving parts this has a real and growing impact on governance. There is an increasing number of decisions, and each single decision is increasing in complexity. Accordingly it takes more and more time and effort to reach anything close to informed decisions and at least reasonable consensus. In the end people just give up and leave the running of the organization to whoever bothers to vote. The voting itself matters less and less as decisions are increasingly made offchain. What to do about it I don’t think this can be fixed. My personal opinion is that MakerDAO needs to be split up into so many parts that each part has one function, and one function only. Then each part has to make bilateral agreements with the other parts to survive and thrive in crypto. If the split of Maker results in four, six or ten separate DAOs is not really relevant, what is needed is the understanding that Maker cannot remain as unfocused as it is and remain crypto relevant. Needless to say the MKR token needs to be killed off and replaced with whatever runs the generation two organizations. Personally I decided it was easier to sell my stack and move on in crypto - I still love stablecoins. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4434208152958155
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#6",
                    "likes": "1",
                    "time": "14/05/2022-14:23:40",
                    "content": "Avast, @Planet_X! This here ship been lower in the water than a brick in the bathtub since you left. How much MKR ye need to be a delegate again? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#7",
                    "likes": "13",
                    "time": "14/05/2022-14:50:54",
                    "content": "Thanks for this @iammeeoh. It is a great, civilised, way to discuss very important topics. My personal vision is that either:   Maker = Pegged RAI → Maker becomes an ETH + USDC pegged stable, with very thin buffer, little profitability, and high cyclicality, pretty much like RAI - for this we don’t need 90% of the CU  Maker as Ultimate Lender of DeFi → Maker becomes an innovative ultimate protocol-to-protocol lender via native ETH, few selected structured exposures (e.g. stETH), and the D3M model with more buffer, more profitability, less cyclicality, but the need for decentralisation and high professionalisation  You can’t have both. My 2 cents, in writing for the forum:   Stasis from core units? Maybe, but let’s look holistically at all the urgency that the community has had over the past year to chase passing cars, where would we have been if the core units would not have had a saying in predicating prudence? On this specific topic, I want to refer specifically to the RWA program - when I started to get involved I started preaching prudence, institutionalisation, and conservatism toward quality. I was insulted, several times, by community members. Now ask yourself, where would we have been with a couple of B of committed or already deployed DAI into opaque off-chain, illiquid structures? My guess? The next target for a short  Decentralisation: decentralisation is the enemy of efficiency, core units are definitely not efficient, but I believe that thanks to their mandate (and financial interest) they have enough standing to counteract the opinions of some large holders, in a constructive process that avoids being reckless or changing direction too often  Profitability: I agree that we should be conservative in spending, but we are a breakeven / profitable large start up, and probably for the first time in history (won’t comment on Amazon)  Positioning: Maker is in the best possible positioning ever after UST fallout, with tons of investors ready to support the project, and a proven system of conservatism and decentralisation that has worked very well against Do’s vision of the world (look inside yourself and be honest on what you thought of Do’s vision vs Maker when UST was pumping and pumping)  Efficiency: I agree with everyone that CU spending should be carefully monitored, and I am looking at Strategic Finance to do this work - I am speaking against myself given that I have a MIP40 out for Lending Oversight - yet, as it’s the case of Lending Oversight, the community should ask themselves how much pain has been avoided by onboarding professional and experienced individuals that have enough history and experience to say NO! to the quick buck  Security: I am 100% convinced we need to raise funds to boost our surplus buffer, and that we are running reckless risks even in the current situation - without fancy RWAs, look at stETH - and I am sure we can do it in a non-dilutive and virtuous way for Maker through debt solutions  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.854492630385487
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#8",
                    "likes": "6",
                    "time": "16/05/2022-15:31:36",
                    "content": "Two quick questions/comments for my fellow MKR holders: (1) How can we ensure that CUs stick to their roles as facilitators and not impede the right of MKR voters to vote on MIP applications (be they at the greenlight, governance or executive stage)? My concern here is captured by the proposed LOVE CU, which aims to impose “additional checks and balances,” an “extra line of [sic] defence” and a “layer of oversight” to “oversee[] … all [CU] actors involved in onboarding” by the issuance of their “oversight certificate.” Their MIP also appears to give the proposed CU the ability to check/impede the onboarding of any collateral, including but not limited to RWA-related assets. It’s fairly easy to see how the LOVE CU may block any collateral type or project that falls afoul of its “standards.” That’s a detriment to the exercise of our MKR voting rights if successful and, frankly, could position them as the oversight council for all CUs. This structure merely mimics a traditional corporate hierarchy and is not the flat organization of independent teams providing services to a software protocol that has been the focus of this project for years. All in all, I want to have my vote as an MKR holder, and be free to accept or discard the advisory opinions (provided within a reasonable time frame) of the CUs as I wish. (2) How can we better build Chinese walls between the CUs and the delegates? My concern is that unfettered association among these groups is rife for “one hand washing the other,” where CUs not only lobby delegates for support of the “blessed” collateral types but also harangue and threaten delegates about things CUs oppose. (I view the latter as being in bad faith, especially if concealed from the community). At the same time, so long as votes go the “right” way, both sides support each other’s budget requests and thus keep the money spigot flowing. Tampering the potential for this conduct strikes me as an imperative for the DAO’s growth, if not survival. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.348001700680271
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#9",
                    "likes": "7",
                    "time": "16/05/2022-15:55:03",
                    "content": "Dear @Bri174, I will briefly comment on (1) because your suggestion that LOVE-001 might act as a blocker or gatekeeper is against the ethos and wording of MIP39. I will try to clarify again my statement:  No need of any endorsement from LOVE-001 (or any other CU) exists nor in the MIP39 nor in MIP67 As MIP39 confirms several times, it is fully in the powers of MKR holders to disregard any colour provided by LOVE-001; the intention of LOVE-001, among others, (and RWF-001 in the case of RWAs) is to provide token holders with the best possible info package to act; the current voting for MIP68 Lusitano is an example - incubating LOVE-001 has provided a set of risk assessments (here) and although token holders might have used it for their own decision making this didn’t seem to have acted as gatekeeping → on the contrary, MIP68 has been significantly improved (both on risk and economics) by Monetalis following the conversations with LOVE and RWF  At the same time, I would like to stress again and again how, in my personal opinion, raising the bar of quality standards should only be welcomed in the dialogue within the community. The interest of borrowers is not aligned to that of the protocol, since borrowers and lenders act on opposite sides of a zero sum game that should be carefully patrolled. I believe that this set of checks and balances has already provided positive results for Maker, and the call for prudence has positioned us in a very solid way to overcome the fallout of UST’s debacle. It is my opinion, again, that history would have been different otherwise. I won’t comment on (2) as it doesn’t refer directly to LOVE-001 request for ratification. Thank you for your opinion and comments. As token holder, it is what matters the most. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip68-monetalis-lusitano-uk-green-economy-sme-wholesale-lending/13789/38"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.637445887445888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#10",
                    "likes": "1",
                    "time": "16/05/2022-16:14:50",
                    "content": "It is not a good idea to give one CU the ability to “oversee” the work product of all other CUs. The potential for abuse is rife. Granted, although you may not be able to expressly block a vote, that positioning gives you as the LOVE CU’s facilitator an immense amount of power and influence that MKR holders – the only true sovereigns here – should not enable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.546875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#11",
                    "likes": "1",
                    "time": "16/05/2022-16:32:17",
                    "content": "Thank you, I respectfully disagree. And I don’t think sovereignty of MKR holders has been diminished in any way. Thanks for sharing your opinion, Luca ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#12",
                    "likes": "1",
                    "time": "16/05/2022-16:36:17",
                    "content": "You’re welcome. And while MKR sovereignty may not have been diminished (severely) yet, it will be if this CU is voted through. And I will vote against it with every MKR I hold. Have a nice day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#13",
                    "likes": "3",
                    "time": "16/05/2022-17:39:44",
                    "content": "I kind of feel flattered, in a weird way, that some recognise in me as potential facilitator such influence. It is also interesting to see that it is not the token holders, but the potential borrowers - although the two categories sometime overlap, that are so acutely against raising the standards of scrutiny with cross-CU initiatives. Again, recent history has proven that decentralised and openly adversarial conversations are good for resilience. I can confirm once again my commitment, as it has been my modus operandi since the beginning of the incubation program of LOVE-001, to an open, transparent, collaboration with every stakeholder. Again, thanks for your comments. Luca ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#14",
                    "likes": "3",
                    "time": "16/05/2022-23:33:29",
                    "content": "    Bri174:  All in all, I want to have my vote as an MKR holder, and be free to accept or discard the advisory opinions (provided within a reasonable time frame) of the CUs as I wish.   Absolutely. From the incubating Legal and Transactional Services core unit perspective:   Full discussion and constructive debate of MIP6 and self-contained MIP applications, risk assessments, and potentially unresolved commercial, legal and technical terms (if any) in the Forum is the best method to ensure transparency and create a positive result.   I review my role as providing the Maker token holders with an honest, carefully considered, and professional opinion. At times, this honest, carefully considered, and professional opinion may or may not be acceptable to applicants or Maker token holders. That is fine, but it does not diminish my initial responsibility to the Maker token holders.   The incubating LTS remains a servant of the Maker token holders. Once the Maker token holders have greenlit a transaction, my responsibility is to implement that vote and, when necessary fully disclose to the Maker token holders any issues that arise in that implementation. I think that is what you would expect. And like any real world transaction, there are often points not identified in a MIP6 or a self-contained MIP that may require Maker token holder resolution or guidance from the core unit.       Bri174:  How can we better build Chinese walls between the CUs and the delegates? My concern is that unfettered association among these groups is rife for “one hand washing the other,” where CUs not only lobby delegates for support of the “blessed” collateral types but also harangue and threaten delegates about things CUs oppose. (I view the latter as being in bad faith, especially if concealed from the community).   I am slightly perplexed by the “Chinese wall” comment. While I understand the general stated concern, this comment may be appropriate for the entire system. Token holder to token holder, MIP6 or MIPxx applicant to token holder, MIP6 applicant that is a token holder to core unit, etc. To my points above, let’s have that debate in the Forum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.767491087344029
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#15",
                    "likes": "9",
                    "time": "17/05/2022-14:43:12",
                    "content": "Thanks for starting this initiative @iammeeoh. I’m not sure if you’ve ever held an official role at the DAO or with the Foundation, but you’ve driven a lot of the conversation in the past weeks in a very productive manner. A strong example of how an MKR holder, large or small, can make an impact. Out of sheer luck with my calendar I’ve managed to make almost all of the DAO Singularity meetings Rune has been hosting the past few weeks and so I wanted to share my two-cents. I’m currently an MKR shrimp, long-time follower of the project, and see the incredible opportunity for impact that Maker has from a professional standpoint. As much as this conversation is an expression of MKR holders, I believe the larger discussion is around the balance between direction and execution in the DAO. Luca captures the larger trend underlying this, here:     luca_pro:    Maker = Pegged RAI → Maker becomes an ETH + USDC pegged stable, with very thin buffer, little profitability, and high cyclicality, pretty much like RAI - for this we don’t need 90% of the CU  Maker as Ultimate Lender of DeFi → Maker becomes an innovative ultimate protocol-to-protocol lender via native ETH, few selected structured exposures (e.g. stETH), and the D3M model with more buffer, more profitability, less cyclicality, but the need for decentralisation and high professionalisation    I would refine the framing slightly, in that the conflict about the DAO’s purpose is in whether to be just a decentralized stablecoin protocol or to be a decentralized organization that leverages a stablecoin protocol. To some extent, this conversation has been ongoing around Maker since inception. While I’ve only been involved with Maker on a personal level in the past year, my perception is that this dichotomy was at the core of activity such as the creation of the foundation, the Purple Pill saga, and more recently the actual formation of the DAO and it’s first year of life. To me it’s quite clear that the answer has trended to the former rather than the latter (meaning, very intentionally, not RAI). The way the community has invested it’s time and money has built towards a future of a decentralized organization that leverages DAI to it’s fullest extent, which includes lending for RWA, lending via D3M, integration of DAI into society, and the integration of DAI into the larger cryptoecosystem, etc. etc. The conversation occurring now is about what exactly our vision is on a more granular level and how exactly do we achieve it on a granular process level. Given how much discussion has occurred by community members of the past, we have tools and concepts today that allow us to address this, but even the purpose and meaning of these is up for debate. The discontent is expressed as a challenge between MKR holders and Core Units, but most Core Units are MKR holders themselves and passionate members of the community. I think Meeoh is still correct in his analysis, and that it comes down to Money, Excitement, and Empowerment, but the conversation is truly an extension of the on-going historical discourse around vision and execution. Knowing what Rune has proposed, and piggy backing off of the analysis by @iammeeoh, the core of the conversation occurs around three areas:   Empowering MKR Holders: The MKR holders are the key enabling construct that allows the DAO to be operationally decentralized but logically organized (to borrow some phrasing from Vitalik). Using Meeoh’s words, MKR holders, that are not professionally invovled in the DAO, are not incentivized, excited, or empowered. This is to the detriment of everyone, including decentralization, and the voter committees are a proposed first-step for fixing that. Tokenomics, voting processes, and more within the Singularity are further steps.   Aligning the Vision of Maker: To state it again, previous decisions set this community down a certain path for better or for worse. The DAO will continue to act and operate in ways to leverage the power of the Maker protocol, but there needs to be a reiteration of the vision and purpose of the DAO and the protocol itself to help align the memebrs today on that path. I don’t believe voter committees alone are sufficient for this, but the work of SES and the continued discussion in the forum and discord have been key elements. The Singularity plan proposes a vision that incorporates strategic and tactical elements, such as Clean Money and staked MKR, but the cultural vision needs to be continually fleshed out by the community participants here in an on-going manner.   Empowering the Professionals: As much as the MKR holders play the primary strategic role; the CU members, the delegates, and those who commit to serious participation within the DAO are just as important. The professionalization of the crytpoecosystem is happening everywhere and Maker has been leading that charge before anyone, and it’s been a great benefit to the protocol. We should continue to emphasize this and cultivate a community culture and practical solutions that allow individuals and teams to continue contributing in an impactful way. Decentralization will always provide a balance and a natural rate-limiter, but I believe much of the friction today can still be solved with meaningful discussion and practical proposals as opposed to being endemic. MetaDAOs, governance processes, and other ideas within the Singularity plan speak to this.   I’ll also add that there’s a lot to be positive about. Much of this seems to be natural issues that arise from the novel operation of a novel technical architecture in a societal context ripe for disruption. I’d like to end by sharing what I’ve learned by observing these conversations recently. The biggest strength of the Maker protocol is it’s ability to capture intangible qualities and leverage them to the benefit of the protocols end-users. This happens primarily through the forum, the discord, and the bilateral conversations between community members - but the DAO itself represents a more formal mechanism of this idea. This is shown in the continued high-quality nature of technical solutions, the deep and insightful business and strategic discussions, and the incredible foresight into governance and community issues that the DAO is leading. Looking at the post by @Planet_X provides great insight and captures these issues well from the perspective of someone who has moved on. For those who stay, I think this thread, the voter committees, and the continued discussion around the future of Maker will serve us well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.606883317299984
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#16",
                    "likes": "11",
                    "time": "17/05/2022-15:31:13",
                    "content": "@iammeeoh Thank you for this post.  I think you have described my thoughts very well. I find myself often conflicted in my feelings toward this project.  I love the concept, the vision, even the direction most of the time. But I am extremely frustrated by the CU expansion.  I don’t mind reinvesting profits but I find the way that it is done not to be efficient and not obviously beneficial to the protocol.  I don’t believe paying more people equates to more growth.  Yes, teams like PE and CES are necessary to evolve the protocol but what I want to see are people who are passionate about promoting this project without any kind of incentive.  If you look at the Bitcoin maximalists, they love Bitcoin purely because they believe in it.  You have an organic army of promoters/contributors at no cost to the protocol.  Here?  We have to pay people 100k+ to promote mkr.  How far does that go?  A 6 person marketing team who works for a salary and is unhappy if they don’t get a raise every year?  We are on a path where expenses rise faster than revenue and there’s no end in sight to the promise of realized growth.  Some delegates are okay with us not being profitable. To me, the biggest problem is that there is no promise of value for the mkr token.  Binance did a great job of growing while maximizing its token.  They promised to burn a portion of its profits and they never strayed from burning throughout all their growth.  They’ve actually accelerated burning, showing belief in the future value of their own coin.  They saw the path to growth and believed that the growth would eventually be represented by that token so buying back that token was always smart capital allocation.  They burned 21 million coins at under 20 dollars apiece.  Now those coins are worth over 300 dollars even after the recent correction.  That’s maximizing value.  Here, burning mkr is called a waste of capital and the alternative is CU expansion.  Token value drives token holder loyalty and passion but how can we promote the MKR token as things currently stand? I’m not against CU growth.  But I think it should be done carefully and judiciously and have a limit based on circumstances.  I believe the MKR protocol is a wonderful idea that will grow naturally alongside the cryptocurrency ecosystem.  I don’t believe many of the core unit expenses are additive to that growth.  In fact, expenses that hold back building of the SB can be detrimental to growth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.996428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#17",
                    "likes": "7",
                    "time": "17/05/2022-17:20:29",
                    "content": "    Traster_Tray:  I don’t mind reinvesting profits but I find the way that it is done not to be efficient and not obviously beneficial to the protocol. I don’t believe paying more people equates to more growth.   This. No one else has even a quarter the paid staff Maker does. And now we’re talking about adding debt because we’re not spending fast enough? It’s disappointing and I hope to see the delegates who have been speaking out on spending smartly rather than largely get more MKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.84920634920635
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#18",
                    "likes": "12",
                    "time": "17/05/2022-19:31:13",
                    "content": "Today, 17th May 2022, the first Maker voter committee meeting took place. Several interesting points emerged. Since I think it’s useful to have stuff written down, and not just orally discussed in the meetings, I am making my own (in no way official!) summary of the main ideas discussed. Everybody is welcome to intervene and correct me if I say something inaccurate.   Some big MKR holders (including @LaveP) expressed their lack of satisfaction on the RWA work being done by the RWA-related CUs so far. They sort of expressed a certain lack of trust in the skils of these CUs (too young, lacking ‘culture’, etc).  My take on (1): It’s interesting to note that nobody during the call complained about CUs salaries. My take is that MKR holders are happy to pay quality work. That’s not the problem and in fact salaries could be even higher if deserved. But results need to follow. For instance no MKR holder (I am aware of) complains about salaries of PECU. They (and their predecessors at the Maker Foundation) delivered the smart-contracts we have today, and as we know, they have been among the most battle-tested and bug-free code in DeFI. [I am personally not competent enough to express any judgment on RWA’s CUs.]   @NikKunkel pointed out that the flat structure of the CUs system is less efficient than the centralised structure of the old Maker Foundation, because the lack of a pyramidal organisation providing clear priorities. @brianmcmichael (and other PECU people) complained for the perceived lack of clarity: does MakerDAO want to be a Open/Free software project or a Financial Institution?  My take on (2): Decentralisation is great. But both MKR holders and CUs need more clarity and focus. A clear path forward with a scope of at least a couple of years. A clear mission and set of shared and precise goals. MakerDAO in the last few months has been full  of “potential deals”, “growing opportunities”, “partnerships being finalised” etc. But really, I suspect MKR-holders (and CUs) need one (or two) steps back and agree on a more focused and narrower plan and organisation.  The only MKR holders who are willing to spend significant time/energies on MakerDAO are those with a large % of their wealth invested in MKR. And, most likely, 95% of them are already within the CUs system, Delegates or partner projects (like Oasis).  My take on (3): True. This means, in particular, that CUs/Delegates/partners have stake in the game and so are very motivated. Yeah, most MKR-holders just want to sit out, do nothing, and see their MKR bags to the moon. The best we can do to align incentives, is to make it convenient (by staking rewards) to delegate their MKR to a delegate of their choice. @Hasu also said something like “AAPL holders do not participate in Apple day-to-day decisions!”. And I guess this is compatible with the above viewpoint.  A MKR-holder from the old Maker Foundation, @MakerMikeP, now completely inactive, asked for ways to “quickly understand what’s going on at Maker, potentially He’d like to vote or something, but he’s totally lost”.  My take on (4): This is the sentiment of somebody who was inside the Maker Foundation. LOL! You can imagine MKR holders with only superficially knowledge on Maker DAO. So it’s absolutely critical that we spend resources to create a simple interface between MKR holders and delegates, and incentivise them to delegate. Frankly speaking, the Forum is like 3 orders of magnitude (1000x) too complicated/technical. It’s kind of impossible to get an higher-level view of MakerDAO reading forum posts. The forum and it’s day-to-day dynamics are all about “tactics” and almost nothing about “strategy”. MakerDAOs absolutely needs to do better on this front.  I entirely omitted Rune’s ideas, which are better known and have been voiced already. My main interest for attending these events is hearing other MKR holders opinions/sentiments/ideas. Suggestion: For the next meeting, I hope we can have somewhat faster speaking rounds, hopefully more MKR-holders (especially whales) speaking. Try to avoid “answering” criticisms or questions. Just have more ‘flow’ of opinions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9238524238524235
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#19",
                    "likes": "4",
                    "time": "17/05/2022-19:42:27",
                    "content": "On 1, I would add big Maker holders expressed dissatisfaction with some of RWAs being onboard, the Egypt power plant loan in particular. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "1",
                    "time": "17/05/2022-20:00:01",
                    "content": "That was Kevin Miao of BlockTower Capital, and No RWAs have been onboarded(its been a while)–that was a “Greenlight” Poll which means a lot more investigative work and legal review needs to be performed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#21",
                    "likes": "4",
                    "time": "17/05/2022-20:02:46",
                    "content": "    flipflopflapdelegate:  That was Kevin Miao of BlockTower Capital, and No RWAs have been onboarded(its been a while)–that was a “Greenlight” Poll which means a lot more investigative work and legal review needs to be performed.   At this point it is worth saying that @rune mentioned that we have a large pile of greenlighted stuff that will likely never be approved/implemented. Ever. Still consuming our bandwidth in terms of “investigative work” and “legal reviews”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.178571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#22",
                    "likes": "3",
                    "time": "17/05/2022-20:27:04",
                    "content": "Fair, onboarded isn’t the right term.  It wasn’t just Blocktower though. Hasu called it an attack on Maker by Oasis. Rune outlined a short-term vision with no room for it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.464285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#23",
                    "likes": "17",
                    "time": "18/05/2022-00:42:28",
                    "content": "    iammeeoh:  Some big MKR holders (including @LaveP) expressed their lack of satisfaction on the RWA work being done by the RWA-related CUs so far. They sort of expressed a certain lack of trust in the skils of these CUs (too young, lacking ‘culture’, etc).   I am sorry that I was unable to attend the meeting, however, I and @Eumenes had been meeting with HVB for a good part of the day to align on a detailed term sheet to support the RWF CU risk assessment of the HVB deal. More on that to follow with my weekly incubating LTS update. I take exception to general statements about the RWF CU “inexperience”. As I have a lead support role on every deal, I need to answer this point: I have nearly 25 years international project and general commercial finance experience - 15 years at international law firms (including partner level) and 10 years in-house. 1997-2002 Wilmer, Cutler & Pickering (Washington DC-based) - Latin America project finance and general commercial transactions 2002-2004 - Paul Hastings (Washington DC-based) - Latin America project finance and general commercial transactions 2004-2008 Paul Hastings (Hong Kong) - Asia project finance, LNG, leveraged finance and general commercial transactions 2008-2010 Paul Hastings (Tokyo) - Asia project finance, LNG, leveraged finance and general commercial transactions 2010-2012 Morrison & Foerster (Tokyo) - Asia and Latin America project finance, LNG and general commercial transactions 2012-2020 Anadarko Petroleum / TOTAL (Houston) - Direct responsibility for all legal support for LNG marketing, shipping and project finance for the $25 billion Mozambique LNG project. My role involved leading on behalf of the project, a $16 billion project financing with international export-credit agencies from the US, UK, Netherlands, Japan and Thailand, multiples of international commercial banks and the African Development Bank. My clients have included export-credit agencies, development banks, commercial banks, large private and state-owned energy companies, private investors and others. I have advised on deals in over 40 countries. While I have not done a deal in Egypt, I have worked on numerous projects in and/or associated with India, including Mozambique LNG, where 30% of the project was owned by Indian state-owned oil & gas companies. So I have some familiarity of working in India. So, I would like to better understand how there is “inexperience”? Does every team member have my experience. No. But I can assure the Maker community that we do not work in silos without communication and collaboration and I am involved in supporting these transactions. Not really any different than any other manner in which people collaborate. If I have misunderstood the comment above, my apologies in advance, but the lack of experience claim is meritless and, for an individual with my professional background and skill set, insulting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.174301242236025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#24",
                    "likes": "14",
                    "time": "18/05/2022-10:22:05",
                    "content": "One of the things that we discussed on the call and that I think are a major challenge we’re facing right now is the “relationship problem”, which is also being exemplified by the friction and potentially abrasive language we’re seeing in this thread. It’s very important to remember that there are humans on the other end, and act accordingly. In my personal experience, the issues we are dealing with come from the challenging and unprecedented situation we have in maker and the decentralized workforce, and the immature structure and lack of direction, including lack of MKR holder input and voter apathy - not a problem with any individual. On the contrary we need to remember that we have some of the most skilled and experienced and most importantly passionate people in the entire industry willing to work on maker and do what it takes to bring it to the next level. If we’re able to reorganize and set things up for success, without burning the bridges of all the complicated relationships that now exist, I believe the potential for value creation is enormous. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0552759740259745
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#25",
                    "likes": "2",
                    "time": "18/05/2022-11:08:24",
                    "content": "    christiancdpetersen:  If I have misunderstood the comment above, my apologies in advance, but the lack of experience claim is meritless and, for an individual with my professional background and skill set, insulting.   Unless I missed it, nobody ever mentioned you specifically in the call. And surely you are not mentioned in this part you quoted:     iammeeoh:  Some big MKR holders (including @LaveP) expressed their lack of satisfaction on the RWA work being done by the RWA-related CUs so far. They sort of expressed a certain lack of trust in the skils of these CUs (too young, lacking ‘culture’, etc).   Furthermore, the event was advertised by @rune as a safe space for MKR holders to speak up opinions, impressions, feelings… openly. There is no doubt you @christiancdpetersen are a serious professional. But I am going to say something unpopular: professionals need to be able to take criticisms with a grain of salt and constructively, even if the criticism is quite harsh or even borderline-offensive. The fact remains: that some MKR holders are apparently not happy about the status of RWA results so far. This might be absolutely not due to poor work by the CUs (I think the main cause is the lack of a clear direction and consensus on that, which could actually be attributed to MKR’s apathy.) But still, the fact remains.  Again, I hope these meetings and this thread can     iammeeoh:  Try to avoid “answering” criticisms or questions. Just have more ‘flow’ of opinions.   We just need to collect opinions and then process them constructively and objectively. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.147941468253968
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#26",
                    "likes": "3",
                    "time": "18/05/2022-13:49:04",
                    "content": "For what it’s worth, I think Hasu’s criticism is overstated. Greenlit collaterals are merely brought into the review queue for CUs and, in fact, most rot on the vine or sit in purgatory for months on end. Passing a Greenlight Poll is not a guarantee of overboarding and is merely way to indicate MKR holder desire with regard to prioritizing CU collateral reviews. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#27",
                    "likes": "2",
                    "time": "18/05/2022-15:54:49",
                    "content": "Yes, its unlikely to go anywhere. My main issue is its unfair to the CUs and customer seeking the loan. This proposal is clearly not going to go anywhere, but delegates still passed it onto CUs who have to do… something with it. Meanwhile, they get pressure on the backend to reduce budgets and complaints over lack of results. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.8958333333333335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#28",
                    "likes": "9",
                    "time": "18/05/2022-16:12:14",
                    "content": "    rune:  One of the things that we discussed on the call and that I think are a major challenge we’re facing right now is the “relationship problem”, which is also being exemplified by the friction and potentially abrasive language we’re seeing in this thread. It’s very important to remember that there are humans on the other end, and act accordingly. In my personal experience, the issues we are dealing with come from the challenging and unprecedented situation we have in maker and the decentralized workforce, and the immature structure and lack of direction, including lack of MKR holder input and voter apathy - not a problem with any individual.   I am going to try very hard not to be or sound abrasive.  I very much appreciate what you’re trying to do in taking token holder feedback, giving those who don’t have as much power more of a say. At the end of the day, you have the power to decide because right now you basically have majority voting power.  I recognize that you haven’t used that voting power in a dictatorial way.  I see that you have spread what you have among different delegates in order to promote diversity of opinions.  I respect your desire for more decentralization and it feels you often take a more hands off approach to allow different ideas to develop. But still, I think we need to recognize that at this point, we are not exactly decentralized and the direction of the MKR protocol is up to you.  You decide who to listen to.  You decide who makes the most sense or who is most convincing.  You decide when to approve spending and when to pursue fiscal restraint.  For now, all these forum posts are directed toward you and those you most trust. But funny thing…I’d be ok with it if it was working.  If revenue and token price was growing accordingly, I’d be quite happy.  I probably wouldn’t even be posting here because I would trust you and how you are using my money.  You founded a great project with a great idea and I’d be excited to see what you would do next.  But the issue is, it hasn’t felt like it has been working for awhile now.  The big picture I see is declining revenue and rising expenses.  I see that even in times of increasing revenue, I don’t see any of that value as it all gets spent away.  I’m not promised a point in time when that will change.  I don’t agree with many of the expenses but again, I know I’m not in charge. …so it’s up to you and those you trust to fix those things.  Obviously you can’t make everyone happy so do what you think is best and we will all continue to scrutinize the results.  I’m still interested and I’ll stick around making noise as long as I’m interested.  Luna and UST’s failure brightened the picture as it relieves some competitive pressures but it doesn’t change the picture of rising expenses and decreasing revenue.  So I continue to hold some tokens but I can’t bear to have more skin in the game because I can see the path to failure just as much as I see the path to success. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.318090062111801
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#29",
                    "likes": "12",
                    "time": "18/05/2022-17:00:59",
                    "content": "    iammeeoh:  The fact remains: that some MKR holders are apparently not happy about the status of RWA results so far.   The claim that people working on RWA are “uneducated” I believe came from someone who is a counterparty with significant proposals before the community. Naturally one will be unhappy if commercial hopes for doing lucrative business with MakerDAO are not being met. Thus a concurrent critique “speaking as a MKR holder”  is not objective. But what does it mean to be “objective” and how can that possibly be defined here? What matters most is transparency, appropriately detailed disclosures about financial interests and relationships that inform the community adequately regarding incentive alignment (or lack thereof). I remain perplexed by comments about delegate and CU collusion or coercion dynamics. What in the world specifically is alleged to have occurred or is occurring? I really would like to know at the risk of stirring the pot. But I have to speak on it publicly (as I did live on the G&R call last week) because I shall not remain quiet on the point lest it be assumed or inferred that I am involved in some such dynamics. There’s a very positive and legitimate role delegates could play in cooperating off-line with CUs (and potential counterparties) as a resource. Hopefully, there will be consensus and appetite to encourage true decentralized collaboration and decision making where each person in this ecosystem is seen as of equal value for their perspective and contribution. I do not support a hierarchy that says people being compensated for the value they bring or create through time and work spent on the DAO should be beneath or subject to a kind of “pure” group of stakeholders. None of that makes any sense at all in the new future we are trying to build together. I’m committed to so-called “Web3” because I believe there is wisdom and better outcomes previously unknowable and unobtainable in top-down control structures with concentrated power. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4110246371275785
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#30",
                    "likes": "5",
                    "time": "18/05/2022-18:11:42",
                    "content": "Right now, this is not exactly the case. I have yet to take any action. But I think you’ll be happy to hear that I have in fact been working for many months on a major overhaul with the goal of tackling the main issues we are now seeing, and have been getting a lot of input from many discord participants. I will be posting me details about this later tonight, including a link to the call taking place tomorrow 5pm cest where the plan will be presented. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.272156084656084
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#31",
                    "likes": "0",
                    "time": "18/05/2022-18:45:36",
                    "content": "Well, I’m hopeful that this one gets a good look and tweaks, if needed, to make it more viable. I don’t know if it’s a question of fairness per se, since CUs get paid to review and opine. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/squid",
                    "index": "#32",
                    "likes": "5",
                    "time": "18/05/2022-18:46:34",
                    "content": "I am a small MKR holder and it astonishes me to see the kind of salaries being proposed, for example, here: MIP40c3-SP67: Modify Core Unit Budget - Strategic Happiness (SH-001) - #89 by aburban90. Sorry for the tone but I question the delegates’ decision making here. 250 MKR as vesting for one person mainly distributing swag? That’s almost $400,000 at current prices and likely to be a whole lot more when vesting ends!! This is on the top of a very generous salary of $70,000 per year + expenses. How on earth is this not being called out and voted out as absurd? And then we act surprised when the MKR token doesn’t hold its value when they’re being given out like candy? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.768429487179487
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#33",
                    "likes": "0",
                    "time": "18/05/2022-19:38:22",
                    "content": "Its unfair to CUs  because there is increasing pressure on budgets and productivity. If we do see a real recession and crackdown on budgets, the best defense is being able to point to concrete projects you worked on that are actively earning Maker revenue. People who spent their time reviewing bad proposals that go nowhere are at much higher risk of cuts or layoffs, and “delegates told me to work on useless projects” is not a great defense in that environment. On the flip side, CUs are expected to do what the delegates vote for them to do and get complaints when they ignore proposals that get voted in. Its a no win situation for them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.717948717948718
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#34",
                    "likes": "1",
                    "time": "18/05/2022-20:09:38",
                    "content": "    CodeKnight:  People who spent their time reviewing bad proposals that go nowhere are at much higher risk of cuts or layoffs, and “delegates told me to work on useless projects” is not great defense in that environment. On the flip side, CUs are expected to do what the delegates vote for them to do and get complaints when they ignore proposals that make that get voted in. Its a no win situation for them.   From what I’ve seen, the delegates voting in favor of the useless projects and the delegates complaining might not be the same delegates. There seem to be rubber stamp delegates and then delegates who are trying to encourage value creation. The no win situation sounds like an accurate description, tho ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.8863636363636367
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#35",
                    "likes": "0",
                    "time": "18/05/2022-20:17:11",
                    "content": "    squid:  I am a small MKR holder and it astonishes me to see the kind of salaries being proposed, for example, here: MIP40c3-SP67: Modify Core Unit Budget - Strategic Happiness (SH-001) - #89 by aburban90 . Sorry for the tone but I question the delegates’ decision making here.   Hey man   I’ve actually been with MKR since 2015 ,  My Core Unit was officially onboarded sometime last year. Fwiw, to date…  I’ve never taken any salary or vest from Maker before. Maker has been just a passion project for me. I might still have some swag for you laying around tho : ) Shoot met me a DM if you’re interested   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#36",
                    "likes": "2",
                    "time": "18/05/2022-21:00:53",
                    "content": "Since we cannot “see” what work is being performed that adds value to the protocol, maybe a better way of coordinating would be to use something like coordinape. MKR holders vote on the number of points allocated to each recognized delegate. The delegate gives these points to contributors of the protocol, but cannot reward themselves. Points are redeemed for DAI. This system puts delegates in charge of paying other contributors for their proof of (off-chain) work while developing (on-chain) reputation. If a delegate stops accruing points or is accruing way too many, then they can have their role revoked and a new member added as a recognized delegate. This creates a decentralized workforce with some checks and balances. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.264204545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/squid",
                    "index": "#37",
                    "likes": "5",
                    "time": "19/05/2022-05:04:51",
                    "content": "I hear you and your efforts are valuable. I don’t disagree that you should be paid. But 250 MKR is literally life changing money for almost all people, regardless of where you live. Compensation at this level is completely over the top, unsustainable and only devalues MKR. It’s already happening anyway and this kinda spending is going to make it worse. Urge @Recognized-Delegates to consider the vesting component and decide if they think it is reasonable. ",
                    "links": [
                        "https://forum.makerdao.com/t/compensation-levels-in-a-global-organization/15342"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.446969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#38",
                    "likes": "1",
                    "time": "19/05/2022-13:47:07",
                    "content": "Delegates can call out but at the end the day, it’s up to MKR voters to validate such positions. The protocol is a DAO and thus MKR voting decides such.     MIP40c3-SP67: Modify Core Unit Budget - Strategic Happiness (SH-001) Formal Submission   @ElProgreso @ultraschuppi @twblack88 @juanbug  Considering there’s less than a week before the voting ends and you have voted yes or abstain on this voting, wanted to have the discussion as I believe this vote will have far-reaching consequences and precedence.  I have read the reasoning for the voting and I worry that some reasoning seem more emotional rather than rational despite this budget being almost $1 million.  For example, for @Juanbug   “With not just this Core Unit, but with all, we u…     ",
                    "links": [
                        "https://forum.makerdao.com/t/relay-semanal-17-23-de-mayo-del-2022/15392",
                        "https://forum.makerdao.com/t/weekly-relay-may-17-23-2022/15346"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#39",
                    "likes": "1",
                    "time": "20/05/2022-04:32:38",
                    "content": "First of all I want to say thank you for showing up and speaking out. Your posts have truly caught the attention of 3F Delegate and others alike(I am sure). Please note that I personally have taken your comments to  and thought about your arguments, which are valid. I also want you know that you’re an MKR token owner, therefore a valuable community participant whether you own 0.0001 MKR or 0.10 MKR—trust me we started from the bottom, and All MKR token owners are now here, today stronger than ever! Second, I want you to understand that this budget proposal has a lot of checks and balances—including but not limited to a long cliff which allows you and All MKR token owners to take steps in order to offboard this CU. More importantly this CU has a chance to develop community relations faster than any individual or CU that’s active today. Now do they have the skill set to do such? Odds are against them. But I bet they’ve done a better job today than most. And you can’t deny that, unless you’ve been  too lazy to get out in the frontier. So, what I am saying to you is heart felt. Give them a chance to proof themselves. Our downside is, they totally suck and they get offboarded in less than 12-months. The upside? It’s finite ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.834033613445379
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#40",
                    "likes": "0",
                    "time": "20/05/2022-13:20:16",
                    "content": "    flipflopflapdelegate:  allows you and All MKR token owners to take steps in order to offboard this CU   I don’t want to offboard this cu but there’s another one I’d like to suggest. How do I as token owner start that process? Do I have to code the proposal myself to end funding streams or do the devs handle the technical part of proposals? Sorry for the tangent ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#41",
                    "likes": "5",
                    "time": "20/05/2022-13:32:23",
                    "content": "    Ippy:  How do I as token owner start that process? Do I have to code the proposal myself to end funding streams or do the devs handle the technical part of proposals?   No, you wouldn’t be required to write code in order to make a proposal. You would need to write out your proposal/idea and post it to the forum, the format would depend on what the proposal is aiming to achieve. GovAlpha would organise an appropriate on-chain poll and if that passed then PE would be responsible for handling the code side of things and including it in the spell for an Executive Vote. Edit to add: anyone can make a proposal on the forum. You don’t even need to be an MKR token holder. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#42",
                    "likes": "0",
                    "time": "20/05/2022-13:40:41",
                    "content": "    Patrick_J:  format would depend on what the proposal is aiming to achieve.   Yeah, I was reading the mips portal a bit. I was confused about how to propose to off board. I found some by @Deimos that seemed like I would need to do several at once? 1 to reduce budget, 1 to remove facilitators, and then 1 to remove the cu? Is that correct? If I follow his content and shop proposals as examples, is that still the right way to do it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.809523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#43",
                    "likes": "3",
                    "time": "20/05/2022-13:48:00",
                    "content": "    Ippy:  Is that correct? If I follow his content and shop proposals as examples, is that still the right way to do it?   At present, yes. Although there is ongoing work on a proposal to streamline the process. The reason it needs 3 proposals is because MIP39c3 states that a Core Unit can only be offboarded if there is no budget and no facilitator. Practically, these proposals can be bundled into one on-chain vote as a MIP set, as happened with the Content Production CU offboarding. I appreciate this can be a bit confusing, GovAlpha is always happy to advise on the Governance process. Feel free to reach out to me in DM here or on discord (Patrick_J#2627) if you want advice on navigating the governance processes. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP39#MIP39c3",
                        "https://vote.makerdao.com/polling/QmYk1XN5#poll-detail"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.988095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#44",
                    "likes": "2",
                    "time": "20/05/2022-17:19:05",
                    "content": "    Patrick_J:  At present, yes. Although there is ongoing work on a proposal  to streamline the process.   in fact, working on a pull request and the forum post about that revision. In the revised process you would just need one MIP subcompenent. It also has a better template too, which implies some legwork to understand what the team actually does before offboarding them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#45",
                    "likes": "0",
                    "time": "20/05/2022-17:20:14",
                    "content": "    Ippy:  there’s another one I’d like to suggest.    image1400×700 352 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#47",
                    "likes": "0",
                    "time": "24/05/2022-11:58:44",
                    "content": "10 posts were split to a new topic: Compensation levels in a global organization ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#48",
                    "likes": "8",
                    "time": "25/05/2022-08:28:34",
                    "content": "Yesterday, Tuesday 24th May, the second Maker voter committee meeting took place. again, following this post I am posting here my own notes on the event (in no way ‘official’) just to keep track of what is happening. Note, however, that this time the meeting was recorded (link so you can watch it. ) Generally speaking, I am having the impression (perhaps biased) that between the meetings and this forum thread, some sort of ‘consensus’ on some key issues (of the current MakerDaO organisation) is starting to emerge.  After a rather quick presentation of Rune, stating the intended goals of these meetings, @rune invited @wouter (from the SES CU) to give a presentation on the current “big picture” of Maker, from a CU perspective. @wouter 's presentation lasted about ~30 minutes and described in quite some details how the several CUs are interacting with each other on some “key strategic goals”. (here is a link for the presentation if you want to dig in it).  → This was quite useful indeed to appreciate the level of internal complexity (and the fact that they are indeed coordinating in a non-trivial way). But, imho, way too technical for the ‘casual MKR holder’ (be it a giant whale or a tiny fish).  → @wouter pointed out a key concept: INFORMATION COST. it is very time consuming (aka costly) to get into details of a complex system. It’s important to find the right balance (or to offer several layers of abstraction) between information-delivered/cost. After the end of wouter’s presentation we had some general discussion. The two KEY topics (imho of course) are: TOPIC A: Priority   Some people in the DAO (@hexonaut was one of them) view as key goals to achieve asap: L2’s expansion, RWA onboarding, usage of USDC to buy bonds, etc.   Some others (including @rune and @wouter ) argued that, while the above are of course important, the most critical goal is to ‘fix governance’ which appears to be somewhat broken now (few people voting/delegating, etc etc).    → I personally agree with (2). It’s not possible to build a big and solid house on weak foundations. TOPIC B: Delegates We somewhat agreed that further developing the the delegates ecosystem is of key importance for Maker. Delegates must be put in a situation where they compete (in a healthy way) to get MKR delegated to them. And one of the tasks they need to champion to achieve that, is to be able to illustrate to MKR holders their vision at the right level of complexity. Put in other words, Delegates must do the hard work of bridging between MKR holders and CUs. Of course this requires the right incentives and balances:  delegates must be very professional and well paid. delegates must be put in check by CUs. Example: if they lie to MKR holders, they should be calle out by CU facilitators (again, right incentives must be placed for this to happen)_ MKR holders need to (forced in necessary, by dilution panalities or other mechanism) to delegate their MKR to their favourite delegate, so that indeed delegates have something to fight for.  Finally @rune pointed out that all the above is indeed the end-goal, but for that to work we first need to set up the right foundation (I believe he called it a “constitution”). ",
                    "links": [
                        "https://www.youtube.com/watch?v=6ArOPRZhf6o",
                        "https://docs.google.com/presentation/d/1ytxkxxQytFkYgKjPR8F8l9PXd6CJ5tFB0DPuwFqB7Ms/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.258949829931972
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Breezy",
                    "index": "#49",
                    "likes": "6",
                    "time": "25/05/2022-11:02:47",
                    "content": "(Comment in reference to all vesting MKR that has been issued to at $0 strike price, for free) I find this topic utterly disgraceful. Completely financial irresponsible.  Does Maker have a single financial expert that assesses appropriate budgets and spend.  The spend is out of control for the value delivered.  250 MKR for free?  How does this incentivize the anonymous person receiving this payment to increase the value of Maker from the day they receive the commitment of Maker that simply vests over time with no other KPI?  It is laughable how amateur this is. The vesting MKR should be issued at a strike price 10% higher than the current price of MKR when they commence the contract, so they at least have to increase the value of MKR by 10% to drive any value from the vesting MKR. It’s called options guys.  It is how every employee in every company is incentivized with equity.  Very unusual that shares / tokens are issued for free, always options with a strike price equal to or higher than the current token price. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.368703007518797
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Breezy",
                    "index": "#50",
                    "likes": "5",
                    "time": "25/05/2022-11:13:57",
                    "content": "No more issuing MKR to anyone at $0.  MKR tokens should only be issued as incentives as options with a strike price equal to or higher than MKR price at time on contract commencement. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#51",
                    "likes": "3",
                    "time": "25/05/2022-11:19:30",
                    "content": "@Breezy I think what you said is very reasonable, and most people would agree. However keep in mind how volatile crypto (MKR) is. As far as I remember, this type of compensation was first proposed by PECU (the first CU that was established with a vesting system) and at the time 1MKR was worth ~4k usd. I agree we need to use options, rather than just issuing MKR “for 0$”, but the value should be calculated properly. Maybe a trailing average of the last 24months, or something like this. Anyway @Breezy I hope the topic you brought up will be expanded and discussed by delegates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.838888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#52",
                    "likes": "7",
                    "time": "25/05/2022-11:29:55",
                    "content": "Again, we are not inventing anything. Should be enough to look at compensation research and how it happened over the last decades. Compensating contributors with (delayed) MKRs vs DAI helps reducing protocol cash costs, aligning incentives (although imperfectly), and get retention. Issuing options is another trail, frequently used, but has its own complexities:  Who values the options? With crypto volatility the embedded value of an option is incredibly high if calculated based on standard BS - who would work for an option with such an embedded value due mainly to implied volatility? Options with clear strike prices are prone to massive market manipulation - this happens in IPO’ed businesses all the time, and in crypto where markets are not as deep and easily manipulable this could be very very bad for the protocol  Again, we are not inventing anything and, again, we should think carefully and ask for help because some of this stuff has so many indirect effects that have been analysed over decades. It’s the same for many other aspects of the protocols. Just food for thought. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.342105263157895
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#53",
                    "likes": "6",
                    "time": "01/06/2022-18:26:02",
                    "content": "Today, 1st of June 2022, the third Maker Voter Comittee meeting took place. again, I am posting here my own notes on the event (in no way ‘official’) to keep track of what is happening.   As usual, @rune started with a quick recap of the point of these meeting and what they hope to achieve. His idea is to repeat and repeat and repeat these concepts, and improve a bit at each repetition, to let these ideas propagates.  This time he introduced the idea/suggestion that groups of MKR holders could coordinate into voting groups with different ‘political’ ideas, just like in ordinary politics. If this coordination is well executed, it would give a greater sense of ‘participation’ (in one of the parties) and reduce the current sense of isolation that many MKR holders feel.  We then had a very nice presentation by the SF Core Unit (@Aes and @adcv ).  The key contribution of SF (in today’s call) was the presentation of a lot of gathered data about the status of MakerDAO and the identification of KPI’s. This started a very interesting discussion with the PROs and LIMITs of KPIs. Most people seemed to agree that KPIs should always be taken as indicative numbers, not as the ultimate source of truth. But still, that it is important to use them, not only to evaluate performance, but also to communicate goals to MKR holders ins a succinct way. @Nadia suggested that the use of these KPI’s (or similar high-level indicators) should be introduced in CU’s forum proposals, and that in general the whole community adopt this type of ‘language’ to improve transparency.   @wouter presentation of some recent work of the SES CU.  In particular he presented a work-in-progress (but already quite cool) web-portal whose goal is to present in a clear, effective and graphically pleasing way, most of the informations regarding CUs: people, budgets, KPIs, etc @wouter said that the ultimate goal is to to have the same type (or more) of data collected by SF (in the presentation above) but in a automatised way. CUs will be incentivised to push the relevant data to this portal so that everything is clearly visible and transparent to MKR holders. For example, even if a CUs want to keep the precise amount of the salaries of their members private, they should still push the overall expenses to the portal so that it is easy to check and evaluate.  Finally Rune suggested that SES and SF should cooperate much more. They constitute excellent examples of “support CUs”. They do not directly deliver value, but are helpful in increasing the value/performance of the other CUs.  My final impression: very productive meeting. Very nice to see strong participation from CUs (they are also MKR holders) and everybody seems aligned in trying to improve things. NOTE: only 5 delegates participated. This is a good but not huge number. It might become more and more important for Delegates to actively participate to these meetings. We’ll see. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.138522012578616
                }
            ]
        }
    ]
}