{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/recopilacion-de-noticias-sobre-makerdao-dai-y-mkr/14694",
            "title": "Recopilaci\\xc3\\xb3n de Noticias sobre MakerDAO, DAI y MKR ",
            "index": 14694,
            "category": [
                "Latin America"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#1",
                    "likes": "19",
                    "time": "19/04/2022-18:39:45",
                    "content": "Hola! No se si engancharán o les resultará interesante la propuesta, pero se me ocurrió abrir éste topic para recopilar, contar y comentar distintas noticias que salgan y nos enteremos sobre MakerDAO, DAI y MKR, sea las publicadas en grandes medios de comunicación o sea pequeñas noticias de la vida cotidiana que nos resulten relevantes. En un principio pensé en que sea sobre LATAM, pero no veo porque no podría ser internacional. Empiezo yo: Hace unos días se hizo viral en Argentina que un emprendimiento argentino dedicado al traslado en combies y automoviles hacia aeropuertos de Buenos Aires, especialmente al aeropuerto internacional de Ezeiza, contó que por primera vez cobró un traslado en DAI pese a que hasta unos pocos meses atrás no sabía nada sobre cryptos.  El conocimiento de DAI en el país es notorio y se observa en éste tipo de adopciones. Alguna noticia sobre DAI o MakerDAO que te hayas enterado ultimamente, te haya llamado la atención o quieras compartir para debatir? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nicolas_Bernabe",
                    "index": "#2",
                    "likes": "10",
                    "time": "19/04/2022-22:07:36",
                    "content": "Me encanta el topico. Para mi, el desafio en cripto es la aplicabilidad. Mas alla de defi, tiene que ver con la demanda de cripto y en particular de DAI. Aqui agrego una bodega que no hace mucho tambien adopto como medio de pago a DAI.  20220419_190423912×510 57.4 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#3",
                    "likes": "6",
                    "time": "19/04/2022-22:12:19",
                    "content": "@Marian, interesante tópico de entrada para compartir noticias relacionadas con el protocolo. Puedo compartir un snapshot de CryptoAvisos sobre la utilización de las stables en su sitio web:   twitter.com    CryptoAvisos.com 🛒 @CryptoAvisos  Acabamos de hacer un#snapshot en@CryptoAvisos para comparar números en un futuro.  Nos encontramos con esto:  2222 productos son ofertados por $USDT 929 por $DAI 111 por $BUSD 108 por $UST 74 por $nuARS 48 por $USDC 24 por $DOC  ¿En qué prefieren pagar ustedes y por qué? 👀 https://t.co/5NS4i8YAfT   9:03 PM - 29 Mar 2022           34                3            De un total de:  3.492 productos  El porcentaje aproximado de productos en DAI se sitúan en:  ~26,6%  Siendo la segunda moneda utilizada por los consumidores, y desde luego la primer stablecoin descentralizada que aparece en la lista, le veo un futuro prometedor en dicha plataforma.  Por otra parte, la plataforma de CryptoAvisos ha publicado el desglose de sus productos por categorías, desconozco ciertamente el porcentaje relativo que en cada una de ellas por la cual se comercian en DAI:  FQtuIMWXEAAL1ZO1920×1080 137 KB   Espero que el ecosistema sigua creciendo. Personalmente estoy muy bullish al respecto, me interesa ahondar mucho más en el uso de las cryptos en la vida real. Saludos! ",
                    "links": [
                        "https://twitter.com/CryptoAvisos/status/1508912735022690324",
                        "https://twitter.com/CryptoAvisos/status/1508912735022690324",
                        "https://twitter.com/CryptoAvisos/status/1508912735022690324",
                        "https://twitter.com/search?q=%23snapshot",
                        "https://twitter.com/CryptoAvisos",
                        "https://t.co/5NS4i8YAfT",
                        "https://twitter.com/CryptoAvisos/status/1508912735022690324"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#4",
                    "likes": "4",
                    "time": "19/04/2022-22:41:25",
                    "content": "Bien ahí @Nicolas_Bernabe y @0xRami por los aportes. En los 3 casos que compartimos, estamos hablando de lo mismo, DAI como una solución simple, rápida y económica de cobro en un país como el nuestro donde necesitamos estabilidad monetaria para las transacciones económicas mas básicas. La estadística de Crypto Avisos es muy impresionante, 26,6% es un porcentaje muy alto. A veces pareciera que USDT es totalmente predominante en la adopción en el país pero ahí está DAI con un porcentaje muy pero muy alto, y bien lejos de la tercera. También estoy muy bullish, las stablecoins traen soluciones reales y concretas a la vida cotidiana, no me cabe dudas que van a ser las monedas predominantes y con mas usos prácticos en nuestros países. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#5",
                    "likes": "7",
                    "time": "21/04/2022-13:53:56",
                    "content": "Me animo a decir que ésta es la noticia mas bizarra que vamos a encontrar en mucho tiempo relacionada con DAI. Contexto: Marcos Falcone es un joven economista argentino que tuiteó sobre un flagelo argentino de exceso de burocracia, al preguntar cual es el trámite mas absurdo que conocen en Argentina. Se viralizó. Martín Tetaz, es un diputado opositor (de la UCR Juntos por el Cambio) que antes era un economista muy conocido, respondió de ésta forma tan curiosa, proponiendo que quien aporte cual es el trámite mas inútil, será premiado con 1.000 DAI.  Éste tweet se viralizó aún mas, al provenir de un diputado bastante conocido, lo que seguramente ayudará a darle mas exposición a DAI y llegarle a gente que hasta hoy no la conocía. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#6",
                    "likes": "5",
                    "time": "24/04/2022-18:11:27",
                    "content": "Probablemente así sea @Marian. A conciencia de la exposición mediática de actores políticos vemos, por parte de Martín Tetaz, que también han incursionado a los activos crypto como el DAI. Si mal no recuerdo, él mismo apostó 1k USDT a Carlos Maslatón para ver si Javier Milei ganaba las elecciones como Diputado Nacional. Si ir más lejos, y centrándome en la temática principal, creo que la nueva ola de políticos (Tetaz, Milei, Espert, Lopez Murphy, entre otros) han sabido tomar beneficios de aquellas economías libres (como son las visiones para aceptar crypto como medio de pago). Veremos a lo lejos si el futuro dispone de una nueva forma de intercambio monetario en países como el nuestro (Argentina). Ciertamente, bajo mi opinión, lo veo difícil. La intervención del FMI en cuanto a las decisiones económicas por parte del Estado Nacional no permite la proliferación de las crypto. Es cuestionable pensar que debemos atender a las demandas de extranjeros que lo único que han querido es aprovecharse de nuestros recursos estratégicos. Como conclusión no definitiva, la adopción se ve en la calle, las personas hablan de cómo solucionar su situación económica, y aunque el mundo DeFi esté plagado de riesgos, es la opción más abierta en términos de requisitos. Eso sí, todavía estamos verdes y se nota a la hora de interactuar con los usuarios novatos. Poco a poco la educación financiera dejará de ser algo tradicional y clasista. Poco a poco las empresas integrarán nuevos métodos de pago y de inversiones. Poco a poco las webs 3.0 serán más amigables con nuevas características de UI/UX. En fin, un largo camino nos espera por delante   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#7",
                    "likes": "6",
                    "time": "28/04/2022-19:06:01",
                    "content": "Acabo de encontrar esto chequeando la seccion LATAM, tremenda idea @Marian Es mas habría que buscar si existe algún símil en el foro en ingles para colaborar o en caso contrario proponer que se cree uno porque sino hay que estar atento a cuanto post se produce cada bendito día. En sintonia con el espíritu de esta propuesta, les comento que acabo de encontrar una remiseria en La Plata que acepta cripto desde hace una semana y estoy en contacto con ellos para onbordearlos (?) que añadan DAI a su portofolio de cobro en stables. Esperemos que funcione mi pequeño y humilde accionar, los mantengo al tanto claro. Nuevamente los felicito por esta iniciativa y el espíritu colaborativo que siempre moviliza a nuestra querida comunidad cripto. So proud of you gente!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#8",
                    "likes": "3",
                    "time": "02/05/2022-22:07:00",
                    "content": "Me alegro @0xRami y @nahueth que se hayan copado con la idea. Agrego otra noticia nuevita: Brubank, el primer banco digital de Argentina, acaba de anunciar que se podrán comprar cuatro criptomonedas desde el mismo banco, sin necesidad de pasar por una wallet. Las cuatro criptomonedas que ya se pueden comprar desde el banco son BTC, ETH, USDC y… DAI https://www.cronista.com/infotechnology/criptomonedas/brubank-el-primer-banco-digital-de-argentina-tambien-empieza-a-vender-criptomonedas/ La función ya está habilitada para algunos usuarios y se irán habilitando para el resto en los próximos días. Captura de pantalla de la app:  No se pueden retirar ni depositar, solo comprar y vender. Yo personalmente no lo usaría, pero que una institución financiera tradicional haya habilitado ésta opción es un paso enorme, muestra el avance de las criptos en el país, DAI incluida, y la razón es sencilla, los usuarios lo estás pidiendo. Es imparable ésto, y la presencia de DAI en el país siente fuerte  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#9",
                    "likes": "3",
                    "time": "02/05/2022-23:07:44",
                    "content": "¡Buena propuesta! De total utilidad para una newcomer como su servidora. (Hace un tiempo venía sopesando la posibilidad de abrir un hilo similar, pero con noticias del mundo crypto en general–haciendo eje en Argentina/LatAm–, pues he leído algunas que han despertado en mí la inquietud: “¿Qué pensará la comunidad de Maker LatAm de tal o cuál cuestión?”) En fin. Me gusta. Me prendo. Si me entero de algo, chiflo. (?) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#10",
                    "likes": "2",
                    "time": "02/05/2022-23:28:49",
                    "content": "@Sol_Invictus me alegro que te sumes y compartas si encontrás alguna noticia de interés! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#11",
                    "likes": "7",
                    "time": "03/05/2022-07:11:53",
                    "content": "Excelente idea @Marian la de crear este hilo dedicado a las noticias sobre MakerDao, DAI y MKR. Esperemos a que esta plataforma siga posicionándose en la palestra de la opinión pública, ya que sucesos como el del diputado Teras se van convirtiendo en una especie de bola de nieve y con ello la gente común se va interesando en el tema. Como muestra de ello, la reseña que hizo el diario “Los Andes”:    Los Andes    Qué es DAI, la cripto que el diputado Martín Tetaz anunció que va a regalar ... Aunque para la mayoría son conocidas Bitcoin y Ethereum, hay una gran variedad en el mercado y cada una tiene sus particularidades, riesgos y ventajas.      ",
                    "links": [
                        "https://www.losandes.com.ar/economia/que-es-dai-la-cripto-que-el-diputado-martin-tetaz-anuncio-que-va-a-regalar/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#12",
                    "likes": "2",
                    "time": "04/05/2022-19:39:30",
                    "content": "Espectacular esa nota @FuchoCrypto!! Era esperable que mas allá de la opinión sobre Tetaz y su tweet, por la exposición que tiene el diputado, se iba a generar repercusión para ayudar a que DAI le llegue y le genere interés a gente que antes no la conocía. Gracias por compartir! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#13",
                    "likes": "2",
                    "time": "09/05/2022-00:45:33",
                    "content": "Mira no había visto esta nota,  gracias Fucho! Lindo revuelo armo el querido Tetaz,  tengo que reconocer que tal vez no sea la mejor cara o persona adecuada para dar visibilidad a DAI pero también soy de los que creen que no existe el mal marketing. Así que cualquier exposición por el estilo siempre es bienvenida. En un paralelismo con lo que sucedió esta semana con el Banco Galicia y Brubank, una exposición de este tipo suele contener una cuota de respaldo instituacional que no todos estarán de acuerdo en que es necesario pero que contractual mente cimienta la posición de lo que cripto puede aportar mas allá de cuestiones financieras como esta instaurado en el mindset social. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#14",
                    "likes": "2",
                    "time": "09/05/2022-00:51:34",
                    "content": "    Marian:  No se pueden retirar ni depositar, solo comprar y vender.   Como estuve debatiendo con miembros de diversas comunidades, si bien es useless en sentido practico y mas con la anulación y consiguiente prohibición por parte del BCRA este tipo de movimientos generados por instituciones tradicionales (y no tan) nos presenta la posibilidad de poner en el ojo publico que mas allá BTC y toda la parafernalia que lo rodea, el mundo crypto y en particular nuestro querido protocolo y su stablecoin tienen mucho que aportar e incluso ser herramientas que puedan mitigar o solucionar cuestiones cotidianas que afectan al ciudadano de a pie como lo es nuestra hermosa economía. Gracias por compartir amigo! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.270833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#15",
                    "likes": "2",
                    "time": "09/05/2022-02:13:03",
                    "content": "    Dai below 8 billion supply Miscellaneous   [image]  Currently, the bear market is hitting hard on DAI circulation, Vaults repayment, higher PSM burn and yet we still have a high TLV.  It would have been a tremendous opportunity to use the USDC we had in the PSM to get positive returns on DEFI protocols and to further secure the protocol.     No sé si sea con la temática principal y como está en inglés, igual lo comento por acá… Bajamos de los 8 mil millones de DAI en circulación. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.674337121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#17",
                    "likes": "2",
                    "time": "09/05/2022-14:32:12",
                    "content": "Pregunta desde el llano: ¿A qué dirías que se debe? ¿Al bajón generalizado que, entiendo, están experimentando los mercados actualmente? ¿A que la gente se está volcando a acumular en vez de gastar…? ¿Señal de que está todo bien, todo mal…? ¿Cómo se interpreta esto? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#18",
                    "likes": "4",
                    "time": "09/05/2022-14:55:25",
                    "content": "Se debe practicamente al mercado bajista que acabamos de entrar, pero si notas los datos en cadena de bloques. Puedes notar que el pago de los prestamos en DAI son mas via por el PSM, esto se debe quizas a que muchas personas estan aprovechando para tomar ganancias y cerrar posiciones, quizas para evitar liquidaciones, esperar que siga la correcion del mercado y recomprar nuevamente. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#19",
                    "likes": "1",
                    "time": "09/05/2022-14:57:43",
                    "content": "Entiendo. Medidas preventivas en momentos, aparentemente, desesperados. 'Tá complicado el asunto. (Parece.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#20",
                    "likes": "2",
                    "time": "09/05/2022-17:47:55",
                    "content": "Que no cunda el pánico, se le puede atribuir a diversos factores tanto contextuales como específicos que no vienen al caso y no son el objetivo de este hilo pero tengamos en cuenta que estos momentos son grandes oportunidades, en caso que tengas una estrategia definida para estos ciclos de mercado. Mi pequeño consejo personal es que no te dejes llevar por el FUD actual, siempre DYOR y a seguir aprendiendo/aprovechando estas oportunidades. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#21",
                    "likes": "2",
                    "time": "09/05/2022-18:05:55",
                    "content": "(No tengo estrategia, pero soy argentina. Soy inmune a la catástrofe.  Gracias por tu respuesta, Nahu.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#22",
                    "likes": "3",
                    "time": "09/05/2022-19:27:15",
                    "content": "    nahueth:  Como estuve debatiendo con miembros de diversas comunidades, si bien es useless en sentido practico y mas con la anulación y consiguiente prohibición por parte del BCRA este tipo de movimientos generados por instituciones tradicionales (y no tan) nos presenta la posibilidad de poner en el ojo publico que mas allá BTC y toda la parafernalia que lo rodea, el mundo crypto y en particular nuestro querido protocolo y su stablecoin tienen mucho que aportar e incluso ser herramientas que puedan mitigar o solucionar cuestiones cotidianas que afectan al ciudadano de a pie como lo es nuestra hermosa economía. Gracias por compartir amigo!   Comparto totalmente, mucha gente no conoce ni le interesa conocer por el momento la tecnología blockchain y la forma de operar, y no maneja ningún otro conocimiento financiero que su home banking. Para esa gente éstas soluciones de las instituciones financieras tradicionales de los Bancos (a las que puedo sumarle a las fintech) de poder comprar DAI, BTC, ETH y otras con dos clicks, les permite tener una primer aproximación a comprar cryptos de una forma “sencilla”. Algunos se quedarán solo en eso, y para otros podrá ser una puerta de entrada, como fue en mi caso que compré mi primer DAI en Buenbit y desde ahí me involucré en todo el resto que ya conocemos. Yo aunque hoy no lo use ni nunca lo usaré mas, lo festejo, dá visibilidad y acerca gente al mundo crypto. Y si los bancos se animaron a ofrecerlo es porque la gente lo demandaba, mas aún en nuestro país donde tenemos que estar siempre buscando la forma de cuidar nuestro dinero de la desvalorización pese a las restricciones cambiarias y ahí DAI ofrece una solución real. Sirve por todos lados. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.847222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#23",
                    "likes": "5",
                    "time": "16/05/2022-16:07:34",
                    "content": "MakerDAO superó a Curve y se convirtió en el protocolo DeFi con mayor TVL, después de mucho tiempo de liderazgo de Curve. Extraordinario! Fuente: Defi Llama.  image720×1075 128 KB   image720×633 68.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#24",
                    "likes": "4",
                    "time": "16/05/2022-16:42:32",
                    "content": "   CriptoNoticias - Noticias de Bitcoin, Ethereum y criptomonedas – 16 May 22    Maker, protocolo de stablecoin DAI, lidera el mercado en sangrienta semana de... Maker (MKR) lideró el mercado en esta semana sangrienta en la que las criptomonedas fueron arrastradas por la debacle de Terra USD y LUNA.      ",
                    "links": [
                        "https://www.criptonoticias.com/mercados/maker-protocolo-stablecoin-dai-lidera-mercado-sangrienta-semana-terra-usd/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#25",
                    "likes": "2",
                    "time": "16/05/2022-17:15:20",
                    "content": "Nota al pie y mención de honor a MANA, token de Decentraland, proyecto argentino. Perdón, no puedo evitar sentir cierto orgullo de local. Je. …   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#26",
                    "likes": "3",
                    "time": "16/05/2022-22:40:34",
                    "content": "Comparto un artículo interesante que salió hoy sobre como se vio fortalecido DAI en la actual situación del mercado, lo que a su vez provocó un impulso de MKR. Se comenta el contexto de algunas novedades interesantes sobre casos de adopción en “el mundo real” y la novedad de la aceptación de sETH2 como colateral.   Cointelegraph    El precio de MakerDAO se recupera mientras DAI mantiene su paridad y los... MakerDAO volvió a cobrar importancia después de que el colapso del UST de Terra obligara a los inversores a buscar un activo vinculado al dólar verdaderamente \"estable\"      ",
                    "links": [
                        "https://es.cointelegraph.com/news/makerdao-price-rebounds-as-dai-holds-its-peg-and-investors-search-for-stablecoin-security"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#27",
                    "likes": "7",
                    "time": "16/05/2022-22:53:57",
                    "content": "Buenisimo comunidad! me encanta ver las noticias en español. Por mas post de Latam! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#28",
                    "likes": "2",
                    "time": "16/05/2022-23:27:12",
                    "content": "Justo hoy estuve leyendo este articulo, excelente que en medios especializados se aborden y difundan estas noticias en particular mas allá de las vicisitudes o novedades que surgen cada dia en el ecosistema. Gracias por compartir ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#29",
                    "likes": "2",
                    "time": "16/05/2022-23:30:16",
                    "content": "Entiendo el sentimiento, creo que en cierta medida a cualquiera que este en la comunidad cripto le genera orgullo y alegría cuando se encuentra con proyectos que alcanzan tal relevancia, aun mas cuando están siendo construidos y gestionados por founders o capital humano argentino. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#30",
                    "likes": "2",
                    "time": "16/05/2022-23:33:36",
                    "content": "Que locura tenerte comentando por acá leyenda, no? @Marian Aprovecho para darte las gracias por toda la data que compartís, las opiniones y todo lo que generas día a día. Justamente como comentaba un toque mas arriba, es un orgullo saber que tenemos cracks como vos en el ecosistema, abrazo de gol y buena semana! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#31",
                    "likes": "5",
                    "time": "16/05/2022-23:46:31",
                    "content": "Un placer leerte por aquí! @Joserjimz y @Sebix están haciendo un laburazo con el programa de embajadores, y acá estamos tratando de colaborar con ellos en generar y afianzar la comunidad LATAM, y aportar contenido en nuestro idioma. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#32",
                    "likes": "1",
                    "time": "17/05/2022-00:27:03",
                    "content": "Alguna vez escuche a alguien diciendo que por luz o contraste todo esfuerzo y trabajo llegan a ser reconocidos y valorados. Acá estamos, mas allá del contexto que vivimos en el cripto mundo, once again DAI demuestra su valía y fortaleza ante un escenario tan complejo. Proud. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#33",
                    "likes": "2",
                    "time": "17/05/2022-02:07:47",
                    "content": "Gracias por la muestra de empatía, Nahu.  Me parece una locura y me alucina un poco pensar que todo esto está sucediendo, podríamos decir, detrás del espejo. Detrás del espejo, pero a nuestro lado. (…) No las he traído a colación porque no tienen que ver con MakerDAO específicamente, pero cada día leo al menos una noticia relevante para el mundo crypto en nuestras latitudes. Y en medios no-especializados. Sospecho que, en tiempos venideros, habrá una aceleración mucho más marcada de la integración/aceptación a nivel de la población local en general–hablo de los newbies como una, ¿no?–. (Amén de que, creo, todo esto viene levantando vuelo a raiz de la mini-debacle de la última semana.) En fin. Conclusiones de novata.  Ya que estamos acá, agradezco nuevamente sus aportes. Me mantienen interesada y al día. +1!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#34",
                    "likes": "4",
                    "time": "18/05/2022-02:09:53",
                    "content": "Buenas noches comunidad, acá va mi primer aporte con una noticia reciente. Como muchos sabrán The Defiant es un medio especializado y altamente confiable en cuanto a noticias y novedades del mundo cripto. Hoy sacaron esta nota de alto interés donde se aborda un caso contractual de utilidad de DAI en el mundo real como vehículo de financiamiento a traves de RWA y los vaults, en este caso particular a traves del que posee Centrifuge. Los invito a chusmear la nota y los incito a debatir sobre este hecho que IMHO continua demostrando las posibilidades y la fortaleza del protocolo y su stablecoin.   defiantes.substack.com    MakerDAO gana tracción en el muuundo real con una jugada en el mercado de... El acuerdo muestra la utilidad de DeFi en una semana difícil.      ",
                    "links": [
                        "https://defiantes.substack.com/p/makerdao-gana-traccion-en-el-muuundo?sd=nfs&s=r"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#35",
                    "likes": "4",
                    "time": "18/05/2022-19:39:26",
                    "content": "Hilo publicado hoy en la cuenta de Twitter oficial de MakerDAO LATAM. -si no la siguen, háganlo, siempre comparten allí información y datos muy interesantes-   MakerDAO espera cerrar este año con 19 MILLONES de DAI de ganancia, de acuerdo con makerburn.   El Excedente del Sistema (Superavit), que es el lugar donde  Maker DAO almacena las ganancias, ha alcanzando nuevos máximos históricos de 74 MILLONES de DAI.   MakerDAO es el Protocolo DeFi TOP 1 por Total Value Locked (Valor Total Bloqueado) con +$10 mil millones bloqueados en sus contratos inteligentes.   Hay un equivalente de + $2 mil millones de USDC y USDP alojados en las reservas de PSM que pueden ser swapeados por DAI a una relacion de 1:1 sin tarifas.   Ratio de colateralización actual: 166%.     twitter.com    MakerDAO Latin America @MakerDAO_Lat  Todo esta cayendo muy fuerte.  Sin embargo,@MakerDAO aún espera cerrar este año con 19 MILLONES de DAI de ganancia, de acuerdo con makerburn.com.  Pero eso no es todo, amigos  👇 https://t.co/3btHLEfPd9   5:24 PM - 18 May 2022           9                4            ",
                    "links": [
                        "http://makerburn.com",
                        "https://twitter.com/MakerDAO_Lat/status/1526977006147190794",
                        "https://twitter.com/MakerDAO_Lat/status/1526977006147190794",
                        "https://twitter.com/MakerDAO_Lat/status/1526977006147190794",
                        "https://twitter.com/MakerDAO",
                        "http://makerburn.com",
                        "https://t.co/3btHLEfPd9",
                        "https://twitter.com/MakerDAO_Lat/status/1526977006147190794"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#36",
                    "likes": "8",
                    "time": "20/05/2022-15:12:50",
                    "content": "La pizzería La Continental, una de las mas tradicionales de Buenos Aires - Argentina, y con muchas sucursales en diferentes barrios de la ciudad, comenzó a cobrar en cryptos a través de Skylo, una wallet auto custodia. Y en que crypto está expresada su lista de precios? Y si.  image828×1555 195 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#37",
                    "likes": "4",
                    "time": "20/05/2022-18:45:06",
                    "content": "Es una interesante noticia @nahueth. MakerDAO sigue expandiendo su alcance, la idea es que cada vez con mayor frecuencia sea asociado al mundo del comercio en general más allá de las crypto, y pienso que es una meta que se está logrando. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#38",
                    "likes": "4",
                    "time": "22/05/2022-04:16:38",
                    "content": "El DAI sigue pisando fuerte, y una vez más es desde Argentina que surgen estas excelentes novedades que más temprano que tarde causarán una bola de nieve. La debacle de TerraUSD hará que se le coloque la lupa a las stablecoin que habían permanecido fuera del radar del mundo crypto, ahora se comprende de una manera dura que no eres una moneda estable solo por calificarte como tal, y es precisamente en ese aspecto que el DAI y su ecosistema de respaldo salen mejor parados que otras stablecoin. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#39",
                    "likes": "4",
                    "time": "22/05/2022-13:41:53",
                    "content": "Wao de verdad estoy muy contento de ver a DAI ganando espacios dentro de los metodos de pago. Me pone contento porque se que esta empezando la revolucion cripto, el cambio a migrar a esta tecnologías que nos dan tanta libertad. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#40",
                    "likes": "3",
                    "time": "23/05/2022-04:41:50",
                    "content": "No sería una noticia si no una experiencia personal, pero mi familia posee un negocio de alquiler de habitaciones y cobraban en dólares físicos o al cambio del precio en fiat, comentándole con todo y diapositivas a mi padre para que acepte una moneda estable como método de pago, elegimos DAI para eso🤭 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#41",
                    "likes": "1",
                    "time": "23/05/2022-14:26:58",
                    "content": "    Moi:  No sería una noticia si no una experiencia personal, pero mi familia posee un negocio de alquiler de habitaciones y cobraban en dólares físicos o al cambio del precio en fiat, comentándole con todo y diapositivas a mi padre para que acepte una moneda estable como método de pago, elegimos DAI para eso🤭   Muy bueno! En que país??? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#42",
                    "likes": "7",
                    "time": "23/05/2022-14:31:33",
                    "content": "Ya se habló de Crypto Avisos en éste topic, una plataforma de compra-venta argentina, pero me llamó la atención ver que una agencia concesionaria de autos usados se sumó a la plataforma y ofrece en venta sus autos en DAI. Ya no estamos hablando de vendedores individuales o pequeños emprendedores que adoptan DAI en la plataforma, sino una empresa que vende autos y con montos de operaciones relativamente altos para lo que es el promedio del sitio.  Crypto Avisos962×629 137 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#43",
                    "likes": "4",
                    "time": "24/05/2022-21:14:52",
                    "content": "Venezuela  siempre buscando oportunidades ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#44",
                    "likes": "3",
                    "time": "25/05/2022-01:49:09",
                    "content": "Sabes que estoy pensando en hacer lo mismo? En cuanto a onbordear familia, amigos y conocidos interesados que tienen negocios o quieren mejorar su salud financiera. Crear una presentación ya que IMHO, usualmente cuando se presentan datos y gráficos las personas no solo prestan mayor atención sino que en cierta medida lo validan y se les simplifica el contenido, ni hablar cuando se habla de dinero no? Me alegra escuchar que tu padre haya encontrado el valor en DAI mas allá de su precio y que haya tomado positivamente tu iniciativa, te felicito che. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#45",
                    "likes": "4",
                    "time": "25/05/2022-02:03:12",
                    "content": "    Marian:  me llamó la atención ver que una agencia concesionaria de autos usados se sumó a la plataforma y ofrece en venta sus autos en DAI.   Estas atento amigo, que golazo ver como de a poco va en aumento la cantidad de negocios y comercios que adoptan cripto a través de stablecoins y sobre todo cuando utilizan nuestra querida DAI.     Marian:  una empresa que vende autos y con montos de operaciones relativamente altos para lo que es el promedio del sitio   Buen punto a notar y celebrar mi amigo, creo que es un efecto en cadena, a medida que múltiples comercios con diversas propuestas suman a su perfil pagos cripto, se va generando este famoso boca a boca que apalanca este interés en adoptarlos también para multiplicar sus oportunidades de negocios con un nuevo publico que posee cierto poder adquisitivo acorde a lo que ofrecen. Punto aparte que esta comercialización sea a través de plataformas como Cripto Avisos que facilitan todo el proceso, la están rompiendo convocando y colaborando con diversos comercios a nivel nacional. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#46",
                    "likes": "5",
                    "time": "25/05/2022-02:46:24",
                    "content": "Buenas noches Makers (como se les dice a los participantes del protocolo?) Les traigo una pagina de merch cripto basada en Córdoba, ARG que acepta pagos en stables claro y entre ellas…  Asi es, nuestra querida DAI. Se llama Candle Stick https://candlestick.me/ localmente ya han trabajo con empresas como Lemon Cash y Cocos Capital aparte de su ultimo drop para DeFi LATAM. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#47",
                    "likes": "2",
                    "time": "25/05/2022-16:37:49",
                    "content": "Me quedo con la pizza de la Continental , pero la tienda está simpática. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#48",
                    "likes": "3",
                    "time": "26/05/2022-02:58:09",
                    "content": "Argentina sigue marcando la pauta con respecto al uso del DAI, desde vendedores de ocasión o pequeños comerciantes hasta empresas concesionarias de autos. Sin duda, otra excelente noticia que se suma a este hilo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#49",
                    "likes": "6",
                    "time": "26/05/2022-03:33:23",
                    "content": "Noto que quizá es difícil advertirlo desde otros países, incluso países de la región, pero aquí en Argentina DAI tiene una presencia muy pero muy fuerte, y las razones creo que no sólo se justifican por la importancia que tienen las stablecoin en nuestro país como herramienta de defensa ante la devaluación de nuestra moneda y las restricciones cambiarias que nos impiden proteger nuestros ahorros, lo cual es una situación que objetivamente existe pero no beneficia a una stablecoin sobre otra, sino que se explica por la labor que han realizado destacados miembros de MakerDAO de origen argentino en la adopción temprana de DAI en el país desde allá por el año 2018. Prácticamente que en Argentina DAI se comenzó a adoptar desde su inicio, está muy arraigada, y eso se nota en éstas noticias cotidianas que estamos compartiendo aquí de pequeños, medianos y grandes comerciantes/emprendedores/empresas que a la hora de adoptar una stablecoin para sus operaciones, eligen DAI. Gran noticia sin dudas, pero hay mucho mas espacio por crecer y ocupar, y estoy seguro que la solidez que demostró DAI en éstas ultimas semanas muy complejas, va a colaborar en eso. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#50",
                    "likes": "5",
                    "time": "26/05/2022-22:39:02",
                    "content": "Les comparto otra noticia relacionada con DAI acontencida esta semana en Mendoza, Argentina; donde la ciudad a través de su intendente ha firmado un acuerdo con los ejecutivos de Belo, una importante wallet de criptomonedas. La finalidad de este convenio comercial es motivar a los establecimientos a aceptar pagos en criptomonedas, específicamente DAI, Ether y USDT. Una de las facilidades de Belo es que permite operar a través de una tarjeta de crédito. Sin duda, este tipo de acuerdos motiva al crecimiento de la actividad comercial en criptomonedas; y cobrán aún más importancia cuando se aprovechan los pequeños reductos dentro de los gobiernos municipales que están abiertos a adoptar el mundo crypto, sobre todo siendo harto conocido lo reacios que son los gobernantes a perder el monopolio y el poder que les da él tener la exclusividad de ser el ente emisor y regulador de la moneda en curso, y el miedo que les da perder ese privilegio usado para el control y dominio de las masas. Pueden ampliar la información a través de los siguientes links:    sitioandino.com.ar    La Ciudad de Mendoza busca que los comerciantes reciban criptomonedas - Sitio...         Perfil – 23 May 22    Mendoza alienta a sus comercios para que acepten criptomonedas La provincia avanza en un plan para que los locales de la ciudad capital puedan realizar transacciones con criptoactivos y convertirse en un destino amigable del mundo cripto.         ECOCUYO - Diario Digital de Negocios – 23 May 22    Mendoza cripto friendly: lanzan plan para que comercios de la Ciudad acepten... La Ciudad avanza en el objetivo de posicionarse como un destino amigable a las criptomonedas y la tecnología.      ",
                    "links": [
                        "https://www.sitioandino.com.ar/n/386868-la-ciudad-de-mendoza-busca-que-los-comerciantes-reciban-criptomonedas/",
                        "https://www.perfil.com/noticias/economia/mendoza-alienta-comercios-acepten-criptomonedas.phtml",
                        "https://www.perfil.com/noticias/economia/mendoza-alienta-comercios-acepten-criptomonedas.phtml",
                        "https://www.ecocuyo.com/la-ciudad-firmo-un-convenio-con-la-billetera-cripto-belo-y-busca-instalarse-como-ciudad-cripto-friendly-a-nivel-global/",
                        "https://www.ecocuyo.com/la-ciudad-firmo-un-convenio-con-la-billetera-cripto-belo-y-busca-instalarse-como-ciudad-cripto-friendly-a-nivel-global/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#51",
                    "likes": "5",
                    "time": "27/05/2022-00:57:04",
                    "content": "Che tiro la idea acá porque los miembros activos en el foro y el TL de la comunidad Maker LATAM son distintos, así que va para uds primero, les parece si organizamos una juntada en La Continental? Único detalle tendríamos que descargar Skylo previamente para chusmear requisitos, funciones y limitaciones   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#52",
                    "likes": "3",
                    "time": "27/05/2022-03:11:41",
                    "content": "No creo que haga falta que te lo diga, pero obviamente re estoy, my fren. Meetup de la comunidad de MakerDAO en Buenos Aires, eso sí que es noticia! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#53",
                    "likes": "4",
                    "time": "28/05/2022-06:28:00",
                    "content": "Así es @Marian. La situación reinante en nuestro subcontinente latinoamericano, especialmente en Argentina y Venezuela, convierte a una dificultad como lo es la inflación y devaluación constante del dinero fiat en una tierra fértil para la adopción de las criptomononedas, y por ende en una oportunidad. Nos toca proteger nuestros ahorros de las malas decisiones económicas de nuestros gobernantes, y a la vez nos sirve de aprendizaje, convirtiéndonos en un ente multiplicador para así poder seguir sumando a personas al mundo crypto. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#54",
                    "likes": "2",
                    "time": "28/05/2022-15:50:50",
                    "content": "¡Buena idea! Yo, sin embargo, tengo unos horarios laborales horribles que me impiden llevar una vida social normal~   Más allá de eso, me parece muy piola fortalecer los lazos locales. ¡Voy a estar esperando la foto de esa pizza pagada con Dai! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.552083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#55",
                    "likes": "5",
                    "time": "30/05/2022-18:20:56",
                    "content": "El Prode era un viejo juego de apuesta de resultados del futbol argentino, que estuvo vigente hasta fines de los 90´s a principio de los 2000´s. Hoy, unos emprendedores argentinos crearon CryptoProde, con similares características pero basado en la blockchain, desarrollado en la BNB Chain, y mediante el minteo de un NFT de tu equipo favorito para participar. El token que han elegido, tanto para el minteo del NFT, como para el pago de las recompensas, es DAI. Ellos mismo en éste tweet explica porque eligieron DAI:  Stablecoin asociada al valor del USD. Robusta que ha respondido en diferentes corridas bajistas del mercado.    twitter.com    CryptoProde ⚽ Copa Libertadores 06/06 @CryptoProde  Hey#proder🙌¿Conoces $DAI?🤑  Bueno este es el token que usaremos tanto para el minteo (Empieza el 06/06👀) de los NFT, como para otorgar las recompensas.   Sale hilo sobre DAI🧵 https://t.co/77Nt0AyCVN         11:29 PM - 28 May 2022           4            Una nueva adopción de DAI en la región. ",
                    "links": [
                        "https://twitter.com/CryptoProde/status/1530692663615361024?t=l1kgOh-oP16itF3NJ9XgYA&s=19",
                        "https://twitter.com/CryptoProde/status/1530692663615361024?t=l1kgOh-oP16itF3NJ9XgYA&s=19",
                        "https://twitter.com/search?q=%23proder",
                        "https://t.co/77Nt0AyCVN",
                        "https://twitter.com/CryptoProde/status/1530692663615361024?t=l1kgOh-oP16itF3NJ9XgYA&s=19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#56",
                    "likes": "3",
                    "time": "01/06/2022-04:13:42",
                    "content": "Es una gran noticia @Marian, las apuestas y los NFT bien planteados pueden ser una buena combinación. Esperemos que hagan un desarrollo óptimo de la economía de la plataforma, y así recuperar la reputación perdida a raíz de los juegos NFT y demás sistemas ponzi como el scam más reciente llamado U-91 y su nuevo clon W-91. Enhorabuena por DAI y que su uso siga creciendo  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#57",
                    "likes": "5",
                    "time": "01/06/2022-16:01:03",
                    "content": "Personalmente considero sensacional el plan de crecimiento que proyectó recientemente MakerDAO en ÉSTE TOPIC y especialmente el plan de llevar el bridge oficial Teleport a varias L2 y otras blockchains. Gran noticia. Estoy convencido que el futuro es multi-chain, y tener DAI nativo en esas redes va a ayudar y a simplificar su adopción, porque elimina los wrapped con su potencial riesgo y porque permitirá a quienes usan bridge cross-chain y a los usuarios de los CEX llegar a esas blockchains utilizando DAI nativo, lo que ahora no se puede. Avalanche hace rato tiene USDC y USDT nativos que están creciendo mucho en su adopción desplazando a los USDC.e y USDT.e del puente oficial con Ethereum, y Polygon incorporó hace poco USDT nativo. DAI se estaba quedando relegado con ésta estrategia. Estoy seguro que cuando se concrete ésto, va a ayudar muchísimo a su adopción.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#58",
                    "likes": "6",
                    "time": "01/06/2022-20:16:40",
                    "content": " Como consecuencia del boost de rewards lanzado ayer, los $DAI depositados en @AaveAave en @avalancheavax se dispararon desde 129 millones a 477 MILLONES EN UN DÍA!   twitter.com    MakerDAO Growth @MakerGrowth  🚀📈 $DAI supplied in@AaveAave on@avalancheavax skyrocketed from 129 million to 477 MILLION IN ONE DAY!  How to boost your APR with boosted $AVAX rewards?  🧵 twitter.com/MakerGrowth/st… https://t.co/IR8p8UwqZb   MakerDAO Growth @MakerGrowth  $AVAX rewards have been boosted on @AaveAave @avalancheavax 🆙⏫📈🤑  Supply 1.13% + ✨6.48% in $AVAX ✨  Borrow -2.53% + ✨6.96% in $AVAX ✨  LFG! https://t.co/7gEyWPtcJM https://t.co/tJ8khW4cnU    7:52 PM - 1 Jun 2022           22                6            ",
                    "links": [
                        "https://twitter.com/MakerGrowth/status/1532087648663240704?t=_oeDQQNvdJTheAIBcVGKow&s=19",
                        "https://twitter.com/MakerGrowth/status/1532087648663240704?t=_oeDQQNvdJTheAIBcVGKow&s=19",
                        "https://twitter.com/AaveAave",
                        "https://twitter.com/avalancheavax",
                        "https://twitter.com/MakerGrowth/status/1531716561689616385",
                        "https://t.co/IR8p8UwqZb",
                        "https://twitter.com/MakerGrowth/status/1531716561689616385",
                        "https://twitter.com/MakerGrowth/status/1532087648663240704?t=_oeDQQNvdJTheAIBcVGKow&s=19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#59",
                    "likes": "6",
                    "time": "02/06/2022-19:05:35",
                    "content": "Observando que hay nuevos miembros en el foro que comienzan a dar sus primeros pasos en MakerDAO, hoy les comparto un artículo publicado el día de hoy por el portal Benzinga que trae a colación una comparativa que se ha hecho muy común, especialmente desde el colapso de Terra UST; y es la comparación entre las diferentes stablecoins que existen, observándose un rasgo muy común: DAI y USDT es el par que más suelen comparar las páginas web especializadas. Ser dos monedas stablecoins son de las pocas cosas que comparten USDT y DAI, la primera es regulada por una corporación privada y la segunda por un ente descentralizado. Aúnque Benzinga no se decanta por una u otra sino que lo deja a criterio del lector, a lo largo del artículo hace incapié en varias desventajas del USDT, tales como el ocultamiento de información sobre Tether y las regulaciones impuestas por EEUU. Asimismo destaca que el DAI al ser operado por una organización autónoma, representa de una mejor manera el espíritu de la descentralización del mundo de las criptomonedas. En lo personal, desde que conocí a esta stablecoin, los ahorros personales que decido tener en una moneda estable los mantengo en DAI, de hecho ahora sólo utilizo USDT cuando necesito cambiar en el P2P de Binance a moneda fiat de mi país, ya que suele ser la más tradeada en ese exchange y la que mejor precio brinda. Les comparto el artículo original publicado en inglés:    Benzinga – 2 Jun 22    Tether (USDT) vs. DAI • How Do They Compare? • Benzinga Stablecoin fundamentals have been called into question following the UST crash. What are the differences between USDT and DAI?      ",
                    "links": [
                        "https://www.benzinga.com/money/tether-usdt-vs-dai/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#60",
                    "likes": "5",
                    "time": "05/06/2022-18:38:53",
                    "content": "Buen domingo comunidad! Les traigo una noticia reciente y por demás emocionante, hace unas horas MakerDAO anuncio un partnership con  One Tree Planted sumado a una nueva colección de POAPs llamada Nature. Con motivo del festejo del Dia Mundial del Medioambiente el protocolo lo celebra premiando a los creadores y tenedores de vaults con un POAP especial para ellos, de acuerdo a parametros de antiguedad o ruta de creacion de los mismos. Aunque esto es solo parte del anuncio ya que a través de una nueva alianza con One Tree Planted por cada nuevo vault que se abra el protocolo va a donar una cantidad de 10 arboles. Tremendo no? Y me quedo corto. Como toda gran noticia ya esta haciendo eco en grandes medios especialistas en el ecosistema como en este articulo de Bankless donde se comenta con mejor detalle no solo el nuevo programa sino también las implicaciones que tiene esta asociación y lo que significa para cada proyecto involucrado con acciones concretas a nivel tangible como los nuevos casos de uso y formas de relacionar el mundo real con la Web3 que representa. Espero sus comentarios sobre esta iniciativa que a mi parecer es de las mas innovadoras y transversales que se han generado en nuestro querido protocolo. PD: pueden acceder a http://nature.makerdao.com para mayor informacion. ",
                    "links": [
                        "https://twitter.com/MakerDAO/status/1533442499024408577",
                        "https://twitter.com/onetreeplanted",
                        "https://banklesspublishing.com/makerdao-lets-money-grow-on-trees/",
                        "https://t.co/LXsOtV9Mf1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#61",
                    "likes": "5",
                    "time": "06/06/2022-15:21:05",
                    "content": "El Endgame Plan de MakerDAO llegó y fue receptado por los medios de comunicación de Argentina. En ésta nota se cuentan algunos detalles y las primeras repercusiones mas destacadas:    https://www.iproup.com/economia-digital/31917-creador-dolar-digital-dai-proyecto...    El creador del dólar digital DAI impulsa nuevo proyecto para MetaDAOs y ETH... Rune Christensen está cambiando la forma de manejar Maker, lo que inclute MetaDAOs, nuevos tokens de gobierno y una nueva versión de Ether sintético      Quien desee saber de que se trata el ambicioso Endgame Plan, puede leer el topic original de Rune  The Endgame Plan parts 1&2 O su traducción en español  The Endgame Plan parts 1&2 (traducción) ",
                    "links": [
                        "https://www.iproup.com/economia-digital/31917-creador-dolar-digital-dai-proyecto-metadaos-y-eth-sinteticos?utm_source=hootsuite",
                        "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2/15456",
                        "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2-traduccion/15461"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#62",
                    "likes": "5",
                    "time": "07/06/2022-03:45:22",
                    "content": "Una noticia mas, esta vez un tanto antigua se diría? Porque se anuncio hace ya dos semanas…Celsius Network agrego varios tokens durante esa semana y entre ellos se encuentra el $MKR  Les comparto el tweet del anuncio oficial:   twitter.com    Celsius @CelsiusNetwork  Celsius now supports $MKR, $YFI, $CVX, $CRV, and $BADGER. 👀   Learn more → celsius.network/earn https://t.co/v8YM0nfgqz   7:32 PM - 20 May 2022           230                44            El plus es que no solo se puede comprar, vender y generar rendimientos semanales con $MKR, sino que tambien pueden swappear, pedir prestado y enviar usando DAI  Para mas informacion y detalles pueden chusmear en celsius.network/earn ",
                    "links": [
                        "https://twitter.com/CelsiusNetwork/status/1527734026865344517",
                        "https://twitter.com/CelsiusNetwork/status/1527734026865344517",
                        "https://celsius.network/earn",
                        "https://t.co/v8YM0nfgqz",
                        "https://twitter.com/CelsiusNetwork/status/1527734026865344517",
                        "https://t.co/OIrtUMHuwb"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#63",
                    "likes": "6",
                    "time": "07/06/2022-18:45:16",
                    "content": "Ya que estamos con las noticias pasadas de fecha, esta tarde les comparto una novedad hermosa que paso desapercibida desde su salida, se preguntaran a que me refiero? Primero les brindo un poco de contexto, si están atentos y al día con el foro notaran los diversos debates y propuestas que se están generando estas ultimas semanas, una de ellas es la creación, desarrollo e implementacion de una Maker Brand a través del establecimiento de una Marketing CU y todo lo relativo a la misma (PR & Comms, contenido, branding, medios, etc). En este sentido una de las tantas acciones que se vienen realizando fue el lanzamiento de prueba de la primera publicidad directa en medios, la misma sucedió durante Abril a través del canal de Youtube de Bankless. Les dejo el comentado vídeo, como verán solo dura  25 segundos así que pueden chusmearlo en un parpadeo.  Aviso parroquial, el mismo esta únicamente disponible en ingles pero con la ayuda de los subtitulos (también en ingles) y las imágenes que lo complementan creo que se logra comunicar eficazmente la idea general de esta publicidad.    YouTube    ✂️ MakerDAO 25 seconds · Clipped by Nadia Alvarez · Original video \"FRAX & the 4pool Curve Takeover | Sam Kazemian\" by Bankless      Cuando dice y cito: MakerDAO is the OG DeFi protocol…emoción pura  ",
                    "links": [
                        "https://www.youtube.com/clip/UgkxbIxidmt2gNnc715nxT4DlWpSWCfzq2p_"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#64",
                    "likes": "1",
                    "time": "07/06/2022-21:37:07",
                    "content": "Tiene casi 2 meses, pero recién me entero de ésto! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#65",
                    "likes": "1",
                    "time": "07/06/2022-21:55:54",
                    "content": "Normal mi amigo, particularmente me interesa todo lo relativo a esta propuesta así que la vengo siguiendo. Claramente la información sobre la misma pasa desapercibida por diversas razones. Estoy viendo si puedo generar contenido al respecto para mantener a la comunidad LATAM al tanto de este proyecto ya que IMHO es fundamental para el protocolo y sus objetivos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#66",
                    "likes": "4",
                    "time": "08/06/2022-06:10:35",
                    "content": "He aquí otra reseña sobre los nuevos proyectos de MakerDAO y su fundador Rune Christensen. Endgame, que traducido al español sería “final del juego” consiste en la creación de metaDAOs y versiones sintéticas de Ether. El objetivo es aumentar el potencial y la autonomía, volviendo el protocolo mucho más simple de lo que es hoy. En cuanto al Ether sintético, sería un token que mantenga paridad en su precio con el de Ethereum, así como DAI lo hace con el dolar fiat de EEUU. Más información en el link:    CriptoNoticias - Noticias de Bitcoin, Ethereum y criptomonedas – 3 Jun 22    MakerDAO podría cambiar su estructura y lanzar otros tokens además de DAI El fundador de MakerDAO propone dividir la organización en varias DAO y desarrollar ether (ETH) sintético.      ",
                    "links": [
                        "https://www.criptonoticias.com/negocios/makerdao-podria-cambiar-estructura-lanzar-otros-tokens-ademas-dai/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#67",
                    "likes": "3",
                    "time": "08/06/2022-14:28:26",
                    "content": "Bien! Otro medio de comunicación que recepta el Endgame Plan, hizo mucho ruido la propuesta de Rune, es muy ambiosa. Acá está el topic de Rune donde presentó los lineamientos del plan: The Endgame Plan parts 1&2  Y aquí su traducción al español: The Endgame Plan parts 1&2 (traducción)  ",
                    "links": [
                        "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2-traduccion/15461"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#68",
                    "likes": "5",
                    "time": "08/06/2022-18:13:10",
                    "content": "Hace exactamente una semana salio un curso intro a MakerDAO por parte de la gente de Solow, que es una plataforma educativa donde se brindan cursos gratuitos sobre distintas tematicas del ecosistema cripto.  maker733×122 10.7 KB  Pueden ver la diversidad de cursos disponibles acá solow.io Les dejo el anuncio de la salida del curso por parte de Santi, uno de los creadores de la plataforma  twitter.com    santicristobal.eth 🐽 @scristobal94  Sigue la#MaratónSolow con el 3er curso gratis para aprender de cripto jugando.  Esta vez.... sobre#MakerDAO.  La semana pasada tuvimos a@LozadaLuis12 de@MakerGrowth en la trivia cripto que hacemos todos los viernes y nos dimos cuenta que era hora de profundizar un poco 🔎 https://t.co/KoXVINXOsc   9:27 PM - 1 Jun 2022           21                5            Y por si les interesa el proyecto pueden sumarse a su Discord desde:   Discord    Join the Solow Discord Server! Check out the Solow community on Discord - hang out with 2,281 other members and enjoy free voice and text chat.      ",
                    "links": [
                        "https://t.co/P0Z6P79jXQ",
                        "https://twitter.com/scristobal94/status/1532111695753228297",
                        "https://twitter.com/scristobal94/status/1532111695753228297",
                        "https://twitter.com/scristobal94/status/1532111695753228297",
                        "https://twitter.com/search?q=%23Marat",
                        "https://twitter.com/search?q=%23MakerDAO",
                        "https://twitter.com/LozadaLuis12",
                        "https://twitter.com/MakerGrowth",
                        "https://t.co/KoXVINXOsc",
                        "https://twitter.com/scristobal94/status/1532111695753228297",
                        "https://t.co/MaR82IUkMB",
                        "https://t.co/MaR82IUkMB"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#69",
                    "likes": "3",
                    "time": "08/06/2022-18:17:00",
                    "content": "Excelente Jose, es grato ver como los medios se están haciendo eco estas ultimas sobre noticias relativas al protocolo y su stablecoin. Confio en que proximamente, en un futuro no tan lejano el protocolo tendrá el lugar que merece dentro del mainstream cripto y finalmente en el tradicional. Se estan generando muchas propuestas para lograrlo y algunas ya estan siendo probadas o implementadas, todo esta dado para Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#70",
                    "likes": "5",
                    "time": "09/06/2022-03:09:07",
                    "content": "Noticia fresca de hoy que nos trae el portal Benzinga, y es que Umee se ha asociado con MakerDAO para llevar al DAI a su ecosistema Cosmos. Umee es una plataforma DeFi que permite el comercio de apalancamiento cross-chain y yield staking que funciona bajo el ecosistema Cosmos Hub, una red de cadenas de bloques interconectadas y cuyo token principal es el AtomUSDT. Esta integración de monedas estables facilita la interoperabilidad entre los activos de Ethereum EUR/USD en Cosmos y viceversa. DAI fue seleccionado por Umee, como explica Brent Xu , fundador de Umee por la siguiente razón: “Elegimos DAI porque los resultados hablan por sí solos: es un producto duradero que ha sobrevivido a muchas recesiones del mercado\". Puedes consultar la nota completa en inglés en el siguiente link:    Benzinga    Umee And MakerDAO Initiate Dai Into The Cosmos Ecosystem - Benzinga Umee brings Dai (CRYPTO: DAI) into the Cosmos (CRYPTO: ATOM) Ecosystem, in partnership with MakerDAO (CRYPTO: MKR).      ",
                    "links": [
                        "https://www.benzinga.com/markets/cryptocurrency/22/06/27604020/umee-and-makerdao-initiate-dai-into-the-cosmos-ecosystem-promising-smooth-cross-chain-acce"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#71",
                    "likes": "5",
                    "time": "10/06/2022-03:04:51",
                    "content": "Para terminar el día, una noticia de hace unas horas, hoy por la tarde StellaSwap anunciaba el intercambio de stablecoins en Moonbeam. Les comparto el tweet donde pueden ver el anuncio antes mencionado ademas de los links para utilizar el Stake o el Bridge.   twitter.com    StellaSwap - (We're Hiring) @StellaSwap  Our basepool is live!🥳  Trade stables on@MoonbeamNetwork ☄️with low fees & earn dual rewards for staking💰  Our 4pool > $USDC + $USDT + $DAI + $FRAX 🪙 All you need is 1 coin & it'll auto-stake  Stake: app.stellaswap.com/farm Bridge: app.nomad.xyz #HarvestMoonbeam 👇 https://t.co/5RRsUkpshb   6:20 PM - 9 Jun 2022           75                25            ",
                    "links": [
                        "https://twitter.com/MoonbeamNetwork",
                        "https://twitter.com/StellaSwap/status/1534963713899384846",
                        "https://twitter.com/StellaSwap/status/1534963713899384846",
                        "https://twitter.com/StellaSwap/status/1534963713899384846",
                        "https://twitter.com/MoonbeamNetwork",
                        "https://app.stellaswap.com/farm",
                        "https://app.nomad.xyz/",
                        "https://twitter.com/search?q=%23HarvestMoonbeam",
                        "https://t.co/5RRsUkpshb",
                        "https://twitter.com/StellaSwap/status/1534963713899384846"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#72",
                    "likes": "8",
                    "time": "10/06/2022-19:19:48",
                    "content": "Una nueva bodega argentina, en éste caso Colomé de la Provincia de Salta, comenzó a comercializar sus vinos aceptando DAI como medio de pago. La adopción en Argentina no se detiene.    Titulares.ar – 4 May 22    una bodega salteña permite comprar vinos con DAI Así es Colomé, reconocida bodega salteña que comenzó a aceptar pagos con la stablecoin y otras criptomonedas en su tienda      ",
                    "links": [
                        "https://titulares.ar/una-bodega-saltena-permite-comprar-vinos-con-dai/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#73",
                    "likes": "7",
                    "time": "12/06/2022-05:18:34",
                    "content": "He aquí otra nueva reseña en español sobre el gran “endgame” o “plan final” de MakerDAO, una ambiciosa propuesta que tiene como objetivo mejorar la gobernanza y aprovechar el poder de las Finanzas Descentralizadas (DeFi) a fin de conducir a MakeDAO a un estado final predeterminado e inmutable mediante la creación de nuevas DAOs. En palabras de Rune Christensen:  “Los MetaDAO permiten una especialización profunda por parte de la fuerza laboral, la comunidad y el proceso de gobierno porque cada MetaDAO puede enfocarse en la especialización deseada, lo que les permite dedicar los recursos y el enfoque necesarios para especializarse adecuadamente y no distraerse con otras responsabilidades”.  Más información en el link:    Investing.com México    El \"plan final\" de MakerDAO pide DAOs especializadas y dice que el protocolo... El \"plan final\" de MakerDAO pide DAOs especializadas y dice que el protocolo se ve frenado por la complejidad      ",
                    "links": [
                        "https://mx.investing.com/news/cryptocurrency-news/el-plan-final-de-makerdao-pide-daos-especializadas-y-dice-que-el-protocolo-se-ve-frenado-por-la-complejidad-2365893"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#74",
                    "likes": "5",
                    "time": "13/06/2022-00:47:09",
                    "content": "Hora de inaugurar ese almacén de barrio que acepte DAI. Jaja. Qué maravilla, ché. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#75",
                    "likes": "3",
                    "time": "13/06/2022-15:16:30",
                    "content": "Sacando lo anecdotico que podría llegar a ser de hacerse realidad también seria todo un hito en la adopción y presencia en lo popular, tomando nota…ojo que no lo veo tan lejano, mas alla de los esfuerzos que se estan realizando para consolidar la posicion de Maker/DAI en el mainstream tradicional, por asi decirlo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#76",
                    "likes": "5",
                    "time": "13/06/2022-15:20:11",
                    "content": "Bueno nuevo plan, compramos pizzas en La Continental y acompañamos con unos vinos de este par de bodegas, lo shilleamos en redes para que vean a la comunidad consumiendo y apoyando todo lo que se comercialice en DAI. Tal vez sin querer queriendo logremos el efecto boca a boca y se esparza la aceptación en diversos comercios ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#77",
                    "likes": "5",
                    "time": "13/06/2022-15:37:04",
                    "content": "Excelente resumen esta noticia sobre Endgame, debo admitir cierta sorpresa de que la misma haya venido de un medio mexicano, se que existe una comunidad cripto en el país pero aun en un estado primigenio bastante dispersa. Una alegría saber que el protocolo esta empezando a resonar por esas latitudes y que interesa, espero que pronto podamos ver mas hermanos mexicanos sumarse a la comunidad. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#78",
                    "likes": "6",
                    "time": "13/06/2022-16:03:34",
                    "content": "Qué lindo ver todo esto que se está formando, más allá del bear market que estamos presenciando, las stables se están consolidando como un espacio de resguardo hacia la baja de ciertos activos, que hoy se encuentran en una burbuja de especulación. He aquí la enorme capacidad de esta DAO en permanecer en equilibrio mediante herramientas de distribución / descentralización de poderes. Sigo optimista por $DAI como el verdadero activo de reservas en días transitivos como estos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#79",
                    "likes": "6",
                    "time": "13/06/2022-20:57:02",
                    "content": "No, totalmente. Es cuestión de ir dando los primeros pasos. Que, como han demostrado las noticias que vienen compartiendo, es algo que está sucediendo. Quizás, como he dicho en otras intervenciones, lo que realmente hace falta es más educación. O educación más accesible para el público no especializado. Posiblemente, accesibilidad tecnológica también. Noob-friendly apps and such. Pero sospecho que, sobre todo en nuestras latitudes, por ósmosis o por fuerza, esa falta se irá subsanando. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#80",
                    "likes": "7",
                    "time": "13/06/2022-21:28:16",
                    "content": "Como comentamos siempre, mas allá de la cuestión tecnológica disruptiva, acá hay una necesidad real y concreta de la población de acceder herramientas para proteger si dinero contra la inflación, la devaluación y la perdida de poder adquisitivo, sumado a la desconfianza que hay en los bancos y los obstáculos para acceder al mercado cambiario. DAI soluciona todo eso. Falta muchísimo para que la adopción sea masiva, pero es exponencial como creció en los últimos tiempos, y en actividades comerciales que hasta hace poco era impensado. A nada de ver carteles de “aceptamos criptos” en almacenes de barrio y que alguien lo postee acá. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#81",
                    "likes": "5",
                    "time": "14/06/2022-03:07:21",
                    "content": "Totalmente de acuerdo @Marian, los tiempos que estamos viviendo hoy con una recesión económica a nivel global obligan a que las personas busquen los medios de proteger sus ahorros. Y como siempre lo hemos dicho, en el caso de América Latina esta realidad golpea aún mas fuerte; como suelen decir los economistas, cuando a Estados Unidos le da gripe a nosotros nos da pulmonía, y ya la primera potencia mundial está en la mayor inflación de sus últimos 40 años por la mala praxis de sus gobiernos de imprimir dinero fiat a mansalva sin ningún tipo de respaldo. Y como acertadamente lo mencionas, todavía estamos lejos de una adopción masiva de las criptomonedas, pero a mayor crisis mayor oportunidad, y tal parece que sol estamos viendo la punta del iceberg de este colapso del sistema financiero mundial. Pienso que el DAI se seguirá consolidando y será uno de los protagonistas de las reformas económicas que los gobiernos se verán obligados a ejecutar en los años venideros. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#82",
                    "likes": "7",
                    "time": "14/06/2022-03:29:21",
                    "content": "Les dejo por acá la traducción de un artículo publicado por el portal de Turkía Haber Baski el día de hoy 13 de Junio sobre acontecimientos sucedidos en las últimas horas relacionados con MakerDAO y Ethereum. Es un análisiis básico pero interesante dónde comentan y respaldan con cifras las notables diferencias entre DAI y Terra UST, y la fortaleza de MakerDAO como DeFi. Es muy importante como diversos medios a nivel mundial siguen resaltando noticias positivas sobre el ecosistema de MakerDAO a pesar de la situación actual que se vive en general en el mundo crypto  MakerDAO (Moneda MKR) vendió 65K Ethereum a $1,155 MakerDAO es una plataforma donde los inversores generan DAI, la criptomoneda algorítmica al bloquear Ethereum. Según el miembro de la comunidad, Mariano Conti, la plataforma está tratando de reducir la presión sobre DAI gastando entre $1,155 y $65,000. Ethereum se deprecia rápidamente El tamaño de las pérdidas de valor en el mercado de dinero criptográfico aumenta día a día. Las políticas de endurecimiento de la SEC y el aumento récord en los datos de inflación de EEUU ocasionan que los inversores se retiren de los instrumentos de capital de riesgo. Las acciones de muchas empresas que operan en el campo de la tecnología, especialmente en las bolsas de valores de EEUU, China y Europa, también están experimentando una depreciación. El precio de Ethereum se ha desplomado un 31% llegando a $1,250. El ETH, que se fluctuaba alrededor de los 1.800 dólares al inicio de la semana, se vio sacudido por el efecto de las duras ventas que comenzaron el fin de semana. Si bien el volumen de negociación aumentaba constantemente, el precio disminuía rápidamente. MakerDAO (MKR Coin) ¿está perdiendo o ganando con la venta de Ethereum? MakerDAO es una aplicación de finanzas descentralizadas (DeFi) financiada por algunas empresas gigantes con sede en EEUU. La gran mayoría de las DeFi, en particular Uniswap (UNI Coin) y PancakeSwap (CAKE Coin), en realidad contienen elementos centrales. MakerDAO es considerada una de las plataformas más centralizadas entre DeFis. La plataforma había recibido ayuda externa para evitar que el DAI perdiera su paridad con el dólar después de una corrección drástica observada en 2020. Es por eso que DAI se ha clasificado entre las monedas estables más confiables. Andreessen Horowitz se encuentra entre los partidarios de la plataforma. El hecho de que la plataforma comenzara a vender Ethereum muy por debajo del mercado dividió a los seguidores de las redes sociales. Algunos argumentan que la plataforma ha comenzado a vender con pérdidas para reducir el riesgo. Otros afirman que el precio de ETH puede caer por debajo de $1155 en poco tiempo, y que la plataforma en realidad predice esto, haciendo una operación rentable. MakerDAO Stablecoin DAI y la creciente capitalización de mercado La capitalización de mercado de DAI, una criptomoneda vinculada al dólar producida por MakerDAO, continúa aumentando. La capitalización de DAI, que era de 5900 millones de dólares hace tres meses, ahora alcanza los 6500 millones de dólares. Por otro lado, los valores de mercado en otras criptomonedas se están diluyendo rápidamente. Mientras que la capitalización de mercado de Bitcoin (BTC) ha caído por debajo de los 500.000 millones de dólares después de mucho tiempo, el valor de mercado de Ethereum ronda los 151.000 millones de dólares. Si bien la capitalización de mercado de USD Coin (USDC) y DAI está aumentando, la capitalización de mercado de Tether (USDT) ha disminuido rápidamente desde mediados de mayo. La capitalización de USDT que era de  83 mil millones el 9 de mayo, ahora se ha reducido a  72 mil millones, mientras que la capitalización de USDC, que era de  48 mil millones el 9 de mayo, ahora ha aumentado a  54 mil millones. ¿Sucederá otro colapso como el de Terra (LUNA)? La fuerte y prolongada depreciación del mercado podría significar el final del camino para las criptomonedas estables algorítmicas pororque mientras se producen, se basan en un algoritmo que se calcula sobre el valor de los activos en los que están respaldados. Existen algunas diferencias clave entre el dólar Terra (UST) y el dólar MKR DAI. En primer lugar, la UST contaba con LUNA, un activo de alcance muy reducido y no acompañado de grandes capitales a rescatar. DAI está vinculado a ETH. Ethereum es un activo que preocupa a muchos más inversores que LUNA. Además, los inversionistas recibieron UST equivalente al valor actual de LUNA que quemaron en la plataforma Terra. En la plataforma MakerDAO, los inversores pueden generar DAI hasta el 66 % del ETH que queman. Estos dos importantes criterios muestran que DAI no es tan débil como UST. Sin embargo, no se ha hecho ninguna declaración oficial sobre a qué nivel se rendirá DAI.  Link del artículo original publicado en turco:   Haber Baskı – 13 Jun 22    MakerDAO (MKR Coin) 1.155 Dolardan 65 Bin Ethereum Sattı MakerDAO (MKR Coin), yatırımcıların Ethereum kilitleyerek algoritmik kripto para birimi olan DAI’yi ürettikleri bir platform olarak hizmet veriyor. Topluluk üyesi mariano.eth’e göre platform 1.155 dolardan 65 bin dolarlık harcama yaparak…      ",
                    "links": [
                        "https://www.haberbaski.com/makerdao-mkr-coin-1-155-dolardan-65-bin-ethereum-satti/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.351190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#83",
                    "likes": "6",
                    "time": "15/06/2022-00:25:37",
                    "content": "Otra noticia sumamente importante también a destacar es las soluciones que está realizando Celsius con DAI para bajar su nivel de liquidación, haciendo que el sentimiento de miedo baje al menos un poco para nosotros, pero no deja de ser una preocupación hay que seguir al tanto todo esto  FVQJmuNXEAAT7Yc1452×876 72.3 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#84",
                    "likes": "6",
                    "time": "17/06/2022-06:28:25",
                    "content": "Hoy les traigo un vídeo publicado el día de ayer 16-06-2022 en la plataforma YouTube titulado: “¿QUÉ PASARÁ CON DAI? LA VERDAD SOBRE LA STABLECOIN DESCENTRALIZADA Nº 1”, creado por el canal llamado “Inverarg: Invertir en Bolsa y Criptomonedas”, el cual les recomiendo por su objetividad a la hora de abordar el análisis. Desde la debacle de TerraUST, el tema de la confianza en las monedas estables ha estado en la palestra del mundo crypto por parte de los inversores y tenedores de estos tokens. Al principio del vídeo, el creador de contenido esboza un resumen breve sobre la historia del DAI, MakerDAO y sus orígenes desde el 2014, así como su funcionamiento en cuanto al sistema de sobrecolateralización, el financiamiento a través de la tarifa de estabilidad, la tasa de ahorro DCR, el índice de liquidación, entre otros. Un importante aspecto fue que desmintió con cifras la polémica de que DAI no se puede considerar una moneda totalmente descentralizada ya que más del 50% del respaldo de DAI se encuentra en un USDC, una cripto centralizada; cuando la realidad es que a través de DAI Stats pudo constatar que este en realidad es alrededor del 29% actualmente. Otro tópico interesante abordado fue el Peg Stability Module (PSM), el cual es un exchange a través del cual puedes intercambiar tu DAI cuando su valor esté por debajo 1 dólar pudiendo protegerte cuando la criptomoneda pierde su paridad con la moneda estadounidense. Finalmente habló de los posibles riesgos que siempre están presentes en toda blockchain, y una cualidad que tiene MakerDAO la cual no está presente en otros proyectos, y es el llamado apagón de emergencia que suspendería todas las transacciones ante algún posible hackeo o vulnerabilidad del ecosistema. Puedes pulsar en el link para visualizar el vídeo.      ",
                    "links": [
                        "https://www.youtube.com/watch?v=PX6y8IkCPqc"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#85",
                    "likes": "6",
                    "time": "17/06/2022-18:32:39",
                    "content": "Muy bueno @FuchoCrypto! Creo que lo hablamos aquí, que ésto que pasó con UST y el bear market, pese a lo malo que fue y es para todo el ecosistema, significó que muchos ojos se posen y analicen a todas las stablecoins, y en particular a DAI por su carácter descentralizada, lo que no deja ser de ser una buena promoción, mas aún por el modo en que está respondiendo con solidez y sin pasar crisis de estabilidad del peg. No hay mejor publicidad que demostrar solvencia en momentos dificiles. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#86",
                    "likes": "4",
                    "time": "20/06/2022-04:13:06",
                    "content": "Que buen video @FuchoCrypto, me sirvió para entender varias cosas referentes a MakerDAO, lo explican de manera muy didáctica. Interesante lo que se menciona del PSM, es sin duda una muy buena opción para los ahorristas cuando el DAI baja su valor a menos del dolar norteamericano. Igualmente las medidas de seguridad de como proteger a la Dao ante un posible ataque. DAI y MakerDAO siguen aguando la tormenta general que hay en el universo crypto demostrando solvencia. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#87",
                    "likes": "8",
                    "time": "21/06/2022-13:53:11",
                    "content": "Varios portales especializados de habla hispana han receptado e informado la decisión de MakerDAO de desactivar los préstamos DAI en Aave que utilizan stETH como garantía a través del Módulo de Depósito Directo (D3M), para reducir así su exposición ante el posibile colapso de Celsius. Cabe tener presente que el D3M de Aave consta de 200 millones de DAI, de los cuales Celsius tomó prestados 100 millones. Algunos ejemplos de la repercusión en distintos medios:    Decrypt – 17 Jun 22    MakerDAO Vota Para Pausar Préstamos en Aave y Reducir Exposición a Celsius -... En un esfuerzo por reducir la exposición a Celsius, MakerDAO ha desactivado los préstamos DAI que utilizan stETH como garantía a través del Módulo de Depósito Directo.        Diario PB – 17 Jun 22    Maker corta el suministro de DAI de Aave mientras continúan las consecuencias... MakerDAO ha decidido eliminar Aave de su módulo de depósito directo como medida de protección ante la posibilidad de que Celsius se doble y haga caer el         La Criptomoneda – 16 Jun 22    MakerDAO vota para congelar los préstamos DAI directos de Aave - La Criptomoneda En medio de los problemas que rodean al criptobanco Celsius, MakerDAO, la organización detrás de la moneda estable DAI vinculada al dólar, votó el miércoles pasado para deshabilitar temporalmente el … Leer más      ",
                    "links": [
                        "https://decrypt.co/es/103160/makerdao-vota-para-pausar-prestamos-en-aave-y-reducir-exposicion-a-celsius",
                        "https://diariopb.com/maker-corta-el-suministro-de-dai-de-aave-mientras-continuan-las-consecuencias-de-celsius-criptomoneda/",
                        "https://diariopb.com/maker-corta-el-suministro-de-dai-de-aave-mientras-continuan-las-consecuencias-de-celsius-criptomoneda/",
                        "https://www.lacriptomoneda.info/portugues/makerdao-vota-para-congelar-los-prestamos-dai-directos-de-aave/",
                        "https://www.lacriptomoneda.info/portugues/makerdao-vota-para-congelar-los-prestamos-dai-directos-de-aave/",
                        "https://forum.makerdao.com/t/media-makerdao-cuts-off-its-aave-dai-direct-deposit-module/15944/7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#88",
                    "likes": "7",
                    "time": "23/06/2022-02:50:23",
                    "content": "Argentina nuevamente es noticia, hoy 22 de Junio el portal Beincrypto ha reseñado que el exchange Bybit ha lanzado una promoción especial con motivo a su incursión en este país del cono sur. La oferta que es exclusiva para usuarios argentinos ofrece un rendimiento anual (APY) del 22% sobre depósitos DAI en Ahorros Flexibles (limitado a 500 DAI) hasta el 11 de julio del presente año. Los rendimientos se depositarán automáticamente de manera diaria en la cuenta Earn del cliente, que podrá retirar el DAI invertido en cualquier momento. Gonzalo Lema, director de operaciones de Bybit para Argentina declaró al portal:  “Argentina se encuentra entre los principales países del mundo en criptoadopción y millones de personas tienen ya acceso a criptomonedas en el país.”  Un dato que me llamó la atención es que en el país se estima que entre 3% y 8% de su población maneja criptomonedas, eso significa una cifra de por lo menos 2 millones de personas.  “Los argentinos, si quieren una alternativa al peso, tienen el fácil acceso al dólar en el mercado libre y es en lo que confían, o eventualmente las stablecoins. Pero el argentino, por su historia económica, está más predispuesto a entender dónde fallan los sistemas monetarios tradicionales y a valorar las ventajas del BTC.”  Puedes consultar la nota completa en español haciendo clic en este link.  image725×224 24.3 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#89",
                    "likes": "5",
                    "time": "23/06/2022-02:53:54",
                    "content": "Interesante. A decir verdad, tengo mis reservas a la hora de confiarle mi metálico–tangible o no–, a quien sea. Pero me parece alentador de todas formas. Buena prensa, confiaremos, buenos resultados. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#90",
                    "likes": "3",
                    "time": "23/06/2022-02:54:11",
                    "content": "De locos ese retorno! No se mucho de esa empresa Bybit, es fiable? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#91",
                    "likes": "3",
                    "time": "23/06/2022-02:57:02",
                    "content": "    Sol_Invictus:  Interesante. A decir verdad, tengo mis reservas a la hora de confiarle mi metálico–tangible o no–, a quien sea. Pero me parece alentador de todas formas. Buena prensa, confiaremos, buenos resultados.   Me sucede igual. Si es muy bueno para ser verdad uno tiende a dudar. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#92",
                    "likes": "2",
                    "time": "23/06/2022-02:58:46",
                    "content": "Investigando a vuelo de pájaro en la red, leí esta información:  La plataforma Bybit , fundada en marzo del 2018, es uno de los exchanges de criptomonedas de mas rápido crecimiento, con más de 3 millones de usuarios registrados.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#93",
                    "likes": "4",
                    "time": "23/06/2022-15:58:35",
                    "content": "Me ganaste de mano Fucho querido pero que noticia no? Ideal para seguir exponiendo a DAI ante el publico masivo y especializado. En este caso mas allá del porcentaje de retorno que se promete creo que lo interesante y por demás relevante es la apuesta directa que se hace en nuestra stablecoin, excelente elección no? Implícitamente esto refuerza la posición que posee DAI no solo ante la comunidad cripto sino también ante diversos actores externos, como una stablecoin de confianza y por sobre todo segura ante los vaivanes del mercado propio y tradicional. Una alegría mas mi gente. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#94",
                    "likes": "5",
                    "time": "23/06/2022-16:07:46",
                    "content": "Sabes que no es la primera vez que leo/escucho esta posición, creo que viene arraigado en cuestiones profundas, inherentes a nuestra historia y cultura. Cuantas personas todavía siguen guardando sus ahorros ya sea en moneda nativa o extranjera debajo del colchón? Entiéndase bajo el dominio y los limites de su hogar, por una percepción de seguridad y control sobre sus activos tangibles; cuantos mas la depositan en plazos fijos? Bajo el mismo principio. El desafío a superar no solo esta en los planos didáctico y técnico, hay una vertical oculta, latente y que cobra fuerza cuando se habla de dinero. Por desconocimiento, por historia, por miedo o por una sumatoria de ellas lamentablemente sigue y seguirá siendo una practica habitual en países como el nuestro. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#95",
                    "likes": "3",
                    "time": "23/06/2022-16:12:29",
                    "content": "Es una de las históricas en el mundo cripto, mas allá de su característica centralizada, como todo proyecto que desembarca en nuevas tierras tiene o mas bien debe presentar una acción concreta para crear una base de clientes, hacerse de una posición, una cuota de mercado y solidificar su posición por estos lares mas allá de su reputación. He aquí su propuesta, claro con fecha y monto limites, sino seria insostenible o inestable. Todavía no puede leer los TyC de la promoción pero como siempre ante todo DYOR antes de si quiere mover o apostar un centavo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 0.9999999999999998
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#96",
                    "likes": "3",
                    "time": "23/06/2022-16:19:44",
                    "content": "Si me parecio bastante buena la promoción, tiene bastantes banderas verdes en mi opinión. Empezando por la tasa de interés, una tasa alta que llama la atención pero no tan alta que crea desconfianza (hemos visto retornos “garantizados” en el mundo cripto de >1,000%), una fecha de finalización de la oferta corta, un monto límite alcanzable para la mayoría, y la decisión de utilizar DAI que es la mejor moneda cripto estable en el mercado. Lastima que no puedo participar de la promoción por no ser Argentino. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#97",
                    "likes": "1",
                    "time": "23/06/2022-16:30:30",
                    "content": "Coincido tiene bastante a su favor y en su justa medida, próximamente cuando tenga un rato libre voy a chusmear en profundidad, me interesa saber de donde saldría ese porcentaje. En cuanto al problema de locación, tal vez con una VPN en el celu? Nunca lo probé en CEX pero intuyo que debería funcionar ya que al final son apps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#98",
                    "likes": "2",
                    "time": "24/06/2022-02:49:11",
                    "content": "Totalmente Nahueth, es una apuesta directa a DAI, nuestra stablecoin. Todos los días desde diversas partes del mundo se recibe una buena noticia, esta que comentábamos ayer del APY de Bybit, y hoy en el space de twitter realizado por la cuenta oficial de @MakerDAO_Lat también conocimos que el proyecto CryptoProde de igual forma apostó al DAI como su token oficial. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nicolas_Bernabe",
                    "index": "#99",
                    "likes": "5",
                    "time": "25/06/2022-16:23:08",
                    "content": "Creo que en este topico no lo tocamos, por las dudas lo menciono. Hace poco hubo una novedad de buenbit argentina. Se podra acceder a prestamos en nuars (stablecoin que sigue a la moneda argentina) con colateral a una stablecoin que siga al dolar. En este caso, la garantia seria dai, asi que mejor todavia . Si bien todavia no se difundió la tasa del prestamo existe la posibilidad de que las dai como garantia sigan generando interes. Tal vez para el mundo descentralizado no es lo iptimo pero para la adopcion es muy bueno. Esperemos que se sigan dando estas noticias.   productos.buenbit.com    Ya estoy en la lista de espera para pedir mi primer BUEN préstamo en pesos... ¿Vos ya te anotaste?      ",
                    "links": [
                        "https://productos.buenbit.com/prestamos"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#100",
                    "likes": "4",
                    "time": "25/06/2022-21:50:15",
                    "content": "    Sol_Invictus:  Interesante. A decir verdad, tengo mis reservas a la hora de confiarle mi metálico–tangible o no–, a quien sea. Pero me parece alentador de todas formas. Buena prensa, confiaremos, buenos resultados.   Coincido en eso y creo que esa visión es compartida para los usuarios mas “expertos” (por llamarle de alguna manera) que nos manejamos en los ecosistemas descentralizados. “Not your keys, not your coins” parece una frase cliché pero se vuelve real cuando vemos temblar a exchanges centralizados como está ocurriendo ahora mismo con Celsius… PERO (me encantan los “peros”), estas plataformas resultan la puerta de entrada al mundo cripto para la enorme mayoría de la gente, por la facilidad de uso, la posibilidad de comprar tokens con tarjeta o transferencia, por no tener que instalar extensiones, pagar fees, etc. etc. etc. No dejan de ser jugadores claves en el ecosistema, así que el rol de DAI en ésta noticia seguramente colabore a profundizar la adopción por parte de nuevos usuarios.     One_Pastrami:  Si me parecio bastante buena la promoción, tiene bastantes banderas verdes en mi opinión. Empezando por la tasa de interés, una tasa alta que llama la atención pero no tan alta que crea desconfianza (hemos visto retornos “garantizados” en el mundo cripto de >1,000%), una fecha de finalización de la oferta corta, un monto límite alcanzable para la mayoría, y la decisión de utilizar DAI que es la mejor moneda cripto estable en el mercado. Lastima que no puedo participar de la promoción por no ser Argentino.   Es probable (no lo se, lo asumo) que esa altísima tasa de interés esté subsidiada por la propia plataforma a modo de promoción. El hecho que sea por tiempo limitado y con tope de hasta 500 DAI me hace suponer eso. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#101",
                    "likes": "6",
                    "time": "25/06/2022-21:54:10",
                    "content": "Buenbit tuvo en el pasado un sistema de créditos y a través de la misma plataforma se podía cotizar la tasa al completar datos como el token colateralizado y el tiempo del prestamo. Veremos si vuelven a ofrecer esa posibilidad que es necesaria para dar transparencia y previsibilidad. Por ser una fintech regulada por organismos publicos, entiendo que será algo indispensable y obligatorio cumplir con ese tipo de practicas. Muy interesante eso que los DAI colateralizados para el prestamos sigan rindiendo interés. Y comparto que éste tipo de plataformas son una gran herramienta de adopción para nuevos usuarios. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#102",
                    "likes": "2",
                    "time": "25/06/2022-22:23:34",
                    "content": "Si seguramente es un costo de adquisicion de cliente alto pero que trae fondos y actividad a la plataforma y capaz en las proyecciones a la larga ese beneficio es mayor a esta inversion. Alguien del grupo participo? Que tal es el UI/UX de la plataforma? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#103",
                    "likes": "5",
                    "time": "26/06/2022-02:45:59",
                    "content": "Casualmente, hoy mismo pensaba un poco en esto. Desde otro ángulo, pero en esto al fin. Veo también que estamos ahí, a punto de cruzar esa barrera, y tiene que ver con esto que decís vos:     Marian:  estas plataformas resultan la puerta de entrada al mundo cripto para la enorme mayoría de la gente, por la facilidad de uso, la posibilidad de comprar tokens con tarjeta o transferencia, por no tener que instalar extensiones, pagar fees, etc. etc. etc.   Ahora, contame más… ¿pagar fees, eso ya está resuleto? ¿Ya somos gasless? Si es así, haceme enterar–porfavortelopido–porque lo que es yo… Hoy me pasó algo paradójico: no tenía gas para comprar más gas. Hasta que pude operar por un shift en los costos. (Igualmente me da un poco de buena adrenalina esperar a la actualización de los cargos por operación y ver si consigo mejor precio. Jaja. “Se divierten con tan poco.”) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#104",
                    "likes": "6",
                    "time": "26/06/2022-03:08:20",
                    "content": "Btw, @Marian: Felicitaciones por la reply cientoypico en el thread que nunca muere.    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#105",
                    "likes": "3",
                    "time": "27/06/2022-13:23:11",
                    "content": "Aquí estaremos en 10 años compartiendo noticias de DAI y Maker ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#106",
                    "likes": "4",
                    "time": "27/06/2022-20:02:27",
                    "content": "    Sol_Invictus:  Ahora, contame más… ¿pagar fees, eso ya está resuleto? ¿Ya somos gasless? Si es así, haceme enterar–porfavortelopido–porque lo que es yo…   Nono, quise decir que los exchange centralizados justamente resultan ser la puerta de entrada al mundo cripto, entre otras cosas, por no pagar fees. Luego entramos al mundo descentralizados y la cosa se complejiza un poco. Los fees nos van a acompañar para siempre, son el dique de contención para que los bots, spammers o hackers tengan que pensar dos veces antes de programar miles de operaciones por segundo y colapsen todo el sistema. También me divierte seguír el gas, entre mis favs del navegador tengo las webs de seguimiento del gwei en distintas plataformas, y obvio opero sólo cuando el gas está en el piso, pues argentino devaluado. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#107",
                    "likes": "7",
                    "time": "30/06/2022-09:23:37",
                    "content": "Complementando la información de Buenbit del compañero @Nicolas_Bernabe, cito la nota publicada por el portal “El economista”. El préstamo funciona de la siguiente manera: se dejan monedas estables DAI de garantía (que a su vez darán rendimientos) y se otorga un préstamo de un monto inferior a esas cripto de respaldo (80%). Esto permite que la tasa del préstamo sea mucho más barata ya que, en caso de que la deuda supere el 90% del respaldo, automáticamente se vende el respaldo y se cancela el crédito.  La tasa con la que saldrían a competir los préstamos de Buenbit será de 58% de TNA, con un Costo Financiero Total (CFT) cercano al 79% anual. Es una tasa muy competitiva considerando que un préstamo personal bancario tiene un CFT de entre 100% y 140%, según el cliente, mientras que en una fintech de créditos puede superar el 200%. El préstamo se recibe en nuARS, una stablecoin que sigue el valor del peso desarrollada por Num Finance y que funciona sobre la blockchain de Binance (BNB Chain).  Puedes consultar la nota completa en este link.  image760×205 12.2 KB  ",
                    "links": [
                        "https://eleconomista.com.ar/cryptos/ofreceran-prestamos-pesos-garantizados-stablecoins-n54326"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#108",
                    "likes": "3",
                    "time": "30/06/2022-15:12:37",
                    "content": "    Marian:  Nono, quise decir que los exchange centralizados justamente resultan ser la puerta de entrada al mundo cripto, entre otras cosas, por no pagar fees.   Mala lectura mía ahí, ché. Gracias por desarrollar.     Marian:  pues argentino devaluado.   Preach it!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#109",
                    "likes": "4",
                    "time": "30/06/2022-15:20:27",
                    "content": "Como siempre: paciencia con la newbie. Me hace pensar: ¿qué impacto tendrán esta clase de iniciativas en la regulación formal de este mercado particular? A priori, se me hace que al mismo tiempo en que nos encaminamos hacia niveles más altos en dupla aceptación/adopción, invariablemente marchamos hacia una total y formal regulación. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#110",
                    "likes": "6",
                    "time": "01/07/2022-01:01:25",
                    "content": "    Sol_Invictus:  se me hace que al mismo tiempo en que nos encaminamos hacia niveles más altos en dupla aceptación/adopción, invariablemente marchamos hacia una total y formal regulación.   Coincido contigo @Sol_Invictus, (pensamientos de un newbie también por acá) pero en mi opinión  parece que la masificación del uso de las criptomonedas está yendo de la mano con la regulación. El usuario que recién se incorpora al mundo cripto no suele  distinguir entre un exchange y una wallet fría, piensa que sus ahorros están seguros, por ejemplo, en Binance. Esta regulación también nos afecta y preocupa a quienes vivimos en países con regímenes autoritarios, por ejemplo donde vivo el gobierno aprobó una providencia dónde sólo se autoriza a menos de 5 exchanges para operar con criptomonedas, so pena a multas o acusaciones penales. Los Estados del mundo han decidido entrar en el juego, les aterra  ver como pierden la exclusividad que tenían de ser el ente emisor de la moneda que usan sus gobernados, y con ello el control social que eso les otorga; por eso al ver que las prohibiciones son inviables, entonces apuestan a la centralización y demás controles que van totalmente en contra del espíritu del mundo de las criptomonedas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#111",
                    "likes": "9",
                    "time": "04/07/2022-12:21:49",
                    "content": "Contexto: El sábado renunció el Ministro de Economía de Argentina por presiones de la vicepresidenta, que es quien realmente tiene el poder en nuestro país, y quiere imponer una agenda mas agresiva contra el sector privado. A su vez, en nuestro país tenemos un proyectado de alrededor de 80% de inflación anual con un “cepo al dólar”, lo que quiere decir que los ciudadanos no podemos acceder a divisas fuertes para protegernos de la devaluación de nuestra moneda. El resultado fue que el mismo sábado, en días y horas inhábiles del mercado formal de cambio, muchos pudieron acceder al dólar a través de stablecoins, siendo DAI una de las preferidas en el país, y así proteger sus ahorros y patrimonio contra la mas que segura devaluación del tipo de cambio formal que se producirá hoy lunes. Pudimos hacerlo un sábado desde nuestros celulares o computadoras, en otra época teníamos que haber aguardado al lunes para ir a una “cueva” (donde se venden dólares informales) y pagarlos un 15 o 20% mas caro. No me canso de repetirlo, las criptos y las stablecoin, jugando DAI un papel central en ésto en Argentina, nos dan una solución real y concreta a nuestra asfixiante realidad económica. No sé si en el primer mundo logran apreciar lo que ésta tecnología está haciendo por nuestras vidas y por nuestra libertad económica.    CriptoNoticias - Noticias de Bitcoin, Ethereum y criptomonedas – 3 Jul 22    En Argentina, el dólar cripto se dispara tras la renuncia del ministro de... Este sábado, Martín Guzmán renunció a su cargo y generó una demanda repentina de dólares, pero el mercado cambiario no abre hasta el lunes.      ",
                    "links": [
                        "https://www.criptonoticias.com/finanzas/argentina-dolar-cripto-dispara-renuncia-ministro-economia/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#112",
                    "likes": "5",
                    "time": "04/07/2022-16:14:54",
                    "content": "    Marian:  No me canso de repetirlo, las criptos y las stablecoin, jugando DAI un papel central en ésto en Argentina, nos dan una solución real y concreta a nuestra asfixiante realidad económica. No sé si en el primer mundo logran apreciar lo que ésta tecnología está haciendo por nuestras vidas y por nuestra libertad económica.   Tremendo, tienes mucha razon! No olviden mantener su DAI en wallet auto-custodia como Metamask / Exodus o en un “hardware” wallet como Ledger y Trezos para mayor seguridad. No es recomendable tener sus coins en los exchanges, ya hemos visto varios exchanges quebrados que se van con sus monedas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#113",
                    "likes": "3",
                    "time": "04/07/2022-18:50:01",
                    "content": "Supongo que mañana tendremos una idea más certera aún sobre el efecto de la renuncia (en los mercados). Hoy es 4 de Julio, entiendo que las cosas están funcionando a media máquina. Así que tenemos unas horas más de gracia, hasta mañana a las 10 de la mañana.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#114",
                    "likes": "6",
                    "time": "04/07/2022-21:31:52",
                    "content": "Una pena realmente como por intereses políticos siempre paga la población más vulnerable, incluso veía en Twitter como algunos “analistas” se burlaban de la decisión de los comerciantes de P2P en diferentes exchanges diciendo algo como “Que gracioso como los operadores de Binance P2P se creen casas de cambios reconocidas” “Bastante irónico como el mercado se manipula por beneficio de pocos” ¿será que algún día comprenderemos que el mercado en general se mueve por oferta y demanda?   twitter.com    Dr.Evav @drevax  Vean señores, vean a los niños Binance como salen corriendo a comprar USDT a $280. Totalmente asustados por el rumor, enfermos de especulación. En un país donde la gente se agarra a piñas por 100 pesos y con los DEGs del FMI recién girados.   5:13 PM - 3 Jul 2022           41                3            Lo único positivo que observo en esto es que la adopción es mucho más rápida en Argentina   twitter.com    Esteban Quito @Estebant5  Alberto y Cristina hicieron que el abuelo de casi 90 años de mi señora se haga una cuenta en Binance para comprar ahí USDT. Con eso te digo todo.   2:19 AM - 4 Jul 2022           440                43            En Venezuela sucedió algo parecido pero no existían muchos mercados P2P para obtener criptomonedas, ya que Tether aún no figuraba como máxima representación de una moneda estable por allá en 2015, estaba SurtBitcoin, AirTM y Localbitcoin, aunque este desastre ayudo a una adopción mucho más rápida (clandestinamente) aunque ya es cotidiano ver cómo la gente compra todo a través del P2P de Binance. Venezuela es el mayor país con en volumen de transferencia de Bitcoin, veremos si Argentina con esto que está sucediendo lo logrará pasar  IMG_20220704_1725121080×607 110 KB  Todos lo saben ya  DAI > USDT En conclusión, siempre resguardar la moneda local en la moneda de circulación más amplia del mundo que por supuesto es el dólar (aunque no nos sorprenda un giro repentino en un futuro próximo con el Yuan), lo que me daría curiosidad es que pasaría si en un futuro un colapso en la economía occidental con el Dólar tendrán un impacto tan grande en todas las naciones y en el sector financiero por completo, ya que la mayoría de los países occidentales tienen un préstamo en dólares, no es lo mismo que pierda valor una moneda local que mueva un sector pequeño como un país, a que sea prácticamente la moneda hegemónica del mundo.  Si de por sí, los países pagan su deudas imprimiendo más dinero local, no quisiera imaginar que pasaría si Estados Unidos imprime (nuevamente) mucho dinero pero para pagar su deuda. ",
                    "links": [
                        "https://twitter.com/drevax/status/1543644020819329026?s=20&t=sSb0uB9fXPZ4Fo1msBAsbA",
                        "https://twitter.com/drevax/status/1543644020819329026?s=20&t=sSb0uB9fXPZ4Fo1msBAsbA",
                        "https://twitter.com/drevax/status/1543644020819329026?s=20&t=sSb0uB9fXPZ4Fo1msBAsbA",
                        "https://twitter.com/Estebant5/status/1543781544942129152?s=20&t=sSb0uB9fXPZ4Fo1msBAsbA",
                        "https://twitter.com/Estebant5/status/1543781544942129152?s=20&t=sSb0uB9fXPZ4Fo1msBAsbA",
                        "https://twitter.com/Estebant5/status/1543781544942129152?s=20&t=sSb0uB9fXPZ4Fo1msBAsbA",
                        "https://twitter.com/Estebant5/status/1543781544942129152?s=20&t=sSb0uB9fXPZ4Fo1msBAsbA"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.55
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#115",
                    "likes": "4",
                    "time": "04/07/2022-21:35:51",
                    "content": "En otra noticia podemos tomar un respiro   twitter.com    Cryptos Alerting @AlertingCryptos  [ $BTC ] Bitcoin, [ $MKR ] Maker, [ $DAI ] Dai   Celsius pays down 143M in DAI loans since July 1  cointelegraph.com/news/celsius-p…   9:08 PM - 4 Jul 2022       Y además Celsius baja nuevamente su límite para ser liquidados posicionándose en 4967$, con esto podemos tener una mayor tranquilidad sabiendo que no liquidarán a la imagen de una empresa que apoya a las criptomonedas (al menos que pase algo extraordinario)  FW2kIyFaMAAgJ1n1104×2048 97.3 KB  ",
                    "links": [
                        "https://twitter.com/AlertingCryptos/status/1544065543489060864?s=20&t=sSb0uB9fXPZ4Fo1msBAsbA",
                        "https://twitter.com/AlertingCryptos/status/1544065543489060864?s=20&t=sSb0uB9fXPZ4Fo1msBAsbA",
                        "https://cointelegraph.com/news/celsius-pays-down-143m-in-dai-loans-since-july-1",
                        "https://twitter.com/AlertingCryptos/status/1544065543489060864?s=20&t=sSb0uB9fXPZ4Fo1msBAsbA"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#116",
                    "likes": "7",
                    "time": "04/07/2022-21:50:19",
                    "content": "    Moi:  incluso veía en Twitter como algunos “analistas” se burlaban de la decisión de los comerciantes de P2P en diferentes exchanges diciendo algo como “Que gracioso como los operadores de Binance P2P se creen casas de cambios reconocidas” “Bastante irónico como el mercado se manipula por beneficio de pocos”   Que se burlen e ironicen todo lo que quieran, la realidad es que quienes tenemos las herramientas y conocimientos financieros para el uso de criptos, podemos mantener el poder adquisitivo de nuestros ingresos y ahorros, y sufrir menos la desvalorización de nuestra moneda FIAT producto de los desmanejos gubernamentales de los que somos víctimas. Durante el fin de semana, la compra de stablecoins en Argentina creció entre 2 y 3 veces de su movimiento usual. Esa fue gente que pudo salvar sus ahorros un fin de semana. El desafío es “evangelizar” y ayudar a la adopción de la mayor cantidad de gente posible en el mundo cripto y enseñar sus beneficios, ya que todos tenemos el derecho de protegernos contra el robo que significa la brutal desvalorización de nuestras monedas FIAT, y las criptos son totalmente democratizadoras sobre eso, son para todos.    TronWeekly – 4 Jul 22    Stablecoin Purchases In Argentina Seem To Have Tripled Amidst Economic Crisis Investors in Argentina bought two to three times as many stablecoins over the weekend compared to the average, according to the country's crypto firms. This      ",
                    "links": [
                        "https://www.tronweekly.com/stablecoin-purchase-in-argentina-tripled/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#117",
                    "likes": "6",
                    "time": "05/07/2022-04:31:26",
                    "content": "    Moi:  En Venezuela sucedió algo parecido pero no existían muchos mercados P2P para obtener criptomonedas, ya que Tether aún no figuraba como máxima representación de una moneda estable por allá en 2015, estaba SurtBitcoin, AirTM y Localbitcoin, aunque este desastre ayudo a una adopción mucho más rápida (clandestinamente) aunque ya es cotidiano ver cómo la gente compra todo a través del P2P de Binance.   Así es @Moi, hay varias similitudes en lo económico en cuánto a la situación actual que atraviesa Argentina con la que atravesó Venezuela hace alrededor de un lustro, con la diferencia de que en aquel momento la adopción de las criptomomedas estaba en pañales, y ciertamente fue localbocoins (con todo y sus fallos en materia de seguridad) la plataforma más utilizada hasta que AirTM irrumpió en el mercado ya de manera más agresiva con un público objetivo enfocado a Venezuela. Como comentaba en el otro post, mis palabras de solidaridad para los argentinos que hoy ven como se les esfuman sus ahorros dentro del sistema económico tradicional. En América Latina somos privilegiados de contar con estas herramientas y usarlas para proteger nuestros ingresos y nuestro patrimonio, nos toca seguir concientizando con respecto al uso de criptomonedas como el DAI esperando que a la vuelta de unos pocos años seamos un colectivo mayoritario que sepa hacerle frente como sociedad a las erradas políticas económicas de nuestros gobiernos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Valen_Gayone",
                    "index": "#118",
                    "likes": "6",
                    "time": "05/07/2022-14:28:17",
                    "content": "    Marian:  Pudimos hacerlo un sábado desde nuestros celulares o computadoras, en otra época teníamos que haber aguardado al lunes para ir a una “cueva” (donde se venden dólares informales) y pagarlos un 15 o 20% mas caro. No me canso de repetirlo, las criptos y las stablecoin, jugando DAI un papel central en ésto en Argentina   Es tan cierto! las cripto hoy en día nos permiten manejarnos con un poco mas de libertad que hace un par de años atrás, meses incluso. Aunque lamentablemente no todos lo saben o tienen el acceso a ello… Impactante la situación de Argentina. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#119",
                    "likes": "9",
                    "time": "06/07/2022-04:58:23",
                    "content": "Y vuelvo como es costumbre a publicar el precio de liquidación para Celsius, donde prácticamente se denota el compromiso que tiene esta compañia a su reputación y da una buena imagen a la economía criptográfica  FW9QdETWIAA3qeA708×627 149 KB  Que panorama he podido denotar que es sumamente positivo, incluso las personas más pesimistas con el precio de BTC lo colocan en 15k ya que el Euro y el Dólar caso llegan a una igualdad de 1:1  IMG_20220706_0057241080×521 70.9 KB  Con esto indicaría que incluso con ese precio es casi imposible la liquidación de Celsius, ya con el respiro que hizo devolviendo unos 120M a el protocolo de DAI y bajando cada vez más su liquidez podemos ver una luz al final del túnel, aunque como siempre este mundo está lleno de sorpresas, hay que seguir al tanto todo esto ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#120",
                    "likes": "4",
                    "time": "06/07/2022-12:00:41",
                    "content": "Una buena noticia, lo que menos necesitamos ahora es el ruido y la falta de credibilidad en todo el sistema que generaría para el público en general la quiebra de una empresa tan grande. Sería un retroceso en el camino de la adopción, que tan golpeado viene últimamente. Gracias por los datos y la actualización de la situación. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#121",
                    "likes": "4",
                    "time": "07/07/2022-13:36:54",
                    "content": "Como comentamos hace unos días, la reciente crisis que sufrimos en Argentina el fin de semana con la renuncia del Ministro de Economía, que produjo una desvalorización importante de nuestra moneda FIAT, llevó a muchos argentinos a proteger sus ahorros el mismo fin de semana mediante la compra de stablecoins, siendo DAI una de las mas importantes aquí. Ésto no pasó desapercibido por la prensa, y en el día de hoy se publicó una nota en un diario económico donde analiza las distintas alternativas del llamado “dólar cripto” y cuales son las formas de adquirirlos. https://www.cronista.com/infotechnology/criptomonedas/dolar-cripto-cual-conviene-comprar-para-cubrirse-de-la-crisis-argentina/ Desde ya, DAI fue una de las stablecoins mencionadas:  image721×244 7.94 KB  Éstas crisis como las que estamos viviendo son una gran oportunidad para continuar promoviendo la adopción de DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#122",
                    "likes": "4",
                    "time": "07/07/2022-14:02:13",
                    "content": "Las noticias buenas continúan, ya Celsius tiene una liquidación de 0$ relacionado al precio de Bitcoin, ya realizó todos los pagos al protocolo de Maker, aunque tiene algunos préstamos pendientes con otras entidades, además no han habilitado el retiro a los usuarios pero este es un gran paso.  FXD--bFWQAIL6Ng1223×676 56 KB  Vamos progresando, el panorama ya no se ven tan oscuro como a principios del mes pasado ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#123",
                    "likes": "2",
                    "time": "07/07/2022-18:29:06",
                    "content": "Si bien había (hay) un FUD enorme después de los acontecimientos del ultimo mes en el ecosistema se hace evidente que todavía quedan algunos protocolos que respetan y salvaguardan no solo su reputación sino también la de sus asociados, en este caso siendo uno de los principales Maker. Hubiera sido catastrófico tanto a nivel mainstream como a nivel interno de nuestro querido protocolo que lo hubieran liquidado debido a los impagos, por suerte este no sucedio y como bien publico @Moi ya quedaron todo los impagos correspondientes saldados. Seguimos en tiempos tormentosos tanto interna como externamente pero estas situaciones limite nos muestran IMHO que Maker es altamente apreciado y respetado, mas allá de no tener una presencia continua y solida en el populum cripto. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#124",
                    "likes": "3",
                    "time": "07/07/2022-18:36:12",
                    "content": "Como habitante de este hermoso pais puedo comentar personal e indirectamente por allegados y conocidos que cripto nos ayuda en nuestro día a día, no solo a nivel económico. Si bien como comentas requiere un conocimiento (a distintos niveles) y una posición de cierto privilegio para acceder y poder ser utilizado, tiempos difíciles requieren esfuerzos de alto calibre, soluciones practicas e innovadoras y creo que ahí esta parte de la riqueza que nos ofrece DAI y el ecosistema.  Nuevamente mas allá del salvavidas o resguardo financiero, por suerte tenemos una comunidad presente y activa que aporta desde distintos lugares, colabora y construye, queda en nosotros hacer nuestra parte para que cada día sea mas accesible y entendible para el ciudadano de a pie. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#125",
                    "likes": "4",
                    "time": "07/07/2022-18:52:01",
                    "content": "    FuchoCrypto:  hay varias similitudes en lo económico en cuánto a la situación actual que atraviesa Argentina con la que atravesó Venezuela hace alrededor de un lustro   Goosebumps cada vez que leo o escucho comentarios por el estilo, no es la primera vez y lamentablemente no va a ser la ultima… Si bien nuestro sistema financiero IMHO ya no tiene solución en un panorama general, creo que gracias a DAI y diversas tecnologías cripto el argentino promedio puede aprovechar y resguardar lo que genera, incluso sacarle algun redito. Ahora como bien sabemos existen diversos mecanismos, plataformas y protocolos que nos ayudan en esta tarea de supervivencia financiera y gracias a Satoshi que existen porque sino estaríamos al horno con papas como decimos acá, seguramente en una situación por demás similar a la que pasaron en Venezuela como nos comentan con @Moi     FuchoCrypto:  mis palabras de solidaridad para los argentinos que hoy ven como se les esfuman sus ahorros dentro del sistema económico tradicional   Totalmente agradecido y realmente apreciamos sus palabras y buenas vibras, como sabrán acá siempre nos la rebuscamos para seguir adelante y que cada embate sistemático no nos lleve por delante.     FuchoCrypto:  En América Latina somos privilegiados de contar con estas herramientas y usarlas para proteger nuestros ingresos y nuestro patrimonio, nos toca seguir concientizando con respecto al uso de criptomonedas   Como siempre digo, veamos el lado positivo, estamos en una posición privilegiada donde podemos tener acceso al conocimiento necesario para utilizar este tipo de plataformas, nos queda aportar desde nuestras posiciones. Por suerte acá los espacios no faltan, mas bien, estan en continua expansión e innovación, todo gracias a los diversos miembros y comunidades que velan por la adopción mas allá de la filosofía y tecnología que hay detrás de cripto. #KeepBUIDLING ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#126",
                    "likes": "6",
                    "time": "10/07/2022-06:31:54",
                    "content": "Siempre hablamos de la necesidad de que DAI trascienda al mundo real. Esta vez una entidad financiera de más de 150 años dentro del sistema bancario tradicional. Se trata del banco del estado de Pensilvania, el Huntingdon Valley Bank quienes decidieron tomar un préstamo de USD $100 millones en DAI destinados a otorgar préstamos hipotecarios en inversiones inmobiliarias comerciales, financiación de la construcción garantizada por bienes inmuebles, deuda garantizada y crédito proporcionado a fondos de capital privado y clientes prestamistas; lo cual generaría un 3% de ganancias para MakerDAO. ¿Qué opinan? El link de la noticia aquí:    DiarioBitcoin – 7 Jul 22    Un banco de EEUU con más de 150 años tomará préstamos de MakerDAO en... MakerDAO aprobó una bóveda que permitirá al banco de Pensilvania Huntingdon Valley Bank tomar un préstamo de USD $100 millones en la stablecoin DAI.      ",
                    "links": [
                        "https://www.diariobitcoin.com/negocios/verticales/bancos-y-pagos-verticales/un-banco-de-eeuu-con-mas-de-150-anos-tomara-prestamos-de-makerdao-en-stablecoin-dai/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#127",
                    "likes": "4",
                    "time": "10/07/2022-09:50:01",
                    "content": "Aumento de operaciones MKRUSDT, tiene un aumento del 1158% en el número de operaciones en curso Transacciones totales anteriores: 50 Transacciones totales actuales: 579 Transacciones promedio: 47 Precio de mercado: 981.0 Compradores: 58% Vendedores: 42%  20220710_1511373600×1890 201 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#128",
                    "likes": "5",
                    "time": "10/07/2022-17:55:56",
                    "content": "Se que la propuesta se votó en MakerDAO con amplia mayoría, pero me perdí en el foro de que forma se evaluó la calidad crediticia de la cartera de préstamos off-chain que el banco ingresó como colateral del préstamo de DAI. Es un riesgo realmente si esa cartera de prestamos no es solvente, ya que se perdería la integridad de los colaterales, entonces, como se valuó en Maker la calidad crediticia de esa cartera? Y el riesgo de que alguna medida regulatoria le impida al banco devolver los DAI? Se que es paso importante y necesario para el crecimiento del protocolo en la economía real, pero me sigue generando dudas por el riesgo que implica todo ésto para Maker y en definitiva para la salud de DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#129",
                    "likes": "7",
                    "time": "12/07/2022-00:16:24",
                    "content": "    Marian:  Y el riesgo de que alguna medida regulatoria le impida al banco devolver los DAI? Se que es paso importante y necesario para el crecimiento del protocolo en la economía real, pero me sigue generando dudas por el riesgo que implica todo ésto para Maker y en definitiva para la salud de DAI.   Es cierto que existirían riesgos, yo estuve leyendo parte de un post sobre el tema pero es algo complicado para quienes manejamos lo básico. Se me ocurre que el gobierno de EEUU a través de la SEC pudiera imponer alguna regulación o algo así. También no entendí si el bano tendría algún trato preferencial o igial tendría que poner en garantía el 150% del monto del préstamo en colateral.    The Maker Forum – 15 Jun 22    Huntingdon Valley Bank (“HVB”) - RWA Collateral Onboarding Risk Assessment Huntingdon Valley Bank (“HVB”)  RWA Collateral Onboarding Risk Assessment  Legal Disclaimer: This communication is provided for information purposes only. This communication has been prepared based upon information, including market prices, data and...  Reading time: 38 mins 🕑 Likes: 44 ❤       ",
                    "links": [
                        "https://t.co/n5kn6udIly"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#130",
                    "likes": "5",
                    "time": "13/07/2022-13:45:20",
                    "content": "Ésta nota realiza un interesante análisis sobre como, pese al bear market y a la pérdida de market cap en todo el mundo cripto, MakerDAO sigue superando a Compound y continúa siendo el protocolo DeFi de prestamos mas importante del ecosistema.   Los depósitos generales en Compound cayeron de  13 mil millones a  3 mil millones en el último año, con préstamos pendientes negativos de $360 millones.   Los depósitos de MakerDAO cayeron de $10,8 mil millones a 1,8 mil millones, con  6,3 mil millones en deudas pendientes.   Entonces, la relación préstamo-valor (LTV) de Compound cayó el 12% en el último año, en tanto que MakerDAO aumentó el 343%.    ultcoin365.com    Maker DAO continúa superando a Compound por las razones que se enumeran a... The DeFi field has numerous serious competitors, ranging from DEXes like Uniswap and SushiSwap to NFT marketplaces like OpenSea and Magic Eden.    AAVE holds dominance in the lending category in term...      ",
                    "links": [
                        "https://ultcoin365.com/es/maker-dao-continues-to-outperform-compound-for-the-reasons-listed-below/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#131",
                    "likes": "10",
                    "time": "15/07/2022-08:53:17",
                    "content": "Les traigo este artículo que habla sobre un tema que siempre amerita debate por su importancia y es el punto en que las finanzas descentralizadas trascienden del mundo cripto para integrarse al mundo de la economía real, tomando como referencia a MakerDAO. Acá vale la pena preguntarse hacia dónde vamos en unos años? El mundo cripto se impondrá y desplazará a las finanzas centralizadas? o por el contrario, el hecho de que para integrarse al mundo económico real deberá ceder en algunos de sus principios como la descentralización? O evolucionaremos hacia un mundo híbrido con características de ambos sistemas?    Inversor Global – 11 Jul 22    El punto de inflexión entre el mundo “real” y el mundo cripto - Inversor Global Finanzas personales, economía, mercados y política. Inversor Global es el medio económico mas confiable de habla hispana.      ",
                    "links": [
                        "https://www.inversorglobal.com/2022/07/el-punto-de-inflexion-entre-el-mundo-real-y-el-mundo-cripto/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#132",
                    "likes": "4",
                    "time": "15/07/2022-14:22:34",
                    "content": "Celsius se declaro en bancarrota pero antes de hacerlo pagaron la deuda DAI que tenian en un BTC vault por que era una decision que hacia sentido economicamente por el tema del colateral que era mayor que la deuda. A pesar de esta noticia que valida la estructura de los vaults de MKR y que DeFi es el future, es una pena ver a otra plataforma CeFi caer en tan poco tiempo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#133",
                    "likes": "6",
                    "time": "15/07/2022-15:10:29",
                    "content": "Siempre e pensado que cripto será una especie de alternativa para las finanzas, una especie de puente de pagos. Con los NFT podemos olvidar las falsificaciones y realizar ventas de artículos límites o únicos anclados a un código. Con las nuevas aplicaciones Web3 podemos hacer todo con mayor comodidad. Las remesas o las dificultades para enviar dinero internacionalmente son cosas del pasado. Esos son los puntos que yo veo que tocará completamente las criptomonedas en el corto plazo, y sé que me faltarán muchos más, tengo un dicho que “cuando mis abuelos usen criptomonedas para comprar pan se que estamos en el tramo final” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#134",
                    "likes": "5",
                    "time": "15/07/2022-18:49:08",
                    "content": "    Joselyn:  Acá vale la pena preguntarse hacia dónde vamos en unos años? El mundo cripto se impondrá y desplazará a las finanzas centralizadas? o por el contrario, el hecho de que para integrarse al mundo económico real deberá ceder en algunos de sus principios como la descentralización? O evolucionaremos hacia un mundo híbrido con características de ambos sistemas?   Muy buen artículo! Con respecto a esas preguntas, yo veo un futuro donde la descentralización va a existir pero va a perder mucho terreno. Veo a los gobiernos regulando la actividad, algunos de ellos para restringirla (Europa y LATAM) y otros para dar lugar a que ingresen los grandes capitales financieros institucionales (creo que EEUU e Inglaterra van para ese lado). Justamente esos grandes capitales financieros institucionales hasta hoy no entraron fuerte en blockchain porque por cuestiones de compliance necesitan tener normas regulatorias previsibles en las que basarse para operar, no pueden operar hoy sin normal regulatorias. Eso creo que va atraer un crecimiento ENORME en el ecosistema. Pese a eso, no creo que la descentralización se acabe por completo, quienes quieran (querramos) seguir total o parcialmente en el anónimato y descentralización, seguirá existiendo el p2p y los protocolos full descentralizados sin KYC.  Al menos por un tiempo… Lo que si me genera muchas dudas (miedo?) es que va a pasar con los CBDC y si en algun momento los gobiernos eliminarán por completo la moneda papel y la única moneda de curso legal será alguna moneda digital emitida por éstos organismos. Si sucede eso se acabaría la moneda papel y con ello el p2p, y con ello la posibilidad de operar, ingresar y retirar activos mediante p2p en total anonimato y por fuera de toda regulación. A eso sí le tengo miedo porque llevaría a un control total de nuestros activos por parte de los gobiernos, y me parece que es lo que se viene en no mucho tiempo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#135",
                    "likes": "3",
                    "time": "15/07/2022-18:55:00",
                    "content": "Mas de 100.000 usuarios afectados, pobre gente. Es otra llamada de atención sobre donde dejamos nuestros activos, a veces las tasas de los CEX son atractivas con respecto a DeFi, y siempre pero siempre en todos los ordenes de las finanzas, si el retorno es mayor, el riesgo es mayor. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#136",
                    "likes": "6",
                    "time": "16/07/2022-00:14:04",
                    "content": "Estas tasas altas son un peligro porque atraen full a las personas, con un marketing mas o menos buenos y una industria sin tanto regulacion (como decir que eres un stablecoin o que tus fondos estan colateralizados y en verdad es bluff) pueden crecer muy rapidamente… Siempre es bueno preguntarse, de donde se esta generando el retorno? en DeFi es muy transparente todo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#137",
                    "likes": "3",
                    "time": "16/07/2022-02:17:59",
                    "content": "Cito lo que dijiste     Federact:  como decir que eres un stablecoin o que tus fondos estan colateralizados y en verdad es bluff   Me suena bastante a las estables que están saliendo últimamente en el mercado, ahora todas quieren ser decentralizadas, multicolateralizadas, quieren atraer al público con un APY con un % bastante alto, y simplemente dicen “bueno si de aquí al bullrun conseguimos bastante liquidez podremos solventar ese beneficio que estamos dando desde ahorita” y concuerdo contigo con que puede crecer rápidamente, pero como siempre ¿A que costo? Y cuando te das cuenta no tienen nada de decentralizado, La mayoría de la liquidez que usan los prestamistas centralizados lo utilizan para tradear o armar una especie de retorno más segura, pero como siempre, nunca dicen nada, para que luego venga el mercado bajista vengan los reguladores destapen todo y vean el desastre ocasionado. En DEFI se puede monitorear absolutamente TODO hasta lo más mínimo lo puedes monitorear eso es lo hermoso, y cuando las plataformas están administradas indirectamente por la comunidad se hace muchísimo mejor, siempre y cuando no hayan manipulaciones como las que hizo Do Kwon. Es simple como siempre lo he dicho cuando hay un líder corrupto nada sale bien, y las criptomonedas se utilizan para eliminar esos líderes corruptos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#138",
                    "likes": "3",
                    "time": "17/07/2022-16:34:59",
                    "content": "Tal parece ser que una empresa de préstamos privados debe 439 millones a Celsius, y volvemos con el discurso de descentralización visionaria > centralización “con expertos financieros” veremos si esta es la punta del Iceberg o si es final. Las empresas que menos escuchemos hablar seguramente son las que deben más dinero y para sorpresa de nadie, siempre paga el inversor pequeño    Bitcoin News – 17 Jul 22    Report: Equitiesfirst Named as ​​Mystery Debtor to Celsius, $439 Million Owed... Two sources familiar with the matter allege that the private lending platform that owes Celsius $439 Million is Equitiesfirst.  Est. reading time: 3 minutes       ",
                    "links": [
                        "https://news.bitcoin.com/report-equitiesfirst-named-as-mystery-debtor-to-celsius-439-million-owed-to-crypto-lender/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#139",
                    "likes": "5",
                    "time": "18/07/2022-15:07:36",
                    "content": "Cred es un protocolo de puntuación y evaluación crediticia automatizada de usuarios de DeFi, para lo cual analiza las transacciones y el comportamiento on-chain de una address ante Aave para evaluar la solvencia de esa cuenta ante la solicitud de un crédito. El protocolo comenzó a operar y a analizar la salud crediticia de las cuentas basándose en el comportamiento de las interacciones de las cuentas con Aave, y ahora planean ampliar su análisis de datos incorporando a Compound y MakerDAO. La nota completa:   Cointelegraph    Cred Protocol revela los resultados de su primer sistema de puntuación... Un mecanismo de puntuación de crédito descentralizado llamado Protocolo Cred está listo para expandirse a Compound y MakerDAO.      ",
                    "links": [
                        "https://es.cointelegraph.com/news/cred-protocol-unveils-its-first-decentralized-credit-scores"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#140",
                    "likes": "7",
                    "time": "18/07/2022-15:18:42",
                    "content": "Muy buena idea aprovechando la transparencia del blockchain para analizar el riesgo crediticio del wallet prestante. Creo que tiene mucho potencial! Hay varias temas importantes que analizar, como que un wallet puede transferirse (o ser robado) de una persona a otra sin un cambio oficial en el blockchain y, wallets que trataran de jugar el juego (portandose bien hasta recibir el prestamo y luego chao) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#141",
                    "likes": "10",
                    "time": "19/07/2022-19:23:10",
                    "content": "Hace unos días @Nicolas_Bernabe adelantó la noticia y @FuchoCrypto la complementó, y ahora ya se hizo realidad, ya estando todos los datos financieros para evaluarla. Buenbit, un exchange argentino, lanzó la posibilidad de colaterlizar DAI para solicitar préstamos en nuARS, una estable con peg en el Peso Argentino. Se pueden solicitar hasta un millón de pesos argentinos (hoy alrededor de US$ 3.400.-), y mientras tanto los DAI dejados en garantía rinden a la tasa que ofrece el exchange, hoy un 5% de APY. El prestamos no tiene plazo ni cuotas, se devuelve cuando se quiere o puede mediante devolución total o parcial.    productos.buenbit.com    Buenbit: invertí tus criptomonedas desde Argentina Comprá, vendé e invertí tus criptomonedas para que generen ganancias diarias 🚀🪙. Depositá tus BTC, ETH, DAI a Buenbit y hacé que trabajen para vos.      La plataforma ofrece un simulador de prestamos:   calculadora-prestamos.buenbit.com   Simulá tu préstamo Simulá tu préstamo con la calculadora de Buenbit      Hice una prueba, y para retirar el máximo de 1 millón de pesos (cerca de US$ 3.400), a 30 días, para lo cual hay que dejar 4.200 DAI en garantía. Los DAI continúan rindiendo al 5% y la tasa del prestamos en nuARS es de casi el 52% anual de TNA y 68% de Tasa Efectiva Anual (la inflación anual de Argentina se prevee que sea bastante mayor). La relación entre el préstamos y la garantía es del 80%, y el umbral de liquidación está en el 90%.  image1248×564 50.3 KB   image1236×549 31.5 KB   image1248×596 60 KB  Así lo receptaron algunos medios de Argentina e internacionales.    https://www.iproup.com/economia-digital/32882-buenbit-la-exchange-lanza-prestamo...    Este exchange lanza préstamos en criptomonedas que mantienen \"paridad con el... Buenbit presenta nuevas herramientas de inversión entre las que se destaca NuARS, la stablecoin anclada al valor del peso. Todos los detalles         markets.businessinsider.com – 18 Jul 22    Argentinian Exchange Buenbit Launches Crypto Loans, Plans New Funding After... Users of the platform will be able to withdraw up to $3,333 in nuARS, a stablecoin tied to the Argentinian peso, using MakerDAO’s DAI as collateral.         CoinShots – 19 Jul 22    Argentinian Exchange Launches Crypto Loans, Plans New Funding After Layoffs Users of the platform will be able to withdraw up to $3,333 in nuARS, a stablecoin tied to the Argentinian peso, using MakerDAO’s DAI as collateral.      Una muy buena noticia, ya que es una posibilidad mas de adopción de DAI, ahora como medio para solicitar un préstamo en Pesos Argentinos sin la necesidad de desprenderse de los DAI, lo que abre la posibilidad de uso tanto para quien precise realizar un gasto y quiera mantener sus DAI, como para quien vea la posibilidad de realizar un negocio financiero jugando con la inflación y desvalorización de nuestra moneda. ",
                    "links": [
                        "https://productos.buenbit.com/prestamos",
                        "https://calculadora-prestamos.buenbit.com/",
                        "https://calculadora-prestamos.buenbit.com/",
                        "https://www.iproup.com/economia-digital/32882-buenbit-la-exchange-lanza-prestamos-y-recibe-stablecoins-nuars",
                        "https://www.iproup.com/economia-digital/32882-buenbit-la-exchange-lanza-prestamos-y-recibe-stablecoins-nuars",
                        "https://markets.businessinsider.com/news/currencies/argentinian-exchange-buenbit-launches-crypto-loans-plans-new-funding-after-layoffs-1031595099",
                        "https://markets.businessinsider.com/news/currencies/argentinian-exchange-buenbit-launches-crypto-loans-plans-new-funding-after-layoffs-1031595099",
                        "https://coinshots.com/news/argentinian-exchange-buenbit-launches-crypto-loans-plans-new-funding-after-layoffs",
                        "https://coinshots.com/news/argentinian-exchange-buenbit-launches-crypto-loans-plans-new-funding-after-layoffs"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3939393939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#142",
                    "likes": "5",
                    "time": "19/07/2022-20:56:06",
                    "content": "Parece que tambien se puede pedir prestado PEN (pesos peruanos), y MXN (pesos mexicanos) Buenbit tiene una taza de USDC interesante del 11%, seria un negociazo pedir prestado ARS en contra del colateral de Dai y luego cambiarlo a USDC para aprovechar ese apy, si luego sacan VES otro negociazo interesante, pero tambien si recargas la tarjeta de Buenbit con esos ARS y pagas con ella te dan un 2% de cash back, varias formas de sacarle provecho.  Cap1127×206 34.4 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#143",
                    "likes": "3",
                    "time": "20/07/2022-15:54:01",
                    "content": "Esta buenisimo esto. Hay mucho que analizar, esta increible la idea de utilizar DAI como una especie de Vault para crear una moneda estable local. Creo que podria ser un tema separado por lo grande que puede ser esa oportunidad. Las tasas estan bastante altas, hay transparencia de donde se estan generando esos ingresos? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#144",
                    "likes": "3",
                    "time": "21/07/2022-12:29:27",
                    "content": "No hay transparencia ni siquiera información sobre eso, es un exchange centralizado. Como siempre decimos, éstas plataformas son vías de ingreso de adopción de nuevos usuarios novatos, y tomándolo así, es una gran oportunidad para que crezca la adopción de DAI, ya que por el momento es la unica stablecoin que permite solicitar esos créditos en Buenbit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#145",
                    "likes": "5",
                    "time": "22/07/2022-01:17:47",
                    "content": "    Marian:  Una muy buena noticia, ya que es una posibilidad mas de adopción de DAI, ahora como medio para solicitar un préstamo en Pesos Argentinos sin la necesidad de desprenderse de los DAI, lo que abre la posibilidad de uso tanto para quien precise realizar un gasto y quiera mantener sus DAI, como para quien vea la posibilidad de realizar un negocio financiero jugando con la inflación y desvalorización de nuestra moneda.   Interesante lo que dices @Marian, y eso de jugar con la disparidades de la moneda local en contra de una moneda dura en búsqueda de beneficios no es nuevo. En Venezuela como entre uno o dos años antes de estallar la estanflación cuando aún las criptomonedas apenas se estaban asomando al panorama, mucha gente, desde usuarios comunes hasta pequeños y medianos comerciantes se dedicaban a pedir préstamos simultáneos en varios bancos, se aprovechaban de que las más de 20 entidades bancarias tenían las bases de datos obsoletas y no estaban entrelazadas entre ellas. Así entonces pedían créditos de remodelación de viviendas, pequeños emprendimientos, para explotación o cultivo de tierras, y muchos otros rubros más que tenían tarifas bajas de impuestos, y luego a sabiendas que esos bolívares (moneda local) se estaban devaluando a velocidades insólitas, apenas recibían los créditos en vez de usarlos para el fin autorizado, los cambiaban a dólares USD en físico, y en apenas en 3 meses quedaban pagando una mensualidad simbólica en intereses en moneda local. Todo eso prácticamente destruyó la capacidad crediticia de los bancos tanto públicos como privados hasta la actualidad dónde el encaje bancario es casi nulo cercano al 95%, y formó un entramado de corrupción brutal dónde por ejemplo algunos empelados bancarios encargados de aprobar los créditos a sabiendas de lo que venía, reclutaban a amigos y familiares para hacer dichas solicitudes de créditos bancarios masivos a cambio de un porcentaje. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#146",
                    "likes": "3",
                    "time": "22/07/2022-19:22:25",
                    "content": "Lo que cuentas me suena tan familiar en Argentina. Aquí a eso le llamamos “rulo”, hoy existen varios. Por ejemplo el mas popular, quienes pueden comprar dólares al valor oficial irreal, les permiten comprar solo US$ 200 al mes a 223 pesos, es decir 44.600 pesos en total, luego venderlos en la calle o comprar alguna stablecoin con esos dólares y venderlas a 327 pesos, un total de  65.400 pesos,  haciéndose una diferencia de 20.800 pesos, es decir alrededor de US$ 70 en cuestión de minutos. Pequeñas cosas que hacen quienes cierta educación financiera para hacerse una diferencia cada mes. No es lo ideal vivir así, pero es lo que nos toca, y tener cierta educación financiera y acceso a las criptos nos permiten soportar la cuestión de una mejor manera. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#147",
                    "likes": "6",
                    "time": "24/07/2022-03:26:21",
                    "content": "    Joselyn:  Así entonces pedían créditos de remodelación de viviendas, pequeños emprendimientos, para explotación o cultivo de tierras, y muchos otros rubros más que tenían tarifas bajas de impuestos, y luego a sabiendas que esos bolívares (moneda local) se estaban devaluando a velocidades insólitas, apenas recibían los créditos en vez de usarlos para el fin autorizado, los cambiaban a dólares USD en físico, y en apenas en 3 meses quedaban pagando una mensualidad simbólica en intereses en moneda local.   Tal cual @Joselyn, de hecho yo fui testigo con el caso de una prima quien pidió un crédito para agricultura; fue de las pocas personas que lo utilizó correctamente, una vez que finalizó el “año muerto” (así le decían a un beneficio crediticio de los bancos públicos en el cual las cuotas del préstamo y los intereses empezaban a ser cobradas a partir del mes número trece). Total que una vez transcurrido el año, se dirigió al banco que le otorgó el crédito para comenzar a pagar las mensualidades, resulta que el banco ya no existía pues había sido absorbido por otro, se dirigió a diferentes bancos del sector público y finalmente al Instituto de Tierras, y en ninguno le supieron dar razón, la respuesta de uno de los funcionarios fue algo así: “Nadie paga esos créditos”. Entonces imagínense, no hay retroalimentación a fin de que el programa se mantuviese, esos créditos se convirtieron en un “regalo”, y unido esto a la acelerada inflación, un programa que puso haberse convertido en autosustentable, pues sencillamente desapreció por la incompetencia y la corrupción.     Marian:  Por ejemplo el mas popular, quienes pueden comprar dólares al valor oficial irreal, les permiten comprar solo US$ 200 al mes a 223 pesos, es decir 44.600 pesos en total, luego venderlos en la calle o comprar alguna stablecoin con esos dólares y venderlas a 327 pesos, un total de 65.400 pesos, haciéndose una diferencia de 20.800 pesos, es decir alrededor de US$ 70 en cuestión de minutos.   Interesante y vivo ejemplo @Marian, y a pesar de que estos esquemas son insostenibles aquí se mantuvo por mucho tiempo gracias a los años en que los precios del barril de petróleo estuvieron altos. La diferencia era que asignaban los cupos anuales en vez de mensuales, durante los años 2005 al 2007 cada venezolano disponía de un total de 8000 USD anuales, distribuidos en  5000 USD de “cupo viajero” que era destinado al turista que solo podía usarlo fuera del país, y 3000 USD de “cupo electrónico” para ser usados dentro del país, y en una época dónde no existía el bitcoin, el destino de ese dinero solía ser pasarelas de pago como Paypal. Con los años se fue reduciendo hasta el 2014, cuyo cupo final fue alrededor de $800 para viajeros y $300 electrónicos, hasta el 2015 que desapareció por completo. Tal como dices, no es lo ideal pero a mucha gente le tocó adaptarse al sistema; y una vez que llegó la crisis y se volvió insostenible, las personas comenzaron a mirar hacia ese salvavidas que significó la aparición de las criptomonedas ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#148",
                    "likes": "4",
                    "time": "24/07/2022-21:48:35",
                    "content": "Ya llegó a los medios especializados los planes de MakerDAO de expandir DAI fuera de Ethereum mediante el llamado “Canonical DAI” que se emite en Ethereum cuando se utiliza el bridge oficial, tal como hoy está funcionando en Arbitrum y Optimism.    CriptoNoticias - Noticias de Bitcoin, Ethereum y criptomonedas – 20 Jul 22    DAI tiene planes de expansión fuera de Ethereum El objetivo es crear puentes entre cadenas manejados por MakerDAO, organización detrás de DAI.      ",
                    "links": [
                        "https://www.criptonoticias.com/tecnologia/dai-tiene-planes-expansion-fuera-ethereum/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#149",
                    "likes": "8",
                    "time": "02/08/2022-12:48:05",
                    "content": "Como algunos se habrán enterado, sino éste posteo les servirá para ello, está en votación en MakerDAO en éste momento una propuesta realizada por SocGen (Société Générale), uno de los bancos mas importantes de Francia, para solicitar un préstamo de 20 millones de DAI, dejándo como colateral un bono corporativo que el banco emitió en Ethereum y que a su vez están respaldados por créditos hipotecarios con vencimiento en 2025, y por un valor de 40 millones de euros. Para quien le interese conocer mas detalles de la propuesta y la votación on-chain: https://vote.makerdao.com/executive/template-executive-vote-onboarding-real-world-asset-vaults-july-29-2022#proposal-detail Y lógicamente ésta noticia fue tomada por los medios especializados, aquí un ejemplo de uno de habla hispana:    Criptotendencias - Noticias de bitcoin, criptomonedas y blockchain – 2 Oct 21    El banco SocGen (Société Générale) de Francia quiere que MakerDAO acepte sus... Según una publicación en el foro de MakerDAO, Société Générale, uno de los tres bancos más grandes de Francia, ha      ",
                    "links": [
                        "https://www.criptotendencias.com/actualidad/socgen-quiere-pedir-prestados-20-millones-de-dai-en-makerdao-utilizando-bonos-tokenizados-como-garantia/",
                        "https://www.criptotendencias.com/actualidad/socgen-quiere-pedir-prestados-20-millones-de-dai-en-makerdao-utilizando-bonos-tokenizados-como-garantia/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#150",
                    "likes": "2",
                    "time": "02/08/2022-14:39:10",
                    "content": "Que interesante esta propuesta! Los dos que estan la propuesta estan buenisimo, el de HVBank es el mas grande. Seria un prestamo de 100M DAI, el RWA de mayor monto hasta el momento. Creo que ambos deals tienen diferentes perfiles, y eso me gusta mucho ya que diversificamos el riesgo y creamos retornos no relacionados. Veremos que pasa… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#151",
                    "likes": "1",
                    "time": "02/08/2022-22:39:42",
                    "content": "Nosotros somos la viva imagen de descentralización y algunos no apoyan esta función de ser prestamistas a Bancos tradicionales ya que nos quitan esa imagen, pero lo que no se dan cuenta es que esos préstamos hacen que el banco pase a nuestra merced, los RWA son el futuro criptográfico y nosotros nos estamos adelantando a ello. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#152",
                    "likes": "4",
                    "time": "05/08/2022-20:18:56",
                    "content": "Nos guste o no, la colaboración entre los protocolos Defi y las instituciones serán cada vez más frecuentes. Esto genera reconocimiento por ambas partes, no como enemigos, como aliados en una lucha conjunta del bien común (si eso existe). Por supuesto, esto puede generar dudas sobre el objetivo planteado que era la descentralización (eliminar al tercero de confianza). Pero seamos honestos, el dinero institucional es el que alimenta actualmente el mercado cripto, incluso no hubiésemos tenido ese bull run sin ellos. Por ahora queda es construir, productos, servicios, relaciones y mucho más por los años por venir. Estamos en el mejor momento para estar en la industria cripto ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#153",
                    "likes": "7",
                    "time": "07/08/2022-05:15:15",
                    "content": "MakerDAO sigue señalando el camino y siendo punto de referencia para futuros proyectos. GHO es una nueva moneda estable sobrecolateralizada de AAVE.  La propuesta de GHO es bastante sencilla. La stablecoin busca ser una moneda descentralizada y sobrecolateralizada, respaldada por un «conjunto diversificado de criptoactivos» y vinculada al dólar estadounidense. Esta es la misma propuesta que podemos ver en DAI de MakerDAO, lo que resulta positivo, porque este sistema ha mostrado ser capaz de crear una stablecoin con garantías. Esto gracias a que la creación de GHO está directamente ligada a vaults cripto-sobrecolateralizados que se asientan sobre el valor de criptos que sirven de garantías aprobadas. Así, cada posición es independiente y permite al usuario de un vault pedir un préstamo en GHO, donde su cripto es comprometida como garantía por el tiempo que desee. En caso de problemas, como una caía de valor de las criptomonedas de garantía, el sistema siempre responderá de forma certera para mantener la estabilidad del sistema, manteniendo o liquidando posiciones, según su valor de colateralización. Al final, el préstamo es devuelto con los interés necesarios y el ciclo de creación se cierra con GHO, que se quema. Una garantía devuelta e intereses ganados para los que participaron.     Noticias Blockchain | Observatorio Blockchain – 4 Aug 22    ¿Qué es GHO? la nueva stablecoin sobrecolateralizada de AAVE GHO, la nueva stablecoin cripto sobrecolateralizada de AAVE, contará con soporte de múltiples criptomonedas, al estilo de DAI en MakerDAO.      ",
                    "links": [
                        "https://observatorioblockchain.com/stablecoin/que-es-gho-la-nueva-stablecoin-sobrecolateralizada-de-aave/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#154",
                    "likes": "6",
                    "time": "07/08/2022-10:03:25",
                    "content": "Es bueno verlo.  La tasa de nuevos depósitos en la estafa piramidal de contratos inteligentes Meta Force comenzó a caer el 1 de agosto, el día en que la SEC acusó a su fundador, Lado Okhotnikov, de fraude.  En sus primeras cinco semanas, Meta Force procesó $40 millones en depósitos DAI. See here  Los esquemas piramidales de contratos inteligentes como Meta Force no se pueden detener ya que están construidos en la cadena de bloques. Pero es posible que pueda ralentizarlos atacando la reputación. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#155",
                    "likes": "7",
                    "time": "08/08/2022-02:12:56",
                    "content": "    Marian:  Y lógicamente ésta noticia fue tomada por los medios especializados, aquí un ejemplo de uno de habla hispana:    Soc-Gen820×402 34.2 KB  Fuente  SocGen transferiría la propiedad de los tokens OFH a SG – Forge, quien luego depositaría los tokens en Maker y pediría prestado DAI contra ellos. SG – Forge cambiaría el DAI por USD y prestaría esos USD a SocGen.  Me da la impresión que pudiéramos estar en presencia de ese tipo de noticias que causan un punto de inflexión, MakerDAO podría estar haciendo historia si se aprueba la propuesta de Société Générale; pienso que no se debería de dejar pasar la oportunidad, lo contrario sería cerrarse, no veo en que pueda estar amenazada la descentralización de la DAO como han señalado algunos detractores.     Moi:  Nosotros somos la viva imagen de descentralización y algunos no apoyan esta función de ser prestamistas a Bancos tradicionales ya que nos quitan esa imagen, pero lo que no se dan cuenta es que esos préstamos hacen que el banco pase a nuestra merced, los RWA son el futuro criptográfico y nosotros nos estamos adelantando a ello.   Exactamente @Moi, has dado en el clavo. En este caso podríamos decir que son los bancos tradicionales los que están adaptándose a las condiciones de MakerDAO y no al contrario. Y tal como lo dice la reseña, es un experimento que de llegar a funcionar y dar los beneficios esperados, sería algo muy significativo, como un antes y un después de la DAO, podría ser la puerta que abra la integración de las DeFi al mundo real, siendo MakerDAO una vez más la pionera. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#156",
                    "likes": "5",
                    "time": "08/08/2022-19:12:22",
                    "content": "MakerDAO continúa primero entre los protocolos de Ethereum con mas TVL, con un total de 8,78b de dólares, lo que representa un 21,91% de todo el TVL de Ethereum de 40,07b. En la última semana aumentó un 4,5% y en el último mes aumentó un 16%. Lido Finance aumentó un 56% en el último mes y se acerca en TVL a MakerDAO, aun con una diferencia de casi 1,2b. Fuente: Ethereum TVL - DefiLlama  image1313×616 129 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#157",
                    "likes": "6",
                    "time": "20/08/2022-03:41:42",
                    "content": "No se si les sucede pero últimamente todas las noticias que me salen en las sugerencias de los buscadores sobre DAI y MakerDAO son negativas y alarmistas. Y así vemos titulares como: “DAI podría perder paridad con el dólar debido a Tornado Cash”, “Otra stablecoin podría seguir los pasos de UST y perder su paridad con el dólar: ¿de cuál se trata?”, “Preocupante: ¿un dólar digital podría perder su “estabilidad” por la sanción contra Tornado Cash?”, y como estos muchos más. Yo me pregunto si desvincular definitivamente al DAI del USDC por todo este brollo con Tornado Cash, Circle y el departamento del tesoro de EEUU, podría hacer mermar esta ola mediática negativa y haría respirar tranquilo a MakerDAO? Que publicaciones dentro del foro me recomiendan para empaparme de todo este tema que ha dado tanto de qué hablar? Es tan delicada la situación como la pintan?    BeInCrypto – 12 Aug 22    ¿DAI podría perder paridad con el dólar debido a Tornado Cash? El fundador de MakerDAO quiere disminuir la exposición de DAI a USDC dados los pasos que Circle ha tomado con respecto a Tornado Cash.  Est. reading time: 2 minutos          https://www.iproup.com/economia-digital/33579-stablecoins-por-que-dai-podria-per...    Otra stablecoin podría seguir los pasos de UST y perder su paridad con el... El escandalo con Tornado Cash salpica a todo el ecosistema y una moneda estable en particular se encuentra en el ojo de la tormenta. ¿Por qué?         https://www.iproup.com/economia-digital/33578-dai-la-criptomoneda-en-apuros-por-...    Preocupante: ¿un dólar digital podría perder su \"estabilidad\" por la sanción... El CEO Rune Christensen admite que la elección de quitar sus fondos de su stablecoin podría hacer que el precio del DAI pierda su paridad con el dólar      ",
                    "links": [
                        "https://es.beincrypto.com/dai-podria-perder-paridad-dolar-debido-tornado-cash/",
                        "https://www.iproup.com/economia-digital/33579-stablecoins-por-que-dai-podria-perder-su-paridad-con-el-dolar",
                        "https://www.iproup.com/economia-digital/33579-stablecoins-por-que-dai-podria-perder-su-paridad-con-el-dolar",
                        "https://www.iproup.com/economia-digital/33578-dai-la-criptomoneda-en-apuros-por-la-situacion-de-tornado-cash",
                        "https://www.iproup.com/economia-digital/33578-dai-la-criptomoneda-en-apuros-por-la-situacion-de-tornado-cash"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#158",
                    "likes": "5",
                    "time": "20/08/2022-19:41:48",
                    "content": "Es delicado porque una gran porcopción de DAI tiene USDC como colateral, que si se freezan en todo o parte por haber pasado por Tornado Cash traerían problemas al protocolo. Fuente: https://daistats.com/  image1193×305 31.6 KB  Hay mucho debate en el foro sobre que hacer con USDC y con los RWA, que ambas comparten que son colaterales centralizados de MakerDAO y por eso sujetos a la actividad regulatoria de los Estados, a diferencia de los colaterales descentralizados que tienen otros riesgos, pero no ese. Acá se generó un buen debate sobre eso, personalmente comparto cada palabra del autor del post: The Real Legal Risks Acá fue traducido al español por @brigith238 : Los Riesgos Legales Reales [Traducción] Sobre que hacer, hay algunos que plantean aumentar los fees de los vaults de USDC y el PSM para desalentar su uso, otros directamente que plantean cerrarlos, otros bajar los fees de otros vaults para incentivar su uso y reducir los de USDC, otros volver a un DAI solamente colateralizado con ETH como el viejo SAI con un soft peg con el USD no tan firme, y hasta propuestas mas extremas (y minoritarias por ahora) de soltar el peg con el USD. Se volvió a calentar el debate en torno a todo ésto. Lo que si es seguro es que se vienen regulaciones muy fuertes sobre las stablecoins y sobre el KYC del sistema cripto en general, hay que adelantarse para que no haya actuar de urgencia con las regulaciones encima. No creo que se vaya a caer todo, hay muchos capitales institucionales que inviertieron y mucho capital en juego, no veo que los Estados vayan por destruir todo, pero si regular y controlar al extremo, y ante eso hay dos opciones: Adecuarse a las regulaciones para ir por los capitales institucionales y que Maker crezca exponencialmente o mantenerse totalmente descentralizado y alejado de las regulaciones a costa de sacrificar crecimiento. ",
                    "links": [
                        "https://forum.makerdao.com/t/the-real-legal-risks/17207/",
                        "https://forum.makerdao.com/t/los-riesgos-legales-reales-traduccion/17274"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#159",
                    "likes": "8",
                    "time": "23/08/2022-21:23:45",
                    "content": "Cartel visto en una librería de Martínez, zona norte del Gran Buenos Aires, Argentina. Aceptan pago con DAI, USDT y BTC, y abonando con esos medios de pago ofrecen un descuento del 10% de lunes a viernes y del 20% los sábados y domingos. Adopción genuina por parte de un comerciante individual. Que se vuelva masivo ésto, recién estamos comenzando.  20220823_1817551536×2048 313 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#160",
                    "likes": "4",
                    "time": "23/08/2022-22:37:54",
                    "content": "Excelente, la adopción no vendrá de compañias queriendo imponer un orden, vendrán de minoristas y empresas pequeñas que potencialmente harán que las compañias a gran escala adopten la marea, recordemos que la única forma que una compañía a gran escala adopten algo es que le vea beneficio. Otra noticia que más que sea de gran impacto, es una noticia personal, acabo de alquilar dos habitaciones a dos estudiantes uno de Ingeniería y otro de Informática ambos trabajan remoto y cobran en USDT les dije que la única forma de aceptar un pago a través del P2P de Binance es que me envíen DAI, yo veo esta acción como liquidez mensual añadida orgánicamente para DAI ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M.Bertuccio",
                    "index": "#161",
                    "likes": "6",
                    "time": "24/08/2022-17:08:32",
                    "content": "Buenas tardes a todos. Les comparto la siguiente noticia donde brevemente cuenta que Makerdao acaba de aprobar un préstamo por 100 millones de Dai a un importante banco estadounidense con más de un siglo de trayectoria. Los fondos prestados al banco servirán para la amortización de préstamos hipotecarios comerciales sobre inversiones inmobiliarias, financiación de construcciones para el sector inmobiliario, entre otras. La propuesta se voto en Julio y recibió 117.540 votos a favor y 4.200 en contra. Considero que es un paso muy importante no solo para maker sino también para la economía y la aceptación de criptomonedas en general, estamos hablando de que ahora hay entidades bancarias que buscan respaldarse en Stablecoins y en este caso eligieron Dai por sobre la competencia. ¿Ustedes que opinan? Saludos!    CriptoNoticias - Noticias de Bitcoin, Ethereum y criptomonedas – 24 Aug 22    Así es como MakerDAO le presta millones a un banco con más de 100 años de... La plataforma descentralizada busca abrirse espacio en las finanzas tradicionales aportando DAI a Huntingdon Valley Bank.      ",
                    "links": [
                        "https://www.criptonoticias.com/finanzas/asi-makerdao-presta-millones-banco-mas-100-anos-trayectoria/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dilip",
                    "index": "#162",
                    "likes": "3",
                    "time": "24/08/2022-17:46:08",
                    "content": "Esto podría ser de interés para el DAO.  twitter.com    alto | dollar.eth @etheraltog  someone tell maker to renew their names https://t.co/iqOP39DfC4   11:55 AM - 24 Aug 2022           68                4            ",
                    "links": [
                        "https://twitter.com/etheraltog/status/1562408208160940032",
                        "https://twitter.com/etheraltog/status/1562408208160940032",
                        "https://t.co/iqOP39DfC4",
                        "https://twitter.com/etheraltog/status/1562408208160940032",
                        "https://forum.makerdao.com/t/are-these-expiring-ens-domains-owned-by-makerdao/17434/9"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#163",
                    "likes": "0",
                    "time": "24/08/2022-22:51:30",
                    "content": "Gracias! Ahí armé un topic para preguntar y alertar sobre si esos ens domains son de Maker y en en ese caso si alguien a cargo de su renovación.    Are these expiring ens domains owned by MakerDAO? Miscellaneous       I came across a tweet where a user posted the following image of ens domains about to expire on 08-26-2022 wondering if they were owned by MakerDAO.  There are ens domains like mkr.eth, dai.eth or maker.eth  Are they owned by MakerDAO??? I hope there is someone in charge taking care of their renewal!   [image]   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M.Bertuccio",
                    "index": "#164",
                    "likes": "6",
                    "time": "27/08/2022-19:16:59",
                    "content": "Buenas tardes a todos Acabo de leer la siguiente noticia donde habla que la provincia argentina de Mendoza, sería la primera en el país en aceptar Stablecoins -entre ellas DAI- para pagar impuestos. De hecho la misma Administración Tributaria de Mendoza (ATM) ya realizó la primera operación de pago  de un impuesto atomotor. Los pagos se realizarían de manera online, luego una empresa que todavía no se ha dado a conocer por las autoridades oficiales sería la encargada de convertirlas a pesos para concretar la operación. Segun el artículo la Ciudad Autónoma de Buenos Aires sería la próxima en aceptar tanto Bitcoin como stablecoins para pagar impuestos. El gobernador de la ciudad aclaro que, no significa que la ciudad va a tener ‘criptos’ en las cuentas públicas sino que la idea es sumar una nueva opción de pago. Si bien considero que en Argentina todavía nos falta bastante, por lo menos este tipo de medidas nos deja una sensacion alentadora de que estamos dando pequeños pasos hacia una mayor aceptación de criptomonedas. Si en la comunidad hay gente de El Salvador me gustaría que pudieran contarnos sus experiencias en la vida cotidiana con respecto a este mundo cripto (a mi entender es el país con mayor aceptación de criptomonedas en Latinoamerica) y poder asi saber el impacto que tiene en la sociedad. Saludos!    CriptoNoticias - Noticias de Bitcoin, Ethereum y criptomonedas – 27 Aug 22    Provincia de Argentina abre sus puertas a stablecoins para el pago de impuestos El primer pago con criptomonedas lo realizó un funcionario de la Administración Tributaria de Mendoza.      ",
                    "links": [
                        "https://www.criptonoticias.com/comunidad/provincia-argentina-abre-puertas-stablecoins-pago-mpuestos/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#165",
                    "likes": "2",
                    "time": "27/08/2022-20:55:51",
                    "content": "Más que una excelente noticia, yo la vería como algo mucho más fácil para monitorizar, aunque es necesario para el desarrollo de las criptomonedas la participación de algún gobierno, siempre me reservo y lo veo de reojo cuando esté intercepta que alguna cripto, veremos si esos impuestos son realmente necesarios. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M.Bertuccio",
                    "index": "#166",
                    "likes": "3",
                    "time": "27/08/2022-22:32:24",
                    "content": "Buenas tardes @Moi. Coincido totalmente con vos, la participación del gobierno ayudaria al crecimiento cripto, en este caso ofrecen otra opción para el pago de impuestos, por otro lado puede ser utilizado como bien decis como otra herramienta para afilar controles sobre los ingresos de la gente. Precisamente las principales ventajas de las criptos es que sean descentralizadas, donde ni gobiernos ni entidades financieras puedan intervenir. En Argentina no sería la primera ni la ultima vez que te dan una facilidad con algura trampa escondida. Pero eso es otro tema. Habrá que esperar y ver como sigue, por lo pronto hay que tomarlo como algo positivo. Saludos! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#167",
                    "likes": "9",
                    "time": "30/08/2022-04:35:53",
                    "content": "Sigue dando que hablar el tema de la fusión de Ethereum y cómo podría afectar a las monedas estables y el funcionamiento de los protocolos DeFi. Financiación negativa, retrocesión perpetua de contratos, tiempos de inactividad de la red, ataques de repetición, entre otros, son algunos problemas que podría enfrentar MakerDAO en la fusión. Más sin embargo, otros desarrolladores consideran que la posibilidad de que la fusión afecte a la red son bajas, aunque así señalan la conveniencia de estar preparados para solventar tales e hipotéticas situaciones.    BeInCrypto – 28 Aug 22    DappRadar: La Fusión de Ethereum podría afectar a las stablecoins y... Según el informe, el mercado de las stablecoins es enorme y su uso en blockchains públicas como Ethereum ha crecido significativamente, lo que las convierte en parte integral de las operaciones de DeFi . El informe señaló que...  Est. reading time: 2 minutos       ",
                    "links": [
                        "https://es.beincrypto.com/dappradar-fusion-ethereum-podria-afectar-stablecoins-protocolos-defi/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#168",
                    "likes": "7",
                    "time": "02/09/2022-12:01:49",
                    "content": "Según un tweet reciente de Santiment, las ballenas han mostrado un gran interés en el token MKR con un gran aumento en las transacciones de $100k+ en la red desde el 11 de agosto. Pero eso no es lo único que tiene el token MKR.  El recuento de direcciones también ha aumentado constantemente desde el mes pasado.  2048×1019 67.8 KB  Junto con el aumento de las direcciones, el volumen también mostró cierto crecimiento en el último mes.  Logró alcanzar nuevas alturas a mediados de agosto.  2048×693 31.7 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#169",
                    "likes": "1",
                    "time": "02/09/2022-17:18:21",
                    "content": "Sabés cual es el driver o la razón que motiva éste comportamiento del mercado con respecto a MKR? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#170",
                    "likes": "3",
                    "time": "02/09/2022-18:29:00",
                    "content": "Creo que la razón detrás de esto es el próximo lanzamiento de la tecnología de teletransporte Maker en Optimism y Arbitrum, con este lanzamiento, DAI podrá escalar aún más y recibir una adopción masiva mucho más rápido. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#171",
                    "likes": "6",
                    "time": "06/09/2022-13:26:03",
                    "content": "Me topé con otro caso interesante de adopción genuina y orgánica de DAI en Argentina por parte de un comercio minorista. En éste caso, una mueblería ubicada en la ciudad de La Plata, Provincia de Buenos Aires, que informa que acepta pagos en BTC, USDT, DAI y ETH, ofreciendo un 25% de descuento con esos medios de pago.  image1345×566 117 KB   image1281×624 126 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#172",
                    "likes": "4",
                    "time": "06/09/2022-15:40:41",
                    "content": "Apa amigo! No teniamos idea de este comercio, excelente dato, ahora lo comento con la comunidad Cripto La Plata asi nos acercamos al mismo. Que alegria encontrarse con estas sorpresas y mas siendo local.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M.Bertuccio",
                    "index": "#173",
                    "likes": "8",
                    "time": "07/09/2022-23:42:16",
                    "content": "Buenas tardes a continuación les comparto esta noticia que tiene que ver con la regulación por parte de los gobiernos que es un tema que siempre da que hablar. En este caso fue en mi ciudad Mar Del Plata-Argentina. La Administración Federal de Ingresos Públicos (AFIP) Ente encargado de la aplicación, percepción, recaudación y fiscalización de las rentas e impuestos nacionales. Logró mediante un fallo embargar una billetera virtual en este caso de la aplicación mercado pago con el objetivo de cobrar deudas impositivas a un contribuyente moroso. Algunos de los argumentos son:   Los activos digitales presentes y futuros que pudiera tener el demandado en la cuenta digital denunciada constituyen bienes que integran su patrimonio y, por lo tanto, ser embargable en el caso de que se posea una deuda con el fisco.  No existe ley que los declare inembargables o inejecutables. Además deben cumplir la función de garantía que manda el Código, en este caso frente a los créditos reclamados por la AFIP. El uso de nuevas tecnologías no debe constituir un medio de elusión del cumplimiento de las obligaciones, en fraude de los acreedores. Por otra parte, los activos de criptomonedas cumplen funciones de unidades de cuenta y almacenes de valor. También pueden ser utilizados para realizar pagos, por lo que podrían ser embargables por su capacidad de ser similares al dinero.  La AFIP ya identificó a 9.800 personas que tienen deudas para embargar su dinero de sus billeteras. El organismo podrá embargar dinero de las cuentas digitales de los argentinos que tengan deudas en mora, de momento la nueva capacidad de la AFIP de embargar saldos en cuentas digitales pesa principalmente sobre las cuentas que poseen CVU. Esto podría aplicarse en el caso de los exchanges, ya que los usuarios delegan la custodia de los cripto activos a la empresa y, por lo tanto, esta podría actuar como intermediario entre AFIP y sus clientes, colaborando con las entidades oficiales para facilitar el embargo. Por razones similares Lemon cash mudó parte de su empresa a El Salvador y poder evitar estas normativas nacionales. En mi opinión esto puede repercutir de manera negativa ya que van a estar utilizando este caso como jurisprudencia para intentar presionar y embargar las billeteras virtuales y wallets. Si bien se les hace agua la boca para poder morder un pedazo, todavía les falta investigación y organización. De momento considero que mientras uno no tenga el dinero en los exchanges o algunas billeteras virtuales con CVU no debería tener por qué preocuparse. Leo sus opiniones.Saludos!    BeInCrypto – 6 Sep 22    AFIP podría embargar monederos de ahorristas argentinos que tengan deudas con... AFIP podría embargar monederos de ahorristas argentinos que tengan deudas con el fisco. La resolución alcanzaría a las criptomonedas.  Est. reading time: 4 minutos       ",
                    "links": [
                        "https://es.beincrypto.com/afip-podria-embargar-monederos-ahorristas-argentinos-tengan-deudas-fisco/?utm_source=telegram&utm_medium=social"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#174",
                    "likes": "3",
                    "time": "08/09/2022-13:30:09",
                    "content": "No me parece algo negativo, y hasta te diría que es algo natural y normal que pase. Ante una deuda de cualquier tipo, la que sea (tributaria, contractual, derivada de un accidente, de un contrato de trabajo, de un divorcio, etc.), el deudor responde con todo su patrimonio, y los activos que pueda tener una billetera digital o wallet cripto forman parte de su patrimonio, por lo que ni siquiera veo una cuestión jurídicamente debatible, esos activos son parte del patrimonio del deudor y pueden ser embargados para cobrar su deuda. Es absolutamente lo mismo a la existencia de saldos en una cuenta bancaria que son embargables por el acreedor en caso de una deuda. De hecho, hace años que judicialmente en Argentina se embargan saldos de cuenta en Mercado Pago, no es algo de ahora, así que seguramente ésto se extienda a wallets criptos, el deudor tan solo debería pedir un informe (por un oficial judicial) a Buenbit, Ripio, Belo, Lemon, y el resto de las fintech, para que indiquen si el deudor tiene saldo en sus cuentas, y si lo tiene, sería perfectamente embargable por el acreedor. Igual solución en caso de fallecimiento del titular de las cuentas, así como sus herederos pueden pedir informes a los bancos para ver si tienen saldos para heredar, lo mismo puede suceder con saldos en Mercado Pago y wallets cripto. Claramente estamos hablando de wallets centralizadas donde hay una entidad custodia que lleva registro de clientes y saldos, en wallets descentralizadas todo ésto es impracticable, ya que no hay nadie a quien pedirle informes, ni identificación de clientes, ni forma de embargar. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andres",
                    "index": "#175",
                    "likes": "5",
                    "time": "09/09/2022-14:20:18",
                    "content": "En relación a un tema que ha estado en la palestra, ayer publicaron un artículo sobre la propuesta de Coinbase para que MakerDAO mantenga los USDC dentro del exchangue a cambio de un retorno anual del 1,5% a Maker si el protocolo invierte 1.600 millones de USDC. Las opiniones están divididas, una de los aspectos más polémicos es el carácter centralizado de Coinbase que iría en contra del espírito de MakerDAO como un DeFi.    CriptoNoticias - Noticias de Bitcoin, Ethereum y criptomonedas – 8 Sep 22    DAI quiere soltar sus USDC en reserva, pero Coinbase le ofrece ganar millones... El protocolo Maker, emisor de la stablecoin, recibió una propuesta del exchange que genera debate en su gobernanza.      La propuesta:    MIPs Portal    MIPs Portal Maker Improvement Proposals are the preferred mechanism for improving both Maker Governance and the Maker Protocol.      ",
                    "links": [
                        "https://www.criptonoticias.com/finanzas/dai-quiere-soltar-usdc-reserva-coinbase-ofrece-ganar-millones-ellos/",
                        "https://mips.makerdao.com/mips/details/MIP13c3SP12#context-and-motivation",
                        "https://mips.makerdao.com/mips/details/MIP13c3SP12#context-and-motivation"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#176",
                    "likes": "8",
                    "time": "12/09/2022-03:40:20",
                    "content": "Revisando la web a propósito de una investigación que estaba realizando sobre el tema de derechos de autor, me conseguí con “Estudio Davo”, un estudio jurídico a través del cual puedes registrar tu marca, modelo o diseño del cuál seas el creador original a fin de reservar tus derechos como propietario de esa obra intelectual. Lo interesante de esta firma de abogados es no sólo que aceptan criptomonedas, entre ellas el DAI, sino que también puedes registrar tu marca en varios países de Latinoamérica y el mundo como: Argentina, Estados Unidos, Brasil, Uruguay, Chile, la Unión Europea, Grecia, entre otros. Y por si fuera poco, en varios países el trámite es 100% online, es decir, no requieres trasladarte físicamente y el trámite no pasa de digitalizar unos cuántos documentos.     estudiodavo.com.ar   Registro de Derechos de Autor, Software y Obras - Estudio Davo - Estudio...  Registrá tu Derecho de Autor desde cualquier lugar del país,  online desde tu casa o acercándote personalmente a nuestras oficinas.  Podes tener el      ",
                    "links": [
                        "https://www.estudiodavo.com.ar/areas/registro-derechos-de-autor-software-obras"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#177",
                    "likes": "5",
                    "time": "12/09/2022-13:06:52",
                    "content": "@Joselyn soy yo ese, es el Estudio Jurídico y de Propiedad Intelectual que comparto junto con mi padre y @Leandro !!! Que increíble que lo hayas encontrado, no lo puedo creer!!! Yo no lo compartí acá para no auto-shillearme. Esa publicación es vieja de cuando VAI aun existía, estamos por hacer un rebranding de todo el Estudio y vamos a actualizar éste tipo de publicaciones. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#178",
                    "likes": "3",
                    "time": "12/09/2022-21:45:16",
                    "content": "    Marian:  @Joselyn soy yo ese, es el Estudio Jurídico y de Propiedad Intelectual que comparto junto con mi padre y @Leandro !!! Que increíble que lo hayas encontrado, no lo puedo creer!!! Yo no lo compartí acá para no auto-shillearme.   Wow, estoy sorprendida @Marian. Vaya casualidad, que pequeño es el mundo!!! Aquí dónde vivo no es común ver el área del derecho interactuar con las criptomonedas, yo diría que con la tecnología en general. En materia de leyes siempre vamos un paso atrás, siento que las universidades así como han venido incorporando áreas de tecnologías en materia de postgrados, deberían incorporar el campo crypto como especialidades seccionadas, y el tema del derechos de autor debería ser una de ellas, al menos tener su módulo completo; y así egresados de carreras como derecho, podrían formarse en ese campo. Acá en pregrado solo una universidad ha propuesto incorporarla como carrera técnica, de resto no pasa de breves cursos que dictan, especialmente en épocas de alza del bitcoin y fomo en general, como sucedió el año pasado con la explosión de los juegos NFT. Y bueno, aprovechando la ocasión, ya sabemos a donde acudir cuando necesitemos asesoría en el área. Cualquiera pensaría que nos pusimos de acuerdo para la publicidad jajaja! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.513020833333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andres",
                    "index": "#179",
                    "likes": "4",
                    "time": "13/09/2022-19:45:25",
                    "content": "Leyendo esta publicación de @Joselyn no se si @Marian o @Leandro que trabajan en el área de derechos de autor y criptomonedas, han pensado en la posibilidad de crear o proponer algún proyecto (o no se si ya existe y lo conocen) que involucre a una blockchain para el registro de la propiedad intelectual por parte de sus creadores. Cuántas disputas no se ha visto en la historia sobre el reclamo de quien tuvo la primera idea de alguna novela, patente o invento; y hoy en día teniendo a mano esta valiosa herramienta que nos puede brindar muchas ventajas:   Lo publicado en la blockchain no se puede modificar y allí quedará registrado con su fecha de publicación.   Facilitaría un proyecto que registrara una obra a nivel mundial.   Se podrían consultar los estados de las obras, registro de personajes o patentes  y renovación o vencimiento de las mismas en tiempo real.   Cualquiera lo podría hacer desde la comodidad de su casa.   Sabemos que cada país tiene su organismo gubernamental encargado de gestionar estos trámites. En Venezuela es el SAPI (Servicio Autónomo de la Propiedad Intelectual) https://sapi.gob.ve/derechos-de-autor/ Me imaginaría en el futuro un registro único por adminitrado por cada país del número de los depósitos legales e ISBN de las obras intelectuales, todos corriendo sobre una blockchain e interactuando unos con otros a fin de validar que los registros o las nuevas obras que se intenten ingresar a las bases de datos sean únicas ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#180",
                    "likes": "2",
                    "time": "14/09/2022-17:31:27",
                    "content": "    Joselyn:  Y bueno, aprovechando la ocasión, ya sabemos a donde acudir cuando necesitemos asesoría en el área. Cualquiera pensaría que nos pusimos de acuerdo para la publicidad jajaja!   Es increíble tremenda casualidad, que chances había que ocurra algo así? Realmente parecería que nos pusimos de acuerdo para que promociones mis servicios profesionales      Andres:  han pensado en la posibilidad de crear o proponer algún proyecto (o no se si ya existe y lo conocen) que involucre a una blockchain para el registro de la propiedad intelectual por parte de sus creadores.   Como dices, en todos los países, los registros de Propiedad Industrial (marcas, patentes, modelos y diseños) son gestionados por organismos públicos, por lo que el sector privado poco tiene para hacer allí. Tengo conocimientos que el Instituto de Patentes y Marcas de España tiene en proyecto migrar la gestión de sus registros a la tecnología blockchain, incluso proyectan abrir oficinas vitruales de registro y vigilencia en el metaverso. En cuanto a derecho de autor, allí si hay posibilidad de que el sector privado utilice la tecnología blockchain ya que los registros públicos no son obligatorios, y hay tengo el conocimiento de varios proyectos en distintas blockchain que ofrecen el servicio de depositar las obras de todo tipo para fijar fecha cierta y principio de prueba de autoría. Imaginemos en un futuro poder realizar éstos trámites de registro por medio de blockchain, lo que otorgaría total transparencia, y abonar las tasas con DAI. Sólo falta que los Estados se animen a dar el paso en la adopción. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#181",
                    "likes": "5",
                    "time": "19/09/2022-13:08:43",
                    "content": "Otro diario económico de Argentina se encargó de reflejar el incipiente uso de criptomonedas para la compra de inmuebles, y así sortear las restricciones cambiarias cada vez mas estrictas del país. El uso de BTC y ETH es marginar, las stablecoins son las mas utilizadas por logicas razones. Algunas inmobiliarias incluso desarrollaron alianzas comerciales con fintech locales para ofrecer a sus clientes la compra-venta de inmuebles con stablecoins con un mecanismo ya establecido de antemano, dándole al comprador la posibilidad de pagar con criptos y al vendedor la posibilidad de cobrar las mismas criptos o convertirlas a dólares.  image1360×3092 307 KB      iProUP    El \"rulo\" para adquirir una propiedad: el comprador paga con dólar digital y... Tether, Binance USDT y DAI, son tan solo algunas de las criptomonedas con las que se negocia en el mercado inmobiliario. Las claves de este mercado      ",
                    "links": [
                        "https://www.iproup.com/economia-digital/32948-bitcoin-a-dolar-como-se-venden-propiedades-en-argentina"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#182",
                    "likes": "2",
                    "time": "19/09/2022-15:04:59",
                    "content": "La caída de los precios en el mercado de las criptomonedas está provocando algunas liquidaciones potenciales. Según los datos disponibles en DeFi Llama, los niveles de liquidación en DeFi rondan los $1.5 mil millones en total, con $109.8 millones dentro del 20% de su precio actual. Hay una bóveda de MakerDAO que se enfrenta a una liquidación de $1284. El valor es de aproximadamente $4.3 millones La bóveda que se enfrenta a la amenaza de liquidación: Oasis ",
                    "links": [
                        "https://oasis.app/28300#overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M.Bertuccio",
                    "index": "#183",
                    "likes": "3",
                    "time": "19/09/2022-17:32:26",
                    "content": "Recien acabo de leer el artículo. Muy interesante, me hizo acordar que el año pasado cuando las cripto estaban en boca de todos habia una inmobiliaria acá en Mar Del Plata que promocionaba la venta de propiedades a estrenar con el slogan  “Un departamento por un Bitcoin”.  Esto fue cuando BTC llegaba a su maximo anterior de 65k aprox. Quizas lo utlizaron a modo de publicidad y darse a conocer aprovechando el furor de las criptomonedas, o quizas como apuesta al futuro eligieron BTC por sobre monedas estables y no les importaba su volatilidad desconozco como habra terminado porque meses despues btc bajo mas de un 50%. La aceptación de monedas estables para la compra venta de inmuebles es genial. El mercado Inmobiliario viene en caída en los ultimos años así que operaciónes de este estilo ayudarían a que la rueda pueda continuar. En mi opinion lo único que tiene en contra  es la segregación de mercado, quienes participan mayormente en el mercado inmobiliario son personas mas grandes, alredor de los 50 años y mas. Y va ser muy dificil (en algunos casos imposible) pasarlos del dolar fisico a uno digital. En mi expiriencia personal todavía no tuve ningún cliente que quisiera comprar o vender con criptos y de momento por lo que hablé con colegas tampoco. Pero hay que ser optimista, es un buen comienzo que exista este medio fuera de lo tradicional para acceder a una vivienda y fomentar la utliización de esta tecnologia en el mundo real ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aldi",
                    "index": "#184",
                    "likes": "1",
                    "time": "23/09/2022-15:20:28",
                    "content": "Buen día Nicolas, me parece sumamente beneficioso que los comercios empiecen a incorporar DAI como medio de pago, y de a poco ir utilizando cada vez menos el efectivo. Saludos!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aldi",
                    "index": "#185",
                    "likes": "5",
                    "time": "23/09/2022-19:57:27",
                    "content": "Buenas tardes a todos; Comparto la siguiente noticia ya que si bien, es una modalidad que ya se esta utilizado me parecio muy interesante que ya más de 1 millón de comercios en Argentina se adhieran a dicha modalidad ya que le da la posibilidad a los consumidores de tener una opción mas a la hora de elegir como abonar. De manera muy resumida, se trata de que los usuarios mediante código QR podran elegir abonar en ARS, BTC, ETH, USD o DAI. En caso que se elija una criptomoneda la plataforma hará la conversión automática a pesos argentinos (que es la moneda que recibirá el comerciante) Les dejo el link a continuación para que a quienes les interese puedan leer la noticia mas en profundidad.   Telegram    CriptoNoticias 🗞 Argentinos podrán pagar con bitcoin en 1 millón de comercios Finanzas  | Derliz Machado | 23 septiembre, 2022      Saludos!!! ",
                    "links": [
                        "https://t.me/criptonoticias/25089"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M.Bertuccio",
                    "index": "#186",
                    "likes": "1",
                    "time": "24/09/2022-15:17:55",
                    "content": "Hola @Aldi. Sé que se esta empezando a aceptar mas el pago con criptomonedas pero desconocía que ya tenemos mas de 1 millon de comercios adheridos. Es una buena noticia para continuar dandole mayor utilidad a nuestras cryptos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#187",
                    "likes": "3",
                    "time": "25/09/2022-20:18:08",
                    "content": "Me recuerda mucho a GoCrypto de Binance pero de manera más directa en su país, es necesario como lo vengo diciendo en repetidas ocasiones crear realmente funcionalidad de intercambio para DAI, aún tengo en la mente usar a DAI como una tarjeta de crédito en algún Fintech parecido a Zinli pero eso estará lejos de llegar ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M.Bertuccio",
                    "index": "#188",
                    "likes": "6",
                    "time": "26/09/2022-20:28:49",
                    "content": "Buenas tardes. Les comparto la siguiente noticia donde dice que en Argentina ya se pueden comprar pasajes de aerolíneas con criptomonedas en formato NFT . La aerolínea argentina Flybondi conocida popularmente por ofrecer pasajes a bajos costo, se convertirá en la primera compañía de vuelos aéreos en utilizar tecnología blockchain en sus boletos. Gracias a una asociación con la plataforma TravelX, Flybondi tokenizará sus tickets y aceptará criptomonedas como BTC y stablecoins como DAI, los viajeros que deseen abonar sus pasajes con activos digitales deberán hacerlo mediante Binance Pay. Además describe que al ser Un NFTicket otra gran ventaja es que el dueño de estos NFTS puede hacer lo que quiera, va poder transferirlo, venderlo, regalarlo a otro pasajero maximo hasta 72 horas antes de la salida del avión, algo que hasta ahora no se podía. Es una idea genial no solo por fomentar el uso de criptomonedas sino que también permite a los poseedores de los NFTickets de poder generar ganancias revendiendo los pasajes.    BeInCrypto – 21 Sep 22    Flybondi de Argentina tokeniza boletos aéreos y acepta pagos cripto La primera aerolínea ultra low cost en Argentina, Flybondi, convertirá todos sus pasajes en tokens y ofrecerlos como NFTickets.  Est. reading time: 2 minutos       ",
                    "links": [
                        "https://es.beincrypto.com/flybondi-argentina-tokeniza-boletos-aereos-acepta-pagos-cripto/?utm_source=telegram&utm_medium=social"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dilip",
                    "index": "#189",
                    "likes": "6",
                    "time": "03/10/2022-10:45:04",
                    "content": "Nexo ha sacado una gran parte de WBTC de MakerDAO.  Este gran retiro ha sacado a casi la mitad de todo el WBTC de la plataforma.  twitter.com    Santiment @santimentfeed  😮 #Nexo has made a big move, and likely plans to make more after pulling nearly 50% of the $WBTC held in #MakerDao. This has left $120M in $WBTC remaining locked in #CDP's. We will be monitoring for signs as to what Nexo plans to do with their free assets. 👀 https://t.co/t7eG2njldq   4:37 PM - 30 Sep 2022           19                2            ",
                    "links": [
                        "https://twitter.com/santimentfeed/status/1575887529093365765",
                        "https://twitter.com/santimentfeed/status/1575887529093365765",
                        "https://twitter.com/search?q=%23Nexo",
                        "https://twitter.com/search?q=%23MakerDao",
                        "https://twitter.com/search?q=%23CDP",
                        "https://t.co/t7eG2njldq",
                        "https://twitter.com/santimentfeed/status/1575887529093365765"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aldi",
                    "index": "#190",
                    "likes": "3",
                    "time": "03/10/2022-13:44:01",
                    "content": "Hola Mariano; Me parecio muy interesante este articulo, es de gran utilidad que de a poco se pueda comenzar a comprar inmuebles con criptos. Confío que cada vez seran más las inmobiliarias que  acepten criptos, otorgando al comprador una opción más a la hora de abonar, ya que por el momento se manejan únicamente en USD. Saludos!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#191",
                    "likes": "0",
                    "time": "04/10/2022-13:04:35",
                    "content": "Hola Aldi, mas que de las inmobiliarias, es cuestión de las partes involucradas, comprador y vendedor. Las inmobiliarias sí pueden colaborar con eso, justamente por su rol de intermediarios, en ofrecerles a las partes facilidades y herramientas. Creo que las fintech y Maker tienen un gran negocio allí en nuestro país que no están explotando. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#192",
                    "likes": "5",
                    "time": "06/10/2022-17:43:49",
                    "content": "Buenas tardes gente, espero que esten teniendo un hermoso dia porque les traigo una noticia que cuando menos sorprende…personalmente todavia sigo meditando sobre lo que significaria esto para el protocolo en si como para DAI. Les comparto a continuacion dicha noticia y abajo de la misma los links al MIP y Vote donde se valido esta proposal. BTW me gustaria leer sus opiniones y pensamientos al respecto.    The Block    MakerDAO initiates $500 million investment in US treasuries, corporate bonds MakerDAO said it has initiated $500 million investment in traditional assets using its reserves.         coindesk.com – 6 Oct 22    Stablecoin Issuer MakerDAO to Invest $500M in US Treasurys, Corporate Bonds The move is a way for Maker to diversify its balance sheet and make the backing of its stablecoin more stable.       MIP65: Monetalis Clydesdale: Liquid Bond Strategy & Execution   Asset Allocation for MIP65 (Clydesdale) - June 27, 2022   vote.makerdao.com   Governance Portal The MakerDAO Governance Portal allows for anyone to view governance proposals, and also allows for MKR holders to vote.      ",
                    "links": [
                        "https://www.theblock.co/post/175311/makerdao-initiates-500-million-investment-in-us-treasuries-corporate-bonds?utm_source=twitter&utm_medium=social",
                        "https://www.coindesk.com/business/2022/10/06/stablecoin-issuer-makerdao-allocates-500m-for-treasuries-corporate-bond-investment/",
                        "https://www.coindesk.com/business/2022/10/06/stablecoin-issuer-makerdao-allocates-500m-for-treasuries-corporate-bond-investment/",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-liquid-bond-strategy-execution/13148",
                        "https://vote.makerdao.com/polling/QmXedMr8#poll-detail",
                        "https://vote.makerdao.com/polling/QmXedMr8#poll-detail"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#193",
                    "likes": "5",
                    "time": "11/10/2022-17:27:07",
                    "content": "   Cointelegraph    Breaking: Google taps Coinbase to bring crypto payments to cloud services Coinbase's deal with Google will help facilitate crypto payments, and Coinbase will move some applications to the Google Cloud.      Esta brecha abre una oportunidad de oro, la cantidad de capital que se intercambia por los servicios de Google Cloud son amplios, habilitará el uso de esta herramienta para cualquier Fintech, no suena descabellado que posteriormente se asocie un método de pago con Google Pay, si en dado caso llegamos a voltear nuestra visión y nos enfocamos en Coinbase podría ser un movimiento positivo, aunque como siempre digo nos abre para las regulaciones oportunas, pero si en dado caso somos prestatarios más seguidos de Coinbase las principales compañías tendrán en la mira a Maker, como sucedió con BlackRock en su momento. ",
                    "links": [
                        "https://cointelegraph.com/news/breaking-google-taps-coinbase-to-bring-crypto-payments-to-cloud-services"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Valen_Gayone",
                    "index": "#194",
                    "likes": "8",
                    "time": "12/10/2022-23:20:33",
                    "content": "Buenas! como andan?  El otra día buscando unas entradas para un evento encontré que en esta web https://www.passline.com/ se puede pagar con crypto! Sinceramente me pareció muy copado ya que no había visto que para este tipo de cosas (fiestas, recitales, show, etc) se pueda pagar así. De momento no acepta DAI pero no estaría mal llamarles la atención jaja    image928×406 54.2 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#195",
                    "likes": "3",
                    "time": "13/10/2022-00:56:49",
                    "content": "Dependiendo del volumen por venta que manejen sería bastante beneficioso para DAI, si en dado caso no manejan tanto volumen al menos sería dinero orgánico para DAI, que es donde más debemos enfocarnos apenas End Game se vuelva definitivo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aldi",
                    "index": "#196",
                    "likes": "5",
                    "time": "13/10/2022-02:46:48",
                    "content": "Buenas noches, les comparto esta noticia que lei y me pareció muy interesante, trata de que se presento un proyecto que obliga a los políticos a incluir en sus declaraciones juradas todo criptoactivo, criptomoneda como puede ser botcoin, Dai y otras monedas estables, activos virtuales o cualquier bien inmaterial digital transferible y susceptible de valor económico, que se encuentren en monederos virtuales del país o del extranjero. Les dejo el link para que a quien le interese como a mi pueda leer la noticia completa.   BeInCrypto – 12 Oct 22    Presentan proyecto que obliga a políticos argentinos a incluir criptomonedas... Presentan proyecto que obliga a políticos argentinos a incluir criptomonedas en su declaración jurada. Hoy se puede omitir ese detalle.  Est. reading time: 2 minutos       Saludos!! ",
                    "links": [
                        "https://es.beincrypto.com/presentan-proyecto-obliga-politicos-argentinos-incluir-criptomonedas-declaracion-jurada/?utm_source=telegram&utm_medium=social"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#197",
                    "likes": "7",
                    "time": "15/10/2022-16:10:24",
                    "content": "MakerDAO registró una caída del 86% en los ingresos en el tercer trimestre de 2022 debido a la débil demanda de préstamos y las pocas liquidaciones. “Johnny_TVL”, un analista de Messari y coautor del informe ‘State of Maker Q3 2022’, publicó un tweet que destacaba que los ingresos trimestrales de MakerDAO disminuyeron de $30 millones a solo $4 millones.   twitter.com    Johnny_TVL @john_tv_locke  @MakerDAO third quarter was a painful one for the decentralized lender.   Notables:  - revs fell 86%, collateral ratio down to 1.1 - G-UNI dominating, is this increasing liquidity and on-chain volumes for DAI?  - wBTC reliance on whales/institutions - RWAs  - Endgame  🧵 1/n https://t.co/OrJ7JvFSM3    5:57 PM - 13 Oct 2022           10                2            El protocolo vio su mayor disminución de ingresos de los activos basados ​​en ETH, que cayeron un 74%.  Además, sus ingresos de los activos basados ​​en BTC cayeron un 66%, mientras que el resto de los activos también disminuyó un 36%. ",
                    "links": [
                        "https://twitter.com/john_tv_locke/status/1580618829235113986?t=daLosGkOCLIjFiZQ6EnjQA&s=19",
                        "https://twitter.com/john_tv_locke/status/1580618829235113986?t=daLosGkOCLIjFiZQ6EnjQA&s=19",
                        "https://twitter.com/MakerDAO",
                        "https://t.co/OrJ7JvFSM3",
                        "https://twitter.com/john_tv_locke/status/1580618829235113986?t=daLosGkOCLIjFiZQ6EnjQA&s=19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.574074074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#198",
                    "likes": "5",
                    "time": "16/10/2022-23:29:15",
                    "content": "Estaba charlando con un amigo con respecto al auge de los conciertos aquí en Venezuela y vi tu publicación, busque por curiosidad algunos conciertos y para mi sorpresa aceptan pagos en USDT a través de Binance P2P, claramente la facilidad de manejar dinero electrónico está aumentando, inclusive aceptando Metamask como método de pago específicamente en la red de BSC.  IMG_20221016_1928181080×2117 217 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cpt_Rick",
                    "index": "#199",
                    "likes": "1",
                    "time": "17/10/2022-17:30:24",
                    "content": "No conocía esa plataforma y ahora estoy viendo que maneja bastantes eventos. Qué buena noticia que se habiliten medios de pago no tradicionales para este tipo de actividades que son masivas ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cpt_Rick",
                    "index": "#200",
                    "likes": "1",
                    "time": "17/10/2022-17:32:02",
                    "content": "qué loco realmente, es una excelente noticia y un paso hacia adelante en la adopción, pero aún así me sorprende ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cpt_Rick",
                    "index": "#201",
                    "likes": "5",
                    "time": "19/10/2022-21:51:51",
                    "content": "Hola. Encontré este artículo de un portal que hace análisis estadísticos. Está armado con datos de abril 2021. De igual forma es increíble. Se analiza la distribución del volumen de BTC en LA.  image2068×1429 217 KB  No esperaba semejante diferencia, arriba Venezuela. Cómo habrá cambiado en el último año y pico? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#202",
                    "likes": "4",
                    "time": "20/10/2022-00:18:52",
                    "content": "Como te digo, desde 2011 históricamente Venezuela está presente en la minería de Bitcoin y aumento el auge cuando Barack Obama sancionó económicamente a Venezuela (2015) bloqueando toda entrada de dólares, en ese momento se tuvo que buscar una alternativa para la entrada y salida de dólares en el país, el volumen de BTC aumento en 2016 hubieron muchos conflictos en el país había que buscar una escapatoria a la hiperinflación y los trabajos remotos eran la escapatoria aunque otros que sabían más del tema minaban cualquier PoW que se pudiera, posteriormente el gobierno implementó SUNACRIP el ente regulatorio de minería en Venezuela y puedo decir que varias personas que conozco que trabajen indirectamente en algún ente gubernamental tienen equipos de mineria, lo mismo con algún ciudadano promedio, por ende mi artículo de si la hiperinflación ayuda a la adopción de las criptomonedas     Does hiperinflation help cryptocurrency adoption? Miscellaneous       Since cryptocurrencies were created there has always been a kind of dogma that dictated “Cryptocurrencies will serve as a refuge against inflation” this has been dictated since  I have identified an economic void, which decreases the quality of nearly everybody’s financial situation — inflation.  Inflation is a natural part of the market, without it we have a balance (which is almost impossible) or we have deflation that would cause the economy to stagnate, as long as there are no consumers, but…     Por ende estamos tan adelantados en la obtención de BTC y eso sin contar los mineros que se fueron del país por extorsiones y pare de contar. En estos momentos estamos en otro escalón ya que prácticamente en cualquier local medianamente grande aceptan pagos por criptomonedas. Así que si, este es el camino correcto y espero que nuestros países vecinos no tengan necesidad de llegar a una hiperinflación absurda para entender que las criptomonedas son el refugio, pero como siempre sabemos el ser humano no aprende de experiencias ajenas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.177083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cpt_Rick",
                    "index": "#203",
                    "likes": "0",
                    "time": "22/10/2022-13:42:55",
                    "content": "Increíble. Podrías decirme cuáles son las criptomonedas más comunes que son usadas como medio de pago? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#204",
                    "likes": "6",
                    "time": "22/10/2022-14:00:40",
                    "content": "BTC para volúmenes altos de transacción, no puedo especular del todo porque la última vez que supe de una transacción de un volumen alto de BTC era por cuestiones de importación. En negocios grandes como sucursales de productos variados en 2018 aceptaban Bitcoin Cash, Bitcoin, Dash, Ethereum   twitter.com    Traki @TRAKIenganchate  ¡En nuestras tiendas estamos aceptando #Criptomonedas como forma de pago! #Bitcoin #DashCcs #Ethereum #Litecoin #BitcoinCash #Venezuela   2:00 PM - 5 Nov 2018           2                3            Actualmente casi todos los negocios medianos aceptan métodos de pago con USDT exclusivamente en Binance Pay Este es una sucursal multinacional de productos varias que también aceptan USDT https://www.instagram.com/p/Cj8T3hbOALn/?igshid=YmMyMTA2M2Y= Y negocios pequeños también aceptan USDT  IMG_20221022_1001201080×2005 443 KB  Por ende me refiero a que DAI no puede ser potencia si no se enfoca de igual manera en liquidez real, Tether podrá tener todos sus defectos pero la masa los usa y es la primera criptomoneda que se les viene a la mente junto con Bitcoin para adquirir algún producto. ",
                    "links": [
                        "https://twitter.com/TRAKIenganchate/status/1059445228522881024?s=20&t=Syiu4SL-jifBghmndoteMA",
                        "https://twitter.com/TRAKIenganchate/status/1059445228522881024?s=20&t=Syiu4SL-jifBghmndoteMA",
                        "https://twitter.com/search?q=%23Criptomonedas",
                        "https://twitter.com/search?q=%23Bitcoin",
                        "https://twitter.com/search?q=%23DashCcs",
                        "https://twitter.com/search?q=%23Ethereum",
                        "https://twitter.com/search?q=%23Litecoin",
                        "https://twitter.com/search?q=%23BitcoinCash",
                        "https://twitter.com/search?q=%23Venezuela",
                        "https://twitter.com/TRAKIenganchate/status/1059445228522881024?s=20&t=Syiu4SL-jifBghmndoteMA",
                        "https://www.instagram.com/p/Cj8T3hbOALn/?igshid=YmMyMTA2M2Y="
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#205",
                    "likes": "6",
                    "time": "22/10/2022-17:17:36",
                    "content": "Comparto. Así como en los países del primer mundo y el gran capital, el potencial de Maker está su faz de créditos contra coleterales que genera ingresos al protocolo y emite DAI, lo cual está muy bien explotado, en los países subdesarrollados y con crisis económicas, el potencial de Maker está en la demanda de esos DAI emitidos, tanto para ahorro, inversiones en DeFi como para transacciones (la famosa adopción de uso), y ésto no está bien explotado, diría bastante descuidado. En la DAO se nota un enfoque muy fuerte con visión de los países centrales, y muy poca visión de los países subdesarrollados y como sus realidades podrían ser muy compatibles con la demanda de DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cpt_Rick",
                    "index": "#206",
                    "likes": "5",
                    "time": "23/10/2022-15:39:40",
                    "content": "Hola, miren esto.  image1917×603 69.6 KB  Creo que es algo que no es nuevo, pero lo interesante es el crecimiento año a año.  image1700×335 40.3 KB   image1667×479 47.2 KB  Es increíble, de verdad. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#207",
                    "likes": "5",
                    "time": "23/10/2022-19:21:50",
                    "content": "Pongo en ejemplo, la ignorancia hace que las personas no se den cuenta que de manera directa P2P para enviar alguna moneda estable no realizan ninguna comisión, en cambio las casas de cambios tradicionales quitan un ojo de la cara, por ende la idea de Maker Academy debe ser tomada más en cuenta, pero no para que conozcan el producto si no para que asocien Maker como una entrada de aprendizaje para las criptomonedas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#208",
                    "likes": "1",
                    "time": "24/10/2022-13:27:27",
                    "content": "Ni hablar en países con controles cambiarios (como Argentina) donde el gobierno no nos permite acceder a dólares para proteger nuestros ahorros de una inflación anual proyectada del 100%. Las criptos, sea accediendo por medios legales como las fintech o por medio del P2P (o mas aún F2F) proporcionan una solución para eludir esos controles gubernamentales. A mucha gente a la que hablo de ésto, me responden “no entiendo nada de cripto, es muy complejo, no me quiero ni meter ahí, Bitcoin es fluctuante y no quero perder plata”, es decir hace falta trabajar mucho en el onboarding, en educar financieramente. Todo lo que vaya para ese lado es mas que bienvenido. Maker recientemente amplió su programa de embajadores en LATAM, espero que éste sea uno de sus objetivos y lleven adelante acciones en ese sentido. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Harrizko",
                    "index": "#209",
                    "likes": "1",
                    "time": "24/10/2022-17:01:03",
                    "content": "Marian, ¿cómo andás? Un Embajador por aquí. Efectivamente, consideramos que uno de los puntos claves en nuestra región tiene que ser el educativo y estamos comenzando a trabajar en eso. En el Foro hay información valiosísima, pero carecemos de un sitio claro, en castellano, al cual enviar a todas esas personas que, justamente, dicen lo que decís: “es muy complejo”, “no entiendo nada” o, peor aún, “eso es una estafa”; impresión las más de las veces obtenida por leer medios de comunicación mainstream cuyo objetivo —no tan oculto— suele ser desprestigiar al mundo crypto. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Valen_Gayone",
                    "index": "#210",
                    "likes": "3",
                    "time": "24/10/2022-18:43:41",
                    "content": "La verdad que si Rick, es bastante impresionante como ha aumento el crecimiento año a año!! Creo que en el caso de Argentina tiene mucho que ver con la situación del país, las trabas que impone el gobierno y la desconfianza que hay en nuestra moneda… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Valen_Gayone",
                    "index": "#211",
                    "likes": "5",
                    "time": "24/10/2022-19:22:41",
                    "content": "Buenas, como andan? Les comparto esta noticia que salió hace un par de horas: Telegram avanza con las criptomonedas: se podrán comprar los nombres de usuario La verdad es que me llamo mucho la atención como ya grandes compañías comienzan a utilizar las criptomonedas como una opción más para realizar pagos. No aclara por el momento con cuales de todas las monedas se van a poder realizar los mismos pero esperemos que DAI sea una de ellas.  image1021×255 29 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#212",
                    "likes": "2",
                    "time": "24/10/2022-19:40:42",
                    "content": "Un gusto, loko! Ese problema comunicacional de la falta de una web lo ha comentado Marian DiPietra varias veces, de hecho hay una propuesta para que Growth CU se haga cargo de una landing page donde volcar contenido y hace poco compartieron en el foro un esquema tentativo de como sería su estructura, así que desde ya espero esté disponible en Español. Aquí el topic al que me refiero: Intangible Asset Agreed Modification of Management 2022-08-23 - makerdao.com ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cpt_Rick",
                    "index": "#213",
                    "likes": "1",
                    "time": "24/10/2022-20:59:10",
                    "content": "Creo que estás en lo correcto Moi, aún queda mucho por aprender a la sociedad con lo referido a uso eficiente del dinero ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cpt_Rick",
                    "index": "#214",
                    "likes": "1",
                    "time": "24/10/2022-21:02:31",
                    "content": "completamente de acuerdo Valen, las personas quieren un refugio, y al no poder acceder a las monedas extranjeras tradicionales, buscan cripto aún cuando no les interese la tecnología detrás ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cpt_Rick",
                    "index": "#215",
                    "likes": "2",
                    "time": "24/10/2022-21:06:54",
                    "content": "hola. No se me había ocurrido, pero si pueden adquirirse dominios web, pensaría que adquirir nombres de usuarios no es tan loco. Será que telegram sea la primera empresa de comunicación en hacer esto y luego la sigan el resto? o será la única? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Valen_Gayone",
                    "index": "#216",
                    "likes": "4",
                    "time": "24/10/2022-21:07:19",
                    "content": "Sii exactamente, también creo que el conocimiento generalizado sobre las cripto esta obligando a las compañías a incorporarlas de alguna u otra manera. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Harrizko",
                    "index": "#217",
                    "likes": "4",
                    "time": "25/10/2022-03:59:59",
                    "content": "Sin duda MakerDAO va sintiendo la necesidad de material educativo. Maker Academy es un clara respuesta a esa intuición. Lo mismo esta idea de Growth a la cual te remitiste. Lo que suele estar en falta es un sitio en donde la información esté más centralizada; intuitivo, completo, y que sea útil para personas de distinta experiencia en MakerDAO y en el mundo crypto en general. Es decir, que haya recursos para gente sin ningún tipo de conocimiento y que quiera enterarse de que se trata el asunto, pero también que haya información interesante y valiosa para aquellos que ya llevamos un tiempo deambulando por aquí :). Estamos trabajando justamente en todo esto que sentís que falta, así que va a haber novedades muy pronto  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cpt_Rick",
                    "index": "#218",
                    "likes": "5",
                    "time": "25/10/2022-13:12:02",
                    "content": "Buenos días. Les comparto algo que me pareció interesante.  image1891×1688 432 KB  Es una app de telemedicina argentina. Empezó a aceptar pagos en criptomonedas que me parece bueno pero creo que la mayor parte de los usuarios no lo van a usar porque muchos son jubilados o adultos mayores, pero lo que si me pareció un avance interesante para la región es que el plan es guardar los legajos, registros médicos, historia clínica, etc de los usuarios en la blockchain. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Valen_Gayone",
                    "index": "#219",
                    "likes": "6",
                    "time": "25/10/2022-13:21:11",
                    "content": "    Cpt_Rick:  pero creo que la mayor parte de los usuarios no lo van a usar porque muchos son jubilados o adultos mayores,   Si realmente eso es un tema no menor dado que habría que analizar el porcentaje de población adulta que no utiliza los medios tecnológicos en su cotidianeidad… De todas formas es muy interesante la expansión de los pagos con criptomonedas !! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cpt_Rick",
                    "index": "#220",
                    "likes": "1",
                    "time": "25/10/2022-13:40:00",
                    "content": "sin dudas tenés razón, es una pata en la que hay que trabajar para no dejar grupos etarios enteros completamente fuera de esta posibilidad ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aldi",
                    "index": "#221",
                    "likes": "4",
                    "time": "26/10/2022-03:45:52",
                    "content": "Super positivo que cada vez en más rubros acepten el pago con criptomonedas, aunque es verdad que no es un detalle menor que la mayor parte de sus usuarios no son de utilizar mucho los medios tecnológicos. De todas formas excelente noticia!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.604166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dilip",
                    "index": "#222",
                    "likes": "6",
                    "time": "27/10/2022-08:26:58",
                    "content": "El protocolo de préstamo descentralizado Compound ha detenido el suministro de Maker (MKR) y otros tres tokens como garantía de préstamo en su plataforma, con el objetivo de proteger a los usuarios contra posibles ataques que involucren manipulación de precios, similar al reciente exploit de $117 millones de Mango Markets, según una propuesta en el foro de gobierno de Compound que se aprobó recientemente.   twitter.com    Compound Governance @compgovernance  Proposal 131 has passed with quorum. ✅  Proposal 131 pauses supply for cZRX, cBAT, cMKR, and cYFI on Compound v2.  The proposal will be applied in two days. compound.finance/governance/pro…   3:51 PM - 24 Oct 2022           22                8            ",
                    "links": [
                        "https://twitter.com/compgovernance/status/1584573244337700867?s=20&t=4HbMJlx3tbUAkK7msZ0OtA",
                        "https://twitter.com/compgovernance/status/1584573244337700867?s=20&t=4HbMJlx3tbUAkK7msZ0OtA",
                        "https://compound.finance/governance/proposals/131",
                        "https://twitter.com/compgovernance/status/1584573244337700867?s=20&t=4HbMJlx3tbUAkK7msZ0OtA"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}