{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/focus-on-6-data-insights-core-unit/13827",
            "title": "\\xf0\\x9f\\x94\\x8e Focus On #6: Data Insights Core Unit ",
            "index": 13827,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "din-001",
                "pubcall-:-focus-on"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "5",
                    "time": "10/03/2022-19:59:59",
                    "content": "  Focus On #6: Data Insights Core Unit       For the 6th episode of Focus On, we will host the Data Insights Core Unit @data-insights-cu. The Data Insights team will share an update on their Core Unit’s work over the past several months, highlighting the tools and services the Core Unit supports for the community. Following the publication of several new MIPs, the Data Insights team will also explore what the future holds for the Core Unit, and welcomes any questions or comments regarding their strategy to accomplish their goals.  MIP39c2-SP31: Update Data Insights Core Unit Mandate MIP40c3-SP64: Add Data Insights Core Unit Budget   Join us!  @juan & @retro will host.  When Time in your local-timezone format: 2022-03-16T16:00:00Z Mark it on your Google Calendar!  Where Zoom call Passcode: COREUNIT Alternatively, use this:  Find your local number: Zoom International Dial-in Numbers - Zoom Meeting ID: 829 4277 3725 Passcode: COREUNIT  Attn:  @SES-Core-Unit, @gov-comms-core-unit, @GovAlpha-Core-Unit, @Growth-Core-Unit, @daif-core-unit, @Protocol-Engineering, @happiness-core-unit, @Oracles-Core-Unit, @Risk-Core-Unit, @Real-World-Finance, @dux-core-unit, @starknet-core-unit, @data-insights-cu, @collateral-core-unit,  @techops-core-unit, @immunefi-core-unit, @strat-fin-core-unit, @Recognized-Delegates ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp31-update-data-insights-core-unit-mandate/13790",
                        "https://forum.makerdao.com/t/mip40c3-sp64-add-data-insights-core-unit-budget/13791",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=N2Q0ZGcyZjZrMmJpOHJqZWc2bDgzMmw2ZnMgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-marzo/13987",
                        "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
                        "https://forum.makerdao.com/t/mip40c3-sp64-add-data-insights-core-unit-budget/13791/8",
                        "https://forum.makerdao.com/t/weekly-relay-march-8-14-2022/13906",
                        "https://forum.makerdao.com/t/ses-weekly-status-update-ecosystem-performance-api-dashboard-update/13829",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-marzo-de-2022/14181"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.928977272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#2",
                    "likes": "0",
                    "time": "11/03/2022-15:28:58",
                    "content": " Focus On Call - Episode #6  March 16th, 2022  Agenda   00:00: Intro with Juan  01:05: Discussion and Questions with Tadeo, Piotr, Tomek, and Leo.  43:16: Outro   Video https://youtu.be/Kn_FT2EjdwQ  Introduction  Juan  Agenda and Preamble 00:00  Hello to everyone. Welcome to another Focus On call. This is episode #6. We have the pleasure of receiving the Data Insights CU. Tadeo, Piotr, Tomek, and Leo will be explaining what they do, how they provide value to the community and other CUs, and potentially discussing some of the updates to the budget. For those who do not know me, my name is Juan, the Sustainable Ecosystem Scaling CU facilitator at MakerDAO. If anyone has any questions, please intervene politely. We will have much time in the end, but if there is something you would like to say and it is relevant, you can potentially interject. I do not think that the Data Insights CU guys will mind too much. For other episodes of FO, please check the forum.   Discussion  Tadeo, Piotr, Tomek, and Leo. 01:05  Data Insights CU1920×1167 144 KB   Agenda1920×1133 137 KB   CU Mission &amp; Strategy1920×1137 214 KB   CU Team1917×1137 150 KB   Products and Services1920×1118 127 KB   Website1920×1115 166 KB   Datasets1919×1108 156 KB   Examples1920×1128 154 KB   API1920×1119 156 KB   Google Sheets1920×1126 106 KB   GUIs1920×1128 239 KB   The Future1920×1111 157 KB   Roadmap1920×1129 192 KB   Thank you!1920×1122 179 KB   Questions 18:51 - Juan: For the non-technical user, what is the easiest way to access the data? Is it going to your website to see what datasets you have or what you would recommend? 19:49 - Juan: Is this data open to the community outside of MakerDAO, or do you need some code or password to access it and give it to any CU that requests that? 21:57 - Juan: On the cost side, you also have to run an archive note to access the blockchain. How do you manage those costs and ensure that they are transferred properly? 22:59 - Frank Cruz: I noticed that you have been posting on the forum about the possibility of working with the RWF team on doing some reporting, perhaps a data dashboard. Can anybody go on this dashboard and get an analysis monthly about how much RWA originators are lending, how much they are collecting, how many of the loans are in default, maybe they are 30 days late, 60 days late, etc.? Is that how you envision this dashboard? 25:30 - Frank Cruz: With all this data you are putting out there, like the MCD Voter Tracker, is there any way we can monetize this for the benefit of MKR token holders or MakerDAO soon? 26:23 - Frank Cruz: What is your thought process regarding capturing some API datasets from L2s like StarkNet shortly? 29:16 - Juan: I had a quick question regarding one of the graphics where the vaults were open, and I saw that one was MakerDAO. Was that Oasis, or what does MakerDAO mean in that context? 29:54 - Juan: Tadeo mentioned that you will be trying to digitize the data coming from RWA and that that might include a lot of pdfs. How are you planning on doing this? Is it either hiring some solution to scan for documents or is it more like outsourcing everything to some third-world country? 31:35 - Juan: Regarding the budget, there were many concerns raised by the community members. Do you want to address those or comment on them? 32:33 - Juan: One of the comments was about potentially posting a budget to keep operations running and doing this separately. Is that something that you are considering? 33:52 - Juan: How would things look if this budget gets voted down and things stay as they were voted four months ago. What would that look like for MakerDAO? 35:35 - Many of the new mandates involve RWA and L2, where Maker is still not very present. Would you consider as a team waiting for this budget until Maker is there, or is it something that you want to start before for any given reason? 36:49 - PaperImperium: Would separate increases for L2 and RWA be brought forward to separate them if this gets voted down? 38:09 - Kianga Daverington: Do you have data on the visibility of your different websites, and who is using the information? 42:34 - Juan : What is the best way of reaching you?  Closing Comment  Juan Guillén  Outro 43:16  Thank you to everyone for joining. It was great having you. Let us keep the discussions going at forum.makerdao.com.   Credits  Kunfu-po produced this summary.  @gala produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/Kn_FT2EjdwQ?t=65",
                        "https://youtu.be/Kn_FT2EjdwQ?t=2596",
                        "https://youtu.be/Kn_FT2EjdwQ",
                        "https://youtu.be/Kn_FT2EjdwQ",
                        "https://forum.makerdao.com/search?q=focus%20on",
                        "https://youtu.be/Kn_FT2EjdwQ?t=65",
                        "https://youtu.be/Kn_FT2EjdwQ?t=1131",
                        "https://youtu.be/Kn_FT2EjdwQ?t=1189",
                        "https://youtu.be/Kn_FT2EjdwQ?t=1317",
                        "https://youtu.be/Kn_FT2EjdwQ?t=1379",
                        "https://youtu.be/Kn_FT2EjdwQ?t=1530",
                        "https://youtu.be/Kn_FT2EjdwQ?t=1583",
                        "https://youtu.be/Kn_FT2EjdwQ?t=1766",
                        "https://youtu.be/Kn_FT2EjdwQ?t=1794",
                        "https://youtu.be/Kn_FT2EjdwQ?t=1895",
                        "https://youtu.be/Kn_FT2EjdwQ?t=1953",
                        "https://youtu.be/Kn_FT2EjdwQ?t=2032",
                        "https://youtu.be/Kn_FT2EjdwQ?t=2135",
                        "https://youtu.be/Kn_FT2EjdwQ?t=2209",
                        "https://youtu.be/Kn_FT2EjdwQ?t=2289",
                        "https://youtu.be/Kn_FT2EjdwQ?t=2554",
                        "https://youtu.be/Kn_FT2EjdwQ?t=2596",
                        "http://forum.makerdao.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.773562235255784
                }
            ]
        }
    ]
}