{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/call-for-makerdao-facilitators-to-share-a-multisig/7977",
            "title": "Call for MakerDAO Facilitators to share a multisig ",
            "index": 7977,
            "category": [
                "Governance"
            ],
            "tags": [
                "multi-sig",
                "cpm-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#1",
                    "likes": "8",
                    "time": "11/05/2021-03:11:41",
                    "content": "MakerDAO Facilitators, I am asking five volunteers who can share the multisig of a Moonshot Fund of 5 million DAI. Here’s a brief explanation of why this is needed:  The proposed Strategic Marcomms unit identifies and anticipates a problem of ad campaigns that require confidentiality and swift decisions, which the DAO can’t easily provide. The heart of the problem is that the unit wouldn’t be able to share details or data of an upcoming campaigns as signing NDAs is a standard business practice. The unit comes up with the Moonshot Fund as a solution, putting aside 5 million DAI which enables the unit to act on offers that provide great opportunities with high ROI. To ensure the Moonshot Fund is safely guarded, I ask five facilitators who can share the multisig of the fund in a separate wallet. *This way, it eases concerns by some of the community members, and it also enables the Strategic Marcomms to perform its mandate.  You can find relevant and related posts here: Strategic Marcomms Core Unit & Budget [Campaigning] Vote NO on “Inclusion Poll for Strategic Marcomms Core Unit MIP Set - May 10, 2021” Are we having a loud minority problem? [CAMPAIGN: MIP39c2-SP9] Vote YES on “Inclusion Poll for Strategic Marcomms Core Unit MIP Set – May 10, 2021.” The discussions have also taken place in the governance-and-risk channel in Maker’s Rocket Chat. Adding MakerDAO Facilitators here to increase the visibility of this post. @longforwisdom @davidutro @primoz @SebVentures @derek @Nadia @Coulter @MakerMikeP @seth @amyjung @juan ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-strategic-marcomms-core-unit/7189/2",
                        "https://forum.makerdao.com/t/mip40c2-spx-strategic-marcomms-core-unit-budget-framework/7190",
                        "https://forum.makerdao.com/t/campaigning-vote-no-on-inclusion-poll-for-strategic-marcomms-core-unit-mip-set-may-10-2021/7951",
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972",
                        "https://forum.makerdao.com/t/campaign-mip39c2-sp9-vote-yes-on-inclusion-poll-for-strategic-marcomms-core-unit-mip-set-may-10-2021/7958"
                    ],
                    "GPT-summary": "The author of the post is explaining the need for five volunteers to share the multisig of a Moonshot Fund of 5 million DAI. The proposed Strategic Marcomms unit identifies and anticipates a problem of ad campaigns that require confidentiality and swift decisions, which the DAO can’t easily provide. The author is asking for five facilitators who can share the multisig of the fund in a separate wallet. The post also mentions related discussions and provides a list of MakerDAO Facilitators to increase the visibility of the post.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.315151515151516
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/05/2021-13:42:52",
                    "content": "Hey Kathleen, Just a heads up: I moved this thread from the MIPs category to Governance and added several useful tags. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#3",
                    "likes": "1",
                    "time": "11/05/2021-13:44:26",
                    "content": "Thanks Elihu. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "10/08/2021-19:45:17",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}