{
    "poll_list": [
        {
            "title": "Offboard the BAT-A Vault Type - October 4, 2021",
            "index": "10467",
            "option": "Yes",
            "supporting_mkr": "62,546",
            "highest_fraction": 1.0
        },
        {
            "title": "Offboard the ZRX-A Vault Type - October 4, 2021",
            "index": "10467",
            "option": "Yes",
            "supporting_mkr": "60,981",
            "highest_fraction": 0.97
        },
        {
            "title": "Offboard the LRC-A Vault Type - October 4, 2021",
            "index": "10467",
            "option": "Yes",
            "supporting_mkr": "62,546",
            "highest_fraction": 1.0
        },
        {
            "title": "Offboard the UNIV2LINKETH-A Vault Type - October 4, 2021",
            "index": "10467",
            "option": "Yes",
            "supporting_mkr": "62,546",
            "highest_fraction": 1.0
        },
        {
            "title": "Offboard the UNIV2AAVEETH-A Vault Type - October 4, 2021",
            "index": "10467",
            "option": "Yes",
            "supporting_mkr": "62,546",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-offboard-mana-bat-zrx-lrc-univ2-linketh-and-univ2-aaveeth/10467",
            "title": "[Signal Request] Offboard MANA, BAT, ZRX, LRC, UNIV2-LINKETH and UNIV2-AAVEETH ",
            "index": 10467,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "lrc",
                "mana",
                "zrx",
                "bat",
                "sig-status-accepted",
                "uni-v2-link-eth",
                "collateral-offboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#1",
                    "likes": "11",
                    "time": "23/09/2021-10:47:34",
                    "content": "Overview This signal request is the continuation of the process of offboarding the remaining unprofitable vault types agreed on and discussed by the community in the recent forum thread with the following proposed parameter changes. Signal request only considers vault types which were voted as yes on the mentioned thread; MANA-A, BAT-A, ZRX-A, LRC-A, UNIV2-LINKETH-A and UNIV2-AAVEETH-A. Each vault type has an individual poll, please vote on all of them. These vault types are problematic either because there is low demand for them, or the low liquidity on the Ethereum markets prevent us from increasing the debt ceiling further due to high slippage. In either case, the gas cost for maintaining oracles for these collaterals is greater than inflow from the stability fee. Proposed parameters were set in a way, where we try to minimize the damage done to existing vault owners while ensuring that sufficient amount of debt will either be repaid or less desirable liquidated with minimal costs for the vault owners. Due to high potential slippage on some of the collaterals, it is prefered to produce liquidations in a more linear manner, but of course we can not impact the collateral ratio distribution within the vault types. The liquidation ratio will be increased using the dss-lerp, where we expect that keepers will call the tick() to update the value when needed. The end parameter of dss-lerp is determined by a formula to account for potential price change from the time of this signal request until the actual activation of parameter changes and the duration of liquidation ratio increase. If the end value would be static, chances are that some vaults would be liquidated faster than we would want in the case of price decrease, while in the case of price increase some of the vaults could potentially end up higher than the end value and avoid liquidation, assuming that vault is not managed. The process of choosing these parameters based on the current state of vault types, the formula for determining end value and the projection of debt liquidated can be seen here. Some vaults with low debt amounts, which are likely dust or their liquidation profitability is questionable, will remain open. There is also a possibility that some vault owners will greatly increase their collateral ratio to avoid liquidation produced by this signal request. We will clean up such cases later in time with another action which is NOT part of this signal request. Proposed Offboarding Parameters Proposed parameter changes;  Set liquidation penalty to 0% Set debt ceiling to 0 Set duration of dss-lerp for liquidation ratio to 60 days Set end parameter of dss-lerp for liquidation ratio for each vault type as the following; highest collateral ratio vault within each vault type which has a higher debt than 15,000 dai multiplied with 1.5, rounded on hundred. In the case where the vault type has no vault with debt above 15,000 dai, the formula for calculating the end parameter for liquidation ratio will consider the highest collateral ratio vault.  Example of end parameter for BAT-A calculation; Highest CR vault with more than 15k dai debt is #2444 currently at 438.95%. After multiplying with 1.5, we get 658.43% and after rounding, we get 700%. The final LRs based on the formula above were; BAT-A 800%, ZRX-A 900%, LRC-A  2600%, UNIV2-LINKETH-A 300% and UNIV2-AAVEETH-A 400%. Signal Request Polls (each vault type has an individual poll)    Do you support the proposed parameter changes stated above to offboard the MANA-A  Yes No Abstain     0 voters        Do you support the proposed parameter changes stated above to offboard the BAT-A  Yes No Abstain     0 voters        Do you support the proposed parameter changes stated above to offboard the ZRX-A  Yes No Abstain     0 voters        Do you support the proposed parameter changes stated above to offboard the LRC-A  Yes No Abstain     0 voters        Do you support the proposed parameter changes stated above to offboard the UNIV2-LINKETH-A  Yes No Abstain     0 voters        Do you support the proposed parameter changes stated above to offboard the UNIV2-AAVEETH-A  Yes No Abstain     0 voters     Next Steps The polls will run until September 30, 2021 22:00 UTC; their outcomes will either result in on-chain polls on October 4, 2021 assuming the outcomes are yes, or will be reinitiated with different parameters and/or strategy. ",
                    "links": [
                        "https://github.com/makerdao/dss-lerp",
                        "https://docs.google.com/spreadsheets/d/1muiEhzkh_FFGm-slsRBmNntK8ev11atQTtgNlLjis9A/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1muiEhzkh_FFGm-slsRBmNntK8ev11atQTtgNlLjis9A/edit#gid=173205307",
                        "https://forum.makerdao.com/t/signal-request-offboard-unprofitable-collateral-types/8628/29",
                        "https://forum.makerdao.com/t/maker-governance-review-2021/12478",
                        "https://forum.makerdao.com/t/offboarding-unprofitable-collaterals/9785/13",
                        "https://forum.makerdao.com/t/proposed-offboarding-collateral-parameters-2/11548",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-17th-23rd/10475",
                        "https://forum.makerdao.com/t/maker-relay-ep-64/10540",
                        "https://forum.makerdao.com/t/maker-relay-ep-64-en-espanol/10548",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-weeks-ending-september-19th-26th-2021/10650",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-september-2021/10659",
                        "https://forum.makerdao.com/t/maker-relay-ep-65/10697",
                        "https://forum.makerdao.com/t/maker-relay-ep-65-en-espanol/10784"
                    ],
                    "GPT-summary": "The post is a signal request for offboarding unprofitable vault types due to low demand or low liquidity. The author explains the proposed parameter changes and the formula for determining the end value of the liquidation ratio. The post includes individual polls for each vault type and invites the community to vote on them. The post also mentions the possibility of some vault owners increasing their collateral ratio to avoid liquidation and the plan to address such cases later. Some 3rd parties may have questions or constructive criticism about the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.241666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "4",
                    "time": "23/09/2021-10:51:12",
                    "content": "thanks @rema for bringing up a plan to offboard those ilks! housekeeping also means you need to get rid of toys that are no longer in use  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#3",
                    "likes": "1",
                    "time": "23/09/2021-14:52:58",
                    "content": "Time to cut some fat, for sure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makerburn",
                    "index": "#4",
                    "likes": "3",
                    "time": "24/09/2021-10:23:46",
                    "content": "When you take liquidations into account, ZRX has actually been quite profitable (669k surplus)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#5",
                    "likes": "9",
                    "time": "24/09/2021-13:42:16",
                    "content": "Primary function of liquidation penalty is to incentivize vault owners to prevent liquidations in the first place. I don’t think we should count on it as the inflow to cover the cost of oracles. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "6",
                    "time": "24/09/2021-14:06:41",
                    "content": "    rema:  Primary function of liquidation penalty is to incentivize vault owners to prevent liquidations in the first place   We also don’t want to be using a business model that requires our customers to get rekt for us to make a profit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makerburn",
                    "index": "#7",
                    "likes": "1",
                    "time": "25/09/2021-02:34:22",
                    "content": "Alternatively, ZRX vault holders has already covered a part of the risk/cost to the protocol through liquidations and we should let them keep their vaults for a while…? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#8",
                    "likes": "14",
                    "time": "27/09/2021-17:04:19",
                    "content": "I voted NO to offboard MANA and ZRX, because for the following reasons:  Utilization of both vaults is at 99% There are almost 5M DAI that comes from the MANA vault As @makerburn  stated, with ZRX liquidations represented 669k DAI for the protocol (and I understand what Rema and Paper say, that liquidations are not what we are looking for, but in terms of profitability it looks like a profitable vault)  To offboard collaterals it’s important to establish clear rules, and a definition of what is considered unprofitable collateral, and with that criteria choose all collaterals under that category:  What is “low demand” for a vault? -in numbers- what is “low liquidity on the Ethereum markets”?  -in numbers- How often are we going to evaluate these conditions? What if the collateral has normal or high liquidity but low demand? (or vice versa)  Transparency and clarity are needed for these processes, that way it’s easy for us to do some maintenance to the protocol and for our partners, it’s easy to understand if it makes sense for them to propose their token as collateral and what do they have to do to maintain the token as collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.047916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cazala",
                    "index": "#9",
                    "likes": "8",
                    "time": "29/09/2021-12:55:18",
                    "content": "I would vote on NO on the offboarding of MANA but I can’t vote  even tho I’ve had an account on this forum for a couple years now and voted on other polls, I dunno how to get to trust level 2. As Nadie said above, the MANA vaults are at 99% utilization and the last time the ceiling was raised ~2 weeks ago by 0.5M DAI it was shortly maxed out. So what seems to be blocking us to reach the desired 10M target (i’m taking that number from this post by monet-supply Offboarding Unprofitable Collaterals) is the debt ceiling, which I’ve been told it can’t be raised more due to low on-chain liquidity (although MANA has way higher liquidity on CEXes), so I’ve already spoke with some of the Decentraland DAO facilitators and I’m putting together a proposal to provide on-chain liquidity using the DAO’s assets. My idea is to propose providing around $5M to $10M in pairs against stablecoins and eth. If this proposal were to pass it would increase the current on-chain liquidity by around 3x. This still needs to be formally written, voted, and if enacted it will take a while to fully execute, but I believe eventually it will let us increase the debt ceiling, and the demand seems to be there to get to the target DAI generated. I’m asking governance to give the MANA collateral some more time for consideration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "3",
                    "time": "29/09/2021-14:05:08",
                    "content": "   Blog – 25 Jun 18    Understanding Discourse Trust Levels The user trust system is a fundamental cornerstone of Discourse. Trust levels are a way of…      Get to trust level 2 by…  Visiting at least 15 days, not sequentially Casting at least 1 like Receiving at least 1 like Replying to at least 3 different topics Entering at least 20 topics Reading at least 100 posts Spend a total of 60 minutes reading posts  Generally speaking, not an extremely high bar, but you do need to have been around for a bit. It’s meant to represent being a member of a community. ",
                    "links": [
                        "https://blog.discourse.org/2018/06/understanding-discourse-trust-levels/"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.205
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cazala",
                    "index": "#12",
                    "likes": "4",
                    "time": "29/09/2021-15:08:32",
                    "content": "Thanks! Sadly I won’t make it before the end of the poll tomorrow  i’m missing a few visiting days. Next time I’ll be voting for sure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "2",
                    "time": "29/09/2021-15:57:50",
                    "content": "Changed my MANA poll vote to “No” – I personally have been a long-time fan of Decentraland I always viewed them as a super talented Team (in fact my first taste of MATIC (Polygon) was because of the protocol) – and will continue to cheer them on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.604166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#14",
                    "likes": "8",
                    "time": "30/09/2021-14:14:27",
                    "content": "I want to point out some things in regards to MANA and ZRX. We are currently subsidising these vault types because the stability fee is set to 3% and 4% respectively, while our calculated risk premium is at 16.8% and 30%. The current debt ceiling for both assets is also above the calculated maximum debt ceiling (risk premium=10%). You can see these parameters visualized on our risk dashboard under the Historical Vault Stats, select Risk Premium and Maximum Debt Ceiling - MANA, ZRX. At the current state, we should not increase the debt ceiling and should increase the stability fee. Market liquidity has to be increased substantially if we want to increase the debt ceiling, at least at a stability fee, where the vault would still be attractive for users. CEX volume is much less reliable than on-chain liquidity. Mainly because it can include wash trading and volume doesn’t mean there is guaranteed market depth. In addition, liquidation arbitrage conducted via CEX requires capital, KYC in most cases and bears market risk for the liquidator, which is why we prefer to consider on-chain markets. Community is currently signaling to not accept the proposed offboarding parameters for MANA-A, which likely means it will remain listed for the time being, which will offer more time for the Decentraland community to increase market liquidity based on post from @cazala here (assuming votes do not change drastically in the following hours). I hope this will be realized, and MANA becomes a non problematic vault type. ZRX is currently quite close - 35% for yes and 27% for no. Here I would preferably like to see a higher gap between yes and no. ",
                    "links": [
                        "https://maker.blockanalitica.com/vaults/ZRX-A/",
                        "https://forum.makerdao.com/t/offboarding-unprofitable-collaterals/9785/15",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-september-2021/10659"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.399305555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#15",
                    "likes": "0",
                    "time": "30/09/2021-16:27:32",
                    "content": "    cazala:  so I’ve already spoke with some of the Decentraland DAO facilitators and I’m putting together a proposal to provide on-chain liquidity using the DAO’s assets. My idea is to propose providing around $5M to $10M in pairs against stablecoins and eth.   I have already done analysis on this generally for how it would be better for a DAO to create value for the community via Token-Stablecoin pairs.   Maker would do well to encourage not just a Token vault but a Token-DAI Uniswap V2 LP because the price volitality in a v2 Token-Stablecoin is the sqrt(Token Price). I would encourage the DAO here to NOT do the Token-ETH but focus all liquidity into a single Token-Stablecoin (DAI ofc for Maker would be the preferred stablecoin). Honestly going to have to take a look at why risk has such a negative view on this in terms of the risk analysis:     rema:  ou can see these parameters visualized on our risk dashboard under the Historical Vault Stats, select Risk Premium and Maximum Debt Ceiling - MANA , ZRX. At the current state, we should not increase the debt ceiling and should increase the stability fee.   Total cap here is around 1B so pretty much at the edge of my MC level. ZRX I abstained on.   I am mixed there and the MC again near the MC 1B level. I also am having a hard time thinking these have low demand if they are at max DC. Also help me out with some data.  I am sure I read somewhere else but what is the cost for an profile (in DAI or in ETH if that is the actual cost) oracle these days as it is looking like oracle costs relative to collateral MC and potential target earnings will become a limiting factor. ",
                    "links": [
                        "https://maker.blockanalitica.com/vaults/ZRX-A/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.404448621553884
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#16",
                    "likes": "1",
                    "time": "30/09/2021-17:18:48",
                    "content": "I am not sure what you mean with the 1B MC. Risk team suggests setting the maximum debt ceiling at the level where the risk premium hits 10%, with both MANA and ZRX we are currently above the level, while the stability fee is much lower than the calculated risk premium which considers current debt exposure. For the demand estimation, I looked at large positions including MANA and ZRX on Aave and Compound. MANA is only present on Aave, where majority of supply positions only supply and not use it as collateral (e.g. 1, 2) and in some cases, MANA is one of the minor assets in collateral (these other markets allow for cross collateralization of positions). Currently a lot of MANA is borrowed, likely shorted which increases the rates and therefore demand for supplying it, which does not mean leverage demand for it - borrow rate is 75% and supply is 23%. ZRX is present on both markets, Compound dominates with about 95% market share, because it has liquidity mining enabled for the asset (currently 0% due to the recent issue at Compound). For ZRX, the largest account is recursive farming, second largest is using it as collateral as he has very small leverage and market risk, so basically just a farming position as well, the third largest is an actual organic long position. These three present 88% of all ZRX supplied and organic long present 9%. Nevertheless, even if we see some demand, as it is the case for ZRX relative to MANA, we can’t just ignore the fact that such exposure is impossible to liquidate without insane slippage, you can see it here. The cost of maintaining oracles can be very volatile, mostly because gas prices on Ethereum are highly volatile and unpredictable. The rule of thumb is that a vault type with some normal stability fee of a few % should have at least a 10M debt ceiling to cover these costs, you can get more info here and even more detailed info about it here. But just to mention this, oracles are more quantifiable costs that an additional collateral brings, there are also resources that different CU and non CU community members need to spend on each collateral asset, which could potentially be spent on more productive things. ",
                    "links": [
                        "https://debank.com/profile/0x4882bdf067eaae032cd27b80534fe721965304b0",
                        "https://debank.com/profile/0x58485ea7106891bdd94c37ced30c6fdbc5293b16",
                        "https://debank.com/profile/0x57ca561798413a20508b6bc997481e784f3e6e5f",
                        "https://debank.com/profile/0x3be93fc6c89fd318679ce8f95683ee12183181f1",
                        "https://debank.com/profile/0x3be93fc6c89fd318679ce8f95683ee12183181f1",
                        "https://forum.makerdao.com/t/signal-request-offboard-unprofitable-collateral-types/8628",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-142-thursday-may-20-17-00-utc/8116/4#nik-kunkel"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.029511634199134
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "7",
                    "time": "30/09/2021-22:15:12",
                    "content": "Results:  MANA-A no further action at the current time. BAT-A offboarding will proceed to on-chain poll on Monday. ZRX-A offboarding will proceed to on-chain poll on Monday. LRC-A offboarding will proceed to on-chain poll on Monday. UNIV2-LINKETH-A offboarding will proceed to on-chain poll on Monday. UNIV2-AAVEETH-A offboarding will proceed to on-chain poll on Monday.  Big thanks to those that took the time to vote! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "0",
                    "time": "13/10/2021-11:18:01",
                    "content": "The offboarding process was started for these collaterals (all but MANA-A) with the passing of this executive vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#19",
                    "likes": "0",
                    "time": "12/11/2021-21:18:03",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "126"
}