{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/different-approach-to-rate-setting/3889",
            "title": "Different Approach to Rate Setting ",
            "index": 3889,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "alignment",
                "rates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "26",
                    "time": "30/08/2020-19:20:05",
                    "content": "Where we are now The DAI supply has increased by more than 250% (about 300m) in the 2-3 months since Compound kickstarted the yield farming craze. Before that period, the DAI peg was still recovering from the Black Thursday event when the DAI price reached $1.12 and needed about 3 months to finally recover in mid June, right before Compound yield farming was announced. This recovery was made possible due to bullish sentiment surrounding ETH in the second quarter this year. Since then, ETH is still performing well and organic demand for leverage has only increased. However, DAI selling from leverage seekers could not offset the yield farming craze and on average DAI has traded at around $1.02. Potentially, market making activities also decreased due to lucrative opportunities from yield farming. Importantly, this all happened despite heavily increased debt ceilings, the onboarding of new collateral assets and 0% rates across the board. The issue is that all the conventional monetary tools at hand simply cannot compete with massive DAI demand from yield farmers and new price mechanics introduced by several AMMs like Curve. Unconventional Solutions There are multiple ideas floating around in Maker Governance about how we could address the current situation:  PSM Negative rates Strategic reserves through MKR dilution Direct protocol DAI minting and participation in yield farming opportunities or arbitrage directly  Unfortunately, all of them have some technical or legal implications in the short term. Furthermore, certain solutions also seem to divide the community on topics such as:  Whether negative rates are positive for DAI adoption and potential technical implementation issues for partners Should MKR build strategic reserves, dilute itself and spend its capital that’s actually needed for coverage of loss events Does DAI become a USDC wrapper  It feels like these kinds of issues accompanied with the technical constraints of implementing unconventional tools to manage the peg mean that these solutions need more time for discussion, or a more serious peg deviation to implement. At time of writing, the DAI price stands at $1.01. Current State of the Peg In our recent analysis we showed how the DAI price moves by a few cents intraday only due to new yield farming opportunities. We also showed that such movements can be in our favour and we recently predicted one led by Curve farming. About two thirds of DAI issued by Vaults is currently being deposited in yield farms directly by them. This shows that if stability fees are changed in this dynamic landscape, this potentially doesn’t affect the peg because other more powerful forces are driving the change in price. In other words, a few percentage difference in fee charged to Maker Vault owners doesn’t dissuade them from either speculating on 50-1000% APY yield farming opportunities or speculating on the current bull run of crypto assets used as collateral. Different Approach I have written in the past how Maker actually pursues three goals when setting rates: Risk Policy, Monetary Policy and Business Policy. Business policy is something that was overlooked thus far since our primary goal was and still is to manage DAI price as close as possible to $1. If we are able to reach DAI dollar parity, Risk and Business Policy can both be pursued with more flexibility. Let me first explain why Business Policy is important and then address how we can sort out peg issues. MakerDAO Vault users prefer stable and competitive rates. If we are able to solve peg issues unrelated to how we set fees, we can finally start becoming more rate competitive and reliable, which is of high importance when we start adding real world assets (RWA) as collateral. This also means we need to change the way rates are set through Base rate on a weekly basis and set rates less frequently by having more focus on the competitive landscape and portfolio risk. This however doesn’t mean our conventional monetary levers are completely ignored; if we are able to increase stability fee, DSR can be used again as a more regularly used monetary lever. Also in extreme situations we can still use more aggressive stability fee or debt ceiling adjustments to help with peg deviations. Finally, the community is aware of how low fees are unsustainable long term in cases when funds are needed to cover potential shortfall, particularly now that debt exposure is increasing at a fast pace. Assuming debt exposure doesn’t change as much, Maker protocol would benefit from 4m - 12m revenue per year assuming increased average fees in range of 1% to 3%. Assuming additional revenue is collected from penalty fees, we could be aiming towards 15m revenue per year, which would be a nice boost to MakerDAO’s reserves to protect against losses. Importantly, maintaining a system surplus will allow us to onboard and compensate new EPCs in order for MakerDAO to become self-sustainable. For this to happen it is critical that the Protocol has a more regular inflow of funds. Conclusions To sum up above concerns:  DAI price doesn’t necessarily react heavily to increased SF due to other more powerful forces that determine the price currently (DAI demand from yield farming) Stable and higher but still competitive rates should be preferred from business policy standpoint MakerDAO needs more income from rates to cover potential shortfall and make governance self sustainable and grow domain teams  Cause and Effect In practice, the major concern about increasing stability fees from a DAI peg viewpoint is potentially causing liquidity drain, vault owners refinancing to other stablecoin debt denominated borrowings and causing the DAI price to increase. Therefore it’s important to always pick a fee that doesn’t cause massive refinancing and is in line with our Business Policy and position in the competitive landscape. “Organic” Vaults are one of MakerDAO’s long term core stakeholders and retaining them is of large importance. Luckily ETH is in a bull run and as long as we don’t increase fees too much over competitive stablecoin borrowings, we shouldn’t lose them. Even at 0% fees, using MakerDAO to borrow DAI is more expensive than borrowing DAI at Compound, where COMP rewards already offset the current borrow rate for a user (net APY of 7.5%). This tells me users still prefer to use MakerDAO when it comes to DAI borrowing, but surely there is a breakeven rate. Defending the Peg In case we trigger a huge DAI price increase due to increased SF, this could be mitigated by a very low liquidation ratio (LR) for stablecoin vaults, which may have a similar effect as to what PSM proposal was trying to achieve. If governance sets the USDC LR to a level of 102%, we effectively put a ceiling on DAI price of $1.02, assuming the debt ceiling isn’t utilized fully. Of course such a strategy also has side effects and these were discussed in the PSM proposal. It is unavoidable that with lower LR on USDC we keep increasing USDC exposure, particularly in times of high DAI demand (new DAI yield farm becoming hot again). We also must be aware that we will likely need to have low fees on USDC vaults should LR be kept really low. Further, some of the USDC vaults might also need to be manually liquidated as yield farmers could abandon them in case DAI price decrease doesn’t offset their liability from fees and remaining collateral. Here I think governance needs to decide how much USDC exposure is willing to tolerate versus how much peg deviation is acceptable. Importantly, governance also needs to consider other stable coin collateral onboarding to diversify risks associated with stable coins. The other important fact is that we also need to increase the number of onboarded collateral assets with high minting potential and charge fees. We will need more community contributors to assist with risk analysis and if protocol starts earning money from higher fees, the protocol should have the funds to compensate these contributors. Yield Farming A short note on yield farming. As noted, yield farming changed the landscape in DeFi and affected MakerDAO. There are ways to mitigate it and meanwhile collect fees. Again as we showed, about two thirds of current DAI supply minted by certain Vaults is used in yield farming. Those Vaults shouldn’t be hurt by a few percentage points lower yield and they can’t really go anywhere else to borrow large amounts of DAI that is needed to farm. We must find the best strategy to a) retain them, as many of them are providing DAI liquidity in venues such as Curve and b) charge fees that are still tolerable for them. In such a way MakerDAO gets indirect participation in their APY. There are also more exotic alternatives available such as onboarding farmed assets as collateral (yCRV, cDAI, cUSDC), but risks need to be properly addressed first. Next Steps  Discussion around this proposal, specifically:  Is the general strategy of introducing more business policy logic into governance sound enough and doesn’t affect our approach to risk and peg? Is governance willing to change the way how rates are set? How does governance view low LR on USDC and associated risks with potentially increased exposure? Do we want to use low LR on USDC only when peg escalates or do we put a ceiling on DAI price immediately by implementing it? What is the peg deviation tolerance on DAI to assess proper LR for USDC should we decrease it immediately to defend against price appreciation?   Proceed with a Signal request.  ",
                    "links": [
                        "https://twitter.com/PrimozKordez/status/1293108748169482246?s=20",
                        "https://forum.makerdao.com/t/business-policy-of-rate-setting/2609",
                        "https://forum.makerdao.com/t/signal-request-increase-eth-a-risk-premium/3377",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-108-thursday-september-3-16-00-utc/3850/2",
                        "https://forum.makerdao.com/t/wanted-risk-domain-monitoring-tools/4168",
                        "https://forum.makerdao.com/t/signal-request-forum-poll-raise-the-eth-a-debt-ceiling/3927/8",
                        "https://forum.makerdao.com/t/signal-request-quantitative-easing-to-fix-the-peg-aka-manual-psm/3902",
                        "https://forum.makerdao.com/t/maker-relay-ep-10/3907",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-114-thursday-october-15-16-00-utc/4657/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-114-thursday-october-15-16-00-utc/4657/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-114-thursday-october-15-16-00-utc/4657/5",
                        "https://forum.makerdao.com/t/if-you-are-not-going-to-reduce-stability-fee-then-lower-the-overcollateralization-percentage/4666/4",
                        "https://forum.makerdao.com/t/informal-poll-guidance-on-rates-v2/4444"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5160366419294995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "8",
                    "time": "30/08/2020-20:11:52",
                    "content": "Thanks for this. I would love to increase the base rate so that we can get 1-2% fees as I don’t think that would affect DAI supply too much. The biggest challenge is swaying popular sentiment and more importantly whale voters. It’s nice to hear experts advocating for a rate increase and hopefully that allows us to tip the scales to start pushing in that direction. It would be nice to be able to start paying more people for things so we can grow in ways other than supply which would actually have a more holistic effect on the supply, peg, new collateral, etc. Not to mention starting to insure the system for the next inevitable collapse. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.19760101010101
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#3",
                    "likes": "9",
                    "time": "30/08/2020-20:25:56",
                    "content": "I echo your sentiment to have some kind of positive stability fee for three reasons:  There is no evidence that lowering the base rate to -4% has helped correct the DAI peg in this yield farming environment.  Likewise, there is no evidence that a non-zero stability fee will hurt the peg.  Simply, the demand for DAI significantly outweighs any nominal fee The DAI supply may be able to grow faster using the surplus to compensate additional domain team work. We have a significant backlog of collateral on-boarding, which at the current rate, will take years to get through Absence of a positive DSR is handicapping the use case of Dai for the key end user (“normal” people who aren’t yield farming).  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6841856060606055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "2",
                    "time": "30/08/2020-21:00:43",
                    "content": "Let me start with the fact that strategic reserves are not needing a MKR token holder dilution. It is one way out of 3. Moreover, with the USDC-M proposal (using cDAI), it would be enough to use 100k$ out of the surplus buffer to achieve unlimited leverage (and keep all the profit) and therefore keeping the promise 1 DAI = 1$ of collateral. This would separate the business policy from the peg policy in my mind and bring a new revenue stream. At the extreme (assuming enough diversification of workable collaterals), we no longer need vault holders (but obviously we love them when SF > 0%). We could put SF @ 1-2% without fear (the exact SF would be set to maximize fees not to solve the peg). There is currently low traction for that (2 likes), but I will push that again in the future. I’m not a big fan of low LR on USDC-A because it increases the risk, gives no profit to MKR, and we don’t control the DAI usage (some will likely be used to farm Compound if the past is predictive). The facility will not be used 100% (or even 50%) for solving the peg issue => more risk and no fees for the same effect. Moreover, we can’t dispose of USDC in an emergency because setting USDC-A risk premium @ 1000% to liquidate vaults quickly would be PR suicide (as it should be). In any case, @Aaron_Bartsch posted a good signal request in this direction. Indeed, we fully agree on the role of farming on the DAI peg and the need of revenues to have a workforce and sustainability.  I feel MakerDAO is moving toward the solution. Fully agree also on setting the rates using the competition as benchmark if that’s compatible with our risk appetite. ",
                    "links": [
                        "https://forum.makerdao.com/t/poll-should-makerdao-print-unbacked-dai-to-solve-the-peg-issue/3589/25",
                        "https://forum.makerdao.com/t/cdai-mip6-collateral-onboarding-application/3764",
                        "https://forum.makerdao.com/t/signal-request-should-we-reduce-the-usdc-a-collateralization-ratio/3886"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.638967803030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#5",
                    "likes": "2",
                    "time": "30/08/2020-21:02:13",
                    "content": "I agree it seems likely that a small positive stability fee will be well tolerated by current DAI borrowers.  It would be interesting to see the results of experimenting with this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4772727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#6",
                    "likes": "4",
                    "time": "31/08/2020-00:39:07",
                    "content": "I insist that SF is 0 is not desirable, it will not help DAI peg the dollar, but it will affect our system surplus. The facts tell us that a SF of 0 does not have the effect we have seen, so please abandon this conservative plan. If we want to improve DAI’s peg to the US dollar exchange rate, please choose another plan. An appropriate increase of SF to 1% to 3% will increase the system surplus and will not affect the exchange rate pegged to the US dollar. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#7",
                    "likes": "5",
                    "time": "31/08/2020-11:36:36",
                    "content": "This is a great post Primoz. I accept your premise that Yield Farming has returns that are an order of magnitude larger than the Stability Fees, so small changes in the Fees will not make a significant difference. Taking competitive inflection points into account is also helpful to maximize operational revenue while not losing all our business. To be clear, are you wanting to raise the Base Rate to 1-3% and reduce the frequency of the weekly adjustment vote or are you thinking of some entirely new mechanism? If we are to go down this route, my one concern is that we have a concrete plan for how this revenue will be spent to fix the Dai peg. Our bottleneck for collateral onboarding currently seems to be the domain teams, so do we have some way to parallelize that with more money available? I understand subsidizing risk compensation to MKR holders is clearly a temporary solution, but as I’ve said in the past, I think the biggest risk we face is a broken peg. The compensation will come when we reach market maturity. For now we want to grow. There is also still the foundation. Are they out of money? If we have a plan to increase collateral onboarding throughput and we need money to do so, why lean on vault owners when the foundation could cover it? So in summary, I could be on board with this plan provided there is a more clear action plan for how the new revenue will be spent to fix the peg. I would vote no for this plan if the only reason for doing so was to give us a surplus buffer for risk compensation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.305039026629936
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#8",
                    "likes": "3",
                    "time": "31/08/2020-13:22:14",
                    "content": "Great post. The business side of this is essential and must not be forgotten. Further, DAI needs more diverse collateral. At this risk of being a broken-record on this, the real-world asset initiative is paramount to introducing stability over time. Primary as it acts as a counterbalance for any rate increases on the digital asset side. While farming may not be rate sensitive today, collectively the future is uncertain as to what the rates will be. Moreover, Governance must balance bringing on yield assets while not injuring just the average guy / gal that is borrowing against his / her digital asset and has been for months. Going back for a moment, the community (via risk teams) needs to asses what is the risk associated with every collateral type and what is the “target risk premium” for that collateral. Today implementing those risk premiums out of the gate is not appropriate. It would cause an increase in the peg which collectively is not acceptable. Right now, the community (correctly) had needed somewhat put risk in the backseat in exchange for the peg. That said, we should all strive to know what the target risk really is. By doing so and having a reference point, one day, when real-world assets are on-boarded in bulk, MKR governance can start to move the RPs for all digital assets toward their target RPs and then use the DSR as the control mechanism with slight modifications to the RPs across the board. This will drive both stability for DAI and revenue to the MKR protocol. Until those days, defending the peg is essential and a keystone for the entire project. Stablecoins luckily can help get us through this rough patch in the project until it can organically have enough liquidity and market forces on its own. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.580086580086581
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#9",
                    "likes": "7",
                    "time": "31/08/2020-13:27:58",
                    "content": "Thanks everyone for valuable feedback. Let me try to address some concerns.     SebVentures:  Let me start with the fact that strategic reserves are not needing a MKR token holder dilution.   Apologies if my post implied that. I specifically wanted to address only that MKR capital is better to be used against potential losses rather than mitigating peg issues. I do agree though that reserves in some form are interesting versus MKR dilution, but only for the sake of protection, not peg mitigation. Also money raised through MKR capital (in any form) may not be enough to solve peg issues.     hexonaut:  To be clear, are you wanting to raise the Base Rate to 1-3% and reduce the frequency of the weekly adjustment vote or are you thinking of some entirely new mechanism?   Sorry if I wasn’t clear. I think we need a new mechanism that doesn’t use Base Rate. I know base rate simplifies things for governance and I was in favour of implementing it. But if we lower the frequency of rate setting, make rates more stable and competitive, the overhead of changing each collateral’s rate shouldn’t be too big. Rate setting becomes market driven and making sure we don’t underscore our portfolio risk by too much. Risk premium is still used and compared with SF that we set, so that we know how protected we are. This is still better than current situation where both portfolio risk and underpriced rates are basically a hostage of DAI price. If we can solve DAI peg with lower USDC liquidation ratio, or simply hope that higher SF won’t cause peg issues, we can start acting more market driven and assure our exposure is better protected. Otherwise we are always having this trilemma, where it is hard to satisfy all three conditions with one SF: peg in balance, stable market driven rate and compensation for portfolio risk. And to be clear 1-3% range for SF is not something I am proposing. Instead I would want people to focus more on competitive landscape and see what SF should be properly applied for each collateral type. There are constraints of course as we don’t want to cause massive unwinding of positions and peg deviation. Because even if we have a lower USDC LR in place to protect against peg issues, governance needs to consider what exposure to USDC is still tolerant. 1-3% range was just some range I came up with.     hexonaut:  So in summary, I could be on board with this plan provided there is a more clear action plan for how the new revenue will be spent to fix the peg. I would vote no for this plan if the only reason for doing so was to give us a surplus buffer for risk compensation.   As noted above, the idea above pursues three key things: risk compensation, more market driven fairly priced rates and peg mitigation through a potential lower USDC LR solution. Having more funds from higher rates though has positive side effects: we have long term self-sustainability to pay people who perform collateral onboarding assessments that scales DAI supply. By Cyrus leaving I can’t stress enough we need more people in risk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.550479282622139
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#10",
                    "likes": "1",
                    "time": "31/08/2020-13:51:07",
                    "content": "If I summarize: SF( C) = max(risk_premium( C), min_lending_rate_competitors(DAI_for_C_pair) ) for C each collateral we provide. Therefore we have always the lowest interest rate while avoiding taking risk we don’t want. Correct? This assume we take care of the DAI peg by other means (100% agree we must separate those topics). PS: Regarding strategic reserves, I’m just correcting my own mistake, it is 100% my fault if it blended with MKR as I implied it at the beginning. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lix",
                    "index": "#11",
                    "likes": "3",
                    "time": "31/08/2020-14:24:57",
                    "content": "Great post, Primoz. While negative rates are still my preferred solution to the peg problem, I am willing to try another route to fix Dai since MIP20 was so controversial. Even though it is risky, I think we’re left with no choice other than becoming a centralized wrapper to the decentralized world. On the PSM: The PSM is an overreach of power on our part. We need to let price discovery happen outside of Maker’s contracts. Cronje’s recent post sums it up nicely:  It’s about supporting each other and elevating those around us, not for our own personal well being, but for the space as a whole.  While 102% CR on USDC is similar to the PSM, I think an important distinction is that we are leaving the trading fees to other platforms. This gives the space more room to grow independent of our success, which is the way it needs to be. A low CR also allows for more price discovery below the threshold price. If we do lower the CR to 102% on USDC, then I would expect the debt ceiling to balloon upwards towards infinity. We need to be ok with this huge ceiling. USDC will most likely become the primary collateral in our portfolio, and this cannot be discouraged with a high risk premium or debt ceiling limitations.     Primoz:  We also must be aware that we will likely need to have low fees on USDC vaults should LR be kept really low.   If we want people to go up to 50x short Dai, then like you said above, fees need to be low. A 4% risk premium multiplied by 50x leverage is unreasonable. The risk premium needs to reflect this “pivot” in Makers direction. Not only are we accepting centralized collateral, by lowering the CR to 102%, we’re saying we prefer centralized collateral. I’m alright with this, only because it seems we’re out of alternative solutions. I suppose one could say that I’ve been “red pilled.” If negative rates are off the table; either the project becomes a wrapper for centralized assets, or the peg is at the whim of farmers and we earn 0 Dai in fees. Not an easy pill to swallow. ",
                    "links": [
                        "https://gov.yearn.finance/t/proposal-bolt-a-cfamm-facility-to-the-y-pool/3434/11?u=lix"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861991869918699
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#12",
                    "likes": "3",
                    "time": "31/08/2020-15:33:50",
                    "content": "    Primoz:  As noted above, the idea above pursues three key things: risk compensation, more market driven fairly priced rates and peg mitigation through a potential lower USDC LR solution. Having more funds from higher rates though has positive side effects: we have long term self-sustainability to pay people who perform collateral onboarding assessments that scales DAI supply. By Cyrus leaving I can’t stress enough we need more people in risk.   So I think there are a few separate issues here. I’ll try to break them out: First, let’s leave the lower USDC LR as a separate issue. I agree it should be lower to provide an upper limit on the Dai price. We can do this regardless of fee policy. With regards to your other two points: Risk Compensation: Long term we should totally compensate MKR holders for collateral / portfolio risk. In the short-term, however, I view the peg as a much greater risk to MKR holders. We are not in a mature market, and if you are looking at MKR from a purely risk/reward perspective, the returns from price appreciation (coming from a solid, working product) should outweigh the 1-5% from Stability Fees in a market that is 1/10 or 1/100 of the mature market size. It is because of this that I am not concerned at all with risk compensation at this stage. Market driven fairly price rates: I’d be more okay with this once the peg is fixed. At best moving to only slightly undercut the competition will have a neutral effect on the peg, and possibly some additional upward pressure (albeit a small amount compared to the farming pressure). This is maybe a bit more speculative, but I do not view this farming craze as sustainable. I think we just need to try and grow the supply as best we can to meet the demand, and wait it out. Things such as the yearn.finance yETH vault may help a lot to reduce the ridiculous APYs. Right now we are at the mercy of farming, but we may return to leverage being the dominant factor again in a few months. I think it’s important to maintain the Base Rate lever in this case. With regards to getting more people into the domain teams, I think this is important as well, but is money our biggest obstacle? How will increasing Maker protocol revenue assist with this in the short term? RWA are probably something that require more fixed, stable rates, but I still like using the Base Rate for general market dynamics on crypto-assets. We could exempt RWAs from the Base Rate model without needing to axe it altogether. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.687736742424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#13",
                    "likes": "9",
                    "time": "31/08/2020-16:40:15",
                    "content": "    Primoz:  Sorry if I wasn’t clear. I think we need a new mechanism that doesn’t use Base Rate. I know base rate simplifies things for governance and I was in favour of implementing it.   I’ll chime in here. From the technical perspective, the Base Rate is becoming somewhat unwieldy to manage on the smart contract side. It requires off-chain management of what the current base rate is supposed to be, which is currently maintained in a forum post, and because some executives don’t pass, we don’t have a good source of truth at a glance what this value should be at any given time. So, some amount of research is required weekly to figure out each collateral’s risk premium, the current base rate, and the expected base rate, and calculate these values accordingly. The system is now rapidly adding collateral types, and while voting around the base rate at negative values has little effect on collateral types that remain at 0%, every adjustment to the base rate once we’re positive is going to result in an edit to every system collateral stability fee. This will increase the cost and overhead of each spell for each new collateral added to the system, to the point where a single base rate change could modify dozens to hundreds of collateral values. We are being diligent with our audits and working on tooling to streamline the process, but it should go without saying that every modification to a system value introduces a potential for error. I am a supporter of tying stability fees to individual collateral risk and making adjustments on a per-collateral basis and more deliberate cadence. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.9473852040816326
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aizen",
                    "index": "#14",
                    "likes": "3",
                    "time": "31/08/2020-16:44:20",
                    "content": "As someone with a sized vault got hurt twice by two digits SF and black thursday I am not in favor of this approach first dai peg needs to go to 1 Not everyone is playing with farming and these high yields will be gone shortly. Pushing vault owners to play with farming to compensate SF is not fair ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8933333333333335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#15",
                    "likes": "5",
                    "time": "31/08/2020-16:48:42",
                    "content": "@brianmcmichael totally agree with you on this. Base Rate was a good idea in theory, but events did not play out in a way where the Base Rate would have been useful. With the onboarding of Real World Assets, where interest rate changes are a much more sensitive issue, the Base Rate/Risk Premium concept is getting old fast. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.863636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#16",
                    "likes": "0",
                    "time": "31/08/2020-17:24:42",
                    "content": "So we’ve identified a problem that Base Rates are becoming unwieldy. What is the solution here?     brianmcmichael:  I am a supporter of tying stability fees to individual collateral risk and making adjustments on a per-collateral basis and more deliberate cadence.   Should we scrap base rate and just have RP’s per collateral? Can we create a module for BR adjustments to offload that work? I’d also like to add, what if we just scrapped risk assessments for collateral onboarding for now and retroactively did them at a later date as we have the manpower? That way we can get the Vaults online and creating DAI and worry about the risk later. Not like we care that much with -6% BR anyways. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#17",
                    "likes": "1",
                    "time": "31/08/2020-17:29:03",
                    "content": "Not entirely disagreeing but the problem is how do we vote increases & decreases in basis of peg alignment, per collateral on an absolute basis? Agreeing on increases or decreases will likely be more time consuming This on the other side could open the door to fixed one year or monthly rates for long term ETH deposits and apply peg variable rates on the remnant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.390625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#18",
                    "likes": "1",
                    "time": "31/08/2020-17:31:08",
                    "content": "Automating this process I think would be best. I like the BR/RP dynamic as it is analogous to central bank lending rates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#19",
                    "likes": "6",
                    "time": "31/08/2020-17:31:26",
                    "content": "With regards to the base rate. One solution is to set it to 0%, update all the stability fees to sensible values, and then stop voting base rate on a weekly basis. In this way we would still have it in the toolbox, but it wouldn’t change regularly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.3333333333333335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#20",
                    "likes": "2",
                    "time": "31/08/2020-17:32:34",
                    "content": "Yea, it might make sense to scrap the cadence and move it to signal request/emergency only. The larger we scale the less we have to play with the BR I think. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.722222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#21",
                    "likes": "0",
                    "time": "31/08/2020-17:33:16",
                    "content": "Well it’s definitely quicker, like the idea  Has a null effect on rates Meanwhile we can discuss specific collateral risk We get our hands on a very needed surplus and should meanwhile start discussing where, how & when to allocate it  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#22",
                    "likes": "2",
                    "time": "31/08/2020-17:37:55",
                    "content": "Thanks for sharing your PoV here @Aizen. It’s great to hear from vault holders. That said, I don’t think anyone is considering raising the rates to double digit levels here. 1-3% doesn’t sound unreasonable (to me at least) as the cost of credit. I’m less convinced that the high yields from farming will disappear quickly. Eventually, I absolutely agree, but I can easily see it being months yet. At the very least Compound is set to last for years, granted it may wreck their token value before then, but I’m not sure that’s guarunteed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.546153846153846
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#23",
                    "likes": "1",
                    "time": "31/08/2020-17:40:31",
                    "content": "Perhaps I’m out of context here but would you be interested in a fix 1 year eth interest rate? You could mitigate interest rate risk that way ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#24",
                    "likes": "5",
                    "time": "31/08/2020-17:51:19",
                    "content": "    brianmcmichael:  From the technical perspective, the Base Rate is becoming somewhat unwieldy to manage on the smart contract side. It requires off-chain management of what the current base rate is supposed to be, which is currently maintained in a forum post, and because some executives don’t pass, we don’t have a good source of truth at a glance what this value should be at any given time.   I think we should be favouring automation of processes over having technical implementations restrict the governance constructs. The Base Rate may be one of the first 1:N constructs, but it definitely won’t be the last. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.697802197802198
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#25",
                    "likes": "2",
                    "time": "31/08/2020-17:53:39",
                    "content": "I think we can mitigate some USDC risks by equally setting rates for GUSD, PAX, and TUSD. I hope DeFi doesn’t become too complacent on one centralized stablecoin. Onboarding baskets will help mitigate this as well (yUSD, dUSD, mUSD,USD++). I hope once the other stablecoins are added they’ll have a WBTC effect where usage shoots up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#26",
                    "likes": "8",
                    "time": "31/08/2020-18:08:49",
                    "content": "    hexonaut:  I think we should be favouring automation of processes over having technical implementations restrict the governance constructs.   We can automate the generation, but at some point and with enough collateral types we’re going to run out of block space to perform the edits. We’re already considering removing the drip function calls to save some gas in the executive, as last week’s cast() cost 0.77 ETH and took nearly 3mm gas to complete. https://etherscan.io/tx/0x9125c2c8795a0a872386e1ceda091c603db94f737a4557e784a96352086bd985 As we continue to add collateral types we’re going to approach a situation where we start regularly pushing against block size limits. We can probably find ways to engineer around that, but I do urge governance to not discount the technical implications of their decisions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.142857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GenesisWarrior",
                    "index": "#28",
                    "likes": "1",
                    "time": "31/08/2020-20:12:13",
                    "content": "Why not trying negative interest rates first? I think need to try new things and step ahead not backwards ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1439393939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/almccann",
                    "index": "#29",
                    "likes": "2",
                    "time": "01/09/2020-03:50:10",
                    "content": "On the business side of things I’d love to see low volatility collateral uncorrelated to crypto (ie PAXG) and fixed term (or less variable) rates. Ie I would like to borrow against gold for a longer term business use case. The variability of rate setting policy combined with the risk to borrowing against crypto given volatility renders the credit unworkable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#30",
                    "likes": "0",
                    "time": "01/09/2020-18:49:13",
                    "content": "Right now an increase to -5.5% base rate is winning.  The highest we can go without changing the governance process this week is a -2% base rate, which would be a mild (read: negligible) increase in stability fees for a few collateral types ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.432539682539682
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#31",
                    "likes": "0",
                    "time": "01/09/2020-19:07:20",
                    "content": "Not really, that’s roughly 2m ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#32",
                    "likes": "5",
                    "time": "02/09/2020-21:22:18",
                    "content": "If we are to continue to Signal Request and there is certain agreement with this strategy we need to make a few things clear. This strategy is basically stating to 1) Determine rates more on market/competitive landscape basis 2) Make less frequent changes to rates by keeping Base rate stable and Risk Premium used only to assess risk compensation 3) Defend the peg through lower USDC liquidation ratio. Few things to consider to make sure what this means in practice.  Governance no longer makes weekly changes to Base Rate or Risk Premiums but instead manages each Vault SF with a lower frequency  Currently if governance wants to change rates only for particular collateral it changes its risk premium. However risk premium doesn’t necessarily move 1:1 with the SF that we to use to chargeto Vaults. For instance if we see certain Vaults mostly utilized by yield farmers and we can apply higher rates, this doesn’t mean that Vault is more risky and we need to increase risk premium. In this case it’s even less riskier, because those vault users hold DAI in some farming venue and can pull it out immediately to avoid liquidations.  Risk premiums are still used, but only to assess how well we are compensating risk  Risk premiums instead becomes a tool that is used solely as a gut check for SF that governance sets for particular Vault. There isn’t a direct 1:1 relationship between risk premium and SF anymore, although it is still correlated in practice. This gives us some feedback about the SF that is charged and what is the actual surplus for MakerDAO after the expected losses (risk premiums) are covered.  Lower LR for USDC-A is used to defend the peg  This one is tricky for various reasons. First of all, if we are to set SF too high, we know the peg will deviate and by keeping low LR for USDC and managing DAI price cap, we are inevitably increasing exposure to USDC. Here governance needs to make sure that a) high SFs don’t cause users to leave and instead of having higher exposure to crypto assets we end up in situation with USDC being the leading exposure and b) we define what USDC LR (equal to DAI cap price) is tolerable because the difference between 101% or 102% might be huge. If one wants to put a DAI price ceiling to $1.01 instead of $1.02 this might mean tens of millions of more DAI selling into Curve currently. So it all comes down to what exposure of USDC governance is willing to accept versus having lower DAI price cap or higher SF. As for the Signal Request itself, there is one already pending that addresses a lower USDC liquidation ratio. But we need to make sure that governance understands the whole concept. The way I see next steps:  Signal request to support the strategy outlined Prepare a plan or working group to determine competitive rates for Vaults that are compensating risk premiums Make a poll on new rates (SF) Find a solution regarding implementation of Base rate and cadence of rate changes going forward  ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-11/4041",
                        "https://forum.makerdao.com/t/week-14-dai-distributions-sourcecred-trial/4044"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.332079541773419
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#33",
                    "likes": "2",
                    "time": "03/09/2020-02:48:11",
                    "content": "    hexonaut:  There is also still the foundation. Are they out of money? If we have a plan to increase collateral onboarding throughput and we need money to do so, why lean on vault owners when the foundation could cover it?   Complete opacity of Maker Foundation financials may have justifications, but it also makes me incredibly uncomfortable. IMO even if MF is not able to contribute any more financial resources to the project, the protocol could easily raise millions with a 1% dilution. It feels sort of selfish to raise rates when MKR holders could muster the resources themselves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.845238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#34",
                    "likes": "2",
                    "time": "03/09/2020-18:41:01",
                    "content": "    brianmcmichael:  As we continue to add collateral types we’re going to approach a situation where we start regularly pushing against block size limits.   @brianmcmichael  I must admit this one was new to me. How many parameters do you think we can change at any one time before the block size becomes a problem? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#35",
                    "likes": "1",
                    "time": "03/09/2020-23:27:02",
                    "content": "Agree, however it feels a little harsh to call selfish the idea that mkr hodlers don’t want (we don’t know) to dilute their capital after subsidizing 0% rates for quite some time now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.520833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#36",
                    "likes": "0",
                    "time": "04/09/2020-01:25:45",
                    "content": "Looking at the historical volume weighted adjusted prices, the additional ~50 million Dai generated over the past 7 days has contributed to Dai drawing closer to the PEG by 0.6%, but we are still 0.5% away from 1. The additional Dai supply is working - let’s stay the course with 0% stability fees! Volume Weighted Average Price (90 days): 1.012 30 day: 1.012 14 day: 1.011 7 day: 1.011 3 day: 1.011 1 day: 1.005 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mspacey4415",
                    "index": "#37",
                    "likes": "2",
                    "time": "06/09/2020-06:00:31",
                    "content": "if I understand correctly what you’re saying:  The peg is the peg. rate is the rate. since rates have a weak effect on the peg, we might as well decouple the 2. That would make sense to me!  more fundamentally, I believe rate should reflect credit risk and MKR need to embrace itself as something as more of a commercial bank than a central bank (arguably it already is b/c DAI is more analogous to “money as we know it” as in bank deposit than “base money” as in reserves at the fed) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.165178571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#38",
                    "likes": "4",
                    "time": "06/09/2020-08:57:08",
                    "content": "Hi @mspacey4415 and welcome to the community! The rate does affect the peg, the community knows this as we needed to raise rates to almost 20% at one time in order to save Dai from becoming undervalued (yes - that was a long time ago). Now we have the opposite situation where Dai, due to high demand, is overvalued compared to the peg. As a result we have reduced effective rates to zero and hoped this would stabilize the value. The net effect has however been very weak. Presently it appears consensus is building for raising the rates to a small positive and then doubling down on adding collateral types and raising debt ceilings instead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.526621989121989
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#39",
                    "likes": "3",
                    "time": "06/09/2020-15:52:18",
                    "content": "In general I am okay with proceeding down this route, but I think we should take care not to eliminate the usefulness of the Base Rate as a monetary lever when the supply starts outstripping demand again. I can appreciate that the Base Rate is nearly useless with these huge farming APRs, but I worry that when we re-enter positive interest rate territory we will need to rapidly adjust each of the Stability Fees again which I want to avoid. It may make sense to keep the spirit of the Base Rate, but adjust the formula so it doesn’t have the same size effect on all collateral types. I’d be interested in joining a working group to determine a more generalized formula taking into account Monetary Policy, Risk and Market Competitiveness. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.529882154882155
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#40",
                    "likes": "2",
                    "time": "06/09/2020-16:46:06",
                    "content": "Not understanding spell size as the limitation for the base rate. If it becomes problematic, can’t there be an on-chain module that actually codifies the base rate on-chain. So you won’t need to be adjusting all the stability fees in the for each collateral type in the spell. (We’re currently paying $5.5k a week for oracle stipends, last weeks cast cost $270 @266 gwei)  Base rate seems useless now because we’re at the lower bound, but it is a tool to be able to adjust all stability fees. Not really understanding why it should be removed from the weekly cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.6111111111111107
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#41",
                    "likes": "10",
                    "time": "06/09/2020-21:02:36",
                    "content": "Looking forward to have you in the working group for a new rate setting approach. As I said, Base Rate does make a lot of sense, the issue is just that it won’t be usable with RWA. It will also create problems with stablecoins (already does to some extent) or any other assets where market rates don’t necessarily move in same direction with same magnitude. And then we might end up increasing base rate and decreasing risk premium simultaneously for certain collateral. But I do agree that using base rate is easier from governance overhead point of view, especially for volatile assets. Maybe a good compromise is to have different Base Rates for different buckets of collateral types? For instance crypto assets, stablecoins, RWA, etc. Or simply stop using Base Rate for non-volatile assets. Additionally I also feel governance shouldn’t be changing risk premium, or stopped calling this parameter risk premium (maybe spread or rate markup is a better term). Because if we want to charge fees that are tolerated by market we wouldn’t want to be limited by risk premium. In other words if risk premium for ETH-A is 4% but we can afford 6% SF because rates on market are at 8%, why limit ourselves? But the issue is that once you do this market rate targeting approach for each Vault type, you end up changing both markup and base rate simultaneously and it is a mess. This exactly was the original reason I proposed getting rid of Base Rate. And by knowing how much more governance overhead this will make, rather decrease cadence of rate changes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.315844155844156
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#42",
                    "likes": "0",
                    "time": "07/09/2020-14:29:16",
                    "content": "    Primoz:  But the issue is that once you do this market rate targeting approach for each Vault type, you end up changing both markup and base rate simultaneously and it is a mess.   This was one of the prime reasons I was against doing a global base rate over all assets.  Prime example is a 1% BR rise on something that will just lift off of 0 to 1% (big change) to something that will go from 5-6% (not so big a change).     brianmcmichael:  As we continue to add collateral types we’re going to approach a situation where we start regularly pushing against block size limits. We can probably find ways to engineer around that, but I do urge governance to not discount the technical implications of their decisions.   It wasn’t just the above I was thinking about with all of these rate changes but also the governance overhead that would be required.   My thoughts on this was that a Domain manager should just be given the responsibility to set rates and then governance just agrees/disagrees but then we don’t deal with the technical issues around this growing management situation. All of the above was why some time ago I proposed Maker move to using a facility useage based rate setting mechanism since once governance sets to ‘target rates’ on facilities - markets will then manage the rates themselves simply with usage.     Proposal interest rate adjustment by debt facility utilization Risk       So I think that this is a good idea in general, and that we should move in this direction at some point.  I’ve no idea what the actual curve should be, but I do think it could be better than the current system. I’d be interested to see if there is any value in combining it with the current system. Having the possibility of a fixed(ish) rate offering alongside a usage-determined rate offering.  One thing we could do is apply the curve only above a certain utilisation factor, to implement ‘soft’ d…     something like the above was proposed with MIP17     MIP17: Weekly Actual Debt Ceiling and Actual Risk Premium Adjustments RFC       MIP17: Weekly Actual Debt Ceiling and Actual Risk Premium Adjustments Preamble MIP#:17 Title: Weekly Actual Debt Ceiling and Actual Risk Premium Adjustments Author(s): Rune Christensen (@Rune23), Charles St.Louis (@CPSTL) Contributors: Type: Process Status: Formal Submission (FS) Date Proposed: 2020-07-02 Date Ratified: <yyyy-mm-dd> Dependencies: Replaces:  References  MIP17c3-Subproposal-Template.md MIP17c5-Subproposal-Template.md  Sentence Summary MIP17 defines a process and solution for enabl…     Look at compound - how often do you see them change their ‘target rate’ or whatever they call the primary rate parameter used to manage the debt facility rate curve based on usage.   Not very often compared to how often Maker governance is changing rates. I also really want to decouple the rate models from the PEG since evidence now presents that when the PEG is high (high DAI demand) there is a certain point lowering rates won’t do enough to provide the markets liquidity.   We literally need another mechanism beyond market incentives to provide liquidity when markets need it.  The problem here is that there appears to be no concensus on what that model should be.   discussion seems to be divided between doing USDC-A vault with low LR and some variant of the PSM but no matter what we do there both of these were designed around using another stablecoin to make DAI PEG stable. Governance needs to come to consensus whether or how much of the portfolio of assets should be dominated by USDC or whether this can be somewhat unlimited due to market liquidity demands.   While I would prefer a vault that has fees vs. PSM that has one time fee I have some real issues with going to LR of 102 or the like.   I see a lot of people saying this will put a cap on PEG, but lix is correct in that it will require huge liqidity demands and it is possible Maker protocol ends up with abandoned USDC vaults and having to liquidate collateral.   Literally at 1.02 there is no room for a liquidation fee, the protocol risk is unclear.     lix:  While 102% CR on USDC is similar to the PSM, I think an important distinction is that we are leaving the trading fees to other platforms. This gives the space more room to grow independent of our success, which is the way it needs to be. A low CR also allows for more price discovery below the threshold price. If we do lower the CR to 102% on USDC, then I would expect the debt ceiling to balloon upwards towards infinity. We need to be ok with this huge ceiling. USDC will most likely become the primary collateral in our portfolio, and this cannot be discouraged with a high risk premium or debt ceiling limitations.   I remember when comp farming came on-line and I was the only one in chat saying “perhaps this is a time Maker should do something different - instead of lowering the SF - raise it and see if the market even reacts”.   My data suggested that even a .5% raise wouldn’t have done anything substantial or long term to the PEG and would have had Maker beginning to capture some profit on the farming craze.  Here what a few months later we are contemplaing the same thing.   Which brings me back to when things seem stable - is there any idea to perturb rates and look for signals on PEG measurement indicators.  (i.e. a probing the system for measurement response so we understand via data what market situations are).     Literally no bandwidth on this topic of probing markets with periodic rate changes to measure market response.    I will say this is a complex topic with myriads of issues and we are already problem saturated for the most part so I will leave this for when things settle down. This whole rate thing - we definitely are going to have different classes of assets that are treated differently with rate moves.  RWA is just one example, stablecoins are another.  It is precisely where the facility based rate model can work the best (ones where we expect rates to be pretty stable unless there are unusually high or low market demans for liquidity). I do think we need a new rate setting approach.  Given what I see with the dynamically changing rates based on facility usage in other contracts I really think dynamic rate curves based on facility usage to be a better solution to reduce governance cadence, and to provide a better product for users.   Strong up/down end curves for assets with high volatility, weaker up/down end curves for other ones like RWA.   Then to manage rates governance can either expand or reduce DC’s (has the effect of lowering/raising rates if utilization is high without actually lowering a facility target rate) or by generally lowering or rasing the target rate on the facility and leaving the DC alone.   It is my expectation that if a more dynamic rate mechanism is put into place that governance won’t have to be doing weekly adjustments to the vast majority of rates helping ease technical considerations and reducing governance bandwidth to this management issue.   There is also the added benefit that there will always be ‘some’ liquidity in a facility on the high/low usage ends vs. just hitting hard caps and watching markets distort because there is no new liquidity in a facility. I am also really big on just allowing a combined business and risk units/EPCs to send their recommendations on these issues and governance to just yes/no these things (after propsal made and working group discussions happen as normal if we want). ",
                    "links": [
                        "https://forum.makerdao.com/t/mip17-weekly-actual-debt-ceiling-and-actual-risk-premium-adjustments/3021",
                        "https://github.com/makerdao/mips/blob/RFC/MIP17/MIP17c3-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/RFC/MIP17/MIP17c5-Subproposal-Template.md",
                        "https://forum.makerdao.com/t/relay-ep-14-en-espanol/4457",
                        "https://forum.makerdao.com/t/maker-relay-ep-14/4450",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-111-thursday-september-24-16-00-utc/4239/5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.482701268638769
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#43",
                    "likes": "1",
                    "time": "10/09/2020-19:30:37",
                    "content": "    Primoz:  Maybe a good compromise is to have different Base Rates for different buckets of collateral types?   I like the idea of different buckets. What about the following segmentation? Securities-like For instance ETH, WBTC, … but also PAXG and whatever has a high liquidity and a real time price feed (ETF and stocks for instance). Here we just aim to be the cheapest way to borrow a usd stablecoin to gain market share but without taking too much risk (keeping SF > RP). SF( collateral) = max(risk_premium( collateral), min_lending_rate_competitors(USD_STABLECOIN_for_collateral_pair) ) For instance, on Aave you can borrow USDC from ETH for around 1% (30d average). That what we should aim. Now obviously there are some corner cases (like TUSD which is inexpensive) so it can’t be fully automated. We might want to move slowly (using 30 days average) instead of being insanely volatile. This might help building a yield curve. For securities-like token we are making a kind of repurchase agreement. We own the collateral and agree to give it back to the customer at a fixed price (minted DAI + SF) whenever he wants. Fully trustless. A question might be, are we driving the market or are we following it? Food for thoughts. Monetary tools Those are mainly used for peg stabilization and should be used only when DAI demand is higher than supply (which is a good issue to have). Those collaterals are not here to generate fees but to manage markets (exchange rates and interest rates). Use of those shows that there is an underlying issue. It’s more band aid than anything else. I put quantitative easing here as well. USDC, TUSD, … : We will have to find the best LR and SF so that they can be used mainly when the DAI supply from other sources is not enough. cDAI, aDAI, …:  Those will provide a way to expand the DAI supply without taking a custody risk. They can also control the interest rate on money markets. Illiquid stuff In this bucket I put everything else. Those will be more on a case per case basis as they will have specific terms (indexed on LIBOR for instance). Liquidation and oracles will often be custom as well. While we might have a collateral as some form of guarantee, it will most likely not be that easy to liquidate it (for instance a 12 month notice before starting the liquidation) nor would be have direct control on it. This is the world of real banking and real impact on the real world. PS: I started this post be separating crypto and RWA collaterals, but found that it’s not correct. Gold is a RWA but works just like WBTC (almost the same custody risk). On the other hand, maybe we can have private equity of crypto protocols, NFT like crypto art which are crypto but not liquid at all? ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-quantitative-easing-to-fix-the-peg-aka-manual-psm/3902",
                        "https://forum.makerdao.com/t/maker-relay-ep-12/4153"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.598412698412698
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#44",
                    "likes": "3",
                    "time": "11/09/2020-06:33:31",
                    "content": "Appreciate the feedback @SebVentures.     SebVentures:  For instance ETH, WBTC, … but also PAXG and whatever has a high liquidity and a real time price feed (ETF and stocks for instance). Here we just aim to be the cheapest way to borrow a usd stablecoin to gain market share but without taking too much risk (keeping SF > RP).   In general I agree, but if we are still using Base Rate to simplify rate changes for certain buckets, those buckets members should be defined based on their volatility. Because volatility to some extent defines how high rates are or how frequently they change. For instance in your case PAXG wouldn’t fit well in this category, because when USD borrow rates on crypto assets go up (because crypto is bullish), something like PAXG wouldn’t necessarily exhibit bullishness and therefore borrowing USD on top of it shouldn’t get expensier.     SebVentures:  SF( collateral) = max(risk_premium( collateral), min_lending_rate_competitors(USD_STABLECOIN_for_collateral_pair) )   Yes, this is exactly some indicative formula we might want to be aiming at. In extreme cases we could be offering SF under risk premium (as we do currently), undershoot at one asset with high minting potential and then overshoot at others, but on average still compensate portfolio risk.     SebVentures:  For instance, on Aave you can borrow USDC from ETH for around 1% (30d average). That what we should aim.   Here is where it gets interesting. It is actually hard to make direct comparison with other venues. It is because Maker is different in: 1) DAI mints are related to DC instead of platform deposits 2) rates at Maker are somehow more stable or don’t get affected when large whale borrows and increases utilization 3) other platform don’t offer protection for losses as MKR does (this is less relevant for borrowers though) 4) LR is different (usually higher for Maker which is less appealing). And then finally, a lot of users simply prefer Maker versus Compound or Aave, presumably due to reputation related to being operational longest. So this tells me that someone would need to weigh in all these advantages or disadvantages when analyzing a competitive rate.     SebVentures:  USDC, TUSD, … : We will have to find the best LR and SF so that they can be used mainly when the DAI supply from other sources is not enough. cDAI, aDAI, …: Those will provide a way to expand the DAI supply without taking a custody risk. They can also control the interest rate on money markets.   Correct, those assets should have rates set up primarily based on monetary needs, less on market rates. We should however assume that something like cDAI is more risky than a normal stablecoin and it will be harder to accept low LR/low SF parameters for it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.474316109422492
                }
            ]
        }
    ]
}