{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/issue-and-workaround-for-governance-portal-multisig-users/19847",
            "title": "Issue (and workaround!) for Governance Portal multisig users ",
            "index": 19847,
            "category": [
                "Updates",
                "Notices"
            ],
            "tags": [
                "governance-portal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#1",
                    "likes": "7",
                    "time": "16/02/2023-16:06:26",
                    "content": " Issue Accessing the Governance Portal through the (Gnosis) Safe multisig UI is currently impaired due to an issue with the ‘Safe App’ integration. You might run into something like this when trying to connect:  Screenshot 2023-02-16 at 16.55.081428×958 36.9 KB  TechOps (@techops-core-unit ) has identified a potential root cause and I’ve relayed this to our connections at the Safe team. I’ve also made sure to flag the importance of this fix in light of upcoming governance polls. We’re striving to get the issue fixed as soon as possible. Until then, there is a workaround available!  Workaround A workaround for the issue is available which allows multisig operators to use the Governance Portal without any issues. It does take a few more steps compared to the native integration:  Step 1: Navigate to the (Gnosis) Safe webapp and connect your signer/owner wallet as usual Step 2: Navigate to ‘Apps’ Step 3: Search for ‘WalletConnect’ and click ‘Open App’ Step 4: Now open a new tab in your browser and navigate to the Governance Portal  Step 5: Click the Connect wallet button, and then the WalletConnect option. Click ‘copy to clipboard’ which appears beneath the QR code. Step 6: Navigate back to the Safe webapp browser tab and paste the contents in the text field Step 7: Verify that the correct wallet is connected to the Governance Portal  Apologies for the inconvenience and thanks to @rspa and @DAOstrat.C for their help during the investigation. ",
                    "links": [
                        "https://vote.makerdao.com",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/17"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.05940082644628
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#3",
                    "likes": "1",
                    "time": "08/03/2023-20:35:21",
                    "content": " UPDATE By now any issues of the following issues have been resolved:  Trouble connecting to the Voting Portal with any supported wallet, using the Firefox browser Connecting to the Voting Portal using a Safe multisig, through the Safe UI integration Seeing 404 errors on some Voting Portal pages when using a Safe multisig through the Safe UI integration  In light of the controversial and high-profile Constitution MIP governance poll that’s going live next week, DUX team and TechOps team have been working on additional measures to keep the Voting Portal running smoothly amidst high traffic and potential attacks. In case problems related to voting do arise, then please use the new #voting-support channel in the MakerDAO Discord server to get help. Technical folks will be monitoring that channel closely. ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-call-229-thursday-march-9-2023-17-00-utc/20100"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.119602272727272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tyler",
                    "index": "#4",
                    "likes": "1",
                    "time": "11/03/2023-00:32:56",
                    "content": "You can also use this guide to vote in a poll with Etherscan, in case there are any issues with the Voting Portal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}