{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/liquidity-mining-rewards-for-mkr-on-bancor/7262",
            "title": "Liquidity Mining Rewards for MKR on Bancor ",
            "index": 7262,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/glenn",
                    "index": "#1",
                    "likes": "2",
                    "time": "01/04/2021-02:08:58",
                    "content": "Hi MakerDAO Community, I created a thread in the Bancor Government forums to add liquidity mining rewards for the MKR-BNT pool. It would be great for any BNT holders in this community or members in general to show their support. See: https://gov.bancor.network/t/lm-rewards-for-maker-mkr/1638 ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/04/2021-15:36:34",
                    "content": "  oh man! You make me feel like Boomer – ya, risk is real–fear is not.  image718×93 5.5 KB  Indeed–the Maker Community is striving to get MKR token holders to participate more in Governance and protecting the Hat. But yes, everyone is free to do as they wish with their MKR tokens. Thank you for posting this --good stuff. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/glenn",
                    "index": "#3",
                    "likes": "1",
                    "time": "02/04/2021-09:37:57",
                    "content": "To update here, the proposal for mining rewards on Bancor is due to appear on Snapshot this Monday April 5th (2021-04-05), 1:00PM UTC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/glenn",
                    "index": "#4",
                    "likes": "3",
                    "time": "02/04/2021-09:47:04",
                    "content": "Thank you, appreciate your input. For anyone not familiar with Bancor, there are two key things that differentiate us from other AMMs:  Single-Sided Exposure: LPs can provide liquidity to a pool with single-sided exposure, either in an ERC20 token (“TKN”) or in BNT. Impermanent Loss Insurance: Impermanent Loss Insurance accrues over time, by 1% each day, until 100% protection is achieved after 100 days in the pool. There is a 30-day cliff, which means that if a liquidity provider decides to withdraw their position before 30 days passes, they’d incur the same IL loss experienced in a normal, unprotected AMM. If an LP withdraws any time after 100 days, they receive 100% compensation for any loss that occurred in the first 100 days, or anytime thereafter.  Which I think are attractive to any MKR holders that are currently providing liquidity in other platforms. If the Bancor DAO approves Liquidity Mining rewards then LPs in the MKR-BNT pool will also get BNT in addition to fees generated from trading in the pool. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/glenn",
                    "index": "#5",
                    "likes": "1",
                    "time": "05/04/2021-20:41:24",
                    "content": "Proposal is now live on snapshot, please vote if you are a BNT holder. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/glenn",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/04/2021-13:51:39",
                    "content": "FYI, rewards just went live on this pool. APRs are high at the moment for both MKR and BNT side.  image1411×162 18.9 KB  Note that 70% of rewards go to the BNT side and 30% go to the MKR side. Pool fees are split evenly 50-50. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.740909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/glenn",
                    "index": "#7",
                    "likes": "2",
                    "time": "15/04/2021-13:55:12",
                    "content": "We had another proposal that was passed by DAO this morning:    Bancor Governance Forum – 5 Apr 21    Proposal: Increase Co-investment Limit to 2M BNT on MKR Pool This proposal is due to appear on Snapshot on Monday April 12th (2021-04-12), 1:00PM UTC. Make sure to stake your vBNT for voting before this date and time to participate in the DAO decision. TLDR   This proposal seeks to increase the Co-investment... Reading time: 1 mins 🕑 Likes: 3 ❤      This will open up roughly $15M in single sided liquidity for the MKR side. Should be going live in the next few minutes. ",
                    "links": [
                        "https://gov.bancor.network/t/proposal-increase-co-investment-limit-to-2m-bnt-on-mkr-pool/1689"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.35551948051948
                }
            ]
        }
    ]
}