{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/huge-reputational-market-and-operational-risks-in-the-current-scd-shutdown-plan/2293",
            "title": "Huge Reputational, Market and Operational Risks In the Current SCD Shutdown Plan ",
            "index": 2293,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "mcd-migration",
                "scd-shutdown"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#1",
                    "likes": "0",
                    "time": "01/05/2020-06:19:17",
                    "content": "Most of the current top SCD ( CDP ) owners are the loyal and early supporters of MakerDAO as they first created those CDPs about two years ago when ETH was above $300. Most of them were long term bullish on ETH and MKR, so they were willing to deal with the short term market volatilites and prepared to swallow the ridiculous expensive “Stability Fees” (SF) because they believed that they would be able to pay back all the debt + SF when the market goes back up in the future. All they needed was just more time for the market to be recovered because they believed in ETH and MakerDAO. These warriors barely survived from getting liquidated due to the last couple market crashes. The CDP holders were pretty exhausted and financially wounded after long time fighting with the “Whales” and dealing with security issues of this new technology. [ STOP KEEP SAYING THAT “They had couple months of time to migrate”! ]  And it was like the light at the end of the tunnel when the forgiven SF for SCD > MCD migration news was out last week, but unfortunately, the good news didn’t last too long as the migration was no longer available after couple days due to limited SAI supply in contract. Speaking of frustration! A — Now, the final shutdown is determined to be on May 12th, 2020, and CDP owners only have two options: 1) just wait for the shutdown and do nothing now; 2) get SAI to pay down the debt and close the CDP before the shutdown. Both options are lethal for the CDP holders because option 1) can lead them to face huge potential market risk (if ETH price drops to an unacceptable level, they still need to (get forced) sell their ETHs from the contract collateral at shutdown), on top of potential getting liquidated (if ETH price crashes again) even before the shutdown. And option 2) forces the already financially wounded CDP holders to obtain SAI now with insanely markups (based on current market condition). B — In addition to the risks mentioned above, is the timing of the shutdown. It is scheduled (voted) for 16:00 UTC on May 12th , and this is just about 3 hours after the Bitcoin Halving (as expected now). Can’t even tell if this timing is just being coincident or plotted. Regardless, this just adds extra risks to the community as people have been discussing about potential market crash right after the halving (though no one really knows the truth until that time, but why gamble with the loyal CDP holder’s valuable asset?). Plus, the final settlement price will be just based on one snap shot at 16:00 UTC on May 12th, and it will provide an easier way for whales to manipulate the market for their own gains (if they want to). This has nothing to do with the robustness of the pricing oracle, because the pricing period is just too short, and too risky for CDP holders (and SAI owners as well). You don’t need to be a finance expert to understand this. C — Due to many previous CDP liquidating incidences, there are already rumours flying around that the MakerDAO team has been associated with whales to “slaughter” the CDP owners, who are the loyal and long term supporters of this project. And I don’t think it is true at all, can be just a perception. This will further damage the MakerDAO reputation for sure. Not even mentioning about the extra stress adding to people on top the current Coronavirus situation that we are all facing now. D — With all of the above concerns, I sincerely hope that the MakerDAO team will reconsider the followings to mitigate all of the potentials risks:   Work with SAI liquidity providers to add more SAIs back to the Migration Contract to help CDP holders to make a more smooth and less risk migration to MCD Vaults.   If impossible to accomplish item 1) above, then at least to work with SAI liquidity providers to provide a more fair SAI markets for CDP owners to obtain SAI to close their CDPs properly before shutdown, but not to take advantage of the poor long term supporters.   Adjust the final shutdown date/time to avoid the potential market turbulence (3 hours after Bitcoin Halving), maybe one day before or a week later can be better.   Expand the shutdown final settlement pricing period. A 48-hour or 24-hour average price will be ideal, but just a snap shot at 16:00 UTC will impose huge market risk as mentioned in “paragraph B” above.   We understand that the team has been dealing with lots of stresses from different parts of this project on the top of the health crisis that we are all facing around the world now. I believe that you can do all of the 4 items stated in paragraph D above, and manage to help the community to make a smooth transition. Let’s do something before it is too late. And I thank you all for your hard works and contributions to the crypto community!! Stay safe and well. THANK YOU!! @Derek. @rune ",
                    "links": [
                        "https://forum.makerdao.com/t/sequential-process-for-scd-shutdown/1823/41"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.504005870475897
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "4",
                    "time": "01/05/2020-08:35:27",
                    "content": "Why didn’t you migrate during last few months? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#3",
                    "likes": "5",
                    "time": "01/05/2020-13:09:52",
                    "content": "Hi @1bit as you say, there are two options for existing CDP holders; (1) Source Sai to cover their debt and close out the CDP, or (2) Wait till shutdown to have the ETH returned minus their debt. The timing of shutdown was not a sudden decision and has been up for consideration since early January when the community held polls where a number of options were presented. It is coincidence that this happens to fall near the time of BTC halvening. The ETHUSD oracle is used across the DeFi industry. Changing or freezing it is not a viable option. A big time window with an average price could expose the shutdown time to arbitrage. I suggest it’s too late to change any mechanics as the spell has already been voted on by the community. It is not possible to introduce Sai liquidity into SCD now because the Debt Ceiling is 0 and the Migration Contract is also 0. Unless users have Sai to migrate themselves, they will have to participate in shutdown on the 12th. It is also worth remembering that CDP owners will be forgiven any stability fees through this process. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.972222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/05/2020-14:29:52",
                    "content": "    Derek:  A big time window with a predetermined price could expose the shutdown time to arbitrage.   Hi Derek, thanks for your quick response!  Can you please elaborate more on above?  What did you mean by “predetermined price”?  I didn’t mention about a such thing.   When I mentioned about a longer pricing period is just for the final price calculation method only, the shutdown time should be still be at a specific time predetermined.  For example, if we keep the shutdown time at 16:00 UTC May 12th, the final price can be an average price during 16:00 (May 11th) to 16:00 May 12th (last 24-hour average), and the price inputs for the calculation have to be BEFORE shutdown time, so NO predetermined price here.  In order to mitigate final price manipulation risk, there are many financial products in our existing world are final settled in a similar way.  To better protect the MakerDAO reputation and the community, please consider.  We still have time, otherwise it will be too late. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.424818840579711
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#5",
                    "likes": "0",
                    "time": "01/05/2020-15:56:45",
                    "content": "I edited my word ‘predetermined’ with ‘an averaged price’ for clarity. I understand what you mean - you’re proposing to average a 24hr window before 16:00 and take that price instead of the spot price at 16:00. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#6",
                    "likes": "0",
                    "time": "02/05/2020-03:52:14",
                    "content": "    Derek:  A big time window with an average price could expose the shutdown time to arbitrage.   How does it this “expose the shutdown time to arbitrage”? What did you mean?  Can you elaborate more please? Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.614583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/05/2020-19:20:42",
                    "content": "All I meant was that any average calculation over a period of time would be more or less than the market spot price at shutdown. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.305555555555555
                }
            ]
        }
    ]
}