{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-should-be-included-in-conversations-about-daos/8982",
            "title": "MakerDAO Should be Included in Conversations about DAOs ",
            "index": 8982,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#1",
                    "likes": "9",
                    "time": "27/06/2021-21:23:40",
                    "content": "Perhaps I am just venting, but it strikes me as odd that MakerDAO would be excluded from any conversation about DAOs. Case in point, I recently came across a “DAO Summit” scheduled for next week at Stanford. There, you have representatives from Compound, Uniswap and Bankless informing the world about DAOs. From what I know from interacting with these other communities, they lack (i) independent workforces, (ii) native means to compensate DAO contributors from protocol operations (i.e., not just paying people in their governance token through grants), and (iii) a demonstrated history of self-governance, among other things, and as a result, are not as well-placed as MakerDAO to perform this educational role. I’m unsure what CU would be the best to engage in a symposium like this, but if we can have DAO members who participate in these talks, it would behoove us to do so. Engaging with university clubs like Stanford and Harvard is a way to augment institutional knowledge and garner more credence as a “legitimate” player before prying regulatory eyes (IMO).  (I threw up in my non-Ivy League mouth writing this but it’s the truth in the US, for better or worse). Anyhow, the point of this rant is figuring out which CU would participate in a symposium like this. Gov-Alpha? SES? Marcomms (presuming it is onboarded)? Or forum rando (looking at myself in the mirror and furiously trying to contact Paper or Replenish2030)? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.763888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/06/2021-21:55:09",
                    "content": "Heh, just hit me on R/C. I’m nearly always there. Got a lot on my plate for this coming week, but happy to engage if you make the introductions happen ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "4",
                    "time": "27/06/2021-22:00:04",
                    "content": "Just contacted them to ask for us to have a seat at the table. They say Amy Jung will be there as well, so she can probably talk us up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/06/2021-23:20:18",
                    "content": "Well, that’s not a bad start (though she left the Foundation and the DAO,  I believe). It sounds like it will a solid event so it’ll be good to have our presence there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "0",
                    "time": "27/06/2021-23:34:35",
                    "content": "Yeah, they replied almost immediately. Sounded like they didn’t know who to contact and didn’t really pursue it since it wasn’t easy, but maybe I’m speculating? I told them to ping me to find someone if they find themselves in that situation again. Apparently this will be a series of summits. On the plus side, we get a visit from the Fed on Tuesday. That seems better than chatting with other DAOs about problems no one has a solution for yet ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.058333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#6",
                    "likes": "2",
                    "time": "27/06/2021-23:53:01",
                    "content": "Amy is a member of the SES Core Unit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#7",
                    "likes": "0",
                    "time": "27/06/2021-23:59:22",
                    "content": "Don’t misunderstand, but I prefer someone from a cu rather than paper. Amy, I think would do a good job ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "1",
                    "time": "28/06/2021-00:01:11",
                    "content": "Oh, I don’t have anything to say on their talks. Not my area. Amy I’m fairly certain is no longer with the DAO, but certainly knows tons about Maker. But she may be there in some capacity for her current project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#9",
                    "likes": "1",
                    "time": "28/06/2021-00:03:40",
                    "content": "    Alefcripto:  Don’t misunderstand, but I prefer someone from a cu rather than paper. Amy, I think would do a good job   Couldn’t we look for someone who has nothing to do with the foundation? I feel that we should gradually disassociate ourselves from the foundation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#10",
                    "likes": "0",
                    "time": "28/06/2021-00:05:27",
                    "content": "Sorry men not hate. I only mention it because of Amy’s experience, as you say she belonged to the DAO and who better than her to provide her perspective, I think. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#11",
                    "likes": "0",
                    "time": "28/06/2021-00:11:47",
                    "content": "I really don’t want it to be like that, it should be people with experience, the foundation was a fundamental pillar for the growth of MakerDao and although it was not a complete decentralization it was the tool that brought us to this growth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#12",
                    "likes": "0",
                    "time": "28/06/2021-00:19:01",
                    "content": "Ah, I thought she left for greener pastures. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#13",
                    "likes": "2",
                    "time": "28/06/2021-00:21:19",
                    "content": "Actually, not knowing who to contact is a good sign of decentralization, and much better than de facto reliance on the Foundation! We should all be happy in a certain way that it has come to this. And you’re right – conversation with Fed is light years ahead of a symposium with the same talking heads you see on every “DeFi panel”. Anyhow, I think Amy being there will cover us from the DAO’s perspective, especially if she is working with SES (whose gov poll happens to be up, so get out there and vote!). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.680555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#14",
                    "likes": "6",
                    "time": "28/06/2021-03:40:59",
                    "content": "It’s actually pretty great that Maker wasn’t included because we’re the only group that doesn’t have a centralized entity and they didn’t know who to call. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#15",
                    "likes": "0",
                    "time": "28/06/2021-04:11:53",
                    "content": "I mean many Maker CU members speak at various events. For example, we also have some speaking at upcoming ETHCC in France (I look forward to it). Sometimes some of those events don’t invite us (forgot us or didn’t have contact or thought they had enough DeFi protocols and want to invite other fields). But that’s ok. There are plenty more that are happy to have us. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1640625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#17",
                    "likes": "1",
                    "time": "28/06/2021-06:39:57",
                    "content": "Being part of such discussion is within the Strategic Marcomms CU coverage. The scope of the unit’s work includes:  Identifying major events by putting together an events calendar Compiling a list of speakers sourced from the community Providing training if needed Measuring our success for each event by the level of engagement, number of participants, and press coverage  The team looks forward to the opportunity to collaborate with the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.604166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#18",
                    "likes": "2",
                    "time": "28/06/2021-09:03:32",
                    "content": "    Tosh9.0:  MakerDAO would be excluded   They actually reached out. SES made it clear that we only represent a decentralized part of MakerDAO, not the whole. We’re in touch with this group, and one of the requirements is to make a donation for research and whitepapers. While SES more or less agree with the value projected to be produced, we are rallying to increase the budget for our Grants Program.     Tosh9.0:  I’m unsure what CU would be the best to engage in a symposium like this   Our main point of contact for this project is @layerzero.     Tosh9.0:  Or forum rando (looking at myself in the mirror   You’ll never be a rando to us, @Tosh9.0 . <3     Tosh9.0:  she left the Foundation and the DAO, I believe   Yes. She has, unfortunately, decided to move on.     PaperImperium:  Apparently this will be a series of summits.   And whitepapers. Yes.     Aes:  Amy is a member of the SES Core Unit.   Tell her to reach out. Would love to work with her again. : )     Tosh9.0:  Actually, not knowing who to contact is a good sign of decentralization       g_dip:  It’s actually pretty great that Maker wasn’t included because we’re the only group that doesn’t have a centralized entity   : ) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/layerzero",
                    "index": "#19",
                    "likes": "4",
                    "time": "28/06/2021-11:35:12",
                    "content": "Yes, I will participate in the DAO summit. Connor Spelliscy, one of the organizers, is leading the DAO research cooperative,  a project for crowdsourcing legal research and investigation among diverse DeFi protocols. I find the project interesting for Maker DAO as it may help leverage scarce legal resources and tackle common challenges many DAOs are facing. Uniswap and Compound already joined and we are considering joining as well. https://docs.google.com/document/d/1qDHcPLGveQZggd2bkNOTQRrcVmnqxw6EL_MzmlV3fpY/edit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#20",
                    "likes": "3",
                    "time": "28/06/2021-13:13:08",
                    "content": "    juan:  We’re in touch with this group, and one of the requirements is to make a donation for research and whitepapers.      We’ll do much better acting in the marketplace and talking with those actually in charge like the Fed or the public on social media than paying to be in an ivory tower roundtable of people that get excited listening to themselves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.756944444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#21",
                    "likes": "2",
                    "time": "28/06/2021-13:43:23",
                    "content": "YES! 1000% yes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#22",
                    "likes": "8",
                    "time": "06/07/2021-04:17:28",
                    "content": "Oh, didn’t realize this was going to be such a thread. Sorry for being late to the party! @Tosh9.0 perhaps these insights might be helpful to relieve your rant   At the DAO Summit, MakerDAO was mentioned by multiple third party sources in almost every single segment - Robert Leshner gave a shoutout in his fireside chat, PlaceholderVC even said “Core Unit”. Sometimes referrals build better influence than self-promotion   Even if MakerDAO isn’t in the panel circuit or Twittersphere, MakerDAO is definitely recognized as a “mature” DAO. Several teams have reached out to me about transforming into a more decentralized structure for their DAO and admiration has been consistent. Teams are super curious about how MakerDAO did it at such a large scale. If someone from the DAO wants to expand on their insights about MakerDAO, I’m happy to connect teams them. I agree MakerDAO should be spending just a tad bit on being part of the greater DAO discussions, but I think it’s difficult to ask the Facilitators to do talks on top of the work they already have. (I turned down speaking engagements during my time because I felt time was better spent working on things than speaking about it). The only reason I talk more now is because I have time to reflect and I think there was a lot of really great nuggets in the process + we’re just now seeing more of the outcomes rather than theorizing…and that’s the real difference between Maker and a lot of the newer DAOs. That being said, I do think it’s important to maintain some visibility - no one will see the great work that gets done here! I agree with everyone’s comments that I think MakerDAO is not often invited because it’s so decentralized and doing its own thing that no one really knows who to reach out to, not because there’s intentional exclusion. That being said, I’ve also pointed people to core unit facilitators.  Disclaimer for the panel: Connor (the organizer) had connected with me regarding the research cooperative and I mentioned I was leaving Maker so I connected them to the Faciltators.      juan:  We’re in touch with this group, and one of the requirements is to make a donation for research and whitepapers. While SES more or less agree with the value projected to be produced, we are rallying to increase the budget for our Grants Program.   And yes, I’ve left both the Foundation and MakerDAO, miss all the brains here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.990134479717812
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#23",
                    "likes": "1",
                    "time": "06/07/2021-17:52:44",
                    "content": "Consider my rant fully relieved. Thanks @amyjung ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ]
}