{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/opinion-2021-till-infinity-makerdao-community-owned-and-operated/5642",
            "title": "[OPINION: 2021 Till Infinity] MakerDAO: Community Owned and Operated ",
            "index": 5642,
            "category": [
                "Governance"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "13",
                    "time": "12/12/2020-17:50:51",
                    "content": "The views expressed here are those of EL PRO and not of community members, personnel, and authors that are quoted, and not the views of any organization, or its affiliates. As 2020 ends and the new year approaches—it is time for our community to focus on the recent subject that many of you have been thinking & talking about—full responsibility and ownership of the DAO, and how the community will run the DAO while maintaining network effects, core team talent, and continuous growth. With that in mind—I reflected on what in my opinion is a terrific guideline on achieving decentralization in progressive stages. At the start of the year, Jesse Walden wrote an article called: “Progressive Decentralization: A Playbook for Building Crypto Applications.” There are three (3) components that Jesse outlines as the path to progressive decentralization:  Product/market fit Community participation Sufficient decentralization (community ownership)  I believe the Maker Community can agree that we have achieved step 1, Product/market fit with the popularity of DAI, and step 2—community participation (which is growing stronger and stronger). “Work it, make it, do it, makes us Harder, better, faster, stronger” –Yeezy/ Edwin Birdsong / Guy Christo The next step—and it’s no secret—the DAO will be owned and operated by the Maker Community. We are now moving to Step 3—the most crucial step in the decentralization playbook. The DAO has iterated the steps and the Community needs to be laser focus on the ultimate goal. But, with this goal there are a lot of unanswered questions. Some of the questions already being discussed in this Forum thread started by community member SEB, and he also posted—what I think is a Super Valuable Comment from on one of our most important community members: “There are opportunities elsewhere that pay better and that don’t involve being micromanaged by forum members. It seems like this process needs to be streamlined if the protocol is to attract and retain talent.”  That comment has really open my eyes & mind about how and what we will need to do in order to retain the core team members that have guided the DAO to Step 3—and also the new incoming talent. However—peace  comes to mind when I think about many of you here—talented people who are super smart —have real world experience—and I know that we will achieve our goals as one core unit. As we start to say good-by to 2020—Maker Community, I hope that you are All laser focus with tunnel vision on the ultimate goal. I hope you are you ready to prove to the World that DAOs can be efficient, organized, unstoppable, and the Maker Community will operate forever. Because we will need you. Every single one of you. This will be fun! -El Pro ",
                    "links": [
                        "https://forum.makerdao.com/t/discussion-makerdao-contributors-compensation-brainstorm/5625",
                        "https://forum.makerdao.com/t/brainstorm-2021-mission-and-objectives/5809",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-122-thursday-december-17-16-00-utc/5608/2"
                    ],
                    "GPT-summary": "The author of the post discusses the MakerDAO community's move towards full responsibility and ownership of the DAO, and how the community will run the DAO while maintaining network effects, core team talent, and continuous growth. The post also references an article on progressive decentralization and outlines the three components of the path to progressive decentralization. The post ends with a call to action for the Maker Community to focus on the ultimate goal of operating the DAO forever. A 3rd party member asks questions and provides constructive criticism about the process of retaining core team members and attracting new talent.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.851824899238692
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "1",
                    "time": "12/12/2020-21:57:56",
                    "content": "Great post @flipflopflapdelegate! So what do you think we should be doing to ensure we’re able to pay passionate people enough to keep them here and happy? I’m with the idea that we need to make this a smooth transition, but currently the forum seems to be the main way governance is organized so it’ll be hard to get away from the “micromanaging” aspect. IMO that means we need to be able to offer competitive compensation for our core team members. With all the SFs accumulating we definitely have the funds, so I think it’s just a matter of getting the forum members to band together and show we are willing to put our money where our mouth is! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.390625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/12/2020-01:48:12",
                    "content": "@flipflopflapdelegate Maybe MakerDAO should partner with Gauntlet Network to provide automated governance of quantitative parameters like stability fees, value at risk, etc. and use voter delegation for qualitative factors like how much should contributors be compensated for their deliverables and such things. I think this would give MakerDAO the ability to have a stable lending platform like Aave and Compound without being overly bureaucratic with excessive polls and votes.    Medium – 25 Sep 20    Automated Governance: DeFi’s scientific evolution 🧪 Minimizing voter friction within the complex DeFi jungle Reading time: 5 min read       ",
                    "links": [
                        "https://medium.com/gauntlet-networks/automated-governance-defis-scientific-evolution-feea0284fa99"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#4",
                    "likes": "6",
                    "time": "13/12/2020-04:54:29",
                    "content": "While I respect Guantlet for what they do, I don’t think it’s possible to “outsource” all. They can of course  provide some analysis or data that the governance can look into if the governance wants them to, but ultimately it would be up to risk domain team and also the governance. Also, a way to streamline the process is already under discussion via governance calls and etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/12/2020-20:40:20",
                    "content": "    prose11:  So what do you think we should be doing to ensure we’re able to pay passionate people enough to keep them here and happy?   Good question P. Rose. Pay top DAI, including but not limited to staying current on market standards for salary and benefits. But most of all, provide a feeling of  appreciation to All community members by the Maker Community with a  treatment of fairness. 2021 Till Infinity Prediction: WBTC and USDC will overtake ETH as the #1, and #2 Collateral Types in Maker–by 2023. I know some are going to want to kill me for saying that, but hey…  ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.792857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "1",
                    "time": "14/12/2020-19:11:57",
                    "content": "Reasonable predictions I’d say! I’m intrigued by the suggestion of fostering greater community appreciation. I think this is core to a functioning DAO but is definitely a little intangible. From experience, I know corporations often run a month to month or quarter to quarter nomination process for recognizing important contributions. This would be pretty easy to do on the forums in terms of having a thread for submissions and a poll for voting. If we were able to convince the community to add in a small reward for top place finishers, do you think this could be an effective way to both get valuable members paid more and recognize them for their work? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.589015151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "16/03/2021-01:12:00",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}