{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/working-group-autonomous-makerdao-closed/8320",
            "title": "Working Group: Autonomous MakerDAO - Closed ",
            "index": 8320,
            "category": [
                "Updates"
            ],
            "tags": [
                "governance",
                "auto-makerdao"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#1",
                    "likes": "11",
                    "time": "25/05/2021-13:24:10",
                    "content": " Where We Started Eight months ago, a few DAO members launched a working group to focus on driving toward a more autonomous organization. (Original post) Some key objectives included:  Decentralize Domain Teams’ work. Secure income from the Maker Protocol to ensure funding of continued operations. Maintain and develop Maker Governance integrity. Attract, onboard, and develop domain teams and individual actors working for the DAO. Map a DAO operating infrastructure.   Progress Over time, 5 members became mandated as Facilitators (@primoz, @hexonaut, @amyjung, @juan, @sebventures) and the members list expanded with @ultraschuppi, @layerzero, @williamr, @elihu, @anna. By focusing on the mid-term challenges of decentralization, this group was able to serve as an incubator for DAO spirit and action. Since the last update in November, members of the working group collaborated on a wide scope of initiatives:  MIP47: MakerDAO Multisignature Wallet Management MIP48: Streaming Payments via the Keg Interim DAO Operating Budget Support for initial set of Core Units launching via the Framework Produced Invoice Guides  Coordinated MIP Portal  PSM UI Coordination (no Foundation members involved) Project Compass Brainstorming for a Legal Core Unit  MIP49: Staking Rewards / Delegation eurDai Declaration of Intent   What We Learned While the group started with objectives now considered complete, we realized the working group also served a few purposes:  A recurring, regular meeting was useful for coordinating and connecting DAO members across various projects. The group was useful for live feedback and questions about works in progress (ex: MIPs). We were able to surface short to medium term challenges of the DAO and discuss other needs. The group was a place for eager contributors looking to get more involved and participate in high impact contributions.   What’s Next While this working group is coming to an end, @prose11 and @anna will be starting a new group with refreshed intentions. Details coming soon! ",
                    "links": [
                        "https://forum.makerdao.com/t/working-group-autonomous-makerdao-update/5197",
                        "https://forum.makerdao.com/t/mip47-makerdao-multisignature-wallet-management/6338",
                        "https://forum.makerdao.com/t/mip48-streaming-payments-via-the-keg/6340",
                        "https://forum.makerdao.com/t/signal-request-interim-dao-operating-budget/5924",
                        "https://drive.google.com/drive/u/1/folders/1w8a_FZQ96K--G4ibsWQGNZ9ETKwlu1Mq",
                        "https://forum.makerdao.com/t/mips-portal-a-community-developed-site-to-explore-all-our-mips/6616",
                        "https://forum.makerdao.com/t/project-compass-dao-vision-setting-working-group/7079",
                        "https://forum.makerdao.com/t/mip49-staking-rewards/6331",
                        "https://forum.makerdao.com/tag/eurdai",
                        "https://forum.makerdao.com/t/operational-support-final-weekly-update-may-20-27-2021/8388",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/73",
                        "https://forum.makerdao.com/t/working-group-autonomous-makerdao/4036/2",
                        "https://forum.makerdao.com/t/mip39c2-sp21-adding-makerlabs-core-unit/9425/19"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.717288961038961
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/06/2021-13:24:40",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}