{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-march-2022-update/14598",
            "title": "New Silver March 2022 Update ",
            "index": 14598,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "newsilver-update",
                "rwa-002"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "9",
                    "time": "12/04/2022-21:26:18",
                    "content": "Dear Community, In this monthly update, I will focus on briefly discussing company updates, and spend some time on explaining how New Silver is thinking about real estate and adjacent markets in the short and medium term, how we are thinking about the macro-economic environment, and how we use data to forecast our credit environment. TL;DR Markets are adjusting to the higher rates, housing supply is still much lower than demand, materials are ever more expensive, housing prices continue to appreciate. We do not anticipate a repeat of the last housing crises because the fundamentals are very different today. We are tightening the credit box and making a few adjustments to be on the safe side. Good news - New Silver has signed a $20mm term sheet with an institutional structured finance lender with $2b+ AUM, we are now going through due diligence. If the deal goes through, the lender will be in the mezzanine position, strengthen New Silver’s position as a lender, opening up opportunities for growth, and speaking to our efforts over the past year to create a unique, valuable offering and institutional-grade processes. New Silver was the first “real world” asset voted in by the MakerDAO community, and our team has worked tirelessly building and improving on the 3 Ps of Credit - People, Process, Policies. We are now more than a year in, with no defaults, a better process, a bigger team, and agile credit policies. With the next leap, we believe the DAO will be even more protected as a senior lender, and will benefit from a robust process we are developing in conjunction with Centrifuge and in consultation with the RWF team. Lets touch on the macro housing market trends and increasing rates. First, let me say that we know what our borrowers (real estate entrepreneurs) want: quickly accessible capital that is competitively priced, and a fast, convenient process that can be (mostly) done online. This is what we are/will continue to deliver. We were never the most nor the least aggressive lender, we are “middle of the road” on rates and leverages, but we are faster than most others. In an increasing rate environment, we hope to also become more competitive on rates viz a vie utilizing the Maker vault, but at the same time, use data and technology to choose the least-risky borrowers and projects to finance, thus creating a win-win scenario for everyone involved. Data   Research on “hard money” lenders from 2008-2013 timeframes, showing that our competitors had overall defaults of <2% with 1% average, and we believe market conditions were more adverse back then - we had a general recession, housing supply stood at 9-12 months in 2008 vs <6 months today, and personal savings are much higher today, so consumers have more money saved up. We believe that lack of supply will continue to drive price appreciation, or price stability, and this will allow for very small principal loss even in cases of defaults, as evidenced by a large bridge loan aggregator (<50bps principal loss on 4.4% foreclosure rate) However, housing is getting less affordable, though because of the supply constraint, we do not believe we are in a “bubble” territory at this time Banks have loosened some of their underwriting, allowing more people to obtain a consumer mortgage, but not to the level of pre-2008 crises. This bodes well for consumers who buy homes from our clients.  What New Silver is doing in the short term  We believe FICO scores are great measures of borrowers ability to repay debt, they have been used for many years and have undergone many stress tests. Our portfolio is in the Prime category with an average of 700+, so this is healthy. We are increasing the minimum allowed credit score to 650 (from 620) for borrowers with experience, and 700 (from 680) for those without. We are decreasing the maximum LTC on ground up/heavy construction loans to 85% (from 90%) for non institutional level borrowers Increasing the profitability test to ensure the project will be profitable for our borrower even with a 5% price correction. Continuing to pay close attention to material pricing, this is partially driving up per square foot renovation costs, we review budgets closely and ensure that borrower has sufficient budget in place to cover possible increases in the coming few months.  Loan Originations in Tinlake based on origination date New Loans:14 New Loan USD Volume: $4.4mm Average Originated Interest Rate: 9.1% Average Tinlake Finance Fee: 6.4% Average Loan Amount: DAI 320,776 Average Loan to Value: 72% Average FICO score: 716 Average Term: 12 months Loans Paid Back: 12 Current MakerDAO Debt Ceiling: $20mm with about $13.6mm used Portfolio Analytics  Main_2022-04-12T21_19_131968×1240 129 KB  Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Lastly, we wanted to conduct an AMA style webinar where we can go over the current market trends and data, and answer the community’s questions. I wanted to get a sense if this would be of interest to the community, please answer the informal poll below. Will provide sign-up instructions if there is sufficient interest.    Are you interested in attending the AMA style webinar  Yes, where do I sign up Not interested     0 voters     ",
                    "links": [
                        "https://askwonder.com/research/please-help-find-stats-hard-data-regarding-defaults-hard-money-asset-based-7w0z9fdh8",
                        "https://fred.stlouisfed.org/series/MSACSR",
                        "https://fred.stlouisfed.org/series/PSAVERT",
                        "https://www.peerstreet.com/blog/peerstreet-q2-loan-performance",
                        "https://www.longtermtrends.net/home-price-median-annual-income-ratio/",
                        "https://www.housingwire.com/articles/mortgage-lenders-are-loosening-standards-on-jumbos/",
                        "https://forum.makerdao.com/t/focus-on-11-navigating-real-estate-investment-markets-with-new-silver/14646",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712",
                        "https://forum.makerdao.com/t/ses-biweekly-status-update-defi-advocacy-the-european-crypto-initiative/14629",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-4/14770",
                        "https://forum.makerdao.com/t/rwf-001-monthly-update-april-2022/15024",
                        "https://forum.makerdao.com/t/informal-poll-permit-the-rwf-core-unit-to-allocate-time-and-resources-to-reviewing-an-upcoming-new-silver-request-for-debt-ceiling-increase/15768",
                        "https://forum.makerdao.com/t/new-silver-april-2022-update/15086"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.633914331282752
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/04/2022-06:40:21",
                    "content": "Thanks for the update!  Glad to see higher standards being implemented as the environment changes.  If it doesn’t hurt your demand, this is great!  One question - what timeframe constitutes a “new loan”? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.136363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/04/2022-12:32:40",
                    "content": "    prankstr25:  We believe FICO scores are great measures of borrowers ability to repay debt, they have been used for many years and have undergone many stress tests. Our portfolio is in the Prime category with an average of 700+, so this is healthy. We are increasing the minimum allowed credit score to 650 (from 620) for borrowers with experience, and 700 (from 680) for those without.   Thank you for providing this update Prankstr—it’s good to see more RWA borrowers reporting back to the community. You have always kept the community informed—really appreciate it. Question? I was watching and interview this morning with the Mortgage Bankers Association (MBA) and they are reporting that the average First-time homebuyer is paying 6.25% interest on a 30-year fixed with a FICO of 760++. And the returning home buyer is averaging roughy 5.25%. How does NS deal with home buyers that are 650+, are you analyzing such borrowers based on the average (say 5.25%) plus adding say 300 to 400 basis points? And if the Fed brings its federal funds rate to 2.5%-2.75% by the end of this year—do you foresee rates for borrowers in the double-digit range (10%++) in 2023? Thanks in advanced! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/04/2022-15:01:24",
                    "content": "    Traster_Tray:  One question - what timeframe constitutes a “new loan”?   These are new loans originated during the reporting month, in this case, March. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#5",
                    "likes": "3",
                    "time": "13/04/2022-15:34:01",
                    "content": "    flipflopflapdelegate:  First-time homebuyer is paying 6.25% interest on a 30-year fixed with a FICO of 760++   Good question, this rate feels very high to me, I just did a quick check here and here, and rates are still below 5% on the average. Because we are not a consumer lender, we analyze the project and the collateral, borrower’s credit and their experience as a real estate investor or builder, and the exit strategy to make sure it makes sense. We do not know who the ultimate buyer will be or what their credit score will be, and in some cases, the borrower’s exit strategy is to refinance and keep the property as a rental, in which case, we try to make sure that a refinance could work for the current borrower.     flipflopflapdelegate:  And if the Fed brings its federal funds rate to 2.5%-2.75% by the end of this year—do you foresee rates for borrowers in the double-digit range (10%++) in 2023?   We do not think that a federal rate in that range will cause mortgage rates to go above 10%, we think a federal rate under 3% will result in mortgage averages of 6-6.5% based on historical averages. So we are projecting an average mortgage rate in the 6’s during the next 12 months. That will effect buying power and cause prices to stabilize (or maybe decline by up to 5%), which we think is a good thing, what’s happening now is not sustainable, but because of the short supply vs demand, we do not think there will be a large selloff like we had in 2008. We are budgeting for a 5% price decline when we analyze their exit strategy. But also, please don’t forget, we have 15-25% cushion (and Maker has a ~40% cushion) before any principal balance is impacted, so we believe we are taking the right measures at this time. ",
                    "links": [
                        "https://www.bankrate.com/mortgages/mortgage-rates/",
                        "https://fred.stlouisfed.org/graph/?g=l64N"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.955925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dairyman",
                    "index": "#6",
                    "likes": "1",
                    "time": "13/04/2022-16:07:19",
                    "content": "In a rising rate environment but with your own cost of capital fixed, do you anticipate being able to ask for and use a higher cap by taking market share? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#7",
                    "likes": "4",
                    "time": "13/04/2022-16:34:03",
                    "content": "I think you guys have a great pulse on the market and your record so far is perfect.  I feel that you are being very conservative yet clearly still able to find demand to approach the debt ceiling you’ve been given. The currently stated intent of the fed is to raise rates to the 2-3% range they call neutral and this is already largely baked into the current mortgage rates.  Where they go from there is unclear and likely dependent on how inflation data responds.  What’s clear is that they are trying to slow demand and won’t stop until they think they’ve slowed it enough to see effects on inflation.  In relation to the housing market, I believe there are early signs that inventory is starting to increase.  If prices do stabilize or even start to decrease, I wonder how it would affect the demand for the fix and flip market you guys service.  On the other hand, I could see higher inventory providing borrowers more fix and flip opportunities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.955357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#8",
                    "likes": "0",
                    "time": "13/04/2022-16:48:23",
                    "content": "    Dairyman:  In a rising rate environment but with your own cost of capital fixed, do you anticipate being able to ask for and use a higher cap by taking market share?   Yes, this is the goal, we would like to be aggressively priced and attract the best/most experienced borrowers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#9",
                    "likes": "1",
                    "time": "13/04/2022-17:03:49",
                    "content": "    Traster_Tray:  If prices do stabilize or even start to decrease, I wonder how it would affect the demand for the fix and flip market you guys service. On the other hand, I could see higher inventory providing borrowers more fix and flip opportunities.   Exactly right, its a balance here, on one end, this will help our potential borrowers find and secure better deals - in today’s market, they are often loosing out to consumer buyers who are willing to pay more to live there. On the other hand, they may have a harder time selling to consumers because of higher cost of mortgages, lower demand, etc. But at this time, there is still a supply shortage, though you correctly mention that there are early signs of more inventory (there is even a Listapolooza Day this week), but there we are not at equilibrium yet. Keeping a very close eye on the numbers every week. And another point I forgot to make - single family rentals are a huge business, and in many places, its cheaper to rent than to buy. So an exit for our borrower could be another real estate investor who is in the landlord business. We are also talking with a couple of large marketplaces for single family rentals, will keep you updated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.066706021251475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#10",
                    "likes": "1",
                    "time": "13/04/2022-17:43:04",
                    "content": "Wow, 6.5% mortgage interest rate seems very high. I know rates went up a bit but they were below 3% not too long ago. Have they doubled in the past year ? And it’s getting worse ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.608
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#11",
                    "likes": "6",
                    "time": "15/04/2022-16:52:35",
                    "content": "Based on the positive response to the webinar poll, @prankstr25 has decided to host an AMA on 2022-04-27T15:00:00Z  Call details can be found here.  Add the call directly to your calendar here. Attn: @flipflopflapdelegate @roollie @francis.street @Shravanrajas @Allan_Pedersen @PaperImperium @Ippy @Dairyman @teej ",
                    "links": [
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=Nzg5b2c4N3VwZDhrbzhkYnZ2MXM3cWRtMGggbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.818181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#12",
                    "likes": "0",
                    "time": "14/07/2022-16:52:42",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-may-2022-update/15679",
            "title": "New Silver May 2022 Update ",
            "index": 15679,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "new-silver",
                "newsilver-update",
                "rwa-002"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "4",
                    "time": "08/06/2022-21:05:58",
                    "content": "Dear Community, TL;DR New Silver had another record month, with total origination volume at $9mm in May. Looking at the macro economy, markets are still adjusting to the new reality with increased borrowing costs across the board, though wild swings in equity markets may have subsided. Further Fed increases are likely priced in. In US real estate, May housing inventory has seen its first increase since 2019, while total inventory is still very low, price appreciation continues, though a few local markets are reporting slower or even negative price growth. Our thesis for the medium turn is that real estate prices will cool, and inventory is going to increase, but markets will remain generally healthy, as long as unemployment does not become a problem. We are generally optimistic that the current trend will result in a “soft landing”, for the economy, and do not expect to see a real estate crisis reminiscent of 2007 timeframe. Lets dig in! First, the May numbers from the Realtor report:  The inventory of homes for sale has increased for the first time since June 2019.  The national inventory of active listings increased by 8.0% over last year, while the total inventory of unsold homes, including pending listings, still declined by 3.9% due to a decline in pending inventory. The inventory of active listings was down 48.5% compared to May 2020 in the early days of the COVID-19 pandemic. In other words, there are still only half as many homes available.   More new listings entered the market in May than any other month since June 2019.  Newly listed homes were up 6.3% nationally compared to a year ago, and up 4.6% for large metros over the past year. Sellers still listed at rates 6.4% lower than typical 2017 to 2019 levels prior to the pandemic.   Housing remains expensive and fast-paced with the median asking price at a new high while time on market is at a new low.  The May national median listing price for active listings was $447,000, up 17.6% compared to last year and up 35.4% compared to May 2020. In large metros, median listing prices grew by 13.0% compared to last year, on average. Nationally, the typical home spent 31 days on the market in May, down 6 days from the same time last year and down 40 days from May 2020    Next, lets discuss the continued price appreciation in real estate. In our view, it is mostly a matter of low supply, but I believe there are at least two other factors driving this - institutional investors are buying up single family homes to rent them out, and the work-from-home trend has contributed to an increased demand for housing. Here is a paper from SF Fed economist John A. Mondragon and Professor Johannes Wieland talking about these trends (I only read the summary and not the entire paper), this is a key takeaway:  In this paper we show that the shift to remote work caused a large increase in housing demand. In turn, this increase in housing demand caused house prices and rents to increase sharply. Based on our cross-sectional estimates controlling for migration spillovers, we argue that remote work accounts for at least one half of the 24% increase in house prices from December 2019 to November 2021.  This is an interesting dynamic which we think about a lot. Traditionally, lenders in our space tended to regard cities and their suburbs as less-risky areas to lend in, because these areas tended to be close to business centers and jobs. Now, with WFH becoming a permanent part of the work culture, we think that smaller towns offering less expensive real estate may pose similar risk profile and might be good targets. And this may partially explain the price appreciation conundrum. Another interesting fact - lots of US cities home prices are still below their peak levels from pre-2007 crisis. With inflation and general price appreciation added in, this may mean we are not yet at the top of the cycle (personally, I think we are or very close to it) The other trend we are watching closely is unemployment. Given that the current macro trends are driven by rate hikes and inflation-fighting, we feel that unemployment, should it arise as a significant issue, could cause a problem for real estate. However, employment remains very strong, as is evident by the recent report, and salary increases are running above 5%, helping folks keep up with inflation. Another important note that some commodities, notably  lumber, and to a lesser extent, metals, have decreased in price significantly over the past few months. Could this be the effect of the Fed increases? Time will tell, but it is a positive trend for now, we are watching this closely. Overall, we are looking forward to a slowing in home price appreciation and more inventory, this should help our borrowers find great deals, negotiate better and add more value to the neighborhoods they work/live in. We continue to be positive on the future of the sector we operate in. Soon, we are going to be asking the community to allow the RWF team to allocate time and resources to work on structure and diligence of our upcoming DC increase request, will post that as a separate topic. Loan Originations in Tinlake based on finance date New Loans:16 New Loan USD Volume: $3.86mm Average Originated Interest Rate: 9% Average Tinlake Finance Fee: 6.33% Average Loan Amount: DAI 241,000 Average Loan to Value: 71% Average FICO score: 699 Average Term: 10.8 months Loans Paid Back: 9 Current MakerDAO Debt Ceiling: $20mm with about $18.7mm used Portfolio Analytics  Main_2022-06-08T20_53_541968×1240 130 KB  Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 PS. Apologies if there are paywalls in some of the supporting articles I have posted, if anyone would like a full version, please respond with the request and I will see if I can download and attach it. ",
                    "links": [
                        "https://www.economist.com/finance-and-economics/2022/05/25/wall-streets-housing-grab-continues",
                        "https://www.nber.org/system/files/working_papers/w30041/w30041.pdf",
                        "https://www.wsj.com/articles/housing-boom-fails-to-lift-all-homes-above-previous-cycles-peak-11654335001",
                        "https://www.bls.gov/news.release/pdf/empsit.pdf",
                        "https://markets.businessinsider.com/commodities/lumber-price",
                        "https://forum.makerdao.com/t/informal-poll-permit-the-rwf-core-unit-to-allocate-time-and-resources-to-reviewing-an-upcoming-new-silver-request-for-debt-ceiling-increase/15768",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3033998624114895
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#2",
                    "likes": "1",
                    "time": "09/06/2022-16:17:18",
                    "content": "Additionally, I wanted to share some research we have done to compare the appraised After Rehab Value (ARV) to the actual resale prices for loans originated in 2021 (this is a sample of data based on below assumptions). The report is attached, and the key finding is that homes are selling for, on the average, 15% more than the ARV value assigned to it by the appraiser, and generating significant profits for New Silver’s borrowers. We will continue to update this report to see if there are changes to these numbers due to recent economic trends. Assumptions: sampling of fix and flip loans with publicly available resale data.  ARV Analysis_Page_12200×1700 294 KB   ARV Analysis_Page_22200×1700 190 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.668181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/06/2022-17:31:26",
                    "content": "Great information to stay up to date on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "07/09/2022-17:32:02",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-february-2022-update/13926",
            "title": "New Silver February 2022 Update ",
            "index": 13926,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "newsilver-update",
                "rwa-002"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "4",
                    "time": "15/03/2022-20:26:03",
                    "content": "Dear Community, Apologies for the slightly late post. I will spend a little bit of time on macro market commentary, because its not much changed from January. I will focus the majority of this post on the various improvements we are making to continue to institutionalize our business. Here is a brief overview from the February 2022 realtor update:  The national inventory of active listings declined by 24.5% over last year, while the total inventory of unsold homes, including pending listings, declined by 15.3%. The inventory of active listings was down 62.6% compared to 2020 before the onset of the COVID-19 pandemic. Newly listed homes were down 0.5% nationally compared to a year ago, and down 0.7% for large metros over the past year. While annual new listings growth was on the verge of being positive, sellers still listed at rates 13.8% lower than typical 2017 to 2020 levels prior to the pandemic. The February national median listing price for active listings was $392,000, up 12.9% compared to last year and up 26.6% compared to February 2020. In large metros, median listing prices grew by 7.8% compared to last year, on average. Nationally, the typical home spent 47 days on the market in February, down 17 days from the same time last year and down 32 days from February 2020.  Next, I will discuss the steps we are taking to increase transparency and continue to impelement measures to institutionalize our operations.  Hired a CFO, goal is to help us improve our finance, create models to help project and plan for growth and fundraise. He comes to us with experience at Goldman Sachs, Paypal and other enterprises. Engaged with Iron Mountain custody. The purpose is to have all of our paper loan closing docs (we already have all docs digitized) stored at an institutional grade custodian, and the RWF team has access to view and recall any of the paper loan documents. Improved and implemented assignment and allonge docs, this was reviewed and approved by RWF team. These documents should be in line with the “true sale” requirements of the newly published guidelines. Opened accounts with Signature Bank, which will allow direct fiat fund flow to intermediaries like Circle via Signet, help us keep funds more secure and transactional costs down.  Loan Originations in Tinlake New Loans:16 New Loan USD Volume: $3mm Average Originated Interest Rate: 8.7% Average Tinlake Finance Fee: 6.0% Average Loan Amount: DAI 318,954 Average Loan to Value: 62% Average FICO score: 703 Average Term: 12 months Loans Paid Back: 11 Current MakerDAO Debt Ceiling: $20mm with about $14.3mm used Portfolio Analytics  Sheet_1_16473680393301968×1240 133 KB  Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Technology Migrated to Portfolio Analytics v.9, see screenshot above. Restarted Tinlake integration work. People Hired a CFO, a full-stack developer and a loan processor. We are now a team of 15! ",
                    "links": [
                        "https://www.ironmountain.com/industries/mortgage-and-loan"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.860849567099567
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/03/2022-20:33:49",
                    "content": "Thanks for the update! Curious if you have the state by state breakdown of the loans, noticing Florida is a concentration spot but not sure how much is there compared to the rest of the states. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#3",
                    "likes": "1",
                    "time": "15/03/2022-20:53:44",
                    "content": "Yes, Florida has been active, below are breakdown by state.  image1132×567 37.3 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "0",
                    "time": "15/03/2022-21:28:32",
                    "content": "    prankstr25:  Engaged with Iron Mountain  custody. The purpose is to have all of our paper loan closing docs (we already have all docs digitized) stored at an institutional grade custodian, and the RWF team has access to view and recall any of the paper loan documents.   Wowzers! Closing are still done in paper format? Talk-about being stuck in the 80’s haha. I guess if RWF needs documentation of closings, they’ll be hand-delivered, or are you saying the final closing docs are digitized? Otherwise, thank you for the update. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/03/2022-21:38:32",
                    "content": "Yup, seen their trucks drive up and down – big supporters of keeping paper format alive – which means that a lot of trees need to get cut in order for their earnings to continue to satisfied the Wall Street crowd. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#7",
                    "likes": "1",
                    "time": "15/03/2022-22:51:00",
                    "content": "Yes, infortunately closings are done on paper, there are some states/counties that accept digital recording, but we still close on paper. We scan all of the docs so they are available in digitial format, but as a best practice, using Iron Mountain to store the originals. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "13/06/2022-22:51:48",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-july-2022-update/17262",
            "title": "New Silver July 2022 Update ",
            "index": 17262,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "reporting",
                "newsilver-update",
                "rwa-002"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "5",
                    "time": "15/08/2022-19:16:07",
                    "content": "Dear Community, Since the poll passed allowing the RWF CU time to review our upcoming proposal, we have made significant progress on the legal side, and are continuing to spend significant time and expense to work towards a greenlight submission. We are very much hoping for @Real-World-Finance to complete the legal and business reviews and have the greenlight live in the next 30 days. In the macro markets, we have recently seen the first CPI report with lower YoY inflation, though at 8.5%, its still high, and the FED is likely to continue its tightening. In US housing, we are seeing more properties being listed, but time on market remains low and properties are being bought up. In the past 2 weeks, there is some signs that new listing pace is slowing, as the summer listing season is winding down. This means that we will likely continue to see a supply shortage in most markets. We are seeing home price appreciation slow, particularly in the Western markets (which had the most run-up in the past couple years). New Silver has very little exposure there and we are continuing to monitor the markets closely. National average mortgage rates are sitting around 5.5%, down from close to 6%. By historical standards, this is still low. Here is an update from realtor.com  The national inventory of active listings increased by 30.7% over last year, a record-high growth rate. The total inventory of unsold homes, including pending listings, increased by just 3.5% year-over-year due to a decline in pending inventory but has increased for the first time since September 2019. Sellers paused in July, as newly listed homes declined by 2.8% on a year-over-year basis. The median list price grew by 16.6% in July, supported by slowly adjusting seller expectations and a bigger share of larger homes being listed. However, signs of softening price growth are present in a decelerating growth rate and a rising share of price reductions. Time on market was 35 days, just two days less than last year but 26 days less than typical pre-pandemic levels.  Demand for our loans remains very robust, with over $60mm of loans conditionally approved in July. Unfortunately, new financing with Tinlake have slowed because we were hitting the maximum DC, and have had some redemptions recently from senior co-investors. We believe our new proposed structure will solve these issues in an equitable way and allow the New Silver pool to sustainably grow and bring new revenues to the DAO. Loan Originations in Tinlake based on finance date New Loans:7 New Loan USD Volume: $1.45mm Average Originated Interest Rate: 9.6% Average Tinlake Finance Fee: 6.9% Average Loan Amount: DAI 272.938 Average Loan to Value: 75% Average FICO score: 737 Average Term: 8 months Loans Paid Back: 4 Current MakerDAO Debt Ceiling: $20mm with about $16.5mm used Portfolio Analytics  Screenshot_11457×817 147 KB  Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 ",
                    "links": [
                        "https://www.realtor.com/research/july-2022-data",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-july-2022/16954"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.134189228349064
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/11/2022-19:16:21",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-december-2022-update/19433",
            "title": "New Silver December 2022 Update ",
            "index": 19433,
            "category": [
                "Updates",
                "Integrations"
            ],
            "tags": [
                "update",
                "ns-drop",
                "reporting",
                "newsilver-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "12",
                    "time": "16/01/2023-18:15:23",
                    "content": "Dear Community, December was a quieter month due to the holidays. The US housing market is returning to pre-pandemic levels, albeit with higher interest rates. 2023 promises to continue in the same manner, and we are still projecting a -5% price depreciation when we price all of our loans, this is on the conservative side compared to the housing forecasts we recently compiled in this post. We are seeing an uptick in requests for loan extensions, mainly because the housing market overall is moving slower - this includes refinancing into permanent financing, and buyers taking longer to close, again, mostly due to their financing taking a bit longer. We grant up to a 6 month extension after performing the necessary diligence. Here is the December market update from realtor.com:  The number of homes for sale has increased by 54.7% compared to last year. The total number of unsold homes, including homes that are under contract, has increased by 6.0% compared to last year. Home sellers are less active this year, with 21.0% fewer homes being listed for sale compared to last year. The median price of homes for sale has increased by about 8.4% this month, but the rate of price growth has slowed down, entering single-digit territory for the first time in 12 months. Homes are spending 67 days on the market, which is eleven days longer than last year but still shorter than before the pandemic.  Loan Originations in Tinlake based on finance date New Loans:8 New Loan USD Volume: $2.56mm Average Originated Interest Rate: 9.2% Average Tinlake Finance Fee: 6.5% Average Loan Amount: DAI 320,848 Average Loan to Value: 56% Average FICO score: 712 Average Term: 2 months (mainly due to extensions) Loans Paid Back: 17 Current MakerDAO Debt Ceiling: $20mm with about $10.8mm used Portfolio Overview  Main_2023-01-16T17_57_541968×1251 127 KB  Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 ",
                    "links": [
                        "https://www.realtor.com/research/december-2022-data/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.811868686868687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "10",
                    "time": "17/01/2023-11:07:52",
                    "content": "Truly appreciate your commitment to these updates. I know you don’t often get a lot of comments or notice, but yeah, I love that you’re taking the time to communicate consistently. I hope this becomes the norm for current and future RWA partners. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/02/2023-21:08:47",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-october-2022-update/18821",
            "title": "New Silver October 2022 Update ",
            "index": 18821,
            "category": [
                "Updates"
            ],
            "tags": [
                "update",
                "ns-drop",
                "new-silver",
                "reporting",
                "newsilver-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "0",
                    "time": "16/11/2022-16:38:05",
                    "content": "Dear Community, First, thank you to everyone at @CES_CU and @Recognized-Delegates who has taken a look at our recent post requesting a DC increase. We are looking forward to your feedback, and would like to schedule an AMA call, if the Community is interested. Please reply to this thread if you have interest in participating an AMA with New Silver and we will arrange it. Here is a short summary of the October real estate market in the U.S., from realtor.com:  The national inventory of active listings increased by 33.5% over last year. The total inventory of unsold homes, including pending listings, increased by just 0.5% year-over-year due to a decline in pending inventory (-30.0%). Sellers are less active than last year, as newly listed homes declined by 15.9% on a year-over-year basis. The median list price grew by 13.3% in October and is slowly decelerating. Time on market was 51 days, 6 days more than last year but 20 days less than typical pre-pandemic levels.  I would like to take a minute to discuss the projections for 2023, as we are actively planning projections for the next year. Our base base case of HPI decrease (and the number we use for profitability test of each loan we underwrite) is a decrease of 5% over the next 12 months. We have recently seen some projections from the GSE’s and aggregators, I am pasting a summary below:  645ed87f-1b62-44cd-8a1f-997bb268faad_963x327963×327 8.11 KB  Based on these projections, we believe our base case of a 5% reduction is on the conservative side, we are not going to revise it for the time being. Sales volumes are certainly decelerating and active listings growing, though they have not yet  reached pre-pandemic (ie normalized) levels. We see existing home sales decelerating by around 25% in Q1 and Q2 of 2023, and then starting to recover in Q3 and onwards. This is in line with most estimates we have looked at to date. New Silver is continuing to see strong demand on the loan application side, and believe volatility can be taken advantage of by experienced borrowers. We are hopeful the Community will approve our DC increase request and allow New Silver to continue to grow, while bringing ~2.25mm DAI (around 10% of the current run-rate) per year in additional revenues for the DAO. Loan Originations in Tinlake based on finance date New Loans:5 New Loan USD Volume: $1mm Average Originated Interest Rate: 10/4% Average Tinlake Finance Fee: 7.6% Average Loan Amount: DAI 218,162 Average Loan to Value: 42% Average FICO score: 734 Average Term: 8 months Loans Paid Back: 11 Current MakerDAO Debt Ceiling: $20mm with about $13.2mm used  Main_2022-11-16T16_36_041968×1251 128 KB  Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 ",
                    "links": [
                        "https://www.realtor.com/research/october-2022-data/",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-october-2022/18650",
                        "https://forum.makerdao.com/t/new-silver-december-2022-update/19433"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.881246470920384
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/12/2022-02:38:10",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-august-2022-update/18019",
            "title": "New Silver August 2022 Update ",
            "index": 18019,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "new-silver",
                "reporting",
                "newsilver-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "5",
                    "time": "20/09/2022-20:47:42",
                    "content": "Dear Community, We have been working diligently to bring the legal framework to completion so that we may present it for an upcoming signal request and a DC increase. We believe we are in the final phases, unfortunately, everything is taking longer than anticipated. Taking a broad market view, we are anticipating another FOMC rate hike this week, which is expected to be 75 to 100 basis points, as inflation fighting continues. Consumer mortgage rates in the US have crossed the 6% mark once again. Our earlier anticipated rate was up to 6.5, it may go some above that, though these rates are still historically “normal”. In real estate, the broad trend we are seeing is less sales transactions. Active listings are up but not back nearly close to pre-Covid levels, and have started trending down in the last couple of months. So the dynamic is that sellers are pulling back as well as buyers, while prices are not declining YoY (but in some areas, declining MoM). The fact that active listings are down should help keep prices relatively stable.  New Silver is continuing to see strong demand for our product as real estate investors are taking advantage of dislocations in the marketplace. We fielded over $50mm worth of conditionally approved loan applications in August. We are unable to close a lot of good loans due to our capital constraint, which we are hoping to rectify in the upcoming DC increase request. Loan Originations in Tinlake based on finance date New Loans:11 New Loan USD Volume: $2.5mm Average Originated Interest Rate: 9.7% Average Tinlake Finance Fee: 7% Average Loan Amount: DAI 229,744 Average Loan to Value: 64% Average FICO score: 733 Average Term: 8 months Loans Paid Back: 4 Current MakerDAO Debt Ceiling: $20mm with about $15.2mm used Portfolio Analytics  Main_2022-09-20T20_44_031968×1251 130 KB  Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.955997474747475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "19/12/2022-20:48:10",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-june-2022-update/16552",
            "title": "New Silver June 2022 Update ",
            "index": 16552,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "new-silver",
                "newsilver-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "3",
                    "time": "12/07/2022-20:54:19",
                    "content": "Dear Community, Since the poll passed allowing the RWF CU time to review our upcoming proposal, we have been working hard on all fronts as we prepare to ask the community to consider a debt ceiling increase. We are engaging with @Real-World-Finance CU as well as working with legal counsels and other stakeholders, and are hoping  to present the proposal before our next update. Here is a summary of the past month. As the Federal Reserve increased rates to fight inflation, the overall economy is cooling. While the single family housing inventory in the US remains historically low, there have been some increases in active listings. Conversely, price is still appreciating and homes are being bought up quickly. We are fairly well insulated from the consumer real estate market, but its always nice to see that consumer mortgage rates have dropped last week. We expect to see a gradual slowdown in consumer activity to a more “normalized” level by historical measures. Our base case for asset values is that pricing will stabilize towards the end 2022 and into 2023 and remain in range. We are seeing a lot of loan applications come in, and loans are paying off as expected (though in a few cases, we granted extensions due to various delays, but all within norms). Since we have used the majority of the debt available to us through Maker, we have had to sell newly originated loans to other partners. Rates have gone up across the board, and buy rates from partners increased as well, thus causing us to increase interest rates. We believe, with an increased DC, we should be able to bring interest rates down to slightly below market in order to attract the most qualified borrowers/projects. Here is a real estate market snapshot from realtor.com:  The national inventory of active listings increased by 18.7% over last year, while the total inventory of unsold homes, including pending listings, still declined by 1.4% due to a decline in pending inventory. The inventory of active listings was down 34.1% compared to June 2020 in the early days of the COVID-19 pandemic, and down 53.2% compared to June 2019. In other words, there are a little less than two-thirds the number of homes available compared to June 2020, and less than half compared to June 2019. More new listings entered the market in June compared to last year, though slightly down from May new listing growth.  Newly listed homes were up 4.5% nationally compared to a year ago, and up 3.1% for large metros over the past year. Sellers listed at roughly the same rate as 2017 to 2019, prior to the pandemic, up slightly by 1.0%.   Housing remains expensive and fast-paced with the median asking price at a new high while time on market is up just one day from last month’s record low.  The June national median listing price for active listings was $450,000, up 16.9% compared to last year and up 31.4% compared to June 2020. Nationally, the typical home spent 32 days on the market in June, down 4 days from the same time last year and down 37 days from June 2020.    Loan Originations in Tinlake based on finance date New Loans:14 New Loan USD Volume: $3.2mm Average Originated Interest Rate: 9.1% Average Tinlake Finance Fee: 6.45% Average Loan Amount: DAI 234,734 Average Loan to Value: 71% Average FICO score: 707 Average Term: 6 months Loans Paid Back: 16 Current MakerDAO Debt Ceiling: $20mm with about $18.1mm used Portfolio Analytics  Main_2022-07-12T20_46_441968×1240 130 KB  Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 We would love to take any questions from the Community and @Recognized-Delegates here and/or arrange an AMA if there is interest. Thank you for reading. ",
                    "links": [
                        "https://www.freddiemac.com/pmms",
                        "https://www.realtor.com/research/june-2022-data",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.013408694963573
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/07/2022-22:55:55",
                    "content": "@prankstr25 Thank you for your summary. A few starting questions which may pre-empt community questions.     prankstr25:  We are seeing a lot of loan applications come in, and loans are paying off as expected (though in a few cases, we granted extensions due to various delays, but all within norms).   Can you please provide a view to the Community on the loan holidays/workouts and how you’re tracking that in the data?     prankstr25:  we have had to sell newly originated loans to other partners   It would be great if you could include data/charts on the various distribution channels and the relative credit quality distribution of those.     prankstr25:  Housing remains expensive and fast-paced with the median asking price at a new high   Do you have forecasts you can provide for pricing index, either from internal HPI models or externally derived, on when you expect HPI to peak relative to interest rate increases? Also, where do you expect peaks to happen first out of the regions you originate in? For HPI, maybe using historical benchmarks or alternatively what is happening in other economies would be helpful too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.026931818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/07/2022-19:29:40",
                    "content": "Sure. Happy to provide some color.   We do not have any loans in any kind of default, including workout or forbearance. Should a need for something like this arise, we have a process, based in days late and other criteria, to handle partially in-house and then pass it over to special servicing with our 3rd party servicer.   We have a few partnerships for forward flow whole loan buying, primarily via Churchill Real Estate and Palisades. The loans are the exact same as what is seen in our pool on Tinlake. When we originate loans, all loans are underwritten the same and our goal is to place them into our pool, however, because there is not enough liquidity left right now, we place them elsewhere.   Because of the short duration of our products, with the average payback at atound 6 months, and a loan to after rehab value in the pottfolio under 70%, we look out 12 months. We rely on our internal algorithms for profitability testing based on appraisal provided after rehab value and/or market rent analysis, and if the project shows to be profitable (with a 5% price correction) or refinancable (if the use case is fix to rent), and all other underwriting criteria is met, this is satisfactory. Our base case for real estate pricing for the next 12 month is that price appreciation will flatten (but we are leaving room for a 5% correction).   Hope this answered your questions. We will expand on this in the signsl request in the near future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.387566137566138
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/10/2022-19:29:44",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-april-2022-update/15086",
            "title": "New Silver April 2022 Update ",
            "index": 15086,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "newsilver-update",
                "rwa-002"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "3",
                    "time": "10/05/2022-18:45:33",
                    "content": "Dear Community, We do not believe things have materially changed since the March update and the AMA we did in April. At the macro level, the Federal Reserve increased the funds rate by 50 basis points (the market was expecting 75), this caused a short term rally in the equities markets, followed by major declines. The equities markets are still trying to find their footing amongst the global macro events - the war in Ukraine, energy prices, broken supply chains and potential embargoes and inflation. In the US, real estate prices continue to appreciate, but we have recently seen a small increase (3% yoy on a weekly trendline) in new listings. There are also some newer trends emerging where people who can no longer afford (or don’t want to for other reasons) to buy property in the areas where they live, and are starting to look elsewhere, and specifically towards the South of the country. Our lending activities support that trend, with Florida and other southern states continuing to be very active. We have also heard through some industry contacts that we may start seeing longer term mortgages being offered to consumers, specifically, a 40 year fully amortized loan (for context, the longest available has been 30 years). This product is already available as a modification option for existing loans, so we are keeping a close eye on that. If this comes to fruition, it will be a positive for consumers, as it will lower the monthly borrowing costs and stimulate demand (though with such short supply, it may further drive up prices). Good news - New Silver has recently become a member at US Green Building Council, which oversees the LEED certification. Here is how they describe it “LEED provides a framework for healthy, efficient, carbon and cost-saving green buildings. LEED certification is a globally recognized symbol of sustainability achievement and leadership.” New Silver will be announcing its “Rebuild Greener” initiative, in conjunction with LEED, very shortly, stayed tuned! Loan Originations in Tinlake based on finance date New Loans:14 New Loan USD Volume: $3.44mm Average Originated Interest Rate: 9% Average Tinlake Finance Fee: 6.33% Average Loan Amount: DAI 246,000 Average Loan to Value: 71% Average FICO score: 711 Average Term: 10.7 months Loans Paid Back: 8 Current MakerDAO Debt Ceiling: $20mm with about $17mm used Portfolio Analytics  Main_2022-05-10T18_17_021968×1240 341 KB  Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 ",
                    "links": [
                        "https://forum.makerdao.com/t/focus-on-11-navigating-real-estate-investment-markets-with-new-silver/14646",
                        "https://www.realtor.com/research/weekly-housing-trends-view-data-week-apr-30-2022",
                        "https://www.realtor.com/research/q1-2022-cross-market-demand-report",
                        "https://www.housingwire.com/articles/fha-adds-40-year-loan-term-to-covid-19-arsenal/",
                        "https://www.usgbc.org/organizations/new-silver",
                        "https://forum.makerdao.com/t/informal-poll-permit-the-rwf-core-unit-to-allocate-time-and-resources-to-reviewing-an-upcoming-new-silver-request-for-debt-ceiling-increase/15768"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.077392830746489
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/05/2022-21:02:22",
                    "content": "Hello Kirill, and thank you for posting your monthly update–always appreciated and very informative. This morning the NY Fed quarterly household report stated that mortgage loan demand is decreasing, and there’s fall-off in demand for refinancing because of the Fed rate hikes. Also, “U.S. household debt rose to a record $15.84 trillion in the first quarter driven almost entirely by a $250 billion increase in home loan balances”  Should we expect another 2008 scenario were credit will dry up and the mortgage industry will have to lay-off 50%++ of its work force? Are you seeing any correlation between 08’ and now? How can New Silver and the power to mint DAI via a MakerDAO Vault take advantage of the upcoming potential downtrend of credit risk and illiquidity? Do you also think that non-bank lenders will hit a rough patch? Some of these AI lending platform for consumer loans are getting hammered at the moment     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.677609427609428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#3",
                    "likes": "2",
                    "time": "10/05/2022-22:18:21",
                    "content": "Thank for the question @flipflopflapdelegate, always appreciate it. I will provide my thoughts in separate bullets below. -As it relates to the consumer mortgage industry, I would say a couple things, most importantly, is that we don’t lend to consumers, so our borrowers consider their projects that we finance as money-making business opportunities. So if they feel that they can make money with this project, they will not default, and we do a lot to try to make sure that they will make money (see March update and AMA). Of course, there are no guarantees as with anything else, but I believe we must carefully delineate our financing, which is very short term and for business purposes, from others in the consumer lending world. -I personally don’t believe that crisis repeat themselves. 2008 was a housing crises precipitated by loose lending standards, we are now in a completely different environment. We may see less mortgage credit extended, and we are working to address it by providing our borrowers other “exit” opportunities, such as selling the property to a platform like Roofstock or similar. The nice thing is that people have to live somewhere, and with the limited housing supply, if people are not buying, they are renting, so our borrowers can exit to a rental scenario. We may see a pricing correction, we are already budging for 5% automatically, and then we typically have a 25% cushion on top of that, so if we have to foreclose on a house, principal should be well protected. Furthermore, the senior lender (Maker) is protected by another 15% mezz tranche, so there would have to be a 40% correction in order for Maker to be impacted. -Our strategy for the potential market slowdown is for New Silver to attract the most qualified borrowers by keeping rates low and continuing to be fast, nimble and reasonable. Continued partnership with Maker is a key part of that strategy. I also believe that the US government has learned their lesson in 2008, and they will not allow the situation to deteriorate to that level, they have levers, even if it means seeing higher inflation for some time to come. The above is either my personal opinion, or our view as New Silver. We unfortunately dont have a crystal ball, but I believe we are doing the responsible work in order to be best prepared for any outcome. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.65361385925902
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "1",
                    "time": "11/05/2022-11:49:05",
                    "content": "Looks like ARM mortgage loans are back in style  Let’s hope for the best. Although this time you need a down-payment as oppose to the 2000s. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "09/08/2022-11:49:40",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-january-2022-update/13155",
            "title": "New Silver January 2022 Update ",
            "index": 13155,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "newsilver-update",
                "rwa-002"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "4",
                    "time": "10/02/2022-00:19:08",
                    "content": "Dear Community, In January, the general real estate market trends I described in previous posts continued and accelerated. Based on data from the January realtor.com housing data release, and collaborated by other data we look at, these macro trends are taking shape so far this year:  Listings declined by 28.4% over last year across the U.S. Inventory of unsold homes, including pending listings, declined by 17.9% Newly listed homes are down 9.1% Median listing price for active listings was $375,000, up 10.3% compared to last year and up 25.0% compared to January 2020 Average days on market is 61 days, down 10 days from same time last year  This continues to be a sellers market, and we have seen median profits from “flipped” properties increase over the past quarter. Borrowers are continuing to look for value-add opportunities, and are, at times, being outbid by retail buyers, who are willing to pay more because they will be living in the home. Supply chains are, anecdotally, faring a bit better, but there are still occasional issues, but it has not substantially effected any of our deals as of yet. We anticipate 3 to 4 Fed rate increases this year, which will (and already has to some degree) cause consumer mortgage rates to increase, however, we believe these rates to still be acceptable to home buyers (around 3.5% for a 30 year term as of today). We are continuing to monitor this and will provide reporting on this monthly. We have developed a version 0.1 of our upcoming loan portfolio analytics, here is a snapshot of the current portfolio:  Portfolio Analytics February 20221503×859 93.3 KB  Loan Originations in Tinlake New Loans:13 New Loan USD Volume: $4.42mm Average Originated Interest Rate: 8.7% Average Tinlake Finance Fee: 6.04% Average Loan Amount: DAI 340,592 Average Loan to Value: 58% Average FICO score: 700 Average Term: 12 months Loans Paid Back: 7 Current MakerDAO Debt Ceiling: $20mm with about $13mm used Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Technology Rolled out version 0.1 of Portfolio Analytics. More to come. People We added a loan processor to the team as of this month. Continuing to search for full-stack developers. ",
                    "links": [
                        "https://www.realtor.com/research/data/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.041360575451485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "11/05/2022-00:19:18",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-november-2022-update/19136",
            "title": "New Silver November 2022 Update ",
            "index": 19136,
            "category": [
                "Updates",
                "Integrations"
            ],
            "tags": [
                "update",
                "ns-drop",
                "reporting",
                "newsilver-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "4",
                    "time": "12/12/2022-17:54:05",
                    "content": "Dear Community, On the macro-economic front, it feels like investors are starting to think about the current situation in the US a bit differently, with more investors predicting this will be a “soft landing” for the economy. Some are arguing we are already in a technical recession, but there is still high hope that a lot of the pain of a major economic downturn can be avoided. This is a strange time, when good news coming out of the market, like strong employment numbers, wage growth, etc, are actually interpreted negatively by the market, because it may lead to larger Fed rate hikes. Please see the recent US housing market updates from realtor.com:  The national inventory of active listings increased by 46.8% over last year, increasing more than 13 percentage points over the previous month, the largest month-over-month increase in this growth rate since May 2022 when inventory first saw a positive annual growth rate. The total inventory of unsold homes, including pending listings, increased by just 3.0% year-over-year due to a decline in pending inventory (-35.6%). Sellers are less active than last year, as newly listed homes declined by 17.2% on a year-over-year basis. The median list price grew by 11.0% in November and is decelerating from higher growth rates in recent months. Time on market was 56 days, 8 days more than last year but 18 days less than typical pre-pandemic levels.  Average conforming mortgage rate is ~6.5%, down from over 7% in October, larger due to decrease in mortgage demand. The local markets where New Silver (mostly the Eastern seaboard) primarily operates are seeing the smallest price slowdowns in the country. We are continuing to bake in a base-case price depreciation of 5% in our loan level models, and continuing to watch the local markets carefully. We would also like to report that the co-investor covenant of 25% has fallen to 22% on Friday. Because the co-investor ratio is managed manually, we did not fully anticipate the way funds are assigned on redemptions, we were under the assumption that any redemption is handled 1 to 1, and we had an 800k loan payoff and a redemption of the same amount was released. However, on the redemption, 100% of the funds go to the co-investor, even though co-investor’s participation in the repaying loan was only a small fraction of that, thus lowering the ratio more than we anticipated. This is definitely not a usual occurrence, was not our intention and we will take measures to prevent this from happening in the future. We have self-reported this issue to SF on Friday. In the meantime, there will not be any new loans added (we still have to process loan extensions if they occur), and our Tin (junior) buffer remains significantly larger than the requirement (currently 23% vs the 15% required), this should sufficiently cover the small co-investor shortfall while we address this issue. Loan Originations in Tinlake based on finance date New Loans:12 New Loan USD Volume: $2.9mm Average Originated Interest Rate: 9.8% Average Tinlake Finance Fee: 7.08% Average Loan Amount: DAI 244,826 Average Loan to Value: 57% Average FICO score: 708 Average Term: 9 months Loans Paid Back: 18 Current MakerDAO Debt Ceiling: $20mm with about $12.5mm used Portfolio Overview  Main_2022-12-12T16_43_261968×1251 126 KB  Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 ",
                    "links": [
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-november-2022/19023"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.188541181041181
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/01/2023-03:54:06",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "669"
}