{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/interim-forward-guidance-for-base-rate/3518",
            "title": "Interim Forward Guidance for Base Rate ",
            "index": 3518,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "rates",
                "base-rate",
                "system-parameter"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "4",
                    "time": "04/08/2020-01:32:37",
                    "content": "With the base rate now at -4%, all collateral asset stability fees (except MANA) are at 0%. Despite this accommodative monetary policy, we have yet to see much improvement in the peg or additional utilization of available debt ceilings. I think we might be able to incentivize DAI minting by further reducing the base rate below -4%. This will not reduce any asset stability fees below the 0% lower bound. But because weekly base rate polls only contemplate changes of ±4% from the current value, additional reduction of the base rate effectively offers vaults assurance of 0% rates persisting for a longer time period. For example, if MKR voters elected to reduce the base rate to -8% this week, ETH vaults would have 2+ weeks notice (3 or more consecutive votes to increase base rate) before their rates could rise. For WBTC, USDC, ZRX, KNC, it would give 1+ week notice (2 or more consecutive votes to increase base rate). Each additional 4% reduction in the base rate would offer 1 more week of notice to vault owners, with could increase confidence in Maker monetary policy and commitment to the peg. Drawbacks: This would reduce system income from MANA vaults (currently 50k DAI from MANA, so reducing SF from 8% to 4% would reduce annual income from 4,000 DAI per year to 2,000 DAI per year). Further reducing the base rate could also theoretically hinder Maker’s response to situations where DAI falls below the peg. However, the emergency of stablecoin AMMs such as Curve and mStable give DAI considerable support around $1, and USDC vaults would also presumably be wound down if DAI few below the peg. And if DAI did fall below $1, Maker could always pursue emergency action outside of the weekly governance cycle. Cross posting this in long form from rocket chat: https://chat.makerdao.com/channel/governance-and-risk?msg=u8EeHpcTm7vm5Rvoq Base rate vote is here: https://vote.makerdao.com/polling-proposal/qmt99phgaqmhlt1vcyyzxdkaf9rwesepcmdgenoaomamzd Are there any reasons that we wouldn’t want to pursue this course of action? Any other big potential pitfalls? ",
                    "links": [
                        "https://vote.makerdao.com/polling-proposal/qmt99phgaqmhlt1vcyyzxdkaf9rwesepcmdgenoaomamzd",
                        "https://forum.makerdao.com/t/maker-relay-ep-7/3630"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.209920634920635
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#2",
                    "likes": "3",
                    "time": "04/08/2020-02:25:52",
                    "content": "It seems to me like this couldn’t hurt if we have space in executive votes. I’m not super convinced that it will improve the peg though. It’s only been a few days since the base rate went to -4%, and it was also the weekend. I think we will likely see gradual peg improvement over the next week or so, especially if the markets continue to rally. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/08/2020-07:03:14",
                    "content": "Hope! I bet there is at least 400m need. Tho it can’t hurt. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "4",
                    "time": "04/08/2020-12:50:12",
                    "content": "I think vault holders would see through this ploy for what it really is, optics. If the peg suddenly breaks in the other direction, we’re not going to sit on our hands for weeks; we’re going to raise the base rate back up. I am as frustrated as anybody that the peg is at 1.02 even with the extremely accommodative monetary policy, but I think the only potential cure is to onboard more assets and generate more DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "0",
                    "time": "04/08/2020-17:51:09",
                    "content": "I don’t think we can give up on it and wait until new onboarding. Because clairly the market price for 1dai is 1.02 dollars as no maker wants to take the risk to sell under this price and tomorrow it will be 1.04 and after it is the end of makerdao. Because if a dai doesn’t cost 1 dollars there is no product to sell. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.840909090909091
                }
            ]
        }
    ]
}