{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/notes-from-starknet-sessions-in-tel-aviv/19861",
            "title": "Notes from Starknet Sessions in Tel Aviv ",
            "index": 19861,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "sne-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#1",
                    "likes": "3",
                    "time": "18/02/2023-11:44:48",
                    "content": "Regenesis and Cairo 1.0  Cairo 1.0 has made great progress but is still not completely stable (currently Cairo1.0 alpha2). Currently contracts cannot be deployed in Cairo 1.0. Once feature parity will be reached with Cairo 0, the beginning of the Regenesis transition will start Regenesis is optimistically anticipated to happen at the end of March We will post more details about the technical details of our migration process in March  Decentralization and governance   @0xevolve  and @pyramidmaker  attended the Governance day. We shared governance challenges from different rollups, protocols, and Bitcoin. We discussed what resilience means for a foundation whose goal is to scale Ethereum. We agreed on the need to define values that we can always go back to mitigate ambiguous situations.  @maciejka  and @bartek  attended decentralization day. Starkware and the Starknet ecosystem is very committed to decentralization and are working hard to make it happen swiftly. Technical details are still to be fleshed out and the discussions are still relatively abstract, but at a high-level decisions that have been made: the prover will be opensourced, fast finality requires checkpoints, there will be separate protocols for provers (think about it as “prover sharding”). The protocol to reach consensus across sequencers is still being designed. A talk from Tom Brand gives a good overview of the state of Starknet and the roadmap  Builder ecosystem and DAI demand  Starknet is attracting talents. The ecosystem is the fastest growing when looking 2 years and 1 year back with a growth or respectively 2000% and 237%, hence making Starknet the fastest growing ecosystem in the bear market Most projects we met are working on tooling, DeFi, and gaming The most frequent ask from projects is how they can bootstrap their DAI liquidity. Today we don’t have a very good answer to this. However, once MCD is built on Starknet we will revisit the GUNI design whereby Maker can accept liquidity tokens as collateral.  On-boarding large corporates  VISA announced building a PoC for self-custodial wallets to pay their invoice using Starknet The demande for Starkex is remaining strong. Once Starknet will be mature enough, it is likely that some large accounts will transition from Starkex to Starknet  Formal verification and tooling  Formal verification of the MCD and specifically the vat contract is a challenge. We have been exchanging over the past 12 months with 4 different projects. Projects are in a challenging position whereby the demand for formal verification is only coming from very few protocols, yet those protocols are not paying them. We are looking to support a single project with Aave and the Starknet foundation. We met with a number of smart security startups and have identified one that could support us in our effort to better secure bridges with delayers and circuit breakers  ",
                    "links": [
                        "https://forum.makerdao.com/t/guniv3-busd-dai-mip6-collateral-onboarding-application-form/17185"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8661564625850335
                }
            ]
        }
    ]
}