{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-february-1-7-2022/13103",
            "title": "Weekly Relay: February 1 - 7, 2022 ",
            "index": 13103,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "3",
                    "time": "08/02/2022-02:50:16",
                    "content": " Screenshot (17)1920×846 40.2 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop-shop for MakerDAO updates.  The public PDF version is available here.   Current Events  This Week in Governance  Community Deep Dai-ve  Mark your Calendar  Useful Links  Have Feedback?   Current Events  KYC/AML Compliance Research Controversy The @SES-Core-Unit came with good intentions to announce their new grant involving know-your-customer (KYC) / anti-money laundering (AML) compliance obligations focusing on the Financial Action Task Force’s updated guidance for Virtual Asserts and Virtual Asset Service Providers. The grant aims to act as a research and identify a selection of potential AML tools to be demo-tested. The community believes the grant goes against the ideology of what members of the DAO believe it to be, anti-compliance. Several people are worried that adding a KYC layer promotes bank-like characteristics for MakerDAO. The team responds to these concerns by explaining that the grant is mere research to help promote more decentralization and prepare the community against potential legal risk. Some of the community ultimately agreed to trust the process and believe we should be patient until receiving results from the research. Others misunderstand the objectives behind the grant announcement. Nonetheless, @SES-Core-Unit has the DAOs best interest at heart to educate everybody and improve the protocol’s success.  Rate Limited Flapper On-Chain Recent discussion and signal request expressed that the majority of the community would like to introduce Rate Limiting into the Flapper to continue MKR burn, which is now on-chain (poll ends February 10th at 4 PM UTC). The @Protocol-Engineering Core Unit published more details on the Rate Limited Flapper.  This is a simple amendment that allows Governance to limit the amount of DAI that is allowed to be auctioned off at once, accomplished by adding the following two new parameters to the flapper contract; lid and fill…  The next steps involve an additional signal request determining the correct DAI limited to be auctioned off at once. Solutions have already been written by @hexonaut, which will undergo an audit before implementation and successfully passing its on-chain poll.   This Week in Governance  MIPs Weekly MIPs Update #73  Starting today and through Wednesday, the Formal Submission Window is open. The MIPs update provides all proposals currently eligible for formal submission and the latest RFC proposals. Check it out! RFC and FS Dates for reference and existing proposals can be seen on this new proposal tracker (WIP)! Upcoming dates:  Ratification polls go live on Monday, February 14th! Ratification polls will run for two weeks until Monday, February 28th.   Executive Vote Recognized Delegate Compensation, Raise the Emergency Shutdown Threshold, MOMC Parameter Changes, Core Unit DAI Budget Stream Corrections - February 04, 2022 This executive proposal passed, and the following outcomes were executed:  Recognized Delegate Compensation Payments - January 2022 As per these successful governance polls (1, 2) and the ongoing trial of delegate compensation, a total of 54,752 DAI was distributed to eight Recognized Delegates as detailed below:     DAI Transferred Delegate     12,000 DAI FlipFlopFlap Delegate LLC   12,000 DAI schuppi   12,000 DAI Feedblack Loops LLC   8,620 DAI MakerMan   4,807 DAI monetsupply   3,795 DAI ACREinvest   889 DAI JustinCase   641 DAI GFX Labs    Details on the breakdown of delegate compensation for January can be found on the MakerDAO forum here.  Emergency Shutdown Module Threshold Increase As per this governance poll, the following change to the Emergency Shutdown Module (ESM) was made:  Raise the threshold to trigger the Emergency Shutdown Module by 25,000 MKR from 75,000 MKR to 100,000 MKR.  For further information, please see the initial Signal Request on the MakerDAO forum here. Further details about the changes being made to the Emergency Shutdown Module have been posted by the Protocol Engineering Core Unit on the MakerDAO forum here.  MOMC Parameter Changes As per this governance poll on the latest MakerDAO Open Market Committee proposal, the following parameter changes will be made in the Maker Protocol if this executive proposal passes.     Vault Type Parameter Change Old New     ETH-A Stability Fee -0.25% 2.5% 2.25%   ETH-B Stability Fee -2.5% 6.5% 4.0%   WSTETH-A Stability Fee -0.5% 3.0% 2.5%   WBTC-A Stability Fee -0.25% 4.0% 3.75%   WBTC-B Stability Fee -2% 7% 5%   WBTC-C Stability Fee -0.75% 1.5% 0.75%   UNIV2DAIETH-A Stability Fee -1% 2% 1%   UNIV2WBTCETH-A Stability Fee -1% 3% 2%   UNIV2USDCETH-A Stability Fee -1% 2.5% 1.5%   GUNIV3DAIUSDC2-A Stability Fee -0.25% 0.5% 0.25%   TUSD-A Stability Fee -1% 1% 0%   DIRECT-AAVEV2-DAI Target Borrow Rate (bar) -0.25% 3.75% 3.5%   GUNIV3DAIUSDC1-A Maximum Debt Ceiling (line) -400 million DAI 500 million DAI 100 million DAI   GUNIV3DAIUSDC2-A Maximum Debt Ceiling (line) +250 million DAI 500 million DAI 750 million DAI   GUNIV3DAIUSDC2-A Target Available Debt (gap) +40 million DAI 10 million DAI 50 million DAI     Correction of Core Unit Budget Streams The previous Executive Vote contained errors relating to the DAI budget Streams for the StarkNet Engineering and Strategic Finance Core Units. The error has been detailed by the Protocol Engineering team on the MakerDAO forum here. In order to correct this error, the following changes have occurred:  The currently configured DAI budget streams for the StarkNet Engineering and Strategic Finance Core Units are canceled.  412,085 DAI was streamed to the Strategic Finance Core Unit at 0xf737C76D2B358619f7ef696cf3F94548fEcec379 starting at 2022-03-01 and ending at 2022-07-31 as a result of their most recent budget proposal.  214,583 DAI was streamed to the StarkNet Engineering Core Unit at 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1 starting at 2022-03-01 and ending at 2022-07-31 as a result of their most recent budget proposal. In order to retain access to the first month’s funds during the stream update, we transferred 82,417 DAI to the Strategic Finance Core Unit at 0xf737C76D2B358619f7ef696cf3F94548fEcec379. The transfer amount of 82,417 DAI is equivalent to one month of funding under their most recent budget proposal and was made by claiming the funds from the canceled stream plus a transfer of the difference between 82,417 DAI and the amount claimed. In order to retain access to the first month’s funds during the stream update, we transferred 42,917 DAI to the StarkNet Engineering Core Unit at 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1. The transfer amount of 42,917 DAI is equivalent to one month of funding under their most recent budget proposal and was made by claiming the funds from the canceled stream plus a transfer of the difference between 42,917 DAI and the amount claimed.   Active Governance Polls  There are currently three active governance polls on-chain:      Poll Name Vote Discussion     Extend the Delegate Compensation Trial - February 7, 2022 Vote Discussion   Offloading TUSD-A - February 7, 2022 Vote Discussion   Introduce Rate Limiting into the Flapper - February 7, 2022 Vote Discussion    Check out January 31st’s issue of Weekly Relay for more information on the most recently ended polls.  Community Greenlight Polls There is currently no community greenlight polls on-chain. Check out an ‘at-a-glance’ view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests Advance “Rapid Payment for Small Bug Bounties” to on-chain poll Signal Ends February 11th @psychonaut submits a signal request asking the community whether we should push MIP4c3-SP1: Rapid Payment for Small Bug Bounties (MIP64, MIP40c3-SP42 Amendment) towards an on-chain poll. gbMKR, a proposal to benefit long-term MKR holders Signal Request Ends February 8th In response to feedback to their recent proposal, @paraficapital adds a few improvements and initiates a signal request to the community asking whether MakerDAO should implement gbMKR. [Signal Request] Raise Gemini Dollar (GUSD) PSM Debt Ceiling To 60 Million DAI  Signal Request Ends February 8th The newly onboarded PSM-GUSD has a debt ceiling of 10m DAI and is currently close to capacity. In order to increase the diversification of stablecoin reserves, GFX Labs wants to raise the debt ceiling to 60 million DAI, which would represent approximately 32% of the outstanding GUSD float; this is in line with what could be covered by the Stability Buffer in a worst-case scenario. In an effort to push this proposal, GFXlabs asks the community where the PSM-GUSD debt ceiling should be raised to 60 million DAI, MakerMan Retroactive Delegate Comp Signal Request Ends February 18th The Recognised Delegate Compensation Trial Performance Modifier poll passed, which led to compensation calculation changes for December. However, one delegate, @MakerMan, received no compensation for November and would have received 8,245 DAI if the new compensation model had been in place. In response to this event, @prose11 submits a signal request asking the community whether the protocol should pay MakerMan the 8,245 DAI for his Recognized Delegate duties in November, calculated based on the December formula change.   Community Deep Dai-ve  Tweet of the Week     twitter.com    𓀣 Odysseas.eth 𓀢 @odysseas_eth  me: yeah, I can change her her: vat.sol   7:23 PM - 3 Feb 2022           120                14             Forum Insight With 20 Core Units currently in existence, it is difficult to locate all their updates for the past month. Luckily, the Monthly Core Unit Updates provides both a shortlist and a public PDF document containing a comprehensive assembly of all updates for January 2022. Also, Check out the latest Forum at a Glance for additional forum insight.  Articles   Introducing Maker Risk Dashboard  @josolnik explores how the Maker Risk Dashboard can be utilized as a tool to help achieve computer-aided governance and ultimately push towards community alignment supported by data-driven decision making.    EPNS Push Notifications are Live!  Push notifications for the Governance Portal are Live! The folks at EPNS have made a video showing how to subscribe to the notification channel—check      Meetings and Events  Last Week’s Call Recordings  Governance and Risk Call #177   Forum | Video      This Week’s Calls  Issue Discussion Call #4 | Core Unit and Facilitator Offboarding  Forum | Join Link    Governance & Risk   Join Link | Agenda - Thursdays at 16:00 UTC   Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC    Useful Links Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for Stakeholders; Protocol analytics, Dai analytics, collateral & liquidation metrics, governance history, and auctions data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs Dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is purely for information and communication purposes only. ",
                    "links": [
                        "https://forum.makerdao.com/t/grant-announcement-kyc-aml-compliance-research/12991",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn/12837",
                        "https://vote.makerdao.com/polling/QmagLVA2?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056",
                        "https://forum.makerdao.com/t/weekly-mips-update-73/13092",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://vote.makerdao.com/executive/template-executive-vote-recognized-delegate-compensation-raise-the-emergency-shutdown-threshold-momc-parameter-changes-core-unit-dai-budget-stream-corrections-february-04-2022?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/polling/QmPCbBu3?network=mainnet",
                        "https://vote.makerdao.com/polling/QmbvuhYH?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://vote.makerdao.com/address/0xb21e535fb349e4ef0520318acfe589e174b0126b",
                        "https://vote.makerdao.com/address/0x845b36e1e4f41a361dd711bda8ea239bf191fe95",
                        "https://vote.makerdao.com/address/0x22d5294a23d49294bf11d9db8beda36e104ad9b3",
                        "https://vote.makerdao.com/address/0x45127ec92b58c3a89e89f63553073adcaf2f1f5f",
                        "https://vote.makerdao.com/address/0x4d3ac33ab1dd7b0f352b8e590fe8b62c4c39ead5",
                        "https://vote.makerdao.com/address/0xcdb792c14391f7115ba77a7cd27f724fc9ea2091",
                        "https://vote.makerdao.com/address/0xf60d7a62c98f65480725255e831de531efe3fe14",
                        "https://forum.makerdao.com/t/recognized-delegate-compensation-breakdown-january-2022/13001",
                        "https://vote.makerdao.com/polling/QmQSVmrh",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://forum.makerdao.com/t/signal-request-raise-threshold-for-emergency-shutdown-module/12208",
                        "https://forum.makerdao.com/t/moving-the-esm-threshold-increase-to-next-week/12895",
                        "https://vote.makerdao.com/polling/QmWReBMh",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2022-01-27/12883",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://github.com/makerdao/dss-direct-deposit#configuration",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#target-available-debt-gap",
                        "https://forum.makerdao.com/t/correction-to-last-weeks-executive/13022",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP27",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP46",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP47",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP27",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP46",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP47",
                        "https://vote.makerdao.com/polling/QmNf5pe9?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-extend-the-delegate-compensation-trial/12686",
                        "https://vote.makerdao.com/polling/QmYj6Wzd?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-offloading-tusd-a/12814",
                        "https://vote.makerdao.com/polling/QmagLVA2?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn/12837",
                        "https://hackmd.io/1jc7XOxvRsSyGt09e0xwiw",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-advance-rapid-payment-for-small-bug-bounties-to-on-chain-poll/13017",
                        "https://forum.makerdao.com/t/mip4c3-sp1-rapid-payment-for-small-bug-bounties-mip64-mip40c3-sp42-amendment/12869",
                        "https://forum.makerdao.com/t/gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756",
                        "https://forum.makerdao.com/t/gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756",
                        "https://forum.makerdao.com/t/signal-request-raise-gemini-dollar-gusd-psm-debt-ceiling-to-60-million-dai/12961",
                        "https://forum.makerdao.com/t/signal-request-makerman-retroactive-delegate-comp/13051",
                        "https://vote.makerdao.com/polling/QmbKaHAv?network=mainnet#poll-detail",
                        "https://twitter.com/odyslam_/status/1489318673206685699?s=20&t=4aMTdMiRYbC3G5vRU4luqQ",
                        "https://twitter.com/odyslam_/status/1489318673206685699?s=20&t=4aMTdMiRYbC3G5vRU4luqQ",
                        "https://twitter.com/odyslam_/status/1489318673206685699?s=20&t=4aMTdMiRYbC3G5vRU4luqQ",
                        "https://twitter.com/odyslam_/status/1489318673206685699?s=20&t=4aMTdMiRYbC3G5vRU4luqQ",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022/13094",
                        "https://pdfhost.io/v/dRDKJgUsO_Monthly_Core_Unit_Updates__January_2022",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://maker.blockanalitica.com/",
                        "https://discord.com/channels/893112320329396265/897479130168324107/938839670639443978",
                        "https://twitter.com/epnsproject/status/1488920159553302530",
                        "https://forum.makerdao.com/t/governance-and-risk-177-thursday-february-03-17-00-utc/12977",
                        "https://www.youtube.com/watch?v=BZesImg9oUw",
                        "https://forum.makerdao.com/t/issue-discussion-call-4-core-unit-and-facilitator-offboarding/12985",
                        "https://us02web.zoom.us/j/82713713029?pwd=MTU3VTJBYVJBTEI3T0JRaHlXbVY1Zz09",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/help-wanted-writers-for-stakeholder-content-program/13122",
                        "https://forum.makerdao.com/t/relay-semanal-01-07-de-febrero-de-2022/13151",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-jan-31-feb-11/13198",
                        "https://forum.makerdao.com/t/weekly-relay-february-8-14-2022/13239"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6230045995671
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/02/2022-02:32:41",
                    "content": "Great job @Artem_Gordon, there are too many things going on at the same time. The weekly realy helps me a lot to keep up to date. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#3",
                    "likes": "1",
                    "time": "09/02/2022-14:40:42",
                    "content": "    Artem_Gordon:  EPNS Push Notifications are Live!  Push notifications for the Governance Portal are Live!  The folks at EPNS have made a video showing how to subscribe to the notification channel—check    How quickly these guys have evolved, I remember using this protocol in beta and they rewarded me for it. Congratulations to them!!! And Great Job Artem  ",
                    "links": [
                        "https://twitter.com/epnsproject/status/1488920159553302530"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.239938446969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/02/2022-14:40:47",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-march-1-7-2022/13731",
            "title": "Weekly Relay: March 1 - 7, 2022 ",
            "index": 13731,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "6",
                    "time": "08/03/2022-00:07:06",
                    "content": " 1540×320 138 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop shop for MakerDAO updates.  The public PDF version is available here.   Current Events  This Week in Governance  Community Deep Dai-ve  Mark your Calendar  Useful Links  Have Feedback?   Current Events  What Core Units does the DAO need next?  The Sustainable Ecosystem Scaling Core Unit Team published a post outlining the redesigned Core Unit Incubation Program. This latest iteration, aimed at improving throughput and effectiveness, begins in Q2. The team has put together a comprehensive list of ideas for new Core Units to be assembled and onboarded:  Transparency Reporting Support Core Unit Software Quality Assurance Core Unit Accounting Support Core Unit Red Team Core Unit MIPs Review Services Core Unit Smart Contracts Auditing Core Unit Management Support Core Unit DAO Resiliency Auditing Core Unit MarComms Core Unit Events Core Unit Community Development Core Unit Makernaut Support Core Unit Developer Relations Core Unit End-User Dai Adoption Core Unit Integrations Support Core Unit Advocacy & Public Policy Core Unit Regulatory Advisory Core Unit Self Insurance Core Unit Legal Network Coordination Core Unit Core Unit Incorporation Support Legal Review Core Unit Special Purpose Core Unit(s)  While the full public announcement about the redesigned Incubation Program is still a couple of weeks away, the post gives a preview of a few of the main themes:    What Core Units does the DAO need next?    The tentative timeline we are targeting has the start of the program in the second half of April, with graduations in November, i.e., in the last governance cycle of 2022. The program will feature three separate tracks: Outreach, Legal Resiliency, and Transparency & Quality Control - three focused curricula for the facilitator candidate to choose from, critical to the development and sustainable scaling of MakerDAO. Contrary to last year’s approach of full coaching teams, this program’s season will focus on training the facilitator candidates. Focusing attention on the facilitator candidates aims to increase the number of Core Units added to the DAO over the year while providing the best onboarding experience that empowers the participants to successfully lead their teams.    The list of potential new CUs and the redesigned Incubation Program are not final and are currently under heavy discussion.  Real World Asset Fast-Tracking In response to ongoing inquiries and feedback by community members and Real World Asset (RWA) originators, GovAlpha submitted a signal poll asking whether MakerDAO should “fast track” the current RWA process. Onboarding RWAs is already a tedious and risky task that requires diligence and patience to execute efficiently and successfully. Since RWAs are also used as collateral, they introduce monetary risk. This risk is carefully analyzed and serviced with the help of several Core Units, who were upset at the idea of even submitting a public poll to support the action to fast-track RWAs. March 3rd’s Governance and Risk Call discussed several issues concerning this signal request:  Lack of communication between Core Units Lack of patience by the community and RWA originators Lack of seriousness to risk mitigation   1720×960 188 KB  The majority of the community voted NO and believe that fast-tracking RWAs is a recipe for disaster.  The several responders include Nadia from Growth, who states, “How can we Fast-Track a process that’s so new for everyone, from a legal and technical perspective?” William from RWF also responds: “This “fast-track” approach is deeply disturbing. At this stage of the evolution of RWAs, enabling full self-dealing by borrowers in a pure DeFi way without any lender side oversight or due diligence with a wide variety of possible collateral and structure type considerations is not about giving Delegates and MKR token holders an option. It’s about architecting a roadmap for catastrophic borrower behavior with many implications for credit risk at the core of the protocol, i.e., DAI and MKR.” Eumenes, also from RWF, believes that “It appears that the Borrowers (originators) want to design a less rigorous Loan review process so that they are more likely get a Loan from Maker, and likely at more favorable terms. This would probably increase the risks in RWA asset portfolio significantly.”  Although this has initiated an impassioned discussion about the subject, it has also publicly clarified that MakerDAO will not be fast-tracking RWAs anytime soon.   This Week in Governance  Maker Improvement Proposals (MIPs) Weekly MIPs Update #77  1279×722 26.3 KB  The first week of March’s Governance Cycle has just started, and the Formal Submission Window will be open for the next two days (up till Wednesday)! RFC and FS Dates for reference and existing proposals can be seen on this proposal tracker (WIP)! Things to Come!  Ratification polls go live on Monday, March 14th, and will run for fourteen days until Monday 28th! The formally submitted proposals will be reviewed on the G&R Call on Thursday, March 10th. So be sure not to miss it!     If you are working on submitting a proposal, this guide might be helpful! Any questions, feel free to reach out to @gala, @sebix or @blimpa!   Pre-MIP Discussions:  Auction-backed DAI IAM for Surplus Buffer [Pre-MIP] Using Gyroscope to cut through Dai’s Gordian knot: its USDC dependency An RWA style solution to replace the PSM 1    Proposal Ideas on the Forum   Executive Vote Core Unit Budget Distributions, Recognized Delegate Compensation, MOMC Parameter Changes This executive proposal passed on March 04, 2022, 22:41 UTC, and was executed on March 06, 2022, 22:42 UTC. The following changes were made to the Maker Protocol:  Core Unit Budget Transfers As per multiple successful budget proposals, a total of 397,184 Dai was transferred to multiple Core Units:     Core Unit Dai Amount Proposal     Collateral Engineering Services 259,184 Proposal   Immunefi Security 138,000 Proposal     Core Unit Budget Streams As per multiple successful budget proposals, a total of 397,184 Dai was streamed to multiple Core Units:     Core Unit Dai Amount Duration Proposal     Collateral Engineering 2,780,562 2022-04-01 until 2023-03-31 Proposal   Risk 2,760,000 2022-03-01 until 2023-02-28 Proposal   Immunefi Security 207,000 2022-03-01 until 2022-12-01 Proposal     Recognized Delegate Compensation - February 2022 As per these successful governance polls (1, 2) and the ongoing trial of delegate compensation, a total of 57,665 DAI was distributed to eight Recognized Delegates as itemized below:     DAI Transferred Delegate     12,000 DAI FlipFlopFlap Delegate LLC   12,000 DAI schuppi   12,000 DAI Feedblack Loops LLC   8,512 DAI MakerMan   6,494 DAI ACREinvest   5,072 DAI monetsupply   927 DAI JustinCase   660 DAI GFX Labs     MOMC Parameter Changes As per this governance poll on the latest MakerDAO Open Market Committee proposal, the following parameter changes were made in the Maker Protocol:     Parameter Vault Change Previous New     Maximum Debt Ceiling WSTETH-A +100M DAI 200M DAI 300M DAI   Maximum Debt Ceiling DIRECT-AAVEV2-DAI +80M DAI 220M DAI 300M DAI   Target Available Debt WSTETH-A +10M DAI 20M DAI 30M DAI   Target Available Debt DIRECT-AAVEV2-DAI +15M DAI 50M DAI 65M DAI   Target Borrow Rate DIRECT-AAVEV2-DAI -0.65% 3.5% 2.85%     Active Governance Polls     Poll Name Discussion     Offboarding Parameters for TUSD-A Discussion   Reinstate Surplus Buffer Lerp Discussion    Check out February 28th’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls There is currently no active community greenlight polls. Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests Real World Asset Fast-Tracking The GovAlpha core unit has posted a signal request aiming to:  Clarify Real World Asset (RWA) issuers’ options for getting onboarded into Maker. Gather feedback on a “fast-track process” idea to ease friction for existing RWA issuers that have worked with Maker in the past.  There are currently two main ways RWA issuers can propose being onboarded:  Work with the Real World Finance Core Unit using the weekly governance cycle. Propose a new MIP.  The GovAlpha team strongly recommends the first option. Regarding a fast-track process for existing issuers, @LongForWisdom points out that exiting issuers have noted a delay between proposing the onboarding of a new RWA and concrete decision-making about that proposal. The goal of the fast-track process is to minimize this delay. Pros and cons include: Pro: This shows that Maker can be flexible and sensitive to issues facing RWA issuers/arrangers that wish to work with MakerDAO. Pro: Could allow MakerDAO to onboard RWA faster, leading to more DAI minted and increased revenues. Con: Requires Maker Governance to decide whether proposed collateral is safe and benefits Maker without evaluation from core units. Con: May expose Maker to additional risk due to imperfect legal frameworks. Con: Undermines the mandate of the Real World Finance Core Unit. Con: Bypasses the monthly governance process. Active discussion is underway. Share your two cents and vote in the poll here. Promote “MIP4c3-SP1: Amend MIP64 to clarify critical web bounty amount” to on-chain poll psychonaut submits a very straightforward signal requesting: At issue: Amend MIP64 to clarify critical web bounty amount 6 Considerations (not Pro or Con):  Increase the payout for Critical severity web bugs from 5k-50k to a single amount of 50k. Reduce negotiation around the Critical severity bounty amount. Increase incentive for whitehat hackers to pursue potential Critical severity web bugs.    Community Deep Dai-ve  Tweet of the Week     twitter.com    Maker @MakerDAO  It's time to introduce you to the decentralized workforce of Maker ━ The Core Units.  Fully run by the DAO, the Core Units are decentralized groups that execute every necessary task within MakerDAO's goals.  This is how a next-generation decentralized workforce works.  👇  1/   3:00 PM - 1 Mar 2022           280                52             Forum Insight Ukraine Vault/Loan/”War Bond” Purchase Proposal  @Allan_Pedersen has submitted an informal poll proposing that Maker lend 1-5M DAI to Ukraine to aid their ongoing war effort. If the community supports the idea, Oasis Pro Markets and Monetalis have pledged to help execute it using real-world collateral.    Ukraine Vault/Loan/\"War Bond\" Purchase Proposal   I cannot, exactly, at this hour, tell you what will be the specific means of execution, but I will strive for getting to a situation where, as real-world collateral, we will have a loan obligation from the Nation of Ukraine (preferably a recognized bond) held by a Monetalis-Maker BVI Trust (or similar) structure and then a vault, set up specifically for this situation, and an immediate DAI minting (and probable exchange to USD) and payment.   At the close of the informal poll, 61% of the 92 forum users who voted supported the idea—81% of the 63 users voted for an amount selected 5M Dai. Also, check out the latest Forum at a Glance post for additional forum insights.   Meetings and Events  Last Week’s Call Recordings  Governance and Risk #180 | Video  Meet Your Delegate #9 ft. Doo Wan Nam & Flipside Crypto | Video    Upcoming Calls  Meet Your Delegate #10 ft. Hasu | Join Link   Forum Link | 2022-03-09T18:00:00Z   Governance & Risk   Join Link | Agenda - Thursdays at 16:00 UTC   Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC    Useful Links Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auctions data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @Artem_Gordon @nothsa ",
                    "links": [
                        "https://forum.makerdao.com/t/what-core-units-does-the-dao-need-next/13594",
                        "https://makerdao-ses.notion.site/Core-Unit-Ideas-Comprehensive-List-2ce21712724f44d58b7e6f77888b0085",
                        "https://makerdao-ses.notion.site/Core-Unit-Ideas-Comprehensive-List-2ce21712724f44d58b7e6f77888b0085",
                        "https://forum.makerdao.com/t/what-core-units-does-the-dao-need-next/13594/1",
                        "https://forum.makerdao.com/t/what-core-units-does-the-dao-need-next/13594",
                        "https://forum.makerdao.com/t/signal-request-real-world-asset-fast-tracking/13563",
                        "https://youtu.be/qjg6cG7h_ak?t=2444",
                        "https://forum.makerdao.com/t/weekly-mips-update-77/13706",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://mips.makerdao.com/mips/md-viewer?mdUrl=https:%2F%2Fraw.githubusercontent.com%2Fmakerdao%2Fmips%2Fmaster%2Fmeta%2Fprimer_for_authors%2Fprimer_for_authors.md",
                        "https://forum.makerdao.com/u/gala",
                        "https://forum.makerdao.com/u/sebix",
                        "https://forum.makerdao.com/u/blimpa",
                        "https://forum.makerdao.com/t/auction-backed-dai/13011/11",
                        "https://forum.makerdao.com/t/premip-iam-for-surplus-buffer/11584",
                        "https://forum.makerdao.com/t/pre-mip-using-gyroscope-to-cut-through-dai-s-gordian-knot-its-usdc-dependency/8865",
                        "https://forum.makerdao.com/t/an-rwa-style-solution-to-replace-the-psm/8705",
                        "https://forum.makerdao.com/c/mips/proposal-ideas/21?order=activity",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-distributions-recognized-delegate-compensation-momc-parameter-changes-march-4-2022?network=mainnet#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP57",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP58",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP57",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP56",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP58",
                        "https://vote.makerdao.com/polling/QmPCbBu3?network=mainnet",
                        "https://vote.makerdao.com/polling/QmbvuhYH?network=mainnet",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://vote.makerdao.com/address/0xb21e535fb349e4ef0520318acfe589e174b0126b",
                        "https://vote.makerdao.com/address/0x845b36e1e4f41a361dd711bda8ea239bf191fe95",
                        "https://vote.makerdao.com/address/0x22d5294a23d49294bf11d9db8beda36e104ad9b3",
                        "https://vote.makerdao.com/address/0x4d3ac33ab1dd7b0f352b8e590fe8b62c4c39ead5",
                        "https://vote.makerdao.com/address/0x45127ec92b58c3a89e89f63553073adcaf2f1f5f",
                        "https://vote.makerdao.com/address/0xcdb792c14391f7115ba77a7cd27f724fc9ea2091",
                        "https://vote.makerdao.com/address/0xf60d7a62c98f65480725255e831de531efe3fe14",
                        "https://vote.makerdao.com/polling/QmPhbQ3B",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2022-02-24/13434",
                        "https://vote.makerdao.com/polling/QmVkRdjg?network=mainnet",
                        "https://forum.makerdao.com/t/proposed-parameters-for-offboarding-tusd-a/13506",
                        "https://vote.makerdao.com/polling/QmeAHmS2?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn-part-ii/13146",
                        "https://forum.makerdao.com/t/weekly-relay-february-22-28-2022/13499",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-real-world-asset-fast-tracking/13563",
                        "https://forum.makerdao.com/t/signal-request-real-world-asset-fast-tracking/13563",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount-to-on-chain-poll/13649",
                        "https://forum.makerdao.com/t/mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount/13439",
                        "https://twitter.com/MakerDAO/status/1498674457929519105",
                        "https://twitter.com/MakerDAO/status/1498674457929519105",
                        "https://twitter.com/MakerDAO/status/1498674457929519105",
                        "https://twitter.com/MakerDAO/status/1498674457929519105",
                        "https://forum.makerdao.com/t/ukraine-vault-loan-war-bond-purchase-proposal/13529",
                        "https://forum.makerdao.com/t/ukraine-vault-loan-war-bond-purchase-proposal/13529/1",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://www.youtube.com/watch?v=qjg6cG7h_ak",
                        "https://www.youtube.com/watch?v=hNMKg9BNWjU",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/86221714672?pwd%3DR3hpWVF1eCt5TEpqa0dRVkRRMnpRQT09&sa=D&source=calendar&ust=1647127056052738&usg=AOvVaw1sK6fehFYe__Y2yzTIADMZ",
                        "https://forum.makerdao.com/t/meet-your-delegate-9-hasu-no-longer-postponed/12944",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-1-7-de-marzo-de-2022/13773",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-28-mar-11/13887",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-marzo/13987",
                        "https://forum.makerdao.com/t/weekly-relay-march-8-14-2022/13906"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.689699261964886
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#2",
                    "likes": "4",
                    "time": "08/03/2022-00:48:26",
                    "content": "    Artem_Gordon:  The list of potential new CUs and the redesigned Incubation Program are not final and are currently under heavy discussion.   Overall I am a big fan or what is being proposed as to the legal resiliency track. I am really excited about the Legal Network Coordination Core Unit - LNW-001 and Self Insurance Core Unit - SIN-001. I am looking to help build those two up, assuming they become actual Core Units of course. The Legal Network Coordination could, amongst other things, make sure all outside counsel is vetted appropriately and that cost efficiency is routinely being considered as a matter of course. There is a demand for this now and should be presently utilized in some fashion when considering the retention of outside counsel (imo). This space is continuously changing and we need to be as ready as we possibly can to adapt and pivot at a moments notice. I often say that it is much better to be proactive, as opposed to reactive. @SES-Core-Unit and others have put in a whole lot of time here and it is evident. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.638339920948616
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#3",
                    "likes": "2",
                    "time": "09/03/2022-19:18:17",
                    "content": "Excellent work Artem. @MFeinberg you are right, I hope you can contribute if it is your area. You have to be prepared for everything that comes, the world as it is now there is a lot of uncertainty. Undoubtedly, building an armed legal arm is very good. I love these proposals Community Development Core Unit End-User Dai Adoption Core Unit Since I have been in crypto, I have always loved the part of creating a community, educating and, above all, developing a connection with the user who sees beyond what crypto is all about. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.568367346938776
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "2",
                    "time": "09/03/2022-23:05:37",
                    "content": "Thank you. I am looking forward to helping out wherever I can. I see much on the horizon and there is always stuff that is unexpected. But, communicating and bouncing ideas off of each other is a great way to stay prepared. There is power in community. As to the legal coordination we can establish billing guidelines for outside counsel similar (but also very different) to what insurance carriers have for their panel counsel. This way we can try and track costs and limit unnecessary (and possibly inappropriate) attorney fees. This is also beneficial as to a captive insurance policy, or somewhere where Maker might be subject to a deductible, or Self Insured Retention (SIR), as the billing guidelines will hopefully limit costs.  If the bills do not comply with the guidelines they are disputed and possibly not paid. By the way, this is not legal advice of course, just spitballing ideas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.252976190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#5",
                    "likes": "1",
                    "time": "10/03/2022-15:50:59",
                    "content": "I am a legal ignoramus, but your ideas are really interesting. No doubt as you say we must communicate all ideas, and it is good that this forum exists. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "24/03/2022-15:51:27",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "654"
}