{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/can-we-justify-the-existential-risk-posed-by-psm-usdc/16180",
            "title": "Can we justify the existential risk posed by PSM-USDC? ",
            "index": 16180,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "usdc",
                "risk",
                "discussion",
                "regulation",
                "psm"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#1",
                    "likes": "16",
                    "time": "29/06/2022-12:27:28",
                    "content": "I’ve been concerned about the amount of DAI generated from USDC since long before becoming a delegate. Now that we’ve reached an ATH of 80% of DAI (and rising) being backed by centralized stable assets, we simply won’t be doing our jobs unless we directly confront the reality of the risks. Circle has the power to blacklist/freeze the USDC in the PSM without notice. This would indefinitely freeze the collateral backing 80% of DAI in existence, causing an existential crisis for the entire DAO. This is an untenable risk. We simply cannot leave the fate of the DAO in the hands of Circle or any other 3rd party. We must do everything that we can to avert existential threats like this. In DeFi and crypto in general, if it can happen we must assume that it will happen. We have no idea what the future will bring, or how regulators will view the stablecoin scene in the near future. If we keep our heads buried in the sand on this and only focus on what is likely then we will simply not be doing our jobs. We need to focus on what is possible and then determine our risk tolerance based on that. This cannot wait. If we do not think adversarially now, then we are simply not doing everything we can to protect MakerDAO. I would like to use this thread to kick-start the following, in this order:   Request that CUs use this as a safe space to offer some realistic modeling & scenarios (PE, legal, any other relevant takes) regarding exactly what would happen if all USDC in the PSM got blacklisted/frozen. Let’s get real. Don’t sugar coat it. Think adversarially. Tell us exactly how this would go, where the unknowns lie, and what state DAI could find itself in as a result.   Ask staunch PSM supporters to justify the risk that the scenarios presented in Step 1 become reality. “That is so unlikely to happen” is not allowed here. This could happen so we need to justify the decision to even allow it to exist as a possibility. If the bear market shaves even more value off ETH, we could even see 85-90% DAI via PSM. Explain to us why you believe that placing the fate of the DAO in the hands of a highly-regulated 3rd party is worth the incredible risk, and why reducing or eliminating the PSM is an existentially bad idea despite the outlined potential scenarios.   As a DAO, decide whether or not the reasons to keep the PSM in its current state (or at all) are worth the risks & justifications that have been established. Discuss alternatives & trade-offs. Then, finally, allow MKR holders themselves to determine whether the peg stability that has been achieved is worth the identified existential risk presented by USDC’s centralization.   If the DAO is going to continue to exist at the will of Circle/USDC, then we need to justify it. If we can’t justify it, then we need to change it.  I’m hopeful that this exercise will ultimately lead to a drastic reduction or even eventual elimination of the PSM, and I also hope that by doing this thoughtfully, we can recognize which trade-offs are ultimately worth it and which are not. I welcome any & all input on the process I’ve suggested. ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-9-traduccion/16383",
                        "https://forum.makerdao.com/t/governance-and-risk-197-thursday-june-30-at-21-00-utc/16216/2",
                        "https://forum.makerdao.com/t/mip-6-declaration-of-intent-invest-in-short-term-bonds-proposal-for-implementation/16185/52",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-9/16355",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3",
                        "https://forum.makerdao.com/t/podemos-justificar-el-riesgo-existencial-que-supone-el-psm-usdc-traduccion/16340"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.459349593495935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/06/2022-13:11:34",
                    "content": "The best thing to do for the time being would be to create psm entry and exit fees, which would make DAI more expensive in the market, incentivizing vault creators with other assets to issue DAI and sell it on the open market. It would also give DAI more value and generate revenue to the protocol, which could go to buy a decentralized asset exchange, like Ethereum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.145833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#3",
                    "likes": "2",
                    "time": "29/06/2022-14:48:02",
                    "content": "The solution to the large PSMs is to increase diverse loan demand to match DAI demand.  This is everything that is being worked on.  We are close to having treasuries and a portion of the PSMs will be diversified there very soon.  Just have to be a little patient.  USDC is the most liquid on chain asset that allows MKR to have excess demand for DAI without affecting the dollar peg.  It’s just a representation of demand that can in the future be managed once there are enough avenues to find nonstablecoin collateral for the DAI (such as treasuries).  Again, this is what is worked on every day.  There will always be counterparty risk.  The key is to diversify and manage this risk. But on the topic of circle freezing assets, we do need to recognize that circle would take a huge reputational hit if it were to do this.  If we can trust that circle is fully backed and can repay the usdc is out there, we should be ok.  Of course it’s always a big if to trust anyone, but usdc is at least the most trusted centralized stablecoin and it’s failure to repay its obligation would likely signify a huge market event for all of crypto.  This would certainly affect MKR whether or not MKR was exposed to USDC.  All of crypto is exposed to USDC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.624824929971989
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#4",
                    "likes": "4",
                    "time": "29/06/2022-15:02:07",
                    "content": "    Traster_Tray:  Just have to be a little patient.   Circle can shut DAI down today if it wants to or is otherwise compelled to. We cannot afford to be patient. This risk is untenable, and there is no guarantee that we will be able to alleviate it any time soon.     Traster_Tray:  we do need to recognize that circle would take a huge reputational hit if it were to do this.   Again - this thread isn’t about what is likely. It’s about what is possible. “Reputational hit” won’t matter if Circle is being compelled to act by a regulator.     Traster_Tray:  If we can trust that circle is fully backed and can repay the usdc   MakerDAO wasn’t built to trust 3rd parties. It was built to eliminate the need for those 3rd parties. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.420524691358025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/06/2022-15:13:48",
                    "content": "Justification is that most Dai would disappear without it, and without a critical mass of Dai people won’t use it for LP pairs, which would lower demand for Dai even further and create a death spiral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#6",
                    "likes": "3",
                    "time": "29/06/2022-15:18:11",
                    "content": "no solid collateral backing DAI => NO DAI ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#7",
                    "likes": "1",
                    "time": "29/06/2022-15:29:57",
                    "content": "The argument I’ve heard a few times is that most of the USDC in the PSM should eventually be used to buy US Treasury bonds and hold them through the legal structures proposed by the RWF CU. The remaining amount in the PSM is capped by a sufficiently low DC so that while the risk remains, it isn’t quite as existential as it is now. Does such a blacklist risk exist with the US Treasury bonds too? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#8",
                    "likes": "1",
                    "time": "29/06/2022-15:30:16",
                    "content": "So what would you suggest?  Where do you want to put the usdc?  If you want to simulate what would happen without a PSM, turn it off, start selling it and buy the DAI back…you would just raise DAI’s price above the peg and be giving money to the arbitragers/incentivizing holders to sell their DAI until DAI supply reaches an equilibrium point with the collateral we do have.  That doesn’t seem like the greatest result.  Am I wrong in my analysis? The usdc represents excess demand.  Without an avenue for it to go, excess demand means the price goes above 1.00 which then leads to less demand as you start pressuring holders to sell plus a taking reputational hit to stability. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#9",
                    "likes": "0",
                    "time": "29/06/2022-15:35:24",
                    "content": "    AstronautThis:  Does such a blacklist risk exist with the US Treasury bonds too?   Sure. Real-world assets can be confiscated, frozen, stolen, etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#10",
                    "likes": "0",
                    "time": "29/06/2022-15:47:43",
                    "content": "    ChrisBlec:  Sure. Real-world assets can be confiscated, frozen, stolen, etc.   I’m not sure about the exact legal structure of those RWF agreements but I suspect it’s not the same type of blacklisting risk as we currently have with Circle. In any case, the long-term solution until native crypto demand picks up remains to diversify the PSM into various RWF structures so that if any individual one fails, it doesn’t strike an existential blow to Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.111111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tobalgarcia",
                    "index": "#11",
                    "likes": "12",
                    "time": "29/06/2022-15:59:23",
                    "content": "Hey Chris, thanks for putting this together. I just want to point out some corrections on the numbers mentioned in the problem description.     ChrisBlec:  Now that we’ve reached an ATH of 80% of DAI (and rising) being backed by centralized stable assets   Dai generated from collateral is not the same as Dai collateralization. All Dai in circulation are backed by all collateral in the system “at the same time,” no matter which collateral each Dai was minted from, because, for example,  1 Dai minted from PSM-USDC is fully fungible with 1 Dai minted from ETH-A. A great way to understand the difference between these two metrics is: Dai minted from collateral measures the demand of each type of Dai collateralization (source of minted Dai), and Dai collateralization measures the composition of all assets backing all Dai. Edit:  Not 100% accurate, my bad, corrected here  image - 2022-06-29T110619.6151378×435 83.4 KB  According to daistats.com, PSM-USDC represents 36.9% of all collateral value in the system. If we add PSM-USDP and USDC-A, the number will go to 44.9%.     ChrisBlec:  Circle has the power to blacklist/freeze the USDC in the PSM without notice. This would indefinitely freeze the collateral backing 80% of DAI in existence   If all USDC in the system suddenly goes to zero or is blacklisted, to calculate the amount of potential unbacked Dai we can say that:   Math   There’s 6.7 billion Dai in circulation.   There’s 3.2 billion USDC in PSM-USDC + 227 million in USDC-A = ~3.4 billion USDC   There’s $8.7 billion worth of collateral in the system.   If $3.4 billion worth of collateral (3.4 billion USDC) is removed, the system will lose $3.4 billion of collateral: $8.7 billion - $3.4 billion = $5.3 billion   The result is $5.3 billion backing 6.7 billion Dai (collateralization ratio of ~79%)   Well, this is just simple math, I’m not taking into account other potential risks of deleting the PSM reserves, which would be bad for Dai peg’s strenght.   Not accurate, my bad, corrected here And that’s an important part of why the PSM reserves and their quality are important for Dai to be resilient. The PSM is a permissionless liquidity tool for Dai. During stress situations, just as the last one the crypto market had in May, the $1 Dai peg would be as strong as the ability to redeem 1 Dai for $1. If we do not give this the importance it requires, Dai holders could lose their savings before we find the solution to PSM-USDC PSM-USDC is a good, high-quality collateral that supports the success of Dai. We have other solutions to build this permissionless liquidity, like G-UNI vaults, but PSM is the most successful liquidity tool Maker has ever had. In my opinion, all PSM-USDC being blacklisted is a very unlikely situation and that is an important fact to keep in mind when considering risks. And, well, I am not a financial/risks expert in the mechanism of Maker and Dai, I just wanted to point out my vision with the information that I have. I’m sure Strategic Finance, Real World Finance or Risk team could add more PSM factors with greater importance for the success of Dai and Maker systems. ",
                    "links": [
                        "http://daistats.com",
                        "https://forum.makerdao.com/t/can-we-justify-the-existential-risk-posed-by-psm-usdc/16180/13"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.731770833333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#12",
                    "likes": "13",
                    "time": "29/06/2022-16:22:42",
                    "content": "don’t forget that bitcoin and eth can be nuked to 0 at will if all the CEXes and fiat onramps are shut down. Lets not kid ourselves here that they aren’t also 99% reliant on the fiat system for their value. And this isn’t what we want to see, it’s the exact thing we want to change. But we need to be realistic about it and do something that matters, rather than succumb to heroic failure ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.644444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#13",
                    "likes": "7",
                    "time": "29/06/2022-16:43:48",
                    "content": " If all USDC in the system suddenly goes to zero or is blacklisted, to calculate the amount of potential unbacked Dai we can say that:  There’s 6.7 billion Dai in circulation. There’s 3.2 billion USDC in PSM-USDC + 227 million in USDC-A = ~3.4 billion USDC There’s $8.7 billion worth of collateral in the system. If $3.4 billion worth of collateral (3.4 billion USDC) is removed, the system will lose $3.4 billion of collateral: $8.7 billion - $3.4 billion = $5.3 billion The result is $5.3 billion backing 6.7 billion Dai (collateralization ratio of ~79%)   It doesn’t work this way. If a user deposits $100B of BTC and draws 1 DAI from it, we can’t use his $99.999999999B of BTC to collateralize other vaults that have failed. Realistically, if 80% of DAI loses its backing, every vault owner will pay pay back their loans (buying super cheap DAI off of the market if needed) and withdraw their collateral. Then, 0% of DAI will be backed & the whole project fails. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.045138888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#14",
                    "likes": "1",
                    "time": "29/06/2022-16:55:56",
                    "content": "    lyt:  Realistically, if 80% of DAI loses its backing, every vault owner will pay pay back their loans (buying super cheap DAI off of the market if needed) and withdraw their collateral. Then, 0% of DAI will be backed & the whole project fails.   This is the kind of stuff I’d like modeled out. If everyone immediately buys super-cheap DAI and burns it to get their collateral back, and simultaneously zero new DAI is created because who would do that, doesn’t that mean that DAI market liquidity would get totally crushed and the price of DAI would quickly moon? Again, it would be great to get someone smarter than me to math this up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611742424242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#15",
                    "likes": "2",
                    "time": "29/06/2022-17:05:23",
                    "content": "    Traster_Tray:  If we can trust that circle is fully backed and can repay the usdc is out there, we should be ok. Of course it’s always a big if to trust anyone, but usdc is at least the most trusted centralized stablecoin and it’s failure to repay its obligation would likely signify a huge market event for all of crypto.   it’s not about whether Centre (the actual issuer of USDC) is solvent. it looks like they are. they just have no obligation to not freeze any USDC balance or to redeem any frozen balance. they can be compelled by authorities to freeze USDC on any address. if at some point legacy powers decide that Maker is in their way, which is not an unreasonable scenario given Maker’s ambitions, then all the USDC collateral can be made worthless with a single call (per vault type) of the 2nd function here by this externally owned account. the DAO may later pursue legal action to reclaim the collateral (presuming there will still be a sufficiently functioning DAO after such an event), but if they are legally blocked from it, it’s gone. naturally, there will always be this kind of risk with collateral that is external to the chain, but having such a high exposure to a single custodian that is heavily US-linked is taking a big risk. ",
                    "links": [
                        "https://www.centre.io/usdc-transparency?hsLang=en",
                        "https://www.centre.io/hubfs/PDF/Centre_AccessDenial_Policy_2021.pdf?hsLang=en",
                        "https://etherscan.io/address/0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48#writeProxyContract",
                        "https://etherscan.io/address/0x5db0115f3b72d19cea34dd697cf412ff86dc7e1b"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.200095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#16",
                    "likes": "0",
                    "time": "29/06/2022-18:28:09",
                    "content": "80% of the DAI supply would still remain and the entire market would know it is backed by nothing. In this hypothetical, DAI would go to ~0 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#17",
                    "likes": "1",
                    "time": "29/06/2022-19:12:25",
                    "content": "Right no disagreement it’s a problem that needs to be resolved.  But it’s one that the community has been aware of for awhile now and the only real solution I see is to diversify and grow collateral…which takes time.  We will still be exposed to the us government with treasuries.  We are still exposed to fed actions.  We need more collateral but we can’t be reckless because everything comes with risks.  So yes it’s an issue.  But it takes time to solve right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.267857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#18",
                    "likes": "4",
                    "time": "29/06/2022-19:56:16",
                    "content": "I think we need to differentiate between a couple types of censorship risk:  Circle (and/or other issuers) freeze all centralized stablecoins in the PSM(s) Circle (and/or other issuers) shift to a whitelist model for permitting transfers - basically freeze all centralized stablecoins throughout defi Circle (and/or other issuers) dishonor centralized stablecoin liabilities entirely  I believe all of these potential risk factors are fairly remote, and we would be highly likely to have weeks/months of advanced notice before assets are suddenly censored. But still worth considering the potential impacts. (1) would cause significant liquidity issues for DAI - users could no longer immediately redeem DAI for USDC/centralized stablecoins at 1:1 parity. But other exchange venues like Curve and Uniswap would still support DAI liquidity. And the backing of issued DAI is fundamentally still intact, just illiquid - we could assume that users would count locked up USDC at some discounted value based on expected time to resolve the legal issues and risk of (3) eventually happening. (2) would be more disruptive. First, pooled liquidity markets like Compound and Aave would basically get nuked into oblivion as liquidations of USDC/centralized stablecoin debt or collateral would no longer be possible. The majority of DAI liquidity (in PSMs and stablecoin swap pairs) would also become inaccessible, which would cause significant instability. However, DAI collateralization would still be fundamentally intact. Funds held in stablecoin LP vaults would also still be transferable, so Maker could potentially raise interest rates on or liquidate these positions if DAI began to trade below peg to help contract supply. I think this sort of govt action happening on short notice would be completely untenable from a public policy perspective - willfully causing significant collateral damage on US retail investors for no fault of their own. (3) would be a full on rug. To get here we’d have to assume that the rule of law has completely collapsed in the US, and then ammunition and canned food would be the only currency with any real value. For the near future I don’t think it makes much sense to try to optimize protocol design for this risk because potential solutions would kill DAI utility without significantly increasing likelihood of survival. As far as solutions:  Creating trustless wrappers around centralized stablecoin balances held in PSMs could reduce liquidity risks arising under cases including (1) and (2) Finishing development of VOX (target price adjustment module, similar to RAI) would be helpful as a backup plan in case Maker needs to rapidly offboard centralized stablecoins, although recent history of RAI shows this is does not work very well (rates are currently -25% APR and market price remains far above target price) Win the public policy debate around censorship resistance; I think all parts of the political spectrum are gaining increasing appreciation of censorship resistance (eg. the response to Canada trucker protest really concerned me even tho I don’t really align politically with the protesters) and imo our best bet is gain broad public support where targeting DAI in furtherance of government financial control is untenable  So in summary: Yes I believe the risks posed by PSMs and other centralized asset exposures are justified ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.66087962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#19",
                    "likes": "0",
                    "time": "29/06/2022-19:56:45",
                    "content": "While the risk of freezing is non-zero, do want to point out that various hackers including some high profile ones used Dai before. In fact, Tornado cash supports Dai as well. So realistically, it would be have be much more serious hack / crime to even consider such. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.326666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#20",
                    "likes": "2",
                    "time": "29/06/2022-20:01:21",
                    "content": "@ChrisBlec: Thank you for bringing up this important issue and taking a first principles approach. As a major user of DAI and involved in DAOs with major DAI exposure the continued focus at Maker on: -Downplaying the risks of taking on real-world assets -Downplaying the risks of having large amounts of USDC backing DAI I’ve been interested in/focused on DAI since reading the Maker DAO white paper. What appealed to me was the fact that Maker was trying to build an asset that would be crypto native and provide a medium of exchange that was largely uncensorable and an alternative asset for crypto natives. What Maker has instead turned into is pretty much an organization that is increasingly centralized and struggling to demonstrate its value proposition versus USDC, which is subject to regulatory capture and has severe centralization concerns. Every time people mention the issues associated with USDC and the blacklist risk, we hear “well they’d never do that, it would kill their business, etc., etc.” I second your call for an in-depth analysis and discussion about the risks associated with having nearly 50% of DAI backed by USDC, and the impact to the protocol if this were to be blacklisted due to regulators’ discomfort with DAI’s permissionless nature. As a reminder, I called out these risks three years ago in this post. I made the following points:   The Maker system becomes less resilient against attack: Currently, despite the fact that there is no Foundation, every step Maker takes to become tied to real-world assets, not reduce reliance on USDC, it’s easier to attack.   KYC requirements are hugely unpopular in some crypto circles:: A major selling point for DAI is permissionless nature. I don’t see that surviving with the current Maker path.   The final thing I’ll say is this (quoting from my original article): The whole Open Finance ecosystem falls apart if Dai can be seized/blocked from an application because central actors say that the currency is compromised, or they don’t like that CDPs were opened without KYC requirements, etc. I’d love to hear from Maker about what it thinks about this threat, and how it plans to mitigate these risks, and even if it thinks they are not credible (and why). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.533840388007054
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#21",
                    "likes": "0",
                    "time": "29/06/2022-20:12:55",
                    "content": "Thanks for your thoughtful response.     monet-supply:  (1) would cause significant liquidity issues for DAI - users could no longer immediately redeem DAI for USDC/centralized stablecoins at 1:1 parity. But other exchange venues like Curve and Uniswap would still support DAI liquidity. And the backing of issued DAI is fundamentally still intact, just illiquid - we could assume that users would count locked up USDC at some discounted value based on expected time to resolve the legal issues and risk of (3) eventually happening.   This really does sound like a best-case scenario, where the market acts rationally and doesn’t panic at all. The odds of that seem very, very slim. If a blacklist/freeze were to happen, it would likely be by order of a regulator, and it would likely be in the news almost immediately. In that case, there’s a solid chance that the USDC will never return and DAI holders would immediately capitulate. I’d like to get more info on how typical irrational markets would play out in this type of situation. Again, I appreciate the response but I don’t see how MakerDAO can justify this existential risk to MKR holders when it doesn’t have to exist. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.464444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#22",
                    "likes": "4",
                    "time": "29/06/2022-20:24:52",
                    "content": "    ChrisBlec:  I don’t see how MakerDAO can justify this existential risk to MKR holders when it doesn’t have to exist.   Curious to hear what you consider a viable alternative. From my perspective there isn’t one. Liquity model only works with constant emissions (and a favorable narrative environment where people are willing to buy LQTY token even while the long term value prospect is highly suspect). And even with healthy emissions to support stability pool deposits, significant supply demand imbalance (eg if everyone was fleeing centralized stablecoins to LUSD) would push LUSD price up to $1.10 which would begin to cause losses to stability pool depositors when liquidations happen and system would still become unstable and likely collapse. RAI sorta kinda works with negative interest rates, and Maker could adopt a similar mechanism (VOX module). But RAI is currently devaluing at a rate of 20%+ per year (on top of USD inflation), and is still trading far above target price. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.478333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#23",
                    "likes": "0",
                    "time": "29/06/2022-20:33:45",
                    "content": "PSM supports the DAI/USD peg, without this liquidity and high volume trading, DAI’s peg would be inefficient and would not really be a “stablecoin”. PSM was implemented as a “temporary” solution until another currency pair with less risks is launched, maybe CBDC will be that solution, but it is definitely a necessary product for DAI’s peg and adoption. There are other pairs in the PSM, PAX and GUSD, we should find ways to have higher DAI demand with these and others to reduce concentration risk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0152777777777775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#24",
                    "likes": "0",
                    "time": "29/06/2022-20:36:00",
                    "content": "I’ve seen CBDCs mentioned as a potential collateral asset for Maker. It’s not clear to me why that would be better than USDC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#25",
                    "likes": "2",
                    "time": "29/06/2022-20:36:51",
                    "content": "    TRUEMAKER:  PSM supports the DAI/USD peg, without this liquidity and high volume trading, DAI’s peg would be inefficient and would not really be a “stablecoin”.   DAI worked before the PSM existed. The PSM is an extreme solution. There are likely many in-between solutions that don’t involve as much consolidated existential risk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.529166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#26",
                    "likes": "0",
                    "time": "29/06/2022-20:37:32",
                    "content": "    davoice321:  I’ve seen CBDCs mentioned as a potential collateral asset for Maker. It’s not clear to me why that would be better than USDC.   It would be better for the government. Certainly not better for Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#27",
                    "likes": "1",
                    "time": "29/06/2022-20:39:29",
                    "content": "CBDC is digital USD backed by the US government. This in my opinion would be the most natural DAI collateral, without financial intermediaries it would reduce a lot of the risks discussed in this post. Also it would support asset diversification. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#28",
                    "likes": "2",
                    "time": "29/06/2022-20:43:22",
                    "content": "    TRUEMAKER:  CBDC is digital USD backed by the US government. This in my opinion would be the most natural DAI collateral, without financial intermediaries it would reduce a lot of the risks discussed in this post. Also it would support asset diversification.   Do you understand that the government could freeze it or take it away with one push of a button? That doesn’t concern you at all? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#29",
                    "likes": "3",
                    "time": "29/06/2022-20:44:47",
                    "content": "I’m not sure if the major point of this conversation is clear. Centralized/censorable assets: are they good for Maker, for DAI to hold as collateral? Is Maker interested in keeping DAI uncensorable (as per the original mandate)? And does it put the a main value proposition of DAI at risk? I’d argue that considering CDBCs as “good collateral” in any context demonstrates a  serious lack of both judgement and understanding. CDBCs are the ultimate form of financial control and adding it as collateral for DAI defeats the purpose of DAI (as many understand it). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.946180555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#30",
                    "likes": "2",
                    "time": "29/06/2022-20:46:06",
                    "content": "Right and among other things PSM was implemented due to DAI depegging in multiple occasions. If anything the PSM proved its strength during this downturn, DAI maintained its peg successfully even with record breaking liquidations. MKR’s first mandate is for DAI to maintain its peg so that it could fulfill its product promise of being a stablecoin, I understand the concentration risk posed by the USDC PSM but the risks associated with the PSM are far smaller than DAI depeging risks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.709821428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#31",
                    "likes": "0",
                    "time": "29/06/2022-20:48:59",
                    "content": "Which collateral would you consider good collateral, meaning that it would maintain DAI’s USD peg and remain uncensorable? Would love to hear about this asset class. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#32",
                    "likes": "2",
                    "time": "29/06/2022-20:51:33",
                    "content": "I was there during the de-pegging crisis and the subsequent conversations. The USDC implementation was supposed to be temporary. Instead Maker has made it permanent and is doubling down on USDC and other real-world assets for various reasons. My impression of Maker at present is that it’s pretty much catering to TradFi and views DeFi and crypto culture as naive and simplistic. (This is based not only on my reading of the forum, but statements members of the DAO made on podcasts such as Bankless). If Maker believes that burdening a supposedly non-censorable asset with extreme centralization and censorship risks (USDC, TBills, Short-Term Bonds and ugh, CBDCs), then I wonder whether DAI should exist versus, say a USDC or USDT. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.685185185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#33",
                    "likes": "2",
                    "time": "29/06/2022-20:53:37",
                    "content": "you know, i’m not sure. But perhaps it’s time for Maker to start thinking of potential alternatives/solutions to this issue. Because if DAI can’t maintain its peg, as a crypto-native asset without reliance on centralized collateral, then I’m not sure it deserves to exist. maybe scale at all costs isn’t the right path for DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.732142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#34",
                    "likes": "2",
                    "time": "29/06/2022-20:57:56",
                    "content": "    davoice321:  maybe scale at all costs isn’t the right path for DAI.   This is my take. Slow, responsible growth. Grow too fast? Inverse growth for a bit until you are able to scale it back to where it needs to be. Censorship-resistance and incorruptibility at all costs. We can achieve this vision. And don’t let them get you down with “well what’s your big alternative??”  That’s a cop-out question and they’re well aware of that. We can’t come up with solutions in a vacuum. We need to all work together on them. But we’ll never be able to do that if we can’t all acknowledge the problem and find consensus on a common goal of decentralization maximalization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.488260582010582
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#35",
                    "likes": "0",
                    "time": "29/06/2022-21:00:18",
                    "content": "Totally agree with this statement, but also think its a combination of crypto as an industry developing those asset classes.     davoice321:  But perhaps it’s time for Maker to start thinking of potential alternatives/solutions to this issue.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#36",
                    "likes": "0",
                    "time": "29/06/2022-21:09:57",
                    "content": "What crypto native assets are stable? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#37",
                    "likes": "0",
                    "time": "29/06/2022-21:12:13",
                    "content": "is this a rhetorical question? DAI was supposed to be a stable crypto native asset. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#38",
                    "likes": "0",
                    "time": "29/06/2022-21:22:28",
                    "content": "No its a serious question. Can a serious stable be created using only crypto collateral, as folks are basically asking ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.888888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#39",
                    "likes": "1",
                    "time": "29/06/2022-21:31:15",
                    "content": "Right now.The answer to this question is still unknown. Up until the introduction of multi-collateral DAI and the acceleration of USDC backing, Maker was seeking to build one. Maybe there’s till time for Maker to return to its roots … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4642857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#40",
                    "likes": "4",
                    "time": "29/06/2022-21:33:05",
                    "content": "USDC backing happened because we failed to build a good peg using just crypto collat. DAI depegged up & we needed to react. What changed since then? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#41",
                    "likes": "24",
                    "time": "29/06/2022-21:33:22",
                    "content": "First a caveat: I’ve only skimmed this thread, apologies if I’m repeating others. Second a clear explanation of my view of an ‘ideal’ state in terms of the PSM:  PSM USDC/others makes up 5-10% of total DAI supply. A tested and 24-hour viable method to wind down PSMs in an emergency.  Third, why we need the PSM, and a depressing comment on this:     ChrisBlec:  DAI worked before the PSM existed.   TL;DR, no it didn’t. I’m defining working as:  Providing a stablecoin that stays within 0.5% of its peg, and frankly this is generous, as many have said that this is far too volatile for institutional use of a stablecoin.  Realistically, most users do not care about decentralization primarily when evaluating stablecoins. Order of wants for stablecoins is essentially:  Extremely tight peg stability Trust in long-term safety of the underlying systems and backing. Decentralization  Bluntly, DAI does not work without the PSM because the incentive for stabilization is (in the absence of a PSM) expressed in the price of the DAI token. In order for the incentive to be meaningful, DAI is already not working by the above definition. To those that might dispute the above, we have empirical evidence that the incentive isn’t strong enough within 0.5% from the market price of DAI after Black Thursday.  We had rates at 0%. DAI was trading above peg, I forget the magnitude and I don’t want to go look it up, but at times it was significant, on the order of 1-2 cents semi-regularly.  Again, put bluntly, the incentive provided by deviation in the DAI price is not sufficient to overcome the risk of leverage on volatile collateral in a bear market, or the cost of hedging that volatility. Thus, PSM. Which is an excellent and useful innovation to ensure short-term stability for DAI. The problem develops from the following: Fundamentally, there is not enough demand for credit using decentralized collateral (specifically ETH) to support the DAI supply beyond a certain point. I will grant that theoretically we could take a larger market share from Aave and Compound, but there is still a hard limit to scaling from this approach that is a combination of:  Demand for credit using decentralized collateral from owners of decentralized collateral. The price of decentralized collateral.  This results in what would ideally be a short-term only mechanism in the PSM becoming a long-term mechanism, as we’ve seen for the past few years. However, the above isn’t news to anyone. It has been the driver of all major supply-scaling initiatives within Maker for maybe 2 years, the major two being:  Collateral Onboarding Real World Assets  The idea behind #1 was that other decentralized assets could and would develop which may reach a substantial fraction of ETH’s market-cap, and therefore support lots of demand for credit. In practice this hasn’t happened (and may never happen.) The idea behind #2 was that we know there is sufficient demand for credit in the legacy financial system for existing assets. If we can solve the complicated problem of using said assets as collateral safely, then we can scale DAI. So, with that extremely abbreviated history of why we’re in the place we’re in. We come to the possibility of alternatives. Again, simply put, there are no good alternatives. The closest we could come are probably:  Buying a significant amount of other decentralized fully-collaterallized stablecoins (like all of them.) Specifically LUSD and FEI. This has downsides. Having the protocol take a massive bet on ETH (similar to FEI) and directly mint DAI to purchase ETH and pray that number go up. This also has downsides.  With 100% seriousness, if you can convince me that an alternative exists that can realistically provide credibly decentralized backing for say 500M DAI with less existential risk (as evaluated by a risk expert) than USDC in the PSM, I would love to hear it, and I will help you campaign/persuade others to implement it. Then we just need 7 equally good and safe ideas for decentralized backing to reduce the PSM size to survivable numbers. Absent that the choice is between:  Real World Assets Lots of PSM DAI Making DAI even less competitive when compared to centralized stablecoins.   This was long. Apologies. My views, not GovAlpha’s, etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.512447296626984
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#42",
                    "likes": "0",
                    "time": "29/06/2022-22:46:07",
                    "content": "It wouldn’t moon because as supply drops from collateral being paid off, the value of your total collateral position is dropping too.  If you’re under collateralized, you stay undercollateralized and your value will not get back to 1.00 until you somehow find enough assets to pay off all the supply that’s out there.  And as soon as DAI holders get wind of undercollateralization, they would rush to the exits so they’re not left with nothing.  We saw how quickly this happened with UST.  So yea, circle could destroy DAI if for some reason it wanted to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.111111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#43",
                    "likes": "2",
                    "time": "29/06/2022-22:47:46",
                    "content": "    TRUEMAKER:  CBDC is digital USD backed by the US government.   USDC=CBDC=FedCoin Just sayin’ Carry on… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#44",
                    "likes": "1",
                    "time": "29/06/2022-23:28:44",
                    "content": "Oh snap! Pinky swear I didn’t see this before posting my comment https://twitter.com/CoinbaseExch/status/1542270332299579396?s=20&t=dVKPRT5NNx8h3nReQimDYA ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#45",
                    "likes": "1",
                    "time": "29/06/2022-23:30:25",
                    "content": "Hah! I was just looking at that tweet and wondering what is really going on there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#46",
                    "likes": "0",
                    "time": "30/06/2022-01:16:22",
                    "content": "They are not the same, CBDC would have different distribution models which are more favorable due to the disintermediation of multiple layers. USDC has more intermediaries and therefore additional risks like counterparty, default and credit risk  CBDC would be a central bank’s liability, so that eliminates default and credit risk. Additionally, counterparty risk is reduced as exposure to Centre (Circle) and Bank A is eliminated.  Back to the original question Can we justify the existential risk posed by PSM-USDC? If the primary mandate is DAI’s peg then yes, unfortunately the PSM is an essential mechanism for this system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.479166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#47",
                    "likes": "0",
                    "time": "30/06/2022-02:31:19",
                    "content": "    Eumenes:  What crypto native assets are stable?   both Liquity’s LUSD and Reflexer’s rai have solely ETH as collateral and are stable. rai used an arbitrary starting unit, not $1, and has a floating peg, but its movements relative to USD are muted (the very aim of the design).     TRUEMAKER:  CBDC would be a central bank’s liability, so that eliminates default and credit risk. Additionally, counterparty risk is reduced as exposure to Centre (Circle) and Bank A is eliminated.   at the same time, it greatly increases risks of regulation and authoritarian abuse. CBDCs (as the name implies) are engineered to give more insight and control to central banks over how the currency is used. hear it from leader of the BIS. USDC has greater default risk, but at least freezing an address requires more steps (authorities deciding, court orders, Centre board voting, etc), while with a CBDC a government committee can overnight stop people from being able to buy food it they took the wrong side on public health policy or attended the wrong protest (infra for that being developed here).  I came to think that freezing or denying redemption is only the second largest risk with having outsized exposure to centralized collateral. the largest risk is the bargaining/blackmailing power that comes with it. when a single entity controls >50% of the value backing dai, they can influence the DAO’s leadership and voters in major and insidious ways, and we wouldn’t ever know about it. if a balance is frozen, at least we know that something is going on. this way, this exposure jeopardizes the integrity and trustworthiness of the DAO. ",
                    "links": [
                        "https://www.coingecko.com/en/coins/liquity-usd",
                        "https://reflexer.finance/",
                        "https://www.coingecko.com/en/coins/rai",
                        "https://twitter.com/Xentagz/status/1541325554212917249",
                        "https://www.reuters.com/world/china/china-bank-protest-stopped-by-health-codes-turning-red-depositors-say-2022-06-14/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.316152597402597
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joao",
                    "index": "#48",
                    "likes": "10",
                    "time": "30/06/2022-03:05:49",
                    "content": "Joao here, USDC product lead at Circle. This is an important topic and to the extent that we can I’m happy to help with the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#49",
                    "likes": "1",
                    "time": "30/06/2022-03:16:32",
                    "content": "    Joao:  Joao here, USDC product lead at Circle. This is an important topic and to the extent that we can I’m happy to help with the discussion.   Great to see you here. Appreciate it. Not totally sure how to have this convo so let me just jump right in and see what happens. My concern is that Circle has the ability now, and could one day have the cause, and maybe even one day be forced, to blacklist PSM USDC. And this could happen with no notice at all. I’m sure you’d agree that the chances of this are small. But the problem is that it’s possible, and governments are unpredictable, as is the stablecoin regulatory situation. Do you agree or disagree that this should be a cause for concern, even if it’s unlikely? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5995670995671
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dairyman",
                    "index": "#50",
                    "likes": "0",
                    "time": "30/06/2022-03:17:10",
                    "content": "I mean, in for a penny, in for a pound. Don’t forget there half a billion in USDP as well If they rug 10% of all USDC, their company is done. It’ll only happen if they’re forced. Which is a great reason to think about regulation and avoid the centralization backslide that keeps being proposed by a16z puppets ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.020833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joao",
                    "index": "#51",
                    "likes": "1",
                    "time": "30/06/2022-03:22:51",
                    "content": "Yes, I think it is a fair topic for debate. I would think, as many pointed out, that it would be highly unlikely and something that if it ever comes to play we would be definitely on the side of fighting it. But as you mentioned on the original post, that seems to be beyond the point you are trying to make. Happy to assist with other details, to the extent I can. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#52",
                    "likes": "2",
                    "time": "30/06/2022-03:23:14",
                    "content": "Great post.     LongForWisdom:  I’m defining working as:  Providing a stablecoin that stays within 0.5% of its peg, and frankly this is generous, as many have said that this is far too volatile for institutional use of a stablecoin.    I think that we should reconsider this tight peg requirement. I understand the pushback and I understand that it would cost DAI users. But our mandate is to keep the peg as tight as we can while also keeping DAI censorship-resistant and incorruptible. We’ve gone too far with the peg and given up too much decentralization. Reversing course slightly should be on the table as an option. We should not immediately rule it out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.931216931216932
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#53",
                    "likes": "7",
                    "time": "30/06/2022-03:24:17",
                    "content": "    LongForWisdom:  This was long. Apologies. My views, not GovAlpha’s, etc.   Nah, you just took the author to school. TY Sir,   spoken like a true MakerDAO OG  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#54",
                    "likes": "2",
                    "time": "30/06/2022-05:33:19",
                    "content": "@Joao: Thanks for joining the conversation. If we can try to quantify this concern/question a little bit, that would be great. USDC, which is provably censorable plays an outsized role in DeFi, as you know. Given Circle’s centralized nature, and close coordination with government bodies/regulators, it is apparent to many in DeFi, that having USDC part of an ecosystem with many permisionless parts is not ideal. I’ve heard many (and you) say that the risk of USDC censoring smart contracts is remote, but with governments around the world seeking greater control and visibility into digital assets, and clearly being against “unhosted” wallets and financial activities without intermediaries, how is it possible to define the risk of broad-based censorship as remote? So my questions are:   Can you quantify what “remote” means? Is it a 1% chance, .05%? How would you define it? Remote, does not mean impossible. If the risk of censorship is unknown, then USDC is an existential threat to not only Maker but DeFi as a whole. IMO, convenience or the quest to capture institutional dollars, is not a good reason to abandon the ideals many of us actually believe in in DeFi: creating alternative financial ecosystems that are truly unique and with limited ties to TradFi. (We’ve already seen the terrible consequences of CeFi’s engagement with the crypto ecosystem.)   What legally/procedurally prevents Circle from being compelled to blacklist smart contracts such as Aave, Maker, Curve, etc. which have large amounts of  USDC within them at the behest of a government agency due to, for example, concerns terrorists are using these platforms or they allow sanctioned individuals to transact without scrutiny?   How is USDC’s business model (providing large-scale access to US dollars) in a way that is permisionless and without KYC, congruent with attempts to obtain a banking license, and become more compliant with existing regulations/policies and recommendations related to this issue.   How does the ideal of decentralized finance, which fosters the free flow of financial assets globally without restriction align with allowing highly centralized organizations such as Circle (and its asset USDC) to have such a large influence on DeFi, given the centralization and censorship concerns associated with USDC?   Finally, and I’m curious as to your take on this, what is the benefit of utilizing assets such as DAI, FRAX, etc. that are largely backed by USDC (or products, such as liquidity pools containing USDC, in the case of FRAX), versus simply using USDC? Aren’t these products largely redundant given their large-scale reliance on USDC?   This is the crux of the conversation regarding Maker’s continued reliance on USDC to maintain its peg. Why do we need a complex entity such as Maker when DAI is so reliant on USDC to maintain stability and is considering real-world assets (and even advocating for CBDCs)? One of DAI’s key value propositions is that it is supposed to be censorship resistant and have the ability to be relatively sheltered from regulatory/government capture. If DAI does not have these features (given reliance on censorable USDC, seizable real-world assets and potentially CBDCs) many wonder why they should not just use USDC. From this perspective, the original product (USDC) is much better than a complicated, headless knock-off (DAI). Thanks for joining the conversation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.371892076502732
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#55",
                    "likes": "0",
                    "time": "30/06/2022-10:56:04",
                    "content": "    chaser:  both Liquity’s LUSD and Reflexer’s rai have solely ETH as collateral and are stable. rai used an arbitrary starting unit, not $1, and has a floating peg, but its movements relative to USD are muted (the very aim of the design).   Look at the charts of the past 180D of either of those. Not nearly stable enough ",
                    "links": [
                        "https://www.coingecko.com/en/coins/liquity-usd",
                        "https://reflexer.finance/",
                        "https://www.coingecko.com/en/coins/rai"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.857142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joao",
                    "index": "#56",
                    "likes": "6",
                    "time": "30/06/2022-15:38:55",
                    "content": "Hey @davoice321.     davoice321:  governments around the world seeking greater control and visibility into digital assets, and clearly being against “unhosted” wallets and financial activities without intermediaries   I do not share this particular view of the world, it’s just too much of a generalization. Just wanted to leave that on the record. To your points / questions:     davoice321:  Can you quantify what “remote” means? Is it a 1% chance, .05%? How would you define it? Remote, does not mean impossible. If the risk of censorship is unknown, then USDC is an existential threat to not only Maker but DeFi as a whole. IMO, convenience or the quest to capture institutional dollars, is not a good reason to abandon the ideals many of us actually believe in in DeFi: creating alternative financial ecosystems that are truly unique and with limited ties to TradFi. (We’ve already seen the terrible consequences of CeFi’s engagement with the crypto ecosystem.)   I don’t believe there’s a model to quantify this risk. I do not agree that USDC as an existential threat to DeFi as whole though, quite the contrary. USDC has enabled DeFi to grow and reach its potential and we have all the intention to see that continuing to be the case.     davoice321:  What legally/procedurally prevents Circle from being compelled to blacklist smart contracts such as Aave, Maker, Curve, etc. which have large amounts of USDC within them at the behest of a government agency due to, for example, concerns terrorists are using these platforms or they allow sanctioned individuals to transact without scrutiny?   First on principles. There are two primary drivers for access denial (the more “correct” term for blacklisting): complying with OFAC sanctions and abiding to court orders. Sanctions compliance is driven by observing the blockchain addresses added to OFAC lists (these are public). These addresses are usually associated with individual or commercial entities, not with an entire financial institution. In other words, it’s very unlikely to target an entire financial institution. If OFAC was ever to add some DeFi protocol address to a sanctions list, this wouldn’t be so much of a USDC-related problem, this would be an existential problem for that protocol in terms of how it touches any other regulated exchanges, wallets, on-ramps, etc. kinds of products. I don’t like to speculate, but that seems highly unlikely to me. On the court order side of things, that is a very high procedural bar and one where there’s an ability to object just as part of any legal process. I would call particular attention to this piece of the Centre Access Denial policy:  To the extent an order requires access denial of an address with commingled funds of a platform (or similar) and Centre reasonably determines that such access denial presents a threat to USDC, Centre reserves all rights to object to the order in the course of its participation in the proceeding.  The reason that was added to the policy is precisely because wrongly utilizing the access denial mechanism towards a commingled structure like a DeFi protocol or a centralized exchange represents a threat to the very existence of USDC. As you can imagine, we aren’t interested in destroying USDC’s reputation and future potential ourselves. We have the right to object these situations where it’s appropriate.     davoice321:  How is USDC’s business model (providing large-scale access to US dollars) in a way that is permisionless and without KYC, congruent with attempts to obtain a banking license, and become more compliant with existing regulations/policies and recommendations related to this issue.   I do not see the incongruence you seem to suggest here. Circle already is compliant with existing regulations in this space, and we already partner with the best US domiciled banks for a product like USDC. The amount of diligence required in this space wouldn’t allow these entities to work with us if they weren’t comfortable with the existing construct. I will not speculate on how regulations could sway in the future - I honestly think nobody can.     davoice321:  How does the ideal of decentralized finance, which fosters the free flow of financial assets globally without restriction align with allowing highly centralized organizations such as Circle (and its asset USDC) to have such a large influence on DeFi, given the centralization and censorship concerns associated with USDC?   Our mission is very much aligned with the ideals of decentralized finance. We also believe in things like consumer protection, fighting financial crime, maintaining a safe environment for all ecosystem participants. I would like to believe those things are not in opposition. We strongly believe there is a role for an asset like USDC - with a sound reserve model, trusted and regulated construct, and highly liquid profile, to benefit decentralized finance. As I said previously, the growth of DeFi on Ethereum and other ecosystems has proven for that to be the case. But the ecosystem needs to define for itself what other constructs have to be in place. We’ve always collaborated well with Maker and other participants who ambition to build a more decentralized model. We don’t see those as in opposition necessarily.     davoice321:  Finally, and I’m curious as to your take on this, what is the benefit of utilizing assets such as DAI, FRAX, etc. that are largely backed by USDC (or products, such as liquidity pools containing USDC, in the case of FRAX), versus simply using USDC? Aren’t these products largely redundant given their large-scale reliance on USDC?   I don’t believe they are redundant products. Assets like DAI, FRAX, etc. can typically innovate at a much faster pace when compared to USDC. They can iterate on UX and experiment with more flexibility. Sometimes I think about them as the “fintech” equivalent of tradfi. USDC can play a role in their growth and sustainability, and if they prove their concepts they should not have to depend on something like USDC. As always - and I’m sure as many in the ecosystem can attest to, we maintain an open mind and are happy to collaborate in a trusted manner with projects that are truly valuable like the ones mentioned here. Thanks for having me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.497845719095719
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joao",
                    "index": "#57",
                    "likes": "1",
                    "time": "30/06/2022-15:40:15",
                    "content": "I’d also invite everyone to check this out, which we wrote recently on how we see the world from the perspective of builders in this space.    circle.com    Why Developers Can Trust USDC Common concerns and misconceptions from developers about USDC and Stablecoins are addressed in this Q&A      ",
                    "links": [
                        "https://www.circle.com/blog/why-developers-can-trust-usdc"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#58",
                    "likes": "0",
                    "time": "30/06/2022-16:31:03",
                    "content": "    Joao:  I do not share this particular view of the world, it’s just too much of a generalization. Just wanted to leave that on the record.   Thanks for the conversation. I’ll just leave this here regarding the EU’s stance toward crypto assets and the recently passed EU rules and comments regarding crypto assets from regulators developing these rules: \"“After months of negotiations with the Council, we agreed the most ambitious travel rule for transfers of crypto-assets in the world. We are putting an end to the wild west of unregulated crypto, closing major loopholes in the European AML rules.” “For too long, crypto-assets have been under the radar of our law enforcement (…). Terrorists used crypto for fundraising, to access to child pornography & criminals laundered their proceeds (…) Today, we have taken a big step to address these problems” The regulatory regime in the EU is moving toward more restriction, not less of the free flow of digital assets, as outlined here: Crypto assets: deal on new rules to stop illicit flows in the EU | News | European Parliament I don’t see a permisionless DeFI jibing with this regulatory approach. Appreciate your other interesting responses. I’ll take a look at them closer in a bit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.769437799043063
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#59",
                    "likes": "1",
                    "time": "30/06/2022-16:41:56",
                    "content": "    Joao:  The reason that was added to the policy is precisely because wrongly utilizing the access denial mechanism towards a commingled structure like a DeFi protocol or a centralized exchange represents a threat to the very existence of USDC. As you can imagine, we aren’t interested in destroying USDC’s reputation and future potential ourselves. We have the right to object these situations where it’s appropriate.   Regarding this: Can you explain the objection process a bit more? For example, if USDC was mandated by court order to blacklist, say a Curve smart contract address, what specifically would the objection process enable Centre to do? For example, by requesting a stay of the court order or injunctive relief? Even if Centre objects to a court order to blacklist or sanction an address with co-mingled funds, that does not mean that Centre wouldn’t be forced to comply at some point in the future, which again adds a significant cloud of uncertainty to any long-term reliance on USDC as an asset in DeFi. Would you agree that Centre is not in a position of great strength versus sovereigns’ legal power?  What legal remedies would Centre have at its disposal if a court order to block a smart contract came through? Also, do you agree that the very need to rely on traditional legal structures to protect USDC’s ability to engage in permissionless finance is in itself a significant risk to DeFi overall? Many of us in DeFi, distrust these structures (which have been proven to favor entrenched powers, and anti-democratic impulses/regimes) implicitly and having to rely on them to protect protocols and the continued functioning of DeFi (given USDC’s entrenched role in the ecosystem) represents, in itself, and existential risk to DeFi? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9141071428571435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#60",
                    "likes": "3",
                    "time": "30/06/2022-16:46:58",
                    "content": "Kudos to you for such a well answered, professional response. There is a large spectrum of gray that exists between the world of DeFi and TradFi - it would have been easy to sit the conversation out rather than get involved. Thanks for contributing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.947619047619047
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joao",
                    "index": "#61",
                    "likes": "1",
                    "time": "30/06/2022-20:53:10",
                    "content": "I don’t want to minimize the relevance of MiCA related changes, but those requirements are going to impact operators of virtual asset services across the board, which covers a company like Circle just as much as any centralized exchange. That is only part of what USDC is (the issuance and redemption part). We already abide to the latest requirements of the travel rule as per US regulations, and they are very similar in nature to that. It has had no bearing to date on how USDC is used between self-hosted wallets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joao",
                    "index": "#62",
                    "likes": "0",
                    "time": "30/06/2022-20:53:50",
                    "content": "Thank you, appreciate the comment ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joao",
                    "index": "#63",
                    "likes": "0",
                    "time": "30/06/2022-21:03:29",
                    "content": "    davoice321:  Regarding this: Can you explain the objection process a bit more? For example, if USDC was mandated by court order to blacklist, say a Curve smart contract address, what specifically would the objection process enable Centre to do? For example, by requesting a stay of the court order or injunctive relief?   I am obviously not a legal expert, so I don’t feel I can opine here. On your latter point, I think I disagree. I might also have my own reservations about entrenched power, but the “traditional legal structure” is all we have, I don’t know of an alternative system. To build sustainable platforms that will exist for years is also to abide to the rule of law while fighting to protect one’s rights within the systems we have available. We have had very recent examples of how a complete disregard for basic things like consumer protection and the rule of law in the spirit of “decentralization” have caused more harm and existential threat to DeFi than anything else. So I maintain what I said before - we are passionate about DeFi and what it represents (open / permissionless access, reduced friction, less intermediation, etc.). We will continue to do the right things in our perspective to enable it in a sustainable way, not curtail it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.776041666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#64",
                    "likes": "1",
                    "time": "30/06/2022-21:37:46",
                    "content": "    Joao:  We have had very recent examples of how a complete disregard for basic things like consumer protection and the rule of law in the spirit of “decentralization” have caused more harm and existential threat to DeFi than anything else   Thanks. We’ve seen in the case of major blowups that decentralization is not to blame, but a lack of good old risk management, common sense and transparency. And we’ve also seen how ce-de-fi, is just old wine in new bottles. It’s not decentralization at fault, but lack of adherence to old-fashioned common sense and the existing laws on the books. And unfortunately it seems powerful forces at maker wish to repeat the mistakes of the past by engaging in the same non-transparent structures and practices. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.367312834224599
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joao",
                    "index": "#65",
                    "likes": "0",
                    "time": "30/06/2022-21:42:26",
                    "content": "LOL old wine in new bottles ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7272727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davoice321",
                    "index": "#66",
                    "likes": "3",
                    "time": "30/06/2022-21:47:33",
                    "content": "    Joao:  On your latter point, I think I disagree. I might also have my own reservations about entrenched power, but the “traditional legal structure” is all we have, I don’t know of an alternative system.   We just have to disagree here. The existing system, which you represent, has given us “wonderful” things such as: -privatized gains and socialized losses -redlining -tremendous debt -state sponsored or tolerated money laundering -state sanctioned seizure of financial assets due to guilt by association The list goes on. I appreciate your responses, but it should be clear to everyone that the  censorship resistant, permissionless properties of maker are reliant on the centre legal department and its “do no evil” philosophy. That’s not good enough. This issue ultimately will be up to maker voters to decide, as to whether to continue to cozy up to the same system that brought us the great financial crisis or double down on the proven social and economic good that has been unleashed by maker, and the quest to build a new decentralized system that allows people to opt out from the madness I don’t expect you as a representative of Centre and the centralizing force that is usdc, to agree with this thinking, but i hope maker voters are paying attention. (Recent events indicate they are.) Thanks for the dialogue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.77268050879162
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joao",
                    "index": "#67",
                    "likes": "8",
                    "time": "30/06/2022-22:04:44",
                    "content": "Appreciate the respectful convo. To be clear, I don’t represent Centre - I am a product lead for stablecoins at Circle. And gosh I hope I don’t represent those things you mentioned  You guys are raising important questions and that’s what makes Maker a great community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#68",
                    "likes": "1",
                    "time": "01/07/2022-14:51:03",
                    "content": "    Joao:  You guys are raising important questions   Thank you Joao. I wish everyone here agreed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerWOW",
                    "index": "#69",
                    "likes": "4",
                    "time": "04/07/2022-07:05:36",
                    "content": "Hi. For whatever it’s worth, I’m really really new to Maker… I’ve been aware of the project for years, but never took the opportunity to dive-in and really see what’s going on ‘under the hood’ so to speak… Anyway, this is my first day ‘peeking behind the curtain’, and I’ve literally spent roughly 10 of the last 12 hours reading through these forums and trying to get a sense of whatever the hell is going on around here… From the outside, there’s not much to know about Maker/DAI… It’s all a bit of a black-box, and there’s not a lot of discussion about it, or how it works, going on outside of here… Not that I’ve seen, anyway… But the one thing everyone “knows” about it is that DAI is the decentralized stablecoin, backed by code and a trusted trustless system of decentralized, grass-roots governance… Now I wander in and find… Honestly, kind of a mess, governance-wise, of what looks to me like in-fighting and opposing/dissenting opinions without a lot of codified and agreed-upon structure in place to herd all the cats to one logical common-ground… And also I’m not sure what the whole “party system” is that I’ve read so much about today, but it already sounds less grass-roots than I’m entirely comfortable with… and I could easily be wrong about any/all of that – I’m still learning and wrapping my head around it all – but I do not think I’m wrong about this: In this comment from @LongForWisdom you said that one of the options is to “[make] DAI even less competitive when compared to centralized stablecoins” In my mind, DAI’s only competitive advantage is its wholly decentralized, trustless nature, and the more DAI that’s backed by centralized assets of any kind, the more it becomes just those assets but with extra steps… And I know you also said that “Realistically, most users do not care about decentralization primarily when evaluating stablecoins” but, and I’m going to be a little not-nice here… Most crypto users do not care about anything other than what amount of [insert their local fiat currency here] their portfolio is worth at any given moment… Because, to paraphrase Phillip Fisher, ‘the crypto market is filled with individuals who know the price of everything, but the value of nothing’… Now, in this comment from @ChrisBlec he says “our mandate is to keep the peg as tight as we can while also keeping DAI censorship-resistant and incorruptible” and I think I agree… To me, Maker and DAI ought to be the choice of the informed and discerning… Not those who chase insanely high yields with zero regard for the risks they’re taking (I’m looking at you, everyone who invested in Terra), but those who care about making principal-based decisions with their money, and who want their investment to be “censorship-resistant and incorruptible”…And, yes, that might come at the cost of “scaling DAI” to the masses… Well, so be it. And I’m not saying that reaching the masses and scaling DAI adoption to “500M” (to again quote from LongForWisdom’s comment I linked above) wouldn’t be great, but we cannot do so at the expense of all else… Otherwise, we become the same as those I just spoke of, who are (to paraphrase myself) ‘chasing higher numbers with zero regard of the risks they’re taking’… This has been a newcomer’s two-cents… TL;DR or maybe a Postscript, IDK it’s really late for me now and I’m tired: I agree that Maker might have a centralized collateral problem, and some disagree but they haven’t convinced me that it isn’t a problem that the thing that started-out as a temporary solution to another problem then became standard practice for no reason I can see other than the genie was already out of the bottle and the wish it was granting (at what cost?) was the opportunity to grab marketshare and/or make Maker/DAI more powerful/influential in the market… Change my mind. ",
                    "links": [
                        "https://forum.makerdao.com/t/can-we-justify-the-existential-risk-posed-by-psm-usdc/16180/52",
                        "https://forum.makerdao.com/t/can-we-justify-the-existential-risk-posed-by-psm-usdc/16180/32"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.553261109638661
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rachel_G",
                    "index": "#70",
                    "likes": "0",
                    "time": "04/07/2022-13:19:18",
                    "content": "Should have never been called a temporary solution. We should probably just make it better ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/observerdq",
                    "index": "#71",
                    "likes": "1",
                    "time": "09/07/2022-07:14:41",
                    "content": "A question as to why the demand for DAI so strong given DAI is evolving into wUSDC. I had a thinking. DAI established its status in the early days as the king of decentralized stablecoin. This means a lot for DAI. For example, inclusion of DAI in Curve 3pool is a big driver of the demand. I believe there are other scenarios DAI enjoys popularity because of this decentralized narrative and impression. Although more and more percentages of DAI are backed by USDC now, it takes time for the established advantage to fade away. Just as it may take more than four years for USDC to surpass USDT, it may take  some years for the industry to realize that there is no need to bother to use DAI. We’ll see. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.363095238095237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pcfreak30",
                    "index": "#72",
                    "likes": "3",
                    "time": "10/07/2022-15:05:52",
                    "content": "Hello, I am an on/off user of DAI, I have also been hit with the UST meltdown. My research has brought me to several projects and I overall get this is a hard problem to solve. I am actively looking at things like DJED, SigmaUSD, DAI, and FRAX. I care most about decentralized money and thus decentralized stablecoins. I will say this bluntly. I am really surprised by the I don't give a fuck, so what if we used USDC attitude. This is actually scary and even CONSIDERING using a CBDC for DAI in the future makes me think this whole DAO should be deleted. As it stands my view is Goverment = Blackrock = Circle = Coinbase = USDC = CBDC. I view USDC as a CBDC and with the recent coinbase orderbook merge, it’s the next step. I really cannot trust anything any employee or rep says that is at Centre/Circle/Coinbase about this as I view the whole entity as the adversary in this situation on principle. As long as there is a central entity that a government can tell to shut something off, or to freeze for any reason, that entity cannot actually be trusted in defi. If MakerDAO continues down this path, it is probably better that it de-pegs or does not exist as there will be no point to it and we might as well just go and bend over and use a CBDC… To me, it’s an all-or-nothing situation. I agree with the OP in this situation. I am personally building Web3 technology and the idea that my project funds in stablecoin can get frozen on-chain is unacceptable. DAI having this by proxy on principle is unacceptable as well. Kudos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.042361111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#73",
                    "likes": "4",
                    "time": "10/07/2022-15:35:09",
                    "content": "DAI is a USD peg after all. Maybe pegging DAI to a global basket of currencies could solve for this dependency but dont understand the negative sentiment for holding 1:1 peg to USD which is what a stablecoin is supposed to do. The PSM risk is more of concentration risk, the DAO has recognized that and is looking to diversify DAI backing collateral with RWAs and other stablecoins as we cannot make-up crypto lending demand out of thin air. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.675000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#74",
                    "likes": "2",
                    "time": "10/07/2022-21:20:03",
                    "content": "Honestly, you are better off using Rai then. It’s exclusively backed by Eth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#76",
                    "likes": "9",
                    "time": "11/07/2022-12:28:19",
                    "content": "Folks since I consider myself the progenitor of the PSMs with the original idea (because I used to ‘arb the PEG quite a bit’), I think some comments are appropriate. My own goal was to simply use Maker’s ability to mint DAI (i.e. provide liquidity) and the relatively stable value of USDC (or other stables) to provide some liquidity to manage the DAI price.   My own vision for DAI PEG price management was to use multiple PSMs with increasing DCs and widening price bands. Example 50M for a band of like 5bps, 500M for a band of like 25bps, 5B at 50bps etc.    The point here was for Maker itself to do what I was doing with my vault.  Sell DAI high and buy it back lower and I wanted Maker to be the DAI liquidity source because it could offer MORE liquidity than a vault could all the time. @rune ran with this idea, he realized the SAI to DAI bridge smart contracts could be used, but he wanted 0 fees and effectively infinite liquidity on the high side, where as the liquidity of stables on the low side would be limited by the amount of stables.    This creates a perfect DAI short situation in that DAI price can never exceed 1 (unless the DC is hit or the ES is triggered) and if stables exhaust (and this can happen in a single tx btw) then the DAI peg can and will drop below $1.  This is all fine and dandy until the PSMs exhaust and the DAI peg drops below $1. The arguments for this were that it would increase DAI adoption as the DAI price away from $1 hurt adopters and would help IV vaults (as well as real world) by providing them a way to convert large amounts of DAI to USD via USDC etc. The reason the DAI PEG was riding high (like 1.02 consistently) was due to Compound adding COMP rewards for depositors and borrowers creating an incentive for recursive mining effectively changing borrow rates on DAI to below 0, and deposit rates above the SF fee on Maker.   Maker vaults just couldn’t supply the liquidity to keep the price below 1.02 and reducing fees pretty much did nothing.  I suggested we try to raise rates to make borrowing DAI more expensive but was overruled by the community (we never tried this even as a short term test). It took at least 6 months before @rune finally got his way and tin/tou was set to 0 and Maker never created multiple PSMs with multiple DCs and fee bands to create this liquidity provider of last resort on DAI goal to basically bracket the DAI PEG on the high and low side to no more than .5% which I would have considered very good for a decentralized stable.   Maker would also have earned profit doing this and it is likely we would not have 3.5B USDC in the protocol like today and even if we did - we’d have earned something like 10-30M doing it which would have grew the surplus to help us in many ways. What is worse here is that USDP and GUSD were added and all of these have tin/tout set to 0.  Maker in effect has force locked the prices of DAI, USDC, USDP, and GUSD to $1 with the PSMs.  IF any of these have any problems Maker will end up being on the hook for any liabilities caused by any of these dropping off $1 for any reason.   Most have considered such events unlikely but when someone tends to lock market prices to $1, eliminate friction via fees, at some point there almost always is an issue that leads to losses and intense regulator scrutiny.   Time will tell. Lately there has been discussion about adding fees again.     Rethinking PSM-fees Proposal Ideas   TL;DR I have been in favor of 0-PSM-fees to provide a hardened peg since the introduction of the PSM. I am now convinced that this was a mistake as this policy removes the incentive for normal vault holders to arbitrage on depegging and by that just leaving the leverage-usecase for vault holders. As the appetite for leveraging crypto is not very strong, we have reached a stablecoin ratio of ~80% recently - turning DAI more and more into a USDC-wrapper.   Rethinking PSM-fees For those not having…     As I argued in the past tin/tout to 0 basically kills exchange markets elsewhere.  Example uniswap .01 and .05 via GUNI would earn more fees if the current PSM was opened up.  Wouldn’t it be better for Maker to open up a trading gap so GUNI holders potentially earn more return encouraging more liquidity.    My goals are always to test solutions that encourage decentralized players to come forward with liquidity rather than the reverse and Maker hasn’t even moved to do a basic test of a change (by putting tin/tout to 5bps)  to see how the Uniswap .01, .05 v3 earnings and liquidity would change in response (same with curve btw) and whether this would finally allow for USDC to start migrating away from the PSM. This is my biggest beef with Maker btw in that it never does even a test change in system parameters to gauge market response.   Perturbation theory and practice not just in physics is extremely important way to learn about and determine matrix elements between correlated system parameters, this is also true of financial systems. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.780199579831933
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#77",
                    "likes": "0",
                    "time": "11/07/2022-13:38:21",
                    "content": "good post Maker test, learn & adapt makes great sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#78",
                    "likes": "2",
                    "time": "11/07/2022-15:24:27",
                    "content": "<<<<(CEFI) USDC ---- DAI ---- RAI (DEFI)>>>>> We are in the middle of the stable coin DeFi spectrum, there is a lot of space in between for testing and identifying the right balance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#79",
                    "likes": "0",
                    "time": "11/07/2022-16:29:41",
                    "content": "DAI has been evolving into wUSDC. But there is incremental demand for wUSDC on top of demand for USDC. The only way to censor DAI (or any form of wUSDC) is to kill the entire thing; an individual wallet can’t be targeted. This is one of the most important aspects of stablecoin decentralization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#80",
                    "likes": "3",
                    "time": "11/07/2022-16:32:20",
                    "content": "    lyt:  The only way to censor DAI (or any form of wUSDC) is to kill the entire thing; an individual wallet can’t be targeted. This is one of the most important aspects of stablecoin decentralization.   Regulators have no problem “killing the entire thing” if they have no other way to attack the “thing”. This doesn’t increase decentralization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#81",
                    "likes": "0",
                    "time": "11/07/2022-18:29:16",
                    "content": "We shouldnt be so stand offish against ALL regulation. Some light regulation might be beneficial for everyone, it could even help onboard a new wave of crypto users. E.g., to avoid another UST scenario, were any project can label themselves as a stablecoin when in reality they were not. If anything to me the potential launch of CBDC might point out that US regulators are embracing crypto but I really appreciate your different perspective and enjoy the problem-solving exercise.     ChrisBlec:  Regulators have no problem “killing the entire thing” if they have no other way to attack the “thing”.   This would create another UST scenario which regulators are specifically trying to avoid. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.749289772727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#82",
                    "likes": "2",
                    "time": "11/07/2022-21:41:23",
                    "content": "Another real problem is that 85% of all Dai do not produce income. How do you guys intend to pay for everything long term if the trend continues we will have no income producing Dai left? I am past the point of worrying about MKR holders not getting their share but taking on risk. Nobody seems to care that the cake is gone completly. And the people eating the cake currently will possibly have to eat less of it because there wont be enough to go around. I am surprised that so many people inside the car are looking at the car driving against a wall without adjusting the steering wheel. Well atleast I will get to see how this plays out. We can rename Dai to wUSDC while we are at it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#83",
                    "likes": "0",
                    "time": "11/07/2022-22:34:15",
                    "content": "Without the PSM there would be the same amount of income generating DAI and DAI’s peg would be volatile. There are a lot of governance-approved initiatives that aim to generate revenue from the PSM, soon we will start seeing some additional NII from them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#84",
                    "likes": "1",
                    "time": "12/07/2022-00:10:43",
                    "content": "The PSM makes it cheaper to obtain Dai. If the peg goes over 1.01 arbitrage gets active and mints Dai. Lets say Dai demand would be high and Dai price would go up. If there is no PSM someone will use the opportunity to create Dai make a loan and arb the premium away. This incentive is missing with the PSM as the PSM will do it but there is no yield for the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.711111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pcfreak30",
                    "index": "#85",
                    "likes": "1",
                    "time": "12/07/2022-18:21:07",
                    "content": "This is speculation but I feel it applies:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pcfreak30",
                    "index": "#86",
                    "likes": "1",
                    "time": "13/07/2022-23:07:22",
                    "content": "TBH this would be what they want because it just herds the sheep into a CBDC and cuts off bitcoin access. Regulation means having some sort of centralization point of failure TO BE REGULATED. If you have THAT, you’re NOT DECENTRALIZED. So yes DAI is becoming wUSDC and I am probably going to avoid it longer term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pcfreak30",
                    "index": "#87",
                    "likes": "1",
                    "time": "13/07/2022-23:13:35",
                    "content": "As I have stated… if the DAI peg cannot be maintained decentralized, it should not exist as it does nothing different, and the powers that be will press the off button without a second thought. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}