{
    "poll_list": [
        {
            "title": "MIP10c15-SP1 Governance Poll to Appoint Kyber Network as Oracle Light Feed - June 15, 2020",
            "index": "2632",
            "option": "Yes",
            "supporting_mkr": "7,485",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c14-sp1-appoint-kyber-network-as-light-feed/2632",
            "title": "MIP10c14-SP1 Appoint Kyber Network as Light Feed ",
            "index": 2632,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracle-lightfeed-sp",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Deniz_Omer",
                    "index": "#1",
                    "likes": "7",
                    "time": "26/05/2020-07:37:12",
                    "content": "Hello everyone, Deniz here from the Kyber Network team. Below is our proposal to add Kyber Network as a Light Feed Price Oracle to MakerDAO. Let us know of any questions and thank you for your consideration!  MIP10c14: Subproposal to Appoint Light Feed  Preamble MIP10c14-SP#: 1 Author(s): Deniz Omer Contributors: Status: Formal Submission Date Proposed: 2020-05-24 Date Ratified: <yyyy-mm-dd>   Disclaimer MIP10 is meant to handle all of the Oracle related actions. Unfortunately MIP10 has inconsistencies and doesn’t conform to the monthly governance cadence that the Maker Improvement Proposal framework is built around. This has generated a backlog of Oracle proposals. While MIP10 is refactored to conform to the regular MIP process, Oracle proposals such as this one will utilize the more liberal weekly governance cycle. While strictly speaking this makes them not subproposals, they are included in the subproposal archive as a point of provenance to serve as a paper trail.  Specification  Organization  Name: Kyber Network Reserves Limited Website: https://kyber.network/  Github: KyberNetwork · GitHub  Email: [email protected] Incorporated: British Virgin Islands Domiciled: British Virgin Islands Number of employees: 0 When was the organization founded? 21 March 2018 Who are the major investors in your organization? Kyber Network Reserves Limited is a wholly owned subsidiary of Jedha Holdings Private Limited, a Singapore-incorporated entity. Funding is from Jedha Holdings. How much funding has the organization raised either privately or through a token sale? Jedha Holdings Private Limited’s subsidiary, Kyber Network Private Limited, also a Singapore-incorporated entity, raised 200,000 Ethers (equivalent to USD52m based on ETH:USD pricing at the close of the token sale) in an ICO that was completed in September 2017 in Singapore. Please provide public references for the above where possible. (https://icodrops.com/kybernetwork/)   Introduction  Motivation for running a Light Feed  As deeply passionate members of the Ethereum community we recognize the importance of trustless oracles in the functioning of a healthy DeFi landscape, and with more than two years of experience working on on-chain liquidity provision we want to take the next step and contribute to the further diversification of the trustless Oracles. We are really looking forward to the growth of both the DeFi space and MakerDAO.  Community  What has your organization contributed to the crypto community?  The team’s main focus and contribution over the last 3 years has been building Kyber Network protocol, an on-chain liquidity protocol that aggregates liquidity from a wide range of reserves and enables token exchange in any decentralized application. It also contributed through grants to Ethereum teams at very early stages (ie. Instadapp) and is an active member of the Ethereum community  Successful products, services, tools, libraries, thought-leadership  Apart from Kyber Network, the various founders have been involved in: - Oyente - an analysis tool for smart contracts - PeaceRelay - a protocol to trustlessly connect EVM-compatible blockchains. - Smartpool - a decentralized PoW mining pool using smart contracts - Elastico - a sharding protocol for public blockchains.  How will the Maker Community benefit from your inclusion as a Light Feed?  The Kyber team have gained valuable experience building one of the largest liquidity providers to the DeFi space over the last three years, and their addition as a stakeholder to the trustless Oracles further contributes to the strengthening of the expertise and know-how within the MakerDAO ecosystem.  Changelog  reformatted preamble added disclaimer  ",
                    "links": [
                        "https://github.com/kybernetwork",
                        "https://icodrops.com/kybernetwork/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.349695767195767
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/05/2020-04:05:26",
                    "content": "MIP10c15: Subproposal to Appoint Feed (OT) Preamble MIP10c15-SP#: 1 Author(s): Niklas Kunkel Contributors: Status: Formal Submission Date Proposed: 2020-05-29 Date Ratified: <yyyy-mm-dd>  Disclaimer MIP10 is meant to handle all of the Oracle related actions. Unfortunately MIP10 has inconsistencies and doesn’t conform to the monthly governance cadence that the Maker Improvement Proposal framework is built around. This has generated a backlog of Oracle proposals. While MIP10 is refactored to conform to the regular MIP process, Oracle proposals such as this one will utilize the more liberal weekly governance cycle. While strictly speaking this makes them not subproposals, they are included in the subproposal archive as a point of provenance to serve as a paper trail. Specification Introduction If ratified, this subproposal would appoint Kyber Network as a Light Feed. Feeds submit data to the Oracles for the prices of assets. They are an important part of ensuring that the Oracles are reliable and secure. Only entities with strong credentials that the community trusts should be permitted to be an Oracle Feed. Organization The following information was provided by Kyber Network in their MIP10c14 application and verified by the Oracle Team to the best of its ability.    Name: Kyber Network Reserves Limited   Website: https://kyber.network/   Github: https://github.com/kybernetwork   Email: [email protected]   Incorporated: British Virgin Islands   Domiciled: British Virgin Islands   Number of employees: 0   When was the organization founded? 21 March 2018   Who are the major investors in your organization? Kyber Network Reserves Limited is a wholly owned subsidiary of Jedha Holdings Private Limited, a Singapore-incorporated entity. Funding is from Jedha Holdings.   How much funding has the organization raised either privately or through a token sale? Jedha Holdings Private Limited’s subsidiary, Kyber Network Private Limited, also a Singapore-incorporated entity, raised 200,000 Ethers (equivalent to USD52m based on ETH:USD pricing at the close of the token sale) in an ICO that was completed in September 2017 in Singapore.   Please provide public references for the above where possible. (https://icodrops.com/kybernetwork/)    Light Feeds Reputation  Does the organization have a strong reputation in the crypto community?  Yes, Kyber Networks has been one of the main contributors in the Ethereum space going as far back as 2017. They are one of only a handful of projects to be directly endorsed by Vitalik Buterin, the founder of Ethereum. Since their launch they’ve been one of the major liquidity providers in the DEX space and easily one of the most frequently used dapps.  What contributions has this organization made to the crypto ecosystem?  The team’s main focus and contribution over the last 3 years has been building the Kyber Network protocol, an on-chain liquidity protocol that aggregates liquidity from a wide range of reserves and enables token exchange in any decentralized application. It also contributed through grants to Ethereum teams at very early stages (ie. Instadapp) and is an active member of the Ethereum community  Would including the organization as a Light Feed instill a sense of trust in the Oracles?  It is the opinion of the Oracle Team that Kyber has a trustworthy reputation in the community and would further reinforce the reputation of the Maker Oracles.  Are there any public accusations of misconduct? How severe and numerous are they? Have they been confirmed?  The Oracle Team was not able to find any record of confirmed cases of misconduct on account of the organization nor its executive staff. Verification  Were sufficient public-facing resources provided or found that confirm the information in the application?  Yes, public records were able to verify most of the provided information.   Was the applicant honest with respect to:   the investors   While the Oracle Team was not able to confirm that Kyber Network Reserves Limited is owned by Jedha Holdings Private Limited, it was able to confirm the existence and active status of Jedha Holdings Private Limited in Singapore through the Singaporean Accounting and Corporate Regulatory Authority (ACRA) with an address of 1 Upper Circular Road #050-01 Singapore 058400 and UEN 201803106C.  how much funding was raised  The Oracle Team was able to confirm that 200,000 ETH was raised in an ICO in September 2017  the number of employees  The Oracle Team was not able to verify the number of employees.  the location of incorporation & domicile  The Oracle Team was able to verify the entity is domiciled in the British Virgin Islands through records supplied by the British Virgin Islands Financial Services Commission.  Given the applicant’s major investors, is there a risk adding this Light Feed would give a single investor too much influence over the Oracle protocol?  No.  Given the incorporation and domicile location of the organization, is there a risk adding this Light Feed would give a single jurisdiction too much influence over the Oracle protocol?  No. Identity  Did the Oracle Team get in contact with the organization to confirm their application?  Yes, the Oracle Team spoke to representatives from the Kyber Networks team over video conference who are listed on the organization’s website. Cost-Benefit  Given the ratio of Dark Feeds : Light Feeds, does the Maker Protocol benefit from adding another Dark/Light Feed at this time?  Yes.  Given the extra cost of appointing a new Feed, does the benefit of the marginal security / marginal trust in the protocol exceed the cost?  Yes. Oracle Team Recommendation The Oracle Team recommends that Maker Governance ratify the proposal to appoint Kyber Network as a Light Feed for the Maker Oracles. Kyber Network has a strong brand and reputation in the ecosystem which are the primary requirements to look for in a potential Feed partner. The Oracle Team was able to verify the information provided by Deniz Omer in the MIP10c14 Light Feed application through government public records and cursory googling. No confirmed cases of misconduct related to the organization were found. Changelog  reformatted preamble added disclaimer  ",
                    "links": [
                        "https://github.com/kybernetwork",
                        "https://icodrops.com/kybernetwork/",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-11-9am-pst-4-00-pm-utc/2742/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.579232868195634
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/06/2020-04:53:29",
                    "content": "Governance Poll is live. https://vote.makerdao.com/polling-proposal/qmaq4mksui8wnmxqdudj1lweezk1gzx99vaoudsztsmyfk ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-temporarily-process-oracle-proposals-through-the-weekly-governance-cycle/2801",
                        "https://forum.makerdao.com/t/set-of-oracle-proposals-included-in-july-3rd-executive-vote/2977"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/06/2020-05:41:06",
                    "content": "Hi @NikKunkel how are you doing  ? Can you help me to clarify this here;  Public records were able to verify “most” --> What most mean here ? The Oracle Team was not able to confirm that Kyber Network is owned by who, but instead we know there is an active status of Jedha Holdings… thru another corporation etc… Unknown number of employees --> That could mean if Maker allow them money, how do we know they will be able to manage their task and ensure what they will do is in regulation with the current compliance and policy for example.  I am just questioning myself about this and what could be the impact or possible negative / positive outcomes that would result, either on both side of the investigation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.292478354978355
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#5",
                    "likes": "1",
                    "time": "16/06/2020-07:55:33",
                    "content": " Public records were able to verify “ most ” --> What most mean here ?  The Oracle Team was able to confirm that Jedha Holdings Private Limited exists, but cannot confirm through public records that it actually owns Kyber Network Reserves Limited. This could be relevant if the community believes that the ownership of Kyber Network Reserves Limited is partly or in whole owned by a malicious entity. For example, imagine if Bitconnect owned a majority share. Another benefit of this research is to ensure that no single entity controls a significant number of Feeds. For example, quite a few Light Feeds are run by organizations embedded within Consensys. This might be something the community should be on alert for when considering future Feed applications from other Consensys owned entities.  Unknown number of employees --> That could mean if Maker allow them money, how do we know they will be able to manage their task and ensure what they will do is in regulation with the current compliance and policy for exam  While I can’t presume to know how Kyber’s organization is structured (maybe @Deniz_Omer can chime in) I can see at least 15 people listed as being part of the Kyber team on their website. I may also infer that because most of the titles on that page are “Leads” that there are a significant number of more junior positions on the Kyber team. This is further reinforced by the massive banner picture on that team showing what is likely to be the Kyber team. As for being in compliance the Oracle Team has scripts that monitor the activity of the Feeds. If a Feeds goes offline, or doesn’t update their software in the allotted time, Maker Governance can just revoke the Feed as easily as it was added. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6491815476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deniz_Omer",
                    "index": "#6",
                    "likes": "1",
                    "time": "16/06/2020-09:29:18",
                    "content": "Yep these are valid concerns and I will get a response that addresses these from our CFO. Just a note, due to various considerations we don’t use Kyber Network as a company now for these kind of applications and within the context of the Light Feed, we felt Kyber Network Reserves Limited was the most appropriate legal entity to apply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.252232142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#7",
                    "likes": "0",
                    "time": "16/06/2020-12:06:11",
                    "content": "Thanks for the clarification @Deniz_Omer @NikKunkel But the “Feed” is what could result in a premature auction or bid, then leading to more erroneous on-chain calculation that i doubt the governance emergency alerted team could manage to react fast enough. Not because i doubt about their competency, but mainly because the mechanics and concepts will give plenty of time to make some moves, i might be wrong also. The best way to do this would be a “Real Time Simulation” or something similar to explore the possible failure. I dont want to mention this, but thinking about a failure could make me think about a possible 0 bid Liquidation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.226190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#8",
                    "likes": "1",
                    "time": "16/06/2020-21:20:33",
                    "content": "I think your question has less to do with Kyber specifically then and more to do with our Oracle tech stack.  But the “Feed” is what could result in a premature auction or bid, then leading to more erroneous on-chain calculation that i doubt the governance emergency alerted team could manage to react fast enough.   Not because i doubt about their competency, but mainly because the mechanics and concepts will give plenty of time to make some moves, i might be wrong also.  With a quorum of 13, we could have up to 6 Feeds report malicious data without it affecting the Oracle price. Meanwhile scripts would alerts us if even 1 Feed were to start reporting bad data or stop reporting data (censorship attack). Even if such an attack were to occur, the Oracle Security Module would delay this malicious price by one hour. As soon as the price gets submitted to the Oracle Securithy Module it would trigger alerts to the Oracle Team’s phone and email (as well as to the Foundation’s internal dev-ops team). There are governance spells ready to be enacted immediately to freeze the Oracle which are permitted to sidestep the 24 hour governance delay (this was voted in by governance earlier this year). Large MKR holders including investors would then be contacted to vote asap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.969387755102041
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#9",
                    "likes": "0",
                    "time": "17/06/2020-08:29:37",
                    "content": "What could happen is, if you have for example your alert coming from AWS platform, and we suppose there is a failure, the oasis is running on a separate instance that will not stop. From there the Oracle Team would need to have a different managed alerting system independent of each other but the api redirecting from the same platform. My question had nothing to do with the oracle team specifically, since you are a trustable member i think or a returning one, the question was mostly about the assessments of the associations. If we compare for example to Gitcoin prospectus, in their amendment everything is clear and leading or pointing at information that can return a function “Rebounding Informations” nor no presumption to must or should probably meet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.113095238095237
                }
            ]
        }
    ],
    "group_index": "2379"
}