{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-allocate-20m-to-protocol-owned-uniswap-v2-mkr-dai-lp/13150",
            "title": "[Signal Request] Allocate 20M to protocol owned Uniswap V2 MKR/DAI LP ",
            "index": 13150,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "tokenomics",
                "system-surplus",
                "sig-status-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "8",
                    "time": "09/02/2022-19:40:41",
                    "content": "Let us set up a protocol-owned automated marker maker for MKR. The idea has been around since at least the withdrawn MIP31 and was recently resurfaced by @MakerMan in a forum discussion of MKR liquidity. The simplest way to accomplish this is to add protocol owned DAI/MKR LP shares to Uniswap V2. Specifically, we will take 10M DAI from the surplus buffer and about 5k MKR from the treasury, and deposit these together into Uniswap LP shares.  Pros  Simple No need to wait on sweeping tokenomic redesigns that have had difficulty finding consensus (e.g., Sagittarius Engine, gbMKR, etc) Mostly orthogonal to MKR flap auctions  Helps identify a minimum and maximum MKR price for both flap and flop auctions Automatically buys low, sells high, and captures the spread Obtains some return on otherwise idle capital sitting in the surplus buffer Extremely gas efficient (i.e., set up and forget about it)   Cons  Potentially interferes with the ability to raise lots of DAI from MKR sales Trading strategy is practically opposite to flop auctions    Future Directions  DAI/MKR LP vault to create leveraged positions (maybe with liquidations turned off?) Potentially an attractive vehicle for long-term core unit employee compensation (i.e., DAI/MKR LP shares) A MIP (or instant access module) that provides a formula to size the LP position. The LP position should always be much smaller than the surplus buffer to try to avoid flop auctions. Upgrade the voting system to allow DAI/MKR LP shares to vote Integration into more sweeping tokeconomic redesign     Allocate 20M to protocol owned Uniswap V2 MKR/DAI LP?  Yes No Abstain     0 voters     This signal will run for two weeks and close on 2022-02-24T07:59:00Z. If support for Yes exceeds No then the question will proceed to an on-chain poll. Edit: By LFW’s request, I hereby amend this signal to end in three weeks 2022-03-03T07:59:00Z because of EthDenver. ",
                    "links": [
                        "https://forum.makerdao.com/t/framing-the-debate-on-market-liquidity-part-one-funding/13096/17",
                        "https://v2.info.uniswap.org/pair/0x517f9dd285e75b599234f7221227339478d0fcc8",
                        "https://makerburn.com/#/treasury",
                        "https://forum.makerdao.com/t/sagittarius-engine/10852",
                        "https://forum.makerdao.com/t/signal-request-gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756",
                        "https://manual.makerdao.com/parameter-index/surplus-auction",
                        "https://manual.makerdao.com/parameter-index/debt-auction",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-10-17-2022/13292",
                        "https://forum.makerdao.com/t/informal-poll-build-mkr-dai-lp-and-use-as-backstop/13183/3",
                        "https://forum.makerdao.com/t/informal-poll-build-mkr-dai-lp-and-use-as-backstop/13183",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-3-10-2022/13167",
                        "https://forum.makerdao.com/t/weekly-relay-february-8-14-2022/13239",
                        "https://forum.makerdao.com/t/mip41c4-sp34-immunefi-security-core-unit-facilitator-onboarding-is-001/14610",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/10",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-1/13758",
                        "https://forum.makerdao.com/t/monthly-governance-review-february-2022/13661",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-24-march-2-2022/13590",
                        "https://forum.makerdao.com/t/relay-semana-22-28-de-febrero-del-2022/13587",
                        "https://forum.makerdao.com/t/weekly-relay-february-22-28-2022/13499",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-17-24-2022/13425",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-febrero-del-2022/13404",
                        "https://forum.makerdao.com/t/weekly-relay-february-15-21-2022/13348",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-febrero-de-2022/13294",
                        "https://forum.makerdao.com/t/mip41c4-sp38-immunefi-security-core-unit-facilitator-onboarding-is-001/16348"
                    ],
                    "GPT-summary": "The author proposes setting up a protocol-owned automated marker maker for MKR by adding protocol-owned DAI/MKR LP shares to Uniswap V2. The post lists pros and cons and suggests future directions. The post also includes a poll to allocate 20M to the proposal. A 3-week signal will run, and if support for Yes exceeds No, the question will proceed to an on-chain poll. Some 3rd parties ask questions and provide constructive criticism of the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.261666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#2",
                    "likes": "2",
                    "time": "09/02/2022-20:42:04",
                    "content": "With the LP how much DAI we can take? What is the destiny of the DAI minted? Or are we all going to choose that direction? I’m asking cuz in growth we’ve started to think some liquidity providing plans with some partners, helping us not to depend on Market Makers and being ourselves the ones that provide liquidity and can get revenue from those strategies or actions. But lot of questions comes around this. Another thing, maybe this Signal Request already is admiting that the MKR/DAI LP is the best solution for funding, is it? Would love to see more discussion around the topic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "1",
                    "time": "09/02/2022-21:33:03",
                    "content": "Here is some color from @brianmcmichael of Protocol Engineering:  Depends on where you want the Dai to come from, but the simplest solution is to suck some Dai and deposit it + MKR into an LP position in an exec. There are some additional considerations though, like if you think the market will move in anticipation of the deposit. Might be a thing if overall liquidity is thin relative to the deposit but that’s a governance consideration more than a technical one. I guess a big problem with this is that you’d need to set an approval from the pause proxy to the uniswap router, which upon reflection is not ideal. I think I’d feel more comfortable with a separate contract that allows for MKR + Dai deposits and then permissionlessly handles deposit/withdrawal in a separate transaction. More work, but a lot safer.  Quoted from here ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "3",
                    "time": "09/02/2022-21:36:42",
                    "content": "    Lozadaluis12:  With the LP how much DAI we can take?   Let’s start with 10M and then figure it out organically through our usual bumbling governance process.     Lozadaluis12:  What is the destiny of the DAI minted?   What do you mean? This is DAI from the surplus buffer that the protocol already owns.     Lozadaluis12:  Or are we all going to choose that direction?   My goal here is to unblock the inaction that we have been mired in for years. Let’s defer all non-critical decisions to later.     Lozadaluis12:  maybe this Signal Request already is admiting that the MKR/DAI LP is the best solution   I’m not sure about that. What I’m sure about is that this is the best, simplest next step forward. We can always iterate and come up with something better later. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0852272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "3",
                    "time": "09/02/2022-21:44:00",
                    "content": "    brianmcmichael:  if you think the market will move in anticipation of the deposit   Hm, seems like there are simple mitigations available. If we go with the separate contract design, that you suggested, then we could gate deposits to Uniswap conditional on a governance controlled MKR price limit so we don’t overpay. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#6",
                    "likes": "2",
                    "time": "09/02/2022-22:32:51",
                    "content": "Just want to chime in here quickly to say I like the direction of this poll but the urgency might not get us the solution we ultimately want ( i know you don’t want us wasting time though @psychonaut !) If it helps, I think the best approach is to march towards a CU that operates these types of positions like Maker’s own desk. With a mandate to preferably automate their management away or disband after a couple of years. I would imagine we’d also want to try different platforms than just Uniswap v2 as well.     psychonaut:  Trading strategy is practically opposite to flop auctions    this is the main concern and why I’m advocating for “humans first, machines soon.” ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782/67"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#7",
                    "likes": "3",
                    "time": "09/02/2022-22:42:50",
                    "content": "    twblack88:  i know you don’t want us wasting time though   Yeah, suppose we earn 5% on the 20M position. That’s 1M DAI per year of profits, and we’re improving liquidity at the same time.     twblack88:  this is the main concern and why I’m advocating for “humans first, machines soon.”   I believe the position size I’m proposing is small enough not to interfere much with flop auctions, but also large enough to provide a real improvement in on-chain liquidity. When I checked just now, the LP has $216.95 of total liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.39047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#8",
                    "likes": "3",
                    "time": "10/02/2022-00:56:55",
                    "content": "    psychonaut:  The simplest way to accomplish this is to add protocol owned DAI/MKR LP shares to Uniswap V2. Specifically, we will take 10M DAI from the surplus buffer and about 5k MKR from the treasury , and deposit these together into Uniswap LP shares.   so reduce the surplus buffer by 16%? boy what a way to circumvent the flapper. Personally i think this should be funded exclusively out of treasury funds assuming you want to do it. Either through something like a AAVE loan with MKR as the backing collateral or a direct sale of your MKR. I.e you take 10K MKR sell half for DAI and then use that to make your liquidity pool. Also why 20MM? Also also why a V2 pool? Why not a gelato pool on v3? ",
                    "links": [
                        "https://makerburn.com/#/treasury"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.888888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#9",
                    "likes": "1",
                    "time": "10/02/2022-03:26:27",
                    "content": "I like this idea, but 20000000 dai is 1/3 surplus buffer. Is the maker not already undercapitalized? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "4",
                    "time": "10/02/2022-05:03:13",
                    "content": "    Andy_McCall:  Personally i think this should be funded exclusively out of treasury funds assuming you want to do it. Either through something like a AAVE loan with MKR as the backing collateral or a direct sale of your MKR. I.e you take 10K MKR sell half for DAI and then use that to make your liquidity pool.   Using Aave would involve more smart contract risk. Also, couldn’t Aave liquidate the loan if MKR price dropped? As for taking 10k MKR and selling half for DAI, how would you do that slowly without moving the market price? And it’s more complicated. You’d probably need to delegate this to a human trading desk. That’s possible to do, but it would take a lot more time to set up. Using the surplus buffer is technically the simplest solution.     Andy_McCall:  Also why 20MM?   Dunno, it seems like we can afford to withdraw another 10M DAI from the surplus buffer. Oracles did it recently and nothing broke. Certainly you don’t want to go much bigger than 10M DAI because we need some surplus buffer to avoid flops.     Andy_McCall:  Also also why a V2 pool? Why not a gelato pool on v3?   I think the V2 pool is technically easier to access with a non-interactive script. I’m trying to think of a way to do this that would involve writing as little code as possible. V3 also has a lot more smart contract risk than V2. I’m thinking V2 because that’s the conservative choice.  To sum it up, I know that Uniswap V2 probably is not ultimately the best way to invest part of our treasury, but it is:  Simple Won’t take a lot of time to write the code or audit the code Doesn’t introduce a lot of smart contract risk Doesn’t need us to recruit and hire anybody Doesn’t need babysitting. It’s mostly automated already Is relatively conservative Offers immediate benefits without adding that much risk Is easy to unwind once we are ready to move to something better  ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.714006696428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#11",
                    "likes": "5",
                    "time": "10/02/2022-10:32:11",
                    "content": "    twblack88:  If it helps, I think the best approach is to march towards a CU that operates these types of positions like Maker’s own desk. With a mandate to preferably automate their management away or disband after a couple of years. I would imagine we’d also want to try different platforms than just Uniswap v2 as well.   do we really need to have a dedicated CU for this? operating a univ2-position is not a big deal. i’d like to avoid we really need to manage stuff like this in a way we would need to have a lot of human power on it. if we really need to have some CU caring about this, imho it would fall more into the territory of @strat-fin-core-unit - but no idea if @Aes is even interested on taking care… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#12",
                    "likes": "3",
                    "time": "10/02/2022-10:39:05",
                    "content": "    psychonaut:      Andy_McCall:  Also why 20MM?   Dunno, it seems like we can afford to withdraw another 10M DAI from the surplus buffer. Oracles did it recently and nothing broke. Certainly you don’t want to go much bigger than 10M DAI because we need some surplus buffer to avoid flops.   we could also think about having a (whitelisted only for the protocol) uniV2-mkrdai-ilk - by that the amount of DAI we need to remove from system surplus is heavily reduced as we can put the LP as collateral (credits to @Patrick_J ) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.014285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#13",
                    "likes": "4",
                    "time": "10/02/2022-11:20:57",
                    "content": "I ended up voting “no” to the proposal. While I do think establishing such a pool has merit these are the most important objections I have to the current proposal:  Financing this from the surplus buffer Insufficient elaboration on expected returns and risk Undermines flop auctions which is our capital of last resort.  Let’s start with financing. The surplus buffer is much debated. The general consensus seems to be that it is currently too small. In fact right now there are people arguing that the current limit of 250M is not only right, but should probably be even higher. I do not share that view, but I do share the view that the surplus buffer has a role to play as the first line of defense against bad debt. As such we need it to be liquid at a moment’s notice. That means any use of it should be unwindable instantly, and with close to zero expectation of loss. To add to this, as was pointed out in this proposal, the amount it contains was recently lowered by 10M. These funds went to making sure fundamental operations of the protocol continues to function. That reduction is reason enough in itself to worry and is the opposite of an argument to lower it even more. A much more sensible approach would be to divert all the funds from the MKR treasury and convert half of it into DAI. As of writing MakerDAO has a return on capital of around 4,5%. That means that any new venture we want to finance should have a reasonable expectation of matching that for the same risk level. From the discussion a figure of 5% is presented but with no elaboration of where this is coming from or any data to back it up. A liquidity pool can also not only be assessed by the fees it generates but also on what the chances are of impermanent losses becoming actual losses. I fail to find any information about the expectations and estimations for potential losses. Lastly the setup of this pool runs reverse to our flop auctions. This may not be a big problem, but I would like to see a more thorough analysis of expected effect on flop auctions. Flops are our last resort of raising capital and if this makes even a tiny chance we will be unable to raise enough capital in a black Thursday type event, it would be terribly irresponsible to go through with this. Lastly I want to say that this post might come across as a bit negative. As I stated at the start, I think this idea has merit, but we should do a little more research before we actually allocate any funds to such a project. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.150682242594007
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#14",
                    "likes": "2",
                    "time": "10/02/2022-13:10:21",
                    "content": "    Andy_McCall:  Also also why a V2 pool? Why not a gelato pool on v3?   v3 does not have good properties.   Sure it has a manager but if the market moves too far too fast you can’t easily manage the liquidity in this properly. The v2 is going to sit quietly acting as a liquidity arb source and compound fees ‘automatically’. It will always have some liquidity available at whatever price.   No manager, or network access required and zero hazard manager loses control during a sharp price move. Because of the above it is also more network efficient. As to the amount I agree it is arbitrary but we were talking about handing over 10K MKR to windermute and we want liquidity right?  10K (or 1% isn’t an unreasonable start).    The point here is the more LP one supplies the greater chance it will be used, earn fees, and start sopping up MKR. Realize to get at the first 5K of MKR in this LP (if 10K is paired and deposited) will take a 4x price rise (the LP value will only grow by 1/2).  Similarly the price of MKR has to drop 75% before 1/2 the DAI is freed and the value here only drops by 1/2. The last 10% of the MKR in this contract only becomes accessible if the price rises about 100x. Also NOTHING needs to be done to manage this, these Uniswap v2 50:50 LP vaults when filled with TOKEN-STABLECOINs have extremely useful properties when looked at from a DAO perspective. (i.e. if this LP ends up just being there permanently into the future).  If Maker earns even 2-3%/yr on this LP it is a win both from a profit sense and a liquidity providing one. People seem to be massively hot to just spend DAI to burn MKR when we can put up the DAI with MKR and provide liquidity for a market and earn some return doing it? Seems like a better use of MKR and DAI at this point to provide desperately needed MKR:DAI liquidity for trading. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.978174603174603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#15",
                    "likes": "14",
                    "time": "10/02/2022-13:29:37",
                    "content": "Couple of notes about this signal. Firstly, if this does go on-chain, it will go on in the ‘investigate’ format. IE: “Investigate Allocation of Protocol Owned Liquidity to Uniswap V2” This is because:  We’ve never done this before. We have not had any formal risk or technical evaluations as to how safe this is, and how it will affect other aspects of the protocol. We don’t know what the technical solution will look like, nor how long it will take.  I would also appreciate if we could extend the run-time by a week or so given that ETHDenver is going to distract a lot of the community from the forum and governance stuff. It would also be great to get some input from @Derek on behalf of PE at some point. In case they are able to provide any information at this stage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.171875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#16",
                    "likes": "2",
                    "time": "10/02/2022-16:01:23",
                    "content": "    LongForWisdom:  I would also appreciate if we could extend the run-time by a week or so given that ETHDenver is going to distract a lot of the community from the forum and governance stuff.   Good idea. Done. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#17",
                    "likes": "4",
                    "time": "10/02/2022-17:22:56",
                    "content": "A few items from an ALM perspective. Allocating 10M DAI and $10M MKR to an LP would not change the MakerDAO balance sheet per see at t=0 if we use a look-through approach.  While it would increase the amount of DAI by 10M, it would not have a second-order effect on the USDC PSM as those DAI would still be owned by MakerDAO (indirectly through the Uni LP). Same for the MKR part.  From a smart contract perspective, it could lead to a reduction of 10M of the Surplus Buffer (as expected here) or an increase of 10M of the Surplus Buffer if this position would be added as a PSM-like component. It would increase DAI outstanding by 10M. Nevertheless, it would lead to a significant asset risk due to exposure to MKR which is up to 10M (the DAI part of the LP). Obviously, the correlation between the MKR and the “bad situation at MakerDAO where we need the SB” is quite high. Here are some stats of the MKR/ETH LP. I would assume that an MKR/DAI would be having a similar APY (a bit better due to the lower correlation between MKR and DAI, a bit less because people are mainly trading with ETH). Notice how the liquidity was decreasing (this is with a constant v3 LP at 15M, Sushi is 18M also decreasing sharply).  image1796×540 54.3 KB  So overall, this allocation is most likely not a good risk/reward. Nevertheless, it is good for solving the MKR liquidity issue and a good step to get non-loans assets under MakerDAO balance sheet (but one that doesn’t move the needle and is not scalable). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5964285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#18",
                    "likes": "0",
                    "time": "10/02/2022-17:59:27",
                    "content": "    SebVentures:  it would lead to a significant asset risk due to exposure to MKR which is up to 10M (the DAI part of the LP).   Can you unpack this? Can you walk us through what specific sequence of events you imagine and the corresponding effects? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#19",
                    "likes": "1",
                    "time": "10/02/2022-19:19:36",
                    "content": "    JustinCase:  A liquidity pool can also not only be assessed by the fees it generates but also on what the chances are of impermanent losses becoming actual losses. I fail to find any information about the expectations and estimations for potential losses.   Impermanent loss refers to the situation where the value of the LP position is lower than the value of the same original assets held outside of the LP. The protocol can keep the LP position indefinitely and never exit. Hence, any impermanent losses need never become actual losses.     JustinCase:  I would like to see a more thorough analysis of expected effect on flop auctions.   Hm, let’s see if I can spell out some scenarios. Suppose we need to flop. MKR is being sold at auction. As before, the MKR can be bought by investors. However, once the auction settles, the MKR could be held as an investment, but could also be sold back to the Maker protocol via Uniswap. The surplus buffer will be replenished as usual, but the LP position will also become depleted of DAI and accumulate MKR (opposite trade). Since the surplus buffer and LP position are independent and separate, they will not interfere with each other, but DAI can flow from the LP position to the surplus buffer via auction participants. It bears noting that the DAI in the LP does not consist of only the DAI placed there by Maker but it is from all the investors to the Uniswap LP pair. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.102941176470588
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#20",
                    "likes": "2",
                    "time": "10/02/2022-19:55:42",
                    "content": "    psychonaut:  Impermanent loss refers to the situation where the value of the LP position is lower than the value of the same original assets held outside of the LP. The protocol can keep the LP position indefinitely and never exit. Hence, any impermanent losses need never become actual losses.   So this is intended as a permanent position. In that case we should evaluate it against what timeframe it takes to make back the whole initial investment.     psychonaut:  Hm, let’s see if I can spell out some scenarios. Suppose we need to flop. MKR is being sold at auction. As before, the MKR can be bought by investors. However, once the auction settles, the MKR could be held as an investment, but could also be sold back to the Maker protocol via Uniswap   I see I failed to communicate my point properly. What I am looking for is more calculations on what magnitude this is expected to change MKR price for better or worse. Also, in a situation where the LP is fully depleted of DAI would it not be reasonable to expect to need to top it off with more DAI to make it liquid again? To me it would be prudent to model these different scenarios and put some numbers on them to give us a more solid foundation before moving forward with implementation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.56875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#21",
                    "likes": "6",
                    "time": "10/02/2022-20:02:59",
                    "content": "Please let’s not have a separate Core Unit for this. The cost of operating another Core Unit will be greater than potential benefit we get. Maintaining LP position without consideration for impermanent loss is easy that even DeFi beginner can do it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#22",
                    "likes": "1",
                    "time": "10/02/2022-20:07:12",
                    "content": "    JustinCase:  What I am looking for is more calculations on what magnitude this is expected to change MKR price for better or worse.   Why would the LP have any effect on MKR price? Establishing the LP should be MKR price neutral.     JustinCase:  Also, in a situation where the LP is fully depleted of DAI would it not be reasonable to expect to need to top it off with more DAI to make it liquid again?   How could the LP be fully depleted? It sounds like you don’t understand how Uniswap LPs works. Maybe start here?     JustinCase:  In that case we should evaluate it against what timeframe it takes to make back the whole initial investment.   Uniswap LP return is determined by trading volume and how much the future price differs from the initial price. Certainly we can predict that the future price of MKR will be a lot higher than the current price, potentially causing some impermanent loss. On the other hand, trading volume of MKR should increase as it becomes more liquid and attracts more investment interest. So  It’s not clear that this is the best metric though. The 5k MKR that is sitting in the treasury is not circulating and does not really affect the value or market cap of MKR. If this 5k MKR is locked into the LP then it will be traded using a buy low sell high strategy. There were some suggestions from PE during today’s G&R call that the DAI trapped in the LP position might be financially engineered, using a vault or PSM-type thing, back into surplus buffer DAI. So it’s not clear to me that we should value the LP position as a normal investment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7014976958525345
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#23",
                    "likes": "2",
                    "time": "10/02/2022-22:02:54",
                    "content": "    psychonaut:  Why would the LP have any effect on MKR price? Establishing the LP should be MKR price neutral.   Because of this:     psychonaut:  Trading strategy is practically opposite to flop auctions    When we introduce two mechanisms working together it is useful to map out how that interaction plays out under various scenarios. The reason I’m bringing up a LP depleted of DAI is because this would be a scenario with a severely depressed MKR price. Not only would we have spent our surplus buffer covering bad debt but we would also been forced to mint new MKR tokens and sell them, furthering driving down the price. A price recovery in the short term is not to be expected. Also my choice of words were based on the following statement from your previous post:     psychonaut:  The surplus buffer will be replenished as usual, but the LP position will also become depleted of DAI and accumulate MKR (opposite trade).   I think in some respects this discussion might be a little premature. From other posts it seems that if this SR passes it is not going to result in direct implementation, but rather to further exploration by other CUs. From my perspective the base idea is worth exploring, but it probably have to go through a few iterations to make sure it’s safe and profitable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.725328282828283
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#24",
                    "likes": "6",
                    "time": "10/02/2022-22:04:40",
                    "content": "I don’t think maker should waste time or money on this. Make the business better (too many expenses already!!) and make more profits. Then a big market will develop for the token. Focus on business. Do not focus tokenomics ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "3rd party giving entirely negative feedback on proposal",
                        "None"
                    ],
                    "Sentiment": 6.581250000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#25",
                    "likes": "0",
                    "time": "10/02/2022-22:09:45",
                    "content": "To this point, who would be responsible for the performance and management of this proposal? What are the projected costs? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#26",
                    "likes": "1",
                    "time": "10/02/2022-22:31:55",
                    "content": "    MadShills:  who would be responsible for the performance and management of this proposal?   There are no ongoing costs. Uniswap manages itself. There would be an initial small investment from PE to get things set up. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#27",
                    "likes": "2",
                    "time": "10/02/2022-22:36:12",
                    "content": "So nobody will be monitoring the performance of it? Seems like     psychonaut:  No need to wait on sweeping tokenomic redesigns that have had difficulty finding consensus (e.g., Sagittarius Engine, gbMKR , etc)   is both a pro and con. There is no clear understanding of how this tactic will fit into a broader strategy because there is not yet agreement on a tokenomics/burn strategy. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#28",
                    "likes": "3",
                    "time": "11/02/2022-04:37:10",
                    "content": "I think the protocol should build and own a MKR/DAI LP, but can’t support immediately throwing this large chunk of the surplus buffer into it. Building this LP should be one component of a self-regulating system that also contemplates when to withdraw liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.035714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#29",
                    "likes": "8",
                    "time": "11/02/2022-10:54:26",
                    "content": "I voted no because I doubt we will gain much from this. MKR is a relatively liquid asset compared to other similar tokens, for example MKR is more liquid than UNI or YFI on-chain, see the slippage below.  740×335 45 KB  Currently there is 2775 ($6.2m) in Univ2, 5415 ($12.1m) in Univ3 (relevant for buying MKR), 3615 ($8.1m) in Sushi, 5894 ($13.2m) in Balancer and about $7m of liquidity in Bancor, totaling to about $40m MKR liquidity. Is adding $10m or 25% really going to change the situation significantly? We can’t be sure that we will actually profit from providing this liquidity, we can easily lose to impermanent loss, as MKR is not a high trading volume token and there are already many existing trading pools and pairs, so it is questionable if trading fees will be greater than IL. Generally holding a low trading volume asset will outperform LPing return in the case where the asset appreciates in price. The protocol owned liquidity in the form of LP is a good way to lose everything you have in the case of an emergency. We should hold our non-MKR part of capital in the treasury separated from MKR. If MKR goes to 0 and we do MKR/DAI, we lose everything in that pool. There are also better yielding opportunities for DAI than MKR/DAI LP. Dai in surplus buffers is there to cover potential losses and enable us to be more aggressive towards new products, such as Multichain strategy, D3M, etc. Higher SB directly leads to higher revenue from these new products so the dai is not being idle. I also think there should be a more long-term strategy developed for surplus buffer usage and management in general. This proposal seems a bit random without a solid added value proposition compared to having a higher level of protection to me. We would be spending ⅓ of our current surplus towards this, while we should be building it up, to support a more aggressive approach towards new stuff that has been in development for some time now and will be in production soon, that will generate growth and new cash flows. ",
                    "links": [
                        "https://etherscan.io/address/0xe8c6c9227491c0a8156a0106a0204d881bb7e531",
                        "https://etherscan.io/address/0xba13afecda9beb75de5c56bbaf696b880a5a50dd",
                        "https://etherscan.io/address/0xba12222222228d8ba445958a75a0704d566bf2c8",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-february-2022/13512"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.881419457735247
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#30",
                    "likes": "3",
                    "time": "11/02/2022-18:58:46",
                    "content": "Pointing out that threads like this are what maker awesome. Anyways here are some themes:  Profitability Shout out @rema  for running the numbers faster than all of us. Looks like if we want to deploy MKR pairs, or any protocol-owned liquidity, we have to signal & come to a consensus on all the edge cases (to reduce the load on PECU plus have a clear objective). Additionally, we’d have to run the simulations for profitability, which I think is a bit more important than liquidity at the moment especially with SB where it is now.  Desks?     Doo_StableLab:  The cost of operating another Core Unit will be greater than potential benefit we get.   Fair point! The only reason I suggested that was because arbitrageurs source most of the profits in today’s environment (v2 is easy yes, but there is liquidity and platforms all over the place). That breadth was why I suggested a Maker desk. Seed the desk, but make that team manage the inventory and the platforms. Returning some profit share and gaining liquidity along the way for select pairs seems like less effort on PECU. In addition, they can grow select domains, CEX & DEX throughput on DAI pairs, etc. Doesn’t have to be a core unit, it’s just the ool we got. My exchange experience/bias is showing, forgive me.  Experiments? Perhaps I might be spoiling the soup but a starter experiment we might do, at least for hands-off LP management via v2, is with ENS:DAI LP? (s/o to @PaperImperium and @MakerMan ) We could signal for that on a different vote, see the effort and trade-off, hash out if it’s feasible, and see the changes in the wild. Plus in addition, we’d have an analog for measuring profits. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.231770833333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sirverik",
                    "index": "#31",
                    "likes": "2",
                    "time": "14/02/2022-19:45:48",
                    "content": "I think using our capital to provide liquidity for MKR does not provide any real value to the MKR token or makerDAO. The value of the token is determined by the underlying asset. The market can do price discovery on it’s own. Having less efficient price discovery does not really affect the DAO. Accumulating DAI for future operating expenses or burning MKR is a much better use of funds. Plus, I am really against doing anything that would couple volatility with risk. Impermanent loss is such a thing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.770833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#32",
                    "likes": "6",
                    "time": "15/02/2022-10:30:31",
                    "content": "    psychonaut:      SebVentures:  it would lead to a significant asset risk due to exposure to MKR which is up to 10M (the DAI part of the LP).   Can you unpack this? Can you walk us through what specific sequence of events you imagine and the corresponding effects?   So the idea is MakerDAO can always mint DAI and MKR. Minting DAI is creating a liability on ourselves (which is a no-op) and minting MKR creates some equity which is accounted for in a mark-to-market way. Again kind of a no-op. We can merge those to generated assets in a Uni V2 MKR/DAI position. I’m arguing that you should always net the token under your control (DAI and MKR) on the balance sheet (in a look-through way if needed). So it doesn’t take space in the balance sheet and doesn’t impact anything really. It’s more of an off-balance sheet position. But let’s keep it on-balance sheet as it is easier to understand.  If you prefer a technical way, you can suck 20M DAI from the Surplus Buffer and buy $10M MKR to ourselves (putting 10M back in the Surplus Buffer), creating the LP and add this LP to a PSM-like contract that will give you back 20M DAI that can be used to refill the PSM. You end up with an SB 10M bigger. So both in the accounting method and the technical method, you end up with a 10M bigger SB and 10M bigger DAI debt. The amount of MKR outside the control of MakerDAO didn’t change. Perception of the market could change as there is now $10M MKR at risk to be in the market. I doubt it will have much of an impact. Now, what happens if the price of the LP changes (due to the MKR price or fees)? If the price of the LP goes down by 67% we will incur a 13.3M loss. Net of the 10M increase in SB, it is a 3.3M loss to the initial surplus buffer. There will be 6.7M DAI released on the market that will reduce the PSM (not important). If we unwind the position (and remove the MKR) the loss will be 6.7M.  image699×446 7.13 KB  On the other hand, if the price of the LP increases by 10%, we will get an increase of 2M of the Surplus Buffer. But again, if we unwind the position, the MKR position being increased, the net profit will be only 1M.  So overall, a 20M MKR/DAI LP position will expose to a 10M notional risk linked to the price of such LP. It is not a 20M exposure due to the fact that we are using MKR which can be minted (or taken from DSPauseProxy). And MKR should be deducted from the asset side at market price. So if we assume to play safe and use an asset risk capital need of 10M, the RoE would be 10% (5% return over 20M allocated capital). Probably not optimal but not the end of the world. It seems as well that such a position is counter-cyclical in the sense of the amount of MKR in circulation is being reduced when MKR price fall and increased when MKR price increase. But the impact is hard to think of. I will explore more if this signal gets traction, but overall, I don’t think this idea is costing a lot. It should be assessed on the strategic value of higher MKR liquidity and developing PCV first, the former being quite debated in this thread (and for months now). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.318253968253969
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#33",
                    "likes": "1",
                    "time": "15/02/2022-15:52:38",
                    "content": "This seems like a very clear explanation. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#34",
                    "likes": "2",
                    "time": "03/03/2022-19:02:16",
                    "content": "I voted No. We need the surplus buffer to go higher! Also, I sense a general theme across the community of frustration with the friction and patience required to implement long-term solutions. Every attempt to grab “low-hanging fruit” or do quick “temporary” measures dilutes our focus and the potency we need as a community to navigate this massive decentralized ship. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.869791666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#35",
                    "likes": "3",
                    "time": "03/03/2022-19:12:49",
                    "content": "The signal is closed. No obtained the strongest support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#36",
                    "likes": "0",
                    "time": "03/04/2022-05:13:25",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}