{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/using-tranches-to-insure-against-defaults-of-real-world-assets-and-providing-an-extremely-stable-asset/1286",
            "title": "Using tranches to insure against defaults of real world assets and providing an extremely stable asset ",
            "index": 1286,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "centrifuge"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#1",
                    "likes": "8",
                    "time": "16/02/2020-19:23:32",
                    "content": "I want to introduce a new feature we’ve been working on: a structured finance product for DeFi We allow all sorts of asset originators to create portfolios of loans and issue an ERC20 token against them that represents a claim on the underlying assets. You could imagine a factoring business minting several NFTs that each represent an invoice that a supplier wants to borrow money on. Those NFTs are put into escrow in our contracts and we allow investors to lend money to the borrowers by buying an ERC20 token that is minted for this portfolio. We’ve done first pilots of these assets together with the Maker Foundation last summer and are now getting ready to release our new version of our Tinlake contracts. One of the new product features we added is the two tranche structure. I’ve explained how the two tranches work in Tinlake in a post I published here. I believe this is a very interesting property for Maker and I’ll go into some of the benefits: Skin in the game and expert investors We imagine the asset originators to invest in the junior tranche tokens (we call them Tin) to signal a certain amount of confidence in their assets. This gives the asset originator some skin in the game and creates a strong incentives for asset originators to not add bad quality assets to the portfolio. First loss covered by the junior By using the senior tranche tokens (we call them Drop). If there is a loss, say one of the invoices in the portfolio is a complete default, the Tin token holders will loose their investment first. Our contracts guarantee that the Drop token investors will recoup their investment + interest rate before returning any funds to Tin holders. Lower collateralization ratio and/or lower stability fees The “insurance” the Drop investors get by having the Tin investors take any first loss means that the the collateralization ratio can be lowered significantly without any extra risk (as opposed to not having two tranches). We’ve designed our Tinlake contracts with the DeFi ecosystem in mind. We’ve built these two tranches because we think that it elegantly solves the skin-in-the-game issue and allows for a higher collateralization ratio that is many times wanted by a real world assets. I’d love to hear your thoughts and feedback. Our goal is to allow our users (the asset originators) to have the most attractive MCD collateral out there. WDYT? For anyone that is interested, I’m hosting a video call walking through how our contracts work. I’ll be going into how we built the tranches and other stuff. Please attend and drill us with hard questions. Feb 25th at 9am PST/6pm CET: Add to Google Calendar  ",
                    "links": [
                        "https://calendar.google.com/calendar/r/eventedit?text=Centrifuge+Community+Call+%233&dates=20200225T170000Z/20200225T180000Z&details=For+details,+link+here:+https://www.eventbrite.de/e/centrifuge-community-call-3-tickets-93849916627&location=https://zoom.us/j/383082272&sf=true",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-february-27-9am-pst-5-00-pm-utc/1365/2",
                        "https://forum.makerdao.com/t/centrifuge-maker-a-partner-s-view-of-real-world-assets/17439"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.820664550503261
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "4",
                    "time": "16/02/2020-20:30:21",
                    "content": "This sounds great. It’s been more than two months since the release of MCD. I’ve been eagerly awaiting new assets types. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.393939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/02/2020-09:22:16",
                    "content": "This is a highly interesting proposal. I am delighted and encouraged by reading about the creativity in the ecosystem. Some questions:  How will Tin and Drop be traded? Exchanges or Uniswap solutions? How do you prevent scams? A fake real estate project could generate worthless Tin which would lead to worthless Drop which again might impact the Dai ecosystem. There is a QA story here that is missing. How do you scale this? How does the system differentiate, if at all, between Tin/Drop for German real estate and Tin/Drop for athlete funding and Tin/Drop for beauty pageant funding? Can multiple entities make use of the Tin/Drop system or is this a proprietary solution for Tinlake use only? At what level is there an ethical screening for undesirable collateral?  My apologies if I have misunderstood anything. EDIT: would it be possible to have multiple Tins matching to a single Drop? In this way you could offload tons of risk to the issuer while keeping Maker governance overhead to a minimum? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.809523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "17/02/2020-10:33:37",
                    "content": "Hi Spin, thanks for making this post. I’ll leave the discussion to those that are more familiar with these concepts, but I just wanted to make some points / questions with regards to the mentioned video call.  Will the call be recorded? Some members of the community may be unable to make the call, it would be great if there was a public recording that could be viewed at a later date. In a similar vein, if we post questions in this thread, can they be addressed in the call and answered asynchronously?  Edit: Actually I do have a question.  Would centrifuge aim to have both Drop and Tin available in MCD for use as collateral, or only drop?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.806818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#5",
                    "likes": "3",
                    "time": "17/02/2020-14:01:44",
                    "content": "Answering some of your questions below. Thanks for the feedback!  How will Tin and Drop be traded? Exchanges or Uniswap solutions?  An asset originator would create the Tin and Drop token contracts for their particular asset class and would have to make their own efforts to list them on exchanges. There are legal considerations of course but that is out of scope for this thread.  How do you prevent scams? A fake real estate project could generate worthless Tin which would lead to worthless Drop which again might impact the Dai ecosystem. There is a QA story here that is missing.  This two token setup can’t prevent a complete exit scam. If the asset originator manages convince the community that an entire portfolio is worth something but it is not, then of course neither Tin or Drop will be worth something. The fraud risk that is somewhat protected though would be if the asset originator itself gets defrauded and some of the asset they are adding to the pool are worthless. In that case provided the loss is less than the % of investment in Tin, it would not affect Drop.  How do you scale this? How does the system differentiate, if at all, between Tin/Drop for German real estate and Tin/Drop for athlete funding and Tin/Drop for beauty pageant funding?  Yes, we imagine asset originators will deploy an instance of Tinlake for each asset class. Each instance of Tinlake will have it’s own two tokens. Similar to how each asset in Compound has it’s own c-Token. Each pool at deployment will have a minimum ratio of Tin to Drop set. This will enforce that any investor in Drop will be covered by some minimum amount of investment in Tin.  Can multiple entities make use of the Tin/Drop system or is this a proprietary solution for Tinlake use only?  The contracts are of course open source. How the money flows between these two tokens is pretty tied to the rest of the Tinlake contracts. So the easiest way to use it is to create your own deployment of the Tinlake contracts.  At what level is there an ethical screening for undesirable collateral?  There are two levels at which this can happen. Tinlake allows multiple borrowers to borrow money from that pool. How those borrowers get their loans added to Tinlake can be controlled by automated oracles determining the price of the NFT collateral or it could be a manual process by the asset originator. In either case, this is where the most important selection has to happen. The better the individual loans are curated the higher the value of the pool. There is a second level though, an asset originator could create an entire pool that as you call it would be “unethical”. We can’t stop an “unethical” asset originator to deploy and create their own pool. So in that case it would be the MKR holders that would have to vote against inclusion of their Drop token in MCD.  would it be possible to have multiple Tins matching to a single Drop? In this way you could offload tons of risk to the issuer while keeping Maker governance overhead to a minimum?  Are you talking about different assets with their own Tin tokens but only minting one Drop token against it? Technically this is possible with a little bit of overhead. I would be curious to know from the community if they are comfortable with a Drop token that has several different asset types blended in. I think at first, our goal will be to keep things simple I think.  Would centrifuge aim to have both Drop and Tin available in MCD for use as collateral, or only drop?  I think Drop is better suited for MCD as it is the more stable and easier to price asset. So we believe that’s the better candidate. If you have any questions for the call, please do post them here and we can address them in the call. We’ll make a recording available publicly after the call, I’ll post the link here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.591322055137845
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "0",
                    "time": "17/02/2020-14:13:00",
                    "content": "    spin:  I would be curious to know from the community if they are comfortable with a Drop token that has several different asset types blended in   It would be good to get some pros/cons around taking this approach. From our end, having a single collateral type makes our lives easier. However, it could cause issues if the balance of assets in the ‘combined Drip’ changed significantly without Maker being made aware of the change (and having the chance to change risk parameters.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.970982142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#7",
                    "likes": "0",
                    "time": "18/02/2020-04:25:44",
                    "content": "I see where you’re coming from. I think our goal for now is to standardize as much as possible around the different asset types: the technical framework, legal framework, things like oracles and so on. Our goal is to be able to bring many completely different assets to MCD under one umbrella. This has the advantage that it hopefully greatly reduces the governance overhead. I think at least in the beginning though, it’s probably better to decide asset by asset on the specific risk parameters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#8",
                    "likes": "2",
                    "time": "19/02/2020-12:58:18",
                    "content": "I find this interesting considering my company has also been developing derivatives to make MakerDAO more accessible. What we do is we take 1 DAI holder and 1 Vault user and connect them through a derivative contract. Then if DSR goes higher then the “Forward Rate” (what they agree to) Dai flows down into the vault. Then if the DSR is too low, DAI flows out of the vault into the account of the Dai user. In short it keeps the Vault at a stable DSR rate, and the DAI holder earns a steady amount of interest on their Dai. Would your users be interested in using something like this alongside Tinlake? The advantage would be that the people that are receiving capital from MakerDAO don’t have to worry about the DSR getting hiked on them as they are protected via this contract. The more important point is that if you are interested in scaling MakerDAO Dai supply, my solution helps a lot. Consider: if you start with these new collateral types ands there is demand from borrowers - who will buy all the new Dai? With our contracts you can do a placement of the Dai as a fixed rate fixed income instrument. It helps a lot to stimulate Dai demand. (selling Dai at fixed % income) Let me know. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.061423054070113
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#9",
                    "likes": "1",
                    "time": "20/02/2020-10:03:45",
                    "content": "@Akiva enabling fixed rate Vaults would be highly beneficial for the Maker community as it could entice wider adoption of DAI. Why don’t you reach out to Maker business development mailto:[email protected] and present your idea in more detail? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#10",
                    "likes": "0",
                    "time": "25/02/2020-02:36:17",
                    "content": "Are there any other questions on our Tin and Drop tokens from the Maker community? Please don’t hesitate to join the community call we are hosting tomorrow (see below) and I can answer them there. If you post in this thread and I’ll gladly answer them here or address them in the call. We also just released a more technical documentation that we just released. It goes into more details on how the contracts work: https://developer.centrifuge.io/tinlake/overview/introduction/ Community call details: Feb 25th at 9am PST/6pm CET on zoom -   Add to Google Calendar  ",
                    "links": [
                        "https://zoom.us/j/383082272",
                        "https://calendar.google.com/calendar/r/eventedit?text=Centrifuge+Community+Call+%233&dates=20200225T170000Z/20200225T180000Z&details=For+details,+link+here:+https://www.eventbrite.de/e/centrifuge-community-call-3-tickets-93849916627&location=https://zoom.us/j/383082272&sf=true"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#11",
                    "likes": "0",
                    "time": "25/02/2020-07:40:00",
                    "content": "Please record the meeting and make it available as I am sure many people are interested but are not able to attend. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#12",
                    "likes": "0",
                    "time": "25/02/2020-11:53:56",
                    "content": "    spin:  Are there any other questions on our Tin and Drop tokens from the Maker community?   I think there is huge interest from the community in onboarding new assets. In my opinion, the bottleneck is whether Maker developer feel ready to take the next step. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#13",
                    "likes": "0",
                    "time": "25/02/2020-16:19:37",
                    "content": "This is taking place at the same time as the weekly Maker Community Call. Unfortunately it will likely split the attendance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#14",
                    "likes": "2",
                    "time": "26/02/2020-18:46:16",
                    "content": "We’ve uploaded the recording of the Centrifuge Community Call yesterday to youtube: https://youtu.be/aXnpEcZHJIM If you want to look at the slides, they can be found here: https://docs.google.com/presentation/d/1_2D-0QP6e5WLXEXpOI4-UWuNxMKvVmiIWuHwUnfOAHQ/edit#slide=id.g527ae7c3a8_0_18 There were a lot of good questions by a few Maker community member, thanks a lot for joining! We will also spend some time doing further write-ups on certain topics that I’ll share on the forums. I know we weren’t able to address everything in detail. ",
                    "links": [
                        "https://docs.google.com/presentation/d/1_2D-0QP6e5WLXEXpOI4-UWuNxMKvVmiIWuHwUnfOAHQ/edit#slide=id.g527ae7c3a8_0_18"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.220238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#15",
                    "likes": "3",
                    "time": "27/02/2020-14:34:44",
                    "content": "Just watched through, interesting stuff. Looking forward to seeing more write ups that you mentioned. I hadn’t realised you guys were so close to launching or that you had so many different partners lined up. Congratulations! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                }
            ]
        }
    ]
}