{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/2022-03-25-adding-support-for-the-new-tusd-implementation-address/14189",
            "title": "2022-03-25 - Adding Support for the New TUSD Implementation Address ",
            "index": 14189,
            "category": [
                "Updates"
            ],
            "tags": [
                "executive"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "6",
                    "time": "24/03/2022-13:55:54",
                    "content": "TL;DR: The recent change to the TUSD contract has effectively locked users’ collateral in the Maker protocol, this executive action will allow users to interact with their vaults again. Huge thanks to @talbaneth and Protocol Engineering for the write up!  Adding Support for the New TUSD Implementation Address  Executive Summary The upcoming executive vote will contain support for the new TUSD implementation contract (0xd8D59c59Ab40B880b54C969920E8d9172182Ad7b), which will allow resuming of TUSD collateral operation. This is a preliminary step that will allow vault owners to withdraw their collateral (if they wish to do so) as part of the TUSD offboarding process. Although the reasoning for this change was communicated in an ongoing forum thread, this post aims to summarize the issue.  Issues Addressed Since the TUSD contract is upgradeable, its actual implementation contract may change. As part of the Maker collateral integration, a security measure was added to the GemJoin contract that disables the ability to insert or withdraw collateral if that implementation contract changes. In such a case the Maker governance has to approve the new implementation for use. The latest implementation change from the TUSD team happened on February 24th, after a security issue was found in the Compound TUSD integration, and reported by OpenZeppelin and ChainSecurity. The issue originated from the fact that the TUSD contract allowed more than one entry point (otherwise known as a proxy contract), while the Compound implementation assumed only one existed. A malicious actor could have used the additional entry point to send the underlying collateral of the TUSD Ctoken to the Compound Timelock contract. This would have reduced Compound’s TUSD to cTUSD exchange rate and would open up profit opportunities for the attacker on behalf of other Compound users.  Outcome The new TUSD implementation has a small change to allow only one entry point, which is the newer TUSD proxy contract. This solves the above issue. The change was reviewed by the Protocol Engineering team and approved for use. ",
                    "links": [
                        "https://forum.makerdao.com/t/attention-tusd-a-users-collateral-offboarding/13927",
                        "https://forum.makerdao.com/t/tusd-disabled-due-to-unannounced-token-upgrade/2747",
                        "https://etherscan.io/tx/0x125823f2914e4f14e06b9b1b30fe9dd9512b36354cc1f6c063118c4fe03d8287",
                        "https://blog.openzeppelin.com/compound-tusd-integration-issue-retrospective/",
                        "https://medium.com/chainsecurity/trueusd-compound-vulnerability-bc5b696d29e2",
                        "https://forum.makerdao.com/t/governance-and-risk-183-thursday-march-24-17-00-utc/14150/2",
                        "https://forum.makerdao.com/t/relay-semanal-22-28-de-marzo-de-2022/14333",
                        "https://forum.makerdao.com/t/monthly-governance-review-march-2022/14428",
                        "https://forum.makerdao.com/t/ces-sprint-update-4-2022-q1-mar-14th-to-mar-25th-2022/14451",
                        "https://forum.makerdao.com/t/weekly-relay-march-22-28-2022/14300"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.663277511961722
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "07/04/2022-13:57:37",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}