{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-increasing-the-surplus-buffer/9734",
            "title": "[Informal Poll] Increasing the Surplus Buffer ",
            "index": 9734,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "8",
                    "time": "07/08/2021-07:20:33",
                    "content": "We finally increased the Surplus Buffer to 60 MM after a 99 day lerp with the intention to flap ~25% of the accrued fees - which did not work out as expected, as the revenues were cut down a lot. While we still make ~ 38MM just by the stability fees right now, our expenses are at ~32 MM so we are not going to fill the Surplus Buffer anytime soon as the System Surplus is at ~50MM now. However, if we are going to see a huge market drop with corresponding liquidations, we might end up in a huge pile of liquidation fees piling up, overflowing the Surplus Buffer eventually resulting in some flap auctions. I have to admit i would rather see those liquidation fees ending up in the piggy bag than some MKR burn, so I would like to discuss the idea of increasing the Surplus Buffer again making sure all accrued income is going into the Buffer instead of (potentially) causing some MKR burn.  Shall we increase the Surplus Buffer?     Yes No Abstain     0 voters      Next Steps I would be very happy hearing your opinions on this topic, maybe @Risk-Core-Unit or @Real-World-Finance have additional points. IMHO there is no real hurry on this topic, but I would like to find out what the community thinks about it and make a Signal Request (assuming there is some positive feedback on the idea) in ~2 weeks. ",
                    "links": [
                        "https://vote.makerdao.com/executive/template-executive-vote-system-surplus-buffer-increase-and-burn-parameter-changes-yfi-a-addition-to-liquidations-20-april-23-2021?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-6th-12th/9823",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948",
                        "https://forum.makerdao.com/t/signal-request-adjust-the-surplus-buffer-september-2021/10120"
                    ],
                    "GPT-summary": "The author of the post is proposing to increase the Surplus Buffer and is asking for feedback from the community. The post also includes some background information on the current state of the Surplus Buffer and the potential consequences of not increasing it. The author is open to collaboration and suggestions from third parties and plans to make a Signal Request in two weeks if there is positive feedback on the idea.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.6567044067044066
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#2",
                    "likes": "23",
                    "time": "07/08/2021-08:10:11",
                    "content": "Soo… I wholeheartedly support this proposal. Here’s a confession of an unpopular (?) opinion. Imo the focus on burning MKR is completely misplaced during this phase of the project. I didn’t realize this myself for a while, but… the fact that this isn’t generally recognized is maybe my biggest concern I have for Maker right now. Supply side challenges we’ll deal with. Regulatory pressure we can weather better than the competition. We’ll build a DAO that can scale. But an extraction mentality too early in the project is a creeping drain on our vitality that may bring us down if we’re unaware of it. If you think Maker is no longer a startup and we can sit back and relax… reaping the fruits now even if we’re no longer in a bull market… I think you lack imagination about where this space will go and just how long the road still is. Maker needs to fire on all cylinders and reinvest as much as possible in its own growth and security. Everything else is complacent and burning MKR at this stage is shortsighted. If burning MKR now is what we need to convince MKR holders to hold… let’s hope then we get better MKR holders or they will kill our competitiveness. But honestly, I think this may be a situation where everyone is assuming everyone else wants it (burning), but it may not actually be the case. So I hope the yes option of this poll will win with a landslide. We should not be burning MKR until the next bull market at least. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.813932980599647
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makerburn",
                    "index": "#3",
                    "likes": "6",
                    "time": "07/08/2021-09:56:27",
                    "content": "The way things are going, buffer limit won’t be reached for a long time. I’d rather see the governance bandwith be spent on something else. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#4",
                    "likes": "6",
                    "time": "07/08/2021-09:58:18",
                    "content": "Username checks out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#5",
                    "likes": "11",
                    "time": "07/08/2021-13:55:36",
                    "content": "Presently I am against raising the Surplus Buffer beyond DAI 60 million. Liquidation 2.0 works extremely well and RWA is still in its infancy. There is still a full 3 months before the threshold is reached so there is absolutely no hurry. What I would really like to see is some kind of formula for calculating the size of the surplus buffer so we do not have to resort to emotional arguments. Is it possible to add that question to the poll @ultraschuppi ? “Encourage Risk to develop a quantitive framework for the size of the Surplus Buffer” ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.578125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#6",
                    "likes": "7",
                    "time": "07/08/2021-15:49:24",
                    "content": "To @wouter’s point, I believe it’s way too early to be burning MKR, even if the risk recommended CET1 and leverage ratios were reached. The standard business strategy for a new market is to reinvest as much as possible and grow like hell and to take as much market share as possible, then as growth slows start to extract more value and shift to a focus on profitability. If this wasn’t clear to everyone already, it should be even more so after reviewing Circle’s investor deck. They’re growing and taking market share faster than any other stablecoin in the space and forecasting $-76M in EBITDA on $115M in Revenue this year (excluding D&A and stock based comp), but targeting 35% EBITDA margins long term. They’re also forecasting nearly $900M in revenue in 2023 and I don’t see their growth slowing anytime soon especially with a TAM approaching $200T. With that said, I think our first step should be to align as a community on appropriate CET1 and leverage ratios per @Risk-Core-Unit’s guidance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.691051136363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#7",
                    "likes": "3",
                    "time": "07/08/2021-16:24:17",
                    "content": "    wouter:  Maker needs to fire on all cylinders and reinvest as much as possible in its own growth and security.   Completely agree with this viewpoint.     Aes:  With that said, I think our first step should be to align as a community on appropriate CET1 and leverage ratios per @Risk-Core-Unit’s guidance.   I think this is a great suggestion. It probably would be best to start a separate thread about evaluating those ratios. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.321428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#8",
                    "likes": "2",
                    "time": "08/08/2021-04:33:32",
                    "content": "I have voted to abstain because I think that this decision should come exclusively from a risk management point of view. The last time it was discussed, it was pointed out that the SB should be around 2% of total outstanding DAI but at the time, the PSM was not as large as it is now. It doesn’t matter if we’d like to burn MKR now or not. The surplus buffer exists to safeguard against bad debt. If we think the buffer is enough given our risk, there’s no need to raise it. If the Risk Team thinks otherwise, then we absolutely should raise it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.153061224489796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tbone",
                    "index": "#9",
                    "likes": "0",
                    "time": "08/08/2021-05:39:23",
                    "content": "Doubling the SB to 120 MM gets it back to roughly 2% of Dai in circulation atm. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#10",
                    "likes": "5",
                    "time": "08/08/2021-10:05:40",
                    "content": "I think some people are voting yes for risk related reasons and others are saying yes to increase the cash available for growth. Right now both groups are into growing the SB but I guess only one will be happy draining it for spending. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.485714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "4",
                    "time": "08/08/2021-12:02:26",
                    "content": "    AstronautThis:  pointed out that the SB should be around 2% of total outstanding DAI   So we also need to get our arms around separating the actual SB from our operating cash. Because a year of expenses is (roughly) estimated at $32 million right now. Suddenly the current SB looks very, very, very small. Sooner or later (sooner!!!) we need to segregate funds used to secure the protocol against bad debt from our piggy bank. If we considered only 18 million DAI in the current 50 million to be legitimately SB, for instance, the risk to DAI’s backing is quite high even for very tiny ilks. (Hat tip to Brian and LFW for helping me better understand how backing works in a worst case scenario) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.917857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#12",
                    "likes": "11",
                    "time": "08/08/2021-12:44:47",
                    "content": "The method we use to calculate appropriate Surplus is to check each collateral type’s risk premium (can be found here https://simulation.blockanalitica.com/) and calculate the “portfolio weighted risk premium” which represents expected portfolio loss in percentage terms. The recent calculation we made, estimated the weighted risk premium of 2.5% and applying this to 2bn DAI outstanding debt from volatile collateral equals 50m DAI. This is in line with the current Surplus Buffer and we actually rarely (if ever) achieved that good risk coverage in the past. However, this ratio won’t stay fixed going forward. If bull market kicks in or we increase DAI supply from volatile/risky collateral by organic growth (D3M, RWAs, stETH, G-UNI,…) we should be prepared to grow risk coverage in nominal terms as percentage wise if portfolio weighted risk premium increases. It also becomes easier to onboard risky assets, scale DAO and so on. From that perspective it is better to accumulate reserves in advance, because otherwise we’ll be lagging as we did many times in the past. At the same time I also think we should start giving more focus on treasury management if consensus will be to grow the surplus buffer from 60m. At certain point only hoarding passive DAI in reserves becomes ineffective. And to be honest, probably the number one reason why MKR holders would prefer buy&burn is because they prefer their share of passive surplus money to be reinvested somewhere rather than held passively (in buy&burn scenario reinvestment is made in protocol from those who don’t sell MKR). If Maker is able make yield on at least part of Surplus, support for increasing surplus buffer could possibly be higher. Also side note, I don’t expect 60m Buffer to be hit soon - unless rates increase or DAI supply from volatile collateral increases significantly to May levels, revenue will more or less equal costs and Maker would need to liquidate 77m DAI to accumulate another 10m in penalty fees to fill the remaining surplus buffer. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-august-2021/10106"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1345238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#13",
                    "likes": "8",
                    "time": "10/08/2021-16:10:34",
                    "content": "I agree with this. The only issue I see with the larger surplus buffer is that it is denominated in Dai, so we’re inadvertently pushing up the peg by holding Dai that doesn’t have any velocity. As this has been a persistent issue, I wonder if it would be worthwhile to explore saving rainy day funds in a basket of alternative assets so that we can free Dai up for the market. That said, even tens of millions of may not affect the peg much at this point anyways. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#14",
                    "likes": "2",
                    "time": "11/08/2021-00:24:35",
                    "content": "Voted yes to this.   I would like to see a real assessment @Primoz  from a what amount of cash do licensed banks need to have as I expect regulators would like to see Maker with that number or higher. I want to echo a second sentiment regarding isolating operating cash from SB.     PaperImperium:  So we also need to get our arms around separating the actual SB from our operating cash. Because a year of expenses is (roughly) estimated at $32 million right now.   Agree with various comments @wouter @Aes and others startups really don’t buy back stock - they plow returns into growth. I am also for buffer diversification and less concerned regarding PEG as per:     brianmcmichael:  As this has been a persistent issue, I wonder if it would be worthwhile to explore saving rainy day funds in a basket of alternative assets so that we can free Dai up for the market. That said, even tens of millions of may not affect the peg much at this point anyways.   PEG is being driven by artificially high DAI demand due to LP farming.  I see some moderate change of backing on DAI off of USDC to ETH predominantly.  Not sure if this is due to SF or just a 2K-3K ETH price change as I have not looked at the numbers in DAI vs. percent. I think it is important to realize that operational manpower costs now are over $30M/yr and SB basically has 1 year cash run ATM.   Some analysis of what we can do with DAI surplus to roll into growing operational budget fund probably would be prudent.   Realize it should be an easy matter to roll some of this back into the Surplus buffer in case of emergency if required so can still work as capital asset backing of the system in a pinch. I think a real discussion as to a real targets and structures for:  Surplus buffer (what is too much - why? ) Operational expense fund (which can back up surplus buffer in a pinch.  What is too little?  What things can Maker invest in to get return and still retain good liquidity. What is too much.). What levels of 1, 2 before Maker would consider looking for buyers to flop MKR to pay operational expenses or deal with losses in the SB if we have operational funds we can fill the SB deficit with.  Or what is too much and conditions to burn more MKR because MKR has a lot of cash on hand.  I think my main concern here is while we can talk about SB Maker would do well to also give some thought to when and how to line up MKR buyers (or whether to actually put up a DSR-B facility to borrow DAI with bond like terms to cover operational revenue deficiencies).    Companies don’t usually just throw stock on the market if they need cash, they take time to find the best sale terms/prices, look at bond rates to borrow etc.   This should all be factored into a cash reserve management strategy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.763462885154062
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#15",
                    "likes": "0",
                    "time": "11/08/2021-01:06:16",
                    "content": "    MakerMan:  SB basically has 1 year cash run ATM.   Don’t forget that MakerDAO can always mint MKR and it has 84K MKR catching dust.  BTW—speaking of diluted token holders—Hellium just raised $111M. Raising funds is not a sin. I can we can say it’s part of “strategic patience.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#17",
                    "likes": "3",
                    "time": "11/08/2021-07:30:33",
                    "content": "  As discussed in the past, there is no way to invest the Surplus Buffer. The Surplus Buffer is on the equity section of MakerDAO not on the asset side. For most other protocols, the equity equals the treasury section which is on the asset side. Therefore, this one can be invested and managed.   Separating the surplus buffer from operational cash seems to be a good idea but it’s not really. That’s what I learned from my research for the Strategic Reserves. Some Core Units have contingency buffers that are out of reach of Maker Governance. It’s better for Governance attacks and it didn’t cost any PE time. Moreover, the risk of not being profitable (and not being able to generate cash flows to pay the teams) is somewhat uncorrelated to credit risk or market risk. So there is a diversification benefit of polling them.   I would refer to the [MakerDAO balance sheet] that RWF CU is maintaining (@Aes doing a great job at  it). As you can see the Surplus Buffer is in blue, it’s not an asset. But the Operating Wallets are both as equity and as an asset. In that sense, you can say that there are some inefficiencies by having this cash unused. But it’s really a minor problem (4M DAI). (MakerDAO Financials - Google Sheets).    The equity requirement for banks is 3% of the balance sheet (let’s forget about more elaborated stuff like CET1 ratio, and it’s not saying anything that we are or should be in any way under this regulation). We are currently around 1% and we might have an issue catching up if there is hyper-growth life earlier this year. MICA regulation for stablecoin issuers will be 2% (not saying at all we are in the scope). Even for simple brokers (and we are kind of a broker providing margin loans on crypto), it is above 1%. So even before knowing how much exactly we need (which would depend on our risk appetite and our place in the competitive landscape), it is fair to say that it should be more than what we have currently to give us options in the future and avoid dead-ends.   ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765/17",
                        "https://docs.google.com/spreadsheets/d/1Na_PP8JHIc7Nwy2-pUW_YHY4hatS34DoUML8QI21lVs/edit#gid=526782600"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.278409090909092
                },
                {
                    "author_link": "https://forum.makerdao.com/u/18dew",
                    "index": "#18",
                    "likes": "0",
                    "time": "11/08/2021-07:30:51",
                    "content": "Yes this a one of the bad post that everyone tries to avoid. But reality is that system is built in such a way that one day or other you have to hit that burn button wether you increase the limit or not. Its better that periodically that button is triggered as it causes fair valuation of makerDao. Not having a fair valuation would leave the system vulnerable to take over attacks ( Hostile takeover ) as MKR is not fairly valued and is at suppressed rates. Due to this I feel that increasing limit is not a sane option. I am open to hear counter arguments on the same. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#19",
                    "likes": "1",
                    "time": "11/08/2021-11:26:26",
                    "content": "    SebVentures:  The Surplus Buffer is on the equity section of MakerDAO not on the asset side.   The SB is an asset in the form of retained earnings. At the moment it also happens to approximate the equity of Maker because it has no other assets except the PSM (which is offset by corresponding liabilities). But it is cash that is contributing to equity, not equity in and of itself.     SebVentures:  The equity requirement for banks is 3% of the balance sheet   I believe you mean the capital requirement (CAR).     SebVentures:  Even for simple brokers (and we are kind of a broker   Please stop calling us a bank, broker, or anything else that has major regulatory requirements and is not us. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.010416666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#20",
                    "likes": "0",
                    "time": "11/08/2021-12:23:03",
                    "content": "    PaperImperium:  The SB is an asset in the form of retained earnings. At the moment it also happens to approximate the equity of Maker because it has no other assets except the PSM (which is offset by corresponding liabilities). But it is cash that is contributing to equity, not equity in and of itself.   Are we on PaperImperium Accepted Accounting Principles?  Retained earnings are not at all an asset, it’s on the right side of the balance sheet under equity. Assets are on the left. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.935267857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#21",
                    "likes": "0",
                    "time": "11/08/2021-13:01:00",
                    "content": "    SebVentures:  Retained earnings are not at all an asset, it’s on the right side of the balance sheet under equity.   Let me rephrase. The SB is the cash from retained earnings. My mistake for not clarifying more precisely when I said:     PaperImperium:  The SB is an asset in the form of retained earnings. At the moment it also happens to approximate the equity of Maker because it has no other assets except the PSM (which is offset by corresponding liabilities). But it is cash that is contributing to equity, not equity in and of itself.   This is the original quote. I see how I may not have been super clear. But The SB is an asset. Which then increases equity.     SebVentures:  Are we on PaperImperium Accepted Accounting Principles?    …may I ask what your financial background is? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.920304232804233
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#22",
                    "likes": "2",
                    "time": "11/08/2021-13:17:33",
                    "content": "    PaperImperium:  The SB is the cash from retained earnings.   Maybe if you can provide a balance sheet, as I did, it would be easier to follow.     PaperImperium:  …may I ask what your financial background is?   I have a college degree in accounting and did a fair amount of accounting design for an insurance company. Doesn’t mean I’m right or wrong here as it is cutting edge. But I think I have provided what is a framework that is compatible with accounting rules. And I fail to see how what you are saying could comply with those rules. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.338010204081632
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#24",
                    "likes": "6",
                    "time": "17/08/2021-12:35:44",
                    "content": "100% support. Also took me a while to realize but any Defi project paying dividends in this early stage, esp. w/o having a large treasury, is likely a blunder. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.523809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Pinotio.com",
                    "index": "#25",
                    "likes": "0",
                    "time": "20/08/2021-13:55:46",
                    "content": "Could you post a link to how backing works in a worst case scenario? Thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#26",
                    "likes": "1",
                    "time": "20/08/2021-14:10:45",
                    "content": "    Pinotio.com:  how backing works in a worst case scenario?   I don’t have one at hand, but the surplus buffer absorbs bad debt. We haven’t seen any in a while I think, but that’s the first shock absorber, then more MKR is minted and sold. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.8125000000000004
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Quiet",
                    "index": "#27",
                    "likes": "3",
                    "time": "23/08/2021-16:51:47",
                    "content": "Voted to increase because cash on hand is needed for growth and/or stability in this phase, much more than burning. MKR price is appreciating as the protocols grows with the rest of the market anyway, so I don’t see the need for putting an extractive or price bump focus over cash on hand for expansion, stability, and unexpected/new expenses. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#28",
                    "likes": "2",
                    "time": "24/08/2021-19:01:44",
                    "content": "I have never been convinced that burning Maker will eventually be rewarded by the market. If ETH can drop to double digits, then rationality has completely gone out the window. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Quiet",
                    "index": "#30",
                    "likes": "4",
                    "time": "26/08/2021-21:27:43",
                    "content": "Respectfully, I think this comment is pretty misinformed. If you browse even just this forum, you can see myriads of work being done by the CUs on payroll, contractors, and active holders, all of whom receive compensation for their work. I don’t see how you could say with confidence that dai spent isn’t producing growth, even if you have an issue with specific expenses. The protocol has been scaling pretty rapidly with more CUs coming on board, new integrations and connections being made by growth, new structures. If you check other posts there is still new hiring happening, and new CUs such as legal that some expect to be coming next. All of these require costs, and I’m sure there are a million other operational costs I’m not aware of.  And it’s not like the protocol is exactly raking in the cash right now from what I can see. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.668208874458874
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Quiet",
                    "index": "#31",
                    "likes": "0",
                    "time": "26/08/2021-21:37:40",
                    "content": "Also I’m not sure what you mean by your comment about printing maker and creating hoards of cash. The surplus buffer plays an important role in the stability of the protocol. It’s not just idle cash doing nothing. I’m not sure if you think this is about the foundation MKR instead of the SB, but I don’t see how printing and diluting maker to cover operational costs instead of raising the SB and delaying a burn makes any sense. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.484375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#32",
                    "likes": "0",
                    "time": "02/09/2021-10:53:30",
                    "content": "thanks everybody for participating, i just opened the Signal Request for adjusting the Surplus Buffer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#33",
                    "likes": "0",
                    "time": "02/12/2021-16:53:54",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}