{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/wanted-a-plugin-that-allows-signalling-with-mkr-on-a-discourse-forum/1876",
            "title": "Wanted: A plugin that allows signalling with MKR on a discourse forum ",
            "index": 1876,
            "category": [
                "Resources",
                "Job Opportunities"
            ],
            "tags": [
                "mkr-forum"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "8",
                    "time": "03/04/2020-10:51:20",
                    "content": " Description We currently have an issue in that the communication between the Maker community and MKR Holders is difficult due to the lack of an easily usable functionality to signal how much MKR a certain forum account controls. We would like to explore the possibility of doing this using the official forum.  Criteria At the very least, the plugin should:  Allow users to optionally link an Ethereum address to which they control the private keys to their forum account. Allow users to unlink an address. Handle the fact that the MKR may not be present in the owned address and may exist in DSChief (the core voting contract) Optionally display the MKR controlled by this wallet in a prominent fashion on a users posts. This might be on a per-post basis, or an a per-account basis. Be as safe, secure and private as possible for users of this feature.   Additional Thoughts  Does this MKR need to be staked in order to signal? Do we want to use the DSChiefs IOU tokens in some way? Do we want to go the whole distance and allow on-chain polls to be created and voted in using the forum?  ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-9-9am-pst-4-00-pm-utc/1938/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.477539682539683
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OKDuncan",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/05/2020-14:23:23",
                    "content": "This is a cool idea, and something we could add to the DAO Ops project. Ideally, this means MKR holders add their address with MKR (or linked proxy address) and then there would be a “signal results” on a given forum post? Also, to clarify, this is independent from the polling votes, more about gaining a temperature read of MKR holders around a specific idea, correct? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#3",
                    "likes": "6",
                    "time": "11/06/2020-22:27:42",
                    "content": "I had some thoughts on this with regards to privacy. We want to encourage participation, but I’m sure there are folks out there who want to minimize information leakage.   It may be worthwhile to set brackets instead of exact amounts. Such as 1-100 MKR, 100-1000 MKR, etc. This may help to obfuscate exactly which address you own as well as your specific wealth. Breaking this out into minnow, whale, super whale may convey enough information.   For the case of votes it may be worthwhile to allow anonymous users to do a one-time votes if they do not want to reveal anything other than their vote on a specific issue.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.170138888888888
                }
            ]
        }
    ]
}