{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/business-policy-of-rate-setting/2609",
            "title": "Business Policy of Rate Setting ",
            "index": 2609,
            "category": [
                "Governance"
            ],
            "tags": [
                "analysis",
                "rates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "8",
                    "time": "24/05/2020-11:05:42",
                    "content": "I want to open a new topic regarding rate setting that was a bit overlooked in the past. When MakerDAO governance decides about rates, it primarily wants to achieve two things: 1) peg stability and 2) risk compensation. In the last 2 months, we have been mostly trying to solve peg stability by setting rates to minimum levels, where we lacked risk compensation. Hopefully we are able to replace this shortfall in the future, where for various reasons (low DAI demand/supply ratio) we might need to raise rates above risk premiums to achieve peg stability. There is however a third component of rate setting and one fairly important aspect to consider. When we lowered rates below those market priced on various lending markets or swap markets, MakerDAO became competitive, gained market share and attracted new borrowers. Good example is recent increased borrowing on WBTC, where participants such as Nexo saw market opportunity and started using WBTC as collateral to gain access to cheaper liquidity (they charge their customers between 6%-12% on USD borrowing collateralized by BTC). Low MakerDAO rates compared to other markets might be temporary or last only until we see enough DAI liquidity on markets at dollar parity. Yet, MakerDAO did something, although completely unwillingly, that banks do when they want to acquire a new customer base: offer discount rates or rebates to use their services and increase market share. However, this strategy can be pursued only as long as risk doesn’t flash red lights and peg doesn’t deviate. But if risk is tolerable and monetary policy enables it, governance should be aware of competitive lending or leverage services to gain market share when deciding about rates. This is why I think governance should be monitoring the lending space more widely and use that information. Example: when there is a sudden bull market for specific collateral but market rates still persist reasonably above MakerDAO risk premiums and peg wasn’t affected, governance could decide to keep the rates lower to maintain market share. Basically MakerDAO needs to decide whether it wants to forgo short term revenues by gaining user adoption. How I imagine this would look in practice is we would be monitoring competitive lending landscape such as the table below presented. Ideally we would want to also include swap markets. This should give us a good insight into where MakerDAO stands competitively and if there are benefits from a user adoption standpoint.  732×361 218 KB  Source: Compound newsletter Further, monitoring rates about competitive lending venues should also enable us to better analyze state of the peg and help governance with monetary policy decisions. It should give us a better insight into demand and supply dynamics of usd denominated coins. For example when USD based rates rise on futures or swap markets, meaning there is increased demand for leverage, DAI markets will similarly witness increased supply and governance can be prepared to raise rates to simultaneously stabilize the peg and collect extra fees without losing competitiveness. Ideally we would want to measure spread between DAI rate of particular collateral and rate observed on the market. If the spread is negative (DAI rates are lower than market rates) and peg is still stable, governance is either 1) underpricing the risk and subsidizing increased usage or 2) risk is compensated properly, but governance could increase rates to collect additional fees without losing competitiveness. If spread is positive (DAI rates are above market rates) and peg is stable, governance is either 1) overpricing the risk, making extra revenue but losing competitiveness or 2) risk is compensated properly by the rates, but it could lower them to maintain competitiveness. To conclude, there are three policies that need to be considered when setting the rates: monetary policy keeping the DAI peg stable, risk compensation making MKR holders hedged and business policy that helps MakerDAO remain competitive. It however remains to be seen if this isn’t a classic trilemma, since setting rates for business decisions might be too oftenly limited by monetary policy and risk compensation which still remain the core two components of MakerDAO (keeping DAI stable and properly collateralized). ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-27-9am-pst-4-00-pm-utc/2655/2"
                    ],
                    "GPT-summary": "The author proposes that MakerDAO governance should consider competitive lending rates when setting rates to maintain market share and attract new borrowers. The post suggests monitoring competitive lending venues to better analyze the state of the peg and help governance with monetary policy decisions. The proposal highlights three policies that need to be considered when setting rates: monetary policy, risk compensation, and business policy.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.546720392702536
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/05/2020-12:33:32",
                    "content": "I totally agree with you, your interpretation of the problem is very comprehensive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#3",
                    "likes": "2",
                    "time": "24/05/2020-16:11:42",
                    "content": "I really enjoyed the post. Would love if something like this were included in the weekly governance calls (time permitting) similar to how we take a look at the “state of the peg” where we could potentially compare how DAI lending is positioned competitively. That said I just wanted to point out one thing about the your post.     Primoz:  If spread is positive (DAI rates are above market rates) and peg is stable, governance is either 1) overpricing the risk   I don’t know that this is necessarily true. It seems just as likely to me that other markets could be underpricing the risk, so immediately jumping to this conclusion may lead to unsafe lending practices. Definitely something to consider, but ultimately i think that this should be considered in conjunction with other quantitative models to arrive at rates. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.553030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#4",
                    "likes": "2",
                    "time": "24/05/2020-19:02:36",
                    "content": "    Andy_McCall:  I don’t know that this is necessarily true. It seems just as likely to me that other markets could be underpricing the risk, so immediately jumping to this conclusion may lead to unsafe lending practices. Definitely something to consider, but ultimately i think that this should be considered in conjunction with other quantitative models to arrive at rates.   Agree, that is why I specified two possibilities as governance is either 1) overpricing the risk or 2) Maker rates are set properly = other markets are underpricing risks and Maker is losing competitiveness. In case Maker rates are set according to risk models, 2) should hold. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.982142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#5",
                    "likes": "0",
                    "time": "24/05/2020-21:10:01",
                    "content": "Really like this idea! As an aside, I would also love to see real formalized and quantitative models for figuring out the risk for different assets. As of now, we’ve essentially been operating on a principle for deciding risk premiums for different collaterals based on what “feels right” rather than quantitative models of for example volatility. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#6",
                    "likes": "1",
                    "time": "24/05/2020-23:32:33",
                    "content": "@befitsandpiper have you caught these two presentations in some of the recent Governance Calls? Risk Model Overview Risk Model Inputs Cyrus and the risk team are working on using such a model to base their recommendations through. ",
                    "links": [
                        "https://youtu.be/stm5BJYr0QQ?list=PLLzkWCj8ywWNq5-90-Id6VPSsrk4OWVan&t=592"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#7",
                    "likes": "1",
                    "time": "24/05/2020-23:45:21",
                    "content": "I have not! I think I got involved in makerdao slightly after those calls and have not gone back through all the old governance calls. I will listen to them now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.888888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "0",
                    "time": "25/05/2020-12:54:51",
                    "content": "Thanks for sharing this @Primoz . Makes a lot of sense. I’d like to second @Andy_McCall and say that it would be great to have a ‘competitiveness’ section in either the governance and risk call, or as part of an alternative ‘risk’ call. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#9",
                    "likes": "4",
                    "time": "09/06/2020-21:07:30",
                    "content": "Referring to my post, I made this table to compare rates across space when making BTC leverage Screenshot 2020-06-09 at 22.56.011774×658 92.3 KB ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#10",
                    "likes": "0",
                    "time": "10/06/2020-02:27:16",
                    "content": "As long as we keep interest rates lower than other platforms, we are attractive. It is time to raise the basic interest rate, rather than keeping it at zero. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.78125
                }
            ]
        }
    ]
}