{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-venezuela-round-up-february-april-2021/7708",
            "title": "MakerDAO Venezuela Round Up - February/April 2021 ",
            "index": 7708,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#1",
                    "likes": "10",
                    "time": "28/04/2021-18:12:09",
                    "content": "MakerDAO Ambassadors for Venezuela:  Diego Ortiz (@Saludiego_201) Luis Lozada (@LozadaLuis12) Alejandro Fernandes (@Alefcripto)  The Team in Venezuela is proud of its third trial period, in which we have presented advances that, added to others, consolidate a base of information and tools for our users at the local level and tips in a general way for the public in LATAM. In that sense we have defined the points that are most important to highlight throughout this quarter, which has been dedicated to the creation of information, content and ideas for it with thematic of DAI, MakerDAO, DEFI and related crypto move, as well as great alliances for the usability of DAI in Venezuela and large volumes of trade in our p2p markets. Alliances A great alliance was achieved with a company that is a cryptographic services switch, Glufco Investment, in which DAI was integrated as one of the accepted stable currencies to acquire its Account Unit token to access its services. This is an important step for DAI because a user can buy DAI in a p2p whether DAI ERC-20 or BEP-20, send it to Glufco and so their relative in Venezuela can exchange it for Dollars in cash, which is the most traded currency in Venezuela according to ecoanalítica a specialist firm on the subject. Conversations are under way to also be able to integrate xDAI, which in our p2p markets has had great mobility and demand from Venezuelan users. It is also expected to be able to integrate DAI from the Polygon chain.  1001×710 61.6 KB      Integration of DAI (ERC-20 and BEP-20) in the GLUFCO Service Switch Integrations       Integration of DAI (ERC-20 and BEP-20) in the GLUFCO Service Switch  From DAG Venezuela, we have just achieved a vital and important integration for DAI, because we all know how tedious the Ethereum gas fee is, from GLUFCO (I work there) we natively integrated the acceptance of DAI in BEP-2’.     En @glufco nos dimos cuenta del creciente uso de #BSC por parte de muchos usuarios sea Latam o sea en Venezuela, por ende decidimos agregar $USDT $BUSD $USDC y $DAI en formato BEP-20. Esto para así los …     P2P Exchanges In our p2p group we have managed to exchange in the last quarter a total volume of 6744 xDAI spread over 125 transactions, using the xDAI sidechain. This network according to the majority of those who made p2p indicate that it is very economical and being DAI their native currency helps them to know how much they spend on trucks, we attach the wallets, and the Telegram group where they can verify. All this taking into account that although Venezuela is the spearhead in terms of the adoption of cryptocurrencies, for several years Venezuela has been going through a process of hyperinflation, for this reason every day people within the country find new ways to protect their savings, being xDai one of them. @Alefcripto He is the manager and owner of the wallets where the exchanges were made and the one who made all the exchanges. https://blockscout.com/xdai/mainnet/address/0x92c8B19E17EF8e39E997A5e6F26DC5F5577d8f26/transactions https://blockscout.com/xdai/mainnet/address/0x2c13ceF62A0e8Df8FA929ee4c9f3dd1320a97abe/transactions  1302×701 76 KB  Community Highlights In this last quarter as Dai Action Group in Venezuela we managed to find big stars in our community, managing to connect with more people and expand the knowledge and education about Dai and decentralized finance much more. Here we will give a review of the most outstanding points of our community:  Members talks A community member @luisruizvet who is an odontologist, made a meetup for his odontologist mates to talk about crypto, stablecoins and P2P markets, and how to use them to buy DAI and save from inflation.  538×668 174 KB   xDai on Vzla The first transaction in DAI Venezuela’s P2P group with xDAI has been successful. The acceptance of the xDAI currency in the group has encouraged more trades in the group, since gas is one of the main reasons why DAI is inoperable from person to person. This is why everyone agrees to the inclusion of xDAI in the group. You can view the transaction here: https://blockscout.com/poa/xdai/tx/0x3c1e9e6daa121d28d7b5fb4515c477255e7726f0a741e2874ff3f5b47ca96b08/internal-transactions  824×375 23.8 KB   821×618 34.3 KB   576×1280 149 KB   DAI x Glufco We already have DAI in Glufco OTC, now people can send their DAI and exchange it for glufco and later for Bolívares o USD (in cash), so it’s a good option for the people over here, reducing the barriers that other exchanges present here, and giving the first chance to the people in order to have cash in exchange for DAI.  848×758 92.6 KB   First Group Voice Chat  606×1280 380 KB  Last Friday (February 19th), we had our first Group Voice Chat. Some community members came to the chat to talk about Dai, Ethereum, DeFi and what’s happening with the Binance Smart Chain, a pretty good talk that we are going to host every week or 2 weeks.  Artist in the Community Recently joined to the community an OpenSea crypto-artist, @Noguera19 joined to our Dai & DeFi Vzla community asking about Dai and telling us that he sold an art for 70 $DAI on OpenSea , we plan to have a chat with him so we talk about his experience as an crypto-artist.  1282×529 335 KB  Electricity, the art sold by Noguera for 70 DAI.  MakerDAO Art Contest Members participating in the MakerDAO Community Art Contest: we’ve encourage our members to participate in the MakerDAO Community Art Contest and we have two great productions looking for the big prize:   twitter.com    Luis Gutiérrez @luisgtrrez    Acabo de participar en el concurso de Arte de @MakerDAO espero les guste. #DaiForArt https://t.co/cuDN8KeS72   11:38 PM - 14 Mar 2021           78                27              twitter.com    Octopus @Octopus_Builder    Hi!, this is my entry for the MarkerDao Comunity art contest!  \"Crypto Hope\" my instagram: (@alejandrolopezva) #DaiForArt @MakerDAO https://t.co/mxEN9UJQtJ   2:26 AM - 24 Mar 2021           8                1             Call within ETH Latam On March 16 we had a nice talk with some members in the ETH Latam discord chat, we talk about Dai and DeFi, also presented how MakerDAO manage to pay their contributors using Request Network and what do we expect about the news L2 solutions and the crosschain crypto space that we are seeing.  1080×486 337 KB   Presenting our Gitcoin Grant We as Dai DeFi Vzla created a gitcoin grant in order to gain traction in other public, also we want to use the funds in order to create some tutorials using DAI within Zk rollups L2 solution.  DAI Venezuela | Grants DAI x ETH Caracas We were present in a call on the YouTube channel of the ETH Caracas community, there with the interviewer we reviewed the beginnings of the DAG in Vzla and how it has evolved, in addition to talking a little about the adoption of decentralized finance by the people and NFTs.  1302×701 245 KB   Yield Farming mediums/tutorials In the last months we have carried out tutorials and blogs in our medium explaining to the members of the community and any interested reader how to use different protocols in order to obtain profits in the world of decentralized finance. Here is a list of the tutorials made in this last quarter: ¿Qué es Uniswap? Uniswap a fondo Balancer a fondo Exchanges Centralizados vs Exchanges Descentralizados xDAI a fondo — Primeros pasos para principiantes y usuarios avanzados. Gitcoin una herramienta poderosa para el código abierto  Yield Farming en BSC — Pumpy Protocol. Hegic y la revolución del mercado de las opciones LP en Pancake Swap AAVE a fondo ¿Qué es AVAX? ¿Un Ethereum Killer más del montón? ¿Qué es Synthetix y los activos sintéticos? Yield Farming en xDai — Bao Finance Synthetix — SNX Gobernanza, Exchange y Mintr ¿Como usar AAVE en Polygon (Matic Network)? — DeFi x Matic Compound a fondo Métricas en Redes Twitter Our preferred social network, where these months we have handled interactions and masses of audiences to a great extent and form. Where we already have a defined audience, the interested user DeFi in Venezuela and some countries in South America In the period from February 01 to April 25, we managed to publish 281 Tweets, which generated 171.3 K of interactions, with 7,400 Visits to our profile, 120 followers gained and more than 195 mentions.  298×768 86.7 KB  Instagram On Instagram we get the perfect showcase to show that DAI is beautiful in its own way. @alefcripto dedicated himself in this area to developing infographics and posts, among other tasks within the social network. We achieve good results in followers, likes and engagement. These images were looking to generate curiosity to the reader and to educate himself with the contents of each post. Thus reaching a wide range of people who were looking for entertainment and to know more about us. We got 400 followers and more than 2000 likes (this without counting the likes on reels and igtv) We also posted 32 mixed videos focusing on DAI and MakerDAO education on reels.   instagram.com   @daidefivzla      Descubre las ventajas del dinero digital, al hablar de Dai hablamos de...        instagram.com   @daidefivzla      Las criptomonedas en Venezuela se han vuelto un escape a la economía...       1090×485 86.5 KB   864×570 294 KB  TikTok: Our channel dedicated to trying to bring younger audiences closer to generating interest is DAI, MakerDAO and DeFi, where in these 3 months we generated 33 Videos with a total of 1775 Views. We also put out a section called CryptoNews, where every day we generate news related to the world of DeFi, Ethereum and MakerDAO. Where every day depending on the interest of the news occurs in 60 Sec capsules.  444×663 166 KB  Medium It has always been our ideal space to share any type of information or any type of written tutorial, adding opinion articles, it is that brief escape that our readers have to delve into DeFi, and why? It currently has a great development of DAI as the DeFi coin par excellence. We developed, at Mariano’s initiative, a weekly space to talk about DAI and Defi on other networks, where thanks to this series of tutorials and information our readership increased exponentially, in these 3 months we obtained a total of 597 readings spread over 17 Publications.  1302×701 23 KB  Telegram In Telegram with the passing of time we have built an active community, where any question will be answered. Admittedly, when we made the switch to advocating for DAI across multiple chains and talking about any other related project where this DAI, many people have been drawn in by all that Defi represents for their finances, a circumstantial improvement of now, which underpins the values that we have always shared during these months, that you are the owner of your money. We have achieved a total of 274 members of which a part is quite active.  891×413 29.1 KB   848×719 43.1 KB  We include a very positive dynamic with the voice chat that Telegram includes, so we can ask a more interactive question and answer for all the members of the group. We named this initiative Let’s Talk About Everything a Little.  1280×720 151 KB  On a daily basis, we encourage healthy conversations about any exciting projects, what’s new for MakerDAO, its future, and the bright path for DAI to take. The end of the road … The beginning of a new one ! During the 3 quarters being ambassadors of Venezuela we have learned much more about the crypto universe and about the needs of other people in our region, we have evolved with the community and embarked on a path that has been incredibly fun, full of pleasant experiences and very good friends, both within the community, within MakerDAO and even other crypto communities. On the part of the DAG of Venezuela we are infinitely grateful to the Maker Foundation, especially Mariano Di Pietrantonio and Nadia Álvarez, who have always accompanied us on this great path and extended a hand to us when we need it, in addition to thanking the entire team that is behind DAI, the best stablecoin of all. This last quarter represents our farewell as Dai Action Group for Venezuela, but it also means the beginning of our members as part of different Core Units within the DAO, we will continue to further promote Dai’s growth, not only in Venezuela, but throughout Latin America, to continue building the community we long for. Thank you for everything, and we will continue to protect our community one DAI at a time! ",
                    "links": [
                        "https://forum.makerdao.com/t/integration-of-dai-erc-20-and-bep-20-in-the-glufco-service-switch/6947",
                        "https://twitter.com/glufco?ref_src=twsrc%5Etfw",
                        "https://twitter.com/hashtag/BSC?src=hash&ref_src=twsrc%5Etfw",
                        "https://twitter.com/search?q=%24USDT&src=ctag&ref_src=twsrc%5Etfw",
                        "https://twitter.com/search?q=%24BUSD&src=ctag&ref_src=twsrc%5Etfw",
                        "https://twitter.com/search?q=%24USDC&src=ctag&ref_src=twsrc%5Etfw",
                        "https://twitter.com/search?q=%24DAI&src=ctag&ref_src=twsrc%5Etfw",
                        "https://blockscout.com/xdai/mainnet/address/0x92c8B19E17EF8e39E997A5e6F26DC5F5577d8f26/transactions",
                        "https://blockscout.com/xdai/mainnet/address/0x2c13ceF62A0e8Df8FA929ee4c9f3dd1320a97abe/transactions",
                        "https://blockscout.com/poa/xdai/tx/0x3c1e9e6daa121d28d7b5fb4515c477255e7726f0a741e2874ff3f5b47ca96b08/internal-transactions",
                        "https://opensea.io/assets/0x495f947276749ce646f68ac8c248420045cb7b5e/111678408678651165476144960977835561318461304424955758766612748036215435952129",
                        "https://twitter.com/luisgtrrez/status/1371244275263021058",
                        "https://twitter.com/luisgtrrez/status/1371244275263021058",
                        "https://twitter.com/luisgtrrez/status/1371244275263021058",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/search?q=%23DaiForArt",
                        "https://t.co/cuDN8KeS72",
                        "https://twitter.com/luisgtrrez/status/1371244275263021058",
                        "https://twitter.com/Octopus_Builder/status/1374548042741911557",
                        "https://twitter.com/Octopus_Builder/status/1374548042741911557",
                        "https://twitter.com/Octopus_Builder/status/1374548042741911557",
                        "https://twitter.com/search?q=%23DaiForArt",
                        "https://twitter.com/MakerDAO",
                        "https://t.co/mxEN9UJQtJ",
                        "https://twitter.com/Octopus_Builder/status/1374548042741911557",
                        "https://gitcoin.co/grants/2126/dai-venezuela",
                        "https://makervenezuela.medium.com/qu%C3%A9-es-uniswap-10592eb801f8",
                        "https://makervenezuela.medium.com/uniswap-a-fondo-4566ef1fa9ca",
                        "https://makervenezuela.medium.com/balancer-a-fondo-aeff45368f35",
                        "https://makervenezuela.medium.com/exchanges-centralizados-vs-exchanges-descentralizados-5d740db59906",
                        "https://makervenezuela.medium.com/xdai-a-fondo-primeros-pasos-para-principiantes-y-usuarios-avanzados-23c89e1e418d",
                        "https://makervenezuela.medium.com/en-el-ecosistema-cripto-todos-somos-usuarios-y-desarrolladores-de-los-cientos-de-plataformas-56c718f65790",
                        "https://makervenezuela.medium.com/yield-farming-en-bsc-pumpy-protocol-9ebb7620b2a1",
                        "https://makervenezuela.medium.com/hegic-y-la-revoluci%C3%B3n-del-mercado-de-las-opciones-b6d6f82b8600",
                        "https://makervenezuela.medium.com/lp-en-pancake-swap-7c176b1e635",
                        "https://makervenezuela.medium.com/aave-ff3e2bcc55cd",
                        "https://makervenezuela.medium.com/qu%C3%A9-es-avax-un-ethereum-killer-m%C3%A1s-del-mont%C3%B3n-6406e5aa011b",
                        "https://makervenezuela.medium.com/qu%C3%A9-es-synthetix-y-los-activos-sint%C3%A9ticos-7d48c4caf36c",
                        "https://makervenezuela.medium.com/yield-farming-en-xdai-bao-finance-fe23410c214a",
                        "https://makervenezuela.medium.com/synthetix-snx-gobernanza-exchange-y-mintr-a1fb12a620b3",
                        "https://makervenezuela.medium.com/como-usar-aave-en-polygon-matic-network-defi-x-matic-bbb86ec4534",
                        "https://makervenezuela.medium.com/compound-a-fondo-efa8ed543346",
                        "https://www.instagram.com/p/CG7tpq9HEhY",
                        "https://www.instagram.com/p/CG7tpq9HEhY",
                        "https://www.instagram.com/p/CG7tpq9HEhY",
                        "https://www.instagram.com/p/CGSkZHPH-Dh",
                        "https://www.instagram.com/p/CGSkZHPH-Dh",
                        "https://www.instagram.com/p/CGSkZHPH-Dh",
                        "https://forum.makerdao.com/t/maker-relay-ep-43-en-espanol/7950",
                        "https://forum.makerdao.com/t/maker-relay-ep-43/7818",
                        "https://forum.makerdao.com/t/campaigning-vote-no-on-inclusion-poll-for-strategic-marcomms-core-unit-mip-set-may-10-2021/7951/36",
                        "https://forum.makerdao.com/t/signal-request-fund-ambassadors-program-pilot/13199/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.022792291687641
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "4",
                    "time": "28/04/2021-20:36:24",
                    "content": "Undoubtedly in Maker there is a great community, what an honor to bring DAI to the Venezuelan territory, great experiences, with great friends Luis, Diego. The truth is that it was a job done with a lot of love from everyone, we achieved great things. Let’s hope in these new beginnings that we do more, develop new ways, to protect those we love the most one DAI at a time  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.736363636363636
                }
            ]
        }
    ]
}