{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/vault-user-research-survival-analysis/18715",
            "title": "Vault User Research: Survival Analysis ",
            "index": 18715,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "user-research",
                "research",
                "risk",
                "growth"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/josolnik",
                    "index": "#1",
                    "likes": "13",
                    "time": "08/11/2022-14:55:46",
                    "content": " Introduction For Maker to keep scaling its (crypto) DAI supply, income and the underlying number of vault users, it is important to understand both the inflow of new vaults and also the retention of existing ones. In this report we focus on studying churn dynamics, looking at how well users using Maker’s vault service are retained over time. Churn event is detected when a vault decreases their exposure below a predefined level which acts as a proxy of whether a vault is still active (retained) or not (churned). There are various valuable insights that can be derived from this research direction:  How likely is a vault to continue to have DAI exposure over time? Is there some difference between retention across different vault types? What about collateral symbols? Is there a point in a vault’s tenure where if it was retained that long, it is unlikely to churn in the future? Is there a relationship between vault size and its retention? How could survival analysis be used to increase vault service adoption? Do churned vaults tend to migrate their exposure to other competing protocols (e.g. Aave)?  There is an additional nuance of a rapidly evolving ecosystem which means that vault closure/churn (removal of debt exposure) can often be caused by changing market sentiment which impacts overall demand for crypto leverage (which is independent from Maker’s quality of services that it offers). This dynamic is fortunately countered by 3 years of historical data since the launch of MCD which enables us to still surface some valuable insights. This report is a result of an ongoing research by @Risk-Core-Unit.  Methodology We investigate vault usage retention over time by looking at both vault level and wallet level data. The latter approach is added to avoid detecting migration of exposure from one vault type to another as churn. Wallet level data includes all of its underlying vaults which mitigates this. Churn is defined as the drop of vault’s DAI exposure to below 10,000 DAI. This serves as a level of debt that is very unlikely to be left in the protocol instead of being transferred elsewhere due to high gas fees. Also, when the dust levels were raised above 15,000 DAI+, smaller vaults below this threshold were liquidated / churned which makes the analysis for these vaults less informative. With the increasing chain integration / transaction scaling capabilities this threshold will likely go down which will contribute to vault usage also being economical for smaller vault users. Vault tenure is defined as the difference in number of months between when a vault was opened and a specific month after that (eg. when it churned or current month). In the analysis we focus on vaults collateralized by the 3 major collateral symbols: stETH, WBTC and ETH. As we mentioned already in our previous analyses, we use 1 wallet = 1 user assumption to study vault behavior which is a natural byproduct of blockchain’s open and pseudonymous data. Incidentally, there is no way for us to reliably estimate how accurate this assumption is but there are arguably a lot of generalized patterns that can be extracted with this kind of approach. To derive the survival curves we use a Kaplan-Meier estimate which is a graphical representation of the (non-parametric) survival function. While beyond the scope of this report, one of the key benefits of using this methodology is tackling the challenge of many churn events not being observed yet by using right-censoring. Meanwhile, there is a limitation of this approach called omitted-variable bias which causes the multiple predictors to be interpreted as one. Additionally, in order to make the results more explainable within the community, we focused on using visual representation when comparing survival curves across different dimensions as opposed to statistical approaches such as log-rank test.  Analysis  Vault Count Distribution split by Activity State The below histogram shows that most of the vaults opened historically (around 28,000) already churned as there’s currently around 2600 active vaults (9% of total opened). The representative (median) tenure (months difference between when the vault was opened and when it decreased its position below 10,000 DAI and hasn’t increased since) for churned vaults is 4 months. To simplify, this means that a typical vault that already churned was open for 4 months. The representative (median) tenure (months difference between when the vault was opened and current month) for retained vaults is 12 months. To simplify, this means that a typical vault that is still open has been opened for a little over a year. Additionally, we can see that the longest tenure for a vault was 36 months which is aligned with the date when MCD was initially launched.  1080×370 25.7 KB   Vault Survival Curve split by Entity Level (Wallet vs. Vault Level) The survival curve below shows what share of vaults tend to continue to have DAI exposure per chosen length of tenure (months since vault opening), split by vault-level and wallet-level data. Wallet owners tend to move debt (migrate) across different vault types and the vault-level analysis could overestimate the extent to which users tend to exit Maker’s vault service overall. If a user closes a WBTC-A vault and opens up a stETH-A vault instead, that shouldn’t count as churn. We want to understand retention over time and also the difference between wallet-level and vault-level analysis. The y-axis shows the percentage of vaults still being active (1=100%) and x-axis shows the number of months since the vault was opened (its tenure). On the top-left corner of the chart we see that all vaults are active in the first month of their usage while on the borrow-right corner we can see that less than 5% of vaults/wallets tend to remain active after 36 months after opening their vault (this is a less reliable data point given that the majority vaults didn’t experience such a long tenure). Additionally, 30% of wallets tend to still be active after a year of usage, similar when looking at vault-level. The difference in minor which shows that we can use vault-level approximation to extend our scope of the analysis in the rest of the report. The representative/median tenure before churning is 5 months. It is clear that there is a rapid drop in share of active vaults/wallets in the first months after opening (30% of the individual cohort’s vaults tend to drop off). This can be a good investigation point why that happens. One reason could be a (too) high learning curve for vault management which could be improved with providing more learning resources.  1175×627 35.9 KB   Vault Survival Curve split by Collateral Symbol We continue by visualizing survival curves across major collateral symbols. We can see that stETH has the best early retention, followed by WBTC and ETH. This could be caused by older collateral symbols having more older vaults in the sample which churned faster in the past than they do today (e.g. Black Thursday event). At a 1 year retention mark we can see a different pattern of stETH vaults having the lowest survival rate (15%) compared to WBTC and ETH whose share is between 25% and 30%.  1181×627 41.2 KB   Vault Survival Curve split by Liquidation Churn State One of the major reasons for vault churn could also be the experience of a liquidation. It is interesting to see whether vaults that experienced a liquidation on the day of the churn tend to (on average) churn earlier than those that didn’t. Interestingly, empirical data shows that the difference is negligible.The minor difference in the analysis (in both directions) is most likely caused by various ecosystem changes.  713×455 32.1 KB   Vault Survival Curve split by Vault Type (ETH Collateral) Next we look at survival curves per vault type for a specific collateral: ETH. The chart below shows a pattern of the better retaining vault types being ETH-C (low fee, high liquidation ratio) and ETH-A (medium fee, medium liquidation ratio) with the worst retaining vault type being ETH-B (high fee, low liquidation ratio). This reflects the intuition of more risk-tolerant vault type users being more likely to be churn because they are more likely to optimize for capital efficiency across the ecosystem. The survival rates are much more similar when looking at this for stETH and WBTC.  1186×629 42.4 KB   Vault Survival Curve split by Debt Size Another way to split vaults is by their maximum exposure throughout their entire lifetime. Before we look at the survival curves, there is a chart below of the number of vaults across different maximum vault sizes. We only focus on ETH, stETH and WBTC collateralized vault types. As expected, a large percentage of vaults don’t reach above 100,000 of DAI exposure (60% of all). At the extreme, 165 vaults reached 10M DAI and above exposure at some point.  1099×520 25.8 KB  Now that we have a better intuition about the number of vaults that are represented in each of the vault size buckets, we can look at survival curves. There is a clear pattern of improved retention with the increased maximum vault size. After a year of usage, 70% of vaults with 100M+ DAI exposure remain active. This is in contrast to vaults with 10,000 DAI to 100,000 DAI exposure where 25% of vaults are still active after a year. Meanwhile, we need to take into account that it’s more difficult to generalize with a small sample size (which is visualized in the wide confidence intervals), especially with the largest vault size buckets. Nonetheless, the pattern is so clear that there is no doubt that large vaults tend to (on average) use Maker’s vault service longer.  1182×630 64.8 KB   Conclusion In this report we investigated the extent to which vault owners tend to use their vaults over time. At a high-level, we learned that 30% of vault owners tend to continue using Maker’s vault service after a year after opening their first vault. The typical vault owner (that hasn’t churned yet) has been using Maker’s vault service for a little over a year. In general, we haven’t seen a large difference in how different vault types across different collateral symbols are retained. Instead, we noticed a difference in ETH-collateralized vault types where vault owners of risk-tolerant vault type (ETH-B) tend to churn earlier compared to vault owners of more risk-averse vault type (ETH-C). Also, there was no clear detected tenure after which vaults tend to not churn as much. The survival curves showed a gradual, monotonous decrease in the share of vaults still active. Interestingly, we didn’t observe a major difference in retention between vaults that were liquidated on their last day of usage compared to vaults that weren’t. Additionally, it’s clear that there is a large, 30% drop in active vaults after 1 month of their usage. It could be valuable to investigate further why that happens with a more qualitative research approach. We also showed that larger vaults tend to (on average) keep their vaults open longer than smaller ones. After a year of usage, 70% of 100M+ DAI vaults tend to be retained, in comparison to 25% of vaults in the 10,000 DAI to 100,000 DAI bucket.  Future Work An informative direction for extending churn analysis is to look at the activity of churned wallets in other protocols and see whether we can detect cross-protocol migration dynamics. To provide an example we extracted relevant data for the Aave v2 Ethereum Mainnet network. This approach can further be expanded into other lending protocols and/or chains. About 3500 wallets churned at Maker this year with their exposure 1 week before their churn totaling to $4.3 billion. Around 3.5% of these wallets are currently active at Aave (118) with a total borrow of $153 million. Top 3 largest wallets contribute 75% of the total borrowed amount. This shows a strong power law distribution which is consistent across the ecosystem (whale dominance). This indicates that most of the churned wallets/exposure didn’t migrate to Aave (v2 Mainnet) and was rather moved elsewhere. Besides that, we are only focusing on one direction of exposure migration, we could also look at the inverse (churned Aave exposure migrating to Maker). Finally, the market prices have decreased significantly since the beginning of the year which also skews the analysis of exposure amounts. These are some of the points that can be tackled in our future research. ",
                    "links": [
                        "https://towardsdatascience.com/introduction-to-survival-analysis-the-kaplan-meier-estimator-94ec5812a97a",
                        "https://en.wikipedia.org/wiki/Survival_function",
                        "https://en.wikipedia.org/wiki/Censoring_(statistics)",
                        "https://en.wikipedia.org/wiki/Omitted-variable_bias",
                        "https://en.wikipedia.org/wiki/Logrank_test",
                        "https://maker.blockanalitica.com/",
                        "https://forum.makerdao.com/t/the-risk-core-unit-2022-year-in-review/19372",
                        "https://forum.makerdao.com/t/governance-and-risk-215-thursday-november-10-at-17-00-utc/18728/3",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2022/19046",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/31"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.294659426490822
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/11/2022-15:07:01",
                    "content": "    josolnik:  After a year of usage, 70% of vaults with 100M+ DAI exposure remain active. This is in contrast to vaults with 10,000 DAI to 100,000 DAI exposure where 25% of vaults are still active after a year.   Is there any insight into how the DAI is used differently by these two subsets? The larger are likely conducting ongoing business activities, but just curious if there’s a way to understand if there’s a “stickier” subset of the smaller users based on how the DAI is utilized. Wonderful write-up. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.395833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/josolnik",
                    "index": "#3",
                    "likes": "1",
                    "time": "08/11/2022-16:53:39",
                    "content": "    GFXlabs:  Is there any insight into how the DAI is used differently by these two subsets? The larger are likely conducting ongoing business activities, but just curious if there’s a way to understand if there’s a “stickier” subset of the smaller users based on how the DAI is utilized.   Good question. We’d need to gather where individual wallet’s/vault’s DAI is located over time to answer this which is something that we currently don’t have in our data source. Data platforms like Dune Analytics have this partially (most likely you’re familiar with @SebVentures’s query on Where is my DAI) but they cover a limited scope of questions that can be answered. We’ll look into how we can extend this, thank you! ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2022/19046"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5773809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/11/2022-19:53:44",
                    "content": "To what extent do any of the CU teams know the identity of vault users? Do we as an organization have a direct relationship with any of them, especially the largest? Is MakerDAO about to pro-actively gauge vault user satisfaction through relationship management and otherwise independently monitor publicly available information about their financial condition in order to forecast probability of large payoffs/permanent vault closures (or bad debt)? Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.885204081632653
                },
                {
                    "author_link": "https://forum.makerdao.com/u/josolnik",
                    "index": "#5",
                    "likes": "1",
                    "time": "09/11/2022-18:19:43",
                    "content": "    ACREinvest:  To what extent do any of the CU teams know the identity of vault users? Do we as an organization have a direct relationship with any of them, especially the largest? Is MakerDAO about to pro-actively gauge vault user satisfaction through relationship management and otherwise independently monitor publicly available information about their financial condition in order to forecast probability of large payoffs/permanent vault closures (or bad debt)?   We do know (or sometimes, speculate based on-chain data investigation) the identity of some of the vaults owners. While our CU also worked proactively with some of the organizations directly, this has been primarily the domain of @Growth-Core-Unit. So the vault user satisfaction part of the equation is mostly catered by them. Our domain is more about accessing the financial condition of these vaults, monitoring them actively. This is also why we developed the vault protection score methodology last year to automate some of the key aspects of this assessment (which can be seen in our dashboard) ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-vault-protection-score/10532",
                        "https://maker.blockanalitica.com/wallets/7-siblings/",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2022/19046"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.462797619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#6",
                    "likes": "1",
                    "time": "17/11/2022-02:44:23",
                    "content": "Does anyone know if Gemini provides a report or dashboard of where GUSD collateral is held (proof of reserves)? Similar to the transparency provided by circle for USDC collateral? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#7",
                    "likes": "0",
                    "time": "17/11/2022-14:38:24",
                    "content": "I’d like to better understand the units used on the X-axis in the above charts. Is it days? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#8",
                    "likes": "2",
                    "time": "17/11/2022-15:21:42",
                    "content": "It’s months. See here     josolnik:  Additionally, we can see that the longest tenure for a vault was 36 months which is aligned with the date when MCD was initially launched.    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#9",
                    "likes": "1",
                    "time": "17/11/2022-15:40:59",
                    "content": "Thanks @lyt ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccb_roci",
                    "index": "#10",
                    "likes": "0",
                    "time": "23/01/2023-19:13:43",
                    "content": "Really interesting analysis @josolnik. Is there a way that you or @Risk-Core-Unit can scrutinize the users who churned, i.e. are they high or low value to Maker? Simple heuristics like below could tease out “high versus low” value to Maker and other lending protocols.  Avg loan size - across DeFi Avg loan duration - across DeFi Number of borrows - across DeFi Liquidations - across DeFi  Analyzing the 3500 wallets that churned for value could uncover more insights beyond the total amount churned of $4.3 billion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.663888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/josolnik",
                    "index": "#11",
                    "likes": "0",
                    "time": "24/01/2023-21:25:50",
                    "content": "Good point @ccb_roci . We’ve worked on gathering more data across the DeFi ecosystem in the past months to get a better contextualized view of wallets that interacted with Maker at some point. Focusing on some major lending protocols already because of D3M monitoring (Aave and Compound) but also in general all relevant interactions. So as you noticed well yourself, this can be a good extension of this analysis. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6640625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccb_roci",
                    "index": "#12",
                    "likes": "0",
                    "time": "24/01/2023-21:58:51",
                    "content": "Nice! Very cool to hear that. Is there an API or csv of these churned addresses by chance @josolnik? I’d be curious to do some initial EDA on this front to see if anything stands out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3812500000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/josolnik",
                    "index": "#13",
                    "likes": "1",
                    "time": "27/01/2023-23:15:03",
                    "content": "    ccb_roci:  Nice! Very cool to hear that. Is there an API or csv of these churned addresses by chance @josolnik?   For specific data requests it is best to reach out to @data-insights-cu. We operate on the consumer side as they also support us with relevant data for our analyses. Then you can easily identify churned vaults by filtering out the ones that had exposure at some point but have their position closed down now (or some other definition that you choose). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.476543209876543
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccb_roci",
                    "index": "#14",
                    "likes": "2",
                    "time": "08/03/2023-21:44:35",
                    "content": "Following up on this finally. We pulled Maker’s historical user data across all of DeFi; including which protocols they’ve interacted with beyond Maker.   docs.google.com    MakerDAO Maker Only  address,credit...      Data features will include - borrow, repay, liquidations, days since first borrow, and protocols used. Perhaps this can help the @Risk-Core-Unit tease out user level value analysis for churned vaults. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/14kQp-W48s7lWG3b56oZvWfAbLYv2jUz6TW5HN7aOsEs/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/14kQp-W48s7lWG3b56oZvWfAbLYv2jUz6TW5HN7aOsEs/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                }
            ]
        }
    ]
}