{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/lending-protocol-inverse-finance-loses-15-6m-in-crypto-following-hack/14423",
            "title": "Lending Protocol Inverse Finance Loses $15.6M in Crypto Following Hack ",
            "index": 14423,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "3",
                    "time": "04/04/2022-11:04:38",
                    "content": "The hackers keep going, so we must remain vigilant and one step ahead. According to PeckShield, a blockchain security firm, the hacker took advantage of a vulnerability in a Keep3r price oracle the firm used to track token prices, tricking the oracle into thinking the Inverse INV token had gone really high. From there, the attacker had apparently taken out multi-million-dollar loans using INV as collateral. The report says that the attack took some serious funding to pull off. The attacker reportedly withdrew 901 ETH, or around $3 million, from Tornado Cash.The attacker subsequently injected the mystery funds into various trading pairs on the SushiSwap decentralized finance (DeFi) exchange, inflating the INV price in the eyes of the Keep3r oracle. After that, with the price high enough, the hacker took out the loans before arbitrageurs brought the price back to normal levels. There are many articles online. Here is one.    Bitcoinist.com – 4 Apr 22    Hackers Steal $15.6 Million From Ethereum-Based Lending Protocol Inverse... Hackers are at it again, and this time an open-source protocol for lending becomes the latest victim.      ",
                    "links": [
                        "https://bitcoinist.com/hackers-steal-15-6-million-from-ethereum/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.254166666666666
                }
            ]
        }
    ]
}