{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/pre-mip-discussion-psm-flapper/6378",
            "title": "Pre-MIP discussion: PSM flapper ",
            "index": 6378,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#1",
                    "likes": "4",
                    "time": "05/02/2021-14:53:07",
                    "content": "There is currently a discussion going on in MIP35 that would see maker lend assets purchased via the PSM to compound in order to gain some interest. I would posit that a better decision for maker to would be to try and get the USDC off of its books outright. so the TLDR of everything below is: auction off USDC to buyback MKR instead There are basically 3 motivations behind this in my mind:  In order for the PSM to do its job there needs to be sufficient room between the current liabilities and the line of the PSM.  As a result of this it seems maker is going to need to raise the line to infinity in order to ensure that there is sufficient headroom in the PSM.   Holding tons of USDC is not capital efficient bc of inflation associated with the USD.  solving this through lending via compound (or any other protocol) introduces even more counter-party risks that maker then needs to contend with.   There are counter party risks associated with USDC. (Not to mention the counter-party in question is your largest competitor)  However in order to be able to get the USDC that was purchased via the PSM off the books maker first needs to pay down it’s liabilities associated with the PSM. See this post explaining dai liabilities. Luckily the protocol has a large store of equity that it can use in order to do this. image1098×246 9.3 KB The surplus buffer. So what i would suggest, is that instead of storing ALL of this equity as DAI in the surplus buffer we can convert a portion of it into equity stored via USDC in the PSM. So how do we do this? Well first we need to decide the rate at which we want to pay down the liabilities of the PSM. This could be implemented in a number of ways, but i would suggest that we pay it down like interest (maybe call the rate tint). That is, the PSM would have some annualized percentage rate associated with it and that rate would be “payed” to reduce the protocol’s DAI liabilities.  As far as the technical implementation of how to pay i believe all that needs to be done is to increment the systems sin. This would mean that over time the system would accrue sin via the PSM and once that sin reached 50K dai it would be paid off via the system buffer just as it is today. Over time this would mean that the protocol would gather equity in the PSM, so once you have 10,000 USDC worth of equity stored there you should be able to kick a flap auction the same as you do today with DAI only this time you’re auctioning off USDC instead. The nice thing about this does not change the overall amount of MKR you’re buying back. This is because you don’t destroy any equity with this scheme you just change it’s storage medium. Downside is that it does have implications on how quickly you can store DAI in the stability buffer which is still important as DAI is the systems unit of account. I wanted to throw this idea out there before MIP35 got too far along as a potential alternative, so this post is a bit rushed. That said, What do people think? ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdao-accounting-and-implications/5346",
                        "https://forum.makerdao.com/t/weekly-mips-update-28/6791",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-128-thursday-february-11-17-00-utc/6367/2",
                        "https://forum.makerdao.com/t/governance-at-a-glance-feb-5-11-2021/6507",
                        "https://forum.makerdao.com/t/maker-relay-ep-31-en-espanol/6455",
                        "https://forum.makerdao.com/t/maker-relay-ep-31/6450",
                        "https://forum.makerdao.com/t/mip35-peg-stability-module-compound-mixed-exposure-with-farming/6024/36",
                        "https://forum.makerdao.com/t/informal-poll-reduce-pressure-on-usdc-psm-through-a-mkr-psm/8430/13"
                    ],
                    "GPT-summary": "The author of the post is proposing an alternative to a current discussion in MIP35. The proposal suggests auctioning off USDC to buyback MKR instead of lending assets purchased via the PSM to Compound. The post explains the motivations behind the proposal and suggests a technical implementation. The post ends with the author asking for feedback on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.510714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/02/2021-15:02:12",
                    "content": "Flipper you mean? We can’t sell usdc to buy mkr as they are collateralised. But a flipper for stable coin to allow liquidation would be a good thing. BTW thanks for moving the debat somewhere else. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.979166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#3",
                    "likes": "1",
                    "time": "05/02/2021-15:04:45",
                    "content": "    alexis:  Flipper you mean?   No i mean a flapper. Today the flapper sells equity to buy MKR. The proposed auction system above would do the same thing (i.e selling equity) only this time the equity in question is stored as USDC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#4",
                    "likes": "1",
                    "time": "05/02/2021-15:10:26",
                    "content": "Also i see NO reason why this is true.     alexis:  We can’t sell usdc to buy mkr as they are collateralised.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "0",
                    "time": "05/02/2021-15:10:28",
                    "content": "If you sell collateral to buy MKR, that doesn’t work. You don’t have the counter part of the Dai. The system will automatically or not trigger the flop. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#6",
                    "likes": "0",
                    "time": "05/02/2021-15:14:09",
                    "content": "    alexis:  If you sell collateral to buy MKR, that doesn’t work. You don’t have the counter part of the Dai.   you’re not  selling collateral in the traditional sense here. You first have to write off amount you are selling as sin or otherwise the accounting doesn’t work, but once you have done that you have reduced the system’s overall dai liabilities. Your assets didn’t change in doing that and your liabilities went down. That is equity by definition. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.118055555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#7",
                    "likes": "0",
                    "time": "05/02/2021-15:16:16",
                    "content": "But in that case in case of emergency shutdown. Some Dai owners won’t get they due. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#8",
                    "likes": "0",
                    "time": "05/02/2021-15:19:40",
                    "content": "    alexis:  But in that case in case of emergency shutdown. Some Dai owner won’t get they due.   this isn’t true either. by writing off as sin you are reducing your dai liabilities and thus the overral amount of dai there is. Bc you wrote it off as sin the DAI in the surplus buffer never makes it to the market so there is no-one holding some lien on the asset in question and the protocol is then free to do whatever it wants with it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#9",
                    "likes": "0",
                    "time": "05/02/2021-15:24:56",
                    "content": "I am not convinced that you can sell collateral to buy MKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#10",
                    "likes": "1",
                    "time": "05/02/2021-15:27:36",
                    "content": "that is bc traditionally collateral has been an encumbered asset. Once you remove the liability from the equation the asset is no longer encumbered and you are free to do whatever you want to with it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "0",
                    "time": "05/02/2021-15:33:32",
                    "content": "This is a pretty cool idea! One question though (and a potential follow up), What would happen to the MKR we buy? If we are holding it, doesn’t that introduce some extra risk during a market crash in that our balance sheets would be getting hit from both sides? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.859375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#12",
                    "likes": "1",
                    "time": "05/02/2021-15:44:34",
                    "content": "    prose11:  What would happen to the MKR we buy?   I didn’t cover that fair. Today when the protocol sells its equity to buy MKR it burns the MKR. I would presume the system described above would do the same. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#13",
                    "likes": "3",
                    "time": "05/02/2021-18:59:34",
                    "content": "If I’m understanding this proposal correctly, you’re just adding leverage to the system by selling collateral to purchase MKR? This results in “unbacked” Dai. The Dai that was generated in order to purchase the USDC is now backed by MKR which is extremely volatile. Unless I am misunderstanding your proposal? A diagram would be helpful. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#14",
                    "likes": "1",
                    "time": "05/02/2021-19:14:47",
                    "content": "I believe the idea is to slowly buy back the collateral using the income. But there is another catch, the PSM needs the debt to reverse the position, during the buy to maintain the peg on the other direction. If you buy the collateral how do you maintain the peg on the opposite direction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#15",
                    "likes": "1",
                    "time": "05/02/2021-20:45:29",
                    "content": "    g_dip:  Unless I am misunderstanding your proposal? A diagram would be helpful.   Yeah Ill try and put together a diagram to demonstrate what’s going on here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#16",
                    "likes": "0",
                    "time": "06/02/2021-03:54:46",
                    "content": "    g_dip:  Unless I am misunderstanding your proposal? A diagram would be helpful.   Ok here are some images to help visualize this. First lets take a look at Makers balance sheet. Untitled-2900×600 18.5 KB Note on the picture above positive numbers are in green negative numbers are in red. So you have some assets you have some liabilities nbd. Some of the assets are loans some is the USDC stored in the PSM. Now lets say you’ve decided that you want to pay down the PSM liabilities at the a rate of 2% / year. That roughly works out to 1MM DAI that you would be taking from the protocols income to pay down the PSM liabilities. This is what I am suggesting you do by “writing off the psm’s dai liability as sin.” Untitled-3.1900×600 20 KB After doing that your balance sheet looks a bit more like this: Untitled-4900×600 19 KB Notice now that the PSM assets and liabilities are not balanced as they were before. So really your balance sheet looks a little more like this after doing that. Untitled-5900×600 20.5 KB And this 1MM in USDC equity is now what you can sell in a flap auction. Untitled-61800×1200 31 KB There is no leverage involved in doing this though. The protocol is using money it already has to pay down its liabilities. Like @alexis says there are some catches with this though:  The protocol would be contracting its balance sheet in doing this. That means there is less DAI supply out in the market and that could lead to upward pressure on the peg, but you can manage this by setting your rate to a sufficiently low number. You’ll notice that in doing this there actually is less DAI in the stability buffer when all is said and done. There isn’t anything “wrong” with this per se, but you don’t want to get too carried away with it bc  there is market risk exposure that you need to hedge against.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.163825757575758
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#17",
                    "likes": "3",
                    "time": "06/02/2021-04:16:54",
                    "content": "Ah got it. So to summarize: Instead of selling Dai from the surplus buffer to buy MKR, sell USDC from the PSM. I think this is smart  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#18",
                    "likes": "3",
                    "time": "06/02/2021-09:33:17",
                    "content": "I think there is some issues with your representations. First, the assets and liabilities(+equity) sides should be equals at all times. The stability buffer is our equity and should be on the liabilities side. Now you are faced with the issue of which of your DAI box you decrease. There are not 2 pools of DAI but only one and they have 0 links to the asset side. Let me present my perception of what happen when we buy&burn MKR “from the surplus buffer” image1322×705 19 KB And what you suggest image1131×690 15 KB While different, they lead to the same outcome. The Buy&Burn with DAI increases the DAI supply (decreasing the surplus buffer while the balance sheet size remains the same). The Buy&Burn from USDC decreases the balance sheet size. But if the DAI demand stays constant (which we can assume), this will decrease the DAI price (supply vs demand). Therefore, this will be arbitraged using the PSM by providing DAI to get USDC. This will decrease our USDC assets and our DAI liabilities. Both methods are doing more or less the same. With USDC it is more efficient, but with DAI we get the PSM fees and DAI is a bit de-peg until arbitrage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.492424242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#19",
                    "likes": "0",
                    "time": "06/02/2021-11:37:04",
                    "content": "Having USDC as reserve is not interesting for us as we have an indirect interest fees on Dai. We can have some but Dai is a better option for multiple reasons. Also why do you focus on PSM, there is plenty of abandoned usdc vault, aren’t they us now? Also the PSM needs the USDC for the opposite peg which is actually probably a bigger problem as in the opposite side the only solution is to buy instead of selling. The reality is that we can’t just buy all collaterals with the interest product. It doesn’t sum up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#20",
                    "likes": "0",
                    "time": "06/02/2021-12:08:46",
                    "content": "Hmm maybe it’s possible to put USDC in PSM to gain rewards by lending out but that can be withdrawn if needed? So for simple example, let’s say there’s 50 million USDC and then 50% are put into protocol that generates 5% yield. After a year, it would be yield of 1.25 million USDC. And maybe the protocol can use this 1.25 million USDC “surplus” to buyback MKR and etc? Just thought ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#21",
                    "likes": "0",
                    "time": "06/02/2021-12:30:16",
                    "content": "Yes that is possible we actually get the fees back so we have a clean (with out slippage) 1:1 conversion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#22",
                    "likes": "1",
                    "time": "06/02/2021-15:16:46",
                    "content": "    Doo:  Hmm maybe it’s possible to put USDC in PSM to gain rewards by lending out but that can be withdrawn if needed? So for simple example, let’s say there’s 50 million USDC and then 50% are put into protocol that generates 5% yield. After a year, it would be yield of 1.25 million USDC. And maybe the protocol can use this 1.25 million USDC “surplus” to buyback MKR and etc? Just thought   So IMO this is pretty much the same idea as what is being proposed to in mip 35. IMO its not really a great idea because you keep all of the counter-party risks that you have from holding USDC but once its lent there are a bunch of new risks that you have introduced. Just look at this business going on over at yearn.   twitter.com    banteg (bantg)  Yearn DAI v1 vault got exploited, the attacker got away with $2.8m, the vault lost $11m. Deposits into strategies disabled for v1 DAI, TUSD, USDC, USDT vaults while we investigate. https://t.co/1RWYyu0d5m  10:18 PM - 4 Feb 2021     730          270            ",
                    "links": [
                        "https://twitter.com/bantg/status/1357453626847952896",
                        "https://t.co/1RWYyu0d5m",
                        "https://twitter.com/bantg/status/1357453626847952896"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.9914772727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#23",
                    "likes": "0",
                    "time": "06/02/2021-15:31:50",
                    "content": "Great response, I think what you have there is a better picture of what is going on. I did have some comments though.     SebVentures:  The Buy&Burn from USDC decreases the balance sheet size. But if the DAI demand stays constant (which we can assume), this will decrease the DAI price (supply vs demand).   I think this bit about the DAI price is backward no? We are decreasing supply and demand is the same. If supply is less than demand then prices go up, so shouldn’t this lead upward pressure on DAI price? I would note the extent to which this happens can be controlled via the rate you would be setting here. If the peg is in a bad state (>> $1 / DAI) you could set the rate here to 0% and then the system would be behaving just as it is today. You also stated that this will be arbed using the PSM. This could be true, but i would posit that it is a presumption. You’re just as likely imo to see new leverage from vaults. Ultimately, both seem like “good” outcomes to me on their face though. Either you have new loans you are collecting interest on or you have new tin fees that you collect from PSM arbing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.496843434343434
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#24",
                    "likes": "0",
                    "time": "06/02/2021-15:56:01",
                    "content": "    alexis:  Also why do you focus on PSM, there is plenty of abandoned usdc vault, aren’t they us now?   Ultimately i just see this as a different problem with the current system, and I think this is a problem that is being looked at. On the other hand i don’t really see any discussions happening around what we are doing with all of this USDC we are collecting that don’t seem to revolve around lending it and taking on even more risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.479166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#25",
                    "likes": "4",
                    "time": "06/02/2021-18:00:57",
                    "content": "    Doo:  Hmm maybe it’s possible to put USDC in PSM to gain rewards by lending out but that can be withdrawn if needed? So for simple example, let’s say there’s 50 million USDC and then 50% are put into protocol that generates 5% yield. After a year, it would be yield of 1.25 million USDC. And maybe the protocol can use this 1.25 million USDC “surplus” to buyback MKR and etc? Just thought   One other thing that i want to say about all of this USDC lending and buying business. This is a bit of a tangent to my main points above, but i think it is still relevant to this discussion. The PSM in my view is a necessary evil. The DAO needed a tool to create negative price pressure that didn’t conflict with the fundamental promise of DAI which is that 1DAI is worth $1 at ES. The PSM seems to have been able to serve this need. But at the end of the day USDC is DAI’s biggest competitor to be the number 2 USD stablecoin product, so any deal where you ostensibly create demand for their product is counter productive IMO. It really all boils down to this market share picture. MakerDAO - 2021-01 Presentation960×540 88.2 KB You want DAI to eat into USDT’s position as much as it can, and preferably you are doing it faster than USDC is able to. The picture above shows that at the moment USDC is doing a better job at grabbing USDT’s market-share, and DAI is playing some part in that by buying up all of their coins. So really what is the DAOs motivation to increase the USDC liquidity by lending? Is doing that growing their market share? I don’t want to rabbit-hole on this too much bc it is tangential to what i think the real motivations and issues are with this proposal, but i did want to add limiting the terms of your deal with the devil might be worth doing in it’s own right. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.646048999309868
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#26",
                    "likes": "1",
                    "time": "07/02/2021-15:39:32",
                    "content": "Right - if I understand correctly, you’re basically just removing Dai from the surplus buffer and then using an equivalent amount of USDC to purchase MKR.  This action itself shouldn’t affect the dai price, but afterwards you divert more Dai to the surplus to replenish it, which has the effect of less Dai going back into circulation (from FLAP auctions), which should result in upward pressure on the Dai price.  My main question is don’t you need to know the DAI/USDC rate to decide how much Dai surplus to write off as Sin? If so, where will the system get this rate?  Overall, I strongly support this idea as I agree it will tend to generate more fees for MKR and also getting USDC out of the system is a huge positive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.102633477633478
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#27",
                    "likes": "1",
                    "time": "07/02/2021-16:00:42",
                    "content": "    latetot:  My main question is don’t you need to know the DAI/USDC rate to decide how much Dai surplus to write off as Sin? If so, where will the system get this rate?   Hi great question. My take assumption had been that you would assume that the value of USDC and DAI were equivalent just as the protocol does in most situations. I suppose you could stand up some USDC/DAI oracle to address this concern, but I’m not sure if it is necessary. If anyone else has thoughts on the matter please share. Assuming that you wanted to do this I suppose @Oracles-Core-Unit would be the best people to ask about where to get the rate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.726190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#28",
                    "likes": "0",
                    "time": "07/02/2021-16:37:47",
                    "content": "Right, you could assume 1:1 price, but if Dai is above its peg, this will result in removing more Dai from the surplus than needed and less purchasing power will be available for the FLAP auctions (as compared to using DAI for the FLAPs).  If Dai is below the peg, then assuming 1:1 may be a good strategy since more purchasing power is available for the FLAP auctions and using USDC for FLAPs will help support the DAI price. I think it will be more effective to use an oracle to capture the actual DAI-USDC price, but then set a floor at 1:1 if below peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.690476190476192
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#29",
                    "likes": "0",
                    "time": "07/02/2021-17:08:06",
                    "content": "@SebVentures do you have any thoughts on what @latetot is saying here ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#30",
                    "likes": "1",
                    "time": "07/02/2021-17:32:17",
                    "content": "I would put DAI and USDC at $1 all the time (as it is being done already). Not sure I see any problem with that. Overall, I also think that having USDC is not ideal but the best solution for the peg right now. Buying MKR doesn’t really provide much. What is needed is to stop using so much USDC as a liquid asset reserve and use something else. One path is cDAI/aDAi/fyDAI (which is exactly how the banking system handles money supply/demand imbalance). Not sure we need to care too much about competition from USDC, we should focus on delivering a better product. For that subsidizing (or not farming) DAI related AAM LP pairs is one solution. But far from enough. We need to find creative ways to use out excess of DAI demand to increase even more the DAI demand. I can’t believe there are no ways in which 300M of capital to allocate can’t help to increase the value of the DAI ecosystem. PS: cDAI/aDAI would decrease the borrowing rates for DAI which I’m not so sure is good for DAI. If it’s not good, we should use USDC to push down rates on money markets. If USDC owners can’t get a yield good enough, they might switch to DAI (which lead to more USDC to compress rates). I’m not sure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.926031746031746
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#32",
                    "likes": "1",
                    "time": "07/02/2021-17:41:52",
                    "content": "    latetot:  If Dai is below the peg, then assuming 1:1 may be a good strategy since more purchasing power is available for the FLAP auctions and using USDC for FLAPs will help support the DAI price.   Thinking about the implications of this in terms of balance sheet Expansion and Contraction it may make sense to actually care about the DAI/USDC rate. So in instances where the peg is > than one the prevailing theory is that you need balance sheet expansion to deal with that. So by writing off 0.9999 DAI for every usdc sold would effectively be doing that right? In instances where peg is < 1 you need to contract the balance sheet so writing off 1.1 DAI for every USDC sold would effectively contracting the balance sheet even more. (the numbers above are completely hypothetical obviously) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.675324675324675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#33",
                    "likes": "0",
                    "time": "07/02/2021-17:44:21",
                    "content": "    SebVentures:  Buying MKR doesn’t really provide much   Well it means that the protocol is keeping less reserves in depreciating assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#34",
                    "likes": "0",
                    "time": "07/02/2021-17:44:34",
                    "content": "    SebVentures:  cDAI/aDAI would decrease the borrowing rates for DAI which I’m not so sure is good for DAI. If it’s not good, we should use USDC to push down rates on money markets. If USDC owners can’t get a yield good enough, they might switch to DAI (which lead to more USDC to compress rates). I’m not sure.   I believe there is already a lot of arbitration on compound with the rate Dai/Usdc. If you push one down the other follow. My problem is more the rate decrease that will lead to decrease our rate, but in another hand we have crop join we give part of the reward for little risk on the vault owner. And most Dai we generate go to compound indirectly too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.83707264957265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#35",
                    "likes": "0",
                    "time": "07/02/2021-17:46:23",
                    "content": "    Andy_McCall:  So in instances where the peg is > than one the prevailing theory is that you need balance sheet expansion to deal with that. So by writing off 0.9999 DAI for every usdc sold would effectively be doing that right?   It is already more or less what we do if the tout is set to 0% we clean the debt by selling the Usdc for dai. The issue by selling the Usdc for MKR or Dai is that you end up selling at a higher price than what you bought it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.529761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#37",
                    "likes": "0",
                    "time": "07/02/2021-18:19:19",
                    "content": "I got the catch I missed. As you don’t return the dai to the market by selling it for MKR you indirectly decrease the dai supply which should lead to more use of the PSM. At the end of the day you will sell Usdc, create a pressure on the dai, the dai will go up and people will put Usdc into the PSM. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#38",
                    "likes": "1",
                    "time": "07/02/2021-18:19:20",
                    "content": "If Dai is trading at 1.01 USDC e.g., why would you swap it with USDC at a price of 1.00 (or more precisely write Dai off as sin at 1.00) ?  This would effectively result in less USDC purchasing power available for the FLAP auction and also require more DAI than needed to be diverted back to the surplus buffer, which has the effect of putting more positive pressure on the Dai price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.6447811447811445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#39",
                    "likes": "0",
                    "time": "07/02/2021-18:22:09",
                    "content": "    alexis:  At the end of the day you will sell Usdc, create a pressure on the dai, the dai will go up and people will put Usdc into the PSM.   Again this is a presumption. You just as well may see people increase the amount of debt they are caring. In either case though this basically seems like a “good” outcome to me, but I could be wrong about that. Either you are collecting new tin fees as people put money back in the PSM or new debt means interest over time. Further the extent to which this happens is controlled by the rate you set, so I think it is unclear the extent to which this is actually an issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.8106060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#40",
                    "likes": "0",
                    "time": "07/02/2021-18:26:40",
                    "content": "    Andy_McCall:  Again this is a presumption. You just as well may see people increase the amount of debt they are caring.   We are talking about 0.1% I don’t think that will influence people to take a loan.     Andy_McCall:  Either you are collecting new tin fees as people put money back in the PSM   But you sold it for more so you actually lose monies each time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.795454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#41",
                    "likes": "0",
                    "time": "07/02/2021-18:30:21",
                    "content": "    Andy_McCall:  Further the extent to which this happens is controlled by the rate you set   That is not entirely true. But either way it works as well for the PSM. If you put pressure on the dai by increasing the supply you will sell Usdc. The question is do we have a benefit to cut by half the rate of 90% of the supply to lend the 10% left. For reference the Eth rate was at 0% for 3 months without fixing the peg at all. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.572916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#42",
                    "likes": "3",
                    "time": "07/02/2021-20:48:31",
                    "content": "I think this proposal is quite interesting. I have some doubts about how much it can really help with offboarding USDC from PSM, although it certainly has some effect. For instance even if governance decided to “flap” all the revenues in USDC form, this would represent about 50m/year at new proposed rates and this is around 10% of current stablecoin collateral (assuming we can get stablecoin vaults into PSM). Which means stablecoin backing goes from 26% to 23% in a year. Useful but not a deal breaker. But I think this whole idea is more important because this solution of FLAPing other assets held directly by Maker can be very useful going forward. The bigger issue is with FLAPs efficiency in general and lack of keepers there, so we might want to first implement Liq2.0 to it. So I would say first priority is implementing Liq2.0 to Surplus Auctions if we wanted efficient FLAPs. Not to mention governance might want higher Surplus Buffer first, which could delay FLAPs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.069907723855092
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#43",
                    "likes": "0",
                    "time": "08/02/2021-06:04:56",
                    "content": "Ok i have given all of this “write off rate” and “losses” business some thought. See these two comments:     latetot:  My main question is don’t you need to know the DAI/USDC rate to decide how much Dai surplus to write off as Sin?       alexis:  The issue by selling the Usdc for MKR or Dai is that you end up selling at a higher price than what you bought it.   So i think this question really boils down to how much did the protocol pay for this asset? Because we want to be sure that if the protocol is selling assets it sells them at greater than or equal to the cost it bought it at. I think the important thing to note before we try and address this is that all of the protocols accounts are settled in DAI it doesn’t care about the USD value of anything, so what we want to know is “how much dai did the protocol buy this asset for?” Knowing that allows us to set a price floor, and since the protocol is ostensibly selling these assets to maker holders by buying and burning MKR it probably doesn’t want to charge a large premium in this trade. That being the case, what we probably want to sell off the asset at cost.  To figure out what the cost, is you need to look at the balance sheet again and how it changes in a PSM trade. What you are looking for here is how much did the protocol’s liabilities change in the asset purchase. That is your cost. I believe this is what it looks like. PSM-Cost900×600 15.2 KB You have (1 DAI - the tin amount) going to the asset seller and the tin amount going to the stability buffer, so how much did the asset in question “cost” the protocol? It cost 1 DAI, so if your are trying to sell this asset at cost you need to ensure that you sell it for 1 DAI to balance the books. Thus, the “write-off rate” for 1 USDC should be 1 DAI bc that is what the protocol spent. One thing i want to point out about this trade is that MKR holders get paid here too. That is the amount going to the stability buffer. Now lets come back to this losses business specifically: “by selling Usdc for MKR or Dai is that you end up selling at a higher price than what you bought it.” This is capital gains/losses and you incur those when you trade one asset for another, so the first thing that i want to note in this is that this happens when the USDC is purchased for DAI and it is happening today with the PSM with or without the addition of this proposal. Now we know that USDC value != to DAI value so by buying 1 USDC for 1 DAI someone has to be losing in that trade there is just a question of who. Well we can probably presume that it is not the seller of the USDC bc that actor wouldn’t interact with the contract if it lost money on the deal. The maker holders get the tin amount on the trade so they don’t lose there either. Now your probably thinking that it is the protocol because it paid the 1 DAI for the 1 USDC in the first place right. Well I don’t think so. This is because the protocol doesn’t really care. Like I said its accounts are settled in DAI so whatever the USD value of DAI is kind of irrelevant to the protocol. It just paid 1 DAI for some asset and that is all that matters to it. So if the asset seller didn’t lose any money and the protocol didn’t lose any money and mkr didn’t lose any money who did? The DAI holders I believe. Their assets (DAI) are being diluted in the trade and that ultimately ends up paying the difference. That is why putting money in the PSM brings down the DAI price. At the end of the day though I think all of this losses business is completely irrelevant to this proposal and if we really want to wrangle with that it is an issue with the PSM itself not with selling the assets that were purchased by it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.788938492063492
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#44",
                    "likes": "0",
                    "time": "08/02/2021-06:39:15",
                    "content": "    SebVentures:  we should use USDC to push down rates on money markets. If USDC owners can’t get a yield good enough, they might switch to DAI   Argument against this would be people may start to prefer to borrow USDC over DAI if the rates are lower for USDC furthering their market share lead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907407407407408
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#45",
                    "likes": "0",
                    "time": "08/02/2021-08:56:38",
                    "content": "    Andy_McCall:  Argument against this would be people may start to prefer to borrow USDC over DAI if the rates are lower for USDC furthering their market share lead.   Yes I don’t think that play that much as people switch from cusdc to cdai or new user will go for the higher rate. The actual flapping usdc to buy MKR, is actually way more complicated at the end as what it sound as we need to touch the core system to introduce a flap on assert.     Andy_McCall:  USDC value != to DAI   I had another thought about it, what if instead of using the income to burn MKR we use then with the delegator to wipe off the PSM debt by increasing its Dai position and the usdc stays inside as buffer? The delegator is easy to change, it has been modelling for that. The benefit of it is that we don’t need to do any auction so its direct with no lose. While I am not too much in favour as I think it is better to use the income and wait until the usdc unwind by itself this solution is easy to do with little effort and with little risk as we are outside the core system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.74313446969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#46",
                    "likes": "0",
                    "time": "08/02/2021-09:11:38",
                    "content": "    Andy_McCall:  So if the asset seller didn’t lose any money and the protocol didn’t lose any money and mkr didn’t lose any money who did? The DAI holders I believe. Their assets (DAI) are being diluted in the trade and that ultimately ends up paying the difference. That is why putting money in the PSM brings down the DAI price.   I disagree with it, the dai holders don’t lose on it as it is dai is worse 1dollar. The holder can sell it at 1 or buy it at 1. which is the value of it. The looser here is the trader that switch assert to dai, the trader will pay a 0.1% fees on it which is actually very cheap for him as this decrease the volatility, the other looser is the protocol as it takes the risk of the opposite assert (usdc) for a little price but this position is compensated by a better value of the dai due to the 1:1 peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0149691358024695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#47",
                    "likes": "0",
                    "time": "08/02/2021-09:43:39",
                    "content": "@SebVentures @Andy_McCall  I think sometimes there is a bit of confusion in the representation of “surplus buffer” in the t-account. A considerable portion of the SB is “interest income from loans (SF)” which by definition should be sitting under assets in the Maker balance sheet. I think the confusion may come from calling SB as if it was the bank capital (equity). SB and Equity are closely related, but not the same. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#48",
                    "likes": "0",
                    "time": "08/02/2021-16:02:13",
                    "content": "    alexis:  The looser here is the trader that switch assert to dai   Just take a look at this PSM transaction and you’ll see that this isn’t true. https://etherscan.io/tx/0x1bf875228cc97daaab84ed589ab983bcdaaf82adf947173b3f38a6ec9c0c9210 Edit: I spoke out of turn here.  Jumped a little too quickly to conclusion and didn’t notice that the most significant digits are a bit higher for the usdc:usd values. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.350694444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#49",
                    "likes": "0",
                    "time": "09/02/2021-15:50:25",
                    "content": "I had another thought about it, instead of trying to pay back the debt, we can have an exchange but you top it up with the reserve. The tout is above the PSM one and the tin is below the PSM one. It is less invasive than having an assert flap and the end result is that same. You will decrease the PSM and increase the use of this one. Feature are: Sell : take the gem and return dai minus fees Buy : take the dai and retern the gem minus fees Withdraw: only accessible by gov. It is also gas optimised Vs PSM. If you are happy with it and write the spec I can push the first draft for the code. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.708333333333333
                }
            ]
        }
    ]
}