{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govcomms-bi-weekly-update-sept-17-30/10596",
            "title": "GovComms Bi-Weekly Update: Sept 17 - 30 ",
            "index": 10596,
            "category": [
                "Core Units",
                "Governance Communications"
            ],
            "tags": [
                "com-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "2",
                    "time": "30/09/2021-14:59:53",
                    "content": " GovComms Bi-Weekly Update #4  Sep 17- 30  Administrative Update  Full-Time Team | Hiring an Engagement Lead We hired an Engagement Lead! Thomas Flitter will start with us on October 4th and will be leading our stakeholder engagement and organizational mapping efforts.  Contributor Team | Hiring Writers and Quality Assurers Our Public Call Summary Team is always looking for people. Don’t hesitate to reach out if you’re interested in contributing. And yes, it pays! Apply to join us by commenting on this thread! or by reaching out directly to Artem Gordon.  Budget Modification Incoming Now that we’ve been operating for a couple months we will be updating our budget to reflect more accurate information. Additionally, our team made an error by confirming the incorrect numbers while setting up our DssVest Dai stream and so we will be using this upcoming budget modification as an opportunity to re-configure our stream.  Work Being Done Since the launch of the CU, we have added a ton to our public drive. Supporting documentation around all our active projects is growing with project plans/descriptions, metrics tracking, and workflow process docs coming into existence and being iteratively improved upon.  GnR Call Optimization We worked with GovAlpha to improve the Governance and Risk call. The previous format was not scaling with the growing number of Core Units. Team update slots have been replaced by Team Discussion Slots. Core Units should no longer aim to provide a general update, but rather should use this time to present pertinent issues and topics related to their work for the purpose of educating and engaging stakeholders. Where can you find status updates from the various teams? On the forum of course!  MakerDAO Meeting Structure Revamp Our team, in partnership with GovAlpha and SES, are working on a plan for scaling MakerDAO meetings to accommodate the increasing number of teams and business initiatives.  Emergency Playbook Currently we are working on completing resources for two emergency types; Market Events and Wrench Attacks. This is in progress and will be for the coming months as we complete the full set of documentation.  MakerDAO People List We have started an internal people list, with a public version of this resource planned for the near future. The list contains Facilitators, known team members, known part-time contributors, PPG-OMC-001 members, and Recognised Delegates. A public version of this list is planned for release in late October.  Information Output Audit This has been put on lower priority, with continued progress planned for mid-October as we onboard the recently hired Engagement Lead. What began as a Team update audit has been expanded to a general “information output” audit. The main difference is that we are not isolating written or presented updates. Instead, we are documenting all the ways teams share information. Soon the DAO will have an easier way of comparing Core Unit information sharing practices, and Core Units will learn what they might be doing that others are not, and vice versa.  This project may result in actionable recommendations from our team on how we can all come to closer standards for team updates.  Issue Discussion Calls Our team has partnered with Content Production in the creation of an Issue Discussion call series. There is no recurring call schedule for this call series, we will be organizing them as-needed. The next call is currently being planned.  Public Call Summaries The team has upgraded its training for contributors! Join us and take the relatively short 2-4 hour paid training to start contributing to MakerDAO as a Writer or Quality Assurer.  Maker Relay Maker Relay continues to receive qualitative improvements. Publishing the written version has been handed off from Tim Black to Artem Gordon. Additionally, we are working with Content Production to eventually publish these on an official MakerDAO blog. We encourage Facilitators, CU members, and senior community members to join the #MakerRelay chat. This way coverage of any given topic can be addressed in a single location where all the collaborators can be found.  Maker Governance Review The September review is being published this coming Friday!  Discord Migration We are pitching in to help GovAlpha and Content with the migration by collecting DAO member discord handles to be pre-added to the server.  Published 09/17/21 - 09/30/21 Maker Relay (Dual effort between MKT-001 & COM-001) #63 Eng | #63 Esp #64 Eng | #64 Esp Forum at a Glance 09/17 - 09/23 09/23 - 09/30 Other Changes to the Governance and Risk call Collecting Discord Handles  Up Ahead  September Governance Review Issue Discussion Call 2x sprints planned; Team Information Output Audit & Emergency Playbook Public MakerDAO people list More progress on everything mentioned above.  ",
                    "links": [
                        "https://forum.makerdao.com/u/artem_gordon/summary",
                        "https://github.com/makerdao/mips/pull/383",
                        "https://drive.google.com/drive/folders/1GBAeTx4jmob7wRs7_LK32Bh_Y-pHzPvV?usp=sharing",
                        "https://forum.makerdao.com/t/changes-to-the-governance-and-risk-call-no-more-general-team-updates/10361",
                        "https://forum.makerdao.com/c/core-units/31",
                        "https://docs.google.com/spreadsheets/d/1sboOZZXIYaEKD62QlvZGqMtaNFuDZfqazpOmhy7q4dA",
                        "https://chat.makerdao.com/group/MakerRelay",
                        "https://forum.makerdao.com/t/transitioning-away-from-rocket-chat/10097",
                        "https://forum.makerdao.com/t/discord-migration-collecting-account-names/10415",
                        "https://forum.makerdao.com/t/maker-relay-ep-63/10400",
                        "https://forum.makerdao.com/t/maker-relay-ep-63-en-espanol/10443",
                        "https://forum.makerdao.com/t/maker-relay-ep-64/10540",
                        "https://forum.makerdao.com/t/maker-relay-ep-64-en-espanol/10548",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-17th-23rd/10475/8",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-24th-30th/10595",
                        "https://forum.makerdao.com/t/changes-to-the-governance-and-risk-call-no-more-general-team-updates/10361",
                        "https://forum.makerdao.com/t/discord-migration-collecting-account-names/10415",
                        "https://forum.makerdao.com/t/maker-relay-ep-65/10697",
                        "https://forum.makerdao.com/t/maker-relay-ep-65-en-espanol/10784"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3300471230158735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/12/2021-15:00:16",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}