{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/business-strategy-and-evaluation-framework-for-business-like-core-units/7218",
            "title": "Business strategy and evaluation framework for Business-like Core Units ",
            "index": 7218,
            "category": [
                "Governance"
            ],
            "tags": [
                "strategy",
                "core-unit"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "16",
                    "time": "27/03/2021-09:56:07",
                    "content": "I’m watching the Crypto Gathering and I really think we should have a discussion about the “business-like” Core Unit mandates. This might concern the following proposal:  MIP39c2-SP5: Content Production Core Unit, MKT-001 MIP39c2-SP8: Governance Communications Core Unit, COM-001 MIP39c2-SP4: Growth Core Unit, GRO-001 MIP39c2: Strategic Marcomms Core Unit  @Planet_X has shared that some proposed Core Units are a bit overlapping, I would suggest that the community should define its business strategy for those Core Unit proposal to fit in. We can’t ask people to propose Core Units without even knowing what Maker is all about from a business perspective. Educating people in poor countries to use DAI is nice. Producing content and doing some social media is nice. But I fear it’s not aligned with MakerDAO and just wasted money. We are more and more a B2B and a protocol-level product. We don’t have a retail product at all. That’s a new strategy (unspoken but fact-based) and it has implications on the business. I include Governance Communication as well because it should play a role in that. From their mandate: “Aggregate and Simplify. Stakeholders need to be kept informed.” That’s nice but not important. I would see this Core Unit keeping relationship with regulators, big investors, doing roadshows. Stuff that really impacts MKR price. Caitlin Long (CEO of the crypto bank Avanti) is having a super-wide exposure and doesn’t even have a product. We need to work on things that move the needle. That’s corporates, institutions, and family offices. Some are using USDC and USDT we need to have a way to identify them and convince them to move to DAI. Some are not there yet and DAI should be their initial choice. Happy to see data that say otherwise, but we know that Nexo is our biggest customer and my guess is that it’s 10x bigger than all the EM folks we’ve converted with our programs. Not saying it wasn’t a good strategy at the time (I think it was), but we have to adapt to the landscape. If this vision is correct, we should evaluate “business-like” Core Unit proposal using this lens. MKR holders will invest cash and not get rewarded in the short term, what matters is the return on investment. And currently, I don’t see much of it. But hey, that makes sense, we didn’t ask for it. Regarding those applications, I get a feeling that we are becoming a non-profit organization. PS: In a sense, we just need one person, one that has access to high-level management of BlockFi and Celcius to convince them to do like Nexo. This person will also be able to have access to some first class investors to add some credentials to MakerDAO. This would be game changer. We need to hire Christine Sandler. I don’t care about the cost. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp5-content-production-core-unit-mkt-001/6823",
                        "https://forum.makerdao.com/t/mip39c2-sp8-governance-communications-core-unit-com-001/7009",
                        "https://forum.makerdao.com/t/mip39c2-sp4-growth-core-unit-gro-001/6715",
                        "https://forum.makerdao.com/t/mip39c2-strategic-marcomms-core-unit/7189",
                        "https://forum.makerdao.com/t/core-unit-mandate-overlap/7210/6",
                        "https://twitter.com/CaitlinLong_",
                        "https://www.linkedin.com/in/christinesandler/",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-135-thursday-april-1-17-00-utc/7206/2",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-march-28th-2021/7280",
                        "https://forum.makerdao.com/t/governance-at-a-glance-march-26-april-1-2021-now-forum-at-a-glance/7276",
                        "https://forum.makerdao.com/t/reporting-and-transparency/7233",
                        "https://forum.makerdao.com/t/project-compass-conceptual-framework/8845",
                        "https://forum.makerdao.com/t/a-series-of-questions-about-strategy/7487",
                        "https://forum.makerdao.com/t/what-are-marketing-adoption-goals-for-n-america/7438/27",
                        "https://forum.makerdao.com/t/what-are-our-priorities-and-how-can-we-stay-focused-on-things-that-matter-the-most/8697",
                        "https://forum.makerdao.com/t/a-framework-for-valuing-mkr/7442/4"
                    ],
                    "GPT-summary": "The author is discussing the need for a business strategy and evaluation framework for \"business-like\" Core Unit mandates in MakerDAO. The author suggests that the community should define its business strategy for those Core Unit proposals to fit in and evaluate them using a lens of return on investment. The author also provides constructive criticism on some proposed Core Units and extends an invitation to hire a specific person to convince high-level management of BlockFi and Celsius to do like Nexo.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.00364758698092
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "8",
                    "time": "27/03/2021-10:25:13",
                    "content": "Thanks @SebVentures for this post. I also have the impression, following the recent CU proposals, that we are not sufficiently ‘focused’. It’s nobody’s fault: we need to agree on a medium-term strategy. MakerDAO will necessarily need to deal with tactical decisions all the time, but the strategy for the next 12-18months should be fixed and followed thereafter. So my first comment is: GOAL: We need people to propose (perhaps different) strategies and choose one, as a community, for the next 12-18 months. Once the strategy is fixed, Core Unit proposals will be better and more focused. So my second comment is: Buy some time: Maybe some of the Core Units can reduce their action to 3-4 months. This will grant them a salary to keep doing what they were doing at the foundation, and give MakerDAO’s governance the time to agree on some strategy. I liked this comment of @mrabino1:     Should we burn the admin keys? An argument for minting MKR   My personal take on this is to let the system settle first. I am in-favor of a cool-off period, followed by compensation by core unit being agreed upon no more frequently than once a year (unless new staff is added).   Regarding the strategy, here is my own view: My view on STRATEGY: It was not always like this, but today MakerDAO has shiftwed towards a back-end infrastructure, in the money LEGO system. We are used by other protocols, but we don’t have (competitively) nice interfaces to interact with users. E.g., in the chat we often refer newcomers to DefiSaver for managing CDP rather than Oasis. Due to these reasons, I think communications, vide-making, etc are of lower priority. What is high priority is to offer the best and most efficient stablecoin backend: flash loans, PSM, competitive rates, oracle infrastructure, L2-integrations, etc. So rather than investing in video making or marketing or charity or “awareness” or “3rd countries adoption” (which are all super-important but probably not now!) I’d rather invest the money on stuff like:  another SC core unit, to work in parallel with the one that is being formed now! possibly another Oracle Core Unit: replication is good in decentralised systems! L2 core unit (being worked on now, by the Oasis team) Legal Core unit (again, maybe even 2 or 3, in different continents!) Governance tools: better interfaces, Vote delegation, MKR staking incentives, more “community calls”, a “help center” to professionally interact with business-partners, etc. Business CU (somebody who can talk to large investors, banks, insurance companies, huge RWA sources, etc).  The rest is, at the moment, just noise and (imho) potentially a waste of money. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.040874914559126
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#3",
                    "likes": "3",
                    "time": "27/03/2021-10:52:25",
                    "content": "Thanks for the post, @SebVentures. I fully agree on the need to decide how much redundancy and overlap we need in some of the less-crucial areas. Having said that, I want to focus on Gov-Comms as I find it’s an often-misrepresented Core Unit.     SebVentures:  I include Governance Communication as well because it should play a role in that. From their mandate: “Aggregate and Simplify. Stakeholders need to be kept informed.” That’s nice but not important.   I think that oversimplifies what a DAO is at its core: it’s decision-making processes that support a product, not the other way around. You can’t have a good product without good decision-making, and you can’t have the latter without relaying crucial information to the stakeholders. On the subject of informing and educating voters (both on-chain and off-chain), I’ll always go for more redundancy than less. We need to understand that it’s fundamentally NOT the same as general education and evangelism.     iammeeoh:  GOAL: We need people to propose (perhaps different) strategies and choose one, as a community, for the next 12-18 months.   You’re right, a DAO-wide vision will be essential in aligning various interests, including those of Core Units. I’d refer you to the Project Compass working group where we’re currently creating a vision-setting framework. Feel free to reach out on RC to chat more about it! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8187229437229435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "2",
                    "time": "27/03/2021-11:26:01",
                    "content": "    Elihu:  I fully agree on the need to decide how much redundancy and overlap we need in some of the less-crucial areas.   If it’s not crucial, we don’t need to discuss it at all. That’s my point. Take one or two operation support core units and be done with all the less-crucial things. Tech support is doing an awesome job managing the forum and the chat. Are we going to have such a Core Unit? Having a discussion about using Discourse vs something else? Some people are taking the time to explain stuff to whales and rallying them to vote. Others are trying to get whales back. This is GovComm to me. We have a big problem that few whales (2-3) are deciding almost everything. This should be the only thing we need to discuss. Such a Core Unit should have direct access to at least 2 of those 3 whales,  have a plan to bring back some whales that are not voting, and adding new ones. The rest is just work, it’s implied, we don’t even have to discuss it. Focusing on what really matters is the key to decision-making and for successful organizations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.589488636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#5",
                    "likes": "5",
                    "time": "27/03/2021-17:25:41",
                    "content": "Connection to all the high-level management? That’s literally the current BD team  but do want to say bringing billions and expanding channels all across the world is really moving the needle ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#6",
                    "likes": "12",
                    "time": "27/03/2021-17:30:34",
                    "content": "I will be honest - it kind of sucks to see how bad those of us that have been doing this for several years have been at communicating what we do. I’ll address some of your points as they pertain to the BD team (proposed Growth core unit) but I am sure other teams will have similar feedback.     SebVentures:  We are more and more a B2B and a protocol-level product. We don’t have a retail product at all.   This is exactly what the BD team has pursued for 4 years now. It’s also what’s outlined in the growth core unit proposal. I’d also note that in Nadia’s proposal the pay structure is heavily weighted towards variable incentive bonuses rather than high base pay. I.e. the DAO only pays if it gets value from the deals the team is closing.     SebVentures:  Happy to see data that say otherwise, but we know that Nexo is our biggest customer and my guess is that it’s 10x bigger than all the EM folks we’ve converted with our programs.   These are not mutually exclusive concepts. Dai generators are different from Dai holders and we need to maintain a balance. Without our early investments into the Argentinian market, we likely would not have maintained the traction needed to become a pillar currency of yield farming, and Nexo would have no one to sell all of that Dai to at $1. I’m not saying that EMs are buying more Dai in aggregate than someone farming on Compound, but it is a real, fast-growing, and sustainable market that will be there even when the speculation is gone - not to mention Dai has almost all of the market share in these countries. This kind of traction takes marketing, PR, and big integrations to maintain. I would hate to see all of this progress go to waste when we’re finally on the cusp of true mainstream adoption in the region. It’s difficult for us to effectively communicate what we’ve done/do because deals require privacy. Not for the Foundation’s sake, but to preserve the relationship with the integrator/user. This can be contrasted with core units that have always been doing public work in the forums - their value add is far more obvious. I would like to hear feedback about how the core units can better communicate with the community. While I am not personally proposing a CU, I think all proposers would greatly appreciate this kind of guidance. There’s a tremendous amount of talent in the proposed CUs, my only goal is to ensure it does not get overlooked due to a lack of communication. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.651626016260163
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "1",
                    "time": "27/03/2021-17:55:17",
                    "content": "    g_dip:  I would like to hear feedback about how the core units can better communicate with the community.   IMO perhaps @Nadia and the rest of the BD Core Unit Teams can do a weekly/bi-weekly call with the community and highlight some of the deals they’re working on. Kind of like reviewing a pipeline. And names do not need to be revealed–or, specifics that can hamper a deal from closing. Just my 2 Gwei. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "3",
                    "time": "27/03/2021-17:58:19",
                    "content": "    g_dip:  I would like to hear feedback about how the core units can better communicate with the community.   I honestly don’t know but I’m quite sure there is something to show. In my view, a core unit facilitator is here to solve hard problems, this is only the first one. Regarding the Growth Core Unit, maybe you can share all the MIP6 applications that flowed through the DB team? I can say that @Gustav_Arentoft is flooding the RWF core unit with prospects and is very professional. One can be a game-changer. Quite sure the others of the teams have stuff as well for the near future. I assume it’s someone for DB that did the pilot with Centrifuge for the Foundation.     g_dip:  It’s difficult for us to effectively communicate what we’ve done/do because deals require privacy.   I fully understand, but if the plan is to say every quarter “we have signed 4 integrations but we can’t tell you which”, not sure MKR holders will be happy. The CU proposal has some information on that. You can track all the wallets from exchanges operating in LATAM and see how many DAI they have and see how it increases compared to USDC and others stablecoins. This post is indeed about discussing the strategy and how to evaluate it. This should have been done upfront. It’s not about a particular core unit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1265625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#9",
                    "likes": "7",
                    "time": "27/03/2021-18:16:56",
                    "content": "    flipflopflapdelegate:  IMO perhaps @Nadia and the rest of the BD Core Unit Teams can do a weekly/bi-weekly call with the community and highlight some of the deals they’re working on. Kind of like reviewing a pipeline.       SebVentures:  I fully understand, but if the plan is to say every quarter “we have signed 4 integrations but we can’t tell you which”, not sure MKR holders will be happy.   It wouldn’t be practical to do this until the deal is closed and the integration is live. The CU would be violating NDAs and best practices if it advertised unfinished business - not to mention it would shake the confidence of corporate integrators as it would appear that the CU is using their brand name to Maker’s advantage. Many integrators want to use our technology but do not want Maker to take advantage of the publicity that comes with that. There’s approximately 1,000 live integrations that we’ve worked on that I’d bet Nadia or anyone else on the Growth CU would be willing to discuss, but I can say with some certainty that they can’t discuss deals in process.     SebVentures:  You can track all the wallets from exchanges operating in LATAM and see how many DAI they have and see how it increases compared to USDC and others stablecoins.   If a core unit signs an agreement with an exchange, I can assure you that the exchange would expressly prohibit this kind of public information sharing in the agreement (even if the wallet addresses are “public”). Perhaps an outside group that was not party to the agreement could do this kind of analysis.     SebVentures:  This post is indeed about discussing the strategy and how to evaluate it. This should have been done upfront. It’s not about a particular core unit.   Fair enough, but I’m not seeing any specific feedback. You’re just saying “have a strategy and an evaluation method,” to which I’m replying “I think the Growth CU does have a strategy and an evaluation method.” I am not trying to be combative - I just think it’s only fair that the team has the opportunity to reply to a specific request rather than a general one which it feels like they’ve already addressed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.247790404040404
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#10",
                    "likes": "8",
                    "time": "27/03/2021-18:58:15",
                    "content": "Hey @SebVentures For more than ten years, I worked for the sales teams of different big tech corps . Those companies’ strategy is to create a market, prove their solution works, establish use cases, bring users, and then it’s possible to close deals with the big names. Of course, you need connections, that’s one of the most important assets of anyone in BD/sales/growth teams. But when you start a conversation with a bank, they won’t integrate your product just because you know them. They will do it if they know they will have users, a use case, or an opportunity once they integrate your product. When a 3rd party has to integrate something into their solution, they have to weigh the opportunity cost. In my experience, integrations in DeFi are more accessible because we are in the same ecosystem fighting for the same objective, but the traditional financial system is another story. In the last three years, we have been talking with corporates, institutions, family offices, governments, regulators, NGOs, investment funds, you name it. Some of them integrated Dai and are using it, some of them want to integrate Dai when DSR comes back (our killer feature until now), some of them needs a hard 1:1 peg because in high volumes, each cent counts, some of them are waiting for the first RWA implementation to understand how they can join the protocol. Regarding having a presence in EM, I do think it’s important because it’s part of our core principles, and those principles are there to remind us why we are doing this…no? Do you remember last Devcon and the remarkable story @nanexcool  told everyone and how this empowered the Dai brand? It was interesting how during the last crypto-winter, we all saw how Dai’s demand kept going in those countries.     flipflopflapdelegate:  IMO perhaps @Nadia and the rest of the BD Core Unit Teams can do a weekly/bi-weekly call with the community and highlight some of the deals they’re working on. Kind of like reviewing a pipeline. And names do not need to be revealed–or, specifics that can hamper a deal from closing.   Yes, we want to share with the community the integrations we closed (unless NDA doesn’t allow us, remember that in some cases, our partners integrate the Maker protocol to create competitive advantage), what we are doing in each region (we posted our objectives for next quarter in our proposal, and we intended to keep doing it every quarter to discuss it with the community), what challenges we are facing due to USDC and USDT market penetration, and we also want to share with you what others (in and out the crypto world) are looking for. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.736388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#11",
                    "likes": "16",
                    "time": "27/03/2021-19:46:20",
                    "content": "Hi everyone, I’m part of the Growth core unit, and I also work for the Foundation in the marketing department. With Nadia, we were responsible for creating and developing all the campaigns and even products related to DAI usage and demand in LATAM. Related to “move the needle,” we won’t achieve it by creating 1 or 2 core units, but rather having a clear understanding of how the Maker Protocol capabilities and products could help other companies. At the very beginning, DAI focused on B2C, and “decentralization” was the value proposition, and we took that message and converted it into something. As a result, Dai hit so hard in Emerging Markets because that is desirable in those markets. Unfortunately, due to high gas fees and other decisions, B2C focus shifted to “other thing”… in that regard also I don’t think we moved to B2B, because we (community and foundation) did not develop the necessary tools to eat that market. I think we turn the strategy not because we planned it but as a result of the circumstances. Let´s have an example. We pretty much talk with every single institution that now uses USDC. Some of them started using DAI, before USDC, and all of them always tell us the same thing.  We need powerful APIs We need 1 to 1 Peg We need liquidity Decentralization is not a value proposition for us Higher returns on DEFI is a “nice to have”  As of now, the DAI market bones are years light from USDC and USDT. That is why on our core unit proposal, we were pretty clear that we need to develop products side by side with our partners to fully understand what they can offer in a “trade-off”. Are they going to need a powerful API, wallet, and key management solution? Do they need 1 to 1 peg above everything else? Liquidity matters more than peg? etc… Currently, the state of the institutional market (and also during the last two years) has been very clear on its response:  On ramp / off ramp operations 1 to 1 peg at any moment is the holy grail. If they convert some of those USDC/USDT to DAI is for farming and returns opportunities, that´s it. Once those opportunities are no longer in the market, they will go back to USDC/USDT.  This is the exact transcript of a conversation I had with a friend who started working with DAI and now manages over 700 Million in crypto assets. “Marian, we can’t use DAI anymore for our operations because of the total amount of money we manage. The little fluctuation on the peg and the fees for on/off ramping with your partners makes us not competitive.” The GROWTH core unit proposal wants to work with every company/industry needing DAI. Our experience gave us a complete understanding of what products need to be developed depending on each potential partner’s business objective. Let me give an example. Success in Argentina came because we worked with Buenbit to develop a unique solution to help Argentinians save in Dai during an awful moment in the country’s financial system. This solution is fully compliant with local regulations, but it took us 1 year of meetings with regulators, plus 6 months of technical development and market creation. As Greg said, demand will be there even in a bear market because it goes beyond Farming or some other crypto narrative. I can see GROWTH core unit working side-by-side with 6s or Centrifuge to use them as a spearhead to conquer specific verticals and develop products based on their templates. Again, I don’t think that moving the needle is related to a core unit but rather a scalable product that institutions NEED & WANT to use in the easiest and less convoluted way. I would love the community to develop a product that can offer on/off-ramp 1 to 1 with a powerful API like USDC because I know that we can EASILY eat the market if we have that. Still, we have to be realistic and we don’t have that at the moment so we need to work very hard to keep DAI gaining market share. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.340056022408963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#12",
                    "likes": "4",
                    "time": "27/03/2021-20:11:52",
                    "content": "    Nadia:  Yes, we want to share with the community the integrations we closed (unless NDA doesn’t allow us, remember that in some cases, our partners integrate the Maker protocol to create competitive advantage), what we are doing in each region   That’s a great idea and as @flipflopflapdelegate I don’t see any reasons why you can’t share updates on the G&R call. Proposed Core Units that are already in action should have access to G&R call. That’s unfair to not give them the opportunity. Regarding the strategy, my proposal is quite aligned with your core unit, but other people might disagree. @MarianoDP your post is the most important piece I read this week. I have almost no idea what you are talking by saying “API” (ok actually I see, a DAI payment system?, but lost on defining it clearly with an actionable plan). The “moving the needle” is hidden in your post. I remember well that @g_dip was instrumental in giving context to the decision to solve the peg issue. That’s the kind of stuff I’m talking about (well not achieving to label it). A synthesis of what the BD/future Growth hear of the strengths and weaknesses of DAI vs USDC and USDT and how to push DAI above the rest is priceless. The BD team has the knowledge and we don’t. Quite sure you can find a way to share it without putting the legal team on your back. Then convince the community to act on it. This is what is needed to move MakerDAO forward. No one else will. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.120098039215687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#13",
                    "likes": "12",
                    "time": "27/03/2021-20:47:05",
                    "content": "Thanks Seb, What I mean with API is a full wallet, key management, on/off ramp solution as USDC provides. Most of the time that we approached a potential institutional partner, they dont want to develop the technology to implement DAI, they just want api to ping and have everything solved. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.614583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#14",
                    "likes": "5",
                    "time": "27/03/2021-20:53:17",
                    "content": "Just to echo this - a hosted-wallet infrastructure/API access to this infrastructure (a service that holds the private keys on behalf of users and allows the application owner to port in via an API to manipulate balances) is a major pain point in integrating with fintechs. There’s a few potential integrators that we’ve been trying to convince to build out this solution for us, but it’s a big lift. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#15",
                    "likes": "3",
                    "time": "27/03/2021-23:56:24",
                    "content": "Great post. Thanks for adding some much needed colour to the conversation. The more information MKR holders/the community have the more we can ensure DAI’s success. This kind of information has been sorely missing over the years and I hope that as the Foundation dissolves the people who made all this possible will have the power to continue building on this previous success with transparency. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.378787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#16",
                    "likes": "4",
                    "time": "29/03/2021-15:08:23",
                    "content": "    SebVentures:  I include Governance Communication as well because it should play a role in that. From their mandate: “Aggregate and Simplify. Stakeholders need to be kept informed.” That’s nice but not important. I would see this Core Unit keeping relationship with regulators, big investors, doing roadshows. Stuff that really impacts MKR price. Caitlin Long  (CEO of the crypto bank Avanti) is having a super-wide exposure and doesn’t even have a product.   I understand the general message in your post–It’s urgent to expand business and products, and any Core Unit that can do that, should, and should be evaluated on that basis. However, I disagree with two things you say:  Keeping stakeholders informed is not important. I think it’s actually of utmost importance, especially when the information is urgent and can have far-reaching impacts. Governance Communications is a “business-like” Core Unit. I disagree. Marketing and BD would be better suited to doing things like roadshows, customer acquisition, and promotional campaigns.  Companies are made up of many departments. Some are outward-facing and are tasked with moving the needle on sales, while others have an entirely different objective. Gov-comm’s objectives are not focused on moving the Dai needle. Rather they are focused on moving the quality and utility needles for Stakeholders and Intra-DAO participants with regards to our informational products and services. Companies work better when information flows are healthy, especially MakerDAO considering the wide range of stakeholders our system generates that aren’t necessarily involved in the day-to-day of the protocol. I especially like what Elihu said     Elihu:  You can’t have a good product without good decision-making, and you can’t have the latter without relaying crucial information to the stakeholders.   Ultimately these Core Units have different objectives, and the type of work they do does overlap in some cases. Gov Comms will have control over Maker Relay, but that doesn’t mean we aren’t working with someone on the MKT-001 core unit or GRO to list their events, talks, partnerships as a part of that weekly publication. OR imagine gov comms sets up a few stakeholder opt-in newsletters; one for integrators, another for people that run UIs, another for Auction participants, etc. Any one of these is good infrastructure to help stakeholders make good decisions, but they can also be used for more specific outreach both by our team or by another team with a specific objective. I’m kindof rambling at this point, but my point is that a healthy business is more than its departments that focus on increasing business. That is HUGELY important, but businesses also thrive on the work people do to improve infrastructure to be able to handle all that growth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.944256756756757
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#17",
                    "likes": "2",
                    "time": "29/03/2021-15:22:18",
                    "content": "Echo-ing more. I think partnerships with Payment Service Provider parties like: Adyen (https://www.adyen.com/) Mollie (https://www.mollie.com/en) Or even something like Shopify Would be massive for DAI adoption/demand. ",
                    "links": [
                        "https://www.mollie.com/en"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#18",
                    "likes": "0",
                    "time": "29/03/2021-15:39:03",
                    "content": "Why the need to always include some soft-pedaled criticism of the Foundation with nearly every comment? Hopefully as they dissolve, your apparent bitterness over what you believe you are owed will dissolve with it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#19",
                    "likes": "4",
                    "time": "29/03/2021-16:18:25",
                    "content": "Why do you think? I make it pretty clear in every post. Transparency. Communication (lack of). How is anyone supposed to feel confident as an investor/participant when we don’t have all the facts? Is this a decentralized, open, permissionless organization or not? Wouldn’t it be good if the Foundation that espouses these ideals and made this possible lead by example? If you can’t say something for legal or BD reasons say you can’t say something. At least then we know there’s a reason instead of just being left in the dark to guess. This has been an ongoing issue for years. So yes, I hope (and expect) my bitterness will dissolve when they do so that we can actually move on with the vision we were actually promised. Sorry if my expectations are too high. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.3428571428571425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#20",
                    "likes": "1",
                    "time": "29/03/2021-17:46:13",
                    "content": "The Foundation isn’t an amorphous symbol, it’s people (like me) that you talk to every day. I like to think that we all have good intentions and want to do our best, especially when it comes to interacting with the community. Most people that work at the Foundation were members of the community and you guys are our friends. I don’t think anyone is averse to criticism, but maybe give us the benefit of the doubt that we’re acting in good faith? To address your point directly, I don’t know how to do this:     Aaron_Bartsch:  If you can’t say something for legal or BD reasons say you can’t say something.   Can you give me an example of how you can say you can’t say something without actually saying it? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.777777777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#22",
                    "likes": "1",
                    "time": "29/03/2021-18:03:18",
                    "content": "Interesting rebuttal. I’ll try and get back to you @g_dip ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#23",
                    "likes": "3",
                    "time": "29/03/2021-18:05:44",
                    "content": "Lets try to stay on topic. If people want to discuss the Foundation, feel free to setup a separate thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#24",
                    "likes": "2",
                    "time": "29/03/2021-19:13:05",
                    "content": "It sounds like there are two conversations at play here:  What’s MakerDAO’s business strategy?  I look forward to what comes of Project Compass and don’t disagree that our most profitable opportunities in the short to mid-term are probably through B2B integrations but I don’t believe the decision between focusing on B2B and B2C is mutually exclusive, either. It sounds like our success in B2C has helped fuel much of the growth in B2B so while I agree that it would be helpful for us to collectively aggregate and prioritize which value propositions we’re pursuing, I don’t agree with the suggestion that we should necessarily ignore B2C.  How will the efforts of the proposed Marketing, Comms, and Business Development Core Units align with this strategy?  I hear your concerns and agree that any marketing, business development, and communications efforts should be aligned with the goals of the organization. I can’t speak for others but the Content team has noted our intention to meet with Core Units in month 1 to ensure that any strategy we start executing on is aligned with organizational goals and if we can start tackling that collectively in the open, that sounds good to me. We’ve also stated our intention to provide regular reports on our progress toward goals and KPIs so the community can hold us accountable to our work. Whatever strategy we decide to move forward with, I’m confident in the Content team’s ability to support it. I don’t expect any Core Unit to be retained if it doesn’t move the needle and agree that we need to make efforts that make sense rather than efforts at capturing fleeting attention. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iliadou",
                    "index": "#25",
                    "likes": "0",
                    "time": "02/04/2021-13:11:07",
                    "content": "Perhaps more that onramp, APIs etc, I think we should focus on:  providing DAI against collateral keeping the peg in line Then others in the ecosystem can take care of interchangeability with fiat and other stablecoins.  When I say “focus” it does not mean other elements are irrelevant, but I think there is a peril of dispersing our attention to too many secondary matters. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.075892857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#26",
                    "likes": "4",
                    "time": "02/04/2021-21:45:32",
                    "content": "Fortunately the PSM has basically solved the peg issues. It’s on governance now to ensure that it’s managed appropriately. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#27",
                    "likes": "0",
                    "time": "08/04/2021-15:49:51",
                    "content": "    MarianoDP:  Again, I don’t think that moving the needle is related to a core unit but rather a scalable product that institutions NEED & WANT to use in the easiest and less convoluted way.   So… how do we get in front of payment processors like PayPal, who now already accept BTC and ETH and a couple others? My understanding is that literally all their merchants now accept BTC because PayPal intermediates and gives them $ on their end. I would think as a stablecoin, we would have a really excellent value proposition to them as a way to do crypto payments but without exposing them to the risk of wild price swings as the intermediary. Do we have anyone in the community who has the right Rolodex for this? I can see yield-seeking institutions like insurance and pension funds liking this as well, given what a real-world dollar yields compared to what a DAI yields. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.21904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#28",
                    "likes": "3",
                    "time": "12/04/2021-17:21:28",
                    "content": "Could you expand on this and explain the biggest bottleneck in getting this done? We need to listen to our customers and prioritize providing solutions to them. If Governance doesn’t have a clear understanding of the issues, solutions, and costs required to achieve we will never compete with other stablecoins. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#29",
                    "likes": "5",
                    "time": "17/04/2021-16:08:02",
                    "content": "So first let me better define what I’m talking about. Fintechs are increasingly looking to offer their customers access to DeFi (primarily Compound/Aave in my experience because it’s “simple”). In order to do this, they need a way to associate ethereum accounts with user accounts within the application. Also, as you likely know, anyone interacting with ethereum needs to run a node (infura does this for you through Metamask when you use the wallet). When a third party runs this infrastructure for other applications, it’s called a “hosted wallet.” Hosted wallets generate blockchain addresses for your existing users and allow them (or the company) to manipulate balances and make transactions via API. Most Fintechs are not set up to run blockchain infrastructure, and are really not set up to custody user funds. Some are solving this by having users self-custody, but others require that service too. The three primary services that they need (and sometimes they only need one of these and not all three) are:  On/Off-ramp Hosted wallets Custody  All three of these are either explicitly regulated or at least border on it. At the very least, they’re hard to do and require large investment in product. At the moment, Circle does all three if you want them to. So to answer your question, the challenge is finding a partner that will offer these services for Dai. The Growth CU should have some leads, but given the investment involved it’s going to be a long process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.335873015873016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#30",
                    "likes": "1",
                    "time": "18/04/2021-00:20:20",
                    "content": "    g_dip:  At the moment, Circle does all three if you want them to. So to answer your question, the challenge is finding a partner that will offer these services for Dai.   @g_dip What about the use of Coinbase and/or other jurisdiction-specific partner exchanges as a backend to those services for fintechs? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#31",
                    "likes": "0",
                    "time": "18/04/2021-00:25:28",
                    "content": "    williamr:  What about the use of Coinbase and/or other jurisdiction-specific partner exchanges as a backend to those services for fintechs?   I would think Coinbase would push USDC to the detriment of DAI ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#32",
                    "likes": "2",
                    "time": "18/04/2021-00:35:57",
                    "content": "Actually Coinbase has been extremely friendly to Dai. I’d say they’re one of our biggest allies. From what I can tell, they’re just here to advance the space. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#33",
                    "likes": "1",
                    "time": "18/04/2021-00:36:38",
                    "content": "The issue is that they don’t (yet) offer hosted wallet infra. Maybe they can be convinced to, but again this is a big lift. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#34",
                    "likes": "0",
                    "time": "18/04/2021-00:43:06",
                    "content": "Does Gemini tick every box? They seem to be very aggressively moving into the custodial space, between Caruso Properties and the Canadian ETH ETFs — both announced very recently. I know they’re a smaller player, but they seem to be positioning for the long run. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#35",
                    "likes": "3",
                    "time": "18/04/2021-01:19:32",
                    "content": "Nope, no hosted wallet infra. The ones that do it right now, that I know of, are Circle (for USDC) and Curv. I’m hoping that Curv can help us and they are in touch with the Growth CU, but they were just acquired by PayPal so they’ve got a lot going on ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#36",
                    "likes": "1",
                    "time": "18/04/2021-21:16:54",
                    "content": "    g_dip:  The issue is that they don’t (yet) offer hosted wallet infra   @g_dip WIthin the Foundation, have we got partnerships with the likes of Alchemy? If we had some tools to offer through 3rd party integrations, it would make the fintechs world way easier. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#37",
                    "likes": "1",
                    "time": "19/04/2021-02:24:43",
                    "content": "They support Ethereum, so I’m not sure any kind of special collaboration is necessary. I don’t think they will generate accounts on behalf of app users? Would love to be wrong, of course. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.589285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#38",
                    "likes": "0",
                    "time": "19/04/2021-13:51:27",
                    "content": "Regarding emerging markets and retail, Reserve Protocol seems to have some serious work in the area. Not sure it’s giving much yet. We will see. https://medium.com/reserve-currency/reserve-update-end-of-q1-2021-f5e349248a94 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.361111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#39",
                    "likes": "0",
                    "time": "19/04/2021-14:02:09",
                    "content": "While I understand your concern, most of that “users” is driven by their frequent giveawyas. As you can see, RSV stablecoin has a supply of just 1 million… And the fact that Dai trades even more than Bitcoin in countries like Argentina and are often on front pages of major newspapers should show that Dai has been doing much more work than Reserve or any other stablecoins in the region. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.28125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#40",
                    "likes": "2",
                    "time": "19/04/2021-14:10:41",
                    "content": "And also I can’t say it because I can’t say it but… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#41",
                    "likes": "6",
                    "time": "19/04/2021-15:09:17",
                    "content": "Hi Seb, here from Vzla, Reserve Protocol is just another CeFi stuff looking for earnings taking advantage of the situation here on Vzla, it just doesn’t works and from my perspective it’s not something you can trust.  Bad exchange prices (nothing competitive) Doesn’t work 24/7, just from mondays to fridays from 8am to 5pm It’s not something inmediate  Also they recently hired an “advisor” that is a supporter of the goverment and help to create the Petro cryptocurrency, so in Vzla we don’t see this with good eyes. We want Dai in reliable ways, like we have now in Binance P2P or Glufco, we already are working with another partners in order to keep gaining adoption as new solutions comes like the new wallet of Bitera and Syklo. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.272727272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#42",
                    "likes": "2",
                    "time": "19/04/2021-19:48:45",
                    "content": "I am also from Venezuela and I am part of DAG Venezuela, Reserve does not have much real adoption other than the noise they generate in social networks, carried out mostly by a fan base that has the guy who runs the social networks of the company in Venezuela. Reserve is not looked upon favorably by many Venezuelans, mainly because in its ranks DAI should focus on maintaining the partners it already has such as Binance P2P and glufco, and boost its area of action, mainly with this second company where I work as it has a focus on physical, digital and offline means of payments that it should take into account. In that order of ideas we cannot think of a DAI that is expensive for users mainly like mine and @Lozadaluis12. Our own communities looked for ways to continue using DAI regardless of the network, use cases on xDAI, Matic and the controversial BSC. That’s the approach we are trying to have, using DAI without network limitations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.44212962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#43",
                    "likes": "1",
                    "time": "19/04/2021-20:31:13",
                    "content": "    Doo:  And the fact that Dai trades even more than Bitcoin in countries like Argentina and are often on front pages of major newspapers should show that Dai has been doing much more work than Reserve or any other stablecoins in the region.   To be fair Reserve is more recent. And I have honestly no idea of the significance of DAI in LATAM. Are we speaking of 1M DAI, 10M DAI, 100M? Reserve are now 60 people strong, so if they can’t get more than 1M onboarded with incentive …     Saludiego_201:  Our own communities looked for ways to continue using DAI regardless of the network, use cases on xDAI, Matic and the controversial BSC. That’s the approach we are trying to have, using DAI without network limitations.   Fully agree, if MakerDAO can do something on that front, please yell. We are not a leader at all on Matic even with a good start. Not pushing xDAI much neither. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.721726190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#44",
                    "likes": "0",
                    "time": "20/04/2021-03:30:57",
                    "content": "Reserve has been around for over 2 years now. Other Stablecoin project that launched at similar time like Terra has over $1.5 billion so I wouldn’t defend them like that. In terms of Dai in Argentina, of course we are talking in at least tens of millions.    CoinDesk – 22 Dec 20    Argentines Look to DAI as US Dollar Replacement - CoinDesk High inflation, devaluation and lack of access to U.S. dollars has led Argentines to look to DAI to protect their battered incomes.      ",
                    "links": [
                        "https://www.google.com/amp/s/www.coindesk.com/why-argentines-are-turning-from-dollars-to-stablecoins-like-dai%3Famp=1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.66875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#45",
                    "likes": "0",
                    "time": "20/07/2021-09:31:51",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}