{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-goals-short-medium-long-term/257",
            "title": "MakerDAO Goals: Short + Medium + Long term ",
            "index": 257,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "alignment"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/michaeldunwort1",
                    "index": "#1",
                    "likes": "1",
                    "time": "13/08/2019-21:13:40",
                    "content": "Hey guys! Wanted to resurface this, because it’ll reduce a (guaranteed) tornado in months/years ahead. Aligning on goals. To help ensure that there’s cohesive decision making, and less deliberation. Protocol Goals // Random examples to articulate my point // Short term (<18 months) : \"We are prioritizing  new CDP creation  from unique wallets, as opposed to growing the market cap of Dai. We feel that planting this groundwork while we’re still early from McD, and collateral selection remains to be finalized, the most value is to bring more and more CDP’s into the picture. In the future, this base has better changes to be more distributed in accessibility. Some markets can appreciate it much more, and the more knowledgable and active CDP users there are, the faster we get to reach these markets that can take advantage of it. Medium term (3-5 years) : \"We wanted new CDP’s at first, because that was to plant a base of educated users, that will help others understand faster, while also having a large count of CDP’s can allow for a broad distribution where Dai can be drawn down. Long term (5-7+ years) : Create a global currency that is supported by the participants and not a select few. Ensuring stability, borderless distribution. Delivering much needed financial services, for underbanked in established economies and unbanked in 3rd world countries. Decentralized, distributed, borderless. Fair. Full post here ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-49-5-2019-8-23/359",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-august-22-9am-pst-4-00-pm-utc/292/2"
                    ],
                    "GPT-summary": "The author of the post is explaining the short, medium, and long-term goals of MakerDAO. They prioritize new CDP creation from unique wallets in the short term, plant a base of educated users in the medium term, and create a global currency that is supported by the participants in the long term. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.493196473665224
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/08/2019-16:43:44",
                    "content": "How can you \"prioritizing new CDP creation from unique wallets, as opposed to growing the market cap of Dai? What if a whale opens a CDP of 20m DAI? Rune has said in a recent youtube interview that The Foundation made a evaluation-mistake. Initially (at launch, late 2017), it was thought that there would be a lot of demand for DAI, the stable coin. Instead it was realised that the real demand is for CDP, meaning that DAI is mostly used as a margin-trading tool. --> This is reflected in the current SF at about 20%. Now, with this said, and taking into consideration the fact that MKR-holders are happy if a lot of DAI are paid in fees, why are you focusing on boosting the “small fishes CDP”, instead of simplifying and allowing big whales to use CDP as a strong, decentralised, margin-trading mechanism? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.974862258953168
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/08/2019-16:48:56",
                    "content": "Also, does this post mean that The Foundation plans to stay around for 7 years from now? Can you please outline, in this post, what is the the roadmap of the Foundation (in agreement with the 3 time slots you described) towards the end-goal of disappearing and leaving a real DAO and decentralised system? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/michaeldunwort1",
                    "index": "#4",
                    "likes": "0",
                    "time": "15/08/2019-17:43:23",
                    "content": "Oh I was more suggesting the goals need to be circulated and surfaced to the community so we can align toward that or not align toward it etc… The suggestions weren’t what I want, it was to illustrate what I meant because I’m a terrible writer  Haha… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/08/2019-20:38:06",
                    "content": "    michaeldunwort1:  // Random examples to articulate my point //   Sorry, i must have missed the “Random examples to articulate my point” !!!  Or did you add it later? Anyway, good post, I agree this type of vision would be useful! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.5984375
                }
            ]
        }
    ]
}