{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/meet-your-delegate-14-chris-blec/15585",
            "title": "Meet Your Delegate #14 - Chris Blec ",
            "index": 15585,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "delegation",
                "public-call",
                "pubcall-:-meet-your-delegate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "7",
                    "time": "03/06/2022-14:08:52",
                    "content": "      Meet Your Delegate #14  Welcome to the (announcement for the) twelfth episode of Meet Your Delegate, where MKR holders and the broader community get to know their delegates. For this episode we will have two delegate candidates presenting their platforms and holding a Q&A session:   @ChrisBlec  - platform   @prose11 will be doing the hosting   When 2022-06-09T14:00:00Z  Where Google Calendar Event    Zoom Video   Join our Cloud HD Video Meeting Zoom is the leader in modern enterprise video communications, with an easy, reliable cloud platform for video and audio conferencing, chat, and webinars across mobile, desktop, and room systems. Zoom Rooms is the original software-based conference...      Meeting ID: 898 2469 2690 Passcode: MYD14 ",
                    "links": [
                        "https://forum.makerdao.com/t/chris-blec-delegate-platform/15544",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=Mzc3MWNiZWd2ODBmMGFnOXJsOG1zNWNsMzggbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/89824692690?pwd=UG9lWWxaUnZLcjhXZDZuMmZVT2xDQT09",
                        "https://us02web.zoom.us/j/89824692690?pwd=UG9lWWxaUnZLcjhXZDZuMmZVT2xDQT09",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630",
                        "https://forum.makerdao.com/t/weekly-relay-may-31-june-06-2022/15654",
                        "https://forum.makerdao.com/t/relay-semanal-31-de-mayo-6-de-junio-2022/15684",
                        "https://forum.makerdao.com/t/governance-and-risk-194-thursday-june-09-at-17-00-utc/15664/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.260416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kunfu-po",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/06/2022-01:08:11",
                    "content": "  tags: Meet Your Delegate  Meet Your Delegate: Episode #14 | Semi-transcription Summary  Agenda   00:03: Introduction  00:22: Chris Blec  14:41: Open Questions  37:05: Conclusion   Video Link  General Introduction  Payton Rose 00:03  Hello, everyone, and welcome. This is MYD#14. We are here with Chris Blec. We will review a quick platform update and then an open question and answer session. So first off, huge welcome new, Chris. Thanks for doing this.   Delegate Introductions  Chris Blec 00:22  Good morning. Thanks, everybody, for joining and watching. I chose to become a recognized delegate for MakerDAO after watching the DAO metamorphosing over the past three-plus years. I was involved with governance in the early days (not too early around 2019). I started to create video content, specifically about governance trying to get more people aware and involved because I saw how important MakerDAO would be to the future of finance beyond just DeFi. At that time, much work was done to raise important questions and start questioning incentives. We wanted to figure out how to incentivize more people to be, if not involved in governance, at least aware of the issues. People using DeFi without understanding how it works are a huge existential risk that we face because we risk the return of the middleman and all these transactions and everything you do not understand. That has always been my stance on DeFi. In 2020, I started to uncover some centralization issues in DeFi that were the wrong kind of trade-offs. I spent the last two-plus years trying to educate people about that. I’m talking about specific admin keys, centralization in DAOs with token manipulation, and VCs manipulating votes. Much is going on. I watched MakerDAO methodically; I want to call it centralized but add complexity. I do not say methodically in a negative way. I see it as many acceptable trade-offs. Many people might think you would be hardcore if you’re into decentralization and trustlessness. You only see this utopian world where everything is completely trustless. That’s not true. I see the world as a set of tradeoffs that must be acceptable. Finding that line of acceptability is tough and subjective. I hope to add to that subjectivity as a delegate and have spent years trying to define that for myself. With trade-offs with MakerDAO, I’m talking about how governance works with CUs, PSMs, real-world assets, and everything in between. MakerDAO has done a better job than just about anybody else in the space in negotiating those trade-offs. Still, there is a lot of room for more diverse voices to come in and join this conversation.  4:02  I want to approach topics here with the three things I listed on my platform with the key characteristics. Decentralization maximalist means increasing DAO participation and awareness of issues to give people involved in this ecosystem a glimpse under the hood to at least understand how things are working. That involves going outside the governance, forums, and chats and ensuring that issues are understood. We all know that people very interested in Dai can also be completely uninterested or even scared to get involved in governance. However, those same people may be risk-averse. If they knew about some of the questions we’re facing in governance, they would rethink how they engage with Dai. That is important. We should be in the business of just selling Dai to the world. I should not be just trying to push it like crack. We should be in the business of responsible and methodical growth that amplifies decentralization. Number two, I have trust minimalists. By this, I mean minimizing the trust that MKR holders, Dai holders, retail users, and anybody in this ecosystem (it’s Legos, everything’s connected) must have in CUs. This means us specifically in Governance, as delegates, and Maker holders, as far as how they might use their influence to change this system. A Dai holder shouldn’t have to worry about what a Core Unit or delegate might do. It’s reducing that trust. Not eliminating it, but minimizing it. The third thing is adversarial thinking: a clear focus on reducing the risk posed by third parties concerning real-world assets, D3M, PSM, and everything else. MakerDAO should not be putting itself in a position where the risk outweighs the benefits. That’s always been a goal which is why there’s a risk team. With things like the D3M, I can argue that it is the wrong kind of risk. That’s the conversation I’m interested in and bringing a voice to. We have been chatting in the governance channel the past day. I’ve been concerned about putting my name on this package of votes that I believe are the wrong kind of risk or moving in the wrong direction. I won’t be voting in favor of anything against what I think is the right move. I’m just putting that out there now before you delegate to me what my votes will be. I will not operate in a vacuum; I will have conversations and hear feedback. I want to be representative but won’t vote for an executive just because it’s an executive. There are trade-offs and negotiations. The expectation was that executives just get voted yes because we’ve already had the negotiation. If it contains something that is against my better judgment, there’s a chance that I won’t vote for it. I will provide clear reasoning for that. I was asking questions in the governance channel yesterday. For those that missed it, it was about how delegates are incentivized. At first, delegates appeared to be incentivized to just rubber stamp executives. However, since then, it has become clear that’s not the case. As long as an explanation is provided with reasoning, a vote opposing an executive is incentivized to happen equally with the yes vote. That is a fair way to approach these things. On this executive topic, I’m not convinced about combining these two; they’re almost two different roles. Compared to the executive vote (some think of us just formalizing what we’ve already discussed), the debates, conversations, and subjective take in polling and governance conversations make me wonder if combining those two roles makes sense. I haven’t formed an opinion fully, but I’ve been thinking about that a lot the past day.  10:10  Regarding specific topics, the PSM feels like a necessary evil. I’ve always thought of it as a temporary fix; temporary could mean years. It makes sense to always consider it as something that’s not permanent and that MakerDAO should eventually strive to eliminate. This is due to philosophical reasons. In addition, risks are imposed, especially with what’s happening in Washington, DC. As I said, the D3M is the wrong kind of risk. Relying on Aave’s security is not a good trade-off, especially with things recently disclosed about Aave’s reliance on other third parties, such as Chainlink and Oracles. This daisy chain of risk doesn’t seem like the right trade-off. It’s already happened, but just sharing my thoughts on that. Regarding real-world assets, I’m not opposed to them. Slowly and methodically adding them makes sense. The first question I would always ask is: how do we liquidate this? What risk is posed by the third party and within the CU? I still have to learn how it all works and how these things are handled by the core unit responsible in the real world. I haven’t been fully educated yet, but I am learning as I go along. However, I am a skeptic when it comes to that stuff. I’m not opposed as long as risk mitigation is clear, and everything makes sense. I want to bring logic and reason to these conversations. Hopefully, that’s valuable to some MKR holders interested in delegating in that regard. Another thing I wanted to throw out there before we go to Q&A is that meta DAOs are very scary. It’s something I want to think about some more. With the current level of complexity, there is the risk of things spinning into a situation that nobody can wrap their head around. MakerDAO is already in a place where it’s very difficult for one person to understand everything happening. It’s especially challenging when closed-door meetings and Core Units go off and do their own thing. When you add additional spokes, which is being proposed, I get very concerned about the unknowns there. I’m not sold on the idea. It’s an exciting conversation and worth discussing. I’m a believer in slow and methodical growth. I’ve said it a few times in this call; I’m not a believer in rushing to dominate the world by next year. I don’t believe Dai has to be the number one stablecoin by 2023. I think that Bitcoin grew the right route the right way: slowly, under the radar, but prioritized the right things. BTC ensured that by the time it did take over the world, it was battle-tested and hard. At least as much as possible, it has a shield that couldn’t be penetrated. I think Dai still has that opportunity but in a different way. It’s not going to be Bitcoin, but the DAO can get to a place where it’s impenetrable, specifically against the risks other centralized stablecoins are battling. It is not there yet, but it can be. That’s a quick summary of my ideas, platform, and takes. Thanks for listening.   Open Questions 14:41  Prose11: Thanks, Chris. That’s great. You covered a lot of ground. Raphael, I saw your hand go up. Would you like to kick us off with the Q&A session?  Raphael Spannonchi: Hey, Chris. Firstly, a warm welcome, and I’m excited to have you on board. I love the thinking that you bring; this thinking is slowly fading from space. It is an important aspect that also brought me to crypto in the first place to speak about incentives. So glad to have you here. I want to understand your reasoning behind the executives a bit better. When delegates decide not to vote on executives that contain proposals they will post, it adds more friction, making the system less stable and brittle. I understand you may want to spin that out and have it as a separate function. But the way it’s now, I think the discussion must take place before the executive. When the executive comes to pass, it’s more about ensuring that nothing dangerous happens at that point.    16:10  Chris Blec: I have a principal take. Let’s say I’m voting yes on something I believe is the wrong move, and I have the voting power to make a difference. If MKR holders are still delegating to me, I don’t want to put my signature on something that I am opposed to because I think it can do long-term damage, or someone can ask in five years, “who put this in place?” I do understand how things have been working. Delegates have a duty to execute the will of what’s already been decided in the forums and the polls by governance. However, it is still a vote for a reason.  Raphael: I’m sorry to interrupt. My point of contention here: the executive is not a vote on the proposal. The proposal already happened. The executive is a vote on the system of implementation.   I understand. But it still requires a delegate to use their voting power to place and formalize it. The same delegate was either for or against it in the forums. I understand why people are looking at it this way. As a delegate, I’m choosing not to vote for things that I would stand in opposition to, even at the executive level. I want to say it now on this call and my platform so that anybody who delegates to me understands. If people delegate to me, I assume they are on the same page. Maybe they see the need for some change in that particular system.  Kianga Daverington: I’d like to add some food for thought on this topic, which I followed on Discord. It’s interesting. I’ve been at this for six months now. One important thing to consider is humility. Even if there’s something that I oppose at the polling level, I still see value in having that role together. I don’t see a conflict in having the executive function as we’ve described it with the more subjective one. Since we are a DAO, we are interdependent on one another. By that definition, no one will be all-knowing and capable. I don’t see a conflict in most things that I may have voted no on and feel strongly about. For instance, I am still approving the executive that went against my way because when I’m voting on executives, as people have said, I am conceding that the DAO is not just about decisions that I agree with. As I said in the Discord chat, not proving an executive goes toward something I feel was illegitimate in the process. Perhaps on an outline case where I think something’s being approved, that’s damaging existentially. It’s helpful to separate subjective views on individual policies or votes from an overall systemic. This concedes the whole system worked the way we’ve designed it. To your point as well, we have in the US a separate function where an executive is a different person from the Congress that’s passing the votes and signing. I take that point.    21:43  Chris Blec: I don’t know if that’s the best way to look at it because the executive in the US is so opinionated and has so much power.  Kianga: It’s more of a veto, right? The separation you’re talking about is that people voting for the laws are not executing the laws.   I hear you. I’m very opinionated as I’ve developed some strong principles in the space. It is a personal decision to appoint what you feel comfortable doing as part of a DAO. If my name is going on it, I must believe in it. I am not saying I would vote no on a negative executive because it contains one thing out of seven that I disagree with. I might still vote yes if the trade-off is acceptable. And I would provide reasoning around that. But just because it’s an executive, it doesn’t mean I’m immediately going to vote in favor of it. I understand the humility aspect and take a step back at that level to do the community’s will. At the executive level, it’s still a vote. It’s still a personal signature by each delegate, MKR holder, or whoever says, “yes, everything here should be executed permanently.” It’s still at that level and a decision. It is not a given. If people think that the executive shouldn’t be a decision at that level, then the mechanics need to change. Nobody will delegate to me if I’m the only one who thinks this way. So, it’s not going to matter. This is a point governance should think about and perhaps use these conversations to initiate some change in the system set incentives are truly aligned. It boils down to incentive alignment. A DAO is nothing without aligned incentives. Everything MakerDAO does is based on incentive alignment: every Core Unit and module. In this case, incentives are aligned as long a no vote is not financially disincentivized. Suppose we get to a point where a no vote or abstaining is financially disincentivized. In that case, the system is either broken or manipulating incentives to encourage a specific outcome, which is never a good idea. You either want to have incentives aligned, or the system at that point should consider changing. I want to put all this out here because I don’t want to surprise anybody later.  25:30  MakerMan: I will not belabor this because it leads to a question. There’s a distinct difference between voting on an executive versus trying to block an executive. This is what I did on the PSM. I was part of the brainchild that suggested using USDC to mint Dai during Black Thursday as an emergency measure. We got those vaults and were able to get through some difficult times. Then, I suggested to Rune and the DAO the idea that we should actively market and make our peg. That led to Rune’s idea of using the side Dai bridge as the PSM and battle test its code. I actively blocked this because I saw the PSM as a spread manager that should have multiple tiers with liquidities and fee spreads. In the loosest sense, it should be a liquidity Maker of last resort. Not only did I not vote, but I also set my Maker on a previous executive to try and block. I knew it wouldn’t work; it was just a statement. But there are some key differences between those three activities. Chris, I just want to say I appreciate you being forward. That’s important, not just for the Maker holders that would delegate to you, but for the DAO in general. I appreciate all your other comments. My question relates to the PSM because I see them as a significant existential risk. I’ve commented elsewhere that real-world assets, the PSMs, and D3Ms are centralizing forces, not decentralizing forces that hazard the DAO. I’m curious about decentralization being your mantra. You also talked about how you want to do slow growth. If you look at my profile, I’ve always advocated slow, measured, sustainable growth. I’ve had to fight tooth and nail to avoid this rampant growth. I’m curious if you have more comments on the centralization forces like the PSM, the existential risks, and how to approach that generally. Thank you. Everything you said, I’m thinking, “welcome, brother. Maybe I’ll have an ally on some topics.”  Chris: Regarding the PSM, it seems to me so far like an unnecessary evil. I’m not clear yet on the impact of completely rejecting it on Dai liquidity. I still need to learn more about that by looking at the past. I was a purist in 2019 and not a big fan of the switch to multi-collateral. Even today, I think liquidity is a great product and serves a great need because it only focuses on one form of collateral. I came to terms with the fact that it’s not about what kind of collateral you use; it’s about the risk level you allow and where that debt ceiling is. I appreciate these trade-offs from MakerDAO because they taught me when to look and realize trade-offs aren’t always terrible. If you start slow, they can serve as great experiments. Then, you can increase your level of risk as you feel more comfortable. With the PSM, I’m not knowledgeable right now to know if it’s at the right level of risk. I’m a big fan of looking at worst-case scenarios that go to the adversarial. The worst-case scenarios should always be acknowledged. The worst-case scenario with the D3M is Chainlink’s multisig gets hacked, Aave gets completely wrecked, and all the Dai is lost. Then, where does that risk get passed on to? When it comes to the PSM, the worst-case scenario would be blacklisting regulatory interference on the centralized front. What could happen? How would that go? How would that affect the protocol and Maker holders? I know that these discussions have already been had. I’ve never been 100% convinced that the current reliance is proper. I’m also unsure what would happen if it was reduced from X% to Y%. That’s something I need to learn more about. I haven’t been immersed in the ecosystem enough over the past six months to know that today fully. However, I hope to learn over the next few weeks and months. I hear what you’re saying. It’s right to have these concerns. Looking at these things from different points of view shouldn’t be seen as governance attacks. No matter the point of view, anyone contributing to the conversation cares. Since this is a DAO, it’s very complicated. Understanding these issues takes a lot of time, so every point of view should be acknowledged. I was a bit worried yesterday on Discord when we discussed not voting on the executive. The idea was brought up that maybe that’s a governance attack. We must look at these things as conversations. There’s so much at stake with Dai; it could potentially be the future of global finance if it’s done correctly. It goes far beyond crypto and DeFi; it could be critically important to the world. There’s nothing else like it. We must expect that there will be many different points of view that need to be heard. I hope to bring some of that along with MakerMan and others.    31:57  Prose11: Thanks, guys. I know we’re running up against time here. There is one more question from Kianga if you can squeeze it in. She’s asking about codifying disclosure requirements on conflicts of interest. I want to know if you have any thoughts on this for delegates, proposal authors, or general. How should we be setting ourselves up to address conflicts of interest as they pop up?  Chris: That’s a great question. We’re looking at some of the real-world asset proposals and things like that. It goes for delegates and Core Units as well. When we say codify, I don’t know if there are clear rules in place currently. Are there? The answer is no when asked if I have a conflict of interest. Nobody is paying me anything right now. I think it boils down to financial incentives.   Kianga: We don’t have much with specific ownership percentages. We are starting a new conversation on the need for a more formal engagement process of thinking this through to put more specific things in place for different actors in different scenarios.  Chris: It gets blurry because this type of stuff is not even supposed to matter in a decentralized world. The incentives are supposed to prevent an attack because a conflict of interest is an attack. A government attack is not disclosed where you’re incentivized to do something else. However, you’re here contributing in this way and being affected by that other incentive. It gets hazy because it is the right way to fix it in the real world (you’re signing this agreement that states XYZ)? Or is the right way to address it through some other incentive alignment within the DAO, which I can’t come up with now. I agree that it could be an issue, especially with Core Units that have closed meetings. They might have 17 other jobs at work for somebody proposing a real-world asset proposal that could make them a lot of money or any kind of proposal. It’s massive. It’s up to us to vet that out. I agree that it’s a conversation that is worth having. It does boil down to a conflict with financial incentives. That’s I’ve been approaching it.   Kianga: Thank you.   Conclusion  Payton Rose 35:08  That was awesome, Chris. This has been a great dive into some of the things you mentioned on your platform. I appreciate you setting up the time to do this. We’ll be posting the recording so people can learn from this and encourage everyone to engage in the forum on your platform. Keep the conversation going there. But thanks so much for your time today. And we look forward to adding you as a recognized delegate. What needs to happen procedurally is that we’ll get your profile merged up on GitHub. You’ll appear on the voting portal shortly after as a delegation option.  Chris: Thanks, everyone, for spending the time. I appreciate it.     Credits  Larry Wu produced this summary. Artem Gordon produced this summary. Everyone who spoke and presented on the call.  ",
                    "links": [
                        "https://youtu.be/Hau_vkp6F9c?t=22",
                        "https://youtu.be/Hau_vkp6F9c?t=881",
                        "https://youtu.be/Hau_vkp6F9c?t=2107",
                        "https://youtu.be/Hau_vkp6F9c",
                        "https://youtu.be/Hau_vkp6F9c?t=3",
                        "https://youtu.be/Hau_vkp6F9c?t=22",
                        "https://youtu.be/Hau_vkp6F9c?t=242",
                        "https://youtu.be/Hau_vkp6F9c?t=610",
                        "https://youtu.be/Hau_vkp6F9c?t=881",
                        "https://youtu.be/Hau_vkp6F9c?t=970",
                        "https://youtu.be/Hau_vkp6F9c?t=1303",
                        "https://youtu.be/Hau_vkp6F9c?t=1530",
                        "https://youtu.be/Hau_vkp6F9c?t=1917",
                        "https://youtu.be/Hau_vkp6F9c?t=2108",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-june-2022/16529"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.548660154727672
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/06/2022-11:44:32",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}