{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-q3-2021-quarterly-review/11516",
            "title": "GovAlpha Q3 2021 Quarterly Review ",
            "index": 11516,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "quarterly-review"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "17",
                    "time": "08/11/2021-15:04:09",
                    "content": " GovAlpha Quarterly Review Q3 2021  Executive Summary  Successes  Delegation is live with several Recognized Delegates. GovAlpha has continued onboarding and bringing new expertise to the Core Unit. We have added several resources for the community to use while tackling communications challenges like the migration to Discord.   Failures  A lack of follow-through lead to some of our Quarterly Focuses (mainly Education) being a bit neglected this quarter. Leadership Burnout continues to be a concern and not much has been done to improve the situation since it was raised in the last quarterly report. Working on many projects and initiatives has pulled us into much incremental progress, but lacks achieving clear milestones.   Spending  We were again severely under budget this quarter, spending only 357,658.68 DAI of the requested 520,000. Our next budget has been reduced in light of this underspending.   Focuses for Next Quarter  Delegation (again) - we have much work to do in smoothing our voter delegation and ensuring future rounds of delegates will be beneficial to the protocol. Robustness - Next quarter we also turn a more critical eye to providing the resources and research needed to protect the protocol.   Conclusions Qualified Success  While we can deliver a little better on our focuses, this past quarter saw great growth for our Core Unit and reasonable success tackling anticipated challenges. With so many more people and projects we can expand governance effectiveness without bloating the budget. Our next quarter focuses of Delegation and Robustness also make good internal goals for the team.   Analysis  Last Quarter’s Focuses  Delegation  “We are hoping to launch delegation at Maker in a structured and effective way that allows MKR Holders to choose one or more delegates that they feel is compatible with their views.” - An optimistic Prose  Overall we believe our focus on Delegation was pretty evident and yielded some strong results, particularly thanks to the efforts of @LongForWisdom. While the launch may not have been “structured and effective” as it could have been, through the collaboration with DUX Core Unit and many community members who joined us for initial planning calls we were able to deliver voter delegation this past quarter. – Shortcomings – While we expected there to be some issues with Custody Providers, it’s safe to say we had expected to have cleared that particular hurdle for delegation by this point in time. We owe a huge thank you to Jenn from the @Growth-Core-Unit for her efforts in this direction, but until this issue gets sorted, it is unlikely that we will see significantly more MKR being delegated. Another shortcoming of our delegation focus was Delegate Compensation. During initial discussions, we had taken for granted that the delegates would be able to pass some form of compensation for themselves once Delegation got off the ground. However, without more concrete guidance from GovAlpha, the delegates are still waiting on compensation. We are optimistic this will be addressed soon due to the ongoing Signal Process, and hope to find a compensation agreement acceptable to the community that is attractive enough for people to consider becoming recognized delegates. – Successes – Having the ability to delegate permissionlessly to any address or one of our Recognized Delegates is a huge step forward for Maker Governance. That plus the added value from UI tools delivered by @dux-core-unit has meant that a lot more transparency and discourse has been possible surrounding proposals. We are pleased that Delegation is up and running and are happy to continue our focus on this important topic. Additionally, we believe our efforts to spur delegate communication have been a qualified success, with a recent change to our Communication Metric scoring having an anecdotally strong effect on the Delegate’s willingness to communicate their rationale. We believe the greater insight into the results of on-chain voting fosters a healthier community.  Education  \"We will focus our educational efforts on three key areas:  Ongoing development of the Maker Operational Manual. Expansion of Parameter Documentation for Liquidations 2.0 and RWA terms. Adding educational content to the MIPs Portal.\" -Prose “Easier Said Than Done” 11   While work did get done in the three areas above, the results hardly seem worthy of something deemed a quarterly focus. In part, this is due to some projects being in progress rather than delivered, but in general, more accurately represents a lack of focus on this particular area from Core Unit Leadership. Some great steps forward were made by some hard-working contributors, but from a Facilitator’s perspective, this area was given the least attention over the quarter. We wanted to throw a special shoutout to @Gala for her efforts in organizing our core unit’s efforts in this direction. – Shortcomings – We are still waiting to present the Maker Operational Manual to the community, though the beta version will be released shortly. A lot of hard work went into this bundle of documentation, but not enough Facilitator resources were devoted to this project to see it reach its full potential for its quarterly focus. We still see the need for more documentation on the Liquidations 2.0 and RWA front. While we made some progress on the Liquidations 2.0 side, the documentation is still far behind what we would like to see for RWA interactions. By creating and maintaining documentation like this we make Community Governance far more transparent and provide a greater chance of governance being effective. Going forward it would benefit our Core Unit to be more mindful of new additions to the protocol so we can provide documentation in a quick and effective way. – Successes – Don’t want to harp on the good stuff too much as it has been referenced a bit so far. With that said, both the amount of documentation and the number of contributors it is coming from is way up for GovAlpha this quarter over last. This is due to some successful onboarding to GovAlpha for part-time contributors which resulted in a lot more hands producing more documentation than our first quarter as a CU. We have continued to produce several internal documents for processes and onboarding that have also had a positive educational impact. While the quarterly focus was more outward-facing, I think it’s important to call out these successes as part of the quarterly review.  Quality Assurance  “Our aim is to ensure that our time is spent effectively and that deliverables are met consistently and with high quality.” - Prose, being a little vague.  Our budget proposal laid out some pretty clear goals for the on-chain voting, signaling, and MIPs arenas and the results were mixed. While we did make this a pretty reasonable focus for the quarter, areas like MIPs/Subproposals and DAO structure took a bit more attention than the list identified in our budget. – Shortcomings – One of the notable shortcomings from this quarter to emerge was our process for verifying MIPs before they are brought up for a vote. A lot of information needs to be conveyed for the MIPs process to run smoothly, and details like budget implementations need to be granularly present in Core Unit proposals so we can direct executive actions accordingly. While this issue came up a couple of times during this quarter, it has been a strong point of growth for the Core Unit as we are developing tools and status sheets for MIPs to make the process more digestible and transparent. Worth calling out that not a lot beyond general maintenance for polling/executive templates was performed. Accurate and specific templates aid the decentralization process, allowing more actors to take place in on-chain Governance. Going into next quarter is my hope that we will be able to deliver a little more in this area in addition to our future focuses. – Successes – Both the MIPs Portal and the work by @AstronautThis on the Signaling Process have provided great value to the community. MIPs are much easier to navigate and the Portal even features a “Learn” menu for assisting visitors. These efforts were largely contributor-run in GovAlpha, so it was nice to see some time spent on these items after highlighting their importance.  Other Points  Leadership Burnout Evaluation: Ongoing problem Much like in our last Quarterly Update, we must take a beat to acknowledge the threat of burnout. Being a Governance Facilitator (among other positions) can cause quite a lot of stress, especially when urgent situations disrupt the regular workflow. We have not done enough to prevent burnout among our Facilitators and Contributors. One area of success has been in encouraging taking time off. However, encouraging time away from work is not enough to build a healthy work culture. In the future, we must strive to put best practices in place that prevent stress build-up and allow for pursuing passionate, meaningful work. This is not only important personally, but for the longevity of the DAO. The global, 24/7 nature of the protocol is a great asset, but it can also lead to a lack of work-life balance and the feeling of constantly being on the clock. It is our hope we can collaborate with some of the other Core Units on this topic, as we imagine we are not alone in confronting burnout.  Forum Management + Moderation Evaluation: Ongoing problem Another scaling challenge GovAlpha is facing is the increased forum scope and activity. As we create more processes, there are also more processes to monitor. Moderation becomes even more important as we add more signals to the system and it has become apparent we need better ways of factoring out the noise. We have anticipated some challenges with the move to Discord that so far have not been realized. We remain open to the idea of hiring moderation services if simple monitoring starts to take up too much of GovAlpha’s human resources. We believe we can share the burden with other relevant Core Units for the time being, however, and have been pleased with the collaboration in moderation duties over the past quarter.  Onboarding + Scaling Evaluation: Growing Challenge When we first set out to be a Core Unit, one of the ideas presented was having three Governance Facilitators to produce the best quality of governance for the community. However, the position is not an easy one to hire for as the main qualification is time in and knowledge of the Maker Protocol. We are still seeking individuals that desire the role of facilitator and can commit to full-time hours in pursuit of the role. Likewise, it has been a bit of a challenge to find contributors who can work more than a handful of hours a week. While we have made progress in onboarding with our Core Unit (sharing tasks, rotating weekly assignments, sharing skills, and best practices), we are starting to run into a different scaling problem of available hours. While we have many projects in the works, the main thing preventing progress seems to be having personnel that can dedicate a set number of hours to the non-operational task every week. As we add people to our Core Unit, we will eventually have to start biasing more heavily toward contributors able to put in more hours with GovAlpha. This is especially apparent given the number of resources it takes to onboard contributors. With that said, we are quite happy with the team we have assembled so far, and have been able to expand the productivity of the Core Unit because of their contributions.  Spending Source: GovAlpha Q3 2021 Budget  Actuals versus Budget Much like our first quarter, we came in significantly under budget. While this is probably better than being significantly over budget, it’s not very efficient. However, this repeat over-budgeting was due largely to having to submit our second budget only one month into being a Core Unit. Our Q4 2021 - Q1 2022 Budget is significantly smaller and was informed by our lessons from running two budget cycles.    Spending Breakdown  819×507 30.5 KB   Spending Conclusions Much of our over-budgeting came from overestimating how much we would spend on salaries. While we ended up being fairly accurate in the number of people contributing to GovAlpha, the FTE figure is far lower, with the majority of contributors working part-time. The other major gap comes from program spending, entirely attributable to the SourceCred Onchain Technical Design only being partially completed. Some line items went over budget, which can be viewed in detail here, but the only real expenditure of note is the cost for the Cat-Flip like development. We did go into our Contingency Buffer for this expense, but we have been pleased with the work DSpot has done on the MIPs Portal and believe we are getting quality service for the funds.  Next Quarter’s Focuses Our next budget switches to a 6-month cadence. We’re continuing the practice of quarterly goals, however. To better deliver on our proposed focus areas we’ve also selected only two focal points.  Delegation Some items of our next Delegation Focus like collaborations with Content Production and Governance Communications that are already underway. However, more recent topics since our budget passed like Delegate Compensation and Role Definition will require increased Governance attention. Much of Delegation’s success relies on Custody Platforms being able to provide delegation to large holders (like Venture Capital Firms). Until the majority of large VCs who wish to delegate can do so our Delegation bootstrapping will not be complete.  Robustness We are excited to be focusing on the topic of Governance Robustness next as it is in many ways one of the key areas GovAlpha can deliver unique value to the Maker Protocol. Our work onboarding this past quarter has put us in the position to accomplish much more by providing quality resources and research for the DAO in addition to keeping the wheels of decentralized governance turning. While some projects like the Maker Operational Manual will carry over from the previous quarter and be relevant in our new focuses, we also intend to follow up on new initiatives and ideas. Our proposed Governance Mechanism Hardening will again be informed by the recent vision proposals in the DAO, but we intend to follow through on critically examining our Governance structure this quarter so we may implement improvements where necessary in Q1 of 2022.  Conclusions and Final Words Overall I am quite pleased with this past quarter. It was my first quarter as a fully onboarded Governance Facilitator and I can point to many inspiring moments these past few months. With that said there are areas for improvement that I hope this post helped highlight so we can do even better this quarter. With the expansion of GovAlpha’s contributor base, we are now able to more efficiently assign work and keep the core governance process in check, while devoting time to expanding out our procedures and resources. While this has presented a bit of a challenge to Long and myself on the management front, the present and future rewards for this expansion are bright. A big personal shoutout to @juan and @SES-Core-Unit who have been great scaling stewards in their advice and community resources. My final reflection circles back to our next quarter’s focuses of Delegation and Robustness. These were written with the DAO at large in mind. We wanted to let the community know what we thought needed our attention and how we planned on delivering improvements. Ironically, I think these two items make incredible internal focuses as well. If we want to fight off leadership burnout, we must be building the Core Unit out in a robust way that encourages the delegation of tasks. Moreover, a robust GovAlpha pays incredible dividends to the DAO as a whole, with more members being able to handle more situations as they arise. There will always be hot-button issues and large challenges that will need to be overcome by the community. By setting goals, reviewing them, and sharing our progress with the community we believe that we can continue to deliver regardless of the present paradigm. Thank you for taking part in that process and we welcome any feedback, comments, or questions below!   ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP40c3SP11",
                        "https://docs.google.com/spreadsheets/d/1C4mmBme8hUDI8dStDDmpSkowkfVI9Esfmi0nngnWNts/edit?usp=sharing",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP29",
                        "https://forum.makerdao.com/t/maker-relay-ep-70/11528",
                        "https://forum.makerdao.com/t/under-construction/12274/6",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/maker-relay-ep-70-en-espanol/11569",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.100696909779955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/02/2022-15:04:39",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}