{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/eth-warsaw-the-schuppi-and-el-pro-makerdao-delegate-happy-hour-in-ethwarsaw-2022/17607",
            "title": "ETH WARSAW: The Schuppi and El Pro MakerDAO Delegate Happy Hour in ETHWarsaw 2022 ",
            "index": 17607,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "schuppi-elpro",
                "happy-hour"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "11",
                    "time": "02/09/2022-04:10:47",
                    "content": " ETH Warszawa 2022 This week we find ourselves at the first ever ETHWarsaw!! The 2022 ETH Warsaw Conference at The University of Gmach Głowny Politechniki Warszawakiej, better know as Polytech Warsaw, takes El Pro on a solo journey into the minds of MakerDAO contributors, including @juan of SES Core Unit, @Retro of SES Core Unit, and @krzkaczor former PECU team member and now L2 Beat contributor. We also got to watch Sam McPherson, a.k.a @hexonaut  of PECU make a presentation on the exciting future of Cross-chain transactions, and @NikKunkel  of Oracles Core Unit introducing the Chronicle! We hope you enjoy this episode and get a chance to Meet the Makers. 01:08: The Visionary of Eth Warsaw: Paweł of @Oracles-Core-Unit 03:36 Juan of @SES-Core-Unit 04:45 What is SES up to lately? 06:25 “The” Dashboard 07:55 Project Based Financing Proposal by Juan 09:55 Juan on how SES can prepare for a possible pivot to the Endgame 11:30 Retro of SES Core Unit 12:30 How in the world did Retro land in MakerDAO-land? 14:20 Yahoo Finance on stage with Retro  16:30 How Retro shuffles his work schedule and duties, while staying aligned with his co-teammates expectations. **21:00 Retro’s thoughts on the possible inefficiencies that the Endgame might encounter 23:28 Chris of L2 Beat **24:25 How the Maker Foundation played a role and inspired the L2 Beat movement and eventually the coolest name. 26:50 Chris on how L2Beat.com helps provide research of the architecture of layer 2 bridges. 29:00 Fuel (optimistic rollup) in the only Decentralized Bridge in existence to date–but nobody uses it. 31:50 Thoughts on the MakerDAO Teleport – Chris’s last project while at MakerDAO    34:25 Can Bridges become the equivalent of the hypertext transfer protocol application layer? 38:10 Assessing Blockchain Bridges — Joel John  40:55 The Ethereum Community in Warsaw, Poland 43:35 Sam McPerson of PECU presenting at ETHWarsaw 2022 52:30 The Official Release Announcement of the Oracles Core Units new designed product, THE CHRONICLE by Nik of Oracles at ETH Warsaw 2022.      ",
                    "links": [
                        "https://mirror.xyz/0xD4977DF3e967ddb604bB4f4D0d263f69B6c8A3e4/uPhBOMcQQ-TeY2n0naf3M8aLQnb04X2YcO41eaWpFN4",
                        "https://www.youtube.com/watch?v=K9mjbCp3WV8"
                    ],
                    "GPT-summary": "The post is about the ETHWarsaw conference and the various presentations made by contributors of MakerDAO and Oracles Core Unit. The post is entirely positive and serves as an advertisement for the conference, with the author extending an invitation to \"Meet the Makers\". The post also includes questions asked by the audience during the presentations.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.856534090909092
                }
            ]
        }
    ]
}