{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/take-aways-from-the-september-10-governance-and-risk-meeting/4087",
            "title": "Take-aways from the September 10 Governance and Risk Meeting ",
            "index": 4087,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "8",
                    "time": "11/09/2020-08:20:46",
                    "content": "Pros:  Demand for Dai is red-hot Maker growth only limited by internal factors  Cons:  There is a large backlog of greenlit collateral building up Domain teams Risk, Oracles and Smart Contracts are overwhelmed Above domain teams have been in this situation for months Above domain teams are also considering legal issues as the Legal domain team is not in place  Conclusions:  An HR domain team should be put in place to accelerate onboarding and replace Foundation members leaving Additional Contributors to existing Domain Teams should be found Whole additional Domain Teams for Risk, Oracles and Smart Contracts needs to be onboarded. Some form of Legal domain team needs to be built up As the Domain Teams Risk, Oracles and Smart Contracts are not set up to handle legal issues, these issues should possibly be left for the community to decide by vote instead of further increasing the load on the domain teams. At least until a Legal domain team is in place. The community needs to engage in forward planning in order to be more prepared for the next bottleneck  If I have missed anything or if you have another opinion about the situation please correct me. ",
                    "links": [],
                    "GPT-summary": "The post discusses the takeaways from a recent Governance and Risk Meeting related to the MakerDAO project. The author explains the pros and cons of the current situation and proposes solutions to address the challenges faced by the project. The post also invites feedback and corrections from the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.546428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/09/2020-08:25:57",
                    "content": "A signal request discussed regarding prioritizing real world assets that will issue DAI.     [Signal Request] Should Real World Asset collateral onboarding be prioritised in the short term? Governance       Summary of the situation:  The Maker community continues to search for quality collateral assets which can be added to stimulate DAI supply, ease pressure on the DAI peg, and generate liquidity and revenue for the protocol. Some of the new collateral types added since Black Thursday have been successful at this (e.g. USDC-A, WBTC-A which have 40mm and 46mm DAI outstanding against them, respectively), while others were underwhelming (e.g. KNC, ZRX, and MANA which collectively issue just over 500k…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0123106060606055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "1",
                    "time": "11/09/2020-08:40:17",
                    "content": "Fully agree with your points, we are at a bottleneck. It is in line with my previous signal request on HR and Finance which was probably not well formulated. Any fresh idea is welcome. The MIP23 is also a step in the HR direction. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip23-domain-structure-and-roles/4021"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#4",
                    "likes": "2",
                    "time": "11/09/2020-13:00:16",
                    "content": "I agree with your summary. One question that came up for me that I didn’t get unfortunately in the meeting due to time, that I’d love to have @Primoz or @williamr weigh in on: We talked about the merits of spending time to onboard large-cap crypto assets, specifically about how much DAI they can generate and whether that’s worth it over focusing on RWA which might take longer to get on but can generate much more DAI. What we never discussed is the ongoing “maintenance overheada” of a relatively large number of crypto assets for the domain teams. If we were to add 20 more crypto assets such as ZRX or MANA, how much more time do the different domain teams need to spend on managing those? There must be token upgrades, migrations, changing market situations etc. that will need to be monitored? I think this could potentially make it even harder for the community to onboard RWA assets.     Planet_X:  As the Domain Teams Risk, Oracles and Smart Contracts are not set up to handle legal issues, these issues should possibly be left for the community to decide by vote instead of further increasing the load on the domain teams. At least until a Legal domain team is in place.   I agree, it’s a topic that we shouldn’t forget or ignore but what you propose is a good way forward that I think will avoid us getting completely gridlocked until such a domain team is in place. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.705357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/09/2020-21:11:43",
                    "content": "Hey @spin, sorry for late response. On Risk side we intend to automize monitoring of risk exposures for crypto assets as much as possible, use a bit more pragmatic approach (use complex quantitative models only for larger collateral assets) and focus mostly on those important metrics that are needed as inputs for continuous evaluation of appropriate debt ceiling and risk premiums. There will be some more work initially, but this will be strongly beneficial in the mid to long run for us. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.561111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#6",
                    "likes": "0",
                    "time": "16/09/2020-10:59:40",
                    "content": "For me that is an additional argument why these collateral types that add very little DAI might not be worth it for now: the tools are not developed yet and so this would cause additional work for the risk teams until we have them freeing up even less time to onboard RWA assets that have a higher impact. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.089583333333333
                }
            ]
        }
    ]
}