{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/knc-migration-plan/7705",
            "title": "KNC Migration Plan ",
            "index": 7705,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "knc",
                "knc-a",
                "token-migration"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "9",
                    "time": "28/04/2021-17:04:10",
                    "content": "Hi everyone, You may have heard that Kyber Network will be migrating from the current KNC token to a new token version. The migration will allow for a governance system upgrade as well as additional token allocation to the DAO for future incentives. Full details and migration guide can be found here. As users begin to migrate their funds, we should expect to see liquidity decline for the legacy KNC token. To avoid any potential negative impacts on liquidations and difficulty obtaining accurate price data, I propose that we take the following action to deprecate the KNC-A vault.  Step 1: Reduce maximum debt ceiling from 5,000,000 to 0 DAI Please review this signal request and confirm your support or opposition to reducing the KNC-A vault debt ceiling to 0. Note that this prevents users from borrowing additional funds, but will not have any immediate impact on existing positions.  Step 2: Gradually increase vault stability fee The Maker Open Markets Committee, a parameter proposal group addressing interest rate policy, can recommend borrowing cost increases on the KNC-A vault to incentivize remaining users to close their position.  Step 3: Optionally reapply for collateral support for new KNC token If community members wish, they may submit a MIP 6 collateral onboarding application for the new KNC token. This process could begin at any time, and does not need to wait until we’ve fully deprecated the KNC-A vault. I’m happy to answer any questions or discuss next steps to handle the token migration. ",
                    "links": [
                        "https://blog.kyber.network/knc-token-migration-guide-fda08bfe62c2",
                        "https://forum.makerdao.com/t/signal-request-adjust-knc-a-debt-ceiling/7706",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-form-forum-template/1908",
                        "https://etherscan.io/address/0xdeFA4e8a7bcBA345F687a2f1456F5Edd9CE97202",
                        "https://forum.makerdao.com/t/signal-request-adjust-knc-a-debt-ceiling/7706"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.628246753246753
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/05/2021-19:02:23",
                    "content": "The KNC-A vault deprecation process is moving forward smoothly! The signal request forum poll has resolved with an majority of voters in favor of reducing the KNC-A debt ceiling to 0 DAI. And MOMC / rates working group has proposed a reduction of the debt ceiling and increase in borrowing rates for KNC-A, following through on steps 1 and 2 of the plan above.This change is currently up for a MKR poll vote, and will be considered in this Friday’s executive vote if the poll resolves in favor. I’ll reach out to the Kyber community to communicate these changes and assess interest in submitting a collateral application for the new KNC token. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-4-may-2021/7835",
                        "https://vote.makerdao.com/polling/QmPfe7kF?network=mainnet#poll-detail"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.795454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/08/2021-01:02:58",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}