{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip13c3-sp9-onboarding-a-new-collateral-type-backed-by-b-protocol-declaration-of-intent/5920",
            "title": "MIP13c3-SP9: Onboarding a new collateral type backed by B.Protocol (Declaration of Intent) ",
            "index": 5920,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#1",
                    "likes": "11",
                    "time": "05/01/2021-10:52:36",
                    "content": " Preamble MIP13c3-SP#: 9 Author(s): Yaron Velner (@yaronvel) Contributors: n/a Status: Withdrawn Date Proposed: 2021-1-05 Date Ratified: <yyyy-mm-dd> Declaration Statement: Onboarding a new collateral type backed by B.Protocol. Declaration to Replace: n/a   Specification  Context and Motivation  Maker, and the DeFi ecosystem in general, has conservative collateral ratios (CR), in order to mitigate potential failures in the liquidation process. High CRs narrows the potential user base, and the potential profit from stability fees (SF). B.Protocol introduces the concept of a backstop made of committed liquidators, who get priority in the liquidation process, in return to their commitment. B.Protocol is live since October 2020, backstopping over $18m of ETH-A collateral and $6m debt. Few successful liquidations were already done. In ETH-A collateral B.Protocol is an opt-in system, where users can decide to manage their Vault with, and give priority to the liquidators. B.Protocol liquidators in return share some of their proceeds with the users who give them the priority. In particular, it requires the user to interact with a new set of smart contracts. An experiment is proposed for a native integration between B.Protocol and the MakerDAO system, by on-boarding a new collateral type, namely WBTC-B or ETH-C, with lower CR than WBTC-A or ETH-B (respectively), which will be natively backed by a strong commitment from B.Protocol backstop.   Committed backstop design For simplicity we describe a system with a single liquidator. Scaling the system for multiple liquidators, in a permissionless way, will be handled by B.Protocol, and it is not in the scope of this writeup (we presented some ideas on how to achieve fairness here). We illustrate the protocol with an example of WBTC collateral, $5M ceiling, and 0 liquidation penalty, however, this is only for the sake of illustration, and it is not part of the declaration of intent Initialization: the liquidator opens a Vault with $0.5M WBTC deposit, and 0 debt. We denote this liquidator’s Vault with lv. Liquidator can withdraw collateral or increase his debt, only if his net position (collateral minus debt) is over $0.5M (according to MakerDAO price feed). Liquidation: when calling bite to an unsafe Vault v, then if v==lv, or lv does not have a net position of $0.5M, then v is subject to a standard liquidation process (by the cat or the dog). Otherwise, the entire position of v is forked and added to lv. The user of v is losing all his collateral (which is effectively a maximum of 10% penalty). lv get all the user collateral and all of the user debt. The bite function is callable by anyone.  Declaration Detail Maker Governance declares its intention to experiment a native integration with B.Protocol. Namely, to on-board a new collateral that gives a priority(*) in liquidations to B.Protocol, in return to an on-chain commitment of B.Protocol backstop liquidators through an on-chain crypto-economic incentive (**), towards successful liquidations. (*) If B.Protocol fails to liquidate a Vault, then the Vault will be liquidated by the standard Maker keepers, like today. (**) Liquidators who fail to liquidate, will incur an economical cost. Further, it is the governance intent that:  The development work will be done by the B.Protocol team, to the satisfaction of the Maker’s smart contract team. The collateral oracle will be recommended by the oracle team. The risk parameters, namely, the CR, debt ceiling, and auction parameters (if still applicable) will be recommended by the risk team. Stability fee and liquidation penalty will be discussed again with the community, in the form of signal requests.   Relevant Links  Discussion: WBTC-B collateral type, backed by B.Protocol with x10 leverage [INFORMAL POLL] Would the Maker Community want to onboard a new collateral (e.g., WBTC-B), backed by B.Protocol that has lower CR with the same SF?  Collateral Onboarding Community Call by @juan   ",
                    "links": [
                        "https://forum.makerdao.com/t/technical-report-b-protocol-liquidations-during-last-thursday/5389",
                        "https://medium.com/b-protocol/achieving-fairness-in-liquidations-over-b-protocol-7f9ebfd06293",
                        "https://forum.makerdao.com/t/discussion-wbtc-b-collateral-type-backed-by-b-protocol-with-x10-leverage/5409",
                        "https://forum.makerdao.com/t/informal-poll-would-the-maker-community-want-to-onboard-a-new-collateral-e-g-wbtc-b-backed-by-b-protocol-that-has-lower-cr-with-the-same-sf/5652",
                        "https://www.youtube.com/watch?v=CaDnKAlCpiM&feature=emb_logo&ab_channel=MakerDAO",
                        "https://forum.makerdao.com/t/weekly-mips-update-38/8486",
                        "https://forum.makerdao.com/t/weekly-mips-update-37/8309",
                        "https://forum.makerdao.com/t/guide-navigating-feedback-from-governance-and-the-greater-makerdao-community/8303",
                        "https://forum.makerdao.com/t/mips-update-36/8125",
                        "https://forum.makerdao.com/t/weekly-mips-update-35/7962",
                        "https://forum.makerdao.com/t/weekly-mips-update-34/7668",
                        "https://forum.makerdao.com/t/community-call-lets-talk-about-b-protocol-apr-27-16-00-utc/7664",
                        "https://forum.makerdao.com/t/weekly-mips-update-33/7573",
                        "https://forum.makerdao.com/t/weekly-mips-update-32/7464",
                        "https://forum.makerdao.com/t/weekly-mips-update-31/7232",
                        "https://forum.makerdao.com/t/weekly-mips-update-30/7083",
                        "https://forum.makerdao.com/t/weekly-mips-update-29/7000",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949",
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932",
                        "https://forum.makerdao.com/t/weekly-mips-update-28/6791",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/18",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-129-thursday-february-18-17-00-utc/6506/5",
                        "https://forum.makerdao.com/t/weekly-mips-update-27/6649",
                        "https://forum.makerdao.com/t/maker-relay-ep-32-en-espanol/6600",
                        "https://forum.makerdao.com/t/maker-relay-ep-32/6596",
                        "https://forum.makerdao.com/t/maker-relay-ep-31-en-espanol/6455",
                        "https://forum.makerdao.com/t/maker-relay-ep-31/6450",
                        "https://forum.makerdao.com/t/maker-relay-ep-30/6303",
                        "https://forum.makerdao.com/t/weekly-mips-update-26/6291",
                        "https://forum.makerdao.com/t/maker-relay-ep-29-en-espanol/6220",
                        "https://forum.makerdao.com/t/maker-relay-ep-29/6214",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124",
                        "https://forum.makerdao.com/t/maker-relay-ep-28/6118",
                        "https://forum.makerdao.com/t/discussion-wbtc-b-collateral-type-backed-by-b-protocol-with-x10-leverage/5409/47",
                        "https://forum.makerdao.com/t/weekly-mips-update-25/6092",
                        "https://forum.makerdao.com/t/brainstorm-how-do-we-ensure-small-vaults-have-a-place-at-maker/6072/19",
                        "https://forum.makerdao.com/t/weekly-mips-update-24/6052",
                        "https://forum.makerdao.com/t/maker-relay-ep-27-en-espanol-feliz-2021/6035",
                        "https://forum.makerdao.com/t/maker-relay-ep-27-happy-2021/6016",
                        "https://forum.makerdao.com/t/weekly-mips-update-23/5914",
                        "https://forum.makerdao.com/t/maker-relay-ep-30-en-espanol/6360",
                        "https://forum.makerdao.com/t/b-protocol-v2-integration-technical-review/12019",
                        "https://forum.makerdao.com/t/wbtc-b-and-wbtc-bprot-a-review-and-plan-of-action/11191",
                        "https://forum.makerdao.com/t/weekly-mips-update-46/9532",
                        "https://forum.makerdao.com/t/weekly-mips-update-45/9427",
                        "https://forum.makerdao.com/t/weekly-mips-update-44/9303",
                        "https://forum.makerdao.com/t/weekly-mips-update-43/9190",
                        "https://forum.makerdao.com/t/weekly-mips-update-42/9010",
                        "https://forum.makerdao.com/t/weekly-mips-update-41/8892",
                        "https://forum.makerdao.com/t/maker-relay-ep-49-en-espanol/8795",
                        "https://forum.makerdao.com/t/mip13c3-sp11-onboarding-a-new-collateral-type-backed-by-b-protocol-v2-declaration-of-intent/8802",
                        "https://forum.makerdao.com/t/maker-relay-ep-49/8763",
                        "https://forum.makerdao.com/t/weekly-mips-update-40/8759",
                        "https://forum.makerdao.com/t/weekly-mips-update-39/8606"
                    ],
                    "GPT-summary": "The post proposes a native integration between B.Protocol and MakerDAO system by on-boarding a new collateral type, namely WBTC-B or ETH-C, with lower CR than WBTC-A or ETH-B, which will be natively backed by a strong commitment from B.Protocol backstop. The post explains the committed backstop design and the declaration detail. The post also provides relevant links for further discussion and information. The post does not contain entirely positive or negative feedback on the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.425002516862982
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "4",
                    "time": "05/01/2021-12:14:30",
                    "content": "Really looking forward to this! Very exciting. By the time this gets deployed, Hopefully the volatility on WBTC will be more stabled (not doubling in value within 30 days), and we can start w/low DC. For sure we will need B.Protocol to help us backstop liquidations, not just for ETH but for others. The greed factor is boiling hot right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.813095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#3",
                    "likes": "3",
                    "time": "05/01/2021-17:13:10",
                    "content": "I am really glad to see this come to fruition in the not too distant future. It is almost a guarantee that there will be plenty of liquidations when this bull market runs out of steam and B. Protocol can help with a “controlled” demolition. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#4",
                    "likes": "1",
                    "time": "20/01/2021-08:51:59",
                    "content": "    flipflopflapdelegate:  The greed factor is boiling hot right now.   This thread nicely demonstrate how bitmex can charge 100% stability fee (aka funding rate - the comparison is not 1:1, as it does not go to bitmex, but this is exactly the interest rate of borrowers, which is what maker stability fee is) thanks to the ability to offer high leverage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.454761904761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#5",
                    "likes": "1",
                    "time": "20/01/2021-09:42:50",
                    "content": "Where can I see the list of MCD vaults that use B Protocol? The website says 175 vaults, with an average CR of 300%, but no other info. Where can I see the info relevant to Keepers. Stuff like amount of dai committed, number of committed accounts. Can I become a Keeper today? Do you know who the current Keepers are, and where they got the dai from? Is this part of the system custodial? What is the B Protocol’s estimation of how much dai would need to be committed to B Protocol in order for something like WBTC-B with 120 LR, 6 SF and 5M DC to be “safe”. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.635416666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#6",
                    "likes": "3",
                    "time": "20/01/2021-12:24:49",
                    "content": "    rema:  Where can I see the list of MCD vaults that use B Protocol?   if reading the smart contract is not an option for you, then maybe this will help https://explore.duneanalytics.com/dashboard/b-protocol     rema:  Where can I see the info relevant to Keepers.      Medium – 1 Oct 20    The genesis backstop: B.Protocol brings new players to DeFi liquidations We are pleased to announce that Kyber Network’s top 3 liquidity providers (LPs) joined our genesis backstop, who will execute the… Reading time: 5 min read           rema:  Stuff like amount of dai committed   in the present state they don’t lock any DAI in B.Protoocl, but rather do this:    Medium – 24 Nov 20    How Kyber Uses B.Protocol And FPR As A Professional DeFi Backstop The first member in our genesis backstop, Victor Tran (Kyber Network’s CTO) has completed the integration of B.Protocol with Kyber Reserve. Reading time: 6 min read        The RFC propose a framework they could commit.     rema:  Can I become a Keeper today?   the technical requirements are very different than just running an arbitrage bot that takes a flash loan. but if you can satisfying them, you are welcomed to join (DM me).     rema:  What is the B Protocol’s estimation of how much dai would need to be committed to B Protocol in order for something like WBTC-B with 120 LR, 6 SF and 5M DC to be “safe”.   For 5 DC, we think $0.5M lockup will be more than enough. But this is up to discussion also with the risk team. Note that it does not mean that only $0.5M dai will back the $5M, but rather that the liquidators have $0.5M incentive not to screw up. And if they do screw up, Maker standard liquidation system kicks in. ",
                    "links": [
                        "https://medium.com/b-protocol/the-genesis-backstop-b-protocol-brings-new-players-to-defi-liquidations-74619b11486e",
                        "https://medium.com/b-protocol/the-genesis-backstop-b-protocol-brings-new-players-to-defi-liquidations-74619b11486e",
                        "https://medium.com/b-protocol/how-kyber-uses-b-protocol-and-fpr-as-a-professional-defi-backstop-8d54573c4296",
                        "https://medium.com/b-protocol/how-kyber-uses-b-protocol-and-fpr-as-a-professional-defi-backstop-8d54573c4296"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.96024981962482
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#7",
                    "likes": "2",
                    "time": "20/01/2021-18:49:22",
                    "content": "I managed to find the vaults. Out of 175 vaults, only 118 deposited ether at all. Only 22 of them have more than 100 ether in collateral, the top 1 vault represents 31.5% of all collateral and the top 5 represent 70%. Out of the top 30 vaults (>50 ETH) majority of them were migrated from normal MCD vaults. You can find them here if anyone is interested. The #1 vault immediately stands out due to how big it is compared to others and also how active the owner is across wider defi, but it is also the only vault which is currently maintaining low CR (~160%), other vaults seem well collateralized. In regards to Keepers, and the recommended blog post, it seems currently B.Protocol is integrated with FPR (feed price reserve) based reserves in Kyber Network only. Those are also the largest FPR reserves in Kyber currently, namely; Anonymous Reserve, OneBit and Kyber FPRv2. As mentioned in the blog post, the Anonymous Reserve is also an old Maker Keeper, while OneBit and Kyber are new to the table. As seen here, Kyber Reserves hold 160k dai, OneBit holds 140k while Anonymous holds 2.7m. In total, new Keepers brought ~300k dai. There is an additional issue. In instances of severe dai liquidity crunch, reserves would get dried out, as the price of dai would spike. The reserves of dai for B.Protocol are the same as dai reserves in KyberNetwork. ",
                    "links": [
                        "https://tracker.kyber.network/#/reserves",
                        "https://docs.google.com/spreadsheets/d/17QPDHZw-IbhWvayUbj7LZXx4B8RTGTe-iHPspxXWRZo/edit#gid=1456254052"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.456123737373737
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#8",
                    "likes": "0",
                    "time": "20/01/2021-20:25:41",
                    "content": "  the distribution of accounts in B.Protocol is very similar to the distribution in Maker in general. where very few have the majority of debt.   What is special about professional liquidators, is that they have robust hedging systems. e.g. see here. In the current version, our keepers are in best effort more without a strong commitment. In the proposed Vault they will lockup collateral, that will be lost if they fail to liquidate.   Eventually a system like Maker need to make it possible for liquidators to profit. And asking high capital lockup is not an efficient way to do it. Now please take a look at Maker auctions. Check how many players participated there (spoiler, around 3, and normally 1 wins everything, if you filter smart contracts that are used by multiple senders). See how much capital they have. And what kind of commitment they have during times like black thursday. Anw, what we propose is to have Maker keeper as the ultimate backstop also in this RFC. ",
                    "links": [
                        "https://forum.makerdao.com/t/state-of-wrapped-bitcoin-wbtc/6800/2"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.87202380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#9",
                    "likes": "0",
                    "time": "20/01/2021-20:33:05",
                    "content": "    rema:  There is an additional issue. In instances of severe dai liquidity crunch, reserves would get dried out, as the price of dai would spike. The reserves of dai for B.Protocol are the same as dai reserves in KyberNetwork.   btw, this is exactly the point of having committed liquidators. If you don’t have to compete with the rest of the world, you can be prepared by minting DAI on demand, hedging your USD exposure in future exchanges. Having a system to slowly close this position. None of it is possible in current DeFi liquidation systems. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.821428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#10",
                    "likes": "4",
                    "time": "23/02/2021-22:48:44",
                    "content": "@yaronvel Do you intend to submit this for the March governance cycle? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#11",
                    "likes": "3",
                    "time": "24/02/2021-12:06:05",
                    "content": "Given some feedback we got, we plan to work on improving the presentation of this proposal, and we will likely not make it in time for the March cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#12",
                    "likes": "1",
                    "time": "24/02/2021-15:12:34",
                    "content": "Sending you good vibrations in the hopes this gets the greenlight eventually. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#13",
                    "likes": "0",
                    "time": "06/04/2021-14:22:06",
                    "content": "Hey, @yaronvel do you plan on formally submitting this proposal to April’s governance cycle, or are you still working on improving it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#14",
                    "likes": "0",
                    "time": "06/04/2021-15:52:29",
                    "content": "Still work in progress. I can retract it in the meantime, but idk how. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#15",
                    "likes": "1",
                    "time": "06/04/2021-16:22:09",
                    "content": "Understood! There is no need to retract the proposal, it will continue to remain in the RFC phase, where you can continue to make adjustments. Once you are comfortable with the state of the proposal, you can reach back out to me about preparing for formal submission to a future governance cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#16",
                    "likes": "1",
                    "time": "06/04/2021-19:04:48",
                    "content": "I can’t wait for this vault experiment. I am sure it will be glorious. Kudos to you for taking the lead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#17",
                    "likes": "5",
                    "time": "07/04/2021-11:01:04",
                    "content": "thanks. we are working on a design that could scale to $100m+ liquidations per hour. hope we could share details soon. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#18",
                    "likes": "4",
                    "time": "03/05/2021-18:16:18",
                    "content": "Hey @yaronvel, do you have any updates on this proposal? We are planning for Formal Submission for May’s governance cycle and are looking for updates from proposal authors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#19",
                    "likes": "1",
                    "time": "16/06/2021-11:44:22",
                    "content": "I would like to close this proposal. I submitted a revised version of it here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#20",
                    "likes": "2",
                    "time": "16/06/2021-14:01:30",
                    "content": "You got it. This proposal’s status has been updated to Withdrawn. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}