{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/brainstorm-discussion-features-i-wish-existed/6873",
            "title": "[Brainstorm/Discussion] Features I Wish Existed ",
            "index": 6873,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "15",
                    "time": "06/03/2021-16:37:52",
                    "content": "Hi Everyone, Similar to how Core Units I Wish Existed deals with personnel, I wanted to start a thread on what community members think would be awesome technical/design features that could be added to the protocol in the future. This could be anything from features that exist on other platforms that you think could improve the protocol to design changes to make the user experience better. I know we like to throw ideas around a lot in Rocket Chat and in random posts but I thought it would be smart to have a consolidated place to share and document these ideas. For example, some features I hope/wish to be added in the future are:  Being able to vote with MKR LP tokens Having the ability to lock tokens for increased staking rewards based on time Having fixed rate/dynamic SF vaults Using MKR as collateral (controversial) Lending out vault collateral Adding a ratio for continuous burn/surplus/rewards EuroDAI and other synthetics Minting/Borrowing on L2  Even if you think your ideas might be unpopular or controversial I encourage you to share your ideas that you think would lead to a more “successful” protocol, however you define that. It can even be stuff that will probably get added in the medium future but you’re super excited for it to happen! Hopefully this thread will inspire all of us and we can create some awesome MIPs in the future based on these ideas! Looking forward to hearing your thoughts! ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-132-thursday-march-11-17-00-utc/6859/2",
                        "https://forum.makerdao.com/t/governance-at-a-glance-mar-5-mar-11-2021/6977"
                    ],
                    "GPT-summary": "The author of the post is asking for feedback on technical/design features that could be added to the protocol in the future. The post encourages community members to share their ideas, even if they are unpopular or controversial, to create more successful MIPs in the future. The post also invites users to share their thoughts and ideas on the topic.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "This is not a discussion, but the proposal itself",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.182468820861678
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "0",
                    "time": "18/05/2021-14:32:11",
                    "content": "Just wanted to bump this discussion. I’m working on a list right now and would love some more feedback. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "1",
                    "time": "18/05/2021-21:34:25",
                    "content": "Oh man–totally forgot to write my wish-list–but I hesitated–probably because it would be too long and I’m not sure if pushing the DAI narrative via integartions on NEAR, Solana, Cosmos, Polkadot, and yes even Terra, is a feature. But I guess if I could ask for “features”–it would be marketing of DAI in North America via a partnership with someone like Linen.app, Dharma, etc.–where we paint the entire town DAI yellow and relentlessly pitch everyday people the concept of saving money with DAI. I’m talking marketing teams attending events (where possible & available), Ads galore, partnerships with influencers, sponsorships of Sports Teams, Sports Events, and anything and everything that has to do with marketing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "1",
                    "time": "18/05/2021-22:07:06",
                    "content": "That counts! Thanks for contributing your ideas! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#5",
                    "likes": "3",
                    "time": "19/05/2021-02:38:25",
                    "content": "Need to onboard a marketing CU stat (caveat: but not a group unable to clearly explain why they need an astronomical, eye-watering high budget … I believe PaperImperium made these points and more much more eloquently than me). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.76
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#6",
                    "likes": "2",
                    "time": "19/05/2021-02:48:49",
                    "content": "    Tosh9.0:  marketing   I second that motion. We are at a place where advertising/marketing makes sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "18/08/2021-08:49:12",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}