{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp4-to-a-short-ratification-poll/17445",
            "title": "[Signal Request] Promote MIP4c3-SP4 to a Short Ratification Poll ",
            "index": 17445,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "mip65"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "6",
                    "time": "25/08/2022-17:52:38",
                    "content": " [SIGNAL REQUEST] Promote MIP4c3-SP4: MIP65 Amendments to a Short Ratification Poll This Signal Request will —upon passing— promote MIP4c3-SP4: MIP65 Amendments to an on-chain short (i.e., three-day) Ratification Poll, as per process component MIP4c3*. *TL;DC (too lazy; did not click): MIP4c3 subproposals amend MIPs that have been ratified less than three months ago. They have a one-week Feedback Period (plus a one-week, possibly overlapping Frozen Period) and are promoted on-chain via Signal Requests. They enter the weekly cycle.    Promote MIP4c3-SP4 to a on-chain Short Ratification Poll  Yes No Abstain     0 voters      Next steps This Signal Request will run until 2022-09-02T00:00:00Z. If more than 50% of the non-abstaining votes support this signal, MIP4c3-SP4: MIP65 Amendments will go on-chain as a short Ratification Poll on 2022-09-05T16:00:00Z. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP4#MIP4c3",
                        "https://forum.makerdao.com/t/mip4c3-sp4-mip65-amendments/17326",
                        "https://forum.makerdao.com/t/mip4c3-sp4-mip65-amendments/17326/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-102/17511",
                        "https://forum.makerdao.com/t/weekly-mips-update-103/17674",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-25-31-de-agosto-del-2022/17644",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/14"
                    ],
                    "GPT-summary": "The author of the post is requesting feedback on a proposal to promote MIP4c3-SP4 to a short ratification poll. The post explains the process and purpose of the proposal. The post does not contain any advertising or collaboration requests. A third party could provide constructive criticism or ask questions about the proposal, or audit and review it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.409722222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "25/08/2022-17:52:41",
                    "content": "Please see this for GovAlpha’s summary of MIP4c3-SP4 and this SR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "1",
                    "time": "01/09/2022-16:08:57",
                    "content": "Hey folks, voters and @Recognized-Delegates in particular. Wanted to get some more input on this before we close the issue. Can we get some more votes to decide if this should be polled on Monday? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/09/2022-18:12:53",
                    "content": "I voted no because if I understand correctly @christiancdpetersen will do the work and (I HOPE) compensation/engagement is secured via the appropriate agreements. So this proposed language does not work for me for being vague and loose. With Christian - it is a status quo that we fully support. Other than that - if the language gives permission for someone else to do the work - this is not a good description of what should be required to ensure legal review is adequate, appropriately credentialed and structured properly.    MIP4c3-SP4: MIP65 Amendments   Legal Structure and Governance Appropriateness Verification At least one community member, with legal credentials, must, through a public forum post, validated by at least one Facilitator, provide a verification of the legal and governance structure appropriateness for holding a large amount of low-risk real-world asset collateral for Maker.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.204616461969404
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "0",
                    "time": "02/09/2022-08:52:38",
                    "content": "    ACREinvest:  So this proposed language does not work for me for being vague and loose.   The MIP65 was too narrow leading to a block, so the new wording is designed to avoid another similar unfortunate situation (changing MIP65 now would cost 2-3 months!). When this MIP4 was written (2 weeks ago), the situation was also less clear. Any community member with legal credential can post, but you also need a facilitators to validate. Facilitator have some trust from MKR holders. That seemed a good tradeoff. I can confirm that @christiancdpetersen is working on MIP65. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.7838869463869464
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#6",
                    "likes": "2",
                    "time": "03/09/2022-18:46:28",
                    "content": "As the “Yes” option has attracted support from a majority of non-abstain voters this subproposal will move to an on-chain vote on 2022-09-05T16:00:00Z. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "04/10/2022-04:47:20",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}