{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-v3-collateral-categories-lod-summary/17616",
            "title": "Endgame V3 - Collateral Categories - LOD Summary ",
            "index": 17616,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "endgame",
                "endgame-v3",
                "lod-summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "2",
                    "time": "02/09/2022-13:41:56",
                    "content": " Summaries reflect my own work and have not been reviewed by Rune. Any mistakes are mine. They are based on the written posts in this forum from Rune. I do not regularly attend Endgame meetings.  Levels of Detail This summary is organized into sections summarizing the same information in different levels of detail.  LOD0 represents the most-simplified and abstracted version of this concept LOD1 is more complex and more accurate. LOD2 is a direct summary of Rune’s post. Runes post could be considered LOD3, with the highest level of detail and explanation.  Lower numbers = Easier to grasp and understand. Higher numbers = More complex but more accurate.    Endgame V3 - Collateral Categories - LOD Summary  Level of Detail - 0  image1130×365 45.3 KB     LOD1  Level of Detail - 1 Collateral categories in Endgame are first divided between Decentralized and Real World Asset Collateral.  Decentralized  Decentralized - ETH  ETH, Liquid Staking Tokens, EtherDAI, ETH/DAI LP Tokens.   Decentralized - Misc  UNI, LINK, and LP tokens based on such assets Only rarely scalable to be worth it directly to MakerCore.   Decentralized - MKR  Endgame Plan significantly changes how the MKR asset is used and its economic characteristics.  Liquidity backstop becomes optional. Passing a loss to Dai holders through Target Price change becomes explicitly possible.   Without backstop MKR is good collateral that…  … generates stability fees for the protocol … also participate in governance … also farm MetaDAO tokens     Decentralized - MDAO  MetaDAO tokens Dai exposure that Dai has to each MetaDAO must be heavily restricted.     Real World Asset   RWA - Cashlike  Centralized Stablecoins, Short Term Government Bonds Initially, Dai needs a reliable exchange rate and deep liquidity to other stablecoins and cashlike assets. Easily seizable - exposure must be limited in the long term.    RWA - Clean Money  Renewable energy projects, sustainable agriculture assets. Clean Money brand aids global adoption. Easily seizable. Positive meta from clean money may benefit resiliency.    RWA - Misc  WBTC, cross-chain bridge tokens from L1’s, Security Token Vaults On-chain assets that are centralized and don’t fit into another category. Easily seizable - but may look less like RWAs, beware!    RWA - Physically Resilient  Theoretical Concept Real world assets that cannot easily be seized, and that a DAO like Maker can retain some level of technical sovereignty over. Hypothetically - renewable powered drone ships that operate in international waters and controlled via blockchain.        LOD2  Level of Detail - 2  Target a portfolio that fulfils the vision of unbiased world currency. Requires decentralized assets for resilience. Requires real world assets for liquidity and stability, and providing tangible positive impact to the world.   Decentralized Collateral  ETH  ETH, Liquid Staking Tokens, EtherDAI, ETH/DAI LP Tokens. Incentivise ETH collateral through MetaDAO farming. Protocol Owned Vault to accumulate ETHD.   Misc Decentralized  UNI, LINK, and LP tokens based on such assets Only rarely scalable to be worth it directly to Maker Core.   MKR  Endgame Plan significantly changes how the MKR asset is used and its economic characteristics. The liquidity backstop is no longer enforced, and instead becomes optional subject to a governance decision. The possibility of passing on a loss to Dai holders through a haircut to the Target Price becomes explicitly possible (it is already technically possible for Maker Governance to do this today, but not supposed to happen based on expectations and current meta).  Why?  The backstop mechanism of MKR isn’t very useful in the first place.  The moment when you actually need it MKR will typically be near worthless anyway, resulting in no effective protection.   Once the role of automatic backstop is removed, MKR becomes a very useful form of decentralized collateral for Dai through overcollateralized vaults. That can…  … generate stability fees for the protocol … also participate in governance … also farm MetaDAO tokens   This allows MKR to play an important role in reducing exposure to seizable RWA.   MDAO  MetaDAO Tokens However, MetaDAOs do have the role of providing a forced backstop to risk generated within the MetaDAOs. As a result the amount of exposure that Dai has to the tokens of each MetaDAO must be heavily restricted.   Real World Asset Collateral  Cashlike RWA  Centralized Stablecoins, Short Term Government Bonds To maximize its usefulness as a currency, especially when growing, Dai needs to have a reliable exchange rate and deep liquidity to other stablecoins and cashlike assets. Achieved through Cashlike collateral, which is a portfolio of on-chain and off-chain stablecoins and low risk, short term bonds. Actively monitored and managed by the Stability & ALM Tribunal (described later). Downside with Cashlike RWA is that it is easily seizable. Total exposure must be limited in the long term.   Clean Money RWA  Renewable energy projects, sustainable agriculture assets. To achieve global adoption a brand that is mainstream relevant is required  Clean Money collateral makes this possible through the positive meta it generates and the Clean Money brand.   Downside is Clean Money RWA assets are easily seizable.  One major advantage on this front is that the positive meta and branding they generate could help create popular resistance and impose a political cost on…  … attempts to seize the assets … attempts to attack Maker in other ways.       Misc RWA  WBTC, cross-chain bridge tokens from L1’s, Security Token Vaults Miscellanous RWAs are on-chain assets that are centralized and don’t fit into another category. Seizable, but can have the disadvantage that they don’t immediately appear to be RWAs and as a result Maker might fail to take proper precaution of the seizure risk.   Physically Resilient RWA  We assume that at a point in the future there will be a severe crackdown on use of RWA in crypto, and anything that can be seized by global powers will be at serious risk of seizure through legal means. Physically Resilient RWA are real world assets that cannot easily be seized, and that a DAO like Maker can retain some level of technical sovereignty over. Challenging concept to design and create, and it will take years or decades before it is realizable. A hypothetical example of what future Physically Resilient RWA could look like are renewable powered drone ships that can be disabled and re-enabled through on-chain governance and operate long term in international waters.   ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/15"
                    ],
                    "GPT-summary": "The post explains the collateral categories for Endgame V3 in different levels of detail. It discusses the different types of decentralized and real-world asset collateral, their advantages, and disadvantages. The post also talks about the role of MKR and MetaDAO tokens in reducing exposure to seizable RWA. The author provides a hypothetical example of physically resilient RWA. The post does not advertise the proposal, but it explains it in detail and provides constructive criticism.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.617182354682355
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#2",
                    "likes": "1",
                    "time": "03/09/2022-17:47:01",
                    "content": "    LongForWisdom:  We assume that at a point in the future there will be a severe crackdown on use of RWA in crypto, and anything that can be seized by global powers will be at serious risk of seizure through legal means.   We can also assume that MAKER adopts a large number of services, professionals, loans and capitalization, later the central institutions will come to want a piece of the cake, something like BlackRock with Coinbase and Circle, they will not continue to regulate something that can potentially give them money, so Anyway, getting non-reprehensible RWA will be much more difficult in a developed country than in a developing country like LATAM or East Asia, so you can also look at those areas ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.082251082251083
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#3",
                    "likes": "2",
                    "time": "07/09/2022-01:09:33",
                    "content": "    LongForWisdom:  Physically Resilient RWA are real world assets that cannot easily be seized, and that a DAO like Maker can retain some level of technical sovereignty over.   Indeed here’s the real challenge. Getting creative is a must. As @Moi said, regulations in third world countries will be late as usual, really late actually. RWAs in this regions may become a thing to pay attention to. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.21969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "07/12/2022-07:10:06",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-v3-scopes-lod-summary/17686",
            "title": "Endgame V3 - Scopes - LOD Summary ",
            "index": 17686,
            "category": [
                "Governance"
            ],
            "tags": [
                "endgame",
                "endgame-v3",
                "lod-summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "6",
                    "time": "06/09/2022-15:36:04",
                    "content": " Summaries reflect my own work and have not been reviewed by Rune. Any mistakes are mine. They are based on the written posts in this forum from Rune. I do not regularly attend Endgame meetings.  Levels of Detail This summary is organized into sections summarizing the same information in different levels of detail.  LOD0 represents the most-simplified and abstracted version of this concept LOD1 is more complex and more accurate. LOD2 is a direct summary of Rune’s post. Runes post could be considered LOD3, with the highest level of detail and explanation.  Lower numbers = Easier to grasp and understand. Higher numbers = More complex but more accurate.    Endgame V3 - Scopes  Level of Detail - 0  Areas that Maker Governance take decisions about and that the Decentralized Workforce work on. No decision-making or work happens outside a scope. Each scope is governed by a Scope Framework MIP. Each scope is curated by members of GovernorDAOs. Both Primary and Supporting scopes defined.   image838×725 69.3 KB     LOD1  Level of Detail - 1  Areas that Maker Governance take decisions about and that the Decentralized Workforce work on. All decisions and work happen in the context of scopes. No decision-making or work happens outside a scope. Each scope is governed by a Scope Framework MIP.  Adjusted continuously by MakerCore Governance using expert and stakeholder input.   Each scope is curated by a Council or Tribunal run by GovernorDAOs.  Councils  Made up of Contribution team leads from GovernorDAOs with active Core Units in that scope.  Tribunals  Made up of the Contribution team leads from each GovernorDAO. Governance Tribunal is made up of Administration team leads from each GovernorDAO.  Primary Scopes  Direct business focused scopes. High Budgets Multiple Redundant Core Units from different GovernorDAOs. Controlled by a Council.  Supporting Scopes  “backend” functions of the DAO Lower budgets Each controlled by a singular tribunals that all GovernorDAOs participate in.  Short Detour into the Unified Coordination Toolkit (UCT)  The UCT is an open source software system that provides a…  transparency and governance reporting platform collaboration platform   Decentralized Workforce must only use fully transparent and decentralized processes for operations and decision making. Used by Maker Governance and MKR holders to oversee and understand what the Decentralized workforce is doing. Each scope has its own UCT module designed by its Council or Tribunal.  The UCT module is how the Scope Framework is turned into processes that the Core Units and Tribunals can then follow.     Primary Scopes Decentralized Collateral  Management of risk and collateral parameter adjustment for decentralized collateral types. Prioritization and funding of onboarding work of new decentralized collateral types. Incentivises bottom-up collateral onboarding using revenue share bounties.  RWA Collateral  Management of risk and collateral parameter adjustment for RWA collateral types. Coordinates onboarding of new PSMs.  Protocol Engineering  Priotitization and funding of research, development and deployment of Endgame Plan. Priotitization and funding of major feature upgrades. Deployment of new major building blocks across mainnet and L2s. Incentivises bottom-up protocol expansion using revenue share bounties. Funds continuous audits and security research and bug-bounty programs.  Growth  Development of the the Maker and Dai brand Funds various growth and marketing initiatives. Maintains the official MakerDAO website design, and design and branding guidelines for MetaDAO frontends.   Supporting Finance  Builds financial reporting processes and systems for the UCT Provides updates on overall state of the protocols financials.  Stability and Liquidity  Maintains the framework for cashlike RWA, balancing yield generation and liquidity for DAI. Monitor and research upgrades to the Target Rate algorithm. Advising on management of the protocol owned vault.  Legal Research  Focuses on legal and regulatory impacts on Maker Core and the Decentralized Workforce. Defines best practice around avoiding legal risk. Monitors the activity of the Decentralized Workforce to identify legal risks and proposes mitigations. Monitors the possibility of external physical threats to RWA collateral and proposes mitigations.  Infrastucture  Defines the security requirements of critical Maker protocol infrastructure. Chooses and funds MetaDAOs that provide Oracle Guarantee services. Funds bug bounty and other security focused programs.  Interface  Regulates and develops the core elements of the Decentralized Frontend.  Ecosystem  Operates the governance processes of Maker Core, including MIPs and MIP-derived processes. Operates the governance and community communication platforms, and provides easy to access information about the governance process. Monitors MetaDAOs and proposes reactive measures if malpractice is discovered. Maintains a framework for MetaDAO penalties. Enforces prior governance agreements and resolves disputes.  Governance  Provides final arbitration on metagovernance disputes. Manages requirements for DVC inclusion and ranking on frontends. Operates the processes to recognize MakerCore governance entities.      LOD2  Level of Detail - 2  11 focus areas of Maker Governance that encompass the entire universe of complexity of valid Maker Governance decisions. Chief objective is to create a rigid structure that prevents scope creep or drift over time.  Also ensure that no critical functions are neglected and remain easily accessible to governance.   Each Scope is governed by a MIP called a Scope Framework.  Continuously edited through a ratification process where Maker Governance votes on new versions based on input from all relevant experts and stakeholders Curated by the Councils and Tribunals, run by the Governors.   Two categories: Primary and Supporting. Primary are direct business focused scopes that cover the most critical day to day operations of the protocol.  They have high budgets, and multiple redundant Core Units provided by different Governors. Strong balance of power where Councils are the ones tasked with researching and updating the Scope Frameworks, while the Core Units have to operate by interpreting and following the Scope Frameworks.   Supporting are “backend” functions of the DAO that are necessary for the ecosystem to thrive and function properly in the long run.  Lower budgets, and are controlled by singular Tribunals that all Governors participate in.     Unified Coordination Toolkit (UCT)  Critical that the Decentralized Workforce of Maker Core only use fully transparent and decentralized processes for all operations and decision making. The primary method used to enable this is the UCT. A single open source software system that simultaneously works as a transparency and governance reporting tool, while also functioning as a collaboration tool. Best comparable to github but for operations, and is both used by contributors to directly collaborate on work using streamlined and standardized transparent processes. Also used by Maker Governance and MKR holders to oversee and understand the progress, results and risks of the tasks being undertaken by the Decentralized Workforce, and the information that they are sharing. Also synergizes well with the Decentralized Frontend as it can be bundled as a standard feature alongside other governance related components. The Council or Tribunal of each Scope is responsible for designing the UCT module for their respective Scope.  The UCT module is how the Scope Framework is practically turned into processes that the Core Units and Tribunals can then follow.     Primary  Decentralized Collateral  Top down parameter adjustment  Process used to change risk parameters such as stability fees and debt ceiling of decentralized collateral vault types. Done at regular intervals, and in special cases done reactively. The research, data collection, processing and recommendations provided are done according to the Decentralized Collateral Scope Framework. Covers standard vaults directly used by end users Covers Vault Adoption and/or D3M connections to Creator MetaDAOs.   Top down collateral onboarding  Cases where Core Unit Facilitators follow the Scope Framework to prioritize new collateral types based on research and data collection, and then use budget to fund the onboarding work of new collateral types.   Bottom up collateral onboarding  Based on a Revenue Share Bounty Plan that is specified in the Decentralized Collateral Scope Framework. Incentivizes MetaDAOs and Ecosystem Actors to take the initiative on developing and deploying new collateral onboarding code, and then bring it to Maker Governance for approval. If approved, the proposer will then earn a revenue share from the net stability fees generated from the collateral type according to the Revenue Share Bounty Plan. Review process and how to determine whether to reject or approve a bottom up collateral onboarding is specificed in the Decentralized Collateral Scope Framework.   RWA Collateral  Top down parameter adjustment  Covers the process of managing risk related to Real World Asset collateral exposure. The RWA Collateral Scope Framework specifies the process used to analyze and modify Vault Adoption or D3M parameters to Protectors, and parameter adjustments of PSMs.  Takes into account several sub frameworks that covers financial risk, physical threat risk and sustainability.     Top down collateral onboarding  The top down collateral onboarding process for RWAs covers specifically the onboarding of new PSMs. This works identically to the top down collateral onboarding process for decentralized collateral, and taps into the same supply chain.   Protocol Engineering  Top down product development and upgrades  Prioritizes and funds the research, development and deployment of the Endgame Plan Product Roadmap. Prioritizes and funds ongoing major feature upgrades  Security upgrades Gas efficiency refactoring Governance submodules such as IAMs.   Protocol feature scope is responsible for preventing scope creep and complexity growth beyond the boundaries of the Endgame Plan. Can expand scope only in rare cases where item fits with Endgame Plan.   Top down protocol expansion  Main long-term focus of the Protocol Features scope is the deployment of new major building blocks across mainnet and L2s. Includes Sharded Vault Engines/Singularity Engines, new Maker Teleport building blocks, and new Synthetic Assets. Responsible for expanding certain backend features such Multichain Elixir and Meta Elixir (explained later).   Bottom up protocol expansion  Based on a Revenue Share Bounty Plan that is specified in the Protocol Features Scope Framework. Incentivizes MetaDAOs and Ecosystem Actors to take the initiative on developing and deploying new  Sharded Vault Engine, Maker Teleport, Synthetic Assets code   If approved, proposer earns revenue share from the net stability fees generated from the collateral type. The review process and how to determine whether to reject or approve a bottom up protocol expansion is also specified in the Protocol Features Scope Framework.   Protocol Security  Responsible for funding continuous audits and security research into the deployed Maker Protocol. Responsible for funding and operating smart contract bug bounty programs.   Growth  Focuses on developing the Maker and Dai brand, and allocate budget to fund various growth and marketing initiatives. Responsible for maintaining the official MakerDAO website design, and design and branding guidelines for MetaDAO frontends.   Supporting  Finance  The Finance scope builds the financial reporting processes and systems for the UCT, and provide regular comprehensive updates and overviews of the overall state of the protocols financial situation.   Stability and Liquidity  Cashlike RWA portfolio management  Responsible for updating and implementing a framework for the Cashlike RWA portfolio of assets.  Ensure that it balances optimal yield generation with enough liquidity to keep Dai fully useable as a currency.     Target Rate management  After Dai becomes free floating the Stability and Liquidity scope must monitor and research upgrades to the Target Rate algorithm.  In the long run when no external value reference can be relied upon, the scope expands significantly and also engages in aggregating CPI data in order to measure and target inflation rates of Dai.     Protocol Owned Vault management  Responsible for providing advice related to the management of the Protocol Owned Vault.  Using it for optimal benefit for maintaining Dai stability and market confidence. Risk management related research is done by relying on the supply chain of Decentralized Collateral.     Legal Research  Focuses on the broad legal and regulatory impacts on Maker Core and the Decentralized Workforce in the broader ecosystem.   Legal risk monitoring  Defines best practice around avoiding legal risk in the Legal Research Scope Framework.  Continuously monitors the activity of the Decentralized Workforce, the MetaDAOs and the Ecosystem Actors to detect risk. In case activity is detected that could result in e.g. a regulatory backlash or legal liability, it may propose reactive measures to Maker Governance.     External physical threat monitoring  Continuously researches and monitors the possibility of a severe external physical threat that could create considerable risk for Maker’s RWA collateral.  Regulatory crackdown Legislative changes.   In the worst case scenario, the Legal Research Tribunal must advice Maker to activate Phoenix Stance as a reactive measure.   Infrastucture  Details the overall security requirements of the most critical infrastructure of the Maker Protocol.  Keepers Oracles Other Node Network related infrastructure.   Responsible for choosing and funding MetaDAOs that provide Oracle Guarantee services. Responsible for funding bug bounty and similar security focused programs.   Interface  Focuses on the regulation and development of the core elements of the Decentralized Frontend. Includes ensuring that a fully functional and secure decentralized frontend codebase is available that covers:  DSR Vaults MetaDAO farms Governance Auctions Chat Forum Unified Coordination Toolkit     Ecosystem  Governance process  Operates the governance processes of Maker Core, including MIPs and MIP-derived processes   Governance communications  Operates the governance and community communication platforms, and provides easy to access information about the governance process.   MetaDAO monitoring  Monitors the general business practices of the MetaDAOs and proposes reactive measures of a breach of best practices or other malpractice is discovered. Maintains a framework for MetaDAO penalties as a part of the Ecosystem Scope Framework.   MetaDAO agreement enforcement  Interprets and proposes actions to Maker Governance that follow governance agreements or settle disputes between MetaDAOs or Ecosystem Actors.  EG: responsible for paying out the Maker Vault Stability Fee Frontend Revenue Share to MetaDAOs that have complied with best practice in their Decentralized Frontends, including determining who is eligible.   Responsible for enforcing the revenue share agreements of Plut and Play Protocol features adopted by MetaDAOs.   Governance  Final arbitration  Responsible for providing final arbitration on metagovernance disputes. Includes…  … decisions by the Ecosystem Tribunal that have been escalated. … disputes or risks related to Delegate compensation or Decentralized Voter Committee Compensation.   Tries to cover as many edge cases in advance as possible, however in practice disputes that are escalated to the Governance Tribunal are likely to not have any precedents.   Governance frontend regulation  Determines the requirements for Decentralized Voter Committee inclusion and ranking in the Governance frontends.   Recognized Delegate and Recognized Budget Allocator program  Operates the process with which Delegates and Budget Allocators can achieved Recognized status and become eligible for compensation.    ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/15",
                        "https://forum.makerdao.com/t/endgame-index-list/16021"
                    ],
                    "GPT-summary": "The post explains the Endgame V3 - Scopes - LOD Summary, which is organized into different levels of detail. It describes the 11 focus areas of Maker Governance, which are divided into two categories: Primary and Supporting. The post also explains the Unified Coordination Toolkit (UCT), which is an open-source software system that provides transparency and governance reporting and collaboration platforms. The post also explains the different processes and frameworks for each scope, including Decentralized Collateral, RWA Collateral, Protocol Engineering, Growth, Finance, Stability and Liquidity, Legal Research, Infrastructure, Interface, Ecosystem, and Governance.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.714485521637584
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/12/2022-21:36:53",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-v3-pregame-products-lod-summary/17687",
            "title": "Endgame V3 - Pregame Products - LOD Summary ",
            "index": 17687,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "endgame",
                "endgame-v3",
                "lod-summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "2",
                    "time": "06/09/2022-15:40:16",
                    "content": " Summaries reflect my own work and have not been reviewed by Rune. Any mistakes are mine. They are based on the written posts in this forum from Rune. I do not regularly attend Endgame meetings.  Levels of Detail This summary is organized into sections summarizing the same information in different levels of detail.  LOD0 represents the most-simplified and abstracted version of this concept LOD1 is more complex and more accurate. LOD2 is a direct summary of Rune’s post. Runes post could be considered LOD3, with the highest level of detail and explanation.  Lower numbers = Easier to grasp and understand. Higher numbers = More complex but more accurate.    Endgame V3 - Pregame Products  Level of Detail - 0  Pregame Products are work items that must be completed before the launch of Endgame.   image1032×864 93 KB     LOD1  Level of Detail - 1  Pregame Products are work items that must be completed before the launch of Endgame.   Endgame Plan Approval MIP Set  Determines commitment to the Endgame Plan - if passed, a version of the Endgame Plan and MetaDAOs will be launched. Designates the initial MetaDAO clusters and gives them various privileges.  Collateral Onboarding Changes  Creator Clusters take over the responsibility of decentralized collateral onboarding. Protector clusters take over the responsibility of RWA collateral onboarding. Replaces the existing collateral onboarding process. Rejects all active collateral applications and no more are taken. Risk Core Unit will also have the authority to prioritize and onboard major, scalable collateral types.  Protocol Owned Vault Activation  Authorizes the immediate start to a manually executed Staked ETH accumulation strategy. 80 million Dai will be spent from the Surplus Buffer to acquire Staked ETH into the Pause Proxy  Lower limit of surplus buffer will be set to -40 million.   Accumulation over time using dollar cost averaging.   EtherDai I  Central user facing product of Endgame Plan and first priority of the Endgame Plan. Initial implementation of EtherDai uses a “shortcut” approach that can be upgraded in the future. Valuable and useful product that can easily generate network effects. EtherDai must also be onboarded as Maker Vaults. Liquidity of EtherDai will be boosted with captive liquidity.  Short term yield farming of ETHD/DAI on uniswap replaced later by Elixir acculumation.     Elixir I  Long term liquidity solution for Dai, ETHD and MKR. Elixir I is a simple Balancer pool that consists of 1/3rd Dai, 1/3rd ETHD and 1/3rd MKR.   MetaDAO tokens  Simple ERC20 tokens that are controlled by the Maker Pause Proxy. Initial supply is 4.6 billion. Used for:  MetaDAO farms MetaDAO Workforce Bonus Pools MetaDAO Treasury Funding Accounts   2 billion MetaDAO tokens distributed over 10 years. Farmed by…  Dai holders ETHD Vault users MKR governance participants   Schedule:  1 billion the first 2 years 500 million the following 2 years 250 million the following 2 years Remaining 250 million the last 4 years.   400 million MetaDAO tokens are sent to the MetaDAO Workforce Bonus Pools 200 million MetaDAO tokens are sent to the MetaDAO Treasury Funding Account and sold for Dai over a period of 2 years.   MetaDAO farms Dai farms  Simple ERC20 farms that distribute MetaDAO tokens. 100 million of each MetaDAO token is distributed through the Dai farms in first year.  ETHD Vault Debt farms  Specific type of ETHD Vault that can be deposited into the farm. Rewards based on the amount of Dai debt in the vault. 200 million of each MetaDAO token is distributed through the ETHD Vault Debt farms in first year.  Delegated MKR farms  Actively delegated MKR can go into the farm.   MetaDAO frontend  Frontend that exposes the MetaDAO farms. Only the MetaDAO farms need to be available for endgame launch.   Meta Elixir I  Core liquidity pool for MetaDAO tokens against MKR. Source of long-term cross-market and cross-chain MetaDAO token liquidity. Simple Uniswap pool token of MetaDAO tokens paired against MKR. Permanent emissions of MKR are used to accumulate Meta Elixir.   Metanomics I  Core tokenomics system of the Endgame Plan. 45000 of annual emissions are used to accumulate Meta Elixir of each MetaDAO. Following launch of a non-launch MetaDAO, Meta Elixir accumulation is adjusted (explained in Metanomics II) Remaining 5000 MKR is split between:  The Incubator, where it is converted to Elixir. The Maker Workforce Bonus Pool where it is used to pay for long term bonuses for governance entities and the MakerCore decentralized workforce.     Anti Reflexivity Mechanic  System that prevents volatile price action when new MetaDAO tokens are launched. Limit order staircase that sells a fixed amount of MKR or MetaDAO tokens for Dai at fixed prices. Dai is then converted to Elixir and accumulated. At the Endgame Plan Launch, all MKR remaining in the protocols treasury is used to buy DAI using this mechanism. When a new MetaDAO is launched, 2 billion tokens are used to buy Dai through this mechanism.   Simple offchain voting  MetaDAO token holders need to vote in non binding polls that Maker Governance can then interpret and execute. Snapshot or gasless voting using Maker voting frontend.   Endgame Plan Launch MIP Set  Implements Endgame launch. Defines fundamental rules of governance that will be binding on all future MIPs. Includes specifications that maximally define Endgame. No technical component. Will enshrine values such as Clean Money. Will define the permanent and immutable tokenomics schedules for MKR and MetaDAO tokens. Will define which aspects of governance processes are immutable and should change minimally. Will define fundamental expectations of different governance participants, including voters and the decentralized workforce. Will define neutrality requirements for different Decentralized Workforce participants Will contain a MIP specifying each Endgame Plan product.      LOD2  Level of Detail - 2  Endgame Plan Approval MIP  First step towards implementating the Endgame Plan. Determines commitment to the Endgame Plan  If passed, a version of the Endgame Plan and MetaDAOs will be launched.     Recognized Launch MetaDAO Clusters  Designates Launch Clusters that are attached to existing core units Gives them various privileges.  Privileges are controlled by the Facilitator of the Core Unit that the clusters are attached to. Must be controlled according to the views of the cluster as interpreted by the Facilitator.     Creator and Protector cluster collateral onboarding authority  Creator Clusters take over the responsibility of decentralized collateral onboarding. Protector clusters take over the responsibility of RWA collateral onboarding responsibilities Each receives a preliminary Vault Adoption Debt Ceiling of 250 million Dai.  Vaults are still considered Maker Core Vaults. All stability fees will continue to go to Maker Core. After the Endgame Plan Launch the vaults will then have to be formally adopted.     Collateral onboarding process replacement and collateral application rejection  Replaces the existing collateral onboarding process. Rejects all active collateral applications. Collateral onboarding must go through the collateral onboarding privileges of the Recognized MetaDAO Clusters. Top down process only. No formal application process available at the Maker level. A bottom up collateral onboarding process will only exist if the clusters choose to define and manage one.   Continued Maker Core collateral onboarding of ETH, Stablecoins and D3Ms  Risk Core Unit will also have the authority to prioritize and onboard major, scalable collateral types including:  ETH, or ETH related assets such as Staked ETH or ETH/DAI LP tokens Stablecoin PSMs Stablecoin related collateral such as USDC/DAI LP tokens D3Ms     Preliminary Protocol Owned Vault activation  Immediately activates the Protocol Owned Vault through a Protocol Owned Vault Emulation.  Authorizes the immediate start to a manually executed Staked ETH accumulation strategy.   Executed by allowing the Surplus Buffer to go negative, and the ability of the Pause Proxy to hold governance controlled assets. 40 million Dai from the Surplus Buffer will be used, and will immediately begin acquiring Staked ETH at 2x leverage with a paced dollar cost averaging process. 80 million Dai will be spent from the Surplus Buffer to acquire Staked ETH into the Pause Proxy Lower limit of surplus buffer will be set to -40 million. Additional surplus will be manually used to acquire more Staked ETH. Allows us to spread accumulation over time.  Prevents too much slippage and frontrunning. Begin the dollar cost average accumulation as soon as possible following the Merge.     EtherDai I  Central user facing product of Endgame Plan.  All other mechanisms and incentives aim to drive users towards EtherDai Vaults.   ETHD I is the Pregame implementation of EtherDai.  Uses a “shortcut” approach Goal is to have a staked ETH token under the control of Maker governance that can be upgraded in the future.   Simple ERC20 token wrapper around Lido’s Staked ETH. Free wrapping + unwrapping. Maker Governance has backdoor access to the ETHD collateral Governance can set permissions for minting and burning of ETHD. ETHD will be a very valuable and useful product that can easily generate network effects.  Piggybacks on Lidos best in class security, liquidity and efficiency.   EtherDai must also be onboarded as Maker Vaults.  Possibly with different options for risk parameters Or just with the same risk parameters as Steth.   Liquidity of EtherDai will need to be boosted with captive liquidity.  Initially done using short term yield farming of ETHD/DAI on uniswap (Explained later). Will be replaced by long term liquidity provided through Elixir accumulation (Explained later).   Only pregame products that can be launched before everything else. Development and release is the first priority of the entire Endgame Plan.   Elixir I  Universal long term liquidity solution for Dai, ETHD and MKR in the Endgame Plan. Eventually, it is used to automatically provide sustainable, captive liquidity on all key decentralized marketplaces across mainnet and all L2s. Elixir I is a simple Balancer pool that consists of 1/3rd Dai, 1/3rd ETHD and 1/3rd MKR. During the Early Game Elixir I is accumulated by MetaDAOs by selling their MetaDAO tokens using the Anti-Reflexivity Mechanic (Explained later).   MetaDAO tokens  Simple ERC20 tokens that are controlled by the Maker Pause Proxy. Initial supply is 4.6 billion. The tokens are emitted alongside the deployment of the ERC20 token smart contracts, and sent to a Maker Governance account. From there to:  MetaDAO farms MetaDAO Workforce Bonus Pools MetaDAO Treasury Funding Accounts   Initial launch MetaDAO tokens are manually created. Later, new MetaDAOs are created automatically by the Incubator (Explained in Midgame Products).   MetaDAO farms  2 billion MetaDAO tokens are sent to the MetaDAO farms over a period of 10 years. Farmed by…  Dai holders ETHD Vault users MKR governance participants   Schedule:  1 billion the first 2 years 500 million the following 2 years 250 million the following 2 years Remaining 250 million the last 4 years.     MetaDAO Workforce Bonus Pools  400 million MetaDAO tokens are sent to the MetaDAO Workforce Bonus Pools  Controlled by MetaDAO token governance to provide attractive bonus incentives for the bootstrapping clusters.   Long term MetaDAOs receive only 300 million MetaDAO tokens into the MetaDAO Workforce Bonus Pool   MetaDAO Treasury Funding Account  200 million MetaDAO tokens are sent to the MetaDAO Treasury Funding Account. Automatically sold for Dai (by first selling to MKR via Meta Elixir, and then to Dai via Elixir) over a period of 2 years.   MetaDAO farms  3 types of farms for each of the Launch MetaDAOs must be deployed during the pregame phase, before the Endgame Plan Launch.   Dai farms  Simple ERC20 farms that distribute MetaDAO tokens. 100 million MetaDAO tokens of each MetaDAO is distributed through the Dai farms in first year.   ETHD Vault Debt farms  More advanced than regular farms. Require the user to first open a specific type of ETHD Vault with the Maker Protocol and then deposit the Vault into the farm. Then farm the MetaDAO tokens based on the amount of Dai debt in their vault. 200 million MetaDAO tokens of each MetaDAO is distributed through the ETHD Vault Debt farms in first year.   Delegated MKR farms  Require the user to transfer MKR that is actively delegated into the farm. MKR that is not actively delegating to a delegate (of any type, which can include their own delegate contract), cannot be used to farm with.   MetaDAO frontend   Frontend that exposes the MetaDAO farms. Can be developed further by the MetaDAOs to expose more features such as:  Dai Savings Rate Dai MetaDAO farming Maker Vaults Maker Governance interface    Only the MetaDAO farms need to be available for endgame launch.   Likely that some of the additional features will be developed and ready to launch alongside the Endgame Plan Launch.    Meta Elixir I  Core liquidity pool for MetaDAO tokens against MKR. Goal is to be able to use Meta Elixir as the main source of cross-market and cross-chain MetaDAO token liquidity. Establishes MKR as the main trading currency for MetaDAO tokens across all markets. Meta Elixir I is implemented through a simple Uniswap pool token of MetaDAO tokens paired against MKR. Permanent emissions of MKR is used to accumulate Meta Elixir. During the Endgame Plan Launch, Maker will emit 7500 MKR per year per MetaDAO to accumulate Meta Elixir.   Metanomics I  Core tokenomics system of the Endgame Plan. Emit 50000 MKR per year and distribute towards  Meta Elixir Acquisition MetaDAO Incubation Maker Workforce Bonus Pool.     Meta Elixir Acquisition  45000 of annual emissions are used to accumulate Meta Elixir of each MetaDAO. Following launch of a non-launch MetaDAO, Meta Elixir accumulation is adjusted based on the amount of Elixir each MetaDAO has accumulated in their burn engines. (Further explained in Metanomics II)   MetaDAO Incubation and Maker Workforce Bonus Pool split  Remaining 5000 MKR is split between:  The Incubator, where it is converted to Elixir. The Maker Workforce Bonus Pool where it is used to pay for long term bonuses for  Delegates Council Members Facilitators Tribunal Members.     Maker Governance determines the ratio of the split  Amount of MKR to the Workforce Bonus Pool cannot exceed 2000 MKR per year.     Anti Reflexivity Mechanic  System used by Maker at the Endgame Plan Launch, and by all new MetaDAOs launch and post-launch. Limit order staircase that sells a fixed amount of MKR or MetaDAO tokens for Dai at fixed prices. Earned Dai is then converted to Elixir and accumulated in the Burn Engines of Maker or the MetaDAOs. Prevents overly volatile price action caused by the Metanomics when new MetaDAOs are launched and circulating supply is very low.   MKR Anti Reflexivity Mechanic at Endgame Plan Launch  At the Endgame Plan Launch, all MKR that remains in the MKR reserve that is not sent to the Workforce Bonus Pool is used to set up an Anti Reflexivity Mechanic with limit orders on an external DEX.  The lowest step is set at the MKR price near the market price at the Endgame Plan Launch. Upper steps are determined by Maker Governance in advance.     Anti Reflexivity Mechanic at MetaDAO Genesis  When a new MetaDAO is launched, 4.5 billion MetaDAO tokens are immediately emitted.  2 billion of those tokens are used to fund an Anti Reflexivity Mechanic with limit orders on an external DEX. The limit order staircase has 100 limit orders of 20 million MDAO each with the lowest limit order starting at 0.01 DAI per MDAO. Each additional limit order placed at 0.001 higher increments, until the final limit order at 0.109 DAI per MDAO.     Simple offchain voting  One of the only technical requirements necessary for MetaDAO governance to function.  MetaDAO token holders need to vote in non binding polls that Maker Governance can then interpret and execute. The simplest form of this system, which would be enough to meet the requirement for Endgame Plan Launch would be to directly use snapshot polls with no additional configuration or development needed.   Possible that an adaptation of the Maker rollup based voting system could be available in time.  Would provide a more secure gasless voting solution that also supports delegation (an Early Game Feature)     Endgame Plan Launch MIP Set  When all other pieces are ready, the Endgame Plan Launch is the Endgame Plan Launch MIP Set implements the Endgame Launch. Play fundamental governance roles similar to MIP0 and MIP1 by defining fundamental rules of governance that will be binding on all future MIPs. Many specific decisions and specifications that help maximally define the Endgame Plan Launch  Promote ossification Minimize confusion and uncertainty Minimize ability to switch directions or make fundamental changes to governance.   Implemented entirely through MIPs, meaning it is purely governance proposal text and has no technical component to it, and requires no technical resources.   Purpose and Values  Will contain MIPs that establish a social contract in the community enshrining values such as Clean Money. The MIPs will also spell out the intangible value that the community expects to gain from following the purpose and values.   Immutable Metanomics  Will contain a MIP that defines the permanent and completely immutable tokenomics schedules for the Metanomics that applies to both MKR and MetaDAO tokens. Token emission and distribution schedules should be impossible to change after the fact.  In order to provide certainty and prevent power struggles related to control of token emissions.     Constitution  Will define which aspects of governance processes are immutable and should change minimally. Will define fundamental expectations of different governance participants, including voters and the decentralized workforce. Will define neutrality requirements for different Decentralized Workforce participants  Also explain the reasoning and the risks involved if neutrality isn’t upheld     Endgame Plan Product Roadmap specification MIPs  Will contain a MIP for each Endgame Plan product  Provides as much clarity as possible around their implementation and requirements.   Creator Quest payouts will directly rely on these product specification MIPs.    ",
                    "links": [
                        "https://forum.makerdao.com/t/endgame-asset-liabilities-management-alm-technical-design/19182",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/15"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.451238275613276
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#2",
                    "likes": "3",
                    "time": "07/09/2022-13:08:41",
                    "content": "    LongForWisdom:     Even though these are the pre-game products Rune has communicated, after reading the plan, I see a few other implementation efforts that need to be executed:  A module to split the Stability Fees from adopted vaults, so a certain percentage is funneled to the metaDAO’s surplus buffer and the rest to MakerCore surplus buffer. A ProtectorDAO’s surplus buffer (Junior Tranche) which can be clawed back by Maker Core. A module that interfaces with DSS Kiln which sells mDAO Treasury Account funds for DAI to fill up the metaDAO’s surplus buffer. mDAO token factory  In general, the DAO needs to coordinate pretty well moving forward to execute the first metaDAOs nicely from a technical and operational point of view. 1 mistake and all credibility is gone. If these MIPs get voted in, the DVCs should help coordinate the beginnings of this transition. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5773809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/09/2022-19:08:57",
                    "content": "    LongForWisdom:  45000 of annual   45000 MKR… small correction here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/12/2022-01:09:22",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-v3-metadaos-lod-summary/17621",
            "title": "Endgame V3 - MetaDAOs - LOD Summary ",
            "index": 17621,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "endgame",
                "endgame-v3",
                "lod-summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "3",
                    "time": "02/09/2022-13:55:56",
                    "content": " Summaries reflect my own work and have not been reviewed by Rune. Any mistakes are mine. They are based on the written posts in this forum from Rune. I do not regularly attend Endgame meetings.  Levels of Detail This summary is organized into sections summarizing the same information in different levels of detail.  LOD0 represents the most-simplified and abstracted version of this concept LOD1 is more complex and more accurate. LOD2 is a direct summary of Rune’s post. Runes post could be considered LOD3, with the highest level of detail and explanation.  Lower numbers = Easier to grasp and understand. Higher numbers = More complex but more accurate.     Level of Detail - 0 Overview   What is a MetaDAO?  Sub/child DAOs that are aligned to Maker. Unique communities. Have their own token.    Why MetaDAOs?  Reduce MakerCore complexity Increase resiliency Increase output    All MetaDAOs…  … operate frontends that provide access to:  MakerCore governance MetaDAO governance MakerCore vaults Token farming opportunities   … run their own internal governance processes. … incubate and develop their own unique communities.    Three classes of MetaDAO   Governor MetaDAOs  Organize the Decentralized Workforce Enchance governance participation.    Creator MetaDAOs  Grow and innovate in the Maker and crypto ecosystems. Part-ownership of decentralized Maker Vaults. Can choose a home base on an L2.    Protector MetaDAOs  Allocate collateral to real world assets. Protect Maker against physical and legal threats Part-ownership of RWA Maker Vaults.    MetaDAO Workforce  Administration Teams  Interface with MetaDAO governance, make proposals, receive budgets and governance fast-track privileges. Community interaction and management. Work on whats needed as necessary. All Receive MetaDAO tokens.   Contribution Teams  Specialist teams that are funded by Administration Teams. More specialized work. All receive MetaDAO tokens.   Ecosystem Actors  Not connected to any MetaDAO. Usually highly specialized Service multiple MetaDAOs and MakerCore. Paid by Admin or Contribution Teams.    Launching MetaDAOs  Initial Set  Carefully prepared with complete high quality groups for each of them so that they can all hit the ground running.  Creators that will onboard developers and build frontend products and on-chain features.  Protectors that will adopt existing Arranger RWA Vaults, and build redundant, lean deal teams to underwite future arrangers and scale up Cashlike and Clean Money RWA when required.  Governors that will onboard all the existing Maker Core Units and establish Councils and Tribunals for the most critical Scopes in the short term.   Subsequently  Additional MetaDAOs will begin to be incubated through an autonomous smart contract system. No humans involved in the incubation of new MetaDAOs.       LOD1  Level of Detail - 1  Overview What is a MetaDAO?  Sub/child DAOs that is aligned to Maker but is able to seek profit and compete with other MetaDAOs. Provide space for decentralized, unique and specialized communities to develop. Relies on MakerCore for arbitration and governance security. There are three classes of MetaDAO: Governor, Creator, Protector. Has its own token.  Why MetaDAOs?  Segregate complexity from MakerCore. Increase resiliency through competition and redundancy. Increase output through parallelization.  What do all MetaDAOs do?  Operate frontends that provide access to:  MakerCore governance MetaDAO governance MakerCore vaults Token farming opportunities   Run their own internal governance processes. Incubate and develop their own unique communities.   GovernorDAOs  Responsible for organizing the Decentralized Workforce of Maker Core. Enhance governance participation and function of the Maker ecosystem. Operate Councils, Core Units and Tribunals based on the Results Guarantee system.  Results Guarantee System  Giving Governors additional fees on top of the base budgets that are paid to the Decentralized Workforce. Can be withheld if results not delivered. Transfers risk from MakerCore to GovernorDAOs.  Focus Scopes  Decentralized Workforce and Maker Governance Process is divided into focus areas called Scopes. Primary Scopes each have…  Single Council Multiple Core Units   Supporting Scopes each have…  Single Tribunal    Councils  Determines what should be done in a scope, and how success should be measured in a MIP known as a Scope Framework. Decentralized Workforce within that Scope must adhere to this.  Core Units  Top-level operational units in the decentralized workforce. Each Governor may operate a Core Unit within each Scope. Core Units work as RFP/outsourcing hubs and control the budgets allocated to each Scope. MetaDAOs and Ecosystem Actors compete to carry out the work under the supervision of the Core Unit.  Tribunals  Supporting Scopes are coordinated by Tribunals.  Combines the role of Council and Core Unit.   All Governors participate in all Tribunals.   CreatorDAOs  Focus on growth and innovation in the Maker and crypto ecosystems. Most open ended of the MetaDAO classes. Unique interactions with MakerCore include  Vault Adoption of decentralized Vaults Home Base benefits on a chosen L2.   Well suited to complete MakerCore tasks related to technological development and web3 marketing.  Decentralized Vault Adoption  Creators can “adopt” existing or new vault types that exist in the Maker Protocol. MakerCore sets rules, CreatorDAO chooses vaults that meet those rules. Adopted Vaults pay some of their stability fee to the CreatorDAO. CreatorDAO takes first losses on liquidation / issues.  Home base  Creators choose an L2 or shard with an active Maker Vault Engine to be their home base. The Creator receives a 1% revenue share of all net stability fee income from that Vault Engine.   Protectors  Allocate collateral to real world assets. Protect Maker against physical and legal threats to its RWA collateral. Unique interactions with MakerCore include  RWA Vault Adoption Phoenix Staking.   Protectors are positioned to execute on projects related to the real world in some way.  RWA Vault Adoption  Protectors can adopt Cashlike RWA Collateral and Clean Money RWA vaults. Return is split between MakerCore and the ProtectorDAO. The Protector takes first loss with all of its assets. Protector is responsible for paying all expenses related to the Adopted Vaults.  Phoenix Staking  Smart contract that gives ETH staking reward and risk premium on deposited ETH.  ETH is used to take first loss if there are RWA losses from Vault Adoption alongside the Protectors own reserves.   If the Maker Protocol is forced to rapidly exit all of its RWA exposure, all the Phoenix Staked ETH is paid out to Maker Core. Protectors pay 20% of their surplus to fund the Phoenix Staking Risk Premium. Protectors must offer this once the technology has been developed.   Initial Clustering  MetaDAO Governance is determined by token holders that are unknown until the MetaDAO genesis distribution begins. Prospective MetaDAO teams “cluster” in advance of the launch of the MetaDAO.  Preparing proposals Interacting with people considering farming MetaDAO tokens Build support for future proposals.   This process is crucial in shaping the MetaDAO Goal is to quickly stabilize the MetaDAO following launch and onboard clusters that are fully compatible with its aims and culture.   MetaDAO Workforce  Internal workforce of a MetaDAO is split into teams.  Maximum team size of 7 people per team. MetaDAO cannot be created with pre-existing teams.   Two types of teams: Administration Teams and Contribution Teams.  Administration Teams  Administration Teams interface with MetaDAO governance, make proposals, receive budgets and governance fast-track privileges. Led by one or more Facilitators operating in consensus. Due to the small scale and flexible nature of MetaDAOs, their role includes community interaction and management, and taking care of gaps or opportunities. Initially MetaDAOs will likely be run by a single general purpose Administration Team but can scale to multiple. All members receive MetaDAO tokens.  Contribution Teams  Specialist teams that are funded by Administration Teams. Less exposure to MetaDAO Governance. Focus on more specialized work, such as development, risk or marketing. Teams can work where they produce the most value, rather than just where they are onboarded. Can work for…  their MetaDAO directly external customers other MetaDAOs Maker Core   All members receive MetaDAO tokens.  Ecosystem Actors  Any kind of company, person, entity or DAO that is doing business with the MetaDAO, and isn’t an Administration Team or Contribution Team. Usually highly specialized, and offer their services to multiple or all MetaDAOs, and often also Maker Core. Ecosystem Actors are paid either by an Administration Team or a Contribution Team.  Arrangers  An Ecosystem Actor that allocates RWA collateral for Protectors. May only interact with a single Protector Risk concentration is limited by scope framework.  Plug and Play Protocols  Open source protocol features that are able to charge a fee of some sort for usage, and are easily available for MetaDAOs to integrate into their decentralized frontends. All fees earned by the MetaDAO from integrating the Plug and Play Protocol are then split with the Ecosystem Actor and sent to their payment address on a recurring basis.  Enforced by MakerCore Governance.     Launching MetaDAOs Initial Set  Main event of the Endgame Plan launch is the of the initial MetaDAOs. Carefully prepared with complete, high quality clusters for each of them so that they can all hit the ground running.  Creators that will onboard developers and build frontend products and on-chain features. Protectors that will adopt existing Arranger RWA Vaults, and build redundant, lean deal teams to underwite future arrangers and scale up Cashlike and Clean Money RWA when required. Governors that will onboard all the existing Maker Core Units and establish Councils and Tribunals for the most critical Scopes in the short term.    Subsequently  Additional MetaDAOs will begin to be incubated through an autonomous smart contract system. No humans involved in the incubation of new MetaDAOs. Clustering to these MetaDAOs occur with less organization and more competition.      LOD2  Level of Detail - 2  Role of MetaDAOs  Core value propositions…  Segregate, derisk and parallelize Makers highly complex governance processes. Blank slates with resources and processes already in place for a new community and workforce to pursue opportunities in the blockchain ecosystem.   Key is that each MetaDAO is well positioned to develop a new community with a unique, self-aware meta.  Creates a higher likelihood that some of them will be able to achieve strong meta and viral growth with minimal corruption and free rider problems.   MetaDAOs run their governance processes on top of the Maker Core governance infrastructure.  Control of MetaDAO owned protocols and treasury is held by MKR voters. In practice controlled by MetaDAO voters through signal polls that are included in Maker Executive Votes. MetaDAOs can have fully decentralized token distribution from genesis without being vulnerable to governance attacks. Can take more risks that can have unknown impacts on their meta, because the Maker Governance process can always act as an “appeals court.     MetaDAO Frontends  Central to the fundamental value of all MetaDAOs are their MetaDAO frontend.  Primary place for a MetaDAO to express its brand and meta in order to connect with new users and community members.   All have the same base features. Different MetaDAO classes will focus on different features. Initially relatively simple with features copied from other products. Medium term all MetaDAO frontends are fully decentralized and provide redundant options for financial security, financial resilience and financial privacy easily accessible to regular people.   Maker Vaults, revenue share and farming  Main product available on all frontends are Maker Vaults, especially ETHD with active MetaDAO yield farming. MetaDAOs earn 25% of all net stability fees generated from Vaults managed through their frontend. MetaDAO farming allows the MetaDAO to promote farming and holding their own governance token, helping them to expand their community and strengthen their meta. Especially important for Creator class MetaDAOs (see below). Dai farming is also a key feature in the frontends.   Governance Interface  MetaDAOs also run governance interfaces in their frontends.  Internal governance for MetaDAO. Complete end-to-end governance for Maker Core.   Provides easy access to MKR faming of MetaDAO tokens. This diversifies access points to Maker Governance. Focus for Governor MetaDAOs (see below).   Classes  Three classes of MetaDAOs.  Governors, Creators and Protectors. Class determines how it interacts with Maker Core. Otherwise all classes free to do whatever.     Governors  Responsible for organizing the Decentralized Workforce of Maker Core. Enhance governance participation and function of the Maker ecosystem. Operate Councils, Core Units and Tribunals based on the Results Guarantee system.   Results Guarantee System  Works by giving the Governors additional overhead fees on top of the base budgets that are paid to the Decentralized Workforce. In return the Governor can be held accountable for issues that occur.  Transfers the operational risk of running the Decentralized Workforce from Maker Core to the Governors.     Short Deviation into Scopes  Decentralized Workforce and Maker Governance Process is broadly divided into 11 focus areas known as Scopes.  4 Primary Scopes each have…  Single Council Multiple Core Units   7 Supporting Scopes each have…  Single Tribunal     Explained more later.   Councils  Advise Maker Governance on how to best design the transparent, open source Scope Frameworks  Rest of the Decentralized Workforce within that Scope must adhere to this. Also defines KPIs for workforce in that scope.   No operational role No governance privileges or budget responsibility beyond working on the Scope Frameworks.   Core Units  Top-level operational units in the decentralized workforce. Main function is to control the budgets allocated to each Scope Access governance fast track for proposals directly related to their Scope. Each Governor can operate a Core Unit within each Scope.  A Scope can have more than one Governor operating a Core Unit. Creates internal redundancy and parallelization in the workforce.   Core Units work as RFP/outsourcing hubs - no heavy lifting. Specialize in creating public bidding processes for projects defined by the Scope Map for their particular Scope. MetaDAOs and Ecosystem Actors compete to carry out the work under the supervision of the Core Unit, using its budget and governance privileges to execute the work.   Tribunals  Supporting Scopes (usually smaller) are coordinated by Tribunals. Combines the role of Council and Core Unit. All Governors participate in all Tribunals.  Shared responsibility for proposing changes to the Scope Framework and controlling a single, shared budget.     Creators  Focus on growth and innovation in the Maker ecosystem and the fully decentralized, deep crypto ecosystem. Most open ended of the MetaDAO classes in terms of which direction they can take.  Focus is raw innovation and experimentation, both with technology but also with branding and meta development.   Unique interactions with Maker include Vault Adoption of decentralized Vaults and receiving special “home base” benefits on a specific L2s. Creators are particularly well suited to complete MakerCore tasks related to technological development and web3 marketing.   Decentralized Vault Adoption  Creators can “adopt” existing or new vault types on the Maker Protocols Vault Engine. Vault Adoption requires that Maker Governance gives the Creator a Vault Adoption Debt Ceiling, and a Vault Adoption Cost of Capital via MIP. Creator chooses vaults to adopt using internal governance processes. Adopted Vaults behave differently than normal Vaults.  Only pay part of the stability fee to Maker Core, defined by the Vault Adoption Cost of Capital. If they have issues with liquidations or otherwise cause losses, the Creator takes first loss on all downside.   Longer term, adopted vaults are replaced with MetaDAO Lending Engines   Home base  Creators choose a Home Base, which is an L2 or shard with an active Maker Vault Engine. The Creator receives a 1% revenue share of all net stability fee income from that Vault Engine.  This incentivizes the Creator to participate and develop the adoption and integration of the Maker Protocol on the shard. Gives Maker Core a way to directly engage with specific L2s and Shards in a parallelized and decentralized manner.     Protectors  Focused on intermediating Maker Cores interaction with the physical world. Primary focus is to allocate collateral to real world assets Also have responsibility for protecting Maker against physical and legal threats to its RWA collateral. Unique interactions with Maker Core include RWA Vault Adoption and Phoenix Staking. Protectors are well positioned to use their internal workforce resources to execute on projects related to the real world in some way: like marketing / legal work   RWA Vault Adoption  Protectors can obtain a Vault Adoption MIP that provides them with a Vault Adoption Debt Ceiling and a Vault Adoption Cost of Capital. Protectors can only adopt RWA Vaults that either conform to the Cashlike RWA Collateral standard or the Clean Money RWA Collateral standard. Protector can use its internal governance to allocate up to its Vault Adoption Debt Ceiling to its Arrangers.  Return is split between Maker, which earns the Vault Adoption Cost of Capital, and the Protector, which earns anything in excess of that.   The Protector takes first loss with all of its assets. Protector is responsible for paying all expenses related to the Adopted Vaults. Protectors have two distinct Vault Adoption MIPs, one governing their Cashlike RWA collateral, and one governing their Clean Money RWA collateral. Cashlike RWA Collateral can have an effectively unlimited debt ceiling as long as there is excess Cashlike Collateral that must be reallocated according to the RWA Collateral Scope Framework. Clean Money RWA Collateral requires two layers of Junior Capital in order to scale up its debt ceiling, both at the Arranger level and also at the MetaDAO level.   Phoenix Staking  Unique feature that all Protectors must offer once the technology has been developed. Enables users to deposit ETH into a smart contract, where the ETH then both earns staking yield, and on top of that also earns an additional risk premium. The ETH is then used to take first loss if there are RWA losses from Vault Adoption by the Protector, 50/50 alongside the Protectors own reserves. If the Maker Protocol is forced to rapidly exit all of its RWA exposure (An uprooting event when entering Phoenix Stance) due to a severe external threat, all the Phoenix Staked ETH is paid out to Maker Core. Protectors pay 20% of their surplus to fund the Phoenix Staking Risk Premium.   MetaDAO Clustering + Workforce   MetaDAOs have an internal governance process with token voting and delegation which is coordinated through forum and discord discussions.  The most important thing that MetaDAO governance must deal with is onboarding and managing their internal workforce.    Internal workforce of a MetaDAO is split into teams.  Teams must not become black boxes.  Maximum team size of 7 people per team.      MetaDAO cannot be created with pre-existing teams.  Governance is determined by token holders that are unknown until the MetaDAO genesis distribution begins. Instead prospective MetaDAO teams “cluster” in advance of the launch of the MetaDAO. Clustering means preparing proposals and interacting with people considering farming MetaDAO tokens in order to build support for the future proposals.    The clustering process and pre-launch community interaction plays a crucial part in shaping the meta of the future MetaDAO.  The community impacts which teams want to cluster to the future MetaDAO The teams that are clustering to a future MetaDAO also impacts which people will want to farm the tokens of the future MetaDAO. The goal is that the MetaDAO can stabilize its meta quickly following launch, and onboard clusters that are fully compatible and positively contribute to the stabilized meta.    Two types of teams: Administration Teams and Contribution Teams.    Administration Teams  Administration Teams directly interface with MetaDAO governance, make proposals, receive budgets and governance fast-track privileges. An Administration Team is led by one or more Facilitators, who use their governance privileges and budget powers through consensus. Administration Teams are comparable to the Facilitator role of Core Units  Also comparable to Governance Facilitators as a part of their job is to run the core governance processes of the MetaDAO. Due to the small scale and flexible nature of MetaDAOs, their role includes community interaction and management, and taking care of gaps or opportunities.   Initially MetaDAOs will likely be run by a single general purpose Administration Team.  As a MetaDAO scales it switches to having multiple Administration Teams that can specialize within different areas of responsibility.   All members of Administration Teams receive MetaDAO tokens from the MetaDAO Internal Workforce Bonus Pool.   Contribution Teams  Specialist teams that are funded by Administration Teams.  Less exposure to the MetaDAO Governance and don’t make proposals or have governance fast-track privileges.   Focus on more specialized work, such as development, risk or marketing, depending on the class and priorities of the MetaDAO. Can both work to build and improve the MetaDAO, or the MetaDAO can provide the services of their Contribution Teams to external customers, other MetaDAOs or Maker Core for a fee. The fluidity of Contribution Teams helps increase efficiency of the overall Maker Ecosystem as it means people can work where they produce the most value, rather than just where they are onboarded. All members of Contribution Teams receive MetaDAO tokens from the MetaDAO Internal Workforce Bonus Pool  Main characteristic that distinguishes whether something is a Contribution Team or just an ecosystem company.     Ecosystem Actors  Any kind of company, person, entity or DAO that is doing business with the MetaDAO, and isn’t an Administration Team or Contribution Team. A key resource of MetaDAOs comes from interfacing with Ecosystem Actors. Usually highly specialized, and offer their services to multiple or all MetaDAOs, and often also Maker Core. Most common relationship is simple contracting based on a statement of work or an hourly rate.  More advanced and experimental relationships can also be explored.   Ecosystem Actors are paid either by an Administration Team or a Contribution Team from the MetaDAO Internal Workforce.   Arrangers  Specific type of Ecosystem Actor that allocates RWA collateral for Protectors. The intermediary between the decentralized world of DeFi and MetaDAOs, and the traditional financial and legal systems. May only interact with a single Protector The RWA Collateral Scope Framework regulates how much risk concentration a MetaDAO can have to a single Arranger. Can provide both Cashlike Collateral and Clean Money Collateral, and a single Arranger can also have more than one Asset Manager that allocates the underlying capital in the real world financial system.  Clean Money RWA Asset Managers must always have Junior Capital available at the Asset Manager level, based on requirements specificied in the RWA Collateral Scope Framework.     Plug and Play Protocols  Advanced and unique opportunity for Ecosystem Actors is to develop Plug and Play Protocols. Open source protocol features that are able to charge a fee of some sort for usage, and are easily available for MetaDAOs to integrate into their decentralized frontends. Revenue share percentage and minimum fee parameters specified, and a payment address in source code. All fees earned by the MetaDAO from integrating the Plug and Play Protocol are then split with the Ecosystem Actor and sent to their payment address on a recurring basis.  Enforced by Maker Governance, which will penalize the MetaDAO if it fails to properly account for and pay out the revenue share it owes. This creates the conditions for a sandbox of innovation where open source developers can monetize their code without worrying about trade secrets or IP rights.   All MetaDAOs can take advantage of Plug and Play Protocols, but Creators are particularly well suited to experiment with their technology.   7 Launch MetaDAOs  Main event of the Endgame Plan launch is the simultaneous or sequential launch of 6 new MetaDAOs (depending on logistics and pragmatic considerations). Carefully prepared with complete, high quality clusters for each of them so that they can all hit the ground running.  Alongside this, 7 separate forums and discord channels will allow a community and unique meta to emerge, and allow the clusters to connect to the community.   3 Creators, that will onboard developers and build frontend products and on-chain features 2 Protectors that will adopt existing Arranger RWA Vaults, and build redundant, lean deal teams to underwite future arrangers and scale up Cashlike and Clean Money RWA when required 2 Governors that will onboard all the existing Maker Core Units and establish Councils and Tribunals for the most critical Scopes in the short term.   Long Term  After launch, additional MetaDAOs will begin to be incubated through an autonomous smart contract system. No humans involved in the incubation of new MetaDAOs - everything is automated via a smart contract system called the Incubator. Clustering to these MetaDAOs occur with less organization and more competition than the 7 Launch MetaDAOs. Cooldown period will prevent MetaDAOs from onboarding Administration Teams until at least 3 months (exact TBD).  Allows the meta of the new MetaDAO to settle before votes occur.     ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/15"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.580024106845535
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/12/2022-19:56:23",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1674"
}