{
    "poll_list": [
        {
            "title": "Launch Maker Wormhole With Optimism and Arbitrum Domains - April 4, 2022",
            "index": "14209",
            "option": "Yes",
            "supporting_mkr": "85,509",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/request-to-poll-for-maker-wormhole-deployment-and-associated-risk-parameters/14209",
            "title": "Request to Poll for Maker Wormhole Deployment and Associated Risk Parameters ",
            "index": 14209,
            "category": [
                "Governance"
            ],
            "tags": [
                "layer-2",
                "pe-001",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "12",
                    "time": "25/03/2022-06:06:52",
                    "content": " Request to Poll for Maker Wormhole Deployment and Associated Risk Parameters In support of MIP69: L2 to L1 Fast Withdrawals, Protocol Engineering is requesting to poll on the following parameters as part of the weekly governance cycle, which if successful will allow this to proceed to an on-chain vote. The reason for introducing this poll while the MIP is still in RFC is that the technical work has been underway for sometime and is known by the community but requires a formal poll to proceed with the defined risk parameters. Completing this formality now will enable Maker to vote on the deployment once it is ready, for which we are targeting mid-April.  Parameter Summary Protocol Engineering is requesting Governance to poll on approving L2 to L1 Fast Withdrawals, including: Approve the following gateways (domains), as documented in MIP69 and the github implementation:  Optimism Arbitrum  Debt Ceiling Parameters:  Set the Optimism Debt Ceiling parameter to 1M Dai Set the Arbitrum Debt Ceiling parameter to 1M Dai Set the Global Debt Ceiling to 2M Dai - as a sum of all debt ceilings for each domain.  Wormhole Fee Parameters per Domain:  Set the Arbitrum Wormhole Fee parameter to 0 Set the Optimism Wormhole Fee parameter to 0  Approve Oracle Quorum of (13) feeds  This is the minimum number of feed attestations required to complete a Fast Withdrawal transaction and will be comprised of any of the 25 oracle feeds provided by the Oracles team.   Details:  A conservative 1M Dai debt ceiling for both domains has been applied. This has been chosen to limit Fast Withdrawal risk and will be considered for increase once the Wormhole has been upgraded to support oracle hard confirmations and the market has shown demand for greater usage. The current implementation is based on oracle soft confirmations requiring complete trust in the sequencer to include confirmed transactions that burn DAI. The wormhole fee is an absolute amount and is levied per domain. This could be upgraded in the future if the need arises. This fee is only applied to fast withdrawals. The slow withdrawals bridge, which requires a 7 day wait will continue to function without fees even if fees are introduced for Fast Withdrawals.  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip69-l2-to-l1-fast-withdrawals/14041",
                        "https://github.com/makerdao/dss-wormhole#readme",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/49",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-marzo-4-de-abril-de-2022/14495",
                        "https://forum.makerdao.com/t/pecu-month-in-review-march-2022/14493",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/33",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366/64",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-4-de-abril-de-2022/14480",
                        "https://forum.makerdao.com/t/weekly-relay-march-28-april-4-2022/14450",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-24-30-2022/14332",
                        "https://forum.makerdao.com/t/ruta-de-layer-2-historia-y-futuro-traduccion/17387",
                        "https://forum.makerdao.com/t/layer-2-roadmap-history-and-future/17310"
                    ],
                    "GPT-summary": "The post is a request from Protocol Engineering to poll on certain parameters related to the deployment of Maker Wormhole. The proposal is to approve L2 to L1 Fast Withdrawals, set debt ceiling parameters, set wormhole fee parameters per domain, and approve Oracle Quorum of feeds. The post explains the reasoning behind the proposal and provides details on the parameters. The post also mentions that the proposal is still in RFC and requires a formal poll to proceed with the defined risk parameters.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.643115942028985
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "25/03/2022-14:50:36",
                    "content": "We’ll be pushing the on-chain poll back one week to April 4th to confirm some details about the Oracle setup. This shouldn’t negatively affect the timeline for mid-April deployment. Appreciate the patience everyone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/marcandu",
                    "index": "#3",
                    "likes": "2",
                    "time": "25/03/2022-14:53:12",
                    "content": "Regarding the “Approve Oracle Feeds”, there are actually two distinct parameters to approve:  Use the existing oracle feed list as signers for the wormhole (i.e. the 25 oracle feed currently used for price feed) Set the quorum (i.e. the minimum number of signed attestations to complete a fast withdrawal)  You can picture the quorum as the number of oracle feed that need to be compromised (or decide to outright collude) to be able to steal an amount of Dai equivalent to the total Wormhole Debt Ceiling (2M). Even with a relatively small debt ceiling like proposed, a quorum as small as 3 or 5 present a certain level of risk that I’m not comfortable with. For reference, for the MCD price oracles, we use a quorum of 13, and we still use the Oracle Security Module to protect from oracle attacks. Overall our oracle feeds have a long history of reliability and honesty (some have been with us for 5 years), but we need to be extremely careful when giving more trust to a small subset of that group. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.2100840336134455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#4",
                    "likes": "2",
                    "time": "25/03/2022-18:49:54",
                    "content": "Thank you @marcandu and @LongForWisdom . Based on your input I have clarified the quorum language for us to revisit with an absolute amount when this request is ready to go to a poll. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#5",
                    "likes": "3",
                    "time": "01/04/2022-13:16:13",
                    "content": "Updated with a quorum of 13 (out of the existing 25 maker feeds) for launch. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "01/07/2022-19:16:47",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "867"
}